{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-next-global-hotspot-luxury-real-estate-investment-2834387-2025-12-11",
      "headline": "Why India is the next global hotspot for luxury real estate investmentThe profile of the Indian homebuyer is changing in ways that directly favour the luxury segment. Millennials, who grew up with global exposure, digital access, and rising professional mobility, prefer premium homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meesho-surges-over-50-on-listing-day-what-investors-should-watch-out-for-next-2834365-2025-12-11",
      "headline": "Meesho's stellar debut has Dalal Street abuzz. What should investors watch next?A 50 percent listing pop has put Meesho in the spotlight, yet the real question now is whether its cost edge and logistics scale can hold as the value-ecommerce battle intensifies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-cut-how-the-move-shapes-global-markets-and-india-2834337-2025-12-11",
      "headline": "US Fed rate cut: How the move shapes global markets and IndiaThe Fed's third rate cut steadies some nerves and tests others, raising fresh questions on growth, liquidity and currency pressures, but what do these shifting global cues ultimately mean for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-tech-microsoft-intel-google-amazon-billions-investment-india-ai-trump-snub-2834269-2025-12-11",
      "headline": "India's big AI moment as Big Tech gives big snub to TrumpOver the last few weeks, tech giants like Microsoft and Amazon have pledged investments of more than $68 billion (about Rs 6.12 lakh crore), mostly in AI. It is hardly the picture of a 'dead economy' that Trump painted as Big Tech doubles down on India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eggoz-cancer-causing-eggs-social-media-heat-lab-test-report-fssai-nitrofuran-level-2834280-2025-12-11",
      "headline": "Eggoz faces social media heat over viral cancer claims: All you need to knowEggoz Nutrition, a brand that has built its reputation on selling fresh, chemical-free eggs, found itself at the centre of a storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/silver-price-rs-2-lakh-mark-december-gold-what-to-expect-2834278-2025-12-11",
      "headline": "Silver shines brighter than gold: Is the Rs 2 lakh mark now within reach?Silver prices have already scaled fresh highs around Rs 1.93 lakh, supported by surging industrial demand, a softer dollar and a wave of technical breakouts that analysts say could push the metal higher in the coming sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-delays-ais-mismatches-stricter-cpc-screening-2834245-2025-12-11",
      "headline": "ITR refunds running late? Here's why many taxpayers are waiting longer this yearTaxpayers have reported delays in receiving income tax refunds, with many cases marked as 'under processing' for months. Experts say stricter scrutiny, data mismatches, and a heavy processing backlog are the main factors behind the slowdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-edge-higher-as-markets-react-to-us-fed-rate-cut-2834233-2025-12-11",
      "headline": "Sensex, Nifty edge higher as markets react to US Fed rate cutBenchmark indices in India showed modest gains following the US Federal Reserve's third rate cut of the year. Analysts recommend caution despite easing volatility, citing both global and technical factors that could impact market direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-where-to-invest-large-vs-mid-vs-small-cap-hdfc-securities-md-ceo-dheeraj-relli-2834222-2025-12-11",
      "headline": "Large vs mid vs small cap: What makes sense for your money in a falling marketExperts expect small-cap and mid-cap stocks to outperform as the broader market stabilises. Since most retail investors hold a larger share of their portfolios in these two categories, any rebound is likely to directly benefit them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-ceo-lip-bu-tan-internal-deals-corruption-personal-wealth-growth-report-rivos-ai-chips-2834208-2025-12-11",
      "headline": "Intel's deals helped boost CEO Lip-Bu Tan's personal fortune, says reportThe report detailed how Tan's dual roles as Intel's CEO and a venture capitalist have led to potential conflicts of interest involving several of his portfolio companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-trade-deal-offer-best-ever-tough-nut-to-crack-us-representative-talks-negotiations-agriculture-dairy-2834197-2025-12-11",
      "headline": "India offering best-ever trade deal, but tough nut to crack: US officialThe US and India have opened critical trade talks in New Delhi, with India presenting its best market access offer yet, according to US Trade Representative Jamieson Greer. The discussions aim to resolve tariff disputes and firm up a trade deal between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-cuts-interest-rate-third-time-signals-pause-glbs-2834156-2025-12-11",
      "headline": "US Fed cuts rates for third time in a row: What it means for your moneyThe US Federal Reserve reduced its key interest rate for the third time in a row on Wednesday. It also signalled that it may leave rates unchanged in the coming months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reforms-and-young-talent-are-powering-indias-growth-say-experts-2834027-2025-12-10",
      "headline": "Reforms and young talent are powering India's growth, say expertsThe country's strong GDP growth and controlled inflation are \"great reasons to rejoice\", adding that robust macro factors are also helping stabilise labour markets and household well-being, said the expert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-admits-compliance-culture-needs-overhaul-after-flying-airbus-without-permit-2833927-2025-12-10",
      "headline": "Air India admits compliance culture needs overhaul after flying Airbus without permitAir India last week called the Airbus November incident \"regrettable\" and said that some people had been suspended, while India's civil aviation watchdog DGCA ordered the aircraft to be grounded and called for an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-fall-how-to-invest-sips-right-time-to-buy-dip-entry-for-long-term-investors-2833893-2025-12-10",
      "headline": "Markets trade in red: Is this the right entry point for long-term investors?India's stock market has been one of the weakest performers globally in 2025 so far. The Sensex has delivered just 1.9% returns, making it the worst performer among 17 major global indices, while the Nifty 50 has risen only 3.2%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-275-points-lower-nifty-below-25800-eternal-down-3-percent-2833828-2025-12-10",
      "headline": "Sensex closes 275 points lower, Nifty below 25,800; Eternal down 3%The S&P BSE Sensex lost 275.01 points to close at 84,391.27, while the NSE Nifty50 was down by 81.65 points to end at 25,758.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-trade-talks-progress-resolve-tariffs-boost-exports-2833810-2025-12-10",
      "headline": "US delegation in Delhi, trade pact talks making headway: Piyush GoyalCommerce Minister Piyush Goyal announced steady progress in India-US trade talks with the US team visiting New Delhi. The agreement aims to resolve tariff disputes and significantly expand bilateral trade by 2030."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-are-young-millennials-leaving-cities-and-better-pay-2833782-2025-12-10",
      "headline": "Why are young millennials leaving cities and better pay?If cities offer better pay and faster growth, why are so many young millennials moving out? What's making suburban living more appealing than the urban hustle? Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-ais-mismatches-to-capital-gains-confusion-biggest-tax-mistakes-of-2025-and-how-to-fix-them-2833728-2025-12-10",
      "headline": "From AIS mismatches to capital gains confusion: Biggest tax mistakes of 2025With more Indians juggling salary, digital earnings, investments and gig income, tax filings in 2025 saw a jump in errors. The biggest trouble areas were AIS mismatches and confusion around capital gains, leading to incorrect returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/amazon-bets-big-on-india-with-35-billion-investment-5-things-to-know-2833724-2025-12-10",
      "headline": "Amazon bets big on India with $35 billion investment: 5 things to knowBy 2030, Amazon plans to create an additional 3.8 million direct, indirect, induced and seasonal jobs in India. These roles are expected to come from the expansion of its core businesses and the rapid scaling of its fulfilment and last-mile delivery network."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-songs-what-is-9-doing-in-fa9la-dhuarndhar-runaway-hit-song-sher-e-baloch-rehman-dakait-akshaye-khanna-entry-2834393-2025-12-11",
      "headline": "What's 9 doing in FA9LA, Dhuarndhar's runaway hit song Sher-e-Baloch? The FA9LA isn't a typo or a catchy title. The 9 replaces an Arabic letter for a strong \"s\" sound, a trend from Arabizi, the Arabic chat alphabet. In Bahraini slang means fun or party. So, the viral Dhurandhar anthem, FA9LA, which has now become a social media sensation, reads as FASLA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ikkis-director-recalls-dharmendra-unbelievable-dedication-despite-health-issues-2834392-2025-12-11",
      "headline": "Ikkis director recalls Dharmendra's unbelievable dedication despite health issues Sriram Raghavan shares insights into working with late actor Dharmendra on the war drama Ikkis, highlighting the actor's commitment and preparation despite health struggles before his death in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-ssunita-breaks-down-recalling-loss-of-her-three-month-old-daughter-2834366-2025-12-11",
      "headline": "Govinda's wife Ssunita breaks down recalling loss of her three-month-old daughter Ssunita Ahuja reflects on her personal loss, sharing details of her experience after losing her prematurely born daughter. She also spoke about the difficulties she faced and how the event affected her family life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-this-week-single-papa-emily-in-paris-5-man-vs-baby-and-more-2834383-2025-12-11",
      "headline": "Netflix this week: Single Papa, Emily in Paris 5, Man vs Baby and more Netflix is rounding off the year with a diverse mix of new dramas, thrillers, comedies and returning favourites, offering something for every kind of viewer. From Single Papa and Emily in Paris 5 to gripping mysteries like City of Shadows and Knives Out, this week's lineup promises non-stop entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-cameo-dileep-film-backlash-2017-assault-case-acquittal-2834308-2025-12-11",
      "headline": "Explained: Why Mohanlal is under fire for his cameo in acquitted Dileep's film Malayalam superstar Mohanlal faces criticism for his cameo in Dileep's film shortly after the actor's acquittal in a 2017 assault case. The controversy highlights divided public opinion and ongoing debates about justice and accountability in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/120-bahadur-flops-dhurandhar-soars-a-lesson-in-patriotism-psychology-2834357-2025-12-11",
      "headline": "120 Bahadur flops, Dhurandhar soars: A lesson in patriotism psychology Two films, worlds apart in box office fate, highlight India's patriotism divide: audiences crave cathartic dominance over painful remembrance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jungkook-rm-ramen-bts-pre-comeback-chaos-army-knows-all-too-well-2834358-2025-12-11",
      "headline": "Jungkook, RM & Ramen: BTS' pre-comeback chaos ARMY knows all too well | Timeline BTS found themselves at the centre of intense discussion this week as RM's emotional livestream, apology letter, and a late-night ramen moment with Jungkook collided with ongoing dating rumours. With just three months before their full-group comeback, even small interactions are reshaping fan conversations and global speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-evolving-career-insights-motherhood-journey-red-sea-film-festival-2834309-2025-12-11",
      "headline": "Here's what Alia Bhatt told a Pakistani fan asking if she'd visit the country Bollywood actor Alia Bhatt discussed her evolving perspectives on life, work, and fame at the Red Sea International Film Festival, responding to a Pakistani fan and sharing insights about her daughter, career pressures, and authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-rejects-marriage-old-video-goes-viral-amid-dhurandhar-success-2834354-2025-12-11",
      "headline": "Akshaye Khanna rejects marriage, old video goes viral amid Dhurandhar success Akshaye Khanna's old interview on choosing to stay happily unmarried is going viral amid the soaring success of Dhurandhar. In the clip, he explains why he prefers a carefree life without marriage or responsibilities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/after-jaya-bachchan-jibe-on-paparazzi-shatrughan-sinha-praises-their-style-2834303-2025-12-11",
      "headline": "After Jaya Bachchan's jibe on paparazzi, Shatrughan Sinha praises their style Veteran actor Shatrughan Sinha praised photographers' appearance at a Mumbai gathering, days after Jaya Bachchan's comments on paparazzi dress triggered debate. He was joined by Poonam Dhillon at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-praises-dhurandhar-storytelling-performances-critiques-political-themes-2834332-2025-12-11",
      "headline": "Hrithik doubles down on Dhurandhar praise after disagreeing with its politics Hrithik Roshan has shared his admiration for the film Dhurandhar on social media, noting the film's impressive storytelling and performances, even as he voiced disagreements with its political undertones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-re-release-rajinikanth-birthday-iconic-tamil-blockbuster-theatres-2834335-2025-12-11",
      "headline": "Why Rajinikanth refused to sell digital rights of Padayappa As Padayappa returns to cinemas after 25 years, Rajinikanth details why the film was never sold to OTT platforms, keeping the blockbuster exclusive to theaters and television sets for decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/smriti-irani-supports-dhurandhar-film-tribute-to-fallen-soldiers-2834282-2025-12-11",
      "headline": "Smriti Irani defends Dhurandhar, calls film an echo of lives lived and lost Smriti Irani has strongly supported the film Dhurandhar amid online debates. She urges audiences to view it as a heartfelt tribute to security personnel who sacrificed for the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-styling-controversy-unpaid-dues-designer-outfit-dispute-bigg-boss-19-2834286-2025-12-11",
      "headline": "Bigg Boss 19's Tanya Mittal accused of unpaid dues by stylist Riddhima Sharma Bigg Boss 19 runner-up Tanya Mittal has been accused by her stylist, Riddhima Sharma, of not settling styling payments and failing to return designer outfits. The dispute surfaced on social media, as Sharma detailed her allegations and shared her perspective on the treatment she received from Mittal and her team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-look-designer-preetisheel-singh-shares-behind-the-scenes-of-akshaye-khanna-intense-avatar-2834293-2025-12-11",
      "headline": "Dhurandhar: Look designer shares BTS pic of Akshaye Khanna's intense makeover Makeup and character artist Preetisheel Singh shared the intricate process behind creating Akshaye Khanna's intense look as Rehman Dakait in Dhurandhar, sharing unseen photos and detailed notes on Instagram. She also highlighted how every character in the ensemble film was crafted with unique textures, layers, and continuity-driven detailing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-idris-elba-strike-a-pose-at-jeddahs-golden-globes-gala-2834279-2025-12-11",
      "headline": "Salman Khan, Idris Elba strike a pose at Jeddah's Golden Globes gala Salman Khan shared a delightful moment with Hollywood star Idris Elba at the Red Sea International Film Festival's Golden Globes dinner in Jeddah. He also expressed his admiration for Saudi Arabia and praised Alia Bhatt's honour at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-brief-mumbai-visit-kapil-sharma-show-career-upcoming-projects-2834220-2025-12-11",
      "headline": "Priyanka Chopra's wraps Mumbai trip after Kapil Sharma show shoot, returns to US Global icon Priyanka Chopra visited Mumbai for less than 12 hours to film a special episode of Kapil Sharma's The Great Indian Kapil Show season 4. She has now shared a post after wrapping her trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-film-praised-by-anupam-kher-impactful-storytelling-unsung-heroes-2834243-2025-12-11",
      "headline": "Dhurandhar trivia: Film title has a Satish Kaushik connection, Anupam Kher reveals Veteran actor Anupam Kher shared his enthusiastic response to Aditya Dhar's film Dhurandhar. He also revealed how the title of the film has a connection with late actor Satish Kaushik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-faces-fan-backlash-over-ramen-post-amid-rumoured-winter-romance-2834258-2025-12-11",
      "headline": "BTS's Jungkook faces fan backlash over Ramen post amid rumoured Winter romance BTS' Jungkook has sparked online debate after sharing a casual ramen Instagram Story amid growing rumours linking him to aespa's Winter. While some fans criticised his silence and timing, others defended his right to personal life."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saurabh-and-gaurav-luthra-owners-of-goa-nightclub-who-fled-to-thailand-after-fire-detained-2834236-2025-12-11",
      "headline": "Luthra brothers, owners of Goa club, seen handcuffed after detention in ThailandSaurabh and Gaurav Luthra, owners of Goa's Birch by Romeo Lane nightclub, who fled to Thailand hours after a massive fire at the venue killed 25, have been detained in Phuket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-tariffs-50-percent-mexico-to-please-us-donald-trump-2834322-2025-12-11",
      "headline": "Now Mexico imposes 50% tariffs on India. Why the heck?India tariffs: The tariff hike, which will come into effect on January 1, 2026, will see duties up to 50% on Indian imports. Experts have called it a bid to appease Trump ahead of the next review of the US-Mexico-Canada trade agreement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/big-tech-microsoft-intel-google-amazon-billions-investment-india-ai-trump-snub-2834269-2025-12-11",
      "headline": "India's big AI moment as Big Tech gives big snub to TrumpOver the last few weeks, tech giants like Microsoft and Amazon have pledged investments of more than $68 billion (about Rs 6.12 lakh crore), mostly in AI. It is hardly the picture of a 'dead economy' that Trump painted as Big Tech doubles down on India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-open-to-joining-china-islamabad-strategic-grouping-china-without-india-dhaka-touhid-hossain-2834297-2025-12-11",
      "headline": "With Pak, minus India: Bangladesh keen on joining China-led groupingBangladesh's Foreign Affairs Adviser Touhid Hossain has said that it is strategically possible for Dhaka to join a regional bloc with Pakistan, and without India. This statement comes days after Pakistan's Foreign Minister Ishaq Dar hinted at a new trilateral grouping involving Dhaka, Beijing and Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-songs-what-is-9-doing-in-fa9la-dhuarndhar-runaway-hit-song-sher-e-baloch-rehman-dakait-akshaye-khanna-entry-2834393-2025-12-11",
      "headline": "What's 9 doing in FA9LA, Dhuarndhar's runaway hit song Sher-e-Baloch?The FA9LA isn't a typo or a catchy title. The 9 replaces an Arabic letter for a strong \"s\" sound, a trend from Arabizi, the Arabic chat alphabet. In Bahraini slang means fun or party. So, the viral Dhurandhar anthem, FA9LA, which has now become a social media sensation, reads as FASLA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-live-updates-modi-amit-shah-rahul-gandhi-lok-sabha-speech-sir-congress-bjp-2834179-2025-12-11",
      "headline": "Live: What's the topic Vande Mataram or Nehru? Kharge's jab at JP NaddaParliament Winter Session Live Updates: Two stormy debates on Vande Mataram and electoral reforms have set the tone as the Winter Session of the Parliament will enter its ninth day on Thursday. On Wednesday, Lok Sabha saw a direct clash between Union Home Minister Amit Shah and Leader of Opposition Rahul Gandhi, after the latter accused the BJP and the Election Commission of orchestrating \"vote chori\".\r\n\r\nGandhi dared Shah to debate the claims he made across three press conferences in the past. Shah dismissed the challenge, saying he wouldn't tailor his remarks to suit the Opposition's script or reorder his arguments on demand. The session, which began on December 1, will run until December 19. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-nightclub-fire-survivor-recounts-how-fire-started-escape-chaos-husband-sisters-dead-luthra-brothers-2834382-2025-12-11",
      "headline": "I ran out, they couldn't: Woman who lost husband, sisters in Goa club infernoBhavna Joshi said her husband, Vinod, noticed the flames before anyone else. The family had been seated at a table just in front of the dance floor, when pyrotechnics featured during a belly dance performance ignited the ceiling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-lawmaker-trump-party-bill-huizenga-pakistan-lashkar-pahalgam-attack-2834379-2025-12-11",
      "headline": "In a 1st, Trump's party lawmaker links Pak's Lashkar to Pahalgam attackUS Representative Bill Huizenga said the Trump administration promptly designated TRF, which was behind the Pahalgam attack, as a foreign terrorist organisation in July this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/120-bahadur-flops-dhurandhar-soars-a-lesson-in-patriotism-psychology-2834357-2025-12-11",
      "headline": "120 Bahadur flops, Dhurandhar soars: A lesson in patriotism psychologyTwo films, worlds apart in box office fate, highlight India's patriotism divide: audiences crave cathartic dominance over painful remembrance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eggoz-cancer-causing-eggs-social-media-heat-lab-test-report-fssai-nitrofuran-level-2834280-2025-12-11",
      "headline": "Eggoz faces social media heat over viral cancer claims: All you need to knowEggoz Nutrition, a brand that has built its reputation on selling fresh, chemical-free eggs, found itself at the centre of a storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-trade-deal-offer-best-ever-tough-nut-to-crack-us-representative-talks-negotiations-agriculture-dairy-2834197-2025-12-11",
      "headline": "India offering best-ever trade deal, but tough nut to crack: US officialThe US and India have opened critical trade talks in New Delhi, with India presenting its best market access offer yet, according to US Trade Representative Jamieson Greer. The discussions aim to resolve tariff disputes and firm up a trade deal between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/modi-putin-car-selfie-us-congress-india-us-relations-trump-glbs-2834169-2025-12-11",
      "headline": "PM, Putin's car selfie in US Congress as lawmaker warns of strained tiesThe Congresswoman urged lawmakers to move with incredible urgency to mitigate the damage this administration has done to the US-India partnership and return to steady cooperation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-praises-ranveer-singhs-dhurandhar-but-questions-its-politics-2834120-2025-12-10",
      "headline": "Hrithik Roshan praises Ranveer Singh's Dhurandhar, but questions its politicsActor Hrithik Roshan has applauded the film 'Dhurandhar' for its storytelling while expressing his disagreements with its political undertones. He joined the list of celebrities who have shared their views on the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tmc-mp-smoking-e-cigarette-in-lok-sabha-winter-session-parliament-bjp-trinamool-2834329-2025-12-11",
      "headline": "BJP accuses Trinamool MP of smoking e-cigarette in Lok Sabha, Speaker takes noteBJP MP Anurag Thakur alleged that a Trinamool Congress (TMC) MP had been smoking e-cigarette inside the Lok Sabha premises during the ongoing Winter Session of the Parliament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-t20-world-cup-spot-uncertain-shubman-gill-return-jitesh-sharma-rise-2834249-2025-12-11",
      "headline": "It's not Sanju Samson vs Jitesh Sharma. It's Sanju Samson vs Shubman GillIndia vs South Africa: India's opening equation remains unsettled, with Shubman Gill short of runs and Sanju Samson short of opportunities. As the World Cup approaches, clarity in selection will prove decisive in determining whether the champions enter their title defence with stability or lingering uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-cameo-dileep-film-backlash-2017-assault-case-acquittal-2834308-2025-12-11",
      "headline": "Explained: Why Mohanlal is under fire for his cameo in acquitted Dileep's filmMalayalam superstar Mohanlal faces criticism for his cameo in Dileep's film shortly after the actor's acquittal in a 2017 assault case. The controversy highlights divided public opinion and ongoing debates about justice and accountability in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/do-not-travel-to-india-attorney-to-h1b-visa-holders-amid-interview-rescheduling-h4-social-media-vetting-us-techie-2834364-2025-12-11",
      "headline": "Don't travel to India: Experts warn H-1B visa holders amid interview reschedulingImmigration attorneys have urged H-1B visa holders not to travel to India after the mass postponement of visa interviews from December to March and April 2026. They are suggesting that H-1B visa holders be in the US. Those travelling could risk losing jobs and being separated from families. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-hc-steps-in-to-protect-salman-khan-personality-rights-asks-social-media-platforms-to-act-on-complaints-2834361-2025-12-11",
      "headline": "Act within 3 days: Court to entities violating Salman Khan's personality rightsSalman Khan moved the High Court recently seeking directions against several entities, including unknown (John Doe) defendants, to restrain them from using his personality rights unauthorisedly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-dangles-from-10th-floor-balcony-while-hiding-from-lover-wife-in-china-viral-video-2834287-2025-12-11",
      "headline": "Woman dangles from 10th-floor balcony while hiding from lover's wife in ChinaNeighbours spotted the woman hanging from the 10th-floor balcony, appearing to struggle to maintain her grip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-re-release-rajinikanth-birthday-iconic-tamil-blockbuster-theatres-2834335-2025-12-11",
      "headline": "Why Rajinikanth refused to sell digital rights of PadayappaAs Padayappa returns to cinemas after 25 years, Rajinikanth details why the film was never sold to OTT platforms, keeping the blockbuster exclusive to theaters and television sets for decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japan-megaquake-warning-should-india-brace-for-the-great-himalayan-earthquake-2834312-2025-12-11",
      "headline": "Japan's megaquake warning sparks fears of Great Himalayan EarthquakeThe \"Great Himalayan Earthquake\" refers to a hypothetical, massive seismic event that could occur along the Main Himalayan Thrust, a major fault line running beneath the Himalayan mountain range."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-lawmaker-warns-trump-tariffs-hurting-india-ties-glbs-2834170-2025-12-11",
      "headline": "Will Trump be the President who lost India? US lawmaker warns tariffs backfiringUS lawmakers voiced fresh concerns over the Trump administration's handling of the US–India relationship, warning that unpredictability on tariffs, immigration and foreign policy risks weakening a partnership central to America's Indo-Pacific strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/menodivorce-is-menopause-pushing-more-women-out-of-marriages-2834305-2025-12-11",
      "headline": "Menodivorce: Is menopause pushing more women out of marriages?Can menopause cause a divorce? Experts aren't ruling it out entirely. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-ranji-trophy-debut-sunil-gavaskar-rajdeep-sardesai-2834386-2025-12-11",
      "headline": "Remembering Sachin Tendulkar's Ranji debut: When Gavaskar got the timing right Thirty-seven years on, Sachin Tendulkar's Ranji debut remains frozen in Mumbai's cricketing memory. A 15-year-old schoolboy struck a century on debut, rewarding Sunil Gavaskar's instinct to be in the stands to watch the much-talked-about wunderkind play senior cricket for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-mitch-hay-61-leads-new-zealand-to-73-run-lead-over-west-indies-basin-reserve-2834343-2025-12-11",
      "headline": "NZ vs WI: Mitch Hay steps up on debut as New Zealand tighten grip on second Test NZ vs WI, 2nd Test Day 2: Mitch Hay's composed 61 on debut helped New Zealand post 278 in reply to West Indies' 205, before late wickets left the tourists 32-2 and still 41 runs behind at stumps. A weakened Kiwi attack faces a stern test after Blair Tickner's injury on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-2025-26-travis-head-jake-weatherald-likely-open-australia-adelaide-test-khawaja-fitness-2834360-2025-12-11",
      "headline": "Travis Head's podcast comment hints at Australia's opening plans for Adelaide Test The Ashes 2025-26: Travis Head may have hinted at Australia's plans for the Adelaide Test as Usman Khawaja pushes to prove his fitness, leaving selectors with a key decision at the top of the order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-key-role-questioned-robin-uthappa-gambhir-omission-post-match-press-conference-2834302-2025-12-11",
      "headline": "Did Gautam Gambhir ignore Ro-Ko after ODI series win? Ex-teammate sparks fresh row After India's ODI series victory over South Africa, Robin Uthappa expressed surprise at head coach Gautam Gambhir for not crediting Virat Kohli and Rohit Sharma, despite their standout performances. Kohli amassed 302 runs, including two hundreds, in the three-match series, which India won 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2026-usa-seattle-pride-game-egypt-vs-iran-anti-lgbtq-problems-2834313-2025-12-11",
      "headline": "Seattle's Pride game with anti-LGBTQ nations Egypt and Iran creates problems for FIFA Seattle's plan to celebrate Pride during a World Cup match has triggered strong protests from Egypt and Iran, placing FIFA in the middle of a global cultural dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/junior-hockey-world-cup-india-vs-argentina-bronze-medal-match-analysis-2834283-2025-12-11",
      "headline": "The unflinching 15 minutes: How India staged a historic comeback to win bronze Junior Hockey World Cup 2025: India's 4–2 comeback against Argentina secured a significant bronze and highlighted the group's depth, resolve and improving game awareness. The win offers reassurance about the junior team's development and the promise they carry as they progress toward senior hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-t20-world-cup-spot-uncertain-shubman-gill-return-jitesh-sharma-rise-2834249-2025-12-11",
      "headline": "It's not Sanju Samson vs Jitesh Sharma. It's Sanju Samson vs Shubman Gill India vs South Africa: India's opening equation remains unsettled, with Shubman Gill short of runs and Sanju Samson short of opportunities. As the World Cup approaches, clarity in selection will prove decisive in determining whether the champions enter their title defence with stability or lingering uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erling-haaland-jokes-jamie-carragher-man-city-real-madrid-champions-league-2834261-2025-12-11",
      "headline": "Watch: Erling Haaland fires playful jibe at Carragher amid Liverpool's Salah crisis Erling Haaland aimed a playful jab at Jamie Carragher amid the pundit's ongoing Salah controversy as Manchester City secured a 2-1 Champions League win over Real Madrid at the Bernabeu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-gautam-gambhir-old-feud-rohit-sharma-virat-kohli-2027-odi-world-cup-thought-whatever-he-says-is-right-2834241-2025-12-11",
      "headline": "Shahid Afridi sparks feud with Gautam Gambhir: He thought whatever he says is right Shahid Afridi has reignited his long-standing feud with Gautam Gambhir, accusing the current Indian coach of having an attitude. Afridi also backed Rohit Sharma and Virat Kohli to continue until the 2027 ODI World Cup, calling them the backbone of India's batting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-rankings-rohit-sharma-retains-top-spot-virat-kohli-climbs-to-no-2-ytvd-2834213-2025-12-11",
      "headline": "ICC Rankings: Rohit Sharma Retains Top Spot, Virat Kohli Climbs To No. 2 This news report highlights the latest ICC ODI rankings released on Wednesday, December 10, where Indian cricket stalwarts Rohit Sharma and Virat Kohli have solidified their dominance. Despite facing questions regarding their ODI future just a few weeks prior, both players have silenced detractors by securing the top two spots in the batting charts. Rohit Sharma retains the number one position with 781 rating points, following a Man of the Series performance in Australia and two half-centuries in South Africa. Virat Kohli has climbed two places to the number two spot, pushing New Zealand's Daryl Mitchell and Afghanistan's Ibrahim Zadran to third and fourth respectively. The report notes that Kohli is now just eight rating points behind his teammate. The duo has emerged as India's top run-scorers in the last six ODIs, proving their indispensable value to the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-eyes-2-0-lead-against-south-africa-in-mullanpurs-first-mens-international-ytvd-2834210-2025-12-11",
      "headline": "India Eyes 2-0 Lead Against South Africa in Mullanpur's First Men's International In this sports update, the focus is on the second T20 International between India and South Africa. Following a comprehensive 101-run victory in the series opener at Cuttack, the 'Men in Blue' are looking to build on their success and take a crucial 2-0 lead in the series. The action now shifts to Mullanpur, which is set for a special occasion as it hosts its first-ever men's international match. The report highlights that while the pitch conditions remain a mystery for both sides, historical IPL records at the venue suggest a slender 6-5 advantage for teams batting first. Additionally, India aims to further strengthen their impressive 6-2 head-to-head record against South Africa in recent encounters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-dreams-playing-t20-world-cup-open-to-future-india-captain-2834198-2025-12-11",
      "headline": "Yashasvi Jaiswal dreams of playing T20 World Cup, open to being future India captainYashasvi Jaiswal might be a sure-shot starter in the Test team, but he still dreams of making his mark in white-ball cricket and aspires to one day play in the T20 World Cup. He also revealed that he would like to lead the Indian team in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-ipl-2026-mini-auction-strategy-player-targets-2833990-2025-12-11",
      "headline": "Delhi Capitals IPL 2026 auction strategy explained: Five players DC can targetIPL 2026 mini auction: With a purse of Rs 21.70 crore, Delhi Capitals enter the IPL 2026 mini auction needing immediate top-order reinforcement and multiple overseas signings as they look to fix their playing XI for the upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-t20i-preview-predicted-playing-xis-mullanpur-conditions-live-streaming-2834064-2025-12-11",
      "headline": "Can Shubman Gill find his rhythm in home comfort to silence critics?IND vs SA, 2nd T20I: India vice-captain Shubman Gill has struggled for form and will be looking to find his feet as India look to extend their dominance on his home ground in the second T20I against South Africa on Thursday in Mullanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-india-ticket-prices-schedule-2834151-2025-12-11",
      "headline": "Lionel Messi in India: Complete schedule of GOAT tour, starting on December 13Lionel Messi is set to visit India on a 3-day tour. Messi will travel to four cities Kolkata, Hyderabad, Mumbai and New Delhi during his stay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-second-t20i-predicted-playing-xi-2834132-2025-12-11",
      "headline": "2nd T20I Predicted XIs: Will India change the winning combination?India (IND) v South Africa (SA) 2nd T20I Predicted XIs: Leading 1–0 in the five-match T20I series, a well-rounded India will look to extend their dominance over South Africa in the second T20 International on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-boxing-championship-moved-greater-noida-pollution-2834153-2025-12-11",
      "headline": "Too much pollution: National boxing championships in Greater Noida rescheduledThe elite national boxing championships have been rescheduled to January due to pollution in Greater Noida. This comes after persistent issues in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/germany-wins-8th-fih-mens-hockey-junior-world-cup-beating-spain-shootout-2834146-2025-12-10",
      "headline": "Germany win 8th Jr.men's Hockey World Cup title in shootout thriller with SpainGermany overcame Spain 3-2 in a shootout following a 1-1 draw in regulation time, claiming their eighth FIH Men's Hockey Junior World Cup. Goalkeeper Jasper Ditzer played a decisive role, denying Spain their first world title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-new-structure-club-consortium-aiff-indian-super-league-football-2834148-2025-12-10",
      "headline": "New ISL roadmap? AIFF to discuss club-led consortium at its AGM on Dec 20The All India Football Federation (AIFF) has indicated it is open to ISL clubs forming a consortium to run the league this season, with no timely resolution yet from the federation or the Sports Ministry on the ongoing football impasse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-kolkata-visit-70-foot-statue-december-13-2834091-2025-12-10",
      "headline": "Messi magic to grip Kolkata: Superstar to unveil 70-foot statue of himselfLionel Messi magic is all set to grip Kolkata as the city gets ready to welcome the Argentina superstar on December 13. Messi is set to receive a grand welcome in the city with celebrity-studded events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pr-sreejesh-reaction-india-junior-hockey-team-stun-argentina-win-bronze-fih-world-cup-2834086-2025-12-10",
      "headline": "Great achievement after being down 0-2: Sreejesh proud of India's podium finishPR Sreejesh could barely hide his pride as he reflected on India's junior men's stirring 4-2 comeback win over Argentina that secured the bronze medal at the FIH Junior Men's World Cup on Wednesday, giving the country its first podium finish in nine years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-annual-contract-2025-2026-shubman-gill-rohit-virat-2834081-2025-12-10",
      "headline": "Gill likely to get A+ BCCI contract, will Rohit, Virat be snubbed?India Test captain Shubman Gill is likely to be named in the A+ category in the upcoming BCCI annual contract list. There are also questions about whether Virat Kohli and Rohit Sharma will be retained in the central contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-family-struggle-sacrifice-journey-indian-cricket-2834063-2025-12-10",
      "headline": "From struggle to stardom: Yashasvi on how his family carried him to Indian teamYashasvi Jaiswal revealed how his family carried him during tough times to help complete the dream of playing for India. Jaiswal has represented India in all three formats of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-agenda-aajtak-rohit-sharma-dhurandhar-2834060-2025-12-10",
      "headline": "Rohit Sharma is Dhurandhar, Chahal is Baahubali: Yashasvi JaiswalIndia vs South Africa: Opener Yashasvi Jaiswal compared Rohit Sharma to the movie Dhurandhar in the Agenda AajTak summit. Jaiswal spoke about the care that Rohit has for the junior India stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhanas-first-reaction-after-calling-off-wedding-love-for-cricket-2834056-2025-12-10",
      "headline": "I don't think I love anything more than cricket: Smriti MandhanaMaking her first public appearance after cancelling her wedding, Smriti Mandhana says one truth has become clearer to her than anything else over the past 12 years: there is nothing she cares about more deeply than cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-shoulders-too-much-responsibility-alyssa-healy-decodes-england-ashes-woes-2834036-2025-12-10",
      "headline": "Ben Stokes shoulders too much responsibility: Healy decodes England's Ashes woesAustralian cricketer Alyssa Healy, decoding England's poor performance in the ongoing Ashes, believes captain Ben Stokes is overburdening himself during the 2025–26 series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-2026-auction-cameron-green-big-signings-overseas-all-rounder-focus-2834019-2025-12-10",
      "headline": "Cameron Green to CSK? Chennai Super Kings mascot drops big hint before IPL auctionCSK teased their IPL 2026 auction strategy through a mascot video, hinting at key overseas signings as they aim to rebuild after a poor season where they finished at the bottom of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/jr-mens-hockey-world-cup-india-vs-argentina-report-pr-sreejesh-chennai-2834018-2025-12-10",
      "headline": "Paris Olympics-inspired fightback! India rally to beat Argentina, claim 3rdJr.men's Hockey World Cup: India secured a thrilling comeback from two goals down to beat Argentina 4-2 in the third-place playoff in Chennai on Wednesday, December 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arne-slot-happy-liverpool-fans-chant-his-name-mohamed-salah-feud-2834012-2025-12-10",
      "headline": "Arne Slot grateful as Liverpool fans chant his name amid Salah feud: Means a lotLiverpool's under-fire manager Arne Slot was grateful as fans chanted his name following his side's gritty 1–0 victory over Inter Milan at the San Siro, a result that delivered one of the biggest European statements of his troubled second tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tejaswi-jasiwal-yashasvi-ind-vs-sa-syed-mushtaq-ali-trophy-2834005-2025-12-10",
      "headline": "Tejaswi Jaiswal sacrificed cricket dreams. Now brother Yashasvi fuels his returnYashasvi Jaiswal's elder brother Tejaswi made his Syed Mushtaq Ali debut for Tripura. Tejaswi had earlier sacrificed his dream due to financial constraints and supported his brother by working as a salesman in Delhi."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}