{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-hints-at-major-overhaul-in-epfo-with-30-rollout-2778669-2025-08-29",
      "headline": "Sanjeev Sanyal hints at major overhaul in EPFO with 3.0 rolloutEconomist Sanjeev Sanyal has signalled that the Employees' Provident Fund Organisation (EPFO) is gearing up for a major transformation, with the much-awaited EPFO 3.0 promising faster, simpler, and more digital-first services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trumps-50-percent-tariffs-could-cost-india-usd-55-60-billion-warns-jefferies-global-head-of-equity-strategy-chris-wood-2778657-2025-08-29",
      "headline": "Trump's draconian tariffs may cost India $55-60 billion, warns Jefferies' Chris WoodChris Wood argues that the US tariffs are as much political as economic. He links the steep duties to Donald Trump's \"personal pique\" at being denied a role in resolving India-Pakistan tensions after their four-day conflict in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-rich-but-time-poor-why-real-wealth-is-about-balance-explains-ca-2778622-2025-08-29",
      "headline": "Cash-rich but time-poor? Why real wealth is about balance, explains CAIn today's fast-paced world, people often chase bigger salaries and titles, but an expert says money alone cannot define wealth. What matters more, he argues, is the freedom to spend time on things that truly count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-50-percent-us-tariff-blow-dent-india-economic-growth-in-q1-2778584-2025-08-29",
      "headline": "Will 50% US tariffs hit India's economic growth in Q1 and beyond?US tariffs, slow private investment, and weak urban demand are testing India's growth. Can GST cuts, government spending, and a strong monsoon keep the economy from stalling?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-agm-today-5-things-you-need-to-know-2778573-2025-08-29",
      "headline": "Reliance AGM today: 5 things you need to knowAll eyes will be on Reliance Industries as it holds its 48th AGM today at 2 PM. From Jio and retail IPO buzz to its push into green energy and AI, investors are bracing for big announcements from Mukesh Ambani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-rbi-governor-urjit-patel-appointed-imf-executive-director-2778525-2025-08-29",
      "headline": "Former RBI governor Urjit Patel appointed IMF executive directorUrjit Patel succeeds K. Subramanian and will represent India, along with neighbouring countries including Bangladesh, Bhutan, and Sri Lanka, at the Washington-based global financial institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-over-130-points-nifty-above-24500-mm-down-2-2778520-2025-08-29",
      "headline": "Sensex, Nifty open higher after two-day sell-off amid US tariff jittersAt 9:22 am, the S&P BSE Sensex rose 112 points to 80,193.25, while the NSE Nifty50 gained 45 points to 24,545.90. Broader markets also edged higher as volatility eased slightly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-gets-another-six-month-extension-to-lease-turkish-airlines-planes-glbs-2778448-2025-08-29",
      "headline": "IndiGo gets another six-month extension to lease Turkish Airlines planesThe extension will help IndiGo cut losses caused by geopolitical restrictions, the airline said, referring to an airspace ban imposed by Pakistan on Indian airlines earlier this year that has led to longer routes and higher costs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-boost-russian-oil-imports-in-september-despite-us-pressure-report-2778293-2025-08-28",
      "headline": "India to boost Russian oil imports in September despite US pressure: ReportIndia has become Russia's biggest oil customer since Western sanctions forced Moscow to redirect supplies in 2022. Cheaper Russian crude has helped Indian refiners keep costs down, but the trade has also attracted criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-extends-duty-free-cotton-imports-to-shield-textile-sector-from-us-tariffs-2778283-2025-08-28",
      "headline": "India extends duty-free cotton imports to shield textile sector from US tariffsFor mills, the duty-free extension offers much-needed relief. The earlier exemption, ending in September, was too short to allow large imports, as shipments from exporting nations often take more than a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-how-to-improve-grievance-loan-approval-emis-personal-finance-2778278-2025-08-28",
      "headline": "CIBIL Decoded: How delayed credit score updates can hit your loans and ratesA delay of even a few weeks in updating information with the credit bureau can decide whether a person gets a loan, how much interest they pay, or if they are denied altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/more-taxes-coming-from-people-than-companies-finds-report-2778219-2025-08-28",
      "headline": "More taxes coming from people than companies, finds reportFor the first time, personal income tax collections in India have overtaken corporate tax, signalling a major shift in the country's tax landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-0-tax-slabs-reduction-state-revenue-loss-decoded-2778191-2025-08-28",
      "headline": "GST 2.0: Which states will take the biggest hit if taxes drop?GST 2.0 promises lower taxes and cheaper goods, but the real challenge looms for revenue-dependent states. The question is, who absorbs the shortfall when the proposals come into effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-closes-706-points-lower-nifty-below-24600-hcltech-down-3-percent-2778184-2025-08-28",
      "headline": "Sensex closes 706 points lower; Nifty below 24,600; HCLTech down 3%The S&P BSE Sensex was down by 706 points to close at 80,080.57, while the NSE Nifty50 lost 211.15 points to end at 24,500.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dont-miss-this-step-after-filing-itr-here-what-to-do-2778053-2025-08-28",
      "headline": "Don't miss this step after filing ITR: Here's what to doSimply filing your ITR is not enough. You must verify it within 30 days, else, missing this important step could mean delays, penalties, and even your return being declared invalid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-textile-fertiliser-us-tariff-rate-rationalisation-low-cost-tax-free-nil-slab-festive-season-2778026-2025-08-28",
      "headline": "GST 2.0 boost for textile, fertiliser sectors as Trump's 50% tariff kicks inThe textile and fertiliser industries are expected to be among the biggest beneficiaries of the upcoming GST 2.0 rationalisation amid US President Donald Trump's 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dividend-mismatch-with-ais-here-is-how-taxpayers-should-report-it-2778019-2025-08-28",
      "headline": "Dividend mismatch with AIS? Here's how taxpayers should report itFiling ITR often becomes confusing when dividend income in your personal records doesn't match what appears in AIS. Here's how to handle it while filing ITR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-tax-cuts-updates-milk-chocolates-textiles-fertilizers-2778009-2025-08-28",
      "headline": "Cheaper milk, chocolates, clothes and more: How GST 2.0 could slash your billsThe proposed changes, to be discussed at the Council's meeting on September 3–4 in New Delhi, focus on widening the nil rate, scrapping the 12% slab, and reducing rates on selected 18% goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-sensex-tanks-600-points-nifty-falls-us-tariff-50-percent-2777990-2025-08-28",
      "headline": "Sensex tanks 600 points: Why is stock market falling today?The S&P BSE Sensex was down by 605.97 points to 80,180.57, while the NSE Nifty50 lost 173.50 points to 24,538.55, as both the indices continued their downward movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-nearly-500-points-nifty-below-24600-as-us-tariffs-hit-markets-2777962-2025-08-28",
      "headline": "Sensex nosedives 600 points, Nifty tumbles as US tariffs hit marketsThe Sensex shed 600 points to close at 81,074, while the Nifty ended below the 24,600 mark after slipping into bearish territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-end-electric-vehicles-likely-to-attract-18-gst-2777884-2025-08-28",
      "headline": "High-end electric vehicles likely to attract 18% GSTAccording to the proposals, GST on four-wheeled EVs priced between Rs 20 lakh and Rs 40 lakh will be raised from 5 per cent to 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chocolates-with-cocoa-pastries-ice-cream-likely-to-be-taxed-at-5-percent-gst-2777835-2025-08-27",
      "headline": "Chocolates with cocoa, pastries, ice cream likely to be taxed at 5% instead of 18%The proposed rationalisation stems from the Council's broader push to simplify the GST framework."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/condensed-milk-dates-jams-mushrooms-namkeens-to-get-cheaper-under-gst-2-0-2777830-2025-08-27",
      "headline": "Condensed milk, dates, jams, mushrooms, namkeens to get cheaper under GST 2.0The fitment committee has proposed that products such as butter, condensed milk, jams, mushrooms, dates, nuts, and namkeens move from the current 12 per cent GST slab to just 5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-extended-till-2030-higher-loans-and-credit-cards-for-vendors-2777686-2025-08-27",
      "headline": "PM SVANidhi scheme extended till 2030, higher loans and credit cards for vendorsThe move is expected to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. The scheme will continue to be implemented jointly by the Ministry of Housing & Urban Affairs (MoHUA) and the Department of Financial Services (DFS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-response-india-eyes-new-markets-export-textiles-jewellery-gems-outreach-program-trade-2777643-2025-08-27",
      "headline": "India eyes new markets amid US tariffs, aims to boost textile, jewellery exportsPlans are being drawn up to explore new markets, increase outreach, and give special attention to sectors such as textiles and gems and jewellery, which are likely to be among the hardest hit by the tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-10000-monthly-sip-make-you-a-crorepati-heres-the-timeline-2777633-2025-08-27",
      "headline": "Can a Rs 10,000 monthly SIP make you a crorepati? Here's the timelineCan Rs 10,000 a month really make you a crorepati? The maths of SIPs shows that with discipline and time, the answer is yes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranvir-shorey-recalls-rejecting-tiger-zinda-hai-returning-for-tiger-3-out-of-anger-2779238-2025-08-30",
      "headline": "Ranvir Shorey recalls rejecting Tiger Zinda Hai, returning for Tiger 3 out of angerActor Ranvir Shorey shared that he skipped 'Tiger Zinda Hai' because of payment issues. He also recalled that despite not liking his character's portrayal in 'Tiger 3', he agreed to be part of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-kunickaa-sadanand-shuts-down-age-shaming-bigg-boss-19-calls-irrelevant-2779020-2025-08-30",
      "headline": "Kunickaa Sadanand shuts-down age-shaming on Bigg Boss 19, calls it irrelevantActor Kunickaa Sadanand recently reflected on her decision to participate in 'Bigg Boss 19', in an exclusive interview with India Today. She also shared her views on host Salman Khan's work-ethic and charisma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-do-patti-song-raanjhan-sachet-parampara-kmkz-plagiarism-claims-2779310-2025-08-30",
      "headline": "Music duo Sachet-Parampara to sue KMKZ over plagiarism claims on Raanjhan songMusic composer duo Sachet-Parampara rubbished claims of plagiarism over the 'Do Patti' song 'Raanjhan' on Sunday. They plan to sue KMKZ for defamation. They also said in a recent interview that their authorship of 'Raanjhan' has been verified by major streaming platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-comforts-son-ayaan-at-his-grandmother-allu-kanakaratnam-funeral-in-hyderabad-2779288-2025-08-30",
      "headline": "Allu Arjun comforts son Ayaan at his grandmother's funeral in HyderabadActor Allu Arjun was seen consoling his son Ayaan during the emotional farewell to his grandmother, Allu Kanakaratnam. In another video, the duo could be seen turning pallbearers along with Chiranjeevi, Ram Charan and other members of the family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariya-ganesh-chaturthi-celebration-photos-2779265-2025-08-30",
      "headline": "Tara Sutaria celebrates Ganesh Chaturthi with Veer Pahariya. See photosActor Tara Sutaria made her relationship with 'Sky Force' actor Veer Pahariya Instagram official on Sunday. The actor shared photos from the Ganesh Chaturthi celebrations on her social media account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-anjali-raghav-quits-bhojpuri-industry-after-pawan-singh-video-controversy-2779269-2025-08-30",
      "headline": "Actor Anjali Raghav quits Bhojpuri industry after Pawan Singh video controversyActor Anjali Raghav has accused Bhojpuri actor Pawan Singh of touching her inappropriately without consent. She also spoke about her decision to quit the Bhojpuri industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rajiv-adatia-defends-gaurav-khanna-cooking-bigg-boss-19-2779232-2025-08-30",
      "headline": "Rajiv Adatia defends Gaurav Khanna's decision to not cook on Bigg Boss 19Reality TV personality Rajiv Adatia defended actor Gaurav Khanna's choice to refrain from cooking on 'Bigg Boss 19'. In a recent video, he cited significant differences between cooking in 'Bigg Boss' and 'Celebrity MasterChef.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-ex-husband-bharat-takhtani-dating-meghna-lakhani-viral-pics-spark-buzz-2779203-2025-08-30",
      "headline": "Esha Deol's ex-husband Bharat Takhtani dating Meghna Lakhani? Viral pics spark buzzActor Esha Deol's ex-husband Bharat Takhtani sparked dating rumours by sharing photos with Meghna Lakhani on Instagram. The photos quickly went viral, leading to speculations of dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-confronts-pranit-more-over-below-the-belt-jokes-on-him-2779200-2025-08-30",
      "headline": "Bigg Boss 19: Salman Khan confronts Pranit More over below-the-belt jokes on himActor Salman Khan confronted comedian Pranit More about his viral jokes on 'Bigg Boss 19'. The exchange sparked surprise among housemates and highlighted boundaries in comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-admits-being-wronged-by-people-before-saiyaara-mohit-suri-film-2779190-2025-08-30",
      "headline": "Ahaan Panday admits being wronged by people before SaiyaaraActor Ahaan Panday opened up about dealing with multiple rejections and being wronged by people before landing a role in 'Saiyaara'. The 27-year-old expressed in a recent interview that he remained optimistic and grateful for the opportunity to assist on film sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-hugs-cousin-allu-arjun-pays-last-respect-to-grandmother-in-hyderabad-2779191-2025-08-30",
      "headline": "Ram Charan hugs cousin Allu Arjun, pays last respect to grandmother in HyderabadActor Ram Charan arrived in Hyderabad from Mysore to pay his last respects to grandmother Allu Kanakaratnam. The 94-year-old died in the early hours of Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-cook-dilip-tries-to-sell-her-iphone-aunty-kisko-bola-sunita-ahuja-sajid-khan-2779133-2025-08-30",
      "headline": "Farah Khan's cook Dilip tries to sell her iPhone for Rs 5-6K. WatchFarah Khan's cook Dilip stole the show on 'Aunty Kisko Bola' with his trademark humour. He made a brief yet impactful appearance by trying to sell an iPhone, unaware of its cost. He later ran away when an audience member reminded him of the phone's actual value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/julia-roberts-defends-metoo-themed-after-the-hunt-venice-film-festival-2779076-2025-08-30",
      "headline": "Julia Roberts defends MeToo-themed film After The Hunt at Venice Film FestivalActors Julia Roberts and Luca Guadagnino addressed questions on feminism and complicity at the Venice Film Festival. Their film 'After The Hunt' sparks debate on MeToo and challenges traditional narratives around misconduct."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/baaghi-4-trailer-tiger-shroff-sanjay-dutt-lock-horns-in-violent-revenge-drama-2779126-2025-08-30",
      "headline": "Baaghi 4 trailer: Tiger Shroff, Sanjay Dutt lock horns in violent revenge-dramaActor Tiger Shroff has returned as Ronnie in the new instalment of his action series 'Baaghi'. The recently released trailer for 'Baaghi 4' shows him battling the scariest antagonist, played by actor Sanjay Dutt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-6-latest-written-update-day-5-tanya-mittal-picks-kunickaa-sadanand-captain-gaurav-khanna-refuses-to-cook-2779127-2025-08-30",
      "headline": "Bigg Boss 19 episode 6: Tanya picks Kunickaa as captain, Gaurav refuses to cookTanya Mittal chose actor Kunickaa Sadanand as the first captain of 'Bigg Boss 19' in episode 6. The episode later saw Kunickaa clashing with Gaurav Khanna after he refused to cook. Farrhana Bhatt, who was in the secret room, also returned to the main house in the latest episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/cinematographers-the-art-of-adding-soul-to-film-and-job-that-often-goes-unnoticed-2778688-2025-08-30",
      "headline": "Cinematographers, the art of adding soul to film, and job that often goes unnoticedCinematographers shape how the audience feels in every scene of a film through light, framing, and movement. On this Cinematic Saturday, let's discuss how they can truly make or break a film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-heads-to-hyderabad-grandmother-death-ram-charan-cancels-shoot-2779091-2025-08-30",
      "headline": "Allu Arjun heads to Hyderabad after grandmother's death, Ram Charan cancels shootAllu Kanakaratnam, grandmother of actor Allu Arjun, died at 94 due to age-related causes. Actor Ram Charan cancelled 'Peddi' shoot, following her death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-day-1-sidharth-janhvi-film-earns-over-rs-7-crore-2779058-2025-08-30",
      "headline": "Param Sundari box office Day 1: Sidharth-Janhvi's film earns over Rs 7 crore'Param Sundari', featuring actors Sidharth Malhotra and Janhvi Kapoor, had a modest opening on its first day. The film released on August 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-ott-release-when-and-where-to-watch-anurag-basu-love-story-2778881-2025-08-29",
      "headline": "Metro In Dino OTT release: When and where to watch Anurag Basu's love storyDirector Anurag Basu's 'Metro…In Dino' (2025) is now streaming on Netflix India from August 29. The film is a spiritual sequel to his 2007 romantic-dramedy 'Life...In A Metro'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-holds-telephone-conversation-with-ukraines-zelenskyy-a-day-ahead-of-meeting-russias-putin-2779331-2025-08-30",
      "headline": "PM Modi speaks to Ukraine's Zelenskyy ahead of meeting with Russia's PutinThe two leaders spoke a day before PM Modi is scheduled to hold talks with Russia's Vladimir Putin in China's Tianjin, where they will be attending the SCO summit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-arrives-in-china-for-first-time-in-7-years-sco-meet-talks-with-xi-jinping-and-putin-on-agenda-2779219-2025-08-30",
      "headline": "PM arrives in China, his first visit in 7 years; SCO meet, talks with Xi on cardsPrime Minister Narendra Modi landed in Tianjin on Saturday, marking his first trip to China in seven years. PM Modi will meet Chinese President Xi Jinping on Sunday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/white-house-has-asked-europe-to-tariff-india-like-us-over-russian-oil-imports-say-sources-2779372-2025-08-30",
      "headline": "White House asking Europe to tariff India like US over Russian oil trade: SourcesTrump tariffs on India and Russia's war in Ukraine are likely to constitute a significant portion of the SCO summit discussions in Tianjin over the next two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/tejashwi-yadav-bihar-chief-ministerial-face-rahul-gandhi-elections-tightrope-2779245-2025-08-30",
      "headline": "Rahul Gandhi on stage, Tejashwi Yadav declares himself chief ministerial faceThe declaration comes despite Rahul Gandhi recently sidestepping questions on whether Tejashwi would be projected as the Grand Alliance's chief minister face in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/makhana-farmers-getting-their-due-bihar-assembly-election-ground-report-katihar-darbhanga-2779359-2025-08-30",
      "headline": "Bihar's makhana turns poll plank: Are farmers getting their due?Rahul Gandhi's meeting with makhana farmers in Katihar has brought focus back on those cultivating, harvesting, and processing this superfood. But, who is actually benefiting from the skyrocketing prices of fox nuts?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-7-live-updates-coco-gauff-jannik-sinner-iga-swiatek-2779309-2025-08-30",
      "headline": "Day 7 Live Updates: Sinner wins 2nd set vs Shapovalov, Osaka beats KasatkinaUS Open 2025 Day 7 Live Updates: Coco Gauff has advanced to the fourth round after beating Poland's Magdalena Frech on Centre Court. Jannik Sinner is currently playing his third round match against Denis Shapovalov in the morning session. Later in the day, Alexander Zverev and Iga Swiatek will be in action in the night matches. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dr-gradlin-roy-chennai-cardiac-surgeon-collapsed-in-hospital-during-ward-rounds-and-passed-away-despite-all-efforts-to-revive-2779342-2025-08-30",
      "headline": "Cardiac surgeon, 39, dies of heart attack during rounds at Chennai hospitalDr Gradlin Roy was a cardiac surgeon who collapsed during ward rounds on Wednesday and passed away despite desperate efforts to save him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-pm-narendra-modi-refused-donald-trump-calls-trade-deal-tariff-2779196-2025-08-30",
      "headline": "Why PM Modi might have refused to take Trump's callsA new report by the New York Times (NYT) backs a German newspaper's claim that Donald Trump called PM Modi several times in recent weeks over the stalled trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rajasthan-royals-exit-ipl-2025-riyan-parag-captaincy-2779357-2025-08-30",
      "headline": "Rahul Dravid's RR exit: Was he on same page with franchise on Riyan Parag captaincy?Rahul Dravid's shock exit as Rajasthan Royals head coach hints at deep-rooted disagreements over leadership choices and strategic control, with the IPL franchise facing tough calls after a disastrous season and looming captaincy changes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-refutes-india-bankrolling-russias-war-claims-scapegoating-new-delhi-wont-bring-peace-2779271-2025-08-30",
      "headline": "Scapegoating won't bring peace: Government sources on blaming India for Ukraine warUS President Donald Trump announced 25 per cent base tariffs on Indian imports and an additional 25 per cent duty for \"buying Russian oil,\" and putting money in Moscow's pocket that keeps its war in Ukraine going."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-vice-president-jagdeep-dhankar-wants-his-pension-as-ex-rajasthan-mla-to-resume-2779361-2025-08-30",
      "headline": "Ex-Vice President Jagdeep Dhankhar wants MLA pension, halted in 2019, restoredJagdeep Dhankhar was a Congress MLA from Rajathan's Kishangarh Assembly constituency between 1993 and 1998."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/job-losses-due-to-trump-tariffs-will-be-very-low-says-chief-economic-adviser-v-anantha-nageswaran-2779365-2025-08-31",
      "headline": "Trump tariffs pose low risk of job losses, but…, Chief Economic Adviser cautionsV Anantha Nageswaran pointed out that stronger domestic demand, supported by a good monsoon and growing rural consumption, could help make up for the impact of higher tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/jj-thomson-discovered-electron-taught-8-nobel-prize-winners-2779262-2025-08-30",
      "headline": "JJ Thomson, the man who discovered the electron and mentored 8 Nobel winnersJJ Thomson's discovery of the electron in 1897 reshaped physics forever. Honoured with the 1906 Nobel Prize, he mentored eight Nobel laureates at Cambridge, including his own son, leaving a legacy like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/career-catfishing-why-gen-z-is-ghosting-employers-after-job-offers-2779195-2025-08-30",
      "headline": "Career catfishing: Why Gen Z is ghosting employers after job offersCareer catfishing is the new workplace headache: candidates accept jobs, then vanish before day one. Surveys show it's most common among Gen Z. Is it payback for candidate ghosting, or a shift in workplace values? Here's why it happens, and what employers can do. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-china-visit-chinese-social-media-reactions-sco-summit-us-tariffs-donald-trump-xi-jinping-2779188-2025-08-30",
      "headline": "Modi at SCO: How Chinese internet reacts to PM's first visit in 7 yearsOn tightly controlled Chinese media and social platforms, users praise PM Modi's tough stance against US tariff bullying, but many still demand India's full alignment with Beijing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-airstrike-killed-prime-minister-of-houthi-controlled-government-in-yemens-sanaa-rebels-confirm-2779327-2025-08-30",
      "headline": "Houthi Prime Minister killed in Israeli airstrikes in Sanaa, rebel group confirmsAhmed al-Rahawi had been serving as prime minister of the Houthi-led government since August 2024. He was killed in recent Israeli airstrikes in Sanaa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/trump-era-policies-trigger-major-drop-in-foreign-enrolment-us-colleges-struggle-2779194-2025-08-30",
      "headline": "US colleges struggle after sharp drop in international student enrolmentUS colleges are under strain as F-1 visa approvals fell 12% between January and April 2025, followed by a 22% dip in May. Experts warn June could see up to a 90% drop, risking $7 billion in revenue losses and more than 60,000 local jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-518-29-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariffs-one-big-beautiful-bill-act-tax-bill-making-america-unaffordable-again-grocery-prices-electricity-hike-2778671-2025-08-30",
      "headline": "Trump tariffs wreak havoc at home, Americans cry over price riseDespite promises to lower costs and make America affordable again, Donald Trump's tariffs and tax policies are driving up grocery and electricity prices in the US. This is adding hundreds of dollars to the household expenses of Americans. Experts warn the trend could worsen, hitting low-and middle-income families hardest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-rss-chief-mohan-bhagwat-want-prevent-india-becoming-japan-fertility-rate-population-crisis-heres-more-2778674-2025-08-30",
      "headline": "Why RSS doesn't want India to become JapanRSS chief Mohan Bhagwat doesn't want India to become Japan, which saw a drop of almost a million people last year, the biggest for any country. This has implications for the very existence of the country. With similar concerns in mind, Bhagwat said every Indian should have three children in their family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/natures-fury-in-2025-is-human-engineered-lets-accept-it-2778862-2025-08-30",
      "headline": "Nature's fury in 2025 is human-engineered. Let's accept itIndia's recent devastating floods are far from natural disasters happening in isolation. They have the unmistakable imprint of human activities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/human-gps-bagu-khan-behind-over-100-infiltration-bids-killed-in-jk-encounter-gurez-2779157-2025-08-30",
      "headline": "'Human GPS' Bagu Khan, behind over 100 infiltration bids, killed in J&KSecurity forces killed Bagu Khan, aka Samandar Chacha, the \"human GPS\" of terror, in Gurez, ending his decades-long role in over 100 infiltration attempts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/trump-is-dead-trending-on-x-us-president-death-rumours-jd-vance-remark-viral-2779135-2025-08-30",
      "headline": "'Trump is dead': Why US President has become an unlikely trend'Trump is Dead' took X by storm on Saturday with more than 56,900 posts at the time of writing this report, fuelling ongoing speculation about the 79-year-old US President's health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maratha-quota-talks-manoj-jarange-patil-devendra-fadnavis-working-within-constitutional-framework-2779311-2025-08-30",
      "headline": "Working within constitutional framework: Fadnavis as Maratha quota talks fail againChief Minister Devendra Fadnavis has assured that the demands of the protesters will be addressed within the legal and constitutional framework as the agitation entered its second day on Saturday."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saim-ayub-hasan-nawaz-lead-pakistan-tri-series-win-uae-sharjah-2779379-2025-08-31",
      "headline": "Pakistan survive Asif Khan blitz to edge past resilient UAE in tri-seriesSaim Ayub and Hasan Nawaz starred with the bat as Pakistan secured a 31-run win over the UAE in the tri-series. Hasan Ali's timely wickets helped Pakistan fend off a late onslaught from Asif Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-sign-alejandro-garnacho-from-manchester-united-2779376-2025-08-31",
      "headline": "Chelsea snatch Alejandro Garnacho from rivals Manchester UnitedChelsea have secured Alejandro Garnacho on a long-term deal from Manchester United. This rare switch between rival clubs adds fresh firepower to Chelsea's attack while increasing pressure on United to strengthen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-lorenzo-musetti-us-open-round-4-2025-2779370-2025-08-30",
      "headline": "Coco Gauff storms into pre-quarters, Musetti advances after Cobolli retiresCoco Gauff and Lorenzo Musetti both secured spots in the US Open fourth round with commanding wins. Musetti's victory was bittersweet after his close friend Flavio Cobolli retired due to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-cancel-nicolas-jackson-loan-bayern-munich-liam-delap-injury-2779371-2025-08-30",
      "headline": "Chelsea block Nicolas Jackson's loan to Bayern Munich: ReportChelsea have pulled out of a loan deal sending Nicolas Jackson to Bayern Munich. The decision follows Liam Delap's injury, forcing Chelsea to keep Jackson as an additional option for the striker position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/davina-perrin-fastest-t20-century-english-woman-womens-hundred-2779362-2025-08-30",
      "headline": "Who is Davina Perrin? 18-year-old English batter scripts history with 42-ball hundred18-year-old Davina Perrin smashed the fastest century by an English woman in the Women's Hundred. Her innings powered the Northern Superchargers to a big win against London Spirit and highlighted her rising star status in women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-bruno-fernandes-penalty-burnley-ruben-amorim-bryan-mbeumo-2779360-2025-08-30",
      "headline": "Bruno Fernandes' late penalty seals Manchester United's 3-2 win vs BurnleyManchester United secured their first Premier League victory of the season with a stoppage-time penalty by Bruno Fernandes. The dramatic win lifts pressure on the team after a poor start and offers hope for better performances ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/matheus-cunha-hamstring-injury-manchester-united-premier-league-burnley-2779358-2025-08-30",
      "headline": "Manchester United's endless woes: Matheus Cunha walks off due to hamstring injuryMatheus Cunha suffered a hamstring injury early in Manchester United's Premier League match against Burnley. His absence adds to United's mounting challenges amid early season struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rajasthan-royals-exit-ipl-2025-riyan-parag-captaincy-2779357-2025-08-30",
      "headline": "Rahul Dravid's RR exit: Was he on same page with franchise on Riyan Parag captaincy?Rahul Dravid's shock exit as Rajasthan Royals head coach hints at deep-rooted disagreements over leadership choices and strategic control, with the IPL franchise facing tough calls after a disastrous season and looming captaincy changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-crush-netherlands-eight-wickets-litton-das-sylhet-t20i-2779349-2025-08-30",
      "headline": "Bangladesh hammer Netherlands in 1st T20I with biggest win at home in 10 yearsBangladesh started their Asia Cup preparation with a commanding eight-wicket win over the Netherlands in Sylhet. The dominant performance highlighted Litton Das's batting and Taskin Ahmed's bowling prowess, signalling strong form ahead of tougher matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rasmus-hojlund-napoli-transfer-manchester-united-reports-serie-a-2779338-2025-08-30",
      "headline": "Napoli complete Rasmus Hojlund loan move from Manchester United: ReportsNapoli have landed Manchester United striker Rasmus Hojlund on loan in a deal with a Champions League-triggered buy clause. The Danish forward now gets a chance to revive his career back in familiar Serie A surroundings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-nizar-11-sixes-kerala-cricket-league-power-hitting-calicut-globstars-win-2779332-2025-08-30",
      "headline": "Watch: Kerala batter goes berserk in local league, smashes 11 sixes in 12 ballsSalman Nizar's explosive batting led Calicut Globstars to a thrilling Kerala Cricket League victory. His 11 sixes in the final overs could boost his chances in the upcoming IPL auction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/matheus-cunha-hamstring-injury-manchester-united-premier-league-burnley-2779358-2025-08-30",
      "headline": "Manchester United's endless woes: Matheus Cunha walks off due to hamstring injuryMatheus Cunha suffered a hamstring injury early in Manchester United's Premier League match against Burnley. His absence adds to United's mounting challenges amid early season struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rajasthan-royals-exit-ipl-2025-riyan-parag-captaincy-2779357-2025-08-30",
      "headline": "Rahul Dravid's RR exit: Was he on same page with franchise on Riyan Parag captaincy?Rahul Dravid's shock exit as Rajasthan Royals head coach hints at deep-rooted disagreements over leadership choices and strategic control, with the IPL franchise facing tough calls after a disastrous season and looming captaincy changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-crush-netherlands-eight-wickets-litton-das-sylhet-t20i-2779349-2025-08-30",
      "headline": "Bangladesh hammer Netherlands in 1st T20I with biggest win at home in 10 yearsBangladesh started their Asia Cup preparation with a commanding eight-wicket win over the Netherlands in Sylhet. The dominant performance highlighted Litton Das's batting and Taskin Ahmed's bowling prowess, signalling strong form ahead of tougher matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rasmus-hojlund-napoli-transfer-manchester-united-reports-serie-a-2779338-2025-08-30",
      "headline": "Napoli complete Rasmus Hojlund loan move from Manchester United: ReportsNapoli have landed Manchester United striker Rasmus Hojlund on loan in a deal with a Champions League-triggered buy clause. The Danish forward now gets a chance to revive his career back in familiar Serie A surroundings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-nizar-11-sixes-kerala-cricket-league-power-hitting-calicut-globstars-win-2779332-2025-08-30",
      "headline": "Watch: Kerala batter goes berserk in local league, smashes 11 sixes in 12 ballsSalman Nizar's explosive batting led Calicut Globstars to a thrilling Kerala Cricket League victory. His 11 sixes in the final overs could boost his chances in the upcoming IPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-7-live-updates-coco-gauff-jannik-sinner-iga-swiatek-2779309-2025-08-30",
      "headline": "Day 7 Live Updates: Sinner wins 2nd set vs Shapovalov, Osaka beats KasatkinaUS Open 2025 Day 7 Live Updates: Coco Gauff has advanced to the fourth round after beating Poland's Magdalena Frech on Centre Court. Jannik Sinner is currently playing his third round match against Denis Shapovalov in the morning session. Later in the day, Alexander Zverev and Iga Swiatek will be in action in the night matches. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-gavi-knee-injury-flick-confirms-lopez-future-2779313-2025-08-30",
      "headline": "Gavi to return after break, Fermin Lopez staying at Barcelona, says FlickBarcelona midfielder Pablo Gavi will miss action until after the international break due to a knee injury. Manager Hansi Flick confirms Fermin Lopez is likely to stay amid transfer rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-india-travel-junior-hockey-world-cup-chief-confirms-2779307-2025-08-30",
      "headline": "Pakistan to travel to India for FIH Junior World Cup, confirms Hockey India chiefPakistan has confirmed participation in the FIH Junior World Cup in India later this year. Hockey India secretary general Bholanath Singh assured smooth arrangements despite recent political tensions and security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/christopher-nkunku-ac-milan-transfer-contract-chelsea-premier-league-2779301-2025-08-30",
      "headline": "AC Milan make big-money signing of Christopher Nkunku from Chelsea till 2030AC Milan have landed Christopher Nkunku from Chelsea in a 42-million-euro move, with the French forward eager to revive his form in Serie A after an injury-disrupted Premier League stint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-quarterfinal-rajat-patidar-central-zone-fify-mohammed-shami-east-zone-wicketless-2779296-2025-08-30",
      "headline": "Rajat Patidar's fifty extends Central Zone's lead, East Zone's Shami goes wicketlessCentral Zone took control in the Duleep Trophy quarterfinal with a massive 678-run lead. Patidar and Sharma's batting dominance puts North East Zone under severe pressure heading into the next innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-malaysia-coach-praises-india-korea-win-exclusive-2779292-2025-08-30",
      "headline": "India a class above everyone else in Asia Cup: Malaysia coach Sarjit KundanMalaysia coach Sarjit Kundan has said that India are the favourites to win the Asia Cup 2025 and is a level above the rest of the sides. Kundan also talked about the welcome his side has got in Rajgir so far. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-credits-mohammed-siraj-mental-strength-india-england-tour-2779289-2025-08-30",
      "headline": "How Siraj's advice helped Arshdeep Singh enjoy 'boring' phase before Asia Cup returnArshdeep Singh revealed how Mohammed Siraj supported him during a tough phase on the England tour. His advice helped Arshdeep enjoy difficult moments and stay mentally strong ahead of the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/christopher-nkunku-ac-milan-transfer-contract-chelsea-premier-league-2779301-2025-08-30",
      "headline": "AC Milan make big-money signing of Christopher Nkunku from Chelsea till 2030AC Milan have landed Christopher Nkunku from Chelsea in a 42-million-euro move, with the French forward eager to revive his form in Serie A after an injury-disrupted Premier League stint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-quarterfinal-rajat-patidar-central-zone-fify-mohammed-shami-east-zone-wicketless-2779296-2025-08-30",
      "headline": "Rajat Patidar's fifty extends Central Zone's lead, East Zone's Shami goes wicketlessCentral Zone took control in the Duleep Trophy quarterfinal with a massive 678-run lead. Patidar and Sharma's batting dominance puts North East Zone under severe pressure heading into the next innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-malaysia-coach-praises-india-korea-win-exclusive-2779292-2025-08-30",
      "headline": "India a class above everyone else in Asia Cup: Malaysia coach Sarjit KundanMalaysia coach Sarjit Kundan has said that India are the favourites to win the Asia Cup 2025 and is a level above the rest of the sides. Kundan also talked about the welcome his side has got in Rajgir so far. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-credits-mohammed-siraj-mental-strength-india-england-tour-2779289-2025-08-30",
      "headline": "How Siraj's advice helped Arshdeep Singh enjoy 'boring' phase before Asia Cup returnArshdeep Singh revealed how Mohammed Siraj supported him during a tough phase on the England tour. His advice helped Arshdeep enjoy difficult moments and stay mentally strong ahead of the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-tokyo-championship-world-athletics-vice-president-backing-2779274-2025-08-30",
      "headline": "Neeraj Chopra performs when he has to: Sumariwalla ahead of Tokyo World ChampionshipWorld Athletics Vice President Adille Sumariwalla has backed Neeraj Chopra to shine at the upcoming World Championships in Tokyo, brushing aside concerns after the javelin ace finished second behind Germany's Julian Weber in the Zurich Diamond League Final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-match-timings-shifted-30-minutes-uae-heat-2779267-2025-08-30",
      "headline": "Asia Cup 2025 matches to start 30 minutes later due to extreme heat in UAEThe Asia Cup 2025 match timings have been adjusted by 30 minutes to tackle extreme heat in the UAE, as confirmed by the Emirates Cricket Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-malaysia-vs-korea-bangladesh-vs-taipei-results-2779255-2025-08-30",
      "headline": "Asia Cup: Malaysia beat Korea to edge close to Super 4s, Bangladesh thrash TaipeiMalaysia produced a dominant performance to stun Korea and edge closer to the Super 4s of the Asia Cup on Saturday, August 30. Bangladesh, meanwhile, ripped through Chinese Taipei to keep their hopes alive in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/spain-fifa-world-cup-qualifiers-squad-dani-carvajal-rodri-return-2779225-2025-08-30",
      "headline": "Dani Carvajal, Rodri return to Spain's World Cup Qualifiers squad after injuriesSpain's World Cup 2026 qualifying hopes have received a major lift with Rodri and Dani Carvajal returning from long-term injuries, as head coach Luis de la Fuente names his squad for the crucial September fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-sign-nick-woltemade-69-million-record-liverpool-target-alexander-isak-2779215-2025-08-30",
      "headline": "Newcastle sign Stuttgart striker Nick Woltemade in record deal as Isak exit loomsNewcastle have signed Stuttgart striker Nick Woltemade in a club-record £69 million deal, paving the way for Liverpool to lodge a British-record bid for Alexander Isak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/portugal-diogo-jota-jersey-ruben-neves-honour-roberto-martinez-2779174-2025-08-30",
      "headline": "Portugal set to hand Diogo Jota's number 21 kit to his close friend Ruben NevesPortugal will honour the late Diogo Jota by passing his iconic No. 21 jersey to close friend Rúben Neves, with coach Roberto Martinez calling it a gesture to keep Jota's dream alive on the pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rahul-dravid-quits-head-coach-rajasthan-royals-2779175-2025-08-30",
      "headline": "Rahul Dravid steps down as head coach of Rajasthan RoyalsIndian Premier League (IPL) franchise Rajasthan Royals have confirmed that head coach Rahul Dravid will not continue with the franchise ahead of IPL 2026, bringing an abrupt end to his second stint with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-7-gauff-sinner-swiatek-osaka-key-matches-2779162-2025-08-30",
      "headline": "US Open, Day 7, Order of Play: Sinner, Swiatek eye fourth-round berthDay 7 of the US Open 2025 on Saturday, 30 August, wraps up the third round with title favourites Jannik Sinner, Iga Swiatek and defending champion Coco Gauff headlining the action in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cody-and-brandi-rhodes-second-baby-announcement-2779154-2025-08-30",
      "headline": "Cody and Brandi Rhodes surprise fans with second baby announcementCody and Brandi Rhodes welcome their second daughter, Leilani Ella Runnels in a surprise announcement, marking a new chapter for WWE's power couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-indian-fan-zones-sell-out-white-ball-series-2779145-2025-08-30",
      "headline": "Indian fan zones sold out 50 days ahead of series, says Cricket AustraliaCricket Australia has announced that the dedicated Indian fan zones at all eight venues for the upcoming white-ball series against India have been sold out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-shubman-gill-yashasvi-jaiswal-to-undergo-fitnes-test-at-coe-2779134-2025-08-30",
      "headline": "Bumrah, Shubman Gill among others to undergo pre-season fitnes tests at COEIndia's Test skipper Shubman Gill has reached BCCI Centre of Excellence for fitness checks ahead of Asia Cup 2025. Jasprit Bumrah, Washington Sundar, Yashasvi Jaiswal, Mohammad Siraj and Shardul Thakur too are set to arrive at CoE for the mandatory pre-season assessment."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}