{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nithin-kamath-explains-how-sebi-quiet-tech-reform-is-empowering-investors-2770544-2025-08-13",
      "headline": "Nithin Kamath explains how Sebi's quiet tech reform is empowering investorsBrokerage firms have to connect with several entities, like multiple stock exchanges, depositories, banks, and others. This meant hundreds of APIs and file formats had to be handled separately, creating hidden challenges behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-mutual-fund-investing-risk-hungry-mid-cap-small-cap-sip-india-2770152-2025-08-13",
      "headline": "SIPs, small-caps, and the Gen Z rush for high returnsGen Z investors are chasing big gains in mid- and small-cap funds, but soaring valuations and volatile markets mean the ride could get bumpy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-property-for-the-first-time-must-know-financial-steps-for-beginners-first-time-homebuyer-tips-2770462-2025-08-13",
      "headline": "Tax perks, hidden costs, rental yield: What first-time homebuyers should knowStepping into the property market for the first time? Before you sign any papers, make sure you're financially prepared to handle not just the purchase price but the many hidden costs that follow. Here's a beginner's financial checklist to make your property investment a smart one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-share-price-tumbles-5-percent-today-q1-results-2770465-2025-08-13",
      "headline": "NSDL rally hits roadblock after Q1 results, shares tumble nearly 5%. What next?After a strong IPO and initial rally, investors are reassessing NSDL's near-term growth prospects in light of mixed operational performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-share-price-jumps-today-online-payment-aggregator-rbi-apporval-2770443-2025-08-13",
      "headline": "Explained: Why Paytm shares surged over 5% todayPaytm's share price rallied nearly 6% after RBI approval, lifting investor optimism amid steady business performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-300-points-nifty-nears-24600-amid-positive-global-cues-2770435-2025-08-13",
      "headline": "Markets open higher on easing inflation; mixed global cues keep investors cautiousThe S&P BSE Sensex initially rose over 300 points but pared some gains to trade 155.05 points higher at 80,390.64 around 9:25 am. The NSE Nifty50 was up 71.60 points to 24,559."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sunjay-kapurs-rs-30000-crore-fortune-without-a-will-who-stands-to-gain-most-2770414-2025-08-13",
      "headline": "Sunjay Kapur's Rs 30,000-crore fortune without a will: Who's likely to gain most?In the weeks since Sunjay Kapur's death, the silence around succession has been broken by a chorus of competing voices: his mother Rani Kapur, his widow Priya Sachdev Kapur, his sisters, and even mentions of his former wives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nikkei-japan-share-average-record-high-asia-stock-markets-rally-2770412-2025-08-13",
      "headline": "Nikkei's share average hits record-high, tops 43,000 for first timeThe Nikkei .N225 on Wednesday rose as much as 1.2 per cent in the first few minutes of trade to reach a record 43,241.27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-banks-rs-500-crore-loan-sale-under-scanner-lapses-irregularities-round-tipping-2770323-2025-08-12",
      "headline": "Lapses, irregularities, round tipping: Yes Bank's Rs 500 crore loan sale under scannerThe audit found indications that YES Bank may have indirectly financed the purchase of its own stressed asset. The transaction dates back to March 31, 2017, when the bank sold HDIL's non-performing loan, valued at over Rs 523 crore including interest, to Suraksha ARC for Rs 518 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-retain-crown-as-india-most-valuable-family-business-in-2025-2770069-2025-08-12",
      "headline": "Ambanis retain crown as India's most valuable family business in 2025Mukesh Ambani leads Reliance Industries Limited, which has roots in the energy sector but also has major operations in retail and digital services. Founded in 1957 by Dhirubhai Ambani, the company is now managed by the second generation and continues to be a key force in India's economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-rejects-anil-ambani-plea-in-yes-bank-case-ed-probe-continues-report-2770146-2025-08-12",
      "headline": "Sebi rejects Anil Ambani's plea in Yes Bank case, ED probe continues: ReportThe case relates to investments worth Rs 21,500 crore made by Reliance Mutual Fund, then owned by Anil Ambani, in Yes Bank's additional tier-1 (AT-1) bonds between 2016 and 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-drops-to-155-in-july-lowest-since-july-2017-2770104-2025-08-12",
      "headline": "Retail inflation eases to 8-year low of 1.55% in JulyRetail inflation declined to an 8-year low in July 2025 as food prices plunged sharply. Both rural and urban areas experienced deflation in food prices, with rural food inflation at -1.74% and urban at -1.90%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnuvardhan-memorial-demolition-sparks-controversy-sudeep-calls-it-cowardice-2770205-2025-08-13",
      "headline": "Why Karnataka is enraged over demolition of Kannada icon Vishnuvardhan's memorialThe demolition of Kannada matinee icon Dr Vishnuvardhan's memorial in Bengaluru has sparked outrage among fans who condemned the act. Several actors, including Kichcha Sudeep and Rishab Shetty voiced their opinions on the matter, criticising the act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-markle-season-2-trailer-netflix-tan-france-chrissy-teigen-jay-shetty-2770486-2025-08-13",
      "headline": "With Love Meghan season 2 trailer: Meghan Markle's show to feature Jay Shetty'With Love, Meghan' is set to return on Netflix on August 26 with its second season. The trailer for the upcoming show was released on Tuesday. The second season will feature guests like television personalities Tan France, Chrissy Teigen and podcaster Jay Shetty.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/olivia-rodrigo-diamond-ring-engagement-louis-partridge-rumours-2770440-2025-08-13",
      "headline": "Olivia Rodrigo's diamond ring fuels buzz about engagement to Louis PartridgePopstar Olivia Rodrigo was seen in Los Angeles with boyfriend Louis Partridge, wearing a diamond ring on her engagement finger, prompting speculation about a possible engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bosco-martis-on-alpha-alia-bhatt-sharvari-2770475-2025-08-13",
      "headline": "Choreographer Bosco Martis on Alpha: You'll see a new Alia and SharvariBosco Martis is excited about his choreography for Yash Raj Films' action film 'Alpha'. The movie promises fresh performances and a stylish spy thriller experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-first-review-udhayanidhi-stalin-rajinikanth-ultimate-mass-entertainer-2770507-2025-08-13",
      "headline": "Coolie first review: Udhayanidhi Stalin calls Rajinikanth film ultimate entertainerUdhayanidhi Stalin, Deputy Chief Minister of Tamil Nadu and former actor and producer, watched Rajinikanth's 'Coolie' ahead of its grand release. He called it an ultimate mass entertainer that will impress people of all ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-amitabh-bachchan-recalls-treating-parents-dinner-first-salary-2770459-2025-08-13",
      "headline": "KBC 17: Amitabh Bachchan recalls treating parents to dinner with first salaryThe premiere show of KBC 17 saw Amitabh Bachchan recalling the first time he took his parents out to a restaurant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/reinvention-of-jr-ntr-star-is-redefining-his-image-before-war-2-release-2770455-2025-08-13",
      "headline": "Reinvention of Jr NTR: How the star is redefining his image for pan-India audienceJr NTR is set to make a significant impact in Bollywood with 'War 2', starring opposite Hrithik Roshan. This film is expected to elevate his status from a Telugu superstar to a pan-Indian icon, blending action and emotional depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/war-2-jr-ntr-thanks-chandrababu-naidu-pawan-kalyan-price-hike-extra-shows-andhra-pradesh-2770456-2025-08-13",
      "headline": "War 2: Jr NTR thanks Naidu, Pawan Kalyan for price hike, extra shows in AndhraAhead of 'War 2' release, Jr NTR, in a post, expressed his gratitude to Andhra Pradesh Chief Minister N Chandrababu Naidu and Deputy CM Pawan Kalyan for their support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-note-for-shefali-jariwala-wedding-anniversary-2770437-2025-08-13",
      "headline": "You made my life colourful: Parag Tyagi's note for Shefali on wedding anniversaryOn Tuesday, actor Parag Tyagi marked his 11th wedding anniversary with Shefali Jariwala by sharing a heartfelt note on Instagram. The couple's journey began in 2010 when they first met.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-celebrates-sridevi-birth-anniversary-ith-special-anecdote-old-post-2770422-2025-08-13",
      "headline": "Boney Kapoor's sweet gesture for Sridevi's 27th birthday backfired. See picBoney Kapoor shared a special post on his wife Sridevi's 62nd birth anniversary. He recalled an anecdote about his sweet gesture for his late wife on her 27th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-director-lokesh-kanagaraj-will-he-balance-rajinikanths-star-power-story-2770135-2025-08-13",
      "headline": "Balancing Rajinikanth's stardom and story: Coolie director Lokesh Kanagaraj's big test'Coolie' isn't just a gift for Rajinikanth's 50th-year celebration, it's director Lokesh Kanagaraj's boldest gamble yet, balancing superstar swagger, ensemble weight, and a possible sci-fi twist in a saturated gangster genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-love-story-friendship-band-to-romance-2770407-2025-08-13",
      "headline": "Taylor Swift and Travis Kelce's love story: From friendship band to epic romanceTravis Kelce shared insights on his natural romance with Taylor Swift amid media attention. He recalled how he gifted her a friendship bracelet with his number on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/court-kacheri-review-legal-drama-father-son-conflict-pawan-malhotra-ashish-verma-2770367-2025-08-13",
      "headline": "Court Kacheri review: Strong performances are the USP of this legal dramedyRelease Date:Wed Aug 13, 2025Court Kacheri series review: 'Court Kacheri' is a coming-of-age legal drama focusing on a fractured father-son relationship. The series is currently streaming on SonyLiv. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-release-ticket-prices-end-credits-advance-booking-all-you-need-to-know-hrithik-roshan-jr-ntr-kiara-advani-2770267-2025-08-12",
      "headline": "War 2 release, ticket prices, end credits, advance booking - all you need to knowWar 2 featuring actors Hrithik Roshan and Jr NTR releases on August 14, coinciding with actor Rajinikanth's Coolie. Here's a look at the ticket prices, advance booking report, box office prediction, end credits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-body-shames-bipasha-basu-in-old-viral-video-calls-her-manly-with-muscles-watch-2770269-2025-08-12",
      "headline": "Mrunal Thakur body-shames Bipasha Basu in old video, calls her manly with musclesAmid rumours of her relationship with actor Dhanush, an old video of Mrunal Thakur is going viral in which she is seen body-shaming Bipasha Basu for looking 'manly'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-war-2-advance-bookings-expert-opinion-rajinikanth-hrithik-roshan-jr-ntr-kiara-advani-2770147-2025-08-12",
      "headline": "Coolie vs War 2 advance booking: Expert says clear win for Rajinikanth's filmAhead of its release, 'Coolie' is leading against Hrithik Roshan and Jr NTR's 'War 2' in advance sales. Trade expert Ramesh Bala noted that the Rajinikanth-starrer is estimated to have crossed Rs 80 crore in advance sales. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/did-aamir-khan-charge-rs-20-crore-for-rajinikanths-coolie-heres-the-truth-2770251-2025-08-12",
      "headline": "Did Aamir Khan charge Rs 20 crore for Rajinikanth's Coolie? Here's the truthAs opposed to the viral reports, actor Aamir Khan is not charging anything for his brief role in 'Coolie'. The actor is playing a negative role in the Lokesh Kanagaraj directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/national-awards-losing-relevance-commercialisation-indie-cinema-debate-shah-rukh-khan-jawan-2770215-2025-08-12",
      "headline": "From art to mass appeal: Are the National Awards losing relevance? Experts answerNational Awards are facing criticism for favouring commercial blockbusters over indie films. Experts question if the awards still hold their original relevance in today's social media age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-nice-guy-lee-dong-wook-gangster-drama-family-love-survival-2770131-2025-08-12",
      "headline": "The Nice Guy review: Lee Dong-wook's drama is slow, sweet, and strikingly relevantRelease Date:Fri Jul 18, 2025The Nice Guy Kdrama review: The Lee Dong-wook starrer offers a slow, heartfelt take on the gangster drama genre. It highlights the struggles of family duty and dreams amid harsh realities."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/will-look-into-it-says-chief-justice-amid-fury-over-supreme-courts-dog-relocation-order-2770483-2025-08-13",
      "headline": "Will look into it: Chief Justice amid fury over Supreme Court's stray dog orderRecently, the Supreme Court directed civic bodies to round up all stray dogs in Delhi-NCR within eight weeks and send them to shelters. The order triggered a backlash from animal activists and NGOs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-likely-to-visit-us-next-month-hold-bilateral-talks-with-trump-during-un-meet-amid-tariff-row-2770399-2025-08-13",
      "headline": "PM Modi likely to meet Trump next month in US as trade tensions simmerDuring PM Modi's likely visit to New York, plans are afoot to schedule a meeting with US President Donald Trump to iron out issues on trade amid a downturn in ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajiv-pratap-rudy-triumphs-in-bjp-vs-bjp-constitution-club-election-battle-2770467-2025-08-13",
      "headline": "Rajiv Rudy triumphs in Delhi club battle that saw Amit Shah, Sonia Gandhi voteBJP leader Rajiv Pratap Rudy has maintained his 25-year-old dominance in the Constitution Club management, seeing off a challenge from his party colleague Sanjeev Balyan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-congress-apologise-kiren-rijiju-after-minta-devi-fumes-at-tshirt-protest-2770530-2025-08-13",
      "headline": "Will Congress apologise? Kiren Rijiju after Minta Devi fumes at t-shirt protestUnion Minister Kiren Rijiju on Weesday criticised the Congress party and Opposition MPs for allegedly mocking a Bihar woman, Minta Devi, during their protest against the Special Intensive Revision (SIR) of voter rolls in Bihar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/no-shelters-abc-simple-and-sound-is-the-way-forward-2770501-2025-08-13",
      "headline": "No Shelters. ABC, Simple and Sound is the way forwardThe Supreme Court's August 11 order - to remove stray dogs from the streets, sterilise them and move them to shelters permanently - is neither practical nor humane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/olympic-association-approves-indias-2030-commonwealth-games-bid-set-to-submit-documents-on-august-31-2770548-2025-08-13",
      "headline": "Indian Olympic Association approves bid to host Commonwealth Games 2030The Indian Olympic Association has approved India's 2030 Commonwealth Games bid, in a SGM meeting on August 13. The final date to submit documents is August 31."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sunjay-kapurs-rs-30000-crore-fortune-without-a-will-who-stands-to-gain-most-2770414-2025-08-13",
      "headline": "Sunjay Kapur's Rs 30,000-crore fortune without a will: Who's likely to gain most?In the weeks since Sunjay Kapur's death, the silence around succession has been broken by a chorus of competing voices: his mother Rani Kapur, his widow Priya Sachdev Kapur, his sisters, and even mentions of his former wives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-best-society-polls-will-be-first-ground-test-of-uddhav-raj-thackeray-pact-2769649-2025-08-11",
      "headline": "Why BEST society polls will be first ground test of Uddhav-Raj Thackeray pactThe Shiv Sena (UBT) and Maharashtra Navnirman Sena joining forces could galvanise their core Marathi voters in and around Mumbai and pay off in the BMC polls due this year\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kbc-officers-sofiya-qureshi-vyomika-singh-operation-sindoor-controversy-2770426-2025-08-13",
      "headline": "KBC hosts officers Sofiya Qureshi, Vyomika Singh after Op Sindoor, stirs rowColonel Sofiya Qureshi and Wing Commander Vyomika Singh, who were the face of Operation Sindoor and led the media briefings, will appear on a special episode of KBC. A promo of the episode has sparked a controversy. Here is why."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/specially-abled-up-woman-chased-by-bike-borne-men-on-deserted-road-raped-2770401-2025-08-13",
      "headline": "CCTV shows disabled UP woman chased on deserted road, cops say she was rapedA 21-year-old specially-abled woman was allegedly raped in Uttar Pradesh's Balrampur, police said. The survivor was caught on camera running for her life on a deserted road, with bike-borne men chasing her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/gaganyaan-mission/story/from-launch-prep-to-astronaut-training-latest-on-isros-gaganyaan-mission-2770525-2025-08-13",
      "headline": "Gaganyaan: Isro to resume astronaut training, prep for G1 launchThe spacecraft, set to be launched from the Satish Dhawan Space Centre, will circle the planet in a low-Earth orbit for approximately three days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-attack-on-army-post-in-jks-baramulla-foiled-soldier-critically-injured-2770473-2025-08-13",
      "headline": "Pak attack on Army post in J&K's Baramulla foiled, soldier killedThe Indian Army launched a large-scale cordon and search operation in the Uri sector of Baramulla district, foiling a major infiltration attempt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-director-lokesh-kanagaraj-will-he-balance-rajinikanths-star-power-story-2770135-2025-08-13",
      "headline": "Balancing Rajinikanth's stardom and story: Coolie director Lokesh Kanagaraj's big test'Coolie' isn't just a gift for Rajinikanth's 50th-year celebration, it's director Lokesh Kanagaraj's boldest gamble yet, balancing superstar swagger, ensemble weight, and a possible sci-fi twist in a saturated gangster genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-congress-lok-sabha-seats-vote-chori-row-election-commission-2770457-2025-08-13",
      "headline": "Vote chori behind Congress's loss in 70 seats? Rahul Gandhi points to 50,000 marginAmid the vote chori row, Congress MP Rahul Gandhi said the party was working to see whether the victories in 70 Lok Sabha seats by the BJP were genuine, sources told India Today TV. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-india-fastest-man-athletics-100m-sprint-2770432-2025-08-13",
      "headline": "Behind the speed: The making of Animesh Kujur, India's fastest manIndia Today spent a full morning with Animesh Kujur in Bhubaneshwar. Animesh, spoke to the publication about his childhood, upbringing and the relentless pursuit to become better every day. As he builds for the World Championships, here's a detailed look at how he became the fastest man in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnuvardhan-memorial-demolition-sparks-controversy-sudeep-calls-it-cowardice-2770205-2025-08-13",
      "headline": "Why Karnataka is enraged over demolition of Kannada icon Vishnuvardhan's memorialThe demolition of Kannada matinee icon Dr Vishnuvardhan's memorial in Bengaluru has sparked outrage among fans who condemned the act. Several actors, including Kichcha Sudeep and Rishab Shetty voiced their opinions on the matter, criticising the act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/why-the-weight-you-lose-quickly-returns-and-how-to-stop-it-2770063-2025-08-13",
      "headline": "Why the weight you lose quickly returns (and how to stop it)From the high of proudly losing 10 kg in a month to the disappointment of gaining it all back, the quick-loss–quick-gain cycle takes a toll on your body and mind. But with the right approach, you can shed it in a way that's sustainable and lasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-next-for-bengali-migrants-heeding-mamata-call-to-return-from-bjp-ruled-states-2769608-2025-08-11",
      "headline": "What next for Bengali migrants heeding Mamata call to return from BJP-ruled states?Bengali identity politics aside, the returnees pose both a humanitarian and socioeconomic integration challenge for the Trinamool Congress government\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-love-story-friendship-band-to-romance-2770407-2025-08-13",
      "headline": "Taylor Swift and Travis Kelce's love story: From friendship band to epic romanceTravis Kelce shared insights on his natural romance with Taylor Swift amid media attention. He recalled how he gifted her a friendship bracelet with his number on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/why-independence-came-late-for-these-indians-in-1947-2770514-2025-08-13",
      "headline": "Why Independence came late for these Indians in 1947Most of India celebrates Independence on August 15. But for some, the tricolour rose only on August 18 here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-property-for-the-first-time-must-know-financial-steps-for-beginners-first-time-homebuyer-tips-2770462-2025-08-13",
      "headline": "Tax perks, hidden costs, rental yield: What first-time homebuyers should knowStepping into the property market for the first time? Before you sign any papers, make sure you're financially prepared to handle not just the purchase price but the many hidden costs that follow. Here's a beginner's financial checklist to make your property investment a smart one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meat-sale-banned-in-kalyan-on-independence-day-order-sparks-political-storm-2770294-2025-08-12",
      "headline": "Meat sale banned in Kalyan on Independence Day, order sparks political stormAs per the KDMC order, all slaughterhouses and shops of licenced butchers of goats, sheep, chickens, and large animals must remain closed for 24 hours from midnight of August 14 till midnight of August 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-cites-50-sons-of-1-man-to-claim-varanasi-voter-fraud-whats-the-truth-2770393-2025-08-13",
      "headline": "Congress cites '50 sons of 1 man' to claim Varanasi voter fraud. What's the truth?The controversy began after the UP Congress posted on social media a voter list from the Kashmiriganj area of Varanasi's Ward No. 51, claiming that over 50 people were registered as \"sons\" of a single man, Ramkamal Das. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sacked-karnataka-minister-kn-rajanna-question-congress-voter-fraud-sir-rahul-gandhi-party-high-command-controversy-2770253-2025-08-13",
      "headline": "A question Congress needs to answer on sacked Karnataka ministerThe Congress is seeking answers from the Election Commission over electoral rolls. However, it has fired a Karnataka minister for asking pertinent questions on the same issue. What were the troubling questions that made the Congress remove a minister? Will Congress answer the one big question?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnuvardhan-memorial-demolition-sparks-controversy-sudeep-calls-it-cowardice-2770205-2025-08-13",
      "headline": "Why Karnataka is enraged over demolition of Kannada icon Vishnuvardhan's memorialThe demolition of Kannada matinee icon Dr Vishnuvardhan's memorial in Bengaluru has sparked outrage among fans who condemned the act. Several actors, including Kichcha Sudeep and Rishab Shetty voiced their opinions on the matter, criticising the act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/war-2-rani-mukerji-ayan-mukerji-visit-shirdi-ahead-of-hrithik-roshan-jr-ntr-release-2770524-2025-08-13",
      "headline": "War 2: Rani and Ayan Mukerji visit Shirdi ahead of Hrithik-Jr NTR's film releaseRani Mukerji and Ayan Mukerji visited Shirdi to seek blessings for the upcoming film 'War 2'. Directed by Ayan, the movie will release in theatres on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bosco-martis-on-alpha-alia-bhatt-sharvari-2770475-2025-08-13",
      "headline": "Choreographer Bosco Martis on Alpha: You'll see a new Alia and SharvariBosco Martis is excited about his choreography for Yash Raj Films' action film 'Alpha'. The movie promises fresh performances and a stylish spy thriller experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-first-review-udhayanidhi-stalin-rajinikanth-ultimate-mass-entertainer-2770507-2025-08-13",
      "headline": "Coolie first review: Udhayanidhi Stalin calls Rajinikanth film ultimate entertainerUdhayanidhi Stalin, Deputy Chief Minister of Tamil Nadu and former actor and producer, watched Rajinikanth's 'Coolie' ahead of its grand release. He called it an ultimate mass entertainer that will impress people of all ages."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/olympic-association-approves-indias-2030-commonwealth-games-bid-set-to-submit-documents-on-august-31-2770548-2025-08-13",
      "headline": "Indian Olympic Association approves bid to host Commonwealth Games 2030The Indian Olympic Association has approved India's 2030 Commonwealth Games bid, in a SGM meeting on August 13. The final date to submit documents is August 31."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sumpreme-cancels-sushil-kumars-bail-in-sagar-dhankad-murder-case-2770513-2025-08-13",
      "headline": "SC cancels Sushil Kumar's bail in murder case, ordered to surrender within a weekThe Supreme Court of India has cancelled Sushil Kumar's bail in the Sagar Dhankar murder case and has ordered him to surrender within a week. Sushil was granted bail by the Delhi High Court in March earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-pak-3rd-odi-jayden-seales-breaks-dale-steyns-record-2770495-2025-08-13",
      "headline": "Jayden Seales breaks Steyn's 12-year-old record with menacing spell vs PakistanWest Indies fast bowler Jayden Seales etched his name in the history books as he broke Dale Steyn's 12-year-old record with a breathtaking spell vs Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-transfers-team-revamp-old-trafford-2770485-2025-08-13",
      "headline": "Premier League: Can Manchester United turn their revamp to redemption?Manchester United begin a new era under Ruben Amorim after their worst league finish in history. A revamped attack, steadier defence, and lingering midfield doubts set the stage for a high-stakes opener against Arsenal on August 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-wtc-2nd-tier-clive-llyod-test-cricket-2770474-2025-08-13",
      "headline": "West Indies needs to stand up to ICC: Clive LlyodFormer cricketer Clive Lloyd has warned West Indies that they may remain in the World Test Championship's lower tier if a two-tier system starts. Llyod has called for an urgent revamp of the financial structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-india-fastest-man-athletics-100m-sprint-2770432-2025-08-13",
      "headline": "Behind the speed: The making of Animesh Kujur, India's fastest manIndia Today spent a full morning with Animesh Kujur in Bhubaneshwar. Animesh, spoke to the publication about his childhood, upbringing and the relentless pursuit to become better every day. As he builds for the World Championships, here's a detailed look at how he became the fastest man in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-divya-deshmukh-world-cup-womens-speed-championship-2770416-2025-08-13",
      "headline": "Fresh off World Cup success, Divya Deshmukh continues giant-slaying runFresh from her historic Women's World Cup triumph, 19-year-old Divya Deshmukh underlined her status as India's brightest chess prospect with a commanding 10–3 demolition of China's world No. 7 Lei Tingjie at the 2025 Women's Speed Chess Championship, adding another top-ranked scalp to her growing list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-odi-babar-azam-mohammed-rizwan-92-all-out-2770413-2025-08-13",
      "headline": "Hope 120, Pakistan 92-all out: Fans fume over 1st ODI series loss in 34 yearsPakistan fans lost their cool at the cricket team after Mohammed Rizwan's side were bowled out for just 92 runs in the series-decider against West Indies. This is the first time that Pakistan have lost an ODI bilateral to West Indies since 1991/92.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vice-captaincy-t20i-comeback-asia-cup-2025-2770290-2025-08-13",
      "headline": "Next vice-captain? Does Shubman Gill deserve a spot in T20I team?Star India batter Shubman Gill's name is being widely discussed to make a comeback in the T20I side ahead of the Asia Cup 2025. However, does Gill warrant a place in the current setup with his measured approach remains a big question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-cricket-glory-days-days-funding-feature-opinion-2770352-2025-08-12",
      "headline": "West Indies cricket battles funding crisis as glory days fade into distant memoryWest Indies cricket, once a dominant global force, now faces a deep crisis driven by years of mismanagement, financial instability, and player exodus to lucrative T20 leagues. The decline stems from systemic governance failures, crumbling infrastructure, and a loss of national pride, turning a proud legacy into a cautionary tale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brian-lara-west-indies-vs-pakistan-3rd-odi-2770346-2025-08-12",
      "headline": "Shai Hope closes in on Brian Lara with 18th ODI centuryWI vs PAK: Shai Hope scored his 18th ODI century with an unbeaten 120 against Pakistan, surpassing Desmond Haynes and closing in on Brian Lara's record of 19 centuries, helping West Indies post 294 for six in the series decider.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-divya-deshmukh-world-cup-womens-speed-championship-2770416-2025-08-13",
      "headline": "Fresh off World Cup success, Divya Deshmukh continues giant-slaying runFresh from her historic Women's World Cup triumph, 19-year-old Divya Deshmukh underlined her status as India's brightest chess prospect with a commanding 10–3 demolition of China's world No. 7 Lei Tingjie at the 2025 Women's Speed Chess Championship, adding another top-ranked scalp to her growing list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-odi-babar-azam-mohammed-rizwan-92-all-out-2770413-2025-08-13",
      "headline": "Hope 120, Pakistan 92-all out: Fans fume over 1st ODI series loss in 34 yearsPakistan fans lost their cool at the cricket team after Mohammed Rizwan's side were bowled out for just 92 runs in the series-decider against West Indies. This is the first time that Pakistan have lost an ODI bilateral to West Indies since 1991/92.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vice-captaincy-t20i-comeback-asia-cup-2025-2770290-2025-08-13",
      "headline": "Next vice-captain? Does Shubman Gill deserve a spot in T20I team?Star India batter Shubman Gill's name is being widely discussed to make a comeback in the T20I side ahead of the Asia Cup 2025. However, does Gill warrant a place in the current setup with his measured approach remains a big question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-cricket-glory-days-days-funding-feature-opinion-2770352-2025-08-12",
      "headline": "West Indies cricket battles funding crisis as glory days fade into distant memoryWest Indies cricket, once a dominant global force, now faces a deep crisis driven by years of mismanagement, financial instability, and player exodus to lucrative T20 leagues. The decline stems from systemic governance failures, crumbling infrastructure, and a loss of national pride, turning a proud legacy into a cautionary tale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brian-lara-west-indies-vs-pakistan-3rd-odi-2770346-2025-08-12",
      "headline": "Shai Hope closes in on Brian Lara with 18th ODI centuryWI vs PAK: Shai Hope scored his 18th ODI century with an unbeaten 120 against Pakistan, surpassing Desmond Haynes and closing in on Brian Lara's record of 19 centuries, helping West Indies post 294 for six in the series decider.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}