{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/eroded-public-trust-dgca-fines-air-india-rs-1-crore-for-flying-airbus-8-times-without-airworthiness-permit-2867894-2026-02-13",
      "headline": "Air India fined Rs 1 crore for flying Airbus 8 times without airworthiness permitThe DGCA has imposed a fine of about Rs 1 crore on Air India for flying an Airbus aircraft eight times without a valid airworthiness permit. The aviation watchdog also said the lapse further eroded public trust in the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-personalised-loans-are-becoming-the-go-to-option-in-2026-2867857-2026-02-13",
      "headline": "Why personalised loans are becoming the go-to option in 2026The journey of hyper-personalisation in personal loans is going to get more exciting for customers with the increasing adoption of technology refining customer offerings, based on minute details of the customers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-update-kisan-credit-card-rules-5-key-changes-to-track-2867809-2026-02-13",
      "headline": "RBI plans to update Kisan Credit Card rules : 5 key changes to trackThe Reserve Bank of India is preparing to overhaul the Kisan Credit Card scheme, and the proposed changes could reshape how farmers borrow and repay loans. With the new draft rules on the table, what exactly is set to change for farm credit?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-1048-points-lower-nifty-below-2550-it-metal-stocks-sink-2867763-2026-02-13",
      "headline": "Sensex crashes over 1,000 points: What's behind today's market bloodbath?The market opened on a weak note and remained under pressure throughout the session, with losses deepening in the second half. The decline appeared to be driven by profit booking at elevated levels and a cautious mood among investors amid global uncertainties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-us-licence-venezuela-oil-trump-trade-deal-india-russia-2867738-2026-02-13",
      "headline": "Reliance wins US licence for Venezuelan oil as India wavers on Russia supplyReliance applied for the licence in early January as India looks to diversify its energy purchases. Direct purchase of Venezuelan oil will help Reliance replace Russian oil in a cost-effective way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cheque-bounced-how-one-mistake-can-spiral-into-legal-and-financial-trouble-2867714-2026-02-13",
      "headline": "Cheque bounced? How one mistake can spiral into legal and financial troubleA bounced cheque may seem like a minor slip, but it can quickly trigger penalties, credit damage and even legal complications. What starts as a simple payment error can snowball into a serious financial setback. Are you aware of the risks?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-government-seeks-public-feedback-who-can-participate-2867699-2026-02-13",
      "headline": "8th Pay Commission: Government seeks public feedback; who can participateThe recommendations of the 8th Pay Commission are expected to influence future salary structures, allowances and pension benefits for central government staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-rise-slightly-rise-ahead-or-fall-on-the-cards-2867664-2026-02-13",
      "headline": "Gold, silver prices rise slightly: Rise ahead or fall on the cards?After days of volatility, gold and silver have posted modest gains, catching the attention of investors. The small rise has reopened a familiar debate, i.e., are precious metals preparing for another climb, or is a fresh dip still possible?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-plans-to-stop-insurance-mis-selling-draft-proposal-is-it-enough-2867655-2026-02-13",
      "headline": "RBI steps in to stop mis-selling by banks: Decoding what's good and what's not clearThe Reserve Bank of India has signalled its intent after years of rising mis-selling complaints. But will this draft protect ordinary customers before the next grievance is filed? In this article, we break down what changes, what remains unclear, and whether enforcement can finally make a difference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/65-10-10-15-rule-how-a-4-asset-boring-thali-portfolio-helps-in-uncertain-markets-edelweiss-radhika-gupta-2867642-2026-02-13",
      "headline": "65-10-10-15 rule: How a 4-asset 'boring thali' portfolio helps in uncertain marketsWhen markets feel uncertain and investors struggle to decide where to put their money, a simple multi-asset strategy is drawing attention. Instead of chasing trends, the 65-10-10-15 \"boring thali\" approach focusses on balance and steady investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-price-correction-explained-what-investors-should-do-buy-sell-2867601-2026-02-13",
      "headline": "Is it the end of the road for silver after a spectacular rally?After a stunning rally and an equally sharp fall, silver now sits at a crucial crossroads, leaving investors wondering whether this correction is nearing its end or still gathering momentum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-crash-sensex-down-over-800-points-nifty-tumbles-ai-panic-hits-it-stocks-on-dalal-street-2867567-2026-02-13",
      "headline": "Sensex crashes over 1,000 points: Why is the stock market falling today?At 3:16 pm, the Sensex was down 1055.91 points to 82,619.01, while the Nifty stood at 25,481.35, lower by 325.85 points. The fall was led by heavy selling in IT stocks, but the triggers lie largely in global developments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-infosys-tech-mahindra-wipro-3-reasons-why-it-stocks-are-falling-2867565-2026-02-13",
      "headline": "TCS, Infosys sink nearly 6%: 3 reasons why IT stocks are falling againShares of TCS and Infosys fell nearly 6% in early trade, dragging the Nifty IT index lower. The weakness was not driven by any one company-specific announcement. Instead, it reflects a mix of global triggers and rising uncertainty around how artificial intelligence will reshape the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-sinks-over-700-points-nifty-below-25600-as-infosys-tcs-and-other-it-stocks-crash-2867559-2026-02-13",
      "headline": "Sensex drops 700 points as AI panic hits IT stocks; Infosys, TCS drop 5%The Sensex fell over 700 points in early trade, while the Nifty slipped below the 25,600 mark. The decline was led by frontline technology majors such as Infosys and TCS, along with other large-cap IT names."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-275-in-january-under-new-cpi-base-year-2024-2867214-2026-02-12",
      "headline": "Retail inflation at 2.75% in January as India shifts to new CPI base year 2024The data, released by the Ministry of Statistics and Programme Implementation, reflects a major statistical overhaul aimed at making India's inflation measure more representative of current consumption patterns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-india-90-year-old-man-sold-policy-maturing-in-20124-systemic-gaps-fraud-2867205-2026-02-12",
      "headline": "A 90-year-old man was sold a 100-year policy. Why blaming the bank is not enoughHandcrafted ByOur Editors A 90-year-old man was sold an insurance policy maturing in 2124. The case sounds bizarre. But instances of mis-selling like this are painfully common across the country. The bank resolved the matter after a viral social media post. The harder question is why blaming the bank alone is not enough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-sinks-over-500-points-nifty-tumbles-as-ai-panic-sinks-it-stocks-2867194-2026-02-12",
      "headline": "Sensex sinks over 500 points, Nifty tumbles as AI panic sinks IT stocksThe benchmark BSE Sensex fell 559 points to close at 85,674.92, while the Nifty 50 slipped below the psychologically important 25,900 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-air-india-write-to-government-over-cabin-crew-fatigue-rules-fia-letter-dgca-2867151-2026-02-12",
      "headline": "Aviation body writes to government as it bids to tighten cabin crew fatigue ruleThe Federation of Indian Airlines (FIA) has asked the government to dilute parts of the draft rules. The industry body represents IndiGo and Air India, and has raised concerns that the changes may create operational and cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-infosys-wipro-it-stocks-crack-under-global-ai-pressure-nifty-it-falls-buying-chance-2867130-2026-02-12",
      "headline": "IT stocks crack under global AI pressure. Is this a buying chance?The Nifty IT index fell 4.67% by 12 PM, hitting a four-month low. The selloff wiped out nearly Rs 1.3 lakh crore in combined market value in a single session. The IT pack on the Sensex was also down nearly 5%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cpi-retail-inflation-calculation-food-prices-less-weight-rent-accomodation-bigger-role-2867071-2026-02-12",
      "headline": "Inflation data reset: Why your groceries will matter less than your rentOnion or tomato prices will no longer dominate inflation headlines. With rent and services gaining weight, the new data reset could quietly shape your EMIs, savings returns and everyday financial decisions. Read on to understand what has changed and why it matters for your wallet."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/police-record-ranveer-singh-rohit-shetty-managers-statement-recreate-crime-scene-2868048-2026-02-13",
      "headline": "Police record Ranveer Singh, Rohit Shetty managers' statement, recreate crime scene Mumbai Police recorded statements from the managers of filmmaker Rohit Shetty and actor Ranveer Singh. The Crime Branch has also recreated the firing sequence at Shetty's residence by retracing the accused's scooter route from Pune to Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/barun-sobti-jaideep-ahlawat-abhishek-banerjee-team-up-for-sudip-sharma-netflix-series-report-2868031-2026-02-13",
      "headline": "Barun Sobti, Jaideep Ahlawat, Abhishek Banerjee in Kohrra creator's next: Report Actors Barun Sobti, Jaideep Ahlawat and Abhishek Banerjee will reportedly headline Sudip Sharma's upcoming Netflix series. Here's everything you need to know about the upcoming project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-art-of-sarah-review-shin-hye-sun-lee-jun-hyuk-kdrama-netflix-2868029-2026-02-13",
      "headline": "The Art of Sarah review: Shin Hye-sun holds together a glossy illusionRelease Date:Fri Feb 13, 2026 The Art of Sarah is a stylish and thought-provoking thriller that delves into themes of ambition and identity in contemporary society. This Netflix series captivates with its compelling lead and visually rich storytelling despite some narrative flaws. Read full review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lewis-hamilton-refuses-to-discuss-kim-kardashian-after-super-bowl-appearance-2868016-2026-02-13",
      "headline": "It's my private life, snubs Lewis Hamilton when asked about Kim Kardashian: Report Lewis Hamilton responded to questions about his public outing with Kim Kardashian at Super Bowl LX. The high-profile appearance fuelled widespread speculation about the nature of their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-producer-promises-global-spectacle-on-par-with-hollywood-for-ranbirs-film-2867930-2026-02-13",
      "headline": "Ramayana producer promises global spectacle on par with Hollywood for Ranbir's film Producer Namit Malhotra has promised that his upcoming film Ramayana will be a global spectacle on par with Hollywood's biggest achievements. The movie features Ranbir Kapoor and Sai Pallavi in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dont-be-shy-human-x-gumiho-to-maxton-hall-s3-prime-videos-2026-full-slate-out-2867992-2026-02-13",
      "headline": "Don't Be Shy, Human X Gumiho to Maxton Hall S3: Prime Video's 2026 full slate out From Maxton Hall Season 3 to Don't Be Shy, Prime Video's 2026 slate for international content is out. Korean shows include Siren's Kiss, Human X Gumiho among others, while Japanese anime also paves way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/son-of-legendary-ramanand-sagar-anand-sagar-chopra-dies-last-rites-in-mumbai-2867989-2026-02-13",
      "headline": "Son of legendary Ramanand Sagar, Anand Sagar Chopra dies; last rites in Mumbai Anand Ramanand Sagar Chopra, co-producer of the iconic 1987 television series, Ramayan, died in Mumbai on February 13, 2026. He was the son of legendary filmmaker Ramanand Sagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stop-defaming-palaash-muchhal-bombay-high-court-to-smriti-mandhana-friend-vidnyan-mane-2867987-2026-02-13",
      "headline": "Stop defaming Palaash Muchhal: Bombay High Court to Smriti Mandhana's friend The Bombay High Court has restrained filmmaker Vidnyan Mane from making defamatory statements against singer-composer Palaash Muchhal and his mother. The order follows a commercial dispute and controversial interviews after a called-off wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shatak-trailer-ajay-devgn-opens-up-on-being-the-narrator-calls-it-an-honour-2867964-2026-02-13",
      "headline": "Shatak trailer out: Ajay Devgn opens up on being the narrator, calls it an honour Ajay Devgn discussed his involvement as narrator for Shatak, a documentary highlighting the century-long journey of the Rashtriya Swayamsevak Sangh (RSS). He reflected on the organisation's legacy ahead of the film's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-retires-playback-singing-releases-devotional-shiva-bhajan-2867965-2026-02-13",
      "headline": "Good news Arijit Singh fans: Singer is already back with devotional track. Watch Arijit Singh, following his announcement to retire from playback singing, has released a new devotional song titled Shiva Bhajan as an independent musician. The singer did not promote the track on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rodolphe-manoukian-arijit-singh-kolkata-humility-cross-cultural-music-2867931-2026-02-13",
      "headline": "Lebanese artiste Rodolphe Manoukian shares how Arijit redefined success for him Lebanese percussionist Rodolphe Manoukian, known for his viral darbuka rendition of Mundian To Bach Ke, met Arijit Singh following his Kolkata show. Manoukian shared a heartfelt note and praised Singh's talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhumi-pednekar-talks-about-the-lady-killer-box-office-failure-calls-it-a-mess-2867948-2026-02-13",
      "headline": "Bhumi Pednekar talks about The Lady Killer box office failure, calls it a mess Bhumi Pednekar revealed that The Lady Killer was released as an incomplete film, with nearly 35  never shot, making it one of the most difficult phases of her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-afshan-o-romeo-vishal-bhardwaj-shahid-kapoor-avinash-tiwary-vikrant-massey-2867883-2026-02-13",
      "headline": "Triptii Dimri on playing Afshan in O' Romeo: She's fire and fragility Actor Tripti Dimri shared insights on portraying Afshan in O Romeo. In her latest Instagram post, the actor reflected on her collaboration with director Vishal Bhardwaj and co-stars Shahid Kapoor, Avinash Tiwary, Vikrant Massey, and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-slams-social-media-backlash-against-critics-of-dhurandhar-2867808-2026-02-13",
      "headline": "Anurag Kashyap slams social media backlash against critics of Dhurandhar Anurag Kashyap condemned the coordinated backlash against critics of Dhurandhar. He said that he was among the few industry members who shared the Film Critics Guild's statement addressing \"targeted attacks, harassment, and hate directed toward film critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/inside-farhan-akhtars-don-3-dilemma-and-legacy-that-wont-fade-away-2867820-2026-02-13",
      "headline": "Inside Farhan Akhtar's Don 3 dilemma and legacy that won't fade away Don 3 continues to dominate the buzz despite casting shake-ups and prolonged delays. From Hrithik Roshan denying involvement to the uncertainty around Ranveer Singh and Kiara Advani, the franchise remains in flux under Farhan Akhtar's direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-leone-working-with-anurag-kashyap-on-kennedy-a-career-changing-experience-2867830-2026-02-13",
      "headline": "Sunny Leone: Working with Anurag Kashyap on Kennedy a career-changing experience Sunny Leone said Kennedy could be a turning point in her career, helping change the industry's perception of her as an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-shares-newborn-twins-names-family-moments-konidela-naming-ceremony-2867739-2026-02-13",
      "headline": "Chiranjeevi reveals first photo and names of Ram Charan's twins Chiranjeevi posted the first pictures of Ram Charan and Upasana's newborn twins, sharing their names and heartfelt meanings in a family gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-shanaya-kapoor-caught-her-ex-texting-5-women-he-gave-me-guilty-earrings-2867790-2026-02-13",
      "headline": "When Shanaya Kapoor caught her ex texting 5 women: He gave me guilty earrings Actor Shanaya Kapoor has revealed details of a past relationship in which she caught her then-boyfriend messaging several other women. The revelation came during her appearance on the podcast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tamannaah-bhatia-junaid-khan-team-up-for-ektaa-kapoor-ragini-3-shashanka-ghosh-2867795-2026-02-13",
      "headline": "Tamannaah Bhatia, Junaid Khan team up for Ektaa Kapoor's Ragini 3 Tamannah Bhatia and Junaid Khan are set to lead Ektaa Kapoor's horror film Ragini 3. The upcoming film will be directed by Shashanka Ghosh. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/accused-nikhil-gupta-pleads-guilty-of-orchestrating-failed-assassination-plot-against-sikh-terrorist-pannun-2868036-2026-02-13",
      "headline": "Pannun murder plot: Accused Nikhil Gupta pleads guilty in USAccused Nikhil Gupta has pleaded guilty in a Manhattan federal court to murder-for-hire and related charges over a failed plot to kill Khalistani terrorist Gurpatwant Singh Pannun in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/very-bad-day-for-iran-trump-sends-second-us-carrier-to-middle-east-2868072-2026-02-14",
      "headline": "Trump floats Iran regime change as US deploys more firepower to Middle EastDonald Trump signaled tougher US posture toward Iran, highlighting decades of hostility and military losses as Washington strengthens its naval presence in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tarique-rahman-bnp-bangladesh-election-results-pm-modi-india-2867632-2026-02-13",
      "headline": "What Tarique Rahman 2.0 means for India, Hindus in BangladeshTarique Rahman is set to become the next prime minister of Bangladesh after his BNP swept the elections. For Tarique, repairing relations with India will be a priority. But the Hasina factor may well be an irritant. In this article, we explore what a new version of Tarique means for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jeffrey-epstein-was-strangled-not-hanged-claims-dr-michael-baden-who-observed-autopsy-2868074-2026-02-14",
      "headline": "Epstein was strangled, not hanged, says doctor who observed autopsyDr. Michael Baden says Jeffrey Epstein most likely died from strangulation, not suicide, citing neck fractures and security lapses, and calls for renewed investigation into inconsistencies surrounding his 2019 jail death.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-india-pakistan-t20-world-cup-match-colombo-weather-2867997-2026-02-13",
      "headline": "Rain threat in IND vs PAK? Sri Lanka issue weather warning for February 15 clashT20 World Cup, IND vs PAK: Rain could disrupt the India-Pakistan T20 World Cup clash on February 15 in Colombo. Both teams have begun their campaigns with two wins each and will aim to bolster their Super 8 qualification hopes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stop-defaming-palaash-muchhal-bombay-high-court-to-smriti-mandhana-friend-vidnyan-mane-2867987-2026-02-13",
      "headline": "Stop defaming Palaash Muchhal: Bombay High Court to Smriti Mandhana's friendThe Bombay High Court has restrained filmmaker Vidnyan Mane from making defamatory statements against singer-composer Palaash Muchhal and his mother. The order follows a commercial dispute and controversial interviews after a called-off wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-abhishek-sharma-slog-mohammed-amir-2867717-2026-02-13",
      "headline": "Abhishek Sharma not technically sound, only slogs the ball: Ex-Pak cricketerICC T20 World Cup: Ahead of the India vs Pakistan game, former cricketer Mohammad Amir has called Abhishek Sharma a slogger. Amir said that a simple plan could unravel Abhishek's plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/indore/story/indore-naked-body-mba-student-obscene-video-boyfriend-missing-police-prime-suspect-2868066-2026-02-13",
      "headline": "Obscene video, missing boyfriend, naked body: MBA student's murder rattles IndoreA 24-year-old MBA student was found dead in a rented room in Indore, with police investigating allegations of the victim suffering from depression and being blackmailed allegedly by her boyfriend, who is missing and the prime suspect in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/claude-ai-was-told-it-would-be-switched-off-it-was-ready-to-blackmail-and-murder-engineer-to-avoid-that-2867368-2026-02-13",
      "headline": "When told about shutdown, Claude AI was ready to blackmail and murder engineerCall it smart. Or dangerous. Anthropic has again confirmed that its Claude AI can veer off the rails. The company notes this in its safety report for the latest Claude 4.6. Earlier, Claude 4.5 was willing to blackmail and even harm an engineer to avoid shutdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-news-elections-bnp-jamaat-candidates-death-sentences-babar-pinto-atm-india-terror-plots-2867985-2026-02-13",
      "headline": "Hangman's noose to Parliament: 2 with anti-India terror links win Bangladesh pollsThree candidates who had been sentenced to death are among the winners of the Bangladesh national election held on February 12. Two of the three, both BNP members, faced the gallows for a plot to supply arms to anti-India insurgents and blasts in India. The third, a Jamaat-e-Islami candidate, faced war crime charges. They were all released by courts as an interim regime led by Muhammad Yunus governed Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jawaharlal-nehru-panchsheel-agreement-china-tibet-chief-defence-staff-2867847-2026-02-13",
      "headline": "Nehru thought Panchsheel settled border issue, but China...: CDS's big claimChief of Defence Staff General Anil Chauhan raised the Panchsheel Agreement on Friday, bringing into focus the tense border issues with China. Chauhan said Nehru assumed that the pact would settle the northern border row, but China had different views."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/winter-olympics-condom-crisis-shortage-free-packs-run-out-intimacy-ban-milan-cortina-2867754-2026-02-13",
      "headline": "Condom crisis at Winter Olympics: 10,000 packs at Games Village gone in 3 daysThe Milan-Cortina Winter Olympics athletes' village has reportedly run out of its free condom supply within just three days. Organisers have promised fresh stock as demand surges in the traditional close-quarters Olympic setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/voyager-1-nasa-deep-space-network-interstellar-mission-signal-light-day-speed-2867639-2026-02-13",
      "headline": "How Nasa still talks to Voyager that has left Solar System foreverVoyager 1 is transmitting data from 24 billion kilometres away using less than 200 watts of power. Discover how Nasa engineers maintain this 48-year-old spacecraft in interstellar space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/clear-and-dry-weather-across-india-on-saturday-heatwave-warnings-begin-2867959-2026-02-13",
      "headline": "Dry weather across India on Saturday, heatwave warnings beginWeather conditions across North India, as well as central, eastern, and southern parts of the country, are already dry and stable, and this pattern is likely to continue through the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/move-or-miss-great-opportunity-trump-warns-zelenskyy-on-russia-deal-2868073-2026-02-14",
      "headline": "Trump claims Russia wants a deal, urges Zelenskyy to get movingTrump urged Volodymyr Zelenskyy to quickly strike a deal with Russia as US-led talks resume in Geneva, even as fighting intensifies across Ukraine's front lines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/aiadmk-cryptic-post-tvk-man-dies-rally-vijay-2867812-2026-02-13",
      "headline": "AIADMK's 'coffin dance' jab at Vijay after man dies at his Tamil Nadu rallyThe AIADMK took a swipe at TVK chief Vijay after a man died due to a heatstroke at his Salem rally, saying that people should carry a coffin to attend his rallies in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/arik-air-boeing-737-engine-midiar-explosion-nigeria-emergency-landing-2868032-2026-02-13",
      "headline": "Shocking footage captures plane flying with shredded engine after midair explosionAn Arik Air Boeing 737 suffered a midair engine explosion during a flight from Lagos to Port Harcourt, forcing an emergency diversion to Benin.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-administration-sues-harvard-university-over-race-based-admissions-records-2868068-2026-02-14",
      "headline": "Trump administration sues Harvard University over race-based admissions recordsThe US Justice Department is seeking admissions records from Harvard to review compliance with the 2023 Supreme Court ruling on race-conscious programmes. The university says it is responding in good faith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/o-romeo-movie-review-shahid-kapoor-vishal-bhardwaj-fail-to-recreate-haider-kaminey-magic-2867694-2026-02-13",
      "headline": "O' Romeo review: Shahid Kapoor-Vishal Bhardwaj fail to recreate Haider, Kaminey magicRelease Date:Fri Feb 13, 2026In O' Romeo, Vishal Bhardwaj crafts a visually stunning gangster-romance led by Shahid Kapoor. However, despite poetic frames and intense performances, the film struggles with an uneven screenplay and an underwhelming emotional pay-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-seva-teerth-inauguration-new-address-old-pmo-museum-convert-2867978-2026-02-13",
      "headline": "PM shifts to new office Seva Teerth. What happens to old PMO now?Prime Minister Narendra Modi inaugurated Delhi's Seva Teerth complex, relocating from the Prime Minister's Office from South Block and launching new welfare measures targeting key demographics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/aranyani-pavilion-where-sacred-groves-meet-contemporary-design-2867932-2026-02-13",
      "headline": "Inside Delhi's spiral pavilion rooted in India's sacred forestsAt Sunder Nursery, the Aranyani Pavilion brings together sustainable design, sacred grove inspiration and a community breakfast from Meghalaya. Built from upcycled materials and shaped as a spiral, the temporary structure explores how architecture, indigenous knowledge and shared meals can reconnect cities with land and community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/send-her-back-bangladesh-nationalist-party-seek-sheikh-hasina-extradition-india-after-taking-power-2867983-2026-02-13",
      "headline": "Send her back: BNP to seek Hasina's extradition from India after taking powerAfter its decisive election win, the Bangladesh Nationalist Party said it will formally urge India to extradite ousted former prime minister Sheikh Hasina to face trial in Bangladesh. BNP leaders stressed that Dhaka still seeks respectful, equal bilateral ties even as it presses legal and diplomatic efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/alan-shepard-smuggled-golf-club-balls-moon-mission-apollo-13-artemis-ii-launch-2867383-2026-02-13",
      "headline": "When an astronaut played golf on the Moon with a smuggled clubheadAlan Shepard's playful experiment captured something equally important about exploration: the unmistakably human urge to improvise, joke, and celebrate achievement, even 3,80,000 kilometers from Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/karur-stampede-salem-rally-deaths-aiadmk-edapaddi-k-palaniswami-vijay-accountability-2868038-2026-02-13",
      "headline": "He went into 72-hour hiding: EPS slams Vijay's conduct after deadly Karur stampedeThe Karur tragedy is currently under investigation by the Central Bureau of Investigation (CBI), and Vijay has been questioned twice in Delhi in connection with the case."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ireland-oman-england-scotland-new-zealand-south-africa-preview-2867806-2026-02-14",
      "headline": "Matchday Preview: South Africa, New Zealand look to strengthen Super 8 chances Day 8 of the T20 World Cup features three high-stakes clashes, with Ireland vs Oman a virtual knockout, England seeking redemption against Scotland, and New Zealand meeting South Africa in a crucial battle for Super 8 qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-india-vs-pakistan-sunil-gavaskar-exclusive-2868064-2026-02-13",
      "headline": "India must settle top-order doubts to beat Pakistan: Sunil Gavaskar T20 World Cup: Legendary India batter Sunil Gavaskar said the Indian team was aware of the areas they need to improve, pointing out that the top order remains a slight concern ahead of the high-octane clash against Pakistan in the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ksca-honours-anil-kumble-rahul-dravid-shantha-rangaswamy-chinnaswamy-stands-2868056-2026-02-13",
      "headline": "Karnataka Cricket honours Anil Kumble and Rahul Dravid with stands at Chinnaswamy The KSCA has honoured Anil Kumble, Rahul Dravid and Shantha Rangaswamy by naming stands after them at Bengaluru's M Chinnaswamy Stadium, recognising their immense contributions to Karnataka and Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-pak-sunil-gavaskar-reaction-usman-tariq-bowling-action-2868052-2026-02-13",
      "headline": "Legal? Sure. Lethal? Not really. Gavaskar reacts to Usman Tariq bowling action buzz Former India captain Sunil Gavaskar played down the threat posed by Pakistan spinner Usman Tariq, saying Indian batters are unlikely to face major trouble against the mystery spinner in their ICC Men's T20 World Cup group clash in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sourav-ganguly-on-india-vs-pakistan-usman-tariq-t20-world-cup-2026-2868047-2026-02-13",
      "headline": "Happy to see IND, PAK playing, sports and politics should be separate: Ganguly T20 World Cup 2026: Former India captain Sourav Ganguly has said that he's delighted to see India and Pakistan playing against each other in the T20 World Cup 2026. He also urged to keep sports and politics separate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-colombo-greets-team-india-with-dance-and-drums-before-pakistan-clash-2868043-2026-02-13",
      "headline": "Colombo greets Team India with dance and drums before Pakistan blockbuster. Video ICC T20 World Cup: Colombo rolled out a vibrant welcome for Team India on Friday evening as the squad arrived in Sri Lanka's capital ahead of their high-voltage T20 World Cup clash against Pakistan national cricket team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaron-finch-on-india-manage-abhishek-sharma-fitness-t20-world-cup-india-vs-pakistan-2868037-2026-02-13",
      "headline": "India mustn't rush Abhishek Sharma vs Pakistan: Aaron Finch Former Australia captain Aaron Finch has advised India to be cautious with Abhishek Sharma's fitness ahead of their T20 World Cup clash against Pakistan. The decision to rest Sharma could impact India's strategy in the crucial Super 8s phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usa-beats-netherlands-super-8-hopes-harmeet-singh-chennai-2868026-2026-02-13",
      "headline": "USA refuse to give up on Super 8 hopes with historic win over Netherlands T20 World Cup, USA vs NED: The United States of America (USA) defeated the Netherlands by 93 runs in a Group A clash to keep their Super 8 qualification hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-stanzin-lundup-104th-mens-10km-freestyle-cross-country-skiing-winter-olympics-2868022-2026-02-13",
      "headline": "India's Stanzin Lundup finishes 104th in men's 10km cross-country skiing India's Stanzin Lundup finished 104th in the men's 10km freestyle cross-country skiing event at the Milano Cortina Winter Olympics on Friday, ending near the bottom of the standings in a fiercely competitive field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-sanju-samson-abhishek-sharma-india-vs-pakistan-t20-world-cup-2026-2868017-2026-02-13",
      "headline": "Sanju Samson deserves long rope, no one can perform under such pressure: Ganguly Former India captain Sourav Ganguly has urged Team India to give Sanju Samson more chances despite his poor recent form. Samson is in line to play in the upcoming fixture against Pakistan, with doubts still lingering over Abhishek Sharma's match fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-versus-scotland-t20-world-cup-match-preview-2867988-2026-02-13",
      "headline": "England aim to spoil Scotland's upset dream as they seek redemption in Kolkata clash T20 World Cup, ENG vs SCO: Phil Salt said that England will be looking to bring out their best version in a game where Scotland will be looking to pull off an upset at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-paksunil-gavaskar-on-arshdeep-singh-washington-sundar-2867995-2026-02-13",
      "headline": "India should drop Arshdeep and bring in Washington Sundar vs Pakistan: GavaskarICC T20 World Cup: Sunil Gavaskar has suggested that India consider bringing Washington Sundar into the XI for the crucial India-Pakistan clash in Colombo. Sundar is yet to feature in the tournament, with the team opting for Varun Chakravarthy and Axar Patel as their two frontline spinners so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-india-pakistan-t20-world-cup-match-colombo-weather-2867997-2026-02-13",
      "headline": "Rain threat in IND vs PAK? Sri Lanka issue weather warning for February 15 clashT20 World Cup, IND vs PAK: Rain could disrupt the India-Pakistan T20 World Cup clash on February 15 in Colombo. Both teams have begun their campaigns with two wins each and will aim to bolster their Super 8 qualification hopes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-australia-colombo-spin-india-vs-pakistan-2867979-2026-02-13",
      "headline": "Sikander Raza sounds Colombo warning ahead of IND vs PAK: Do not aim for 200IND vs PAK, T20 World Cup: Zimbabwe caused a massive upset against Australia at the R Premadasa Stadium on February 13. Speaking after the game, Raza laid out the gameplan on how to succeed in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-uae-beat-canada-aryansh-sharma-sohaib-khan-junaid-siddique-2867949-2026-02-13",
      "headline": "Aryansh Sharma, Sohaib Khan guide UAE to 5-wicket win vs CanadaUAE secured their second-ever T20 World Cup win by defeating Canada by five wickets in Delhi. Junaid Siddique's five-wicket haul and Aryansh Sharma and Sohaib Khan's partnership guided their team to a comfortable win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/josh-hazlewood-matt-renshaw-australia-vs-zimbabwe-t20-world-cup-2867958-2026-02-13",
      "headline": "Are Australia missing Josh Hazlewood? Matt Renshaw opens up after Zimbabwe defeatT20 World Cup, AUS vs ZIM: Matt Renshaw opened up on whether Australia are missing Josh Hazlewood in their campaign. On Friday, the Aussies slumped to a 23-run defeat to Zimbabwe at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-usa-vs-netherlands-live-score-today-match-update-chennai-2867885-2026-02-13",
      "headline": "USA vs Netherlands live score: USA hammer Netherlands in ChennaiUnited States of America (USA) vs Netherlands (NED) Live score, T20 World Cup: The USA produced a spirited all-round performance to hammer the Netherlands by 93 runs in Chennai, keeping their campaign alive in the ongoing ICC tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-marcus-stoinis-injury-loss-zimbabwe-2867866-2026-02-13",
      "headline": "After Zimbabwe shocker, Australia dented with fresh injury concernT20 World Cup, AUS vs ZIM: Marcus Stoinis sustained a hand injury against Zimbabwe while attempting to stop a ball off his own bowling. He was unable to complete his third over and later came out to bat at No. 7 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-beating-australia-guarantee-indias-t20-world-cup-2026-win-2867833-2026-02-13",
      "headline": "Zimbabwe beating AUS guarantee India's World Cup win? Here's what history saysZimbabwe secured a historic victory over Australia in the T20 World Cup 2026. This win raises hopes for India's success in the ongoing tournament, given their historic record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-riyan-parag-named-new-rajasthan-royals-captain-2867802-2026-02-13",
      "headline": "IPL 2026: Riyan Parag replaces Sanju Samson as Rajasthan Royals captainRiyan Parag has been named captain of Rajasthan Royals for IPL 2026, marking the beginning of a new chapter for the franchise after Sanju Samson's switch to Chennai Super Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-hardik-pandya-asks-for-flatter-wickets-after-india-vs-namibia-2867768-2026-02-13",
      "headline": "After India's spin struggles against Namibia, Hardik Pandya asks for flatter wicketsIndia all-rounder Hardik Pandya opened up on the challenges of batting on a tricky surface at the Arun Jaitley Stadium in Delhi following India's 93-run victory against Namibia. Pandya was adjudged Player of the Match for his all-round performance in the fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/winter-olympics-condom-crisis-shortage-free-packs-run-out-intimacy-ban-milan-cortina-2867754-2026-02-13",
      "headline": "Condom crisis at Winter Olympics: 10,000 packs at Games Village gone in 3 daysThe Milan-Cortina Winter Olympics athletes' village has reportedly run out of its free condom supply within just three days. Organisers have promised fresh stock as demand surges in the traditional close-quarters Olympic setting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-blessing-muzarabani-australia-vs-zimbabwe-colombo-score-2867741-2026-02-13",
      "headline": "Blessing curses Australia as Zimbabwe produce first big upset at T20 World CupT20 World Cup 2026: Blessing Muzarabani led an inspired bowling effort from Zimbabwe as they bowled Australia out for 146, falling short of the total by 23 runs in Colombo. The former champions are in danger of exiting the tournament as early as the group stages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-league-rebranding-aiiff-2025-26-season-2867743-2026-02-13",
      "headline": "I-League rebranded to Indian Football League, 10 teams confirm participationAIFF has officially rebranded the I-League as the Indian Football League starting from the 2025-26 season. The move coincides with the confirmation of participating teams and ongoing disputes over club promotions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-abhishek-sharma-slog-mohammed-amir-2867717-2026-02-13",
      "headline": "Abhishek Sharma not technically sound, only slogs the ball: Ex-Pak cricketerICC T20 World Cup: Ahead of the India vs Pakistan game, former cricketer Mohammad Amir has called Abhishek Sharma a slogger. Amir said that a simple plan could unravel Abhishek's plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sanju-samson-sunil-gavaskar-india-vs-pakistan-2867716-2026-02-13",
      "headline": "Sunil Gavaskar spells out Sanju Samson's problem before Pakistan clashT20 World Cup 2026: Former India captain Sunil Gavaskar spelt out a technical flaw he believes Sanju Samson is battling as he tries to recover from a lean patch. The Kerala wicketkeeper was dismissed for an eight-ball 22 in India's win over Namibia on Thursday in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-pakistan-usman-tariq-ashwin-tip-move-away-if-he-pauses-pull-out-2867629-2026-02-13",
      "headline": "If Usman Tariq pauses, you pull out: R Ashwin's bold take could spice up IND vs PAKT20 World Cup: Former India spinner R Ashwin has suggested a bold tactic to counter Pakistan's mystery spinner Usman Tariq ahead of the IND vs PAK clash on February 15. Ashwin believes it could unsettle Pakistan's biggest spin threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riyan-parag-ipl-rajasthan-royals-captain-2867610-2026-02-13",
      "headline": "Riyan Parag set to be named Rajasthan Royals captain: ReportIPL 2026: Rajasthan Royals have reportedly decided to make Riyan Parag the captain of the franchise. The move comes after the exit of Sanju Samson from the Jaipur-based team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-italy-vs-nepal-first-ever-win-players-tears-eyes-john-davison-press-conference-2867583-2026-02-13",
      "headline": "Italy's first T20 World Cup win left some guys with tears in eyes: Coach DavisonT20 World Cup: Italy head coach John Davison revealed that emotions ran high in the camp, with players left in tears after scripting their first-ever World Cup win by triumphing over Nepal on February 12."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-australia-vs-zimbabwe-live-score-today-match-updates-colombo-2867580-2026-02-13",
      "headline": "AUS vs ZIM Highlights: Zimbabwe beat Australia, bag massive upset in ColomboAustralia (AUS) vs Zimbabwe (ZIM) Highlights, T20 World Cup: AUS (146-all-out in 19.4 ovs) chasing 170. Zimbabwe cause the first upset of the T20 World Cup. They have beaten Australia by 23 runs in Colombo. What a day for Sikander Raza's men. What a day for the World Cup. Blessing Muzarabani stuns Aussies with 4/17."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}