{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-in-september-down-to-8-year-low-2802366-2025-10-13",
      "headline": "Retail inflation drops to 1.54% in September, lowest in over 8 yearsFood inflation remained negative for the fourth consecutive month, with the Consumer Food Price Index (CFPI) showing a year-on-year decline of 2.28%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-in-economic-sciences-awarded-to-joel-mokyr-philippe-aghion-and-peter-howitt-2802332-2025-10-13",
      "headline": "Joel Mokyr, Philippe Aghion, Peter Howitt win Nobel Prize in Economics 2025The Nobel Prize committee said the trio's research has helped economists and policymakers better understand the roots of economic progress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-nifty-it-stocks-us-china-trade-woes-infosys-2802344-2025-10-13",
      "headline": "Sensex, Nifty end in red as IT stocks drag markets; Infosys down 2%The S&P BSE Sensex was down by 173.77 points to close at 82,327.05, while the NSE Nifty50 lost 58 points to end at 25,227.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/silver-prices-india-should-you-sell-buy-personal-finance-festive-season-shopping-2802291-2025-10-13",
      "headline": "Is silver the next big story after gold? Here's what you need to knowFrom households to industries and even central banks, silver is suddenly everyone's favourite metal, pushing its price higher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/loan-rejected-despite-750-cibil-score-5-hidden-reasons-revealed-by-expert-2802284-2025-10-13",
      "headline": "Loan rejected despite 750 CIBIL score? 5 hidden reasons revealed by expertEven with a strong CIBIL score of 750, many borrowers face loan rejections. Experts say banks consider several hidden factors beyond your credit score that can impact approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-diwali-bonus-taxable-for-salaried-employees-here-is-what-you-must-know-2802249-2025-10-13",
      "headline": "Is Diwali bonus taxable for salaried employees? Here's what you must knowAs Diwali draws near, salaried employees across India look forward to festive bonuses and gifts. But not all perks are tax-free, and understanding which ones attract tax is essential to avoid surprises from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-50-percent-listing-pop-stock-market-debut-2802227-2025-10-13",
      "headline": "LG Electronics IPO GMP rises: Can investors expect 50% listing pop tomorrow?LG IPO: While early chatter hinted at a 50% listing pop, current indicators suggest a slightly more modest, yet still impressive, gain. Read on to know more about the grey market trends, subscription frenzy, and what investors can realistically expect tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-bitcoin-ethereum-dogecoin-rebound-after-massive-crash-here-is-what-investors-should-do-2802203-2025-10-13",
      "headline": "Crypto rebounds after massive crash. Here's what investors should doThe crypto market has regained lost ground following a sharp crash over the weekend. Bitcoin, Ethereum, and several altcoins are bouncing back, leaving investors to decide their next move carefully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-climb-again-will-the-rally-continue-till-dhanteras-should-you-buy-gold-2802173-2025-10-13",
      "headline": "Gold prices climb again. Will the rally continue till Dhanteras?Gold is once again on the rise, drawing attention from investors and festive buyers alike. With prices touching record levels and global uncertainty at play, many are now wondering if the momentum will carry through to Dhanteras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/disappointed-tata-capital-market-debut-5-reasons-why-not-to-worry-2802122-2025-10-13",
      "headline": "Why Tata Capital's weak stock market debut isn't a reason to worryTata Capital IPO: The shares opened at Rs 330 on listing day, roughly 1% above the IPO price of Rs 326—a flat, polite start for what was billed as the biggest public issue of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-capital-share-price-1-percent-premium-rs-330-bse-nse-flat-debut-stock-market-2802109-2025-10-13",
      "headline": "Tata Capital share price: 2025's biggest IPO makes flat debut on stock marketTata Capital shares listed at Rs 330 on both the NSE and the BSE, opening at a premium of just 1% over its issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fall-stock-market-falling-rising-volatility-2802104-2025-10-13",
      "headline": "Sensex tumbles nearly 400 points: Why is the stock market falling today?Across Asia, markets opened lower, and India wasn't spared either. Profit booking after last week's gains and cautious sentiment ahead of key domestic events like the Tata Capital listing, Q2 earnings, and inflation data added to the drag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-listing-date-latest-gmp-profit-for-investors-expected-gains-2802093-2025-10-13",
      "headline": "LG Electronics IPO set for a bumper listing tomorrow? Check latest GMPLG Electronics IPO was open for subscription from October 7 to October 9 and saw strong participation across all investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-300-points-nifty-below-25200-indigo-airtel-among-top-gainers-2802084-2025-10-13",
      "headline": "Sensex, Nifty fall amid US-China tariff tensions; focus on Tata Capital listingThe S&P BSE Sensex fell over 300 points in early trade, while the NSE Nifty50 slipped around 100 points amid mild profit booking after last week's gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-share-price-listing-gmp-today-market-debut-profit-investors-gains-2802063-2025-10-13",
      "headline": "Tata Capital share listing today: Will investors see profit from biggest IPO in 2025?The Rs 15,511.87 crore IPO, which opened for subscription on October 6 and closed on October 8, received bids for 65.33 crore shares against 33.34 crore shares on offer, subscribing 1.96 times overall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-a-will-importance-how-to-make-it-in-india-personal-finance-types-legal-help-2801990-2025-10-13",
      "headline": "What's in a Will? Understanding the power of your last wordFrom Bollywood dramas where brothers turn against each other to real-life stories of families dragged into courtrooms, most of these disputes begin with one missing document, a will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-indians-still-prefer-buying-homes-during-auspicious-months-real-estate-buying-2801783-2025-10-12",
      "headline": "Why Indians still prefer buying homes during auspicious monthsBuying a home in India is more than just a financial decision — it is an emotional milestone. For many, choosing the right time to invest is as important as picking the right property, with festivals and auspicious dates playing a big role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crypto-crash-wipes-out-19-billion-after-trumps-100-china-tariffs-spark-sell-off-2801593-2025-10-11",
      "headline": "Crypto crash wipes out $19 billion after Trump's 100% China tariffs spark sell-offThe cryptocurrency market suffered a historic crash after US President Donald Trump announced 100% tariffs on China and new export controls on software."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-name-change-regulatory-nightmare-internal-conflict-unpaid-salaries-2801525-2025-10-11",
      "headline": "Crisis brews at Bira 91: How a name change shook the popular beer brandFrom beer icon to regulatory nightmare, Bira 91's journey shows how a minor administrative tweak can spiral into financial chaos, employee unrest, and investor anxiety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-vs-lg-electronics-ipo-strategy-after-stock-market-listing-2801500-2025-10-11",
      "headline": "LG Electronics vs Tata Capital IPO: What should be your strategy post-listing?Two IPOs, two very different strategies. Tata Capital offers steady long-term growth, while LG Electronics promises quick listing gains. Read on to plan post-listing moves and investment approach carefully."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-praises-pradeep-ranganathan-hero-material-controversy-2802357-2025-10-13",
      "headline": "Nagarjuna draws parallels between Pradeep Ranganathan and Rajinikanth. Here's why Nagarjuna compared Pradeep Ranganathan to Rajinikanth and Dhanush on Bigg Boss Telugu 9. Actor-director Pradeep faced criticism about his appearance during 'Dude's' promotion in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rishab-shetty-amitabh-bachchan-kbc-17-birthday-special-kantara-success-2802350-2025-10-13",
      "headline": "KBC 17: Rishab Shetty to appear as guest on Amitabh Bachchan's birthday episode Actor Rishab Shetty is all set to appear as a guest on Amitabh Bachchan-hosted 'Kaun Banega Crorepati 17'. The episode was shot on Bachchan's 83rd birthday and is yet to be aired. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-takes-jibe-at-nepotism-debate-in-new-ad-2802367-2025-10-13",
      "headline": "Sonakshi Sinha takes jibe at nepotism debate in new ad. Watch Sonakshi Sinha humorously tackles the Bollywood nepotism debate in a new Instamart ad, flaunting a \"golden spoon\" with confidence and wit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/duniya-vijay-wraps-shoot-mookuthi-amman-2-sundar-c-nayanthara-2802345-2025-10-13",
      "headline": "Kannada actor Duniya Vijay wraps up Mookuthi Amman 2, thanks director Sundar C Actor Duniya Vijay has wrapped up his portions for Sundar C's 'Mookuthi Amman 2'. The film features Nayanthara in the lead role, with an ensemble cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-allu-arjun-film-hints-future-yash-collaboration-2802318-2025-10-13",
      "headline": "Atlee hints at possible collaboration with Yash: Watch During a conversation with Atlee, the 'Jawan' director hinted at a possible collaboration with Yash in the future. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-smoking-scene-leaked-toxic-march-2026-release-2802326-2025-10-13",
      "headline": "Yash's smoking scene from Toxic leaked ahead of its release on March 19 A smoking scene featuring actor Yash from the film 'Toxic' has been leaked online. The leak raises concerns over security ahead of the movie's March 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gaga-joins-the-devil-wears-prada-sequel-original-cast-returns-2026-2802288-2025-10-13",
      "headline": "Lady Gaga set to star in The Devil Wears Prada sequel: Report Pop star Lady Gaga has joined 'The Devil Wears Prada' sequel in an undisclosed role. The film features the return of core cast members and several new additions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-national-award-win-praised-by-priyamani-for-jawan-2802277-2025-10-13",
      "headline": "Priyamani praises SRK's hard work after his National Award win for Jawan Actor Priyamani expresses joy over Shah Rukh Khan's National Award win for 'Jawan'. She highlights the pressure and prestige that come with such an honour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-on-refusing-hindi-films-over-kissing-scenes-fear-of-punjabi-audience-2802268-2025-10-13",
      "headline": "Sonam Bajwa on refusing Hindi films over kissing scenes, fear of Punjabi audience Actor Sonam Bajwa revealed her hesitation about performing kissing scenes in Hindi films due to cultural concerns. Her fears stemmed from concerns over the reactions of the Punjabi film audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/andhra-king-taluka-ram-pothineni-teaser-drops-truth-bombs-on-fan-worship-2802297-2025-10-13",
      "headline": "Andhra King Taluka: Ram Pothineni's teaser drops truth bombs on fan worship The teaser of 'Andhra King Taluka' has set social media buzzing, as Ram Pothineni's energy, sharp dialogues, and the film's take on fan obsession promise a unique cinematic ride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/boney-kapoor-confirms-varun-dhawan-arjun-kapoor-no-entry-2-2802308-2025-10-13",
      "headline": "Boney Kapoor dismisses rumours of Varun Dhawan quitting No Entry 2 Producer Boney Kapoor has dismissed recent speculation about Varun Dhawan's departure from No Entry 2. Kapoor affirms that Varun and Arjun Kapoor remain part of the project, while casting discussions continue for the remaining roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-announces-new-slate-of-tamil-telugu-films-for-2026-legacy-love-made-in-korea-takshakudu-super-subbu-2802270-2025-10-13",
      "headline": "Legacy to Love: Netflix announces new slate of Tamil, Telugu films for 2026 Netflix is boosting South Indian storytelling with six new Tamil and Telugu originals, covering thrillers, comedies, and romances. The upcoming 2026 slate includes films like 'Legacy', 'Love', 'Super Subbu' and 'Takshakudu'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-plastic-bottle-blooper-viral-online-box-office-success-2802247-2025-10-13",
      "headline": "Kantara Chapter 1 blooper goes viral as fans spot plastic water can in a song A glaring error from 'Kantara Chapter 1', where a plastic water can is seen in the background during the 'Brahmakalasha' song, has now gone viral. Fans are comparing the incident to the 'Game of Thrones' coffee cup mistake from the final season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-drama-unfolds-with-wildcards-and-srijas-controversial-exit-2802245-2025-10-13",
      "headline": "Bigg Boss Telugu 9: Drama unfolds with wildcards and Srija's controversial exit Bigg Boss Telugu 9 turned heads with wildcard entries, star hosts granting special powers, and a double eviction of Flora Saini and Srija Dhammu that left fans and housemates stunned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-engagement-travis-kelce-new-album-chiefs-game-2802254-2025-10-13",
      "headline": "Taylor Swift's first public outing post-engagement? A Chiefs game, of course Taylor Swift seen at Kansas City Chiefs game after announcing engagement to Travis Kelce. Swift shares insights on upcoming album inspired by her Eras Tour experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-punches-bobby-deol-friendly-pose-together-for-paps-at-manish-malhotra-diwali-bash-viral-video-2802260-2025-10-13",
      "headline": "Preity Zinta-Bobby Deol's sweet pose sums up Diwali warmth at bash. Video Preity Zinta and Bobby Deol's heartwarming reunion at Manish Malhotra's Diwali bash stole the spotlight. The 'Soldier' duo shared a friendly punch, warm hug, and surprise pose for the paparazzi, perfectly capturing the spirit of festive cheer and nostalgia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-12-no-eviction-malu-nipanal-spandana-finalists-immunity-2802194-2025-10-13",
      "headline": "Bigg Boss Kannada 12: Kichcha Sudeep warns contestants of mass eviction The second week of Bigg Boss Kannada Season 12, hosted by Kiccha Sudeep, ended with no evictions, and contestant duo Malu Nipanal and Spandana were declared finalists for the upcoming week's first finale.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-mohan-netflix-tamil-film-made-in-korea-first-look-poster-out-2802256-2025-10-13",
      "headline": "Priyanka Mohan to star in Netflix's Tamil film Made in Korea, 1st look poster out Netflix's announced a new Tamil film 'Made in Korea' that blends South Indian warmth with Korean charm, tracing a young woman's journey of love and self-discovery in Seoul. It stars Priyanka Mohan in the lead role and is directed by Ra Karthik. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/annu-kapoor-controversy-comments-tamannaah-bhatia-social-media-backlash-milky-body-2802234-2025-10-13",
      "headline": "Annu Kapoor faces online backlash after remarks on Tamannaah's 'milky body' Actor Annu Kapoor has come under fire for comments about Tamannaah Bhatia's appearance in a recent interview. Social media users called his statements lewd, sparking widespread criticism and debate over respect in public discourse."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-peace-summit-live-deal-signing-hostage-release-israel-hamas-palestine-egypt-donald-trump-netanyahu-war-2802032-2025-10-13",
      "headline": "Live: Historic dawn of new Middle East, says Donald Trump in Gaza deal address to Israeli parliamentHamas on Monday released the last 20 surviving Israeli hostages under a US-brokered ceasefire deal, marking what President Donald Trump hailed as \"a new beginning\" and a major step towards ending the two-year Gaza war. The Israeli military confirmed all living hostages had been returned, while buses carrying freed Palestinian prisoners rolled into Gaza to similar emotion. The exchange, the first step in a truce crafted by Trump alongside Egypt, Qatar, and Turkey, comes ahead of a high-stakes summit in Sharm el-Sheikh where over 20 world leaders will discuss Gaza's future under Trump's proposed 20-point peace plan. Stay tuned to India Today for the latest updates as this pivotal day for the Middle East unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/matter-of-time-youll-get-it-netanyahu-alludes-to-missed-nobel-nominates-trump-for-israels-highest-honour-2802369-2025-10-13",
      "headline": "Netanyahu backs Trump for Nobel, nominates him for Israel's highest honour  Live UpdatesMatter of time, you'll get it: Netanyahu alludes to missed Nobel, nominates Trump for Israel's highest honour"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-in-economic-sciences-awarded-to-joel-mokyr-philippe-aghion-and-peter-howitt-2802332-2025-10-13",
      "headline": "Joel Mokyr, Philippe Aghion, Peter Howitt win Nobel Prize in Economics 2025The Nobel Prize committee said the trio's research has helped economists and policymakers better understand the roots of economic progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-gaza-peace-summit-egypt-pakistan-pm-shehbaz-sharif-us-president-donald-trump-2802144-2025-10-13",
      "headline": "PM skips Gaza peace summit in Sharm el-Sheikh. Who does he not want to meet?Minister of State Kirti Vardhan Singh will represent India at the high-level summit co-chaired by the US and Egyptian Presidents, where over 20 world leaders will meet to finalise the framework of the Gaza peace deal and discuss post-war reconstruction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suresh-gopi-union-minister-wants-to-quit-as-union-minister-thrissur-kerala-mp-bjp-2024-after-oath-demand-reason-why-explained-2802212-2025-10-13",
      "headline": "Did Union minister Suresh Gopi hint at filmy exit right from the start?A year after creating history as Kerala's first BJP MP, Union Minister Suresh Gopi seems torn between the arc lights and the ministry files. He has desired to quit his ministerial post citing dwindling income. This is not the first time he has done so. Soon after he took an oath as a minister in the Narendra Modi Cabinet in 2024, Gopi had hoped that he would be relieved from his ministerial duties. Does his recurring wish to quit hint that the actor in him never fully gave way to the politician in him?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-tlp-protests-in-muridke-lahore-islamabad-violence-pro-gaza-march-police-firing-injured-killed-2802094-2025-10-13",
      "headline": "Pak on edge as Islamist group's march turns violent; protesters, cop killedThe march, staged to protest Israeli airstrikes in Gaza and push the government on pro-Palestinian demands, saw violent clashes with a police official and many protesters being killed and injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: Sudharsan up and running in the chaseIndia (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: Sai Sudharsan has kickstarted his innings fairly positively as India look to make quick work of the chase in the second innings, where they have to chase down a mere target of 121."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-bjp-rss-priyank-kharge-mallikarjun-kharge-siddaramaiah-2802120-2025-10-13",
      "headline": "Priyank Kharge-BJP fight over his RSS ban call and father Mallikarjun's old picKarnataka BJP and Minister Priyank Kharge sparred on X after Kharge sought a ban on RSS activities in government premises. BJP shared an old photo of Mallikarjun Kharge at an RSS event, which Priyank Kharge rebutted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-plastic-bottle-blooper-viral-online-box-office-success-2802247-2025-10-13",
      "headline": "Kantara Chapter 1 blooper goes viral as fans spot plastic water can in a songA glaring error from 'Kantara Chapter 1', where a plastic water can is seen in the background during the 'Brahmakalasha' song, has now gone viral. Fans are comparing the incident to the 'Game of Thrones' coffee cup mistake from the final season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/sanskrit-revival-mattur-village-karnataka-heritage-technology-2802290-2025-10-13",
      "headline": "The village that speaks in Sanskrit : Every. Single. Day.Mattur village in Karnataka has revived Sanskrit as a living language spoken daily. The community blends ancient heritage with modern technology to keep Sanskrit relevant and thriving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-hands-over-first-seven-hostages-to-red-cross-as-part-of-gaza-ceasefire-plan-news-agency-ap-2802138-2025-10-13",
      "headline": "Hamas frees all Israeli hostages; Donald Trump, in Israel, says war is overHamas on Monday released 20 Israeli live hostages in two phases. In the first phase, seven hostages were handed over to the Red Cross and in the second phase, the remaining 13 were released."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-raghopur-seat-contest-election-poll-debut-jan-suraaj-candidate-list-rjd-tejashwi-yadav-2802060-2025-10-13",
      "headline": "Jan Suraaj releases 2nd list, suspense over Prashant Kishor's poll debut continuesThe Jan Suraaj Party released its second Bihar Assembly candidate list today at 2 pm, keeping alive the speculation over Prashant Kishor's poll debut from Tejashwi Yadav's home turf Raghopur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/kbc-17-contestant-controversy-schools-not-just-parents-are-raising-overconfident-kids-kaun-banega-crorepati-2802255-2025-10-13",
      "headline": "KBC contestant controversy: Schools, not just parents, are raising overconfident kidsWhile social media has been quick to blame parenting for a young contestant's overconfidence, the bigger culprit may be the schools themselves. Systems that reward assertiveness and quick answers over critical thinking, nurturing students who look confident but are often underprepared.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/ambience-dlf-promenade-and-emporio-malls-may-shut-due-to-unprecedented-water-crisis-in-vasant-kunj-2801999-2025-10-12",
      "headline": "These 3 top Delhi malls may shut down in coming daysThree of South Delhi's most prominent malls, DLF Promenade, DLF Emporio, and Ambience Mall in Vasant Kunj, are on the brink of closure due to a severe water crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-peace-deal-donald-trump-hostage-release-cyrus-the-great-israel-palestine-2802226-2025-10-13",
      "headline": "Cyrus the Great is Alive: Why Israelis see an ancient Persian king in TrumpIsraelis have likened Donald Trump to the ancient Persian ruler Cyrus the Great, celebrating him as a modern-day liberator who, like Cyrus who ended the Jewish exile in Babylon, has restored Israel's fortunes through his decisive actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/netanyahus-gift-to-trump-after-gaza-truce-a-golden-peace-dove-2802320-2025-10-13",
      "headline": "Netanyahu's gift to Trump after Gaza truce: A golden peace doveIsraeli Prime Minister Benjamin Netanyahu gifted a golden peace dove to US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/women-travel-revolution-india-new-report-2802020-2025-10-13",
      "headline": "She plans, she books, she travelsA new report by Booking.com reveals that women are increasingly taking the lead in travel planning across Indian households."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/industrialist-sminu-jindal-accuses-indigo-of-damaging-her-wheelchair-airline-reacts-2802283-2025-10-13",
      "headline": "Industrialist Sminu Jindal accuses IndiGo of damaging her wheelchair, airline reactsThe incident occurred on October 10 while Sminu Jindal was returning from Goa to Delhi on an IndiGo flight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-quits-corporate-job-reliance-for-family-work-life-balance-now-earns-more-as-uber-driver-salary-2802362-2025-10-13",
      "headline": "Bengaluru man quits corporate job for family, now earns more as Uber driverA Bengaluru man began his career with Reliance Retail, where he worked for eight years, earning around Rs 40,000 per month. Now, he is an Uber driver and earns Rs 56,000 a month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/irctc-scam-court-orders-framing-of-cheating-charges-against-lalu-yadav-wife-rabri-and-son-tejashwi-2802136-2025-10-13",
      "headline": "Lalu Yadav, Rabri, Tejashwi to face trial in IRCTC scam in big court setbackLalu Yadav has been accused of criminal misconduct and conspiracy in manipulating tenders and land deals in the IRCTC scam, while Rabri Devi and Tejashwi face charges of cheating and conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/google-maps-science-einstein-theory-of-relativity-satellites-2801895-2025-10-13",
      "headline": "How Einstein is the reason your Google Maps knows where you areGlobal Positioning System (GPS) satellites continuously beam down ultra-precise timestamps, each message essentially saying, \"It was 12:00:00.000001 when I sent this.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-man-roei-shalev-girlfriend-mapal-adam-shot-dead-in-hamas-attack-nova-music-festival-dies-by-suicide-2802031-2025-10-13",
      "headline": "Israeli man who saw his girlfriend killed by Hamas sets himself on fire, diesAt least 378 people, including 344 civilians were killed on October 7, 2023, when Hamas-led Palestinian militants crossed from Gaza into Israel and attacked the Nova open-air music festival and nearby communities. This unprecedented attack prompted Israel to wage its ongoing war against Hamas in Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-wins-best-actor-award-70th-filmfare-awards-i-want-to-talk-2802133-2025-10-13",
      "headline": "Abhishek Bachchan dedicates Filmfare Best Actor award to Aishwarya, AaradhyaAbhishek Bachchan won his first Best Actor in a Leading Role (Male) award at the 70th Filmfare Awards for his performance in 'I Want To Talk.' The actor delivered an emotional speech, thanking his wife Aishwarya and daughter Aaradhya, highlighting their support and sacrifices."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/elderly-woman-chhattisgarh-heart-wrenching-wails-over-peepal-tree-chopped-cut-force-mla-police-villagers-act-arrests-2802265-2025-10-13",
      "headline": "We the peepal: Woman's wails over felled tree get cop, MLA into actionA video of an elderly woman from Chhattisgarh crying inconsolably over a peepal tree went viral and drew national attention. Swift arrests were made and the local MLA extended support. The incident highlights India's deep cultural and emotional connection with nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-praises-pradeep-ranganathan-hero-material-controversy-2802357-2025-10-13",
      "headline": "Nagarjuna draws parallels between Pradeep Ranganathan and Rajinikanth. Here's whyNagarjuna compared Pradeep Ranganathan to Rajinikanth and Dhanush on Bigg Boss Telugu 9. Actor-director Pradeep faced criticism about his appearance during 'Dude's' promotion in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-takes-jibe-at-nepotism-debate-in-new-ad-2802367-2025-10-13",
      "headline": "Sonakshi Sinha takes jibe at nepotism debate in new ad. WatchSonakshi Sinha humorously tackles the Bollywood nepotism debate in a new Instamart ad, flaunting a \"golden spoon\" with confidence and wit. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jack-wilshere-appointed-luton-town-manager-to-revive-league-one-campaign-2802353-2025-10-13",
      "headline": "Former Arsenal midfielder Jack Wilshere named as Luton Town manager Former Arsenal midfielder Jack Wilshere has been named as the new manager of Luton Town as the former England international looks to turn around the fortunes of the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-concedes-100-runs-india-vs-west-indies-delhi-test-fightback-2802354-2025-10-13",
      "headline": "Kuldeep Yadav sets unwanted record, concedes 100 for 1st time in Delhi Test Kuldeep Yadav conceded 100 runs for the first time in his Test career as West Indies fought back in Delhi. His costly spell highlighted India's struggles and put pressure on captain Shubman Gill's decision to enforce the follow-on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-tri-series-afghanistan-doubts-sri-lanka-t20-noc-conflict-2802341-2025-10-13",
      "headline": "PCB readies backup plans as Afghanistan participation in tri-series in doubt: Report The Pakistan Cricket Board is preparing an alternate plan for the upcoming tri-series amid doubts over Afghanistan's participation due to military tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-david-warner-moral-victory-2802343-2025-10-13",
      "headline": "War of words begin for Ashes as Warner takes moral victory dig at England The war of words have begun ahead of the Ashes series. Former Australia player David Warner, has said that England are coming Down Under only for a moral victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-doubtful-first-ashes-test-england-perth-injury-update-2802340-2025-10-13",
      "headline": "Pat Cummins hints that he is unlikely to make it for 1st Ashes Test Australia captain Pat Cummins hinted that he is unlikely to be fit in time for the first Ashes Test in Perth against England. Cummins is continuing his recovery from a back stress injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-2027-world-cup-uncertain-ravi-shashtri-reacts-fitness-2802302-2025-10-13",
      "headline": "Rohit Sharma, Virat Kohli for 2027 World Cup? Ravi Shastri makes massive call Ravi Shastri says Rohit Sharma and Virat Kohli's ODI future is uncertain. The upcoming three-match series against Australia will be crucial in deciding if the senior duo continues toward the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-series-perfect-ashes-preparation-mitchell-marsh-reacts-2802257-2025-10-13",
      "headline": "India white-ball series ideal Ashes preparation: Australia captain Mitchell Marsh Mitchell Marsh believes Australia's white-ball series against India is perfect preparation for the 2025–26 Ashes, with the two sides always sharing a great rivalry. Facing world No. 1 India provides match intensity and competitive practice ahead of England's historic Test series in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-delhi-follow-on-criticism-gautam-gambhir-2802261-2025-10-13",
      "headline": "Follow-on blunder? Gambhir slammed as India's 12-year streak ends in Delhi Test India vs West Indies, 2nd Test: Head coach Gautam Gambhir and captain Shubman Gill have faced flak for the decision to enforce follow-on in Delhi. West Indies put up an admirable fight with the bat in their second innings to force India to bat again, ending a 13-year-long streak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-bihar-vice-captain-ranji-trophy-2025-youth-cricket-records-2802205-2025-10-13",
      "headline": "At 14, Vaibhav Suryavanshi becomes vice-captain of Bihar Ranji Trophy team Vaibhav Suryavanshi, 14, has been named vice-captain of Bihar for the first two rounds of Ranji Trophy 2025-26, after exceptional youth performances in Australia, England and the IPL. Sakibul Gani will lead the side as Bihar aims to rebound from a winless previous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/zinedine-zidane-france-head-coach-eagerness-didier-deschamps-step-down-2802218-2025-10-13",
      "headline": "Zidane confirms eagerness to become France head coach: I'll get back Zinedine Zidane has confirmed his ambition to coach the France national team in the future. The former Real Madrid manager remains patient, focusing on returning to management at the right moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-2027-world-cup-uncertain-ravi-shashtri-reacts-fitness-2802302-2025-10-13",
      "headline": "Rohit Sharma, Virat Kohli for 2027 World Cup? Ravi Shastri makes massive call Ravi Shastri says Rohit Sharma and Virat Kohli's ODI future is uncertain. The upcoming three-match series against Australia will be crucial in deciding if the senior duo continues toward the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-series-perfect-ashes-preparation-mitchell-marsh-reacts-2802257-2025-10-13",
      "headline": "India white-ball series ideal Ashes preparation: Australia captain Mitchell Marsh Mitchell Marsh believes Australia's white-ball series against India is perfect preparation for the 2025–26 Ashes, with the two sides always sharing a great rivalry. Facing world No. 1 India provides match intensity and competitive practice ahead of England's historic Test series in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-delhi-follow-on-criticism-gautam-gambhir-2802261-2025-10-13",
      "headline": "Follow-on blunder? Gambhir slammed as India's 12-year streak ends in Delhi Test India vs West Indies, 2nd Test: Head coach Gautam Gambhir and captain Shubman Gill have faced flak for the decision to enforce follow-on in Delhi. West Indies put up an admirable fight with the bat in their second innings to force India to bat again, ending a 13-year-long streak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-bihar-vice-captain-ranji-trophy-2025-youth-cricket-records-2802205-2025-10-13",
      "headline": "At 14, Vaibhav Suryavanshi becomes vice-captain of Bihar Ranji Trophy team Vaibhav Suryavanshi, 14, has been named vice-captain of Bihar for the first two rounds of Ranji Trophy 2025-26, after exceptional youth performances in Australia, England and the IPL. Sakibul Gani will lead the side as Bihar aims to rebound from a winless previous season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/zinedine-zidane-france-head-coach-eagerness-didier-deschamps-step-down-2802218-2025-10-13",
      "headline": "Zidane confirms eagerness to become France head coach: I'll get back Zinedine Zidane has confirmed his ambition to coach the France national team in the future. The former Real Madrid manager remains patient, focusing on returning to management at the right moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-fans-slammed-india-vs-australia-womens-world-cup-poor-captaincy-2802143-2025-10-13",
      "headline": "Harmanpreet Kaur slammed by fans after India's record loss to Australia: Time to goHarmanpreet Kaur is facing severe backlash after India's record World Cup defeat to Australia. Fans questioned her captaincy and poor batting form, demanding leadership changes as India's campaign continues to lose direction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-alyssa-healy-press-conference-2802098-2025-10-13",
      "headline": "Alyssa Healy admits Smriti-Pratika had Australia scared in VizagWomen's World Cup, India vs Australia, Alyssa Healy press conference: Australia captain has admitted that she was hanging on for her dear life when India were piling on runs in Vizag. Healy said that sometimes as a captain you only hope that somehow things will get under control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-amol-mazumdar-press-conference-2802070-2025-10-13",
      "headline": "India working on batting issues, will fix dot ball problem: Amol MazumdarWomen's World Cup 2025: The Indian team is trying to fix is dot ball percentage issues, stressed head coach Amol Mazumdar after back to back defeats in the tournament. Mazumdar said that there would be big discussions about it before India's next match against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-match-analysis-2802053-2025-10-13",
      "headline": "IND vs AUS: How India blunted out even before Australia clashWomen's World Cup, IND vs AUS: India were tactically off the mark and poorly planned, resulting in a three-wicket loss to Australia. With plenty to reflect on, they now have thinking to do ahead of their clash against England on October 19 in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: Sudharsan up and running in the chaseIndia (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: Sai Sudharsan has kickstarted his innings fairly positively as India look to make quick work of the chase in the second innings, where they have to chase down a mere target of 121."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-2802039-2025-10-13",
      "headline": "How Alyssa Healy pulled off an all-time classic for AustraliaAlyssa Healy unfurled a sensational 142, a knock marked by both genius and grit, as she capitalised on India's inexperienced bowling attack to help Australia pull off an all-time classic at a packed Vizag Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-amol-mazumdar-press-conference-2802070-2025-10-13",
      "headline": "India working on batting issues, will fix dot ball problem: Amol MazumdarWomen's World Cup 2025: The Indian team is trying to fix is dot ball percentage issues, stressed head coach Amol Mazumdar after back to back defeats in the tournament. Mazumdar said that there would be big discussions about it before India's next match against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-match-analysis-2802053-2025-10-13",
      "headline": "IND vs AUS: How India blunted out even before Australia clashWomen's World Cup, IND vs AUS: India were tactically off the mark and poorly planned, resulting in a three-wicket loss to Australia. With plenty to reflect on, they now have thinking to do ahead of their clash against England on October 19 in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: Sudharsan up and running in the chaseIndia (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: Sai Sudharsan has kickstarted his innings fairly positively as India look to make quick work of the chase in the second innings, where they have to chase down a mere target of 121."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-2802039-2025-10-13",
      "headline": "How Alyssa Healy pulled off an all-time classic for AustraliaAlyssa Healy unfurled a sensational 142, a knock marked by both genius and grit, as she capitalised on India's inexperienced bowling attack to help Australia pull off an all-time classic at a packed Vizag Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-century-australia-thrilling-womens-world-cup-win-press-conference-2802015-2025-10-13",
      "headline": "Alyssa Healy on breaking free from rough patch: I was frustrated, out of rhythmWomen's World Cup: Alyssa Healy roared back to form with a stunning 142 off 107 balls, guiding Australia to a thrilling three-wicket win over India in the Women's World Cup clash at Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-need-to-finish-better-amol-muzumdar-on-loss-to-australia-2802014-2025-10-13",
      "headline": "After batting collapse vs AUS, India coach says team has settled, flexible orderAfter the loss to Australia, India coach Amol Muzumdar said that his side's batting order is settled but can be flexible if needed. India failed to capitalise on their momentum and lost to the Aussies in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-nahida-akter-backs-nigar-sultana-ahead-of-south-africa-clash-2802001-2025-10-13",
      "headline": "Nahida Akter backs Nigar Sultana amid batting woes ahead of South Africa clashBangladesh spinner Nahida Akter has defended captain Nigar Sultana amid poor batting form in the Women's World Cup 2025. The team remains hopeful of a strong comeback in their next match against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-aus-w-amol-muzumdar-eyes-bowling-depth-dot-ball-concerns-2802009-2025-10-12",
      "headline": "India head coach eyes bowling depth, addresses dot ball concerns post AUS lossIndia women's cricket team head coach Amol Muzumdar has said that the team will look to add bowling depth heading ahead in the tournament after their 3-wicket defeat against Australia in the Women's World Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-harmanpreet-kaur-on-india-batting-collapse-sixth-bowler-issue-vs-australia-2802003-2025-10-12",
      "headline": "Batting woes, 6th bowler issue: Harmanpreet Kaur says India has much to fixIndia captain Harmanpreet Kaur said that the late batting order collapse let the team down in their agonising loss to Australia in Vizag on Sunday, October 12. Australia secured a record win after chasing down 331 in 49 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-142-powers-australia-sree-charani-chase-womens-world-cup-india-2802002-2025-10-12",
      "headline": "How Alyssa Healy negated Sree Charani threat to down IndiaWomen's World Cup, IND vs AUS: Alyssa Healy scored a match-winning 142 to lead Australia to a record run-chase of 331 against India, carefully targeting bowlers around key threat Sree Charani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-alyssa-healy-smriti-mandhana-report-2801984-2025-10-12",
      "headline": "Alyssa Healy storm hits Vizag, sinks India in record chaseCaptain Alyssa Healy smashed a jaw-dropping 142 as Australia pulled off the highest-ever chase in women's ODI history, hunting down 331 against hosts India in front of a roaring crowd at the ACA-VDCA Stadium on a Super Sunday to remember."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/florian-wirtz-premier-league-adaptation-liverpool-record-signing-2801909-2025-10-12",
      "headline": "Premier League: Florian Wirtz's slow Liverpool start defended by NagelsmannGermany coach Julian Nagelsmann called for patience with Liverpool's Florian Wirtz as he struggles to adapt to the Premier League. The German midfielder is yet to record a goal or assist in his first seven league matches after arriving from Bayer Leverkusen for a club-record fee."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}