{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-slashes-key-lending-rate-for-3rd-consecutive-time-brings-it-down-to-55-2736557-2025-06-06",
      "headline": "RBI slashes key lending rate for 3rd consecutive time, brings it down to 5.5%The decision was announced after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, concluded its three-day meeting that began on June 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rbi-mpc-sensex-falls-over-100-points-nifty-below-24800-tata-steel-gains-1-percent-2736530-2025-06-06",
      "headline": "Sensex down over 200 points, Nifty below 24,800; Tata Steel gains 1%The S&P BSE Sensex was down by 197.18 points to 81,244.86, while the NSE Nifty50 lost 50.70 points to 24,700.20 as of 9:55 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-6-rbi-mpc-decision-today-sensex-nifty-open-higher-likely-rate-cut-trading-setup-nse-bse-2736515-2025-06-06",
      "headline": "Sensex and Nifty likely to rise on RBI rate cut hopesAnalysts predict a rate cut in RBI's MPC announcement. Gift Nifty futures were trading at 24,849.50 as of 8:30 am, indicating that Nifty50 will open above Thursday's close of 24,750.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-june-6-rbi-mpc-rate-cut-ireda-coal-india-ntpc-green-energy-spicejet-2736505-2025-06-06",
      "headline": "Stocks to watch on June 6 as RBI rate cut anticipatedInvestors will have several stocks in focus as the Reserve Bank of India is expected to announce a rate cut, potentially boosting the market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tesla-stock-share-price-crashes-14-percent-usd-152-billion-loss-biggest-single-day-elon-musk-donald-trump-fallout-2736494-2025-06-06",
      "headline": "Tesla's worst day ever: $152 billion wiped out after Musk-Trump falloutTesla's market capitalisation fell below the $1 trillion mark and ended the day at $916 billion, its biggest single-day loss in value ever."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-theatre-only-release-sitaare-zameen-par-amitabh-bachchan-encouragement-2736669-2025-06-06",
      "headline": "Aamir Khan: Amitabh Bachchan encouraged Sitaare Zameen Par's theatre-only releaseBollywood actor Aamir Khan has decided to release Sitaare Zameen Par exclusively in theatres, rejecting early digital release. He revealed that Amitabh Bachchan's support played a key role in this risky but cinema-loyal decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-dept-q-redefines-slow-burn-police-procedural-drama-scottish-noir-2736675-2025-06-06",
      "headline": "Netflix's Dept.Q is a masterful Scottish crime drama that rewards patienceIn 'Dept. Q', Netflix delivers a masterful Scottish thriller that combines authentic character development with methodical storytelling. This slow-burn procedural proves the audience's patience pays off in the end. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sapphire-out-ed-sheeran-sings-in-punjabi-as-he-collaborates-with-arijit-singh-2736677-2025-06-06",
      "headline": "Sapphire out: Ed Sheeran sings in Punjabi as he collaborates with Arijit SinghEd Sheeran's latest song 'Sapphire' is finally out, and it is sure to give major Goa vibes. The English singer has collaborated with Arijit Singh, and the video also features a glimpse of Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/good-boy-review-park-bo-gum-action-comedy-kdrama-2736612-2025-06-06",
      "headline": "Good Boy review: Park Bo-gum shines in goofy and gutsy KdramaReleased-Sat May 31, 2025Good Boy series review: Good Boy stars Park Bo-gum as a rookie cop in a quirky action-comedy drama. The show blends humour and thrilling fights, promising a fresh take on Kdrama police stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-felton-returns-as-draco-malfoy-for-broadway-harry-potter-and-the-cursed-child-2736606-2025-06-06",
      "headline": "Tom Felton returns as Draco Malfoy for Broadway's Harry Potter and the Cursed ChildActor Tom Felton is all set to make his Broadway debut in 'Harry Potter and the Cursed Child.' He will reprise his role of Draco Malfoy in the play set 19 years after the events of the final book."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-son-akhil-akkineni-zainab-ravdjee-married-2736628-2025-06-06",
      "headline": "Nagarjuna's son Akhil Akkineni and Zainab Ravdjee are married. First pics outNagarjuna and Amala Akkineni's youngest son, Akhil Akkineni, married his fiancée, Zainab Ravdjee, in an intimate wedding on June 6. Their photos from the traditional wedding ceremony are doing the rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-garmi-hook-step-housefull-5-bts-amitabh-bachchan-reacts-2736583-2025-06-06",
      "headline": "Abhishek Bachchan nails Garmi hook step in Housefull 5 BTS, Big B reactsAbhishek Bachchan showed off his moves with Nora Fatehi's Garmi hook step in a fun 'Housefull 5' BTS video. Amitabh Bachchan watched the clip and reacted with amusement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-x-reviews-fans-call-it-entertaining-yet-illogical-bollywood-masala-2736611-2025-06-06",
      "headline": "Housefull 5 X reviews: Fans call it entertaining yet illogical Bollywood masalaAkshay Kumar's 'Housefull 5' has received positive reviews from fans on X, praising its comedy, star performances, and thrilling murder mystery twist. Audiences are eagerly waiting for the release of the second part to see how the story unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-sister-bhawna-kohli-rubbishes-speculations-rift-with-anushka-sharma-2736596-2025-06-06",
      "headline": "Virat Kohli's sister rubbishes speculations of rift between her and Anushka SharmaVirat Kohli's sister Bhawna Kohli has shut down speculations of any rift between her brother and Anushka Sharma. Bhawna set the record straight in a now-deleted post. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-sets-guinness-world-record-for-parachute-stunt-in-mission-impossible-8-2736565-2025-06-06",
      "headline": "Tom Cruise sets Guinness World Record for parachute stunt in Mission Impossible 8Tom Cruise has been awarded a Guinness World Record for performing burning parachute jumps in 'Mission: Impossible – The Final Reckoning'. He jumped out of a helicopter 16 times with a flaming, fuel-soaked parachute with a 50-pound camera rig on his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-sobhita-naga-chaitanya-ram-charan-akhil-akkineni-zainab-ravdjee-nagarjuna-wedding-festivities-2736581-2025-06-06",
      "headline": "Chiranjeevi, Sobhita-Naga Chaitanya, celebs at Akhil-Zainab's wedding festivitiesNagarjuna's younger son, Akhil Akkineni, is all set to get married to Zainab Ravdjee today, June 6, in Hyderabad. Ahead of the grand day, wedding festivities began at the Akkineni house with several celebs in attendance. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-big-bold-beautiful-journey-trailer-margot-robbie-colin-farrell-2736537-2025-06-06",
      "headline": "A Big Bold Beautiful Journey trailer: Margot-Colin revisit past in dreamy love storyThe trailer of 'A Big Bold Beautiful Journey' introduces a magical love story starring Margot Robbie and Colin Farrell as two strangers who travel through their past memories. Full of love, old memories, and emotions, the film promises a heart-touching and dreamy journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/malayalam-actor-shine-tom-chacko-admitted-to-hospital-after-accident-in-tamil-nadu-2736551-2025-06-06",
      "headline": "Shine Tom Chacko's father dies in car accident, actor, his mother severely injuredMalayalam actor Shine Tom Chacko has been admitted to hospital after a car accident in Tamil Nadu. His father, Sibi Chacko, aged 70, died on the spot. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-angry-at-paparazzi-video-reacts-2736548-2025-06-06",
      "headline": "Rana Daggubati reacts to viral video of him getting angry at paps | ExclusiveActor Rana Daggubati was caught on camera confronting paparazzi at Mumbai airport, sparking debate about celebrity privacy. In an exclusive chat with India Today, he expressed his discomfort with invasive filming and called for respectful content creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-tiger-shroff-bike-entry-video-viral-before-housefull-5-release-2736518-2025-06-06",
      "headline": "Akshay-Tiger's stylish bike entry goes viral, ahead of Housefull 5 release. WatchActors Akshay Kumar and Tiger Shroff made a grand entry on a bike at an event, leaving fans thrilled with their stylish appearance. The moment went viral just ahead of the release of 'Housefull 5', which is already generating massive buzz and strong advance bookings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-new-clean-shave-look-sends-internet-into-frenzy-2736504-2025-06-06",
      "headline": "Ranbir Kapoor's new clean-shaven look sends Internet into frenzy. WatchActor Ranbir Kapoor's new clean-shaven and slim look is going viral, and he is looking different from his 'Animal' appearance. He also won hearts by being sweet to fans and paparazzi, ahead of his role as Lord Ram in 'Ramayana'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-jackson-wang-is-finally-coming-to-india-on-june-10-details-inside-2736507-2025-06-06",
      "headline": "Exclusive: Jackson Wang is finally coming to India on June 10; details insideGlobal pop icon Jackson Wang is all set to visit Mumbai on June 10 for a week-long promotional tour and cultural immersion. Read exclusive details. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-1-kamal-haasan-rs-17-crore-india-fails-to-beat-indian-2-vikram-2736495-2025-06-06",
      "headline": "Thug Life box office Day 1: Kamal Haasan's film fails to beat Indian 2, VikramDirector Mani Ratnam's 'Thug Life', starring Kamal Haasan and Silambarasan, opened at the box office on a solid note. However, the film failed to surpass the Day 1 collection of Haasan's previous films, 'Indian 2' and 'Vikram'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-release-date-arrive-early-manju-devi-vs-kranti-devi-promo-suggests-so-2736353-2025-06-05",
      "headline": "Panchayat Season 4 to arrive early? Manju Devi vs Kranti Devi promo suggests soThe rivalry between Manju Devi and Kranti Devi takes a new twist in the rally cry song of 'Panchayat Season 4'. The video hints at the show releasing ahead of the July 2 launch date."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-to-kanyakumari-has-become-a-reality-proud-that-we-completed-unfinished-project-pm-modi-in-jammu-2736702-2025-06-06",
      "headline": "Kashmir to Kanyakumari rail connectivity now a reality: PM Modi in JammuKashmir to Kanyakumari has become a reality, proud that we completed unfinished project: PM Modi in Jammu"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-kashmir-visit-chenab-railway-bridge-live-updates-pahalgam-jammu-vande-bharat-2736523-2025-06-06",
      "headline": "Chenab Bridge, mega projects mark turning point in J&K's journey: PM ModiPM Modi J&K Visit Live Updates: Prime Minister Narendra Modi inaugurated the Chenab Railway Bridge, a record-setting structure that now stands as the tallest railway arch bridge in the world. Towering 359 metres above the Chenab River in Jammu and Kashmir, the bridge is taller than the Eiffel Tower and a key segment of the ambitious Udhampur-Srinagar-Baramulla Rail Link (USBRL) project, aimed at bolstering connectivity in the region. PM Modi also flagged off two specially designed Vande Bharat trains connecting Srinagar with Katra. This is PM Modi's first visit to Jammu and Kashmir after the deadly April 22 Pahalgam terror attack which killed 26 civilians. Stay with IndiaToday.in for live updates.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-inaugurates-worlds-highest-rail-bridge-over-river-chenab-that-will-link-kashmir-valley-to-rest-of-countr-2736622-2025-06-06",
      "headline": "PM opens landmark Chenab Bridge, flags off Vande Bharat in massive Kashmir pushThe inauguration of multiple all-weather infrastructure projects in Kashmir served as a strong message from PM Modi that his government remains committed to the development of the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-elon-musk-breakup-saga-wrecks-the-maga-soap-opera-2736695-2025-06-06",
      "headline": "Trump-Musk breakup saga wrecks the MAGA soap operaDonald Trump and Elon Musk's public feud erupts, turning their bromance into a bitter spectacle. Egos clash, secrets spill, and empires tremble in this chaotic, meme-fuelled theatre of the absurd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-kanyakumari-railway-chenab-bridge-srinagar-vande-bharat-jammu-130-year-old-dream-maharaja-pratap-singh-history-2736605-2025-06-06",
      "headline": "A 140-year-old dream gets fulfilled with Kashmir-Kanyakumari rail linkThe inauguration of the last section of the Udhampur-Baramulla-Srinagar Rail Link, Chenab Bridge and Ajni Bridge will enable direct train travel from Kashmir to Kanyakumari. The project, which needed modern engineering capabilities, was a dream of the Dogra king of Jammu and Kashmir, Maharaja Pratap Singh, who in the late 1880s envisioned the route and engaged British engineers for surveys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-musk-blowup-public-spat-spending-bill-doge-cuts-tesla-shares-spacex-threat-2736477-2025-06-06",
      "headline": "When unstoppable ego met immovable megalomaniac: Trump-Musk breakup in 4 ActsMusk bankrolled Trump's return to power, stood by him on election night, and was crowned a 'super genius' from the inaugural podium. But in just six months, Musk went from kingmaker to enemy number one — as ego clash led to a breakup that rocked Washington and Wall Street alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/b-dayananda-suspension-creates-online-backlash-against-ktaka-govt-support-for-bangalore-police-commissioner-ove-stadium-stampede-case-2736681-2025-06-06",
      "headline": "Support pours in for Bengaluru top cop B Dayananda after suspension over stampedePublic and political backlash has erupted online after Bengaluru Police Commissioner B Dayanand was suspended following the June 4 stampede, with calls for accountability redirected at the government itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-donald-trump-feud-doge-argument-epstein-files-national-secret-new-bill-tesla-spacex-2736601-2025-06-06",
      "headline": "We're 4-5 tweets away from national secrets: Internet grabs popcorn as Trump, Musk sparThe dramatic fallout between Donald Trump and Elon Musk has captivated global attention, with their escalating feud playing out online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/in-trump-vs-musk-battle-nasa-is-the-biggest-loser-2736631-2025-06-06",
      "headline": "In Trump vs Musk battle, Nasa is the biggest loserWhile Trump has certain plans for Nasa, the American space agency is heavily dependent on Musk's SpaceX for most of its operations in the Low Earth Orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chenab-bridge-inauguration-pm-modi-kashmir-visit-congress-jairam-ramesh-2736661-2025-06-06",
      "headline": "PM Modi wants to claim credit: Congress on Chenab rail bridge inaugurationThe Congress accused PM Modi of claiming sole credit for the Chenab rail bridge, highlighting contributions by past prime ministers, including the late Manmohan Singh and Atal Bihari Bajpayee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-x-reviews-fans-call-it-entertaining-yet-illogical-bollywood-masala-2736611-2025-06-06",
      "headline": "Housefull 5 X reviews: Fans call it entertaining yet illogical Bollywood masalaAkshay Kumar's 'Housefull 5' has received positive reviews from fans on X, praising its comedy, star performances, and thrilling murder mystery twist. Audiences are eagerly waiting for the release of the second part to see how the story unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/operation-sindoor-united-abroad-divided-at-home-2736389-2025-06-06",
      "headline": "Operation Sindoor: United abroad, divided at homeWhen an all-party meeting is called to discuss Operation Sindoor, the prime minister doesn't even attend it. Now, when a special session is demanded on the post-Pahalgam situation, the government ignores the plea. When debate is strangulated, democracy is weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-allows-medical-exam-body-reschedule-neet-pg-exam-2736642-2025-06-06",
      "headline": "Supreme Court allows medical exam body to reschedule NEET PG to August 3The Supreme Court allowed NBE to reschedule the NEET PG exam to August 3, citing technical constraints. The court said no further extension would be granted.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-bjp-says-cold-blooded-murderers-punishing-police-slams-congress-government-over-commissioner-dayanand-suspension-after-bengaluru-stampede-2736610-2025-06-06",
      "headline": "Murderers punishing police: BJP slams Congress over top cop's suspensionThe Karnataka BJP has accused the Congress government of targeting Bengaluru Commissioner B Dayanand and suspending him to deflect blame after the stadium stampede that killed eleven people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-dept-q-redefines-slow-burn-police-procedural-drama-scottish-noir-2736675-2025-06-06",
      "headline": "Netflix's Dept.Q is a masterful Scottish crime drama that rewards patienceIn 'Dept. Q', Netflix delivers a masterful Scottish thriller that combines authentic character development with methodical storytelling. This slow-burn procedural proves the audience's patience pays off in the end. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/cricket-body-ksca-approaches-ktaka-hc-to-quash-fir-case-over-bengaluru-chinnaswamy-stadium-rcb-victory-parade-stampede-2736647-2025-06-06",
      "headline": "Karnataka cricket body goes to High Court, wants stampede case cancelledThe Karnataka State Cricket Association (KSCA) has moved the High Court, seeking to quash the case against it in connection with the stampede outside Bengaluru's Chinnaswamy Stadium, in which eleven people died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-teenager-jailed-killing-indian-origin-elderly-man-bhim-sen-kohli-indian-origin-britain-england-leicester-2736616-2025-06-06",
      "headline": "15-year-old UK teenager jailed for killing Indian-origin octogenarianA 15-year-old boy was sentenced to seven years in prison for killing an elderly Indian-origin man, who was attacked while walking his dog in Leicester last year. A 13-year-old girl, who filmed and encouraged the assault, received a three-year youth rehabilitation order and six-month curfew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/will-the-trump-musk-feud-derail-starlinks-india-plans-2736683-2025-06-06",
      "headline": "Will the Trump-Musk feud derail Starlink's India plans?The recent developments in the relationship between the US President and Elon Musk seem to have an immediate impact on the speed of the Starlink project in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japans-resilience-lander-crashes-on-the-moon-heres-what-went-wrong-2736656-2025-06-06",
      "headline": "Why did Japanese ispace's Resilience lander crash on the Moon?Hours after the spacecraft crashed on the Moon, ispace revealed the initial findings from data it received moments before the spacecraft had a hard landing on the Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/indore/story/bjp-leader-kailash-vijayvargiya-opposes-skimpy-trend-clothes-indian-culture-2736604-2025-06-06",
      "headline": "BJP Minister says trend of women wearing skimpy clothes against Indian cultureBJP leader Kailash Vijayvargiya said he disapproves of women wearing skimpy clothes, calling it a foreign concept that goes against Indian culture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-sister-bhawna-kohli-rubbishes-speculations-rift-with-anushka-sharma-2736596-2025-06-06",
      "headline": "Virat Kohli's sister rubbishes speculations of rift between her and Anushka SharmaVirat Kohli's sister Bhawna Kohli has shut down speculations of any rift between her brother and Anushka Sharma. Bhawna set the record straight in a now-deleted post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uefa-nations-league-semi-final-spain-vs-france-lamine-yamal-cristiano-ronaldo-2736690-2025-06-06",
      "headline": "Lamine Yamal relishing challenge of facing Cristiano Ronaldo in Nations League finalLamine Yamal said that he is relishing the challenge of facing Cristiano Ronaldo in the UEFA Nations League final after Spain defeated France in the semi-final on June 5. Spain defeated France 5-4 in Stuttgart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-d-gukesh-final-2736673-2025-06-06",
      "headline": "Norway Chess: D Gukesh, Magnus Carlsen leading race going into final roundIndia's D Gukesh and the legendary Magnus Carlsen are leading the race in Norway Chess going into the final round of the tournament. The two players are divided by just half a point, with Carlsen having the lead after Round 9.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-father-was-disappointed-with-his-test-retirement-2736649-2025-06-06",
      "headline": "Rohit's father was disappointed with his Test retirement, India batter revealsStar India batter Rohit Sharma has revealed that his father was left disappointed following his retirement from Tests. Rohit called time on his Test career ahead of the all-important tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-league-t20-world-club-championship-ecb-bcci-2736641-2025-06-06",
      "headline": "Champions League T20 to return as World Club Championship? ECB chief reactsThe ECB are exploring the idea to have a World Club Championship for T20 cricket, more than a decade after the Champions League T20 became defunct. The CLT20 became defunct in 2014. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-yuzvendra-chahal-injury-rj-mahvash-2736603-2025-06-06",
      "headline": "RJ Mahvash reveals Chahal played through injury in IPL 2025: Had 3 fracturesRJ Mahvash revealed that Yuzvendra Chahal played through injury during the IPL 2025 season for Punjab Kings after their loss in the final to RCB. Chahal had missed three games during the season due to a wrist injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fan-asks-rishabh-pant-about-rohit-sharma-india-star-gives-hilarious-garden-reference-2736600-2025-06-06",
      "headline": "Fan asks Rishabh Pant about Rohit Sharma, India star gives hilarious garden referenceIndia wicketkeeper batter Rishabh Pant gave a hilarious answer when asked by a fan about Rohit Sharma's whereabouts at the airport. India left for England on Thursday, June 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-qualifiers-brazil-vs-ecuador-carlo-ancelotti-argentina-2736584-2025-06-06",
      "headline": "Carlo Ancelotti's debut as Brazil coach ends in lacklustre draw against EcuadorCarlo Ancelotti's debut as the new Brazil coach was a lacklustre one as his side were held to a 0-0 draw by Ecuador in the World Cup qualifiers on Thursday, June 5. Argentina continued their fine run at the top of the standings with a 1-0 win over Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-tour-of-england-gautam-gambhir-shubman-gill-full-press-conference-2736573-2025-06-06",
      "headline": "I am always under pressure, even after winning Champions Trophy: Gautam GambhirIndian cricket team head coach Gautam Gambhir said that he is always under pressure irrespective of the results he's achieved with the team. Gambhir's next assignment will be the five-match Test series against England, set to begin from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-hungry-for-maiden-french-open-title-2736563-2025-06-06",
      "headline": "Aryna Sabalenka hungry for maiden French Open title: 'It would mean the world'Aryna Sabalenka said that it would mean the world to her if she goes on to win the French Open 2025 title. Sabalenka has won all three of her Grand Slam titles on hard courts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubhman-gill-captaincy-press-conference-gautam-gambhir-2736561-2025-06-06",
      "headline": "Not even in my dreams I thought I would lead India in Tests: Shubman GillShubman Gill claimed that he never dreamed about leading India one day in Tests ahead of heading to England ahead of the five-match Test series. Gill replaced Rohit Sharma as the captain of the Test team before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-13-schedule-novak-djokovic-jannik-sinner-carlos-alcaraz-2736549-2025-06-06",
      "headline": "French Open Day 13 schedule: Djokovic takes on Sinner, Alcaraz faces Musetti testThe men's singles semi-finals will take centre stage on Friday, June 6 as Novak Djokovic will square off against World No.1 Jannik Sinner, while defending champion Carlos Alcaraz will face the in-form Lorenzo Musetti. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-qualifiers-brazil-vs-ecuador-carlo-ancelotti-argentina-2736584-2025-06-06",
      "headline": "Carlo Ancelotti's debut as Brazil coach ends in lacklustre draw against EcuadorCarlo Ancelotti's debut as the new Brazil coach was a lacklustre one as his side were held to a 0-0 draw by Ecuador in the World Cup qualifiers on Thursday, June 5. Argentina continued their fine run at the top of the standings with a 1-0 win over Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-tour-of-england-gautam-gambhir-shubman-gill-full-press-conference-2736573-2025-06-06",
      "headline": "I am always under pressure, even after winning Champions Trophy: Gautam GambhirIndian cricket team head coach Gautam Gambhir said that he is always under pressure irrespective of the results he's achieved with the team. Gambhir's next assignment will be the five-match Test series against England, set to begin from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-hungry-for-maiden-french-open-title-2736563-2025-06-06",
      "headline": "Aryna Sabalenka hungry for maiden French Open title: 'It would mean the world'Aryna Sabalenka said that it would mean the world to her if she goes on to win the French Open 2025 title. Sabalenka has won all three of her Grand Slam titles on hard courts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubhman-gill-captaincy-press-conference-gautam-gambhir-2736561-2025-06-06",
      "headline": "Not even in my dreams I thought I would lead India in Tests: Shubman GillShubman Gill claimed that he never dreamed about leading India one day in Tests ahead of heading to England ahead of the five-match Test series. Gill replaced Rohit Sharma as the captain of the Test team before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-13-schedule-novak-djokovic-jannik-sinner-carlos-alcaraz-2736549-2025-06-06",
      "headline": "French Open Day 13 schedule: Djokovic takes on Sinner, Alcaraz faces Musetti testThe men's singles semi-finals will take centre stage on Friday, June 6 as Novak Djokovic will square off against World No.1 Jannik Sinner, while defending champion Carlos Alcaraz will face the in-form Lorenzo Musetti. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}