{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/it-stocks-under-pressure-infosys-tcs-hcltech-ai-disruption-tariff-uncertainty-explained-2873333-2026-02-24",
      "headline": "Infosys, TCS, HCLTech tumble again: Why are IT stocks falling today?A sharp slide in India's biggest tech stocks has once again put the spotlight on global uncertainty and the growing fear that artificial intelligence is reshaping the industry faster than expected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-500-points-nifty-tank-market-crash-it-shares-ai-disruption-tariff-2873319-2026-02-24",
      "headline": "Sensex tumbles 800 points: Why is the stock market falling today?By 10:17 am, the Bombay Stock Exchange (BSE) Sensex had dropped 798.49 points to 82,496.17, while the National Stock Exchange (NSE) of India Nifty50 was down 222.65 points at 25,490.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-tanks-over-450-points-nifty-below-25600-infosys-down-it-stocks-crash-2873316-2026-02-24",
      "headline": "Sensex, Nifty tank in early trade as IT stocks bleed; Infosys down 3%The S&P BSE Sensex was down by 722.19 points to 82,572.47, while the NSE Nifty50 plummeted 203.60 points to 25,509.40 as of 10:04 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-sues-us-government-seeks-refund-trump-emergency-tariffs-supreme-court-ruling-2873313-2026-02-24",
      "headline": "FedEx seeks refund, sues US over Trump's emergency tariff order: ReportFedEx said that it has filed a lawsuit in the US Court of International Trade seeking a refund of tariffs imposed under Trump's emergency powers. The case follows a recent ruling by the US Supreme Court, which found that the tariffs were unlawful. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paramount-raises-offer-for-warner-bros-discovery-amid-netflix-bid-war-reuters-report-2873299-2026-02-24",
      "headline": "Paramount raises offer for Warner Bros Discovery amid Netflix threat: ReportThe fresh bid marks another twist in what has become one of the biggest deal battles in the global media industry. Warner Bros Discovery owns some of Hollywood's most recognised titles, including the Harry Potter and Game of Thrones franchises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finance-minister-mis-selling-is-an-offence-rbi-insurance-guidelines-warns-banks-2873250-2026-02-24",
      "headline": "Banks can't afford to mis-sell, it is an offence: Nirmala SitharamanFinance Minister Nirmala Sitharaman said banks cannot treat mis-selling as routine business and called it an offence. Her remarks come as the Reserve Bank of India is preparing to issue guidance aimed at curbing mis-selling practices by banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-says-rs-590-crore-fraud-due-to-staff-collusion-2873108-2026-02-23",
      "headline": "IDFC First Bank says Rs 590 crore fraud due to staff collusionThe issue first came to light when a Haryana government department asked the bank to close its account and transfer funds. During this process, the bank noticed a mismatch between its records and the department's figures. This led to a wider internal review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-refund-rs-1000-or-less-in-inactive-accounts-who-is-eligible-2873071-2026-02-23",
      "headline": "EPFO to refund Rs 1,000 or less in inactive accounts: Who is eligible?At present, there are around 31 lakh inoperative EPFO accounts. Out of these, nearly six lakh accounts have Rs 1,000 or less deposited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-ai-impact-your-appraisals-this-year-heres-how-much-you-can-expect-2873033-2026-02-23",
      "headline": "Will AI impact your appraisals this year? Here's how much you can expectArtificial intelligence is playing a growing role in shaping compensation models. Around 50 to 60% of large organisations now use data analytics when planning salaries and bonuses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-after-strong-rally-but-it-stocks-limit-gains-2872953-2026-02-23",
      "headline": "Sensex, Nifty end after strong rally, but IT stocks limit gainsThe S&P BSE Sensex gained 479.95 points to end at 83,290.81, while the NSE Nifty50 added 141.75 points to close at 25,713.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-hra-for-rent-to-family-what-draft-tax-rules-may-change-2872936-2026-02-23",
      "headline": "Claiming HRA for rent to family? What draft tax rules may changeMany salaried employees claim HRA for rent paid to family members. While the practice remains allowed, proposed tax rules may bring an extra layer of scrutiny. Here's what could change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/rising-gold-silver-prices-india-should-you-worry-fm-nirmala-sitharaman-rbi-governor-response-2872913-2026-02-23",
      "headline": "Should India be concerned about the rise in gold and silver prices?The Finance Minister said gold has always been a favoured investment for Indian households. Demand often rises during festival seasons such as Akshaya Tritiya and other auspicious occasions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/gurugram-surpasses-mumbai-in-rs-10-crore-plus-home-sales-in-2025-2872890-2026-02-23",
      "headline": "Big housing boost for Gurugram, overtakes Mumbai in 2025 ultra luxury salesGurugram appears to be at the centre of India's ultra-luxury housing story, and the momentum suggests that demand for high-value homes is far from slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-india-supreme-court-criticism-homebuyer-protection-enforcement-gap-real-estate-regulatory-body-2872866-2026-02-23",
      "headline": "Has RERA lost its bite? What homebuyers need to knowThe Supreme Court has come down hard on real estate regulatory authorities (RERA), saying they should be abolished as they appear to favour builders and have failed to protect homebuyers, which is their intended purpose."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-fake-itr-refund-message-led-to-a-rs-15-lakh-loss-2872863-2026-02-23",
      "headline": "How a fake ITR refund message led to a Rs 1.5 lakh lossIt started with a simple message about a pending tax refund. Within minutes, a taxpayer had lost Rs 1.5 lakh. The case reveals how scammers are exploiting refund anxiety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-in-india-idea-corpus-inflation-omniscience-capital-study-2872864-2026-02-23",
      "headline": "Are you saving enough for retirement? Why the Rs 1 crore target is outdatedMany Indians underestimate how fast expenses rise after 60 and how long their savings must last. A new study analyses how inflation, longevity and market risks reshape the real retirement corpus you need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/selling-your-gold-or-silver-mutual-fund-read-this-before-you-pay-tax-2872817-2026-02-23",
      "headline": "Selling your gold or silver mutual fund? Read this before you pay taxThinking of selling your gold or silver fund after the recent price rise? Before you click that sell button, have a closer look at the tax rules. Even a small timing mistake can change your tax bill significantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-moratorium-period-5-years-irdai-non-disclosure-claims-rule-2872800-2026-02-23",
      "headline": "Completed 60 months of continuous cover? Your insurer may not deny your claimThe Insurance Regulatory Authority and Development Authority of India (IRDAI) has passed a historic reform cutting the moratorium period from eight years to five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-rs-590-crore-fraud-haryana-government-accounts-inside-details-2872780-2026-02-23",
      "headline": "How a routine account request revealed a Rs 590-crore fraud at IDFC First BankWhat began as a simple balance check has now expanded into a Rs 590-crore reconciliation exercise, a regulatory disclosure, multiple internal meetings at the highest levels of the bank, and a sharp selloff in the lender's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/idfc-first-bank-share-price-crash-frausd-disclosure-check-key-details-2872751-2026-02-23",
      "headline": "IDFC First Bank shares crash nearly 20% after Rs 590 crore fraudIDFC Bank share price hit a lower circuit shortly after the opening bell, a clear sign of the anxiety that swept through the market. Read on to find out more about the suspected fraud. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tvf-adapt-american-medical-drama-the-pitt-indian-hospital-healthcare-challenges-2873365-2026-02-24",
      "headline": "Exclusive: Is TVF adapting The Pitt for India? Arunabh Kumar breaks silence TVF is reportedly adapting the American medical drama The Pitt for Indian audiences. The remake will explore India's crowded hospitals and unique healthcare dilemmas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emily-in-paris-lily-collins-to-play-audrey-hepburn-in-breakfast-at-tiffanys-film-2873360-2026-02-24",
      "headline": "Emily in Paris' Lily Collins to play Audrey Hepburn in Breakfast at Tiffany's film Lily Collins will play Audrey Hepburn in a new film that explores the making of the classic Breakfast at Tiffany's. Inspired by Sam Wasson's nonfiction book, the project will uncover lesser-known stories, creative tensions and studio dynamics behind the iconic 1961 romantic comedy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sabeer-bhatia-criticises-dhurandhar-film-promoting-revenge-and-hate-2873337-2026-02-24",
      "headline": "Hotmail founder Sabeer Bhatia calls Dhurandhar disgusting: Spreads revenge Hotmail founder Sabeer Bhatia has criticised Dhurandhar for its message of revenge and hate. He urged viewers to reject the Ranveer Singh-starrer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lakshay-jaggi-clarifies-rakul-preet-singh-award-ceremony-snub-social-media-debate-2873348-2026-02-24",
      "headline": "Was Rakul Preet ignored at awards? Fitness influencer Lakshay Jaggi breaks silence A video showing influencer Lakshay Jaggi appearing to ignore actor Rakul Preet Singh at an award ceremony has attracted attention online. Jaggi has now clarified what happened through a statement on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-katrina-kaif-celebrate-fatherhood-motherhood-newborn-son-vihaan-2873334-2026-02-24",
      "headline": "Vicky Kaushal calls Katrina Kaif a warrior mother as he reflects on parenthood Vicky Kaushal shared his admiration for Katrina Kaif's dedication as a mother while discussing his own role as a father to their three-month-old son, Vihaan. He called Kaif a warrior mother, appreciating her resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/when-and-where-to-watch-boong-the-bafta-winning-indian-film-on-ott-2873329-2026-02-24",
      "headline": "When and where to watch Boong, the BAFTA-winning Indian film, on OTT Boong, a Manipuri-language feature film, recently won Best Children's and Family Film at the 79th British Academy Film Awards. While the film has earned international recognition, audiences in India are still waiting for its release on streaming platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-go-teaser-cosmic-visuals-deadline-album-february-2024-2873320-2026-02-24",
      "headline": "BLACKPINK teases cosmic new era with GO, third mini album DEADLINE out February 27 Blackpink has released the first teaser for their new title track GO. The teaser hints at a bold, cosmic visual direction and a major cultural collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-raj-nidimoru-close-relationship-collaborations-indian-entertainment-2873286-2026-02-24",
      "headline": "Actor Samantha calls herself and Raj Nidimoru an irritating couple. Here's why Actor Samantha Ruth Prabhu lightheartedly described herself and Raj Nidimoru as an 'irritating couple'. In an interview, she discussed her dynamic with filmmaker and husband Raj Nidimoru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jeff-bezos-showers-praise-on-ryan-gosling-for-project-hail-mary-2873278-2026-02-24",
      "headline": "Jeff Bezos gives Project Hail Mary lift-off with glowing praise for Ryan Gosling Amazon founder Jeff Bezos has publicly praised Ryan Gosling's performance in Project Hail Mary. What makes the sci-fi epic stand out?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sudipto-sen-on-stepping-down-kerala-story-2-research-concerns-whatsapp-forwards-2872884-2026-02-24",
      "headline": "Sudipto Sen on not helming The Kerala Story 2: Can't make film on WhatsApp forwards Filmmaker Sudipto Sen explained why he is not directing The Kerala Story 2: Goes Beyond. He said that he has chosen not to direct the sequel due to the lack of thorough research and reliance on unverified sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-celebrations-pool-party-elegant-dinner-2873269-2026-02-24",
      "headline": "Rashmika and Vijay's wedding festivities kick off with pool party, elegant dinner The pre-wedding festivities of actors Rashmika Mandanna and Vijay Deverakonda have begun. It featured a poolside gathering with close friends and a sophisticated candlelit dinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-dedication-resilience-inspire-colleagues-health-challenges-2873267-2026-02-24",
      "headline": "Shah Rukh Khan works non-stop despite spine issue, says Govind Namdev Actor Govind Namdev opened up about Shah Rukh Khan's relentless work ethic despite serious health struggles. Here's what he revealed about the superstar's discipline.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-opalite-tops-billboard-hot-100-14th-chart-topping-hit-2873260-2026-02-24",
      "headline": "Taylor Swift's Opalite crowns her 14th Billboard Hot 100 chart-topper Taylor Swift secures another historic milestone as Opalite reaches Number One. Here's how the pop superstar reshaped the charts, again.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bafta-apology-tourettes-syndrome-outburst-film-awards-inclusion-debate-2873257-2026-02-24",
      "headline": "BAFTA sorry to Michael B Jordan, Delroy Lindo for racist slur; owns responsibility BAFTA has apologised after an offensive outburst during the ceremony, which left presenters and viewers stunned. The Academy took full responsibility and assured that they will learn from this incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworths-children-dont-find-thor-cool-actor-reveals-why-2873245-2026-02-23",
      "headline": "Chris Hemsworth's children don't find Thor cool: Actor reveals why Chris Hemsworth revealed that his children are unimpressed by his global stardom and even his role as Thor. The actor shared that while they once found it \"cool,\" they quickly lost interest when they realised he couldn't actually fly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/filmmaker-rob-reiner-son-nick-pleads-not-guilty-in-parents-fatal-stabbing-case-2873233-2026-02-23",
      "headline": "Filmmaker Rob Reiner's son pleads not guilty in parents' fatal stabbing case Nick Reiner has been held without bail since his arrest hours after Rob Reiner and his wife Michele were found dead on December 14 at their home in the upscale Brentwood section of Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/keerthy-suresh-spends-memorable-evening-with-rekha-and-rani-mukerji-shares-pics-2873220-2026-02-23",
      "headline": "Keerthy Suresh spends memorable evening with Rekha and Rani Mukerji, shares pics Keerthy Suresh shared glimpses from a memorable evening with Rani Mukerji and Rekha, delighting fans with stylish moments from the star-studded meet-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tim-burton-welcomes-winona-ryder-to-wednesday-season-3-she-fits-right-in-2873125-2026-02-23",
      "headline": "Tim Burton welcomes Winona Ryder to Wednesday Season 3: She fits right in Winona Ryder will play a guest role in Wednesday Season 3. She will be reuniting with her Beetlejuice Beetlejuice co-star Jenna Ortega in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zakir-khan-shares-real-reason-for-stand-up-break-no-major-health-issues-2873165-2026-02-23",
      "headline": "Zakir Khan shares real reason for stand-up break: No major health issues Zakir Khan has clarified that his break from stand-up comedy is not due to any serious health issue but to focus on writing projects and personal priorities. The comedian reassured fans that he is doing well and plans to step back from live shows for a few years."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-air-ambulance-victims-family-took-rs-8-lakh-loan-to-save-him-2873331-2026-02-24",
      "headline": "Jharkhand couple killed in air ambulance crash had taken Rs 8 lakh loan for planeIn a desperate attempt to save the life of 41-year-old Sanjay, the family took a loan of 8 lakh from friends and relatives. Sanjay, along with 6 others, died in the air ambulance crash. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/youth-congress-chief-uday-bhanu-chib-arrested-over-shirtless-protest-at-ai-summit-to-be-produced-before-court-2873326-2026-02-24",
      "headline": "Youth Congress chief who masterminded shirtless protest at AI Summit arrestedSources said the Youth Congress chief, Uday Bhanu Chib, was arrested after being grilled for nearly 20 hours. He has been booked on charges of criminal conspiracy, voluntarily causing harm to a public servant, obstructing a public servant on duty, and wilful disobedience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsnl-director-prayagraj-visit-cancelled-vip-protocol-sangam-bath-goes-viral-2873357-2026-02-24",
      "headline": "50 staff, bath kits: BSNL official's Prayagraj visit in limelight over trip planThe visit was cancelled shortly after the internal document outlining elaborate arrangements for the visit went viral, drawing sharp reactions over what many users described as excessive VIP treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-mexico-took-down-drug-lord-el-mencho-with-help-of-his-girlfriend-cjng-violence-glbs-2873218-2026-02-23",
      "headline": "How Mexico took down drug lord El Mencho by tracking his girlfriendMexico's Defence Minister Ricardo Trevilla said investigators tracked a close aide connected to one of Oseguera's partners and monitored her movements to a secluded rural compound. When she left, authorities assessed that the cartel chief was still inside under tight security, prompting them to swiftly launch the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-ireland-racial-attack-online-irish-food-bank-report-2873090-2026-02-23",
      "headline": "How a photo triggered racist tirade against Indians in IrelandAn Irish media report about a university turning away students from food bank due to rising demand has triggered racial attacks against Indians. An Irish social media user accused Indians of \"looting\" services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-class-10-student-trying-to-stop-assault-near-school-shivamogga-beaten-to-death-2873376-2026-02-24",
      "headline": "Class 10 student, trying to stop assault near school in Karnataka, beaten to deathAccording to investigators, the 16-year-old victim stepped in to pacify the situation, but the assailants turned on him and struck him repeatedly, including blows to the chest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-murder-bcom-student-stole-jewellery-home-father-tracked-killer-son-before-killing-2873349-2026-02-24",
      "headline": "Lucknow man stole jewellery from home, father tracked killer son before murderPolice now believe that 21-year-old Akshat Singh shot dead his father, Manvendra Pratap Singh, after the 50-year-old businessman uncovered his son's alleged role in a jewellery theft at their home months earlier and began closely monitoring him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-namo-bharat-delhi-meerut-rrts-metro-share-tracks-launch-alwar-panipat-karnal-neemrana-2873080-2026-02-24",
      "headline": "How India rolled out high-speed rail, metro using common tracksPM Narendra Modi inaugurated both, India's first full RRTS corridor connecting New Delhi and Meerut, and a metro system for the city in western Uttar Pradesh. The shared-track model, with both the services using the same infrastructure, will deliver high-speed regional travel and a seamless urban commute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-celebrations-pool-party-elegant-dinner-2873269-2026-02-24",
      "headline": "Rashmika and Vijay's wedding festivities kick off with pool party, elegant dinnerThe pre-wedding festivities of actors Rashmika Mandanna and Vijay Deverakonda have begun. It featured a poolside gathering with close friends and a sophisticated candlelit dinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-man-visits-japan-zoo-to-see-viral-baby-monkey-punch-records-video-of-crowd-2873328-2026-02-24",
      "headline": "Pakistani man visits Japan zoo to see internet star Punch, records video of crowdA Pakistani man travelled to Ichikawa City Zoo in Japan to see Punch, the baby monkey who has gone viral after it was seen roaming around with a plushie in viral videos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-12-accountancy-board-exam-2026-live-paper-analysis-question-paper-expert-review-and-student-reactions-2873210-2026-02-24",
      "headline": "Live: CBSE Class 12 Accountancy paper begins, expert analysis soonCBSE Class 12 Accountancy Board Exam 2026: Thousands of Class 12 commerce students will appear for the Accountancy board exam today, February 24. With the paper scheduled for the morning shift, CBSE has outlined important reporting time rules and exam-day instructions. Follow this live blog for the latest updates on the CBSE Class 12 Accountancy exam, including student reactions, question paper insights, difficulty level analysis, and expert reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/wipro-cto-says-ai-will-rule-next-20-years-these-it-skills-will-matter-most-2873109-2026-02-23",
      "headline": "Wipro CTO says AI will rule for next 20 years, these IT skills will matter mostWipro's top executive Hari Shetty says fears around AI hurting Indian IT firms are misplaced, arguing that the technology will keep companies busy for decades while rewarding engineers who understand AI deeply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-dementia-epidemic-social-and-economic-cost-2873097-2026-02-24",
      "headline": "What is the real toll of India's silent dementia epidemic?Here's why we should care about the massive gaps in India's dementia care infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-villa-gang-rape-case-accuses-extortion-woman-sexual-assault-police-valentines-day-party-2872995-2026-02-23",
      "headline": "She wanted sugar daddy: Bengaluru gang-rape accused alleges extortionPolice are investigating conflicting claims in the Bengaluru villa case, where an accused has alleged an extortion attempt, while the woman has accused two men of gang-raping her during a Valentine's Day party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-moves-to-revoke-tahawwur-rana-citizenship-ahead-of-mark-carney-india-visit-2873254-2026-02-24",
      "headline": "Canada moves to revoke Tahawwur Rana's citizenship ahead of Carney's India visitCanada has begun proceedings to strip Tahawwur Rana of his citizenship over alleged misrepresentation in his application, as he remains in Indian custody awaiting trial in the 26/11 Mumbai attacks case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jharkhand-air-ambulance-had-requested-route-deviation-shortly-before-crash-2873304-2026-02-24",
      "headline": "Jharkhand air ambulance requested route deviation shortly before crash; 7 deadA last-minute emergency call was made from the Ranchi-to-Delhi air ambulance requesting a route deviation due to bad weather, just moments before the crash that killed everyone on board, after which communication went dark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/winter-storm-us-northeast-flight-cancellations-heavy-snow-travel-restrictions-blizzard-warnings-glbs-2873248-2026-02-24",
      "headline": "US braces for bomb cyclone, 10,000 flights cancelled, blizzard warnings in placeAir travel across the region was severely disrupted. More than 10,000 flights were cancelled, as airlines pre-emptively grounded aircraft ahead of the storm's peak. Monday alone accounted for over 5,000 cancellations, with more than 1,300 already scrapped for Tuesday as carriers prepared a cautious return to service."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-500-points-nifty-tank-market-crash-it-shares-ai-disruption-tariff-2873319-2026-02-24",
      "headline": "Sensex tumbles 800 points: Why is the stock market falling today?By 10:17 am, the Bombay Stock Exchange (BSE) Sensex had dropped 798.49 points to 82,496.17, while the National Stock Exchange (NSE) of India Nifty50 was down 222.65 points at 25,490.35."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sabeer-bhatia-criticises-dhurandhar-film-promoting-revenge-and-hate-2873337-2026-02-24",
      "headline": "Hotmail founder Sabeer Bhatia calls Dhurandhar disgusting: Spreads revengeHotmail founder Sabeer Bhatia has criticised Dhurandhar for its message of revenge and hate. He urged viewers to reject the Ranveer Singh-starrer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-son-shoots-father-exam-pressure-body-hidden-in-drum-murder-case-uttar-pradesh-2873170-2026-02-23",
      "headline": "Pressured over NEET, Lucknow man shoots father dead, hides chopped body in drumA 21-year-old BCom student allegedly shot his father dead in Lucknow after repeated pressure to prepare for NEET, dismembered the body, and hid its parts inside a drum at their home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-abhishek-sharma-sanju-samson-selection-dilemma-2873354-2026-02-24",
      "headline": "Spin troubles aside, India should stay patient with Abhishek SharmaT20 World Cup: Abhishek Sharma's continuous poor form in T20 World Cup 2026 has intensified calls for change, with Sanju Samson emerging as a possible alternative. With India in a do-or-die situation, their next selection move could determine the fate of their World Cup campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/his-values-rare-today-shashi-tharoor-welcomes-rajaji-statue-rashtrapati-bhavan-shares-pm-modi-x-post-2873311-2026-02-24",
      "headline": "His values rare today: Shashi Tharoor welcomes Rajaji statue at Rashtrapati BhavanCongress MP Shashi Tharoor welcomed the unveiling of C Rajagopalachari's bust at Rashtrapati Bhavan, saying the former Governor-General's liberal and constitutional values remain relevant but have few followers today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-sues-us-government-seeks-refund-trump-emergency-tariffs-supreme-court-ruling-2873313-2026-02-24",
      "headline": "FedEx seeks refund, sues US over Trump's emergency tariff order: ReportFedEx said that it has filed a lawsuit in the US Court of International Trade seeking a refund of tariffs imposed under Trump's emergency powers. The case follows a recent ruling by the US Supreme Court, which found that the tariffs were unlawful. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-slams-false-narratives-about-personal-life-after-second-marriage-2873240-2026-02-23",
      "headline": "Shikhar Dhawan slams false narratives about personal life after second marriageShikhar Dhawan has slammed people for circulating false statements about his personal life after his second marriage. Dhawan recently married his girlfriend Sophie Shine in a private ceremony."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-t20-world-cup-super-8s-rain-washout-pakistan-weather-forecast-semifinal-qualification-pallekele-2873361-2026-02-24",
      "headline": "PAK vs ENG: Will rain washout yet another Super 8s game for Pakistan in Pallekele? PAK vs ENG, T20 World Cup 2026 Super 8s: Pakistan's second Super 8s game against England in Pallekele looks set to avoid the rain that washed out their opener, with forecasts showing just a 2 per cent chance of showers on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-abhishek-sharma-sanju-samson-selection-dilemma-2873354-2026-02-24",
      "headline": "Spin troubles aside, India should stay patient with Abhishek Sharma T20 World Cup: Abhishek Sharma's continuous poor form in T20 World Cup 2026 has intensified calls for change, with Sanju Samson emerging as a possible alternative. With India in a do-or-die situation, their next selection move could determine the fate of their World Cup campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/angkrish-raghuvanshi-interview-rohit-sharma-kkr-india-ipl-2026-abhishek-nayar-2873276-2026-02-24",
      "headline": "With lessons from Rohit, Raghuvanshi embraces the long road to India cap An Under-19 World Cup winner and now a rising force at Kolkata Knight Riders, Angkrish Raghuvanshi is navigating the early years of his career with clarity and patience. The Mumbai youngster speaks about growth, mentorship under Abhishek Nayar, learning alongside Rohit Sharma, and his ambitions for IPL 2026 and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-vs-jammu-and-kashmir-live-score-ranji-trophy-final-updates-hubli-2873305-2026-02-24",
      "headline": "Ranji Trophy final Day 1 Live: Hassan hits back after shaky start Karnataka (KAR) vs Jammu and Kashmir (J&K) Live Score, Ranji Trophy final: After losing the opener early on, J&K have shown more promise with Yawer Hassan picking up the scoring rate against Karnataka. The side led by Devdutt Padikkal is searching for another breakthrough. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-no-3-irfan-pathan-ind-vs-zim-t20-world-cup-axar-patel-2873285-2026-02-24",
      "headline": "Suryakumar at No.3: Irfan Pathan urges batting shake-up for IND vs ZIM T20 World Cup: Irfan Pathan suggested that India captain Suryakumar Yadav should think about coming in at No.3 for India during their clash against Zimbabwe in Chennai. Pathan also said the hosts need Axar Patel back in the lineup but warned against making too many changes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-t20-world-cup-super-8-match-preview-pallekele-2873229-2026-02-24",
      "headline": "ENG vs PAK, Super 8 preview: Pakistan out to break England curse in tricky clash T20 World Cup, ENG vs PAK: England will look to seal their semi-final berth when they face Pakistan on Tuesday in Pallekele International Cricket Stadium. Pakistan, who have never beaten England in the tournament's history, face a tough challenge heading into the contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-odi-series-against-australia-world-champions-alyssa-healy-2873098-2026-02-24",
      "headline": "World champions India Women resume ODI duties in Alyssa Healy's farewell festival INDW vs AUSW: Harmanpreet Kaur's India will be taking the field for the first time as the world champions when they meet Australia in the first ODI on Tuesday in Brisbane. Alyssa Healy is also set to play in her last white-ball series for the Aussies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-slams-false-narratives-about-personal-life-after-second-marriage-2873240-2026-02-23",
      "headline": "Shikhar Dhawan slams false narratives about personal life after second marriage Shikhar Dhawan has slammed people for circulating false statements about his personal life after his second marriage. Dhawan recently married his girlfriend Sophie Shine in a private ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-west-indies-crush-zimbabwe-india-in-trouble-hetmyer-record-fifty-2873212-2026-02-23",
      "headline": "T20 World Cup: West Indies add to India's woes with thumping win over Zimbabwe West Indies secured a commanding 107-run victory over Zimbabwe in their Super 8 T20 World Cup match at Mumbai. The victory has intensified the pressure on India, who face a challenging path ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-womens-cricket-rashid-khan-support-exile-challenges-2873183-2026-02-23",
      "headline": "How Rashid Khan lent his helping hand for Afghanistan women's team Firooza Amiri has revealed how Rashid Khan supported the Afghanistan women's team. Recently, Rashid also spoke in their favour during a press conference at the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-pakistan-t20-world-cup-liam-dawson-press-conference-2873155-2026-02-23",
      "headline": "England in a good place despite not being at their best: Liam Dawson before Pakistan clashT20 World Cup 2026, ENG vs PAK: Speaking to the reporters before the match against Pakistan on Tuesday, Liam Dawson said that England can play much better cricket, but are in good shape after their win against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-suspends-gianluca-prestianni-racist-abuse-vinicius-junior-champions-league-2873152-2026-02-23",
      "headline": "UEFA suspends Benfica's Prestianni for 2nd leg tie with Madrid over alleged racismUEFA has provisionally suspended Benfica's Gianluca Prestianni for Wednesday's Champions League match against Real Madrid following the alleged racist incident involving Vinicius Junior in last week's first leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sahibzada-farhan-england-vs-pakistan-t20-world-cup-super-8-press-conference-2873151-2026-02-23",
      "headline": "Pakistan will give England a tough time in Super 8s: Sahibzada FarhanT20 World Cup 2026, ENG vs PAK: Speaking to the reporters, Sahibzada Farhan said that Pakistan are not bothered about their winless run against England in the history of the tournament. Pakistan have lost all three matches against the Brits in the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-sitanshu-kotak-axar-patel-selection-2873132-2026-02-23",
      "headline": "Suryakumar and Gambhir explained Sundar's selection for SA clash to Axar: KotakT20 World Cup: Batting coach Sitanshu Kotak said that India captain Suryakumar Yadav and head coach Gautam Gambhir spoke to Axar Patel before the Super Eight match against South Africa"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-jammu-kashmir-live-streaming-2873134-2026-02-23",
      "headline": "Ranji Trophy Final, Karnataka vs Jammu and Kashmir: When and where to watchRanji Trophy Final: Karnataka and Jammu and Kashmir are all set to lock horns in the grand finale, starting Tuesday, February 24 at the KSCA Rajnagar Stadium in Hubballi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-england-vs-pakistan-liam-dawson-presser-usman-tariq-2873121-2026-02-23",
      "headline": "England wary of Pakistan as a unit, not only spinner Usman Tariq: Liam DawsonEngland spinner Liam Dawson insisted his side will not be distracted by the growing hype around Pakistan's mystery spinner Usman Tariq ahead of their crucial T20 World Cup Super 8 clash in Pallekele."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sahibzada-farhan-reaction-ipl-owned-hundred-teams-pakistan-players-2873101-2026-02-23",
      "headline": "Sahibzada reacts to reports of IPL-owned Hundred teams snubbing Pakistani playersPakistani batter Sahibzada Farhan brushed aside questions related to speculation that players from his country could be ignored by at least four Indian-owned franchises in The Hundred auction, saying the matter was beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-zimbabwe-live-score-super-8s-t20-world-cup-mumbai-2873063-2026-02-23",
      "headline": "ZIM vs WI Super 8 Highlights: West Indies hammer Zimbabwe by 107 runs in MumbaiZimbabwe (ZIM) vs West Indies (WI), T20 World Cup Super 8 Highlights: West Indies beat Zimbabwe by 107 runs at the Wankhede Stadium in Mumbai after Gudakesh Motie picked up four wickets and Shimron Hetmyer played a stupendous knock. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-cricket-tour-south-africa-2026-sandpapergate-return-smith-newlands-tests-2873035-2026-02-23",
      "headline": "Australia return for Tests in South Africa, 8 years after SandpapergateAustralia are set to tour South Africa for an ODI and Test series in September and October later this year. The Aussies have not played a series in South Africa since the infamous Sandpapergate scandal in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-vs-karnataka-preview-predicted-xi-pitch-report-2873034-2026-02-23",
      "headline": "Jammu and Kashmir eye historic title, Karnataka target ninth crownRanji Trophy Final: Jammu and Kashmir will need to pull off a giant-sized miracle against eight-time champions Karnataka if they are to win their first-ever title over the next five days, starting Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-dragged-india-along-the-ground-insulted-them-saqlain-mushtaq-t20-world-cup-2873018-2026-02-23",
      "headline": "SA dragged India along the ground and insulted them: Former Pakistan cricketerSouth Africa handed India their first T20 World Cup defeat after 12 wins with a 76-run victory. The loss has raised questions over India's batting strategy and tournament prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-daryl-mitchell-banks-on-india-second-favourite-tag-for-semi-final-push-2872921-2026-02-23",
      "headline": "New Zealand's Mitchell banks on India's '2nd favourite' tag for semi-final pushNew Zealand all-rounder Daryl Mitchell said his side was ready to embrace their tag as Indian cricket fans' \"second favourite team\" as they attempt to steer through a demanding Super Eight group and return to the semi-finals of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/vaishnavi-adkar-itf-w100-bengaluru-final-wta-top-500-breakthrough-2872949-2026-02-23",
      "headline": "Who is Vaishnavi Adkar? Pune star becomes India's No.2 with dream run in BengaluruVaishnavi Adkar had a remarkable run at the ITF Women's W100 Open in Bengaluru, finishing as the runner-up. The 21-year-old also rose to become India's No. 2 ranked player following this impressive performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-suryakumar-yadav-problems-analysis-2872893-2026-02-23",
      "headline": "South Africa expose India's real problem: Accelerators without Kohli-type engineT20 World Cup: Surya Kumar Yadav smiled at a presser. South Africa had the last laugh. India's World Cup campaign is exposing a structural flaw no amount of aggression can hide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-cupcake-ad-deleted-india-vs-south-africa-next-ad-prediction-2872895-2026-02-23",
      "headline": "Cupcake ad deleted, ego eaten: What is Star Sports serving next?T20 World Cup 2026: When the Cupcake promo disappeared after India's humbling defeat to South Africa in Ahmedabad, it symbolised more than embarrassment. The 'cupcake gate' has exposed how arrogance, hype, and disrespect have overtaken thoughtful storytelling in cricket broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-west-indies-super-8-preview-t20-world-cup-mumbai-2872882-2026-02-23",
      "headline": "ZIM vs WI, Super 8 preview: India watch closely as confident sides clash in MumbaiT20 World Cup 2026, West Indies vs Zimbabwe Super 8 preview: Two-time champions West Indies will look to continue their resurgent run when they face an inspired Zimbabwe side that stunned Sri Lanka and Australia last week. India, who suffered a 76-run defeat to South Africa on Sunday, will also keep a close eye on this contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-captain-sikandar-raza-confident-icc-t20-world-cup-super-eights-2872869-2026-02-23",
      "headline": "Zimbabwe not worried about lack of experience in India: Raza sends Super 8 warningZimbabwe captain Sikandar Raza dismissed concerns about his team's limited recent T20I experience in India, expressing confidence that they possess the belief and capability to produce a \"top performance\" in the Super Eights of the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-daren-sammy-praises-zimbabwe-motivation-super-8s-performance-2872843-2026-02-23",
      "headline": "Who said Zimbabwe was not supposed to be here? Sammy reacts to Super 8 pre-seedingWest Indies head coach Daren Sammy on Sunday said Zimbabwe may have drawn extra motivation from being clubbed with higher-seeded sides Sri Lanka and Australia in Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-pakistan-players-shadow-ban-the-hundred-indian-franchises-warning-2872842-2026-02-23",
      "headline": "ECB warns Indian-owned The Hundred teams over shadow-ban on Pakistan playersEngland Cricket Board has issued a reminder to The Hundred franchises of their obligations under anti-discrimination regulations, while reports keep emerging of Indian-owned franchises ignoring Pakistan players in the upcoming auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-t20-world-cup-david-miller-varun-chakravarthy-plans-super-8-press-conference-ahmedabad-2872834-2026-02-23",
      "headline": "South Africa were prepared for India's Varun Chakravarthy threat: David MillerT20 World Cup: South Africa batter David Miller explained how the Proteas did their homework about facing India's spin threat Varun Chakravarthy in the Super 8 clash in Ahmedabad, which ended up paying big dividends for the side in their dominant win om Sunday. Miller voiced pride on South Africa's overall brilliance shown against the defending champions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}