{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/anil-ambani-likely-to-be-summoned-again-by-ed-for-questioning-sources-2766726-2025-08-05",
      "headline": "Anil Ambani likely to be summoned again by ED for questioning: SourcesAnil Ambani faced questioning by the Enforcement Directorate in connection with an alleged Rs 17,000 crore loan fraud case. The questioning lasted for several hours, with sources indicating that he is likely to be summoned again within seven to ten days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-seeks-10-from-ed-days-to-provide-documents-in-fraud-cases-sources-2766708-2025-08-05",
      "headline": "Anil Ambani seeks 10 days from ED to provide documents in fraud cases: SourcesThe 66-year-old industrialist was summoned to the ED headquarters in New Delhi, where his statement was recorded under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-higher-fd-returns-compare-these-1-year-rates-before-investing-indusind-bank-icici-bank-2766623-2025-08-05",
      "headline": "Want higher FD returns? Compare these 1-year rates before investingAmong the different time periods you can choose, a one-year FD is especially attractive. It gives you decent interest without locking up your money for too long. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-indian-tech-founders-can-register-a-global-company-online-in-4-hours-and-enjoy-0-percent-tax-on-reinvested-profits-2765929-2025-08-05",
      "headline": "Why Estonia is the new favourite for Indian startupsAccording to an investment banker, top business leaders have already adopted Estonia's unique e-residency, allowing them to do business across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-308-points-lower-nifty-below-24700-titan-up-2-2766579-2025-08-05",
      "headline": "Sensex ends over 308 points lower, Nifty below 24,700; Titan up 2%The S&P BSE Sensex ended the session 308.47 points lower at 80,710.25, while the NSE Nifty50 fell 73.20 points to settle at 24,649.55. All the broader market indices ended the trading session in negative territory after Trump said he would impose more tariffs on India over Russian oil imports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-property-seller-nearly-paid-rs-187-lakh-more-in-tax-due-to-a-common-capital-gains-error-2766498-2025-08-05",
      "headline": "How one tax mistake could have cost a real estate seller Rs 1.87 lakhReal estate sellers often ignore deductions that can help reduce capital gains tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blended-petrol-india-government-push-reason-explained-2766519-2025-08-05",
      "headline": "Why the government wants to blend more ethanol with petrolBy March 2025, the government hit its E20 blending target—20% ethanol in petrol—five years ahead of schedule. Average blending levels stood at 17.98% in February 2025, up from 14.6% the year before, according to official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-do-this-before-anything-else-2766485-2025-08-05",
      "headline": "Filing ITR for the first time? Do this before anything elseThe last date to file your ITR for the financial year 2024–25 is September 15, 2025, so it's best to begin early and avoid the last-minute rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pan-20-to-go-live-in-18-months-what-it-means-and-how-it-affects-you-2766433-2025-08-05",
      "headline": "PAN 2.0 to go live in 18 months: What it means and how it affects youThe Rs 1,435 crore project will focus on simplifying taxpayer registration services and improving the overall experience through a new, unified online platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-p-b-balaji-jaguar-land-rover-new-ceo-2766412-2025-08-05",
      "headline": "Who is P B Balaji, Jaguar Land Rover's new CEO?The decision was confirmed in a stock exchange filing on August 4, 2025. Balaji's appointment marks a major shift, as he moves from a financial leadership role to the driver's seat of one of the world's most recognised car brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-investors-worried-trump-tariff-threat-sensex-nifty-fall-today-2766386-2025-08-05",
      "headline": "Sensex tumbles 400 points: Why is the stock market falling today?The S&P BSE Sensex was down 394.03 points to 80,614.50 at around 9:59 am, while the NSE Nifty50 fell 121.90 points to 24,600.85. Broader markets also mirrored the nervousness on Dalal Street, with mid- and small-cap indices under pressure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-regulator-irdai-fines-policybazaar-multiple-violations-key-details-2766375-2025-08-05",
      "headline": "Why insurance regulator fined Policybazaar Rs 5 crore? All you need to knowThe IRDAI noted that various insurance products were promoted as \"top\" or \"best\" in a manner that appeared biased and lacked substantiation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-below-24700-indusind-bank-gains-2-2766359-2025-08-05",
      "headline": "Sensex, Nifty fall after Trump's fresh tariff threat over Russian oil importsThe S&P BSE Sensex fell 156.96 points to 80,861.76 around 9:23 am, while the NSE Nifty50 fell 30.80 points to trade at 24,691.95. Most of the broader market indices also mirror the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-ethanol-blended-petrol-clarification-safe-for-old-new-vehicles-2766355-2025-08-05",
      "headline": "Government's big remark as ethanol-blended petrol has car owners fumingIn a post on X (formerly Twitter), the ministry responded to recent media reports questioning whether E20 fuel could damage older vehicles or degrade the driving experience. Citing multiple studies and expert assessments, it stated that E20 is both safe and beneficial."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summons-delhi-loan-fraud-case-reliance-group-pmla-2766344-2025-08-05",
      "headline": "Anil Ambani at ED office for questioning in multiple fraud casesThe summons against Anil Ambani followed a massive crackdown by the ED last month, during which the agency searched 35 premises linked to some top executives of the Reliance Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thousands-boeing-fighter-jet-workers-strike-after-rejecting-contract-offer-glbs-2766297-2025-08-05",
      "headline": "Thousands of Boeing fighter jet workers go on strike after rejecting contract offerOver 3,200 workers have walked off the job in what marks their first strike in nearly 30 years. The affected workers, primarily based in the St. Louis region, are responsible for assembling and maintaining military aircraft, including the F-15 fighter jet and various missile systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-mumbai-tesla-to-open-showroom-in-delhis-aerocity-on-august-11-2766180-2025-08-04",
      "headline": "After Mumbai, Tesla to open showroom in Delhi's Aerocity on August 11The Delhi showroom will be opened at Worldmark 3 in Aerocity for customers. Like the Mumbai showroom, this showroom is also expected to serve as a display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-brand-loyalty-rate-dropped-after-elon-musk-backed-donald-trump-as-us-president-2766155-2025-08-04",
      "headline": "Tesla's brand loyalty took a hit after Musk backed Trump as US President: ReportThe data shows Tesla's customer loyalty peaked in June 2024, when 73% of Tesla-owning households in the market for a new car bought another Tesla, according to an S&P analysis of vehicle-registration data in all 50 states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-kapurs-mother-says-his-death-could-be-part-of-coordinated-transnational-conspiracy-seeks-uk-probe-2766105-2025-08-04",
      "headline": "Sunjay Kapur's death: Mother alleges foul play, transnational conspiracy in letterSunjay Kapur passed away on June 12 while playing polo at the Duke's Ground of the Old Guards Polo Club in Surrey, UK. His death was officially described as a heart attack. However, his mother Rani now claims there may be more to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-activate-uan-via-umang-app-epfo-makes-aadhaar-face-authentication-mandatory-from-august-7-2766068-2025-08-04",
      "headline": "How to activate UAN via UMANG app to access EPFO servicesEPFO now requires everyone to activate their UAN through the UMANG app using Aadhaar-based face authentication to access provident fund services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-offers-elon-musk-29-billion-deal-to-stay-onboard-2766070-2025-08-04",
      "headline": "Tesla offers Elon Musk $29 billion deal to stay onboardIn 2018, Tesla had promised Musk a huge $50 billion pay package if he hit certain performance goals. But earlier this year, a court in Delaware cancelled that deal, saying the company's board didn't do a fair job protecting shareholders when they approved it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/eds-crackdown-on-anil-ambani-web-of-bank-frauds-all-you-need-to-know-2766076-2025-08-04",
      "headline": "ED's crackdown on Anil Ambani, web of bank frauds: All you need to knowThe fraud case centres around unpaid loans amounting to nearly Rs 17,000 crore, which were taken by various firms linked to Anil Ambani. Officials are now trying to trace the money trail and who were all involved in diverting it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-you-unemployed-or-studying-should-you-file-taxes-this-year-2766048-2025-08-04",
      "headline": "Are you unemployed or studying? Should you file taxes this yearIf your total income is below the basic exemption limit, Rs 2.5 lakh under the old tax regime or Rs 3 lakh under the new one, you are not legally required to file an ITR. This means many students and unemployed individuals fall outside the mandatory filing bracket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-418-points-higher-nifty-above-24700-tata-steel-ends-4-percent-up-2766024-2025-08-04",
      "headline": "Sensex closes 418 points higher, Nifty above 24,700; Tata Steel ends 4% upThe S&P BSE Sensex added 418.81 points to close at 81,018.72, while the NSE Nifty50 gained 157.40 points to end at 24,722.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-it-jobs-at-risk-ai-automation-entry-mid-level-why-reasons-expert-view-2766017-2025-08-04",
      "headline": "TCS to cut 12,000 jobs in FY26: Why are mid-level IT jobs at risk?Experts believe TCS layoffs point to a broader structural change where automation and AI are beginning to take over routine tasks, leading to a change in the type of roles companies want to retain and the kind of talent they want to hire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-probes-banks-in-rs-17000-crore-loan-fraud-linked-to-anil-ambani-2765906-2025-08-04",
      "headline": "ED probes banks in Rs 17,000 crore loan fraud linked to Anil AmbaniThe Enforcement Directorate (ED) is investigating why 39 banks failed to report a loan fraud of ₹17,000 crore linked to companies of businessman Anil Ambani. The agency suspects that the banks' silence may have been bought. The central question being investigated is, \"Was there a certain bribe that was paid to the banks to buy their silence?\" The ED has asked the banks to explain their inaction, especially when the loans turned into non-performing assets (NPAs). As the money laundering investigation mounts, Anil Ambani has been summoned to appear on the 5th of August. The ED has also summoned his top executives and close aides, including Amitabh Jhunjhunwala and Satish Seth, believing they hold key information on how the alleged frauds and payment of bribes occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI reveals how much PSU banks spend on recovery agentsIndia Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-whats-better-for-you-in-fy-2024-25-2765913-2025-08-04",
      "headline": "Old vs new tax regime: What's better for you in FY 2024–25?With the ITR filing deadline extended to September 15, 2025, you've got more time to pick the right tax regime. Should you stick to the old one with its deductions, or go for the new one with lower rates?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-probe-summons-anil-ambani-top-executives-questions-39-bank-rs-17000-crore-loan-fraud-2765902-2025-08-04",
      "headline": "ED summons Anil Ambani's top aides; probes banks over Rs 17,000 crore loan fraudDays after summoning Anil Ambani, the Enforcement Directorate (ED) has now issued summons to several of his top executives for questioning under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mango-millionaire-radhika-gupta-niranjan-avasthi-sips-investing-financial-freedom-2765882-2025-08-04",
      "headline": "'Mango Millionaire' authors Radhika Gupta, Niranjan Avasthi on SIPs, investing and moreIn this exclusive Q&A interaction, Gupta and Avasthi reflect on the core ideas in their book, the pitfalls of social media-driven investing, why SIPs still matter, and what India needs to change in the way it talks about money and long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-dubai-property-with-credit-cards-why-many-indians-are-now-in-trouble-2765838-2025-08-04",
      "headline": "Buying Dubai property with credit cards? Why many Indians are now in troubleSeveral homebuyers either clicked on payment links shared by Dubai-based builders or swiped their credit cards during their visits to the UAE. It felt hassle-free, no paperwork, no visits to the bank. But there's a catch. Read here to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijaykumar-earned-rs-95-crore-who-are-india-top-highest-paid-it-bosses-tcs-infosys-wipro-2765847-2025-08-04",
      "headline": "HCLTech CEO earned Rs 95 crore: Here are India's highest-paid IT bossesHCLTech also reported a 17.6% increase in the median pay for its employees during the financial year. HCLTech currently has 1,67,316 permanent employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dehlivery-shares-rally-up-to-5-percent-after-q1-results-should-you-buy-2765822-2025-08-04",
      "headline": "Dehlivery shares rally up to 5% after Q1 results. Should you buy?Delhivery shares jumped 5% in early trade after the company posted its Q1FY26 results. Should you buy into the rally or wait and watch how the integration and margins play out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sri-lotus-developers-ipo-allotment-today-august-4-check-status-gmp-listing-date-expected-profit-2765804-2025-08-04",
      "headline": "Sri Lotus Developers IPO allotment today: Check your status, GMP, listing dateThe IPO of Sri Lotus Developers received a strong response during its three-day bidding window, with total subscriptions reaching 74.10 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Explained: How Trump's tariffs are hurting the US economyWith inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-160-points-higher-nifty-above-24600-bel-up-1-2765783-2025-08-04",
      "headline": "Sensex opens 160 points higher, Nifty above 24,600; BEL up 1%The S&P BSE Sensex added 229.73 points to 80,829.64, while the NSE Nifty50 rose 81.55 points to 24,646.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-price-band-rs-139-147-details-august-7-opening-date-rs-3600-crore-2765781-2025-08-04",
      "headline": "JSW Cement IPO price band announced. Check other detailsJSW Cement's IPO includes a fresh issue of 10.88 crore shares worth Rs 1,600 crore and an offer for sale of 13.61 crore shares worth Rs 2,000 crore. The company had initially aimed to raise Rs 4,000 crore, but later reduced the issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-august-meeting-rate-cut-decision-us-tariff-worry-inflation-july-governor-sanjay-malhotra-2765771-2025-08-04",
      "headline": "RBI MPC begins today: Will US tariffs trigger a rate cut?The RBI's August MPC is meeting after cutting interest rates by 100 basis points across its last three policy meetings. The policy stance has remained 'neutral'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-allotment-today-out-check-your-status-gmp-listing-date-august-6-gains-expected-profit-2765763-2025-08-04",
      "headline": "NSDL IPO allotment today: Check your status, GMP and listing dateInvestors who applied for NSDL shares can check their allotment status either on the BSE website or the website of the registrar, MUFG Intime India Private Limited (Link Intime)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gaga-bruno-mars-top-2025-mtv-vma-nominations-list-glbs-2766883-2025-08-06",
      "headline": "Lady Gaga, Bruno Mars top 2025 MTV VMA nominations listLady Gaga leads 2025 MTV VMA nominations with 12, followed by Bruno Mars. Voting open ahead of the September 7 broadcast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-on-aashiqui-3-direction-and-saiyaara-film-making-experience-2766707-2025-08-05",
      "headline": "Mohit Suri on making Saiyaara over Aashiqui 3: No pressure of sequel, opening dayDirector Mohit Suri reveals why he did not direct Aashiqui 3 and shares insights about making Saiyaara. He highlights the freedom from sequel pressure and praises Anurag Basu for taking over the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-ott-release-no-deal-confirmed-makers-react-to-rumours-2766737-2025-08-05",
      "headline": "Mahavatar Narsimha OTT release: Makers urge fans to stay away from rumoursMahavatar Narsimha is currently playing exclusively in theatres worldwide with no OTT deal finalised. The makers urge audiences to trust only official updates amid OTT release rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aanand-l-rai-dhanush-take-legal-action-over-raanjhanaa-ai-altered-re-release-2766767-2025-08-05",
      "headline": "Aanand L Rai, Dhanush to take legal action over Raanjhanaa's AI-altered endingAanand L Rai recently shared how the team is thinking to adopting the legal route for the AI-altered version of their film 'Raanjhanaa'. Their current concern is the unauthorised modification of the film that has created a buzz around. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-explains-why-he-rejected-3-idiots-dil-chahta-hai-2766745-2025-08-05",
      "headline": "Hrithik Roshan explains why he rejected 3 Idiots, Dil Chahta Hai. WatchBollywood actor Hrithik Roshan reflects on the missed chances and praises Aamir Khan's performance in various films like '3 Idiots' and 'Dil Chahta Hai'. He is now looking forward to an exciting new chapter with his upcoming projects. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-speaks-legacy-and-why-he-pushes-his-sons-to-write-their-own-future-script-2766743-2025-08-05",
      "headline": "Jr NTR speaks legacy, and why he pushes his sons to write their own future scriptWhile Jr NTR awaits the release of 'War 2', he speaks in an interview about his family's legacy, the future of his children, and what he wants to be remembered for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-actor-santhosh-balaraj-dies-34-battling-jaundice-2766686-2025-08-05",
      "headline": "Kannada actor Santhosh Balaraj dies at 34 after battling jaundiceKannada actor Santhosh Balaraj died on Tuesday in Bengaluru. He was undergoing treatment for jaundice for several weeks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-teaming-up-with-charlie-puth-again-j-hope-viral-video-2766715-2025-08-05",
      "headline": "Is BTS' Jungkook teaming up with Charlie Puth again? J-Hope suggests soBTS members are currently in the United States working on a new album alongside talented producers and composers, with the release scheduled for 2026. A new video shared by J-Hope hints at a potential collaboration between Jungkook and Charlie Puth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-to-jr-ntr-he-sends-billboard-war-2-2766633-2025-08-05",
      "headline": "You've taken it too far, says Hrithik Roshan as Jr NTR sends War 2 actor a billboardThe playful challenge between actors Hrithik Roshan and Jr NTR escalated on August 5, when Roshan revealed that Jr NTR had sent a billboard to his home. Responding to the gesture, Roshan joked that the challenge had gone too far and hinted at a comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-backs-raanjhanaa-director-ai-row-supprts-creator-aanand-l-rai-dhanush-2766690-2025-08-05",
      "headline": "Farhan Akhtar backs Raanjhanaa director amid AI row: My loyalty lies with creatorFarhan Akhtar shared his views on the AI-altered version of Aanand L Rai and Dhanush's film, 'Raanjhanaa'. The actor extended his support to the creativity of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/5-teen-dramas-explore-real-struggles-beyond-high-school-2766640-2025-08-05",
      "headline": "5 powerful teen dramas that explore real struggles beyond high schoolTeen dramas aren't just about crushes and cliches any more. These shows dive deep into the real, raw challenges of growing up today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-interview-national-award-best-supporting-actress-aadujeevitham-jury-selection-process-2766629-2025-08-05",
      "headline": "Actor Urvashi questions her National Award win: Yet to decide if I should acceptVeteran actor Urvashi expressed disappointment over being awarded in the supporting category despite playing lead in 'Ullozhukku' at the 71st National Film Awards. She awaits the jury's explanation before deciding on accepting the National Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/zee-tv-ends-kumkum-bhagya-launches-ganga-mai-ki-betiyaan-2766600-2025-08-05",
      "headline": "Is Kumkum Bhagya going off-air after 11 years?Zee TV's 'Kumkum Bhagya' is reportedly going off-air after 11 years. The show might make way new shows like 'Ganga Mai Ki Betiyaan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-loving-post-for-kajol-on-51st-birthday-comes-with-an-eye-roll-warning-2766482-2025-08-05",
      "headline": "Ajay Devgn's loving post for Kajol on 51st birthday comes with an eye-roll warningOn the occasion of Kajol's birthday, actor Ajay Devgn shared a cheeky post on Instagram. He called Kajol 'his favourite' while extending birthday wishes. Kajol turned 51 on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/janaki-v-vs-state-of-kerala-on-ott-release-when-and-where-to-watch-suresh-gopi-film-2766607-2025-08-05",
      "headline": "Janaki V vs State of Kerala on OTT: When and where to watch Suresh Gopi's film'Janaki V vs State of Kerala', featuring Union Minister Suresh Gopi and Anupama Parameswaran, is now set to premiere on OTT from August 15. The legal drama, inspired by true events and highlighting a survivor's fight for justice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-post-yuzvendra-chahal-divorce-remarks-podcast-2766578-2025-08-05",
      "headline": "Dhanashree Verma shares 1st post after Yuzvendra Chahal's divorce remarksChoreographer Dhanashree Verma shared first post after her ex-husband Yuzvendra Chahal's latest remarks on their divorce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-medha-rana-visit-golden-temple-wrap-border-2-shoot-diljit-dosanjh-ahan-shetty-2766601-2025-08-05",
      "headline": "Varun Dhawan, Medha Rana visit Golden Temple as they wrap Border 2 shoot. See picActors Varun Dhawan and his co-star Medha Rana visited the Golden Temple after they wrapped the shoot of their upcoming film 'Border 2'. The film also stars Ahan Shetty and Diljit Dosanjh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-ravie-dubey-and-the-emergence-of-new-hero-in-bollywood-2766594-2025-08-05",
      "headline": "Ahaan Panday, Ravie Dubey and the emergence of new hero in BollywoodFor the longest time, Bollywood's leading men arrived with drumrolls. They were groomed, positioned, and presented to an audience trained to applaud before the performance even began. But something seems to be shifting. In actors like Ahaan Panday and Ravie Dubey, we hope to see a new beginning that probably doesn't depend on legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/unspeakable-sins-review-netflix-mexican-erotic-drama-is-stylish-full-of-scandal-and-seductive-2766270-2025-08-05",
      "headline": "Unspeakable Sins review: A stylish, seductive and surprisingly sharp erotic dramaRelease Date:Wed Jul 30, 2025Unspeakable Sins Review: Netflix's 'Unspeakable Sins' is a gripping Mexican thriller that delves into the dark world of power, betrayal, and emotional manipulation within elite society. With strong performances and a slow-burning narrative, it offers a compelling watch despite its lengthy episodes and occasional melodrama."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-has-not-been-a-good-trading-partner-will-raise-tariffs-substantially-in-24-hours-trump-2766697-2025-08-05",
      "headline": "Trump says India not a good trading partner, vows tariff hike in 24 hoursTrump has ramped up his attack after calling both New Delhi and Moscow \"dead economies\" last week. After slapping a 25% tariff on Indian goods, he has now threatened to impose additional duties, citing New Delhi's \"buying massive amounts of Russian oil.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-burn-ties-with-india-nikki-haley-on-trumps-tariff-threat-over-russian-oil-2766832-2025-08-05",
      "headline": "Don't burn ties with India: Nikki Haley on Trump's tariff threat over Russian oilThe Republican leader also called out the Trump administration's duplicity, highlighting a soft-handling of trade with China in which the US paused the tariffs for 90 days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-cloudburst-uttarkashi-flash-floods-missing-dead-damage-rescue-2766598-2025-08-05",
      "headline": "Live: Village submerged, rescue ops intensified after cloudburst in UttarkashiA powerful cloudburst triggered a devastating landslide in Dharali village of Uttarakhand's Uttarkashi on Tuesday afternoon, killing at least 4. Over 50 people remain missing as the disaster unleashed a surge of water and debris across the area, prompting a large-scale emergency response involving multiple agencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brazils-lula-says-will-not-call-trump-aims-to-strengthen-ties-with-narendra-modi-xi-jinping-glbs-2766882-2025-08-06",
      "headline": "Brazil's Lula says 'will not call Trump,' aims to strengthen ties with Modi, XiThe US imposed an additional 40% tariff on Brazil, bringing the total tariff amount to 50% on Brazilian imports. This has caused a serious strain between the two countries. Lula said Brazil will use all available tools, including the WTO, to defend its trade interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-aims-for-moon-landing-by-2035-with-china-support-suparco-nuclear-programs-space-astronaut-isro-uraan-2766768-2025-08-05",
      "headline": "To the Moon, on China's back: Pakistan eyes lunar landing by 2035Pakistan aims to land on the Moon by 2035, but the mission hinges entirely on China's support. Its space agency has never carried out an independent launch and relies heavily on Chinese technology and expertise. Before that, Pakistan also hopes to send its first astronaut to China's space station by 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-responds-to-indias-claim-on-us-import-of-russian-uranium-fertiliser-i-dont-know-anything-glbs-2766895-2025-08-06",
      "headline": "Don't know anything: Trump on India's claim of US-Russia uranium, fertiliser tradeIndia said that the United States continues to import key materials from Russia, including uranium hexafluoride for its nuclear industry, palladium for electric vehicles, as well as fertilisers and chemicals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/embassy-of-the-republic-of-khalistan-surrey-gurdwara-hardeep-singh-nijjar-support-india-canada-diplomatic-thaw-2766575-2025-08-05",
      "headline": "Khalistan 'embassy' at Nijjar's old stomping ground threatens India-Canada resetAn 'Embassy of the Republic of Khalistan' has been established in Surrey, Canada. Located on the premises of Guru Nanak Sikh Gurdwara, it openly supports Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-witkoff-plan-expanded-us-role-in-gaza-aid-amid-israeli-war-plans-glbs-2766881-2025-08-06",
      "headline": "Trump plans to 'take over' Gaza humanitarian aid amid starvation crisis: ReportTrump and US envoy Witkoff discussed plans for the US to take over Gaza aid efforts, amid Israeli war escalation and concerns over worsening humanitarian conditions, Axios reported citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariff-trade-maga-hitting-russia-ukraine-war-moscow-kyiv-crude-oil-putin-heres-how-2766628-2025-08-05",
      "headline": "Trump is hitting India to show MAGA he's hitting RussiaDonald Trump vowed to keep America out of wars, but the Ukraine conflict has left that promise in tatters. Now, by slapping tariffs on India, he is trying to convince MAGA that he is acting against Russia, even though the move does little beyond raising costs at home and straining ties with New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-fall-of-the-awami-league-government-the-single-cause-2766790-2025-08-05",
      "headline": "The fall of the Awami League government: The single causeThe systematic silencing and marginalisation of dedicated workers of the Sheikh Hasina-led Awami League helped bring down a government once propped up by them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-doval-arrives-in-moscow-amid-trumps-fresh-tariff-threat-for-russia-oil-buys-2766884-2025-08-06",
      "headline": "Ajit Doval in Moscow amid Trump's fresh tariff threat for Russia oil buysAccording to a source, the visit is part of a planned schedule and will focus on defence cooperation between India and Russia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-navnirmal-sena-workers-assault-nagpur-bank-staff-over-action-against-labourer-2766785-2025-08-05",
      "headline": "Video: MNS workers storm Nagpur bank, assault staff for action against labourerA video of the MNS workers slapping a staff member, raising slogans, defacing the bank premises and creating a ruckus has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-50-years-film-that-died-at-birth-to-live-forever-gabbar-singh-jai-veeru-amitabh-bachchan-dharmendra-283-05-08-2025",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/electoral-roll-scandal-election-commission-of-india-cracks-down-on-west-bengal-officials-over-fake-voters-2766851-2025-08-05",
      "headline": "Electoral roll scandal: Poll body cracks down on Bengal officials over fake votersThe Election Commission of India ordered the immediate suspension of four Bengal officials after they were found to have allegedly shared login credentials of the electoral roll database with 'unauthorised persons' and wrongfully added names to the electoral rolls in two assembly constituencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-china-pakistan-religious-diplomacy-should-ring-alarm-for-india-2766754-2025-08-05",
      "headline": "Why China-Pakistan religious diplomacy should ring alarm for IndiaA Pakistani religious delegation's visit to China's Xinjiang province adds a new dimension to the anti-India axis; should New Delhi respond with the Uyghurs rights card?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/some-hate-chai-seeds-so-what-should-you-eat-instead-2766592-2025-08-05",
      "headline": "Why some people hate chia seeds and what to eat insteadFor some people, the gooey gelatinous texture of soaked chia seeds is such a let-down that they dare add it to their smoothies or acai bowl. For them, there are superb alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-to-procure-more-brahmos-missiles-for-navy-and-air-force-after-successful-operation-sindoor-2766609-2025-08-05",
      "headline": "Post Op Sindoor success, India eyes more Indo-Russian BrahMos missiles: SourcesThe decision to procure the supersonic cruise missiles came on the back of the huge success of Operation Sindoor, during which the weapon was used extensively and caused heavy damage to enemy targets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-one-year-sheikh-hasina-regime-august-5-student-protests-army-role-urban-guerilla-tactics-2766569-2025-08-05",
      "headline": "Sheikh Hasina fall wasn't just due to students agitation. The inside storyAugust 5 marks one year when Bangladesh PM Sheikh Hasina was forced to flee amid a movement against her authoritarian regime. But was it just a students' agitation that brought her powerful government down, or was it urban guerilla tactics of attacking security personnel or the army's hands-off approach? Decoding what became the ultimate nemesis for Hasina."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/epstein-scandal-deepens-after-letters-from-celebrities-and-power-brokers-surface-glbs-2766894-2025-08-06",
      "headline": "Epstein scandal deepens after letters from celebrities and power brokers surfaceThese letters were compiled as a birthday tribute for Epstein's 63rd birthday in 2016. Their release has increased speculation around the connections between Epstein and prominent figures, including Donald Trump. Epstein was known for maintaining a social circle of the world's elite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-mahjong-is-beating-screen-time-2766018-2025-08-05",
      "headline": "Why Mahjong is beating screen timeA centuries-old Chinese tile game is turning into the new favourite amongst all age groups. People are putting down their screens and coming together for a fun Mahjong session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-man-crawls-out-of-debris-after-landslide-claims-4-lives-in-uttarakhand-2766660-2025-08-05",
      "headline": "Video: Man crawls out of sludge as people scream amid Uttarakhand flash floodA man was seen crawling out of the debris after a massive cloudburst hit Uttarkashi, killing 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/probably-not-but-id-like-to-trump-on-2028-presidential-run-glbs-2766893-2025-08-06",
      "headline": "Probably not, but I'd like to: Trump on 2028 presidential runDonald Trump hinted at interest in a 2028 run but said he \"probably\" won't pursue it, citing constitutional limits, despite claiming record support and strong polling after his 2024 win.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/muhammad-yunus-next-bangladesh-general-election-for-february-2026-before-ramzan-2766852-2025-08-05",
      "headline": "Next Bangladesh general election set for Feb 2026 before Ramzan: Muhammad YunusThe Bangladesh Chief Advisor said that he would send a letter to the chief election commissioner requesting that the Election Commission hold the national election in February 2026, before Ramzan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gaga-bruno-mars-top-2025-mtv-vma-nominations-list-glbs-2766883-2025-08-06",
      "headline": "Lady Gaga, Bruno Mars top 2025 MTV VMA nominations listLady Gaga leads 2025 MTV VMA nominations with 12, followed by Bruno Mars. Voting open ahead of the September 7 broadcast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-on-aashiqui-3-direction-and-saiyaara-film-making-experience-2766707-2025-08-05",
      "headline": "Mohit Suri on making Saiyaara over Aashiqui 3: No pressure of sequel, opening dayDirector Mohit Suri reveals why he did not direct Aashiqui 3 and shares insights about making Saiyaara. He highlights the freedom from sequel pressure and praises Anurag Basu for taking over the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-ott-release-no-deal-confirmed-makers-react-to-rumours-2766737-2025-08-05",
      "headline": "Mahavatar Narsimha OTT release: Makers urge fans to stay away from rumoursMahavatar Narsimha is currently playing exclusively in theatres worldwide with no OTT deal finalised. The makers urge audiences to trust only official updates amid OTT release rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aanand-l-rai-dhanush-take-legal-action-over-raanjhanaa-ai-altered-re-release-2766767-2025-08-05",
      "headline": "Aanand L Rai, Dhanush to take legal action over Raanjhanaa's AI-altered endingAanand L Rai recently shared how the team is thinking to adopting the legal route for the AI-altered version of their film 'Raanjhanaa'. Their current concern is the unauthorised modification of the film that has created a buzz around. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-student-college-fees-bagaklot-2766876-2025-08-06",
      "headline": "Pant makes heartfelt gesture, pays college fees for underprivileged studentRishabh Pant extended a generous helping hand to support the education of a student from a financially struggling family in Karnataka's Bagalkot district. After word reached about the student's need, Pant paid the fees directly to the college. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mohammed-siraj-role-model-managing-workload-sourav-ganguly-2766873-2025-08-05",
      "headline": "Siraj a role model for pacers on managing workload: Sourav GangulyENG vs IND: Former Indian captain Sourav Ganguly, in an interview with Aaj Tak, heaped praise on Mohammed Siraj, who finished the Test series against England as the leading wicket-taker with 23 scalps to his name from five games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-cab-president-election-2766857-2025-08-05",
      "headline": "Sourav Ganguly to enter race for Bengal cricket's presidential electionFormer Indian captain Sourav Ganguly confirmed to India Today that he will be submitting his nomination ahead of the Annual General Meeting (AGM) to contest for the post of President of the Cricket Association of Bengal (CAB).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-gautam-gambhir-2766815-2025-08-05",
      "headline": "Ganguly lauds Gautam Gambhir as Gill, Pant step up in absence of Big 2Former India captain Sourav Ganguly lauded the batting depth of the Indian team after the side drew 2-2 against England in the 5-match Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/boys-have-been-brilliant-throughout-last-two-months-gautam-gambhir-on-england-tour-2766791-2025-08-05",
      "headline": "Boys were brilliant throughout last two months: Gambhir on England tourENG vs IND: Head coach of the Indian cricket team, Gautam Gambhir, hailed the entire team's performances throughout their recent tour of England. The Indian team went on to level the series 2-2 with a miraculous win at the Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-ipl-kkr-indian-team-sacking-2766775-2025-08-05",
      "headline": "KKR is where I belong: Abhishek Nayar on his exit from Indian teamFormer India assistant coach Abhishek Nayar was sacked from his role in the aftermath of Border-Gavaskar Trophy. Nayar broke his silence on the matter after joining WPL side UP Warriorz as their head coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-squad-asia-cup-netherlands-t20i-series-2766755-2025-08-05",
      "headline": "Bangladesh name preliminary squad for Asia Cup 2025, Netherlands T20I seriesBangladesh have named a 25‑member preliminary squad for the upcoming Asia Cup and the three-match T20I series against the Netherlands. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-submit-bid-benjamin-sesko-2766727-2025-08-05",
      "headline": "Manchester United submit first bid for RB Leipzig's Benjamin Sesko: ReportThe race intensifies for RB Leipzig's Benjamin Sesko as Manchester United have reportedly submitted their first bid for the Slovenian striker, who is also being pursued by Newcastle United.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yograj-singh-on-mohammed-siraj-kapil-dev-oval-test-2766703-2025-08-05",
      "headline": "Mohammed Siraj's heroic spell at Oval reminded me of Kapil Dev: Yograj SinghFormer India cricketer Yograj Singh revealed that Mohammed Siraj's phenomenal spell in the fifth Test against England at the Oval, reminded him of Kapil Dev. Siraj was adjudged Player of the Match for picking nine wickets in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-star-players-oval-test-win-2766699-2025-08-05",
      "headline": "BCCI unlikely to allow India stars to pick and choose games going forwardThe BCCI is set to introduce a rule that will prevent star players from selectively choosing matches in which to rest. On Monday, India drew their five-match series against England after winning the Oval Test by six runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-partey-arsenal-midfielder-granted-bail-villarreal-move-2766693-2025-08-05",
      "headline": "Ex-Arsenal midfielder Thomas Partey granted bail on 5 rape charges: ReportFormer Arsenal midfielder Thomas Partey has been granted bail after appearing in court in London. He is under investigation for five counts of rape and one count of sexual assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-squad-asia-cup-netherlands-t20i-series-2766755-2025-08-05",
      "headline": "Bangladesh name preliminary squad for Asia Cup 2025, Netherlands T20I seriesBangladesh have named a 25‑member preliminary squad for the upcoming Asia Cup and the three-match T20I series against the Netherlands. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-submit-bid-benjamin-sesko-2766727-2025-08-05",
      "headline": "Manchester United submit first bid for RB Leipzig's Benjamin Sesko: ReportThe race intensifies for RB Leipzig's Benjamin Sesko as Manchester United have reportedly submitted their first bid for the Slovenian striker, who is also being pursued by Newcastle United.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yograj-singh-on-mohammed-siraj-kapil-dev-oval-test-2766703-2025-08-05",
      "headline": "Mohammed Siraj's heroic spell at Oval reminded me of Kapil Dev: Yograj SinghFormer India cricketer Yograj Singh revealed that Mohammed Siraj's phenomenal spell in the fifth Test against England at the Oval, reminded him of Kapil Dev. Siraj was adjudged Player of the Match for picking nine wickets in the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-star-players-oval-test-win-2766699-2025-08-05",
      "headline": "BCCI unlikely to allow India stars to pick and choose games going forwardThe BCCI is set to introduce a rule that will prevent star players from selectively choosing matches in which to rest. On Monday, India drew their five-match series against England after winning the Oval Test by six runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-partey-arsenal-midfielder-granted-bail-villarreal-move-2766693-2025-08-05",
      "headline": "Ex-Arsenal midfielder Thomas Partey granted bail on 5 rape charges: ReportFormer Arsenal midfielder Thomas Partey has been granted bail after appearing in court in London. He is under investigation for five counts of rape and one count of sexual assault."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}