{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-today-sensex-nifty-decline-us-donald-trump-reciprocal-tariff-impact-2702063-2025-04-01",
      "headline": "Sensex dips 400 points in early trade. Why is stock market falling today?The Sensex and Nifty fell sharply in early trade as investors on Dalal Street are worried about the impact of US reciprocal tariffs, which will take effect on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-400-points-nifty-slips-below-23500-as-tariff-jitters-hit-dalal-street-2702058-2025-04-01",
      "headline": "Sensex falls 400 points, Nifty slips below 23,500 as tariff jitters hit Dalal StreetThe S&P BSE Sensex was down 253.38 points to 77,161.54, while the NSE Nifty50 fell 46.80 points to 23,472.55 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-1-key-levels-to-watch-dalal-street-trump-tariff-2702027-2025-04-01",
      "headline": "Stock market opening on April 1: What to expect from Sensex, Nifty todayStock market today: Market experts believe that the early days of April 2025 will be important for investors due to several key events lined up this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-1-sensex-nifty-today-stock-market-news-ola-electric-indigo-hcltech-adani-energy-2702020-2025-04-01",
      "headline": "Stocks to watch on April 1: Shares in news; IndiGo, Ola, HCLTech, Vodafone IdeaAs markets resume trading, several stocks such as Adani Energy Solutions, IndiGo, Ola Electric, Vodafone Idea, HCLTech among others, are expected to be in focus due to company-specific updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-announces-small-savings-schemes-interest-rates-check-latest-ppf-ssy-and-others-2701779-2025-04-01",
      "headline": "Small savings interest rates: Check latest PPF, SSY and othersThe government examines and fixes interest rates on such schemes quarterly, depending on the economic scenario and market situation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-nasdaq-fall-to-lowest-levels-in-over-six-months-amid-tariff-worries-glbs-2701933-2025-03-31",
      "headline": "S&P 500, Nasdaq fall to lowest levels in over six months amid tariff worriesUS stocks tumbled to their lowest levels in over six months as worries over new tariffs weighed on investor sentiment. With fears of a global slowdown and rising inflation, the S&P 500 and Nasdaq saw sharp declines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-drops-in-what-causing-indians-to-spend-less-2701752-2025-03-31",
      "headline": "Credit card spending drops. What's causing Indians to spend less?Big credit card issuers like HDFC Bank, SBI Cards, and ICICI Bank witnessed fewer new customers in February. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-could-lead-to-another-round-of-stock-market-correction-key-things-to-know-2701667-2025-03-31",
      "headline": "US reciprocal tariffs: Will Dalal Street face more turbulence from April 2?US reciprocal tariffs have put Dalal Street on edge as investors brace for potential market swings. With FPIs cautious and auto stocks under pressure, domestic markets could face more turbulence in the near term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-stock-market-impact-9-stocks-to-watch-buy-sell-hold-investor-advice-expert-view-2701644-2025-03-31",
      "headline": "Trump tariffs could hit these 9 stocks. Should you sell?The IT sector is under pressure due to concerns over Trump's trade policies and potential increases in H-1B visa costs. Indian IT firms earn over 50% of their revenue from the US, making them vulnerable to higher hiring costs and reduced outsourcing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-primark-boss-paul-marchant-resigns-after-error-of-judgement-2701626-2025-03-31",
      "headline": "UK's Primark boss resigns after 'error of judgement' in social settingThe group said on Monday that Paul Marchant had cooperated with an investigation led by external lawyers, acknowledged his \"error of judgement\" and accepted that his actions fell below the standards expected by AB Foods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/claiming-hra-but-not-paying-tds-beware-of-tax-notices-and-penalties-2701582-2025-03-31",
      "headline": "Claiming HRA but not paying TDS? Beware of tax notices and penaltiesThe landlord's PAN must be mentioned in the TDS challan. However, if the PAN is missing or inactive, the TDS is levied at 20% under Section 206AA. On the other hand, for Non-Resident Indian (NRI) landlords, the rate of TDS is 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-fy26-slow-start-4-listings-sme-platform-desco-infratech-shri-ahimsa-naturals-atc-energies-2701574-2025-03-31",
      "headline": "IPO market off to a slow start in FY26, but these 4 firms to debut soonThe IPO pipeline for FY26 could be worth nearly Rs 2 lakh crore. Some major companies, including Zepto, Reliance Jio, and LG Electronics, are reportedly in the process of finalising their listing plans."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiran-rao-reena-dutta-click-selfie-at-aamir-khan-family-gathering-on-eid-see-photos-2702060-2025-04-01",
      "headline": "Pics: Kiran Rao, Reena Dutta click selfie at Aamir Khan's family gathering on EidKiran Rao celebrated Eid with Aamir Khan's family on Monday. She shared heartwarming pictures from the festivities on social media. While Aamir was missing from her photos, he earlier greeted paparazzi with his sons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-and-vadivelu-maareesan-eyes-july-release-new-poster-out-2702053-2025-04-01",
      "headline": "Fahadh Faasil and Vadivelu's Maareesan eyes July release. New poster outActors Fahadh Faasil and Vadivelu's upcoming film, 'Maareesan', will hit theatres in a few months. The makers released a new poster announcing the month of release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-collection-day-2-salman-khan-minimal-eid-boost-earns-rs-55-crore-2702040-2025-04-01",
      "headline": "Sikandar box office Day 2: Salman's film sees minimal Eid boost, earns Rs 55 croreSikandar box office collection: Salman Khan's film collected Rs 29 crore on Eid, bringing its India total to Rs 55 crore. Despite the festive boost, it remains the actor's weakest Eid opener, facing strong competition from Mohanlal's L2: Empuraan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-collection-day-5-mohanlal-prithviraj-kerala-fastest-50-crore-grosser-2702035-2025-04-01",
      "headline": "Empuraan box office Day 5: Mohanlal film is Kerala's fastest Rs 50-crore grosserMohanlal and director Prithviraj Sukumaran's 'L2: Empuraan' grossed Rs 50 crore in Kerala in just five days. The film minted Rs 200 crore worldwide and is still going strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-only-follows-dharmendra-after-his-father-wants-to-remake-his-3-films-2701968-2025-03-31",
      "headline": "Salman Khan only follows Dharmendra after his father, wants to remake his 3 filmsBollywood superstar Salman Khan recently revealed his admiration for veteran actor Dharmendra, stating he follows him more than Dharmendra's own sons. Salman also expressed interest in remaking three of Dharmendra's iconic films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-performs-at-wankhede-ahead-of-mi-vs-kkr-match-father-chunky-reacts-2701947-2025-03-31",
      "headline": "Ananya Panday performs at Wankhede ahead of MI vs KKR match, father Chunky reactsActor Ananya Panday lit up the Wankhede Stadium with her dance performance before the IPL match between KKR and MI. Her energetic moves thrilled Bollywood fans and added glamour to the cricket event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-vibes-with-indian-auto-driver-to-new-hit-azizam-2701944-2025-03-31",
      "headline": "Nothing, just Ed Sheeran vibing with Indian auto driver to new song AzizamSinger Ed Sheeran is set to release his first single of 2025, Azizam, soon. Ahead of the release, he shared a video from his visit to India, where he is seen vibing to the track's lyrics with an autorickshaw driver during a ride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-prithviraj-sukumaran-l2-empuraan-beats-chhaava-to-become-fastest-rs-200-crore-grosser-in-2025-2701919-2025-03-31",
      "headline": "L2 Empuraan races past Chhaava to become 2025's fastest Rs 200 crore grosserMohanlal and Prithviraj Sukumaran's L2: Empuraan raced past the box office records of Vicky Kaushal's Chhaava to become the fastest film to enter the Rs 200 crore club. The film hit theatres on March 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sardar-2-teaser-karthi-takes-on-sj-suryah-in-ps-mithran-sequel-2701890-2025-03-31",
      "headline": "Sardar 2 teaser: Karthi takes on 'Black Dagger' SJ Suryah in PS Mithran's sequelThe teaser of Sardar 2, starring Karthi, was unveiled on Eid 2025. The clip introduces SJ Suryah as the main antagonist, who takes on the Indian spy Sardar, played by Karthi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exploring-final-destination-the-only-franchise-where-death-holds-a-grudge-2701182-2025-03-31",
      "headline": "Exploring Final Destination: The only franchise where Death holds a grudgeThe Final Destination series stands out in the horror genre by making Death the unstoppable antagonist. The twist in Final Destination 5 redefined the timeline, proving the franchise's unique narrative depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-leads-eid-ul-fitr-2025-wishes-from-bollywood-priyanka-chopra-varun-dhawan-join-2701872-2025-03-31",
      "headline": "Shah Rukh Khan leads Eid wishes from Bollywood, Priyanka Chopra, Varun Dhawan joinOn the auspicious occasion of Eid-ul-Fitr on March 31, celebrities including Shah Rukh Khan, Salman Khan, Aamir Khan, Varun Dhawan, Jr NTR, Mahesh Babu, and Priyanka Chopra, extended wishes to their fans via their respective social media handles. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-crazy-fan-encounter-entered-house-had-scissors-2701871-2025-03-31",
      "headline": "Malaika Arora recounts 'crazy' fan entering her house: She had scissorsMalaika Arora recounts a frightening fan encounter, when a female fan entered her house and sat in her living room, without permission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-6-review-ted-black-hero-entry-but-he-is-no-harvey-spectoryet-2701839-2025-03-31",
      "headline": "Suits LA Episode 6: Ted Black's hero entry, but he's no Harvey Spector...yet! In the latest episode of 'Suits LA', we see Ted Black finally winning it all, including our hearts - something that was required for the show to mark its presence among the ardent fans of 'Suits'. However, it still doesn't show any sign of Harvey Spector on the West Coast. Spoilers ahead for those who haven't watched a single episode from the season so far!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-cancels-mexico-show-due-to-severe-food-poisoning-apologises-to-fans-2701818-2025-03-31",
      "headline": "Zayn Malik cancels Mexico show due to severe food poisoning: Sorry to let you downZayn Malik was forced to cancel his Mexico City concert after suffering from severe food poisoning. The singer expressed his heartbreak and gratitude towards fans for their understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-eid-2025-waves-fans-from-galaxy-through-bulletproof-glass-check-viral-pics-2701813-2025-03-31",
      "headline": "Salman Khan makes mandatory Eid appearance, greets fans through bulletproof glassActor Salman Khan greeted his fans on Eid. The superstar waved to the fans while standing behind the bulletproof glass that he got installed at his Galaxy apartment earlier this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-controversy-over-riot-depiction-timeline-2701788-2025-03-31",
      "headline": "Explained: Mohanlal's Empuraan controversy over riot depictionMohanlal and director Prithviraj Sukumaran's 'L2: Empuraan' is in the midst of a political storm over sequences that appear to be references to the 2002 Gujarat riots. From backlash from right-wing factions to the film being re-edited, here's all that happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-funny-reaction-not-bringing-cook-dilip-at-lakme-fashion-week-watch-2701760-2025-03-31",
      "headline": "Watch: Farah Khan's funny reaction as paps ask about not bringing cook Dilip at LFWAt Lakme Fashion Week, Farah Khan had a hilarious reaction when asked about her cook, Dilip. The viral moment left fans joking that Dilip is now a bigger star than Farah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-press-conference-for-kim-sae-ron-everything-that-he-said-about-death-controversy-case-lawsuit-to-denying-allegations-2701749-2025-03-31",
      "headline": "Lawsuit to denying allegations, everything Kim Soo-hyun said on Kim Sae-ron caseFor the first time since Kim Sae-ron's death snowballed into a big controversy, Korean actor Kim Soo-hyun spoke about what all happened, asking fans to give him a fair chance to present his side of the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tanmay-bhat-trolls-ranveer-allahbadia-rebirth-post-ashish-chanchlani-comments-2701751-2025-03-31",
      "headline": "Tanmay Bhat trolls Ranveer Allahbadia on rebirth post, Ashish Chanchlani commentsRanveer Allahbadia's recent posts announcing his comeback had comments from several people, including Ashish Chanchlani and Apoorva Mukhija, who were a part of the same India's Got Latent episode as him. Tanmay Bhat also dropped cheeky comments on one of the posts."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariffs-deadline-april-2-reciprocal-trade-taxes-united-states-china-canada-2702052-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's 'very kind' message ahead of tariff deadline: What's in store for India?US President Donald Trump, who vowed to impose reciprocal tariffs on all US trade partners, said that he could make the announcement as early as Tuesday night or Wednesday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-does-india-look-from-space-sunita-williams-answers-2701996-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How does India look from space? Sunita Williams answersWilliams expressed excitement about reconnecting with India and her enthusiasm for India's growing role in space exploration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-no-choice-get-nuclear-weapons-us-allies-attack-trump-bombing-ayatollah-khamenei-2702043-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Khamenei adviser's ominous 'no choice but to get nukes' warning amid US standoffIran would have \"no choice\" but to acquire a nuclear weapon if attacked by the United States or its allies, an adviser to the country's supreme leader warned following Donald Trump's bombing threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-japan-south-korea-to-jointly-counter-us-tariffs-chinese-media-reports-glbs-2701978-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China, Japan, South Korea unite against US tariffs, eye free trade pact: ReportChina, Japan, and South Korea have decided to team up against US tariffs. After their first economic talks in five years, the three countries aim to boost trade, strengthen supply chains, and explore a free trade agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-paid-ashley-st-clair-25-million-child-support-baby-boy-paternity-dispute-2702005-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't know if child's mine or not…: Elon Musk claims he paid influencer millionsElon Musk denied allegations from influencer Ashley St Clair that he reduced child support payments for their alleged son. In response to his claim, St Clair accused the tech billionaire of refusing a paternity test.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-tamil-telugu-uttar-pradesh-schools-language-row-tamil-nadu-2702065-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath says Tamil, Telugu being taught in UP, Congress seeks dataThis is the second time in a week that the Uttar Pradesh Chief Minister has taken potshots at MK Stalin over the language row, accusing him of furthering his political interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-today-sensex-nifty-decline-us-donald-trump-reciprocal-tariff-impact-2702063-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex dips 400 points in early trade. Why is stock market falling today?The Sensex and Nifty fell sharply in early trade as investors on Dalal Street are worried about the impact of US reciprocal tariffs, which will take effect on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rejects-new-york-times-report-on-hals-russia-link-calls-it-misleading-2701898-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India rejects New York Times report on HAL's Russia link, calls it 'misleading'India has dismissed The New York Times report alleging HAL supplied sensitive technology to a Russian arms agency, calling it misleading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ashwani Kumar relishes dream IPL debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/frances-marine-le-pen-gets-4-years-for-embezzlement-with-2-under-ankle-monitor-house-arrest-2702015-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "France's Marine Le Pen gets 4 years for embezzlement, with 2 under ankle monitorMarine Le Pen, who was the frontrunner for the 2024 presidential elections, along with more than 20 members of her party, was convicted of paying her party's staff using funds from the European Parliament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/well-fly-again-sunita-williams-and-butch-wilmore-confident-in-starliners-future-2701994-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams and Butch Wilmore confident in Starliner's futureBoth astronauts expressed humility and honor in returning home, emphasizing their confidence in Nasa's decision-making process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/security-forces-terrorists-jammu-kashmir-kathua-encounter-gunfight-2701966-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 terrorists trapped in fresh gunfight in J&K's Kathua, third operation in 9 daysA fresh exchange of fire was reported between security forces and terrorists in the Ramkot area in Jammu and Kashmir's Kathua district. This is the third such gunbattle in the district in the past nine days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/salman-khan-eid-party-sonakshi-sinha-zaheer-iqbal-sohail-khan-arbaaz-khan-attend-2702018-2025-04-01#?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Salman Khan hosts Eid bash: Sohail, Arbaaz, Sonakshi-Zaheer and celebs attendSalman Khan hosted an Eid party at Mercii in Mumbai on March 31. His brothers, Sohail, Arbaaz, sister Arpita Khan, Sonakshi Sinha, Zaheer Iqbal and several others attended the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-woman-hacked-husband-whatsapp-raped-blackmailed-women-arrested-2701935-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wife hacks husband's WhatsApp, learns he sexually abused women, gets him arrestedA 24-year-old woman from Nagpur got her husband, 32, arrested after she hacked into his WhatsApp and found out he blackmailed and allegedly sexually abused several women, including a 19-year-old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/spacex-launches-fram2-astronauts-over-earths-poles-in-picture-perfect-liftoff-2702006-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SpaceX launches Fram2 astronauts on maiden flight over Earth's polesThis mission aims to explore Earth's poles while conducting 22 scientific experiments, including studies on atmospheric phenomena and the effects of space travel on the human body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/imd-summer-season-hotter-than-usual-temperatures-heatwave-days-india-2701837-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "April to be hotter than usual with 3 heatwave days in Delhi, 6 in Bengal, BiharMost parts of India, including Odisha, West Bengal, Bihar, Jharkhand, Delhi and other parts of northwest India may face more heatwave days from April to June, the IMD said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-collection-day-2-salman-khan-minimal-eid-boost-earns-rs-55-crore-2702040-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar box office Day 2: Salman's film sees minimal Eid boost, earns Rs 55 croreSikandar box office collection: Salman Khan's film collected Rs 29 crore on Eid, bringing its India total to Rs 55 crore. Despite the festive boost, it remains the actor's weakest Eid opener, facing strong competition from Mohanlal's L2: Empuraan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/redrawing-the-fault-lines-why-delimitation-may-ignite-manipur-again-2701753-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Redrawing the fault lines: Why delimitation may ignite Manipur againThe Supreme Court-mandated process in the violence-hit state faces political opposition over flawed data, illegal immigration and ethnic tensions, turning it into a flashpoint\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-conducts-military-drills-near-taiwan-calls-its-president-parasite-2702026-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China conducts military drills near Taiwan, calls its President 'parasite'Taiwan's Defence Ministry said in a statement on Tuesday that China's Shandong aircraft carrier group had entered its response area on Monday, adding the group had dispatched military aircraft and ships and activated land-based missile systems in response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-indias-northeast-states-seven-sisters-bid-to-lure-chinese-investments-xi-jinping-2701830-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yunus refers to India's northeast states in bid to lure China; eyebrows raisedMuhammad Yunus, head of Bangladesh's interim government, referred to the seven states in northeast India, seeking to attract Chinese investment to his country. He positioned Bangladesh as the \"only guardian of the ocean\" and said China could use it as a gateway for economic expansion. Eyebrows were raised at his reference to \"landlocked\" Indian states during his China visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiran-rao-reena-dutta-click-selfie-at-aamir-khan-family-gathering-on-eid-see-photos-2702060-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pics: Kiran Rao, Reena Dutta click selfie at Aamir Khan's family gathering on EidKiran Rao celebrated Eid with Aamir Khan's family on Monday. She shared heartwarming pictures from the festivities on social media. While Aamir was missing from her photos, he earlier greeted paparazzi with his sons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-shares-what-she-wanted-to-eat-the-moment-she-returned-from-space-2701995-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams shares what she wanted to eat when she returned homeSunita Williams, who spent 286 days in space due to technical issues with the Boeing Starliner spacecraft, said her immediate desire was to reconnect with her loved ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-lok-sabha-senior-ministers-india-bloc-leaders-parliament-2701916-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf bill to be presented in Lok Sabha on April 2: SourcesThe amended Waqf Bill is set to be tabled in the Lok Sabha on April 2. The BJP is engaging with India Bloc leaders to secure support. The bill has faced opposition, with critics calling it unconstitutional. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-dead-toll-in-firecracker-explosion-triggered-by-cylinder-blast-2701975-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 of family dead in firecracker explosion triggered by cylinder blast in BengalSeven people, including three children, died in a firecracker explosion triggered by a cylinder blast in South 24 Parganas, West Bengal. Four remain missing. Police are investigating, while officials assess the cause of the incident.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ryan-rickelton-says-hardik-pandya-asked-to-raise-intensity-mi-vs-kkr-2702073-2025-04-01",
      "headline": "Hardik Pandya asked the team to raise intensity and be ruthless: Ryan RickeltonMumbai Indians' (MI) wicketkeeper batter Ryan Rickelton said that their captain Hardik Pandya, had asked the entire team to raise the intensity ahead of their fixture against Kolkata Knight Riders (KKR). MI beat Kolkata by 8 wickets to register first win of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ryan-rickelton-on-ashwan-kumars-pace-mi-vs-kkr-2702069-2025-04-01",
      "headline": "Ricketon reveals Ashwani Kumar's special trait: He's a lot quicker than he looksMumbai Indians wicketkeeper batter Ryan Rickelton revealed that their new bowler Ashwani Kumar is a lot quicker than people think of him to be. Ashwani registered match-winning figures of 4/24 in three overs on his debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ramandeep-singh-on-ashwani-kumar-mi-vs-kkr-2702037-2025-04-01",
      "headline": "Ashwani Kumar is a hardworking guy, we practice at the same academy: Ramandeep SinghKolkata Knight Riders (KKR) all-rounder Ramandeep Singh showered praise on Mumbai Indians' Ashwani Kumar after his match-winning performance in Match 12 of the Indian Premier League 2025 (IPL 2025). Ashwani became the first Indian player to take four wickets on his IPL debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ramandeep-singh-voices-out-against-mega-auction-mi-vs-kkr-2702033-2025-04-01",
      "headline": "KKR's Ramandeep Singh voices out against mega-auction after MI thrashing: They are dishearteningKKR batter Ramandeep Singh voiced his dissatisfaction with the IPL mega-auction after their loss to Mumbai Indians on Monday. Ramandeep said that every three years, teams have to find new winning combinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-predicted-xi-fantasy-picks-2702022-2025-04-01",
      "headline": "IPL 2025, LSG vs PBKS predicted XI, fantasy picks: Players who can fetch you most pointsLucknow Super Giants (LSG) and Pujab Kings (PBKS) will look to continue their winning momentum as they take on each other in Match 13 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-slammed-for-mi-scouts-praise-mi-vs-kkr-2702007-2025-04-01",
      "headline": "Hardik Pandya slammed for MI scouts praise: Fans remind captain of 2022 statementHardik Pandya's conflicting views on Mumbai Indians' scouting system have sparked social media debate after the team's win against KKR. Fans questioned his recent praise of MI scouts and reminded Pandya of his contrasting views on the matter back in 2022 when he moved away from the team to join Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-mi-vs-kkr-wankhede-2701997-2025-04-01",
      "headline": "IPL 2025 Points Table, March 31: MI jump to sixth spot after thrashing KKRMumbai Indians' emphatic win over Kolkata Knight Riders propelled them to the sixth spot in the IPL points table, while the defending champions struggle at the bottom after managing just one win in three games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-ravindra-jadeja-insta-story-ms-dhoni-2701988-2025-04-01",
      "headline": "Ravindra Jadeja's Insta story after CSK's loss to RR goes viral: Things will changeIPL 2025: A day after Chennai Super Kings flopped in Guwahati, Ravindra Jadeja shared an Instagram story, promising fans of a strong comeback. He shared a photo of himself and MS Dhoni from Sunday's defeat to Rajasthan Royals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-dropped-mumbai-indians-michael-vaughan-2701984-2025-04-01",
      "headline": "Rohit Sharma would be dropped from MI if not for his name: VaughanMichael Vaughan questioned Rohit Sharma's place in Mumbai Indians' lineup, stating that without his heritage-rich name and IPL legacy, his ongoing form would have seen him dropped. Vaughan highlights Rohit's lack of fifties and centuries in IPL as a major concern for MI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-indian-with-most-t20-runs-virat-kohli-suresh-raina-mi-vs-kkr-ipl-2701979-2025-03-31",
      "headline": "Suryakumar Yadav becomes 5th Indian batter to hit 8000 T20 runsMumbai Indians batter Suryakumar Yadav joined an elite list during the team's match against KKR. Suryakumar reached 8000 T20 runs during his rapid 27* off 9 balls at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-ashwani-kumar-mumbai-scouting-team-hardik-pandya-2701977-2025-03-31",
      "headline": "Hardik Pandya, fans praise MI's scouting team: Better search engine than GoogleIPL 2025, MI vs KKR: Captain Hardik Pandya heaped praise on Mumbai Indians' scouting team after 23-year-old Ashwani Kumar shone on debut. The left-arm pacer is the latest in the assembly line of exciting talents unearthed by the five-time champions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-mi-vs-kkr-wankhede-2701997-2025-04-01",
      "headline": "IPL 2025 Points Table, March 31: MI jump to sixth spot after thrashing KKRMumbai Indians' emphatic win over Kolkata Knight Riders propelled them to the sixth spot in the IPL points table, while the defending champions struggle at the bottom after managing just one win in three games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-ravindra-jadeja-insta-story-ms-dhoni-2701988-2025-04-01",
      "headline": "Ravindra Jadeja's Insta story after CSK's loss to RR goes viral: Things will changeIPL 2025: A day after Chennai Super Kings flopped in Guwahati, Ravindra Jadeja shared an Instagram story, promising fans of a strong comeback. He shared a photo of himself and MS Dhoni from Sunday's defeat to Rajasthan Royals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-dropped-mumbai-indians-michael-vaughan-2701984-2025-04-01",
      "headline": "Rohit Sharma would be dropped from MI if not for his name: VaughanMichael Vaughan questioned Rohit Sharma's place in Mumbai Indians' lineup, stating that without his heritage-rich name and IPL legacy, his ongoing form would have seen him dropped. Vaughan highlights Rohit's lack of fifties and centuries in IPL as a major concern for MI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-indian-with-most-t20-runs-virat-kohli-suresh-raina-mi-vs-kkr-ipl-2701979-2025-03-31",
      "headline": "Suryakumar Yadav becomes 5th Indian batter to hit 8000 T20 runsMumbai Indians batter Suryakumar Yadav joined an elite list during the team's match against KKR. Suryakumar reached 8000 T20 runs during his rapid 27* off 9 balls at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-ashwani-kumar-mumbai-scouting-team-hardik-pandya-2701977-2025-03-31",
      "headline": "Hardik Pandya, fans praise MI's scouting team: Better search engine than GoogleIPL 2025, MI vs KKR: Captain Hardik Pandya heaped praise on Mumbai Indians' scouting team after 23-year-old Ashwani Kumar shone on debut. The left-arm pacer is the latest in the assembly line of exciting talents unearthed by the five-time champions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-elgton-jenkins-moving-to-center-for-2025-says-packers-gm-glbs-2701976-2025-03-31",
      "headline": "NFL: Elgton Jenkins moving to center for 2025, says Packers GMPackers GM Brian Gutekunst confirmed Elgton Jenkins will shift from guard to center, strengthening Green Bay's offensive line and providing stability for quarterback Jordan Love in the 2025 NFL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-flagg-broome-clayton-lead-star-studded-final-four-clash-between-no-1-seeds-glbs-2701974-2025-03-31",
      "headline": "March Madness 2025: Flagg, Broome, Clayton lead star-studded final four clash between no. 1 seedsThe Final Four features top-seeded powerhouses as Auburn, Florida, Houston, and UConn battle for supremacy. Players like Flagg, Broome, and Clayton are set to shine on college basketball's biggest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suryakumar-yadav-unreal-shot-ryan-rickleton-mi-vs-kkr-2701970-2025-03-31",
      "headline": "Suryakumar Yadav is a joke: Ryan Rickleton amazed with unreal shot vs KKRRyan Rickleton and Suryakumar Yadav's fiery partnership guided Mumbai Indians to a dominant win over Kolkata Knight Riders, with the latter's outrageous second-ball six leaving both his teammates and opponents stunned at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kevin-durant-injured-dillon-brooks-ejected-as-phoenix-suns-fall-to-houston-rockets-in-blowout-loss-glbs-2701969-2025-03-31",
      "headline": "NBA: Kevin Durant injured, Dillon Brooks ejected as Phoenix Suns fall to Houston Rockets in blowout lossThe Phoenix Suns' postseason hopes took a massive hit on Sunday night as all-star forward Kevin Durant suffered a left ankle injury during a game against the Houston Rockets on March 30 during a regular NBA game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-score-ashwani-kumar-ryan-rickelton-mumbai-2701956-2025-03-31",
      "headline": "Debutant Ashwani Kumar fires as MI decimate KKR to open account in styleIPL 2025, MI vs KKR match report: Ashwani Kumar's four-wicket haul and Ryan Rickelton's unbeaten 62 helped Mumbai Indians hammer Kolkata Knight Riders by 8 wickets. The five-time champions won their first game of the season in style, making a big statement of intent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31",
      "headline": "Ashwani Kumar relishes dream IPL debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashwani-kumar-mi-vs-kkr-debut-record-indian-premier-league-2701917-2025-03-31",
      "headline": "MI's Ashwani Kumar becomes 1st Indian bowler to take 4 wickets on IPL debutIPL 2025, MI vs KKR: Left-arm fast bowler Ashwani Kumar became the first Indian man in the history of the Indian Premier League to take more than 3 wickets on debut in the tournament. He rattled Kolkata Knight Riders at the Wankhede Stadium on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-hardik-pandya-cheers-mumbai-wankhede-stadium-2701908-2025-03-31",
      "headline": "Watch: Mumbai Indians fans cheer for Hardik Pandya a year after booing sagaIPL 2025, MI vs KKR: A year after he was relentlessly booed by the home crowd, Hardik Pandya got a roaring reception when he stepped up for the toss in Mumbai Indians' first home game of the season on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-score-ashwani-kumar-ryan-rickelton-mumbai-2701956-2025-03-31",
      "headline": "Debutant Ashwani Kumar fires as MI decimate KKR to open account in styleIPL 2025, MI vs KKR match report: Ashwani Kumar's four-wicket haul and Ryan Rickelton's unbeaten 62 helped Mumbai Indians hammer Kolkata Knight Riders by 8 wickets. The five-time champions won their first game of the season in style, making a big statement of intent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-who-is-ashwani-kumar-comments-reactions-2701931-2025-03-31",
      "headline": "Ashwani Kumar relishes dream IPL debut: 1 banana for lunch, 4 wickets for dinnerMumbai Indians' Ashwani Kumar bowled an incredible spell on debut at the Wankhede Stadium. Ashwani became the first ever Indian bowler to pick up 4 wickets in his debut match in the IPL. In the mid-innings interview, he revealed the nervy moments before the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashwani-kumar-mi-vs-kkr-debut-record-indian-premier-league-2701917-2025-03-31",
      "headline": "MI's Ashwani Kumar becomes 1st Indian bowler to take 4 wickets on IPL debutIPL 2025, MI vs KKR: Left-arm fast bowler Ashwani Kumar became the first Indian man in the history of the Indian Premier League to take more than 3 wickets on debut in the tournament. He rattled Kolkata Knight Riders at the Wankhede Stadium on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-hardik-pandya-cheers-mumbai-wankhede-stadium-2701908-2025-03-31",
      "headline": "Watch: Mumbai Indians fans cheer for Hardik Pandya a year after booing sagaIPL 2025, MI vs KKR: A year after he was relentlessly booed by the home crowd, Hardik Pandya got a roaring reception when he stepped up for the toss in Mumbai Indians' first home game of the season on Monday, March 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-who-is-ashwani-kumar-2701896-2025-03-31",
      "headline": "Who is Ashwani Kumar? MI pacer picks up wicket in first ball on IPL debutFast bowler Ashwani Kumar picked up a wicket with the very first ball of his IPL career. Ashwani sent back KKR captain Ajinkya Rahane in the fourth over of the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-vs-lucknow-super-giants-azmatullah-omarzai-2701864-2025-03-31",
      "headline": "Want to be a proper fast bowler: Pubjab Kings pacer Azmatullah OmarzaiAzmatullah Omarzai, the Afghan pacer for Punjab Kings, is determined to establish himself as a genuine fast bowler in the Indian Premier League (IPL) 2025, moving beyond his role as an all-rounder to become a key asset in the pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-speech-srh-ipl-2025-2701860-2025-03-31",
      "headline": "We are SRH, we don't play safe and score 160-170: Pat CumminsSunRisers Hyderabad captain Pat Cummins has backed the team's methods despite two losses in the Indian Premier League. Cummins issued a warcry and said that SRH were not the kind of team who played safe and score 160-170 runs per game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-rohit-sharma-impact-player-pep-talk-wankhede-stadium-2701857-2025-03-31",
      "headline": "MI vs KKR: Rohit Sharma named Impact Player after fiery pep talk in huddleIPL 2025, MI vs KKR: Mumbai Indians nominated Rohit Sharma as their impact player for Monday's clash at home. Rohit addressed the team huddle, giving his teammates a fiery pep talk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-intent-delhi-capitals-debut-hemang-badani-coach-2701834-2025-03-31",
      "headline": "KL Rahul 2.0? Hemang Badani lauds early glimpse in Delhi Capitals debutIPL 2025: Making his debut for Delhi Capitals on Sunday in Visakhapatnam, KL Rahul smashed 15 from just 5 deliveries in their successful chase of 164 against SunRisers Hyderabad. Rahul is expected to play an aggressor's role in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-kkr-live-score-ipl-match-today-updates-mumbai-hardik-ajinkya-2701831-2025-03-31",
      "headline": "MI vs KKR Highlights: Mumbai thrash Kolkata by 8 wickets at WankhedeMumbai Indians (MI) vs Kolkata Knight Riders (KKR) Highlights, IPL 2025: Mumbai Indians clinched a dominating 8-wicket win over Kolkata Knight Riders, with a high-class performance with both bat and ball. MI found match-winning heroes in debutant Ashwani Kumar's four-wicket -haul in the first innings, and then half-century star Ryan Rickleton in their 117 chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-varun-chakravarthy-sunil-narine-relationship-2701798-2025-03-31",
      "headline": "Sunil Narine will be MVP for Knight Riders IPL 2025 too: Varun ChakravarthyIPL 2025: Varun Charkavarthy spoke about his partnership with Sunil Narine in the IPL, backing the West Indies star to become the Most Valuable Player in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jakub-mensik-thanks-atp-physio-after-miami-open-title-win-for-miracle-treatment-2701789-2025-03-31",
      "headline": "Jakub Mensik thanks ATP physio after Miami Open title win for 'miracle' treatmentJakub Mensik thanked an ATP phyiso after winning the Miami Open title win on Sunday, March 30. Mensik was about to withdraw from the tournament due to a knee injury before the physio  helped him heal in quick time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-slammed-for-tossing-phone-after-selfie-rr-vs-csk-2701743-2025-03-31",
      "headline": "Watch: Riyan Parag slammed for tossing phone after selfie with security personnelRajasthan Royals' stand-in captain Riyan Parag was slammed for casually tossing the phone towards security personnel after clicking a selfie in Guwahati following his team's win over Chennai Super Kings (CSK)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-riyan-parag-captaincy-guwahati-2701733-2025-03-31",
      "headline": "Riyan Parag's bold claim: Always felt like I was captaining Rajasthan from Day 1Riyan Parag made the bold claim that he felt like he was captaining Rajasthan Royals from the time he joined the franchise. Riyan joined the franchise during the 2018 auction and has been a regular in the side since then. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-suggests-sending-naman-dhir-at-number-3-2701696-2025-03-31",
      "headline": "Rayudu suggests batting order shift for struggling MI: Send Naman Dhir at no 3Former India cricketer Ambati Rayudu has suggested Mumbai Indians to promote Naman Dhir at number three in the upcoming game against Kolkata Knight Riders (KKR) in Indian Premier League 2025 (IPL 2025)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-kkr-angkrish-raghuvanshi-wankhede-stadium-2701680-2025-03-31",
      "headline": "KKR want to forget past results at Wankhede vs MI: Angkrish RaghuvanshiAngkrish Raghuvanshi has said that KKR doesn't want to focus on their past results at the Wankhede stadium when they take on MI on Monday, March 31. KKR doesn't have a great record while playing at the iconic ground. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}