{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loans-under-under-scanner-as-rbi-plans-stricter-norms-for-banks-lenders-report-2689913-2025-03-06",
      "headline": "Gold loans under under scanner as RBI plans stricter norms for lenders: Report The RBI wants banks and non-banking financial companies (NBFCs) to conduct deeper background checks on borrowers and verify the ownership of the gold being pledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-central-government-employees-receive-good-news-before-holi-2689886-2025-03-06",
      "headline": "DA hike? Will central government employees receive good news before Holi?The government reviews DA twice a year; the January hike is announced around Holi, while July revision is around Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-special-fixed-deposits-offering-up-to-805-percent-interest-check-details-2689853-2025-03-06",
      "headline": "5 special fixed deposits offering up to 8.05% interest. Check details  These fixed deposits are available only for a limited period, with the last date for investing in these schemes being March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-rises-600-points-nifty-nears-22550-as-auto-and-metal-stocks-rally-2689848-2025-03-06",
      "headline": "Sensex rises 600 points, Nifty nears 22,550 as auto and metal stocks rallyThe S&P BSE Sensex gained 609.86 points to close at 74,340.09, while the NSE Nifty50 added 207.40 points to end at 22,544.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/britannia-industries-ceo-and-executive-director-rajneet-singh-kohli-resigns-2689836-2025-03-06",
      "headline": "Britannia Industries CEO Rajneet Singh Kohli resignsKohli submitted his resignation on March 5, 2025, and the Board of Directors has taken note of it through a circular resolution passed on March 6, 2025. He will be relieved from his duties at the close of business hours on March 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/you-do-not-need-employer-permission-for-these-epf-account-changes-name-date-of-birth-nationality-2689806-2025-03-06",
      "headline": "You don't need employer's permission for these EPF account changesIf your UAN is already linked to Aadhaar, you can update personal details like name, date of birth, gender, nationality, parents' names, marital status, spouse's name, date of joining, and date of leaving, all without submitting any documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-recovers-500-points-why-is-stock-market-gaining-despite-early-losses-auto-fmcg-banking-2689816-2025-03-06",
      "headline": "Sensex gains 600 points: Why is stock market rising despite early losses?Stock market gains: The S&P BSE Sensex was up 475.17 points to 74,205.40, while the NSE Nifty50 added 171.30 points to 22,508.60 as of 2:20 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-mandates-10-day-office-attendance-track-compliance-report-2689796-2025-03-06",
      "headline": "Infosys mandates 10-day office attendance, to track compliance: ReportInfosys has informed its technology workforce that a new system will track attendance and limit the number of work-from-home (WFH) days they can apply for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indian-jewellery-exporters-worried-over-us-reciprocal-tariffs-2689741-2025-03-06",
      "headline": "Indian jewellers worry as Trump's reciprocal tariffs spark job loss fears: ReportKey Indian exports to the US include cut and polished diamonds, studded gold jewellery, plain gold jewellery, lab-grown diamonds, and silver jewellery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rally-for-second-straight-day-is-dalal-street-gearing-up-for-a-strong-bull-run-2689764-2025-03-06",
      "headline": "Sensex, Nifty rally for 2nd straight day: Is D-Street ready for a bull run?The two-day recovery rally on Dalal Street, though encouraging, comes amid global uncertainty, particularly concerns over a possible trade war. While some experts remain cautious about calling this a full-fledged market recovery, they acknowledge that conditions are improving for a potential uptrend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economic-impact-how-much-will-donald-trump-reciprocal-tariffs-cost-2689754-2025-03-06",
      "headline": "How much will Donald Trump's reciprocal tariffs cost India?During a joint session of the US Congress, President Donald Trump said that other countries have charged the US high tariffs for years, and it was time to respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-mahila-samriddhi-scheme-check-eligibility-how-to-apply-for-rs-2500-monthly-aid-2689712-2025-03-06",
      "headline": "Delhi Mahila Samriddhi Scheme: Check if you are eligible for Rs 2,500 monthly aidThe Delhi government will launch an online portal where women can submit their applications. The IT department is also developing special software to verify eligibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-administration-asks-india-for-zero-tariff-on-all-goods-except-agriculture-products-2689701-2025-03-06",
      "headline": "US may push India for zero tariffs on nearly all goods: Report The development comes as US President Donald Trump keeps criticising India over what he calls 'unfair' trade practices. He recently announced that reciprocal tariffs would kick in on April 2 and made it clear that India wouldn't be getting any special treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jindal-groups-sajjan-jindal-says-elon-musks-tesla-wont-succeed-india-2689687-2025-03-06",
      "headline": "Jindal Group's Sajjan Jindal says Elon Musk's Tesla won't succeed IndiaSajjan Jindal doubts Elon Musk's Tesla can thrive in India, but with office space secured and hiring underway, Musk seems determined to challenge local giants like Tata and Mahindra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nithin-kamath-zerodha-founder-doesn-not-want-you-to-stop-sips-amid-ongoing-market-correction-here-is-why-2689686-2025-03-06",
      "headline": "Nithin Kamath doesn't want you to stop SIPs amid market correction. Here's whyZerodha Founder and CEO Nithin Kamath believes this is not the right time to stop systematic investment plans (SIPs) despite the market correction on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jack-daniel-maker-brown-forman-ceo-canada-ban-on-us-alcohol-worse-than-tariff-2689677-2025-03-06",
      "headline": "Jack Daniel's maker says Canada pulling US alcohol off shelves worse than tariffSeveral Canadian provinces have taken US liquor off store shelves as part of retaliatory measures against President Donald Trump's tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-war-us-eyes-duty-free-car-exports-to-india-as-teslas-entry-nears-report-2689671-2025-03-06",
      "headline": "US eyes duty-free car exports to India as Tesla's entry nears: Report Tesla CEO Elon Musk has previously criticised the tariffs put by India on the import of cars from the US, calling them among the highest in the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-founder-nithin-kamath-wins-ey-entrepreneur-of-the-year-award-2024-2689670-2025-03-06",
      "headline": "Zerodha's Nithin Kamath wins EY Entrepreneur of the Year Award 2024A self-made entrepreneur, Kamath has not only bootstrapped Zerodha to a billion-dollar valuation but also actively supports start-ups in fintech and climate space, and advocates for social initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-rise-for-second-consecutive-day-led-by-auto-stocks-ril-gains-2-percent-2689639-2025-03-06",
      "headline": "Sensex, Nifty rise for second consecutive day led by auto stocks; RIL gains 2%The S&P BSE Sensex jumped 325.45 points to 74,055.68, while the NSE Nifty50 added 99.05 points to 22,436.35 as of 9:20 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epf-withdrawal-via-upi-and-atms-coming-soon-all-you-need-to-know-2689399-2025-03-05",
      "headline": "EPF withdrawal via UPI and ATMs coming soon. All you need to knowThis new facility will allow EPF members to withdraw their savings instantly using UPI platforms like GPay, PhonePe, and Paytm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr1-sahaj-vs-itr4-sugam-check-key-differences-and-eligibility-2689364-2025-03-05",
      "headline": "ITR-1 (Sahaj) vs ITR-4 (Sugam): Check key differences and eligibility Commonly known as the Sahaj form, ITR-1 is a simple form for individuals with simple income sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-track-old-mutual-funds-investments-here-is-what-you-need-to-do-2689316-2025-03-05",
      "headline": "Want to track old mutual funds investments? Here's what you need to doWith millions of unclaimed folios, the Mitra platform aims to simplify the process of finding and reclaiming lost mutual fund investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-700-points-higher-nifty-snaps-10-day-losing-streak-2689296-2025-03-05",
      "headline": "Sensex ends 740 points higher, Nifty snaps 10-day losing streakThe S&P BSE Sensex ended 740.30 points higher to 73,730.23 at the closing bell, while the NSE Nifty50 settled 254.65 points lower at 22,337.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-better-returns-than-fixed-deposits-check-these-3-investment-options-nsc-ppf-government-bonds-gold-etfs-2689243-2025-03-05",
      "headline": "Looking for better returns than fixed deposits? Check these 3 investment optionsWith the RBI announcing a repo rate cut, banks have lowered fixed deposit rates, prompting investors to look for better alternatives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-dalal-street-relief-rally-losing-streak-finally-over-2689183-2025-03-05",
      "headline": "Sensex surges 900 points: Is Dalal Street's losing streak finally over?Today's relief rally in domestic equities is offering some much-needed respite to traders. But with trade tensions heating up, the volatility isn't going away anytime soon. Is this the beginning of a rebound or just a temporary surge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-could-hamper-taxpayers-digital-privacy-details-here-2689162-2025-03-05",
      "headline": "New income tax bill proposes allowing officers access to your email, social mediaThe new bill gives tax officers the authority to access computers, emails, and social media accounts, raising privacy concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-jumps-over-4-percent-after-ubs-target-price-upgrade-2689139-2025-03-05",
      "headline": "M&M shares rise over 4% after UBS upgrade. 3 things investors should know M&M stock price: The brokerage said the recent 19% correction in M&M's share price, compared to Nifty Auto's 13% decline, was an overreaction to EV-related concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/services-sector-growth-accelerates-in-february-backed-by-strong-demand-2689130-2025-03-05",
      "headline": "Services sector growth accelerates in February backed by strong demandHSBC's final India services Purchasing Managers' Index, compiled by S&P Global, rose to 59.0 in February from January's 26-month low of 56.5 but was lower than a preliminary estimate of 61.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-reciprocal-tariffs-us-president-donald-trump-congress-address-2689116-2025-03-05",
      "headline": "What are reciprocal tariffs that Donald Trump mentioned in Congress address?US President Donald Trump announced the implementation of reciprocal tariffs starting next month while addressing a joint session of the US Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-600-points-why-is-the-stock-market-rising-today-2689112-2025-03-05",
      "headline": "Sensex surges 800 points. Why is the stock market rising today?Today's rebound has brought much-needed relief to traders on Dalal Street, reviving hopes of a broader recovery in the days ahead. Here's what's driving the rally and whether the downturn has bottomed out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-coforge-shares-jumped-nearly-10-today-2689103-2025-03-05",
      "headline": "Explained: Why Coforge shares jumped nearly 10% todayCoforge share price: The stock reached an intraday high of Rs 7,924.50 in early trade and was up 8.65% to Rs 7,827.25 on the Bombay Stock Exchange (BSE) at 10:20 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-bounce-back-as-it-stocks-rally-investors-remain-wary-2689095-2025-03-05",
      "headline": "Sensex, Nifty bounce back as IT stocks rally; investors remain waryThe Nifty IT index jumped nearly 2%, buoyed by a 10 % surge in Coforge after it signed a 13-year, $1.56 billion deal with Sabre Corp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/struggling-to-find-your-old-mutual-fund-investments-sebis-mitra-help-track-unclaimed-mfs-2688839-2025-03-04",
      "headline": "Struggling to find your old mutual fund investments? Let Sebi's Mitra help With over 7.5 million inactive folios across different asset management companies (AMCs), Mitra is designed to help investors recover their forgotten investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-marriage-impact-your-credit-score-all-you-need-to-know-2688797-2025-03-04",
      "headline": "Does marriage impact your credit score? All you need to know While regular payments can improve both scores, any late or default on payments can considerably impact both the scores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-under-pressure-as-us-and-eu-tighten-trade-policies-2688761-2025-03-04",
      "headline": "India's exports under pressure as US and EU tighten trade policiesUS President Donald Trump's plan to impose reciprocal tariffs from April is a major concern for Indian exporters, particularly in sectors like automobiles, agriculture, and manufacturing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nifty-falls-for-10th-straight-session-longest-daily-losing-streak-since-1996-2688757-2025-03-04",
      "headline": "Nifty falls for 10th straight day, longest daily losing streak since 1996 launchNifty has registered a 10-day losing streak amid multiple triggers, including relentless selling by foreign investors and fears of an escalating trade war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-as-trade-war-fears-keep-investors-on-edge-2688744-2025-03-04",
      "headline": "Sensex, Nifty end lower as trade war fears keep investors on edgeThe S&P BSE Sensex ended 96.01 points lower at 72,989.93 at the closing bell, while the NSE Nifty50 fell 36.65 points to 22,082.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-how-to-pick-quality-stocks-mutual-fund-investment-2688732-2025-03-04",
      "headline": "Stock market correction: Here's how to pick quality stocksDuring a market downturn, investors must be careful about stock selection. Choosing the right stocks can help minimise losses and create long-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-ceo-bhavish-aggarwal-wants-weekly-updates-from-staff-kya-chal-raha-hai-report-2688701-2025-03-04",
      "headline": "Ola CEO Bhavish Aggarwal wants weekly updates from staff: ReportUnder the new policy, employees must send a short email every week highlighting 3-5 key tasks they have completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-cryptos-like-bitcoin-ethereum-xrp-cardano-solana-are-crashing-suddenly-2688685-2025-03-04",
      "headline": "Explained: Why popular cryptocurrencies are crashing suddenlyOver the last 24 hours, Bitcoin, the world's largest cryptocurrency, has lost 8.83%, currently trading at $83,461.02."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/friends-actor-stephen-park-on-toxic-environment-on-friends-set-became-race-conscious-2689896-2025-03-06",
      "headline": "Friends actor recalls 'toxic environment' on set: I had become so race-consciousActor Stephen Park shared his negative experiences on the set of Friends, highlighting racial insensitivity. He recalled an incident involving an assistant director's offensive remarks towards fellow actor James Hong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ayesha-khan-bigg-boss-17-faints-shooting-video-goes-viral-2689854-2025-03-06",
      "headline": "BB 17's Ayesha Khan faints while shooting, video goes viralBigg Boss 17 fae Ayesha Khan fainted on the sets of her upcoming project. Reportedly, the incident took place on Kapil Sharma's Kis Kisko Pyaar Karun set. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nora-fatehi-jason-durelo-teache-kelly-clarkson-snake-hook-step-watch-2689838-2025-03-06",
      "headline": "Nora Fatehi, Jason Durelo teach Kelly Clarkson Snake hook step. WatchKelly Clarkson welcomed Nora Fatehi and Jason Derulo on her talk show, where they showcased their latest hit, Snake, and even taught Kelly the hook step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lisa-kudrow-no-good-deed-netflix-ray-romano-2689833-2025-03-06",
      "headline": "Lisa Kudrow's No Good Deed: This dark comedy could have been darker and funnierLisa Kudrow and Ray Romano are beloved comedic actors. And they deserved better treatment than Netflix's No Good Deed, which is fine at best. The series is currently streaming on the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-review-you-are-neither-fancy-nor-rich-enough-for-markles-show-2689801-2025-03-06",
      "headline": "With Love, Meghan review: You are neither fancy nor rich enough for Markle's show Released-Wed Mar 05, 2025With Love, Meghan could have been a lovely show about cooking and lifestyle, but it becomes a window into Markle's pretentiousness. It can't do away with its elitism, the one thing that Markle stood against during her stint at the royal palace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-cancels-noah-centineo-led-the-recruit-after-2-seasons-2689740-2025-03-06",
      "headline": "Netflix cancels Noah Centineo-led The Recruit after 2 seasonsStreaming giant Netflix has cancelled actor Noah Centineo-starrer The Recruit after only two seasons. The news was recently confirmed by the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-review-charlie-cox-vincent-donofrio-jon-bernthal-jiohotstar-2689718-2025-03-06",
      "headline": "Daredevil Born Again review: An uneven but triumphant return of Hell's Kitchen's devilReleased-Wed Mar 05, 2025Matt Murdock is back as Hell's Kitchen's favourite vigilante in Marvel Studios' Daredevil Born Again. The show had its two-episode premiere on March 5 and can be streamed on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ali-fazal-rakht-brahmand-physical-training-learns-ancient-martial-arts-2689730-2025-03-06",
      "headline": "Ali Fazal trains 7 hours a day for Rakht Brahmand, learns ancient martial artsAli Fazal undergoes 7-hour daily training, learning martial arts and perfecting diction for Rakht Brahmand. He calls the process \"demanding but rewarding.\" The series also stars Samantha Ruth Prabhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/bigg-boss-17s-anurag-dobhal-gets-engaged-to-girlfriend-ritika-2689700-2025-03-06",
      "headline": "Bigg Boss 17's Anurag Dobhal gets engaged to girlfriend RitikaBigg Boss 17's Anurag Dobhal got engaged to his girlfriend Ritika Chauhan. The vlogger shared pictures on Instagram on March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhavan-nayanthara-siddharth-netflix-film-test-to-premiere-on-april-4-2689695-2025-03-06",
      "headline": "Madhavan, Nayanthara, Siddharth's Netflix film Test to premiere on April 4Madhavan, Nayanthara, and Siddharth star in Test, a Tamil Netflix film exploring life's biggest challenges beyond cricket. Directed by S. Sashikanth, it will stream from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'One Direction singer Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she talked about her struggles and healing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-parambrata-jokes-about-playing-a-cop-ahead-of-khakee-the-bengal-chapter-neeraj-pandey-2689496-2025-03-05",
      "headline": "Actor Parambrata jokes about playing a cop ahead of Khakee: The Bengal ChapterActor Parambrata Chattopadhyay recently joked about playing a police officer ahead of his Netflix series, Khakee: The Bengal Chapter. The actor even shared reasons behind nodding to feature in the political drama. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-condemns-security-breach-during-jaishankar-visit-khalistanis-2689922-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Unacceptable: UK condemns security breach during S Jaishankar's visitOn Wednesday, as Jaishankar was leaving the Chatham House venue, after a discussion, a man ran toward his car and tore the Indian national flag in front of police officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranya-rao-kannada-actor-gold-smuggling-first-photo-karnataka-custody-2689884-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Ranya Rao's first photo in custody surfaces after arrest for gold smugglingKannada actor Ranya Rao's first photo in custody emerged on Thursday as she remains in DRI custody after being caught smuggling 14.2 kg of gold worth Rs 12.86 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-terror-attacks-accused-tahawwur-rana-extradition-india-delay-2689828-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's holding up Mumbai terror accused Tahawwur Rana's extradition to IndiaTahawwur Rana, wanted in India for his role in facilitating the Mumbai terror attacks, has approached the US Supreme Court for an emergency stay of his extradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohammed-shami-called-criminal-by-muslim-cleric-for-not-keeping-rota-during-australia-clash-2689803-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cleric attacks Mohammed Shami for not observing roza, top Muslim body defends himIndian cricketer Mohammed Shami faced criticism from Muslim cleric Maulana Shahabuddin Razvi Bareilvi for not fasting during India's semi-final against Australia, calling it a sin and a crime against religious principles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maga-make-america-great-again-trump-tariffs-india-china-americans-do-2689394-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hey MAGA guys, who pays for Trump's tariffs on India, China? Americans doThe MAGA crowd is elated over US President Donald Trump imposing reciprocal tariffs on foreign goods. However, many in the US are explaining how tariffs on countries like India and China end up hurting US businesses and making products costlier for ordinary Americans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/french-president-britain-pm-to-accompany-zelenskyy-in-us-for-peace-deal-report-2689831-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "French President, Britain PM may accompany Zelenskyy in US for peace dealFrench President Emmanuel Macron is planning a joint visit to Washington alongside Zelenskyy and British Prime Minister Keir Starmer to present a united European front to Trump, the French government said Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/distressing-my-reputation-is-being-tarnished-top-karnataka-cop-after-daughters-arrest-in-gold-smuggling-case-2689919-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Heartbroken parent': Top cop pens note on daughter Ranya Rao's arrestRamachandra Rao, father of arrested Kannada actor Ranya Rao, expressed shock over her arrest in a gold smuggling case. He said that she and her husband lived separately and distanced herself from the family. He asked everyone to be fair to him and his family, emphasising his integrity and lifelong service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-says-learning-marathi-a-must-after-rss-leaders-comment-sparks-row-2689829-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis says learning Marathi a must after RSS leader's comment sparks rowMaharashtra Chief Minister Devendra Fadnavis asserted in the assembly that Marathi is the state's official language and must be learnt by all residents. He emphasised its cultural significance, calling it every citizen's duty to learn and respect it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-review-you-are-neither-fancy-nor-rich-enough-for-markles-show-2689801-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With Love, Meghan review: You are neither fancy nor rich enough for Markle's show Released-Wed Mar 05, 2025With Love, Meghan could have been a lovely show about cooking and lifestyle, but it becomes a window into Markle's pretentiousness. It can't do away with its elitism, the one thing that Markle stood against during her stint at the royal palace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/president-donald-trump-plans-revoke-legal-status-of-lakhs-of-ukrainians-in-us-report-2689905-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump plans to revoke legal status of 2.4 lakh Ukrainians in US: ReportThe move, expected as soon as April, would be a stunning reversal of the welcome Ukrainians received under President Joe Biden's administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-condemns-security-breach-s-jaishankar-london-visit-khalistani-2689697-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's stern message for host UK over security breach during S Jaishankar visitThe government on Thursday strongly reacted to the security breach during External Affairs Minister S Jaishankar's UK visit, condemning the \"provocative activities\" of a small group of \"separatists and extremists\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-recovers-500-points-why-is-stock-market-gaining-despite-early-losses-auto-fmcg-banking-2689816-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex gains 600 points: Why is stock market rising despite early losses?Stock market gains: The S&P BSE Sensex was up 475.17 points to 74,205.40, while the NSE Nifty50 added 171.30 points to 22,508.60 as of 2:20 PM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-railways-employee-throws-garbage-from-moving-train-smiles-as-passenger-records-video-viral-2689747-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian Railways reacts after video shows employee throwing garbage from moving trainAs the video of the Indian Railways employee went viral, Railway Seva reacted by saying that the official concerned had been \"removed\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aligarh-muslim-university-holi-milan-function-request-students-declined-hindus-discrimination-protest-threaten-write-pm-narendra-modi-2689837-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AMU denies permission for Holi event, students threaten to write to PMStudents at the Aligarh Muslim University have threatened to take the matter up with Prime Minister Narendra Modi after a request to organise a Holi Milan event inside the campus was declined by the administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kannada-actor-ranya-rao-seeks-bail-dri-pushes-for-custody-2689821-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao gold smuggling case: Bengaluru court reserves order on actor's bail pleaKannada actor Ranya Rao, arrested for allegedly smuggling gold from Dubai, has filed for bail. The court reserved its order while the DRI is pushing for her custody, citing national security concerns and a wider probe.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-military-flights-for-deportations-due-to-high-costs-report-2689589-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US suspends military flights for deportations due to high costs: ReportThe Donald Trump administration has suspended the use of costly military aircraft to fly migrants who entered the US illegally, The Wall Street Journal reported on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/karnataka-bodybuilder-bride-wedding-look-video-viral-7-million-views-chitra-purushotham-2689875-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka bodybuilder bride's wedding look video goes viral with 7 million viewsEmbracing both tradition and strength, Chitra Purushotham flaunted her muscular physique while dressed in an elegant yellow and blue Kanjivaram saree. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/actor-ranya-raos-cop-father-not-new-to-controversy-faced-heat-in-hawala-money-case-2689778-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao's cop father not new to controversy, faced heat in hawala money caseActor Ranya Rao's stepfather came under scrutiny a decade ago when he was transferred in a case involving hawala money after a businessman filed a complaint alleging Rs 2 crore was looted from a bus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uae-executes-2-indians-muhammed-rinash-arangilottu-muraleedharan-perumthatta-valappil-death-row-murder-charges-mea-2689797-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two Kerala natives executed in UAE for murders, Centre informs familiesThe MEA said the Indian nationals were executed after the highest court in the UAE, the Court of Cassation, upheld the death sentences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-approaches-us-court-stop-extradition-to-india-will-be-tortured-2689739-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can't be sent to hornets' nest: 26/11 accused's move to halt India extradition26/11 accused Tahawwur Rana, in his application before the US Supreme Court, said there was a high likelihood of him being tortured in India as he was a Muslim of Pakistani origin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/how-boroline-has-managed-to-remain-a-cult-favourite-from-the-swadeshi-movement-to-becoming-gen-zs-favourite-2689221-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Boroline, a cult favourite, is finding its place in Gen Z skincare. Here's whyFrom Boomers to Millennials to Gen Z, everyone seems to be adding Boroline to their skincare routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kannada-actor-ranya-rao-gold-smuggling-dubai-visits-earnings-key-findings-2689669-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao's 30 UAE visits, Rs 12 lakh per trip for smuggling gold: 5 findingsRanya Rao case: The Kannada actor, who was arrested with gold bars worth Rs 12.56 crore from the Bengaluru airport, has travelled to Dubai 30 times over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-reveals-how-daughter-raha-got-her-name-2689792-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alia Bhatt on naming Raha: It was picked to go well with her future brother's nameAlia Bhatt reveals Raha's name was suggested by Ranbir Kapoor's mother Neetu Kapoor. The couple picked a boy and girl's name before their daughter's birth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-trump-hamas-secret-talk-gaza-ceasefire-hostages-deal-warning-threats-israel-pm-benjamin-netanyahu-palestine-2689787-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas says Trump's threats meant to help Netanyahu back out of Gaza ceasefire dealHamas said that Trump's repeated threats against Palestinians constituted support for Israel's Prime Minister Benjamin Netanyahu to back out of the Gaza ceasefire agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bong-joon-ho-mark-ruffalo-character-mickey-17-donald-trump-2689927-2025-03-06",
      "headline": "Bong Joon-ho on whether Mark Ruffalo's character in Mickey 17 is based on TrumpMickey 17 director Bong Joon-ho recently opened up about the comparisons being drawn between Mark Ruffalo's character in his film with US President Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-akhil-mammoottys-agent-finally-gets-ott-release-date-after-2-year-delay-2689912-2025-03-06",
      "headline": "Actor Akhil, Mammootty's Agent finally gets OTT release date after 2-year delayAkhil Akkineni's action thriller Agent, which faced multiple delays in production and its OTT release, is finally set to premiere on SonyLIV. The film, released theatrically in April 2023, was a box-office disappointment despite high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manjima-mohan-on-suzhal-2-took-me-10-years-to-get-impactful-role-like-nagamma-2689883-2025-03-06",
      "headline": "Manjima Mohan on Suzhal 2: Took me 10 years to get impactful role like NagammaIn an exclusive conversation with India Today Digital, Manjima Mohan talked about her role as Nagamma in Suzhal 2. She also spoke about why she prefers quality to quantity and her relationship with actor-husband Gautham Karthik. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-on-mookuthi-amman-2-strong-message-on-women-empowerment-2689852-2025-03-06",
      "headline": "Khushbu Sundar on Mookuthi Amman 2: Strong message on women empowermentActor and politician Khushbu Sundar on Thursday talked to India Today Digital about her latest film 'Mookuthi Amman 2', which is directed by her husband, Sundar C, and also features Nayanthara in an important role. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-rahul-tripathi-chennai-super-kings-2689917-2025-03-06",
      "headline": "Don't try anything extra: When MS Dhoni calmed down a debuting Rahul TripathiRahul Tripathi recalled the moment when MS Dhoni helped him calm down ahead of his IPL debut in 2017. Dhoni and Tripathi were playing for Rising Pune Super Giants at that time in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-father-critics-pakistan-criticism-2689900-2025-03-06",
      "headline": "Choose your words carefully: Babar Azam's father slams criticsBabar Azam's father Azam Siddique slammed critics for their harsh criticism towards his son after Pakistan's poor performance in the Champions Trophy where they couldn't advance to the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brydon-carse-srh-injury-replacement-2689856-2025-03-06",
      "headline": "SRH rope in South Africa all-rounder for injured Brydon Carse IPL 2025: South African all-rounder Wiaan Mulder has replaced the injured Brydon Carse in the Sunrisers Hyderabad (SRH) for the upcoming edition of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-mohammed-shami-dubai-pitch-advantage-2689789-2025-03-06",
      "headline": "Mohammed Shami gives contrasting take on Dubai pitch as compared to Gambhir, RohitIndian pacer Mohammed Shami gave a contrasting take about India having an advantage in Dubai as compared to captain Rohit Sharma and Gautam Gambhir. Shami admitted that India does have an advantage playing Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-david-miller-clutch-icc-knockout-2689755-2025-03-06",
      "headline": "Miller remains 'clutch' as South Africa fail once again in an ICC knockoutDavid Miller's fighting century in the semi-final against New Zealand had no bearing on the match as South Africa crashed out of Champions Trophy on Wednesday, March 5. On Wednesday, Miller scored his 3rd 50+ score in an ICC ODI knockout match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-england-singles-india-stats-2689693-2025-03-06",
      "headline": "Virat Kohli is the third-highest ODI run-scorer for 'England'. Here's how Champions Trophy: Virat Kohli has scored more runs in singles than any other batter since January 2000. The 36-year-old is the fourth-highest run-scorer in the tournament with a top score of 100 not out.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-rachin-ravindra-beautiful-batting-tim-southee-2689732-2025-03-06",
      "headline": "Rachin Ravindra's batting is beautiful to watch: Southee hails 'gifted' NZ starFormer New Zealand captain Tim Southee hailed Rachin Ravindra as a \"gifted\" batter, praising his work ethic and hunger for improvement. Ravindra's 108-run semi-final knock played a crucial role in New Zealand's Champions Trophy final qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-steve-smith-retires-hug-2689727-2025-03-06",
      "headline": "Watch: Virat Kohli gives heartwarming hug to retiring Steve Smith Champions Trophy 2025: Virat Kohli and Steve Smith shared a heartwarming moment after India won the semi-final on Tuesday at the Dubai International Cricket Stadium. Smith retired from ODIs after the semi-final\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-relaxed-training-coach-brendon-mccullum-alastair-cook-2689684-2025-03-06",
      "headline": "Alaistar Cook slams 'relaxed' England under coach Brendon McCullumAlastair Cook questioned England's relaxed approach under Brendon McCullum, which adds to the criticism faced by the side after their Champions Trophy failure. With Jos Buttler stepping down, many England greats suggest a need to rethink their training philosophy to compete at the highest level again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mushfiqur-rahim-odi-retirement-career-stats-2689662-2025-03-06",
      "headline": "Mushfiqur Rahim, Bangladesh's Mr. Dependable retires: ODI career in numbersChampions Trophy 2025: Veteran wicketkeeper-batter Mushfiqur Rahim retired from ODI cricket as Bangladesh's most-capped player and second-highest run-scorer in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-vs-new-zealand-proud-of-effort-rob-walter-2689658-2025-03-06",
      "headline": "South Africa head coach proud of team's effort despite loss to New ZealandSouth Africa head coach Rob Walter commended his team's Champions Trophy campaign, emphasising that their semi-final loss to New Zealand does not overshadow their strong performances throughout the tournament. He urged fans to recognise their consistency despite one off-day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-rachin-ravindra-beautiful-batting-tim-southee-2689732-2025-03-06",
      "headline": "Rachin Ravindra's batting is beautiful to watch: Southee hails 'gifted' NZ starFormer New Zealand captain Tim Southee hailed Rachin Ravindra as a \"gifted\" batter, praising his work ethic and hunger for improvement. Ravindra's 108-run semi-final knock played a crucial role in New Zealand's Champions Trophy final qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-steve-smith-retires-hug-2689727-2025-03-06",
      "headline": "Watch: Virat Kohli gives heartwarming hug to retiring Steve Smith Champions Trophy 2025: Virat Kohli and Steve Smith shared a heartwarming moment after India won the semi-final on Tuesday at the Dubai International Cricket Stadium. Smith retired from ODIs after the semi-final\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-relaxed-training-coach-brendon-mccullum-alastair-cook-2689684-2025-03-06",
      "headline": "Alaistar Cook slams 'relaxed' England under coach Brendon McCullumAlastair Cook questioned England's relaxed approach under Brendon McCullum, which adds to the criticism faced by the side after their Champions Trophy failure. With Jos Buttler stepping down, many England greats suggest a need to rethink their training philosophy to compete at the highest level again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mushfiqur-rahim-odi-retirement-career-stats-2689662-2025-03-06",
      "headline": "Mushfiqur Rahim, Bangladesh's Mr. Dependable retires: ODI career in numbersChampions Trophy 2025: Veteran wicketkeeper-batter Mushfiqur Rahim retired from ODI cricket as Bangladesh's most-capped player and second-highest run-scorer in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-vs-new-zealand-proud-of-effort-rob-walter-2689658-2025-03-06",
      "headline": "South Africa head coach proud of team's effort despite loss to New ZealandSouth Africa head coach Rob Walter commended his team's Champions Trophy campaign, emphasising that their semi-final loss to New Zealand does not overshadow their strong performances throughout the tournament. He urged fans to recognise their consistency despite one off-day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-south-africa-rachin-ravindra-team-first-kane-williamson-2689650-2025-03-06",
      "headline": "Rachin Ravindra plays for the team first: Williamson on 'gifted' teammateKane Williamson praised Rachin Ravindra's match-winning century against South Africa in the Champions Trophy semi-final, highlighting the youngster's ability to play with both freedom and responsibility, which proved crucial in securing New Zealand's spot in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mushfiqur-rahim-bangladesh-odi-retirement-2689641-2025-03-06",
      "headline": "Mushfiqur Rahim retires from ODIs after forgettable Champions TrophyChampions Trophy: Veteran wicketkeeper Mushfiqur Rahim drew the curtains down on his ODI career after Bangladesh failed to qualify for the semi-final of the mega event in Pakistan and Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-icc-lieft-saliva-ban-reverse-swing-india-vs-new-zealand-2689637-2025-03-06",
      "headline": "Bring back reverse swing: Shami urges ICC to reconsider saliva ruleMohammed Shami called for ICC to lift the saliva ban, stressing its role in enabling reverse swing and adding excitement for bowlers, especially in ODIs, where rules have significantly reduced pacers' impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-last-ten-overs-semi-final-rob-walter-2689622-2025-03-06",
      "headline": "South Africa head coach rues 'last 10 overs' mishaps for New Zealand lossSouth Africa's ICC heartbreak continues as Rob Walter reflects on their semi-final defeat to New Zealand, citing poor death-over bowling, lack of key partnerships, and a slow start in the chase as decisive factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kane-williamson-dubai-advantage-final-2689602-2025-03-06",
      "headline": "New Zealand not looking closely at India's Dubai advantage: Kane WilliamsonKane Williamson remains unfazed by India's familiarity with Dubai conditions ahead of the Champions Trophy final, emphasising that New Zealand must focus on their own game rather than external factors beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06",
      "headline": "Toss already in New Zealand captain's mind ahead of Dubai finalNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rajeev-shukla-interacts-with-pakistani-press-in-lahore-2689558-2025-03-05",
      "headline": "Watch: Rajeev Shukla interacts with Pakistani press in LahoreBCCI vice president Rajeev Shukla interacted with the Pakistani press during his visit to Lahore to watch the second semi final of the ICC Champions Trophy 2025 between New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kane-williamson-dubai-advantage-final-2689602-2025-03-06",
      "headline": "New Zealand not looking closely at India's Dubai advantage: Kane WilliamsonKane Williamson remains unfazed by India's familiarity with Dubai conditions ahead of the Champions Trophy final, emphasising that New Zealand must focus on their own game rather than external factors beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06",
      "headline": "Toss already in New Zealand captain's mind ahead of Dubai finalNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rajeev-shukla-interacts-with-pakistani-press-in-lahore-2689558-2025-03-05",
      "headline": "Watch: Rajeev Shukla interacts with Pakistani press in LahoreBCCI vice president Rajeev Shukla interacted with the Pakistani press during his visit to Lahore to watch the second semi final of the ICC Champions Trophy 2025 between New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sunil-gavaskar-on-rohit-sharma-intent-gautam-gambhir-presser-2689553-2025-03-05",
      "headline": "Sunil Gavaskar disagrees with Gautam Gambhir over Rohit Sharma's batting approachChampions Trophy 2025: A day after head coach Gautam Gambhir defended Rohit Sharma's risk-laden batting approach, Sunil Gavaskar urged the India captain to reconsider it and spend more time at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-miller-fastest-hundred-in-champions-trophy-nz-vs-sa-2689552-2025-03-05",
      "headline": "Watch: David Miller celebrates bittersweet 67-ball hundred in South Africa's exitSouth Africa batter David Miller scored the fastest century in the history of ICC Champions Trophy during the second semi-final against New Zealand. He dedicated his hundred to his newborn baby with a special gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jason-gillespie-pakistan-coach-aaqib-javed-clown-2689550-2025-03-05",
      "headline": "Aaqib Javed a clown: Gillespie laughs at Pakistan coach's latest excuseFormer Pakistan Test team coach Jason Gillespie has hit out against his successor Aaqib Javed for his excuses after the Champions Trophy exit. Gillispie called Javed a clown and called the situation of the Pakistan team hilarious.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-south-africa-semi-final-rachin-kane-williamson-santner-2689531-2025-03-05",
      "headline": "Rachin special knocks South Africa out, sets up India vs New Zealand finalNew Zealand beat South Africa in the second semi final of the Champions Trophy to qualify for the summit clash against India. Rachin Ravindra and Kane Williamson were heroes for the Kiwis in their clinical show in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ct-dubai-icc-tournament-history-2689528-2025-03-05",
      "headline": "India, New Zealand to battle in Champions Trophy final after 25 years Champions Trophy 2025: New Zealand produced an all-round effort to outclass South Africa in the second semi-final in Lahore. New Zealand and India will meet in the final of an ICC white-ball tournament for the first time since 2000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-irked-by-pakistan-journalist-question-on-dubai-advantage-2689505-2025-03-05",
      "headline": "Pakistan journalist's question on 'Dubai advantage' irks Rajeev ShuklaBCCI vice president was seen getting irritated by a question from a Pakistan journalist about India's advantage while playing in Dubai in the ICC Champions Trophhy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-final-show-coldplay-tickets-2689491-2025-03-05",
      "headline": "Coldplay at World Cup 2026? FIFA president confirms half-time show in finalFIFA president Gianni Infantino has confirmed that the football World Cup 2026 will have a first of its kind halftime show in the final of the tournament. The FIFA World Cup will be jointly hosted by United States, Canada, and Mexico.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-watches-semi-final-with-pcb-chief-mohsin-naqvi-2689474-2025-03-05",
      "headline": "Rajeev Shukla watches Champions Trophy semi-final with PCB Chief Mohsin NaqviBCCI vice President Rajeev Shukla was spotted watching the second semi-final of the ICC Champions Trophy 2025 with PCB Chairman Mohsin Naqvi in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-india-vs-australia-interview-bcci-2689466-2025-03-05",
      "headline": "I just love batting: Kohli speaks from the heart in Champions Trophy interviewSenior India batter Virat Kohli gave a raw interview after India pulled off a nervy chase against Australia in the semi-final of the Champions Trophy 2025. Kohli said that as long as the joy of batting was there, other things just took care of themselves.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kl-rahuls-gesture-towards-pitch-invading-fan-ind-vs-aus-2689402-2025-03-05",
      "headline": "Watch: KL Rahul's kind gesture towards pitch-invading fan wins hearts Star India batter KL Rahul's gesture towards a pitch-invading fan after the semi final of the ICC Champions Trophy 2025 against Australia is being loved by the fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kane-williamson-15th-odi-hundred-ab-de-villiers-sa-vs-nz-2689381-2025-03-05",
      "headline": "SA vs NZ: Kane Williamson surpasses AB de Villiers after 15th ODI hundredNew Zealand batter Kane Williamson scored a magnificent century in the second semi-final of the ICC Champions Trophy 2025 against South Africa. He played a brilliant knock of 102 (94) smashing ten fours and two sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-semi-final-arshad-nadeem-brings-out-trophy-lahore-2689361-2025-03-05",
      "headline": "NZ vs SA: Olympic champion Arshad Nadeem brings out Champions Trophy before matchPakistan's Olympic champion Arshad Nadeem was the special guest as he brought out the Champions Trophy ahead of the semi-final between New Zealand and South Africa on Wednesday, March 5. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}