{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-steel-share-price-gains-five-session-expert-views-buy-hold-or-sell-2606867-2024-09-26",
      "headline": "Tata Steel shares gain for 5th straight session. What should investors do?In the past year, Tata Steel has rallied 28%, with an 18% gain so far in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-shares-surge-to-record-high-on-citis-buy-call-check-details-2606794-2024-09-26",
      "headline": "Trent shares surge to record high on Citi's 'buy' call. Check detailsCiti set a target price of Rs 9,250 for the stock, signaling a 21% upside from the previous closing price, and added it to its Pan-Asia high-conviction focus list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-conclave-puneet-chhatwal-eyes-top-3-spot-for-taj-hotels-in-global-hospitality-2606774-2024-09-26",
      "headline": "Puneet Chhatwal eyes top 3 spot for Taj Hotels in global hospitalityHe envisions the brand securing its place among the top three global hospitality companies in the next five years, a goal driven by Taj's ethos of service, adaptability to changing luxury trends, and a commitment to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-dal-chawal-investment-portfolio-2606746-2024-09-26",
      "headline": "80% of your portfolio should be 'Dal-Chawal': Radhika Gupta's investment mantraRadhika Gupta's message focused on the importance of disciplined, long-term investing—what she calls \"Dal-Chawal Investing\"—a simple and sustainable approach she believes will help investors navigate the market's highs and lows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-ipo-opens-review-price-band-gmp-should-you-subcribe-good-bad-2606728-2024-09-26",
      "headline": "Diffusion Engineers IPO opens for subscription: Should you subcribe?The price band for the IPO has been set between Rs 159 and Rs 168 per share. Investors can apply for a minimum lot of 88 shares, requiring a retail investment of Rs 14,784."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manba-finance-ipo-allotment-check-status-online-guide-listing-gain-gmp-today-subscription-2606695-2024-09-26",
      "headline": "Manba Finance IPO allotment: Check status, expected listing gain, subscriptionManba Finance IPO opened for subscription on September 23 and ran until September 25, generating huge bids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-ipo-details-market-valuation-nomura-maruti-suzuki-2606690-2024-09-26",
      "headline": "Hyundai Motors IPO: Can it beat Maruti Suzuki's market valuation?Hyundai, the second-largest automaker in India, has maintained a steady market share of 15-17% since 2008. But does it have what it takes to beat market leader Maruti Suzuki's valuation? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-26-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2606675-2024-09-26",
      "headline": "Gold, silver price today, September 26, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 26 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-record-high-as-rally-extends-for-5th-straight-session-2606654-2024-09-26",
      "headline": "Sensex, Nifty hit record high as rally extends for 5th straight sessionThe S&P BSE Sensex rose to an all-time high of 85,333.23 in early trade, while the NSE Nifty50 climbed to 26,056."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-to-swiggy-5-big-ipos-set-to-light-up-dalal-street-before-2024-ends-ntpc-ather-energy-hdb-2606435-2024-09-25",
      "headline": "Hyundai to Swiggy: 5 big IPOs set to light up Dalal Street before 2024 endsFrom Hyundai Motors' massive offering to Swiggy's much-anticipated debut, the year's final IPOs could be the most exciting ones yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-hit-record-high-as-power-financial-stock-drive-market-rally-2606268-2024-09-25",
      "headline": "Sensex, Nifty hit record high as power and financial stock drive market rallyThe S&P BSE Sensex added 255.83 points to end at 85,169.87, while the NSE Nifty50 gained 63.75 points to close at 26,004.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-sbi-uco-canara-jm-financial-brokerage-11-psu-bank-stocks-buying-opportunities-selloff-2606209-2024-09-25",
      "headline": "PNB, SBI, UCO: JM Financial lists 11 PSU bank stocks worth buying after selloffSince reaching its 52-week high, the PSU Bank index has dropped by 15%, with banks like UCO Bank, Bank of India (BOI), Indian Overseas Bank (IOB), and Union Bank of India seeing sharper declines of 25-30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-shares-plunge-20-to-record-low-block-deal-nishant-pitti-2606182-2024-09-25",
      "headline": "Easy Trip Planners shares plunge 20% to record low. Here's what happenedThe steep decline in share price was triggered by news that promoter Nishant Pitti plans to sell 15 crore shares, representing 8.5% of the company's total share capital, in a block deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-gujarat-see-lowest-youth-unemployment-kerala-struggles-2606173-2024-09-25",
      "headline": " Madhya Pradesh, Gujarat see lowest youth unemployment, Kerala strugglesMadhya Pradesh and Gujarat have emerged as the best performers, boasting the lowest youth unemployment rates, while Kerala struggles with one of the highest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coldplay-concert-ticket-mumbai-hotel-prices-surge-taj-jw-marriott-westin-2606167-2024-09-25",
      "headline": "Coldplay mania: Mumbai hotel rates up by 300% for concert weekendWith Coldplay set to perform at DY Patil Stadium on January 18-19 and 21, 2025, hotel prices in Mumbai have skyrocketed, which might leave fans scrambling for accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-upper-circuit-5-percent-52-week-high-explained-2606115-2024-09-25",
      "headline": "Explained: Why Reliance Power shares hit 5% upper circuit today Reliance Power stock: What's behind the fresh rally? Investors are buzzing as the company makes big moves—find out what's driving the surge.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitin-gadkari-pm-offer-opposition-india-today-conclave-bjp-rss-2607008-2024-09-26",
      "headline": "Nitin Gadkari clears air around Opposition's PM offer: Not my ambitionNitin Gadkari dismissed ambitions of holding the Prime Minister post, asserting his commitment to current duties and reaffirming loyalty to the BJP amid speculation of opposition offers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-bilkis-bano-case-convicts-remission-gujarat-government-2606951-2024-09-26",
      "headline": "Bilkis case: Top court rejects Gujarat's plea seeking review of 'adverse' remarksThe Supreme Court observed that there was no clear error in its January 8 order that overturned the remission granted to 11 convicts in the Bilkis Bano case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/paris-olympics-manu-bhaker-scooter-accident-2607035-2024-09-26",
      "headline": "Manu Bhaker recalls scooter accident a year before Paris Olympics  Manu Bhaker said that she had an accident last year in Paris while driving a scooter. Manu recently won two bronze medals in shooting for India in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-doesnt-want-you-to-watch-this-idf-israel-lebanon-weapon-stockpiles-2606983-2024-09-26",
      "headline": "'Hezbollah doesn't want you to watch this': Israel's big claims in new videoAs Israel intensifies its military operations against Hezbollah in Lebanon, a new video reveals the Iran-backed terror group's weapon stockpiles hidden within civilian areas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/navya-naveli-nanda-opens-up-about-handling-social-media-trolls-after-iim-admission-2606913-2024-09-26",
      "headline": "Navya Naveli Nanda opens up about handling social media trolls after IIM admissionNavya Naveli Nanda discusses handling social media trolls after her IIM Ahmedabad admission, emphasising the importance of constructive feedback. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-increases-minimum-wage-rates-workers-unorganised-sectors-2607009-2024-09-26",
      "headline": "Government increases minimum wage rates for workersThis revision marks the second wage adjustment for 2024, following the previous update in April. The government revises the VDA biannually, in April and October, based on fluctuations in the Consumer Price Index for industrial workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gaurav-gogoi-congress-pm-modi-manipur-unrest-northeast-geopolitical-importance-2607003-2024-09-26",
      "headline": "PM trying to broker peace in Ukraine, but what about Manipur, asks Gaurav GogoiSpeaking at the India Today Mumbai Conclave session, Gaurav Gogoi said that a hands-on approach is needed from PM Modi to resolve the ethnic conflict plaguing Manipur since May last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-badlapur-encounter-maharashtra-election-india-today-conclave-2606846-2024-09-26",
      "headline": "Will police clap if shot at? Devendra Fadnavis on Badlapur encounterSpeaking on the shooting of the Badlapur sexual assault accused, Maharashtra Deputy Chief Minister Devendra Fadnavis said glorification of such incidents should not happen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/body-roundness-index-the-new-standard-measure-health-bmi-2606883-2024-09-26",
      "headline": "What is body roundness index the new standard to measure health?A new metric called Body Roundness Index (BRI) is emerging as a more accurate measure of health risks compared to the traditional Body Mass Index (BMI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-lebanon-hezbollah-ceasfire-deal-netanyahu-un-hamas-war-2606855-2024-09-26",
      "headline": "Netanyahu orders troops to continue Lebanon op, his partners reject ceasefire callThe heaviest fighting in nearly two decades between Israel and the Iran-backed Hezbollah group has raised fears of a new Israeli ground offensive across the Lebanese-Israeli frontier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-joins-pakistan-saarc-revival-trade-india-against-muhammad-yunus-shehbaz-sharif-s-jaishankar-uri-attacks-2606844-2024-09-26",
      "headline": "Bangladesh seeks Pakistan help to revive Saarc, but why isn't India interestedMuhammad Yunus, the head Bangladesh's caretaker government, met Pakistan PM Shehbaz Sharif and sought help to revive Saarc, a south Asian grouping where India is the key player. Pakistan had also spoken about Saarc's revival, but India shot down the idea. This is why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-temple-priest-girl-sexual-assault-pocso-case-theni-2606874-2024-09-26",
      "headline": "Tamil Nadu priest, 70, arrested for sexually assaulting girl inside templeThe children were playing outside the temple when the priest allegedly lured them offering sweets and then sexually assaulted a girl."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-reveals-3-reasons-why-she-shifted-base-to-india-in-new-video-2606818-2024-09-26",
      "headline": "US woman reveals 3 reasons why she shifted to India in new videoKristen Fischer, a US woman who shifted to Delhi two years ago, has revealed three reasons why she chose India as her new home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-mother-sumedha-bhaker-paris-olympics-2024-jaspal-rana-2607022-2024-09-26",
      "headline": "Manu Bhaker reveals how strict mother keeps her focussed on goalsIndia shooter Manu Bhaker revealed how strict her mother keeps her disciplined in life. Bhaker etched her name in history books by becoming just the second Indian to win two medals in a single edition of Olympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/pm-modi-inaugurates-param-rudra-supercomputer-to-enhance-weather-climate-computing-2606952-2024-09-26",
      "headline": "PM Modi launches Param Rudra supercomputers for climate computingPM Modi inaugurates Param Rudra Supercomputer to enhance weather, climate computing"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-durga-puja-holidays-no-idol-immersion-islamists-in-bangladesh-warn-hindus-2606912-2024-09-26",
      "headline": "No Durga Puja holidays, no idol immersion, Islamists in Bangladesh warn HindusAn organisation called Insaf Keemkari Chhatra-Janta staged a protest in Dhaka, holding placards in Bangla that read: \"no worship everywhere by closing roads, no pollution to water by idol immersion, no worship to idol\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/edward-bausch-of-bausch-and-lomb-microscopes-optical-instruments-contact-lens-innovator-2606668-2024-09-26",
      "headline": "Who's the Bausch in Bausch & Lomb? Let's see clearlyEdward Bausch transformed the world of optics with groundbreaking inventions like the iris diaphragm shutter and advanced microscopes. His vision and leadership propelled Bausch & Lomb into a global powerhouse, leaving an enduring mark on both science and photography."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/inside-sarco-suicide-pod-switzerland-american-woman-death-2606709-2024-09-26",
      "headline": "Inside Doctor Death's 'suicide pod' that has sparked an ethics debateThe futuristic-looking capsule has sparked a global debate on ethics after an American woman became the first person to use the pod to end her life."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-army-officer-fiancee-custodial-assault-bharatpur-police-destroying-evidence-2606930-2024-09-26",
      "headline": "Odisha custodial assault: Army officer, fiancée accuse cops of destroying proofIn their complaint, the Army officer and his fiancée claimed that a ritual was performed, and the police station was thoroughly washed to destroy critical evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-unrestricted-permission-cbi-withdrawn-probing-criminal-cases-muda-siddaramaiah-2606894-2024-09-26",
      "headline": "Karnataka withdraws general consent to CBI as BJP demands probe in MUDA caseIn an apparent move to prevent potential CBI interference against Chief Minister Siddaramaiah, the Karnataka Cabinet decided to withdraw permission for the central agency to conduct investigations in the state. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-dutta-shares-horrendous-experience-with-indigo-after-flight-cancellation-2606790-2024-09-26",
      "headline": "Actor Divya Dutta shares 'horrendous experience' with IndiGo after flight cancellationActor Divya Dutta slammed IndiGo for cancelling her flight without prior notification. The actor shared her distressing experience on social media and vented out her frustration in a lengthy note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-bollywood-dreams-ananya-pander-kim-yeji-assasin-2607027-2024-09-26",
      "headline": "Is Manu Bhaker interested in Bollywood debut? Olympic star reveals acting goalSpeaking at Conclave Mumbai 2024, Manu Bhaker responded to the idea of her making her acting debut in Bollywood. The double Olympic medalist also said she doesn't want a biopic made on her career before she wins more Olympic medals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/pigeons-menace-dropping-feathers-health-hazard-lung-diseases-2606803-2024-09-26",
      "headline": "Pigeon menace: A health hazard thriving in plain sightFeeding pigeons, a common practice in India, can lead to severe lung diseases due to exposure to their droppings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-shafali-verma-inspired-by-rohit-sharmas-powerplay-heroics-2606948-2024-09-26",
      "headline": "Women's T20 World Cup: Shafali inspired by Rohit Sharma's powerplay heroicsShafali Verma said that he was inspired by Rohit Sharma's attacking style of play inside the power play. She will take part in India's campaign at the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/navya-naveli-to-saif-ali-khan-celebs-at-india-today-conclave-mumbai-2024-day-2-2607073-2024-09-26",
      "headline": "Navya Naveli to Saif Ali Khan, celebs at India Today Conclave Mumbai 2024 Day 2Navya Naveli Nanda, Rakesh Chaurasia, and Saif Ali Khan were among the prominent celebrities who attended Day 2 of the India Today Conclave Mumbai 2024. The event featured insightful discussions on various topics, with the stars sharing their perspectives on culture, music, and the film industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/aishwarya-rai-daughter-aaradhya-leave-for-iifa-2024-2607049-2024-09-26",
      "headline": "Video: Aishwarya Rai, daughter Aaradhya leave for IIFA 2024Aishwarya Rai was clicked with her daughter Aaradhya Bachchan at the airport today. The mother-daughter duo are off to Yas Island to attend IIFA 2024, which will be a three-day affair, running from September 27 to September 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-karan-johar-stars-charging-huge-amount-cant-guarantee-hits-2607047-2024-09-26",
      "headline": "Saif Ali Khan addresses Karan Johar's 'stars can't guarantee hits' commentSaif Ali Khan discussed the sustainability of high salaries of actors in the film industry at India Today Mumbai Conclave 2024, while responding to Karan Johar's remarks on the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-on-telugu-cinema-devara-jr-ntr-heroes-like-gods-2607040-2024-09-26",
      "headline": "Saif Ali Khan on Telugu cinema: They treat their heroes like godsBollywood star Saif Ali Khan opened up about working in Telugu cinema and his upcoming release, Devara, at India Today Mumbai Conclave 2024. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/video/manu-bhaker-jaspal-rana-paris-olympics-2024-sumedha-bhaker-2607069-2024-09-26",
      "headline": "Conclave Mumbai: Manu Bhaker shoots gold in rapid fire roundIndia shooter Manu Bhaker was put in the spotlight for a rapid fire round at the India Today Conclave in Mumbai where she opened up on her second favourite sport, her alternate profession and her admiration for MS Dhoni: The Untold Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/liam-lawson-daniel-ricciardo-rb-f1-season-2607065-2024-09-26",
      "headline": "Liam Lawson to replace Daniel Ricciardo at RB for rest of F1 seasonNew Zealander Liam Lawson will take over from Australian Daniel Ricciardo for the final six races of the Formula One season, as announced by the Red Bull-owned RB team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-virat-kohli-ms-dhoni-rohit-sharma-ipl-2607062-2024-09-26",
      "headline": "Yuvraj Singh smartly dodges controversial Virat-Dhoni question with witty answerFormer India all-rounder Yuvraj Singh dodged a controversial question when he was asked to choose between Virat Kohli and MS Dhoni. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shakib-al-hasan-unbeatable-india-pitches-2607051-2024-09-26",
      "headline": "Pitches don't matter against teams like India: Shakib Al Hasan IND vs BAN: Shakib Al Hasan said that Bangladesh need to put in a better before if they are to make a comeback in the second Test against India at the Green Park in Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/manu-bhaker-bollywood-jaspal-rana-paris-olympics-2024-sumedha-bhaker-2607046-2024-09-26",
      "headline": " Let my biopic wait: Manu Bhaker hungry for more success after Paris glory Manu Bhaker and her coach Jaspal Rana recalled the road to Olympic glory in a freewheeling chat with India Today Consulting Editor, Nikhil Naz, at Conclave Mumbai 2024. From talking about social media trolls to revealing her Bollywood dreams, the double Olympic medalist kept the audience engaged. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-tests-shakib-al-hasan-new-era-video-2607044-2024-09-26",
      "headline": "Bangladesh cricket enters new era as Shakib retires from Tests, T20IsIND vs BAN: Bangladesh all-rounder Shakib Al Hasan announced his retirement from T20Is and Tests. He put forth his decision prior to the Tigers' second Test against India, starting September 27 at the Green Park in Kanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-2nd-test-day-1-dinesh-chandimal-kamindu-mendis-angelo-mathews-2607039-2024-09-26",
      "headline": "2nd Test: Chandimal 116, Kamindu world record help  Sri Lanka dominate Day 1Sri Lanka vs New Zealand, 2nd Test: Sri Lanka dominated the opening day in Galle, riding on Dinesh Chandimal's hundred and solid fifties from Angelo Mathews and Kamindu Mendis. Sri Lanka are leading the 2-match series 1-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/paris-olympics-manu-bhaker-scooter-accident-2607035-2024-09-26",
      "headline": "Manu Bhaker recalls scooter accident a year before Paris Olympics  Manu Bhaker said that she had an accident last year in Paris while driving a scooter. Manu recently won two bronze medals in shooting for India in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-mother-sumedha-bhaker-paris-olympics-2024-jaspal-rana-2607022-2024-09-26",
      "headline": "Manu Bhaker reveals how strict mother keeps her focussed on goalsIndia shooter Manu Bhaker revealed how strict her mother keeps her disciplined in life. Bhaker etched her name in history books by becoming just the second Indian to win two medals in a single edition of Olympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-conclave-mumbai-2024-trolls-social-media-medals-jaspal-rana-2607010-2024-09-26",
      "headline": "Nothing wrong in Manu Bhaker showing off her Olympic medals: Coach Jaspal RanaSpeaking at Conclave Mumbai 2024, shooter Manu Bhaker responded to social media trolls, explaining why she attended felicitation ceremonies with her medals. Her coach Jaspal Rana lashed out at detractors, saying the young shooter worked hard to win them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shakib-al-hasan-retirement-feature-2606972-2024-09-26",
      "headline": "Shakib chooses to die a hero, not live long enough to become a villain IND vs BAN: Shakib Al Hasan will no longer be playing T20Is for Bangladesh and will also retire from Test cricket. The 37-year-old, however, will continue playing ODIs for the Tigers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-2nd-test-day-1-dinesh-chandimal-kamindu-mendis-angelo-mathews-2607039-2024-09-26",
      "headline": "2nd Test: Chandimal 116, Kamindu world record help  Sri Lanka dominate Day 1Sri Lanka vs New Zealand, 2nd Test: Sri Lanka dominated the opening day in Galle, riding on Dinesh Chandimal's hundred and solid fifties from Angelo Mathews and Kamindu Mendis. Sri Lanka are leading the 2-match series 1-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/paris-olympics-manu-bhaker-scooter-accident-2607035-2024-09-26",
      "headline": "Manu Bhaker recalls scooter accident a year before Paris Olympics  Manu Bhaker said that she had an accident last year in Paris while driving a scooter. Manu recently won two bronze medals in shooting for India in the Paris Olympics 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-mother-sumedha-bhaker-paris-olympics-2024-jaspal-rana-2607022-2024-09-26",
      "headline": "Manu Bhaker reveals how strict mother keeps her focussed on goalsIndia shooter Manu Bhaker revealed how strict her mother keeps her disciplined in life. Bhaker etched her name in history books by becoming just the second Indian to win two medals in a single edition of Olympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-conclave-mumbai-2024-trolls-social-media-medals-jaspal-rana-2607010-2024-09-26",
      "headline": "Nothing wrong in Manu Bhaker showing off her Olympic medals: Coach Jaspal RanaSpeaking at Conclave Mumbai 2024, shooter Manu Bhaker responded to social media trolls, explaining why she attended felicitation ceremonies with her medals. Her coach Jaspal Rana lashed out at detractors, saying the young shooter worked hard to win them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shakib-al-hasan-retirement-feature-2606972-2024-09-26",
      "headline": "Shakib chooses to die a hero, not live long enough to become a villain IND vs BAN: Shakib Al Hasan will no longer be playing T20Is for Bangladesh and will also retire from Test cricket. The 37-year-old, however, will continue playing ODIs for the Tigers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-test-cricket-return-india-tour-of-australia-hanuma-vihari-2606984-2024-09-26",
      "headline": "If Hardik Pandya is eyeing Test return, it's good news for India: Hanuma VihariHardik Pandya needs to return to domestic red-ball cricket and play a couple of Ranji Trophy matches if he is harbouring hopes of coming back to Test cricket, according to Hanuma Vihari. The all-rounder has not played Tests since August 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zaheer-khan-akash-deep-border-gavaskar-trophy-2024-25-aus-vs-ind-2606976-2024-09-26",
      "headline": "Zaheer Khan backs Akash Deep to be India's third seamer in Australia Test seriesFormer India fast bowler Zaheer Khan has backed Akash Deep to be India's third seamer in the upcoming Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/grateful-smriti-mandhana-wpl-2024-shreyanka-patil-exclusive-interview-2606964-2024-09-26",
      "headline": "Grateful to Smriti Mandhana for supporting me in WPL 2024: Shreyanka Patil  In an exclusive interview with India Today, Shreyanka Patil thanked Smriti Mandhana for backing her when she was struggling for form in WPL 2024. Shreyanka won the Purple Cap as RCB won the title for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-playing-xi-kuldeep-yadav-axar-patel-2606892-2024-09-26",
      "headline": "2nd Test Predicted XI: Will Kuldeep Yadav replace Akash Deep? IND vs BAN, 2nd Test: Given the pitch and conditions in Kanpur, India might give either Axar Patel or Kuldeep Yadav a chance in the second Test in place of Akash Deep. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-shafali-verma-inspired-by-rohit-sharmas-powerplay-heroics-2606948-2024-09-26",
      "headline": "Women's T20 World Cup: Shafali inspired by Rohit Sharma's powerplay heroicsShafali Verma said that he was inspired by Rohit Sharma's attacking style of play inside the power play. She will take part in India's campaign at the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-bollywood-girlfriend-boirder-gavaskar-trophy-2007-08-2606946-2024-09-26",
      "headline": "When Yuvraj Singh wore his Bollywood actor girlfriend's shoes to Indian team busFormer India cricketer Yuvraj Singh recently shared a hilarious story from his playing days when his Bollywood actor girlfriend made him wear her shoes on the team India bus.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-australia-tests-no-6-2606937-2024-09-26",
      "headline": "With KL Rahul at No. 6, India looking at bigger picture in Tests: Hanuma VihariHanuma Vihari believes KL Rahul's spot at No. 6 is part of a larger strategy for India's tour of Australia, citing Rahul's strong performances in SENA countries (South Africa, England, New Zealand, and Australia). Despite an underwhelming return to Test cricket after seven months, the team management values his experience in challenging conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dc-ipl-2025-fake-news-rcb-virat-kohli-2606901-2024-09-26",
      "headline": "IPL 2025: Rishabh Pant slams fan for 'fake news' over potential move to RCBRishabh Pant slammed X user for spreading fake news about him approaching to join RCB for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-shafali-verma-inspired-by-rohit-sharmas-powerplay-heroics-2606948-2024-09-26",
      "headline": "Women's T20 World Cup: Shafali inspired by Rohit Sharma's powerplay heroicsShafali Verma said that he was inspired by Rohit Sharma's attacking style of play inside the power play. She will take part in India's campaign at the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-bollywood-girlfriend-boirder-gavaskar-trophy-2007-08-2606946-2024-09-26",
      "headline": "When Yuvraj Singh wore his Bollywood actor girlfriend's shoes to Indian team busFormer India cricketer Yuvraj Singh recently shared a hilarious story from his playing days when his Bollywood actor girlfriend made him wear her shoes on the team India bus.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-australia-tests-no-6-2606937-2024-09-26",
      "headline": "With KL Rahul at No. 6, India looking at bigger picture in Tests: Hanuma VihariHanuma Vihari believes KL Rahul's spot at No. 6 is part of a larger strategy for India's tour of Australia, citing Rahul's strong performances in SENA countries (South Africa, England, New Zealand, and Australia). Despite an underwhelming return to Test cricket after seven months, the team management values his experience in challenging conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dc-ipl-2025-fake-news-rcb-virat-kohli-2606901-2024-09-26",
      "headline": "IPL 2025: Rishabh Pant slams fan for 'fake news' over potential move to RCBRishabh Pant slammed X user for spreading fake news about him approaching to join RCB for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-chandimal-sl-vs-nz-2nd-test-dimuth-karunaratne-galle-2606871-2024-09-26",
      "headline": "SL vs NZ: Dinesh Chandimal continues love affair with Galle with 6th Test hundredStar Sri Lanka batter Dinesh Chandimal brought up his maiden Test hundred against New Zealand on Day 1 of the second Test at Galle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-playing-xi-kanpur-test-pitch-conditions-abhishek-nayar-press-conference-2606863-2024-09-26",
      "headline": "India will select playing XI for Kanpur Test based on conditions: Abhishek NayarIND vs BAN: Batting coach Abhishek Nayar said that India will select their playing XI for the second Test against Bangladesh in Kanpur only after looking at the pitch and playing conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-bowls-spin-to-shubman-gill-in-kanpur-tagdi-practice-karwayi-2606838-2024-09-26",
      "headline": "Rishabh Pant bowls spin to Shubman Gill in Kanpur: Tagdi practice karwayiRishabh Pant rolled his arm over to bowl spin at Shubman Gill in a video posted by the BCCI. Gill also admitted that Rishabh Pant gave him good practice during the training session in Kanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kl-rahul-test-career-assistant-coach-abhishek-nayar-2606819-2024-09-26",
      "headline": "Hopeful Rahul's Test career will have a turnaround: Assistant coach NayarIndia assistant coach Abhishek Nayar backed senior batter KL Rahul to regain his form during the Kanpur Test against Bangladesh. Rahul aims to return to form in the Kanpur Test against Bangladesh after a lackluster performance in Chennai."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}