{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-600-ton-airlift-india-to-us-amid-trump-tariff-china-import-why-reason-explained-2707997-2025-04-12",
      "headline": "Why is Apple in a race against time to fly iPhones back to the US?Apple's long-term goal is to reduce its dependence on Chinese factories and shift more production to other countries, with India playing a big part in that plan.  However, it relies heavily on a network of suppliers and trained workers that only exists at the required scale in parts of Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-whatsapp-channel-qr-code-number-heres-how-to-access-banking-digital-safety-2707973-2025-04-12",
      "headline": "RBI launches WhatsApp Channel: Here's how to access it via QR codeThe RBI said that the goal of the WhatsApp channel is to provide verified and timely information about banking, digital safety, and other important topics directly to users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pentagon-ends-5-billion-contracts-accenture-deloitte-pete-hegseth-2707949-2025-04-12",
      "headline": "Pentagon cuts $5.1 billion contracts with Accenture, Deloitte: Wasteful spendingThe contracts appeared to be wide-ranging cuts to consulting services for the Navy, the Air Force, the Defense Advanced Research Projects Agency (DARPA) and the Defense Health Agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-bounces-back-after-wild-week-fueled-by-tariff-war-2707818-2025-04-12",
      "headline": "Wall Street bounces back after wild week fueled by tariff warAll three major US indexes ended the session sharply higher after assurances from Boston Federal Reserve President Susan Collins that the Fed is prepared to keep financial markets functioning should the need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-pushing-trade-deals-with-us-eu-with-high-urgency-s-jaishankar-trump-tariffs-2707776-2025-04-11",
      "headline": "India pushing for trade deals with US, EU with high urgency: JaishankarOn Wednesday, Trump announced a 90-day pause on his sweeping tariffs on all countries, except China as countries around the world wilted under the impact of the seismic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-trump-tariffs-could-make-iphones-cars-and-clothes-in-the-us-2707519-2025-04-11",
      "headline": "How Trump tariffs could make iPhones, cars, and clothes costlier in the USTrump's latest plan includes a massive 145% tax on goods coming from China. Experts say this could end the long run of cheap, imported goods that Americans have enjoyed for decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-1300-points-higher-nifty-above-22500-tata-steel-up-5-percent-metal-stocks-gain-2707506-2025-04-11",
      "headline": "Sensex ends 1,300 points higher, Nifty above 22,500; Tata Steel up 5%The S&P BSE Sensex jumped 1,310.11 points to close at 75,157.26, while the NSE Nifty50 added 429.40 points to end at 22,828.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-sip-vs-ppf-what-rs-1-lakh-a-year-can-earn-in-15-years-2707471-2025-04-11",
      "headline": "Mutual fund SIP vs PPF: What Rs 1 lakh a year can earn in 15 yearsPPF is a government scheme with a current interest rate of around 7.1% per annum. On the other hand, SIPs typically offer higher interest when invested over the long term, especially in equity mutual funds. But they carry some risk, as returns depend on the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muthoot-finance-share-price-fall-over-8-percent-today-manappuram-finance-iifl-finance-stock-low-rbi-rules-2707451-2025-04-11",
      "headline": "Explained: Why Muthoot Finance shares fell over 8% todayMuthoot Finance stock price: Muthoot Finance, one of India's largest gold loan companies, has seen its share price decline by 14% in the past five trading sessions. The stock is also down 7% over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-amfi-data-march-2025-sips-decrease-reason-trump-tariff-global-uncertainty-2707415-2025-04-11",
      "headline": "Mutual fund inflows hit in March. Trump tariffs to blame?The largest outflows were seen in debt mutual funds, where investors pulled out Rs 2.02 lakh crore, possibly due to end-of-year financial needs by institutions and ongoing global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-money-advice-no-shortcuts-to-getting-rich-it-takes-good-habits-and-patience-2707411-2025-04-11",
      "headline": "Zerodha CEO Nithin Kamath's money advice: 'No shortcuts to getting rich'Nithin Kamath shared a video with a powerful message—earning more doesn't mean you're saving more. In fact, higher income often leads to more spending on gadgets, clothes, dining out, or things meant just to impress others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-china-trade-war-lower-loan-emis-repo-rate-rbi-explained-2707412-2025-04-11",
      "headline": "Trump tariffs, trade war fears could bring your loan EMIs down further this yearBorrowers could emerge as the unexpected winners if global headwinds linger and domestic growth slows further, with the RBI likely to step in again to lower the key interest rates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-rally-today-sensex-nifty-defy-wall-street-crash-key-reasons-retail-investors-need-to-know-2707375-2025-04-11",
      "headline": "Wall Street crashes, Dalal Street rallies: 5 things investors should knowStock market today: Dalal Street's leading indices rallied sharply, defying a global sell-off sparked by Wall Street's overnight crash. Here are the key factors behind today's stock market rally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amfi-data-mutual-fund-inflows-drop-march-2025-rs-4221-crore-global-uncertainty-2707374-2025-04-11",
      "headline": "Mutual fund inflows fall for March by Rs 4,221 crore, shows AMFI dataEquity mutual fund inflows dropped by Rs 4,221 crore in March, falling to Rs 25,082 crore from Rs 29,303 crore in February 2025, as per data released by the Association of Mutual Funds in India (AMFI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-share-price-down-q4-results-brokerage-ratings-price-targets-key-details-2707333-2025-04-11",
      "headline": "TCS shares fall after disappointing Q4. Check latest price targetsTCS share price: Despite a muted Q4, brokerages back TCS with revised targets, betting on deal wins, margin levers, and recovery prospects to drive medium-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-nifty-bull-run-3-things-investors-should-know-2707317-2025-04-11",
      "headline": "Sensex jumps 1,400 points: 3 things to know about Dalal Street rallyShare market today: A surprise rally may have lit up the screens, but with volatility still lurking and trade risks unresolved, investors would do well to tread carefully through this temporary pocket of optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-surges-1000-points-nifty-above-22500-dalal-street-90-day-tariff-pause-pharma-stocks-rise-2707297-2025-04-11",
      "headline": "Sensex up by 1,300 points, Nifty above 22,500 as markets cheer tariff pauseStock market today: The S&P BSE Sensex surged 1,353.59 points to 75,200.74, while the NSE Nifty 50 gained 443.70 points to 22,842.85 as of 9:43 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-to-open-higher-90-day-pause-us-tariffs-what-to-expect-2707292-2025-04-11",
      "headline": "Stock market today: Will Sensex, Nifty open higher on 90-day pause on tariffs?Sensex, Nifty today: Early signs suggest a positive start. Gift Nifty futures were trading at 22,933.5 at 8:20 am, showing a 2.5% jump from Nifty 50's Wednesday close of 22,399.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-salary-hike-news-top-delay-in-payout-top-management-global-uncertainty-2707281-2025-04-11",
      "headline": "TCS to delay salary hike? Check what top management said after Q4 resultsTCS reported a net profit of Rs 12,224 crore for the fourth quarter of FY25. This is a 1.7% drop compared to Rs 12,434 crore reported in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-april-11-shares-in-focus-today-sensex-nifty-nse-bse-tcs-accenture-deloitte-tata-steel-bhel-2707268-2025-04-11",
      "headline": "Stocks to watch on April 11: TCS, Accenture, Deloitte, Tata Steel, BHELKey stocks to watch in today's trade include shares of TCS, Accenture, Deloitte, Tata Steel, BHEL Sun Pharma, Bharti Hexacom due to various news developments and third quarter results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-tops-fdi-confidence-index-for-third-consecutive-year-india-slips-to-5th-glbs-2707242-2025-04-11",
      "headline": "China tops FDI Confidence Index for third consecutive year, India slips to 5thChina has reaffirmed its position as one of the world's leading FDI hubs in the top 10 for four years and number one emerging market for three years. Despite global tensions, investors remain optimistic, with India ranking 5th among emerging markets in 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-dive-as-euphoria-on-wall-street-reverts-to-fear-about-us-china-trade-war-2707236-2025-04-11",
      "headline": "US stocks dive as euphoria on Wall Street reverts to fear about US-China trade warUS stocks declined on Thursday after making historic gains a day earlier amid tensions between Washington and Beijing over tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-26-per-cent-additional-tariffs-on-india-suspended-till-july-9-white-house-2707174-2025-04-10",
      "headline": "Trump's 26% additional tariffs on India suspended till July 9: White HouseOn April 2, US President Donald Trump slapped universal duties on about 60 countries exporting goods to America and additional steep levies on countries like India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dalal-street-cash-in-on-trump-90-day-tariff-break-indian-stock-market-us-stocks-china-125-percent-tariff-2707047-2025-04-10",
      "headline": "Will Dalal Street cash in on Trump's 90-day tariff timeout?The US President's unexpected decision to announce a 90-day pause on reciprocal tariffs—with China being the notable exception—has reignited global risk appetite. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/italy-prada-agrees-to-buy-fashion-rival-versace-2707066-2025-04-10",
      "headline": "Italy's Prada agrees to buy fashion rival Versace in nearly $1.4 billion dealThe price Prada has agreed to pay for Versace is a big discount to the roughly USD 2.15 billion including debt that Capri paid for Versace in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-profit-falls-2-to-rs-12224-crore-final-dividend-at-rs-30-2706982-2025-04-10",
      "headline": "TCS Q4 Results: Profit falls 2% to Rs 12,224 crore, final dividend at Rs 30TCS ends FY25 with strong deal wins but earnings miss estimates, capping a tough year for the IT giant as macro headwinds and weak discretionary spending weigh on profit growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-introduces-face-authentication-for-uan-generation-know-details-2706972-2025-04-10",
      "headline": "EPFO introduces face authentication for UAN generation. Know detailsNow, both employers and employees can generate a UAN by simply using facial recognition via the government's UMANG app. This is expected to solve common problems such as incorrect personal details or missing mobile numbers, which often delayed UAN generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-airlifts-600-tons-of-iphones-from-india-to-dodge-trumps-china-tariffs-report-2706960-2025-04-10",
      "headline": "Apple airlifts 600 tons of iPhones from India to dodge Trump's China tariffsThe devices were flown out of the Chennai airport in the southern state of Tamil Nadu, where Apple has been building up production through its manufacturing partners like Foxconn and Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q4-results-dividend-announcement-today-april-9-what-to-expect-growth-us-tariff-2706944-2025-04-10",
      "headline": "TCS Q4 results to be announced today: What to expect from the IT firm?Investors and market watchers are expecting a mixed performance from the IT major. Key focus areas include operating margins, revenue growth, deal wins, employee attrition, and management commentary on guidance for the year ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-jokes-about-trump-tariffs-bring-paracetamol-and-iphone-2706925-2025-04-10",
      "headline": "Sanjeev Sanyal says tariff-hit NRI relatives calling to ask for paracetamol, iPhonesDonald Trump has hinted at imposing new tariffs on pharmaceuticals, a move that could raise costs for Indian pharmaceutical companies. This would make Indian-made generic drugs more expensive for both Americans and Indian consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-donald-trump-tariff-90-day-pause-usd-500-billion-opportunity-2706882-2025-04-10",
      "headline": "90 days, $500 billion, one big shot: India's trade gamble in Trump's tariff pauseThe pause in tariffs is seen in New Delhi as more than just goodwill; it's strategic. By sparing countries like India, the US appears to be isolating China in what is shaping up to be the most aggressive round of trade hostilities since the Covid-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-trade-war-tariff-125-percent-what-it-means-for-india-and-world-global-market-2706864-2025-04-10",
      "headline": "Explained: What US-China trade war means for India and the worldWith tariffs flying thick and fast, supply chains unravelling, and geopolitical tensions rising, India, like much of the world, finds itself watching, waiting, and bracing for impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-jumps-over-6-percent-after-donald-trump-90-day-tariff-break-ethereum-xrp-cardano-solana-dogecoin-shiba-inu-witness-price-rally-2706858-2025-04-10",
      "headline": "Bitcoin jumps over 6% after Trump's 90-day tariff break; Ethereum, XRP rallyBitcoin, along with other major cryptos like Ethereum, XRP, Cardano, Solana, and Dogecoin, etc., are witnessing a surge in their prices post US President Donald Trump's announcement of a 90-day pause on new tariff hikes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-on-potential-market-crash-investors-may-stay-away-for-years-2706820-2025-04-10",
      "headline": "Zerodha CEO Nithin Kamath on market crash: 'Investors may stay away for years'In 2008, the global market took a major hit with the collapse of Lehman Brothers, a global financial services firm and one of the largest investment banks in the US, causing a ripple effect around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tweet-great-time-to-buy-stock-market-advice-global-market-rally-90-day-pause-tariff-2706794-2025-04-10",
      "headline": "Should stock market investors take Donald Trump's 'buy' tip seriously?From aggressive tariffs on China to sudden pauses and vague reassurances, the whiplash is real and investors are feeling it. Markets bleed one day and bounce back the next, all thanks to a tweet or a policy pivot from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-repo-rate-by-25-basis-points-banks-passing-them-on-home-loan-cheaper-emis-low-2706783-2025-04-10",
      "headline": "RBI is cutting key rates, but are banks passing them on?RBI announced a cut in the repo rate by 25 basis points, bringing it down to 6% on Wednesday. The decision was made after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, finished its three-day meeting which started on April 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-currency-yuan-falls-17-year-low-donald-trump-us-tariff-125-percent-2706769-2025-04-10",
      "headline": "China's Yuan falls to 17-year low after Trump tariffs kick inThe decline in Yuan comes as a trade war between the world's two largest economies escalates. US President Donald Trump's \"reciprocal\" tariffs on dozens of countries took effect on Wednesday, including massive 104% duties on Chinese goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-market-wall-street-nikkei-jump-donald-trump-hits-pause-90-days-on-reciprocal-tariffs-2706732-2025-04-10",
      "headline": "Global markets jump as Donald Trump hits pause on tariffsGlobal markets rise: The S&P 500 and the Nasdaq saw their biggest daily percentage rises in over 10 years, adding over $1.5 trillion in market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-stock-market-close-holiday-mahavir-jayanti-sensex-nifty-no-trading-nse-bse-global-market-2706727-2025-04-10",
      "headline": "Mahavir Jayanti holiday: Are Sensex and Nifty open for trading today?Stock market holiday: According to the official stock market holiday list, Mahavir Jayanti is one of three holidays in April. The other two are on April 14 for Dr Baba Saheb Ambedkar Jayanti and April 18 for Good Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/msc-turkiye-world-biggest-green-cargo-ship-docks-at-adani-vizhinjam-port-2706724-2025-04-10",
      "headline": "World's biggest green cargo ship, MSC Turkiye docks at Adani's Vizhinjam PortMSC Turkiye: The vessel is 399.9 metres long, 61.3 metres wide, and has a depth of 33.5 metres. It has the capacity to carry 24,346 twenty-foot equivalent units (TEUs), making it one of the largest container ships ever built."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mouni-roy-breaks-silence-plastic-surgery-rumours-trolling-2708339-2025-04-13",
      "headline": "Actor Mouni Roy breaks silence on plastic surgery rumours and brutal trollingActor Mouni Roy has been trolled after reports of her getting plastic surgery surfaced. She broke her silence on the relentless trolling at a recent event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-fans-slam-actor-denied-photos-and-autographs-us-rude-imposter-2708309-2025-04-13",
      "headline": "Hrithik Roshan's fans slam actor after being denied photos and autographs in USHrithik Roshan's fans slammed the actor after he denied photos and autographs at the US event. An honest feedback from a fan who attended the event has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-day-3-sunny-deols-film-rakes-in-rs-25-crore-in-india-2708297-2025-04-13",
      "headline": "Jaat box office Day 3: Sunny Deol's film rakes in Rs 25 crore in IndiaSunny Deol's recently released film 'Jaat' earned over Rs 25 crore in India in three days. The film has been receiving mixed reviews from all quarters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-adorable-gesture-for-young-fan-wins-the-internet-watch-2708292-2025-04-13",
      "headline": "Salman Khan's adorable gesture for young fan wins the internet. WatchSalman Khan's adorable gesture for a young fan has gone viral. In the clip, the actor obliged the little one with a picture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-salman-khan-statement-about-actor-insecurity-self-criticism-jaat-2708284-2025-04-13",
      "headline": "Sunny Deol's weighs in on Salman Khan's statement about actors' insecuritySunny Deol, while promoting his film 'Jaat' in the national capital, discussed the issue of actor insecurity, a topic recently highlighted by Salman Khan. Deol expressed that insecurity is a natural part of an actor's growth journey and can serve as a stepping stone rather than a hindrance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/phule-actor-pratik-gandhi-appeals-brahmin-community-amid-release-delay-patralekhaa-2708279-2025-04-13",
      "headline": "First watch movie then..: Phule actor Pratik Gandhi's appeal as row delays releasePratik Gandhi's upcoming film, 'Phule', has been postponed. In an interview, the actor urged the Brahmin community not to form opinions about the film based solely on the trailer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-girlfriend-gauri-spratt-hold-hands-public-appearance-china-event-2708278-2025-04-13",
      "headline": "Aamir Khan, girlfriend Gauri Spratt hold hands in first public appearance in ChinaAamir Khan and his girlfriend Gauri Spratt made their first public appearance at an event in China. They held hands as they posed with Chinese actors Shen Teng and Ma Li."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-3-ajith-kumar-grosses-rs-100-crore-2708269-2025-04-13",
      "headline": "Good Bad Ugly box office Day 3: Ajith Kumar's film grosses Rs 100 crore worldwideAjith Kumar's recently released film 'Good Bad Ugly' surpassed Rs 100 crore worldwide. The film saw an increase in numbers on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-brings-back-chammak-challo-magic-dubai-event-2708267-2025-04-13",
      "headline": "Kareena Kapoor brings back Chammak Challo magic at Dubai event. WatchKareena Kapoor delighted fans with her moves on her song 'Chammak Chalo' at an event in Dubai. A video of the actor grooving to the hit track has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sri-shriram-natarajan-explicit-videos-on-instagram-worried-fans-call-for-help-2708249-2025-04-13",
      "headline": "Tamil actor Sri posts explicit content on Instagram, worried fans call for helpTamil actor Sri alias Shriram Natarajan recently posted explicit videos on Instagram. Worried fans were shocked to see his transformation and called for help. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-kakkar-cuts-ties-with-sister-neha-kakkar-tony-kakkar-deletes-post-2708236-2025-04-13",
      "headline": "Singer Sonu Kakkar says 'no longer sister to Neha and Tony', deletes post laterSinger Sonu Kakkar, in an X post, wrote that she was cutting ties with her siblings, Neha Kakkar and Tony Kakkar. However, she deleted the post later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/devdas-review-dilipkumar-suchitra-sen-vyjayanthimala-2708228-2025-04-13",
      "headline": "The Immortal Devdas: When pain becomes poetry in black and whiteBimal Roy's 'Devdas', a 1955 classic, is a poignant masterpiece of Indian cinema. Dilip Kumar's portrayal of a doomed lover remains unmatched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-son-mark-shankar-back-in-hyderabad-singapore-school-fire-incident-2708221-2025-04-13",
      "headline": "Pawan Kalyan, son Mark and family back in Hyderabad after Singapore school fireAndhra Pradesh Deputy Chief Minister and Telugu actor Pawan Kalyan returned to Hyderabad with his son, Mark Shankar, and family. Mark was injured in the Singapore school fire incident last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-daughter-enter-showbiz-at-young-age-singer-reacts-2708087-2025-04-12",
      "headline": "Priyanka-Nick's daughter to enter showbiz at young age? Singer reactsNick Jonas recently opened up about his daughter, Malti Marie, entering showbiz. The singer revealed that he has had this conversation with his wife-actor, Priyanka Chopra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhanush-kriti-sanon-tere-ishk-mein-in-leh-aanand-l-rai-pic-viral-2708080-2025-04-12",
      "headline": "Dhanush, Kriti Sanon begin Tere Ishk Mein in Leh? Aanand L Rai's pic goes viralDhanush and Kriti Sanon are expected to begin 'Tere Ishk Mein' shooting in Leh. Director Aanand L Rai shared a picture from the picturesque location. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-vangas-spirit-to-go-on-floors-in-october-prabhas-to-do-own-stunts-report-2708069-2025-04-12",
      "headline": "Prabhas to sport lean physique in Sandeep Vanga's Spirit, shoot in October: ReportDirector Sandeep Reddy Vanga's upcoming film, Spirit, is one of the highly anticipated films of the year. As per reports, the makers are expected to begin shooting in October this year. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anupama-parameswaran-dhruv-vikram-dating-rumours-kissing-pic-spotify-playlist-2708071-2025-04-12",
      "headline": "Anupama Parameswaran, Dhruv Vikram dating? Leaked Spotify playlist sparks buzzActor Anupama Parameswaran and Dhruv Vikram are rumoured to be dating. Their joint Spotify playlist reportedly featured a photo of them kissing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-on-pakistani-actors-in-bollywood-there-should-be-no-boundaries-2708043-2025-04-12",
      "headline": "Sushmita Sen on Pakistani actors in Bollywood: There should be no boundariesSushmita Sen reacted to Pakistani actors in Indian cinema. The actor stated that there should be no boundaries when it comes to 'talent and creativity.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coachella-2025-blackpinks-lisa-sets-stage-ablaze-as-rose-cheers-her-on-2708040-2025-04-12",
      "headline": "Coachella 2025: BLACKPINK's Lisa sets stage ablaze as Rose cheers her onBLACKPINK's Lisa captivated the audience at Coachella 2025 with her solo act, performing hits from her album 'ALTER EGO'. Her stage presence and energy left a lasting impression on fans."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-waqf-violence-central-forces-deployed-after-court-order-2708222-2025-04-13",
      "headline": "Bengal anti-Waqf protests: 3 killed, 150 arrested; BJP claims Hindus fleeing homesSeveral people were seen fleeing West Bengal's Murshidabad by boat, attempting to cross the river into neighbouring Malda in search of safety as violent protests against the Waqf Amendment Act continued even on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-missile-struck-indian-pharma-warehouse-in-kyiv-claims-ukraine-2708149-2025-04-12",
      "headline": "Russian missile struck Indian pharma warehouse in Kyiv, claims UkraineUkraine's Embassy in India claimed that a Russian missile hit the warehouse of an Indian pharma firm, Kusum, in Kyiv. India and Russia are yet to comment on the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/atishi-alleges-rekha-guptas-husband-running-delhi-government-bjp-hits-back-2708243-2025-04-13",
      "headline": "Atishi alleges Rekha Gupta's husband running Delhi government, BJP hits backThe allegations, made via a post on social media, were accompanied by a photo that Atishi claimed showed Manish Gupta, Rekha Gupta's husband, presiding over a meeting with senior officials from departments including MCD, DJB, PWD, and DUSIB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/girl-trouble-office-tussle-people-turning-to-chatgpt-open-ai-chatbot-desperate-help-life-advice-heres-how-2708039-2025-04-13",
      "headline": "I cried to a chatbot, and it actually helpedFrom breakups and loneliness to toxic bosses and passive-aggressive coworkers, people are turning to AI chatbot, ChatGPT, for life advice. Some are using it as a counsellor, and others for guidance, or just to feel heard. Here's what users, therapists and ChatGPT itself have to say about the phenomenon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/phule-actor-pratik-gandhi-appeals-brahmin-community-amid-release-delay-patralekhaa-2708279-2025-04-13",
      "headline": "First watch movie then..: Phule actor Pratik Gandhi's appeal as row delays releasePratik Gandhi's upcoming film, 'Phule', has been postponed. In an interview, the actor urged the Brahmin community not to form opinions about the film based solely on the trailer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-yusuf-pathan-good-chai-post-amid-bengal-violence-draws-bjp-heat-waqf-protest-murshidabad-birbhum-2708282-2025-04-13",
      "headline": "Trinamool MP Yusuf Pathan's 'good chai' post amid Bengal violence draws BJP heatTrinamool MP Yusuf Pathan's Instagram post amid Bengal's Waqf Act unrest drew sharp criticism from the BJP. As violence spread across multiple districts, the Calcutta High Court ordered central forces to restore order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-cites-pakistans-constitution-to-set-deadline-for-assent-to-bills-2708315-2025-04-13",
      "headline": "Supreme Court cites Pakistan's constitution to set deadline for assent to billsThe Supreme Court has set a three-month deadline for the President to act on bills passed by the legislature. It referred to Pakistan's Constitution, which gives its President just 10 days, to support the need for time limits in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-crime-news-woman-forced-to-drink-alcohol-killed-over-property-row-body-dumped-in-yamuna-2708310-2025-04-13",
      "headline": "UP woman forced to drink alcohol, killed over property row; body dumped in YamunaOn April 7, 2025, the woman's property dealer called her to his residence on the pretext of paying her money back. Once she arrived, Shivendra, along with his friend, strangled her to death after serving alochol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/spacex-falcon-9-rocket-with-21-starlink-satellites-soars-past-full-moon-video-surfaces-2708270-2025-04-13",
      "headline": "Video: SpaceX Falcon 9 rocket with 21 Starlink satellites soars past full moonThis mission marked SpaceX's 400th overall flight, a significant milestone in the company's relentless launch cadence. It was carried out using a flight-proven Falcon 9 first-stage booster, celebrating its 10th mission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-rcb-live-score-rajasthan-royals-vs-royal-challengers-bengaluru-today-reactions-2708337-2025-04-13",
      "headline": "RR vs RCB Live: Samson's Rajasthan look for turnaround in JaipurRajasthan Royals (RR) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: Sanju Samson's Rajasthan are playing their first home game in Jaipur. They are taking on Rajat Patidar's Bengaluru, who have slightly lost their way after a promising start to this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mla-son-lands-in-row-as-aides-beat-up-priests-son-for-refusing-entry-after-chamunda-devi-temple-temple-shut-2708259-2025-04-13",
      "headline": "Aides of Madhya Pradesh BJP MLA's son beat priest for not opening temple gatesIndore BJP MLA Golu Shukla's son sparked controversy after his aide allegedly assaulted a priest of Chamunda Devi temple for denying late-night entry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-girlfriend-gauri-spratt-hold-hands-public-appearance-china-event-2708278-2025-04-13",
      "headline": "Aamir Khan, girlfriend Gauri Spratt hold hands in first public appearance in ChinaAamir Khan and his girlfriend Gauri Spratt made their first public appearance at an event in China. They held hands as they posed with Chinese actors Shen Teng and Ma Li."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/a-butcher-and-a-traitor-the-many-ironies-of-jallianwala-bagh-massacre-2708335-2025-04-13",
      "headline": "A butcher and a traitor: The many ironies of Jallianwala Bagh massacreThe Jallianwala Bagh massacre of April 13, 1919, was orchestrated by Brigadier General Reginald Dyer, known as the 'Butcher of Amritsar', and possibly aided by Hans Raj, an Indian associate suspected of betraying his own people by setting the stage for the tragedy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-interview-father-mother-hyderabad-2708298-2025-04-13",
      "headline": "141 not enough? Why Abhishek Sharma's father isn't satisfied with record IPL centuryIPL 2025, SRH vs PBKS: SunRisers Hyderabad opener Abhishek Sharma celebrated his record 141 with his parents at the Rajiv Gandhi International Stadium on Sunday. His father, Raj Kumar Sharma, recalled their conversation after SRH's win over Punjab. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/devdas-review-dilipkumar-suchitra-sen-vyjayanthimala-2708228-2025-04-13",
      "headline": "The Immortal Devdas: When pain becomes poetry in black and whiteBimal Roy's 'Devdas', a 1955 classic, is a poignant masterpiece of Indian cinema. Dilip Kumar's portrayal of a doomed lover remains unmatched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-hussain-rana-mumbai-terror-attack-interrogation-david-coleman-headley-nia-visa-immigration-2708111-2025-04-12",
      "headline": "Tahawwur Rana to be confronted with 'employee B' over 26/11 plot: NIA sourcesThe National Investigation Agency is conducting an extensive interrogation of 26/11 mastermind Tahawwur Rana to uncover deeper layers of the conspiracy behind the 2008 Mumbai terror attacks, following his extradition from the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/volkswagen-tiguan-r-line-to-launch-in-india-tomorrow-what-to-expect-2708286-2025-04-13",
      "headline": "Volkswagen Tiguan R-Line to launch in India tomorrow. What to expect?Volkswagen is all set to launch the new Tiguan R-Line in India tomorrow. Since the SUV will come to the Indian market as a completely built unit (CBU), the price is expected to be around Rs 45-50 lakh (ex-showroom)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-472-11-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vivek-agnihotri-calls-murshidabad-impossible-to-shoot-in-amid-waqf-law-protests-2708209-2025-04-13",
      "headline": "Vivek Agnihotri says it was impossible to shoot in Murshidabad amid Waqf protestsFilmmaker Vivek Agnihotri said filming The Delhi Files in Murshidabad was impossible due to lack of support. His comments came amid violent protests over the Waqf Act, prompting arrests and central force deployment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/clashes-two-groups-mp-guna-hanuman-jayanti-procession-stones-thrown-police-2708174-2025-04-12",
      "headline": "Video: Clashes during Hanuman Jayanti procession in MP's Guna, stones thrownStones were thrown during a Hanuman Jayanti procession following clashes between two groups in Madhya Pradesh's Guna. Police said the situation was under control after some time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/braided-hair-necktie-trend-karan-johar-viral-bizarre-fashion-2708290-2025-04-13",
      "headline": "Is it braided hair? No, it is a necktie (Karan Johar loves it too)Thanks to the Italian fashion house Schiaparelli, neckties have taken a surreal twist — they now resemble braided hair."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-rape-accused-dies-by-suicide-kalyan-taloja-jail-vishal-gawli-2708271-2025-04-13",
      "headline": "Man arrested for rape-murder of Kalyan teen hangs self in Maharashtra's Taloja jailAccording to Jail Superintendent Pramod Wagh, Gawli had eaten dinner the previous evening and was seen heading to the toilet around 3:30 am. It was only around 4:00 am that another inmate discovered his lifeless body in the jail washroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-kakkar-cuts-ties-with-sister-neha-kakkar-tony-kakkar-deletes-post-2708236-2025-04-13",
      "headline": "Singer Sonu Kakkar says 'no longer sister to Neha and Tony', deletes post laterSinger Sonu Kakkar, in an X post, wrote that she was cutting ties with her siblings, Neha Kakkar and Tony Kakkar. However, she deleted the post later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-karachi-vs-multan-win-learn-mohammad-rizwan-2708266-2025-04-13",
      "headline": "No learns, only wins: Karachi Kings take brutal dig at Multan SultansKarachi Kings beat Multan Sultans in a high-scoring encounter on Saturday, April 12. After the match, Karachi took a brutal dig at the opponent captain, Mohammad Rizwan."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-rcb-live-score-rajasthan-royals-vs-royal-challengers-bengaluru-today-reactions-2708337-2025-04-13",
      "headline": "RR vs RCB Live: Samson's Rajasthan look for turnaround in JaipurRajasthan Royals (RR) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: Sanju Samson's Rajasthan are playing their first home game in Jaipur. They are taking on Rajat Patidar's Bengaluru, who have slightly lost their way after a promising start to this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-mi-preview-ipl-2025-kl-rahul-hardik-pandya-predicted-11-delhi-pitch-2708306-2025-04-13",
      "headline": "DC vs MI, preview: Struggling Mumbai eye to disrupt pitch-perfect DC runDelhi Capitals play at their home Arun Jaitley Stadium for the first time this season. Delhi have been in tremendous form and face a struggling Mumbai Indians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-interview-father-mother-hyderabad-2708298-2025-04-13",
      "headline": "141 not enough? Why Abhishek Sharma's father isn't satisfied with record IPL centuryIPL 2025, SRH vs PBKS: SunRisers Hyderabad opener Abhishek Sharma celebrated his record 141 with his parents at the Rajiv Gandhi International Stadium on Sunday. His father, Raj Kumar Sharma, recalled their conversation after SRH's win over Punjab. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-hardik-pandya-kashvee-gautam-bat-2708274-2025-04-13",
      "headline": "Watch: Hardik Pandya keeps his promise, gifts bat to Kashvee GautamMumbai Indians captain Hardik Pandya gifted a bat to rising India star Kashvee Gautam. Pandya signed the bat for her ahead of MI's match vs Delhi on April 13.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-karachi-vs-multan-win-learn-mohammad-rizwan-2708266-2025-04-13",
      "headline": "No learns, only wins: Karachi Kings take brutal dig at Multan SultansKarachi Kings beat Multan Sultans in a high-scoring encounter on Saturday, April 12. After the match, Karachi took a brutal dig at the opponent captain, Mohammad Rizwan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-clarke-on-rohit-sharmas-form-mumbai-indians-2707221-2025-04-13",
      "headline": "Rohit Sharma is one good innings away from scoring a hundred: Michael ClarkeFormer Australia captain Michael Clarke has backed out of form Mumbai Indians' (MI) star Rohit Sharma to score a big knock soon in the ongoing Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-pbks-abhishek-sharma-note-shreyas-iyer-reaction-2708240-2025-04-13",
      "headline": "After centurion Abhishek flaunts note, Iyer's reaction goes viralAbhishek Sharma flaunted a handwritten chit after reaching his century vs PBKS in Hyderabad. Opposition captain Shreyas Iyer's reaction to Abhishek's celebration went viral after the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-sunrisers-hyderabad-abhishek-sharma-press-conference-141-2708237-2025-04-13",
      "headline": "It just happens when it's your day: Abhishek Sharma dedicates 141 to Orange ArmyAbhishek Sharma hit his maiden IPL hundred off 40 balls with a single and then celebrated by bringing out a note from his pocket that read, \"This one is for Orange Army.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-punjab-kings-assistant-coach-sunil-joshi-press-conference-2708232-2025-04-13",
      "headline": "PBKS assistant coach rues missed opportunities on field after SRH chase 246Punjab Kings assistant coach Sunil Joshi admitted that PBKS missed key chances on the field as SunRisers Hyderabad recorded the second-highest chase in the history of the IPL. \"Abhishek played very well, so due credit to him,\" Joshi said at the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-final-mohun-bagan-vs-bengaluru-parth-jindal-firecracker-2708233-2025-04-13",
      "headline": "ISL Final: Bengaluru FC owner Parth Jindal hit by firecracker in KolkataISL Final: Bengaluru FC owner Parth Jindal complained of poor security during his team's match against Mohun Bagan in the ISL Final. Jindal complained about getting hit by a firecracker at the Salt Lake Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-hundred-yuvraj-singh-srh-vs-pbks-ipl-2708226-2025-04-13",
      "headline": "Itni maturity? Yuvraj Singh pokes fun at Abhishek after blazing hundredFormer cricketer Yuvraj Singh praised SRH's Abhishek Sharma after his century vs Punjab Kings. Yuvraj, in his classic manner, poked fun at Abhishek after the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-pbks-abhishek-sharma-note-shreyas-iyer-reaction-2708240-2025-04-13",
      "headline": "After centurion Abhishek flaunts note, Iyer's reaction goes viralAbhishek Sharma flaunted a handwritten chit after reaching his century vs PBKS in Hyderabad. Opposition captain Shreyas Iyer's reaction to Abhishek's celebration went viral after the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-sunrisers-hyderabad-abhishek-sharma-press-conference-141-2708237-2025-04-13",
      "headline": "It just happens when it's your day: Abhishek Sharma dedicates 141 to Orange ArmyAbhishek Sharma hit his maiden IPL hundred off 40 balls with a single and then celebrated by bringing out a note from his pocket that read, \"This one is for Orange Army.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-punjab-kings-assistant-coach-sunil-joshi-press-conference-2708232-2025-04-13",
      "headline": "PBKS assistant coach rues missed opportunities on field after SRH chase 246Punjab Kings assistant coach Sunil Joshi admitted that PBKS missed key chances on the field as SunRisers Hyderabad recorded the second-highest chase in the history of the IPL. \"Abhishek played very well, so due credit to him,\" Joshi said at the post-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-final-mohun-bagan-vs-bengaluru-parth-jindal-firecracker-2708233-2025-04-13",
      "headline": "ISL Final: Bengaluru FC owner Parth Jindal hit by firecracker in KolkataISL Final: Bengaluru FC owner Parth Jindal complained of poor security during his team's match against Mohun Bagan in the ISL Final. Jindal complained about getting hit by a firecracker at the Salt Lake Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-hundred-yuvraj-singh-srh-vs-pbks-ipl-2708226-2025-04-13",
      "headline": "Itni maturity? Yuvraj Singh pokes fun at Abhishek after blazing hundredFormer cricketer Yuvraj Singh praised SRH's Abhishek Sharma after his century vs Punjab Kings. Yuvraj, in his classic manner, poked fun at Abhishek after the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-reveals-fever-before-141-hyderabad-2708220-2025-04-13",
      "headline": "How Abhishek Sharma fought back from high fever to shock Punjab Kings in HyderabadIPL 2025, SRH vs PBKS: After playing the match-winning knock against the Punjab Kings in Hyderabad, SRH batter Abhishek Sharma, in the post-match press conference, said that he suffered from fever before the game on Saturday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-sharma-record-breaking-100-srh-vs-pbks-hyderabad-2708200-2025-04-13",
      "headline": "Freakish Abhishek Sharma sets IPL ablaze with six-hitting fest in HyderabadSunrisers Hyderabad (SRH) batter Abhishek Sharma played one of the freakiest knocks in the history of the IPL. His unprecedented six-hitting prowess left many gasping as he made a complete mockery of Punjab Kings' massive total of 245."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-rcb-rajat-patidar-impact-player-retire-out-press-conference-2708201-2025-04-13",
      "headline": "Rajat Patidar bats for Impact Player, retire out tactic in IPLIPL 2025, RR vs RCB: In the press conference before Royal Challengers Bengaluru's match against Rajasthan Royals, Rajat Patidar said that new rules surrounding Impact Players and others make the game more interesting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-dc-press-conference-ashutosh-sharma-2708198-2025-04-13",
      "headline": "I always believe in my ability, don't think much about results: Ashutosh SharmaIPL 2025, MI vs DC: In the press conference before the match against Mumbai Indians, Delhi Capitals' batter Ashutosh Sharma opened up on his batting and also had words of praise for skipper Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-parthiv-patek-comments-on-gujarat-titans-fielding-lsg-vs-gt-2708197-2025-04-13",
      "headline": "GT batting coach stresses on importance of fielding after loss against LucknowGujarat Titans batting coach Parthiv Patel has stressed the importance of improving the team's fielding following a six-wicket loss against Lucknow Super Giants (LSG) at Ekana Stadium. Gujarat succumbed to their second loss of the ongoing season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-rcb-match-preview-precited-xi-weather-forecast-jaipur-2708078-2025-04-13",
      "headline": "RR vs RCB Preview: Royals aim for consistency against away kings BengaluruIPL 2025, RR vs RCB Match Preview: Rajasthan Royals will be aiming for consistency as they take on Royal Challengers Bengaluru, who have been in stunning away form in IPL 2025. The Royals will hope to produce a top performance in their first game in Jaipur this season as Bengaluru will look for another win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-nicholas-pooran-parthiv-patel-lucknow-2708196-2025-04-13",
      "headline": "Sometimes you have to tell Pooran, well played: Parthiv Patel after LSG vs GTGT coach Parthiv Patel said that sometimes you can only tip your hat to Nicholas Pooran after the LSG batter starred for his side in their win on Saturday, April 12. Pooran continued his fine form with another fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-shardul-thakur-lsg-vs-gt-press-conference-2708195-2025-04-13",
      "headline": "Didn't dwell much on India snub, going unsold in IPL auction: Shardul ThakurIPL 2025, LSG vs GT: In the post-match press conference after the Lucknow Super Giants beat the Gujarat Titans by six wickets, Shardul Thakur lashed out at commentators for their constant criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-parthiv-patek-comments-on-gujarat-titans-fielding-lsg-vs-gt-2708197-2025-04-13",
      "headline": "GT batting coach stresses on importance of fielding after loss against LucknowGujarat Titans batting coach Parthiv Patel has stressed the importance of improving the team's fielding following a six-wicket loss against Lucknow Super Giants (LSG) at Ekana Stadium. Gujarat succumbed to their second loss of the ongoing season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-rcb-match-preview-precited-xi-weather-forecast-jaipur-2708078-2025-04-13",
      "headline": "RR vs RCB Preview: Royals aim for consistency against away kings BengaluruIPL 2025, RR vs RCB Match Preview: Rajasthan Royals will be aiming for consistency as they take on Royal Challengers Bengaluru, who have been in stunning away form in IPL 2025. The Royals will hope to produce a top performance in their first game in Jaipur this season as Bengaluru will look for another win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-nicholas-pooran-parthiv-patel-lucknow-2708196-2025-04-13",
      "headline": "Sometimes you have to tell Pooran, well played: Parthiv Patel after LSG vs GTGT coach Parthiv Patel said that sometimes you can only tip your hat to Nicholas Pooran after the LSG batter starred for his side in their win on Saturday, April 12. Pooran continued his fine form with another fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-shardul-thakur-lsg-vs-gt-press-conference-2708195-2025-04-13",
      "headline": "Didn't dwell much on India snub, going unsold in IPL auction: Shardul ThakurIPL 2025, LSG vs GT: In the post-match press conference after the Lucknow Super Giants beat the Gujarat Titans by six wickets, Shardul Thakur lashed out at commentators for their constant criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/youngsters-will-get-chance-in-their-due-time-as-per-the-teams-needs-sanju-samson-2708194-2025-04-13",
      "headline": "Youngsters will get chance in their due time as per the team's needs: Sanju SamsonRajasthan Royals (RR) captain Sanju Samson has addressed the criticism of not giving chances to youngsters sitting on bench and said that they will get their chances in due time whenever they fit in the team's combination. Rajasthan are set to take on Royal Challengers Bengaluru (RCB) on Sunday, April 13 in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-confirms-wanindu-hasarangas-availability-for-rr-vs-rcb-2708193-2025-04-13",
      "headline": "Sanju Samson confirms Wanindu Hasaranga's availability ahead of RCB clashRajasthan Royals (RR) captain Sanju Samson has confirmed the availability of their wrist spinner Wanindu Hasaranga for the next clash against Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-gt-shardul-thakur-commentators-press-conference-2708192-2025-04-13",
      "headline": "Look at your own stats before criticising: Shardul hits out at commentatorsIPL 2025, LSG vs GT: Shardul Thakur lashed out at critics, saying that commentators criticise players without proper understanding of what the players go through in the middle. Shardul took two wickets in Lucknow's six-wicket win over Gujarat on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-family-yuvraj-singh-suryakumar-yadav-2708191-2025-04-13",
      "headline": "Abhishek Sharma happy to hit 141 vs PBKS in front of family, thanks Yuvraj, SuryakumarAbhishek Sharma was elated to score his maiden IPL hundred in front of his family and thanked Yuvraj Singh and Suryakumar Yadav after SRH's win over PBKS. Abhishek scored 141 runs to pummel PBKS and secure the win for his side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shreyas-iyer-press-conference-srh-vs-pbks-2708190-2025-04-13",
      "headline": "Made me laugh: Shreyas Iyer jokes about SRH's mammoth run chaseIPL 2025, SRH vs PBKS: Shreyas Iyer was awestruck after Sunrisers Hyderabad chased down the target of 246 against the Punjab Kings on Saturday with nine balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-sharma-sunrisers-hyderabad-record-stats-punjab-kings-2708183-2025-04-12",
      "headline": "Abhishek Sharma, SRH light up Hyderabad to set new records: Stat PackIPL 2025, SRH vs PBKS: Abhishek Sharma scored 141 runs off 55 balls as Sunrisers Hyderabad beat Punjab Kings by 8 wickets at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-final-mohun-bagan-vs-bengaluru-fc-report-jamie-maclaren-sunil-chhetri-2708182-2025-04-12",
      "headline": "ISL Final: Mohun Bagan complete comeback win against Bengaluru FC to claim doubleJamie Maclaren was the star of the show as Mohun Bagan came back from a goal down to win the ISL 2024-25 final;; by beating Bengaluru FC 2-1 on Saturday, April 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-sharma-travis-head-shreyas-iyer-srh-vs-pbks-2708177-2025-04-12",
      "headline": "Abhishek Sharma's 141 bludgeons PBKS as SRH chase 246 to revive campaignSunrisers Hyderabad (SRH) pulled off the second-highest successful chase in IPL history against Punjab Kings (PBKS) as Abhishek Sharma's whirlwind knock of 141 (55) helped them end their four-match losing streak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-pbks-abhishek-sharma-orange-army-hyderabad-2708176-2025-04-12",
      "headline": "Watch: Abhishek Sharma dedicates maiden IPL hundred to SRH's Orange ArmyAbhishek Sharma decided to dedicate his maiden IPL hundred against Punjab Kings to Sunrisers Hyderabad's Orange Army. Abhishek broke several records with his performance in front of the Hyderabad crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-sharma-fifth-fastest-srh-vs-pbks-hundred-hyderabad-2708165-2025-04-12",
      "headline": "Abhishek Sharma hits 40-ball hundred, 5th fastest in IPL historyIPL 2025, SRH vs PBKS: Abhishek Sharma raced to score the fifth-fastest hundred in the history of the tournament when he reached the milestone in the match against Punjab Kings at the Rajiv Gandhi International Stadium. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-deepak-chahar-on-mumbai-indians-performance-dc-vs-mi-2708158-2025-04-12",
      "headline": "Individuals are performing but collective performance is lacking for MI: ChaharIndia and Mumbai Indians all-rounder Deepak Chahar feels that individual performances are happening for their team but they're not able to pull off a collective performance. Mumbai have lost four out of five matches so far and will next take on Delhi Capitals on April 13 at Arun Jaitley Stadium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-registers-most-expensive-bowling-figures-by-indian-in-ipl-history-2708151-2025-04-12",
      "headline": "Shami registers most expensive bowling figures by an Indian in IPL historyIndia and Sunrisers Hyderabad (SRH) fast bowler Mohammed Shami registered the most expensive bowling figures by an Indian in IPL history during Match 27 against Punjab Kings (PBKS). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}