{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-lending-rates-ahead-from-icici-to-sbi-your-home-loan-rate-check-2831467-2025-12-05",
      "headline": "Lower lending rates ahead? From ICICI to SBI, your home loan rate checkIndia's central bank has reduced the repo rate by 25 basis points. This move is likely to influence home loan interest rates and stimulate activity across the housing and real estate sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/netflix-to-acquire-warner-bros-discoverys-studios-streaming-unit-in-72-billion-deal-2831434-2025-12-05",
      "headline": "Netflix to buy Warner Bros Discovery's studios, streaming unit in $72 billion dealNetflix has agreed to buy Warner Bros Discovery's TV, film and streaming businesses, bringing the iconic studio under its control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-forex-reserves-decline-for-second-week-to-usd-6862-billion-rbi-data-report-2831426-2025-12-05",
      "headline": "India's forex reserves decline for second week to $686.2 billion: ReportIndia's foreign exchange reserves fell for the second consecutive week, slipping by $1.877 billion to $686.227 billion in the week ended November 28, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-12-lakh-invested-only-rs-10000-earned-the-truth-behind-sip-maths-2831305-2025-12-05",
      "headline": "Rs 1.2 lakh invested, only Rs 10,000 earned? The truth behind SIP mathsInvestors often overlook the real timeline of their investments when assessing SIP returns. Understanding the compounding effect and the actual period money stays invested can make a significant difference in evaluating returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-as-rbi-cuts-lending-rate-offers-liquidity-support-2831296-2025-12-05",
      "headline": "Sensex, Nifty end higher as RBI cuts lending rate, offers liquidity supportThe Sensex ended at 85,712.37, up 447.05 points, while the Nifty50 settled at 26,186.45, gaining 152.70 points. Most of the broader market indices also ended the trading session on a positive note. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/avadhut-sathe-training-academy-denies-sebi-allegations-fraud-stock-market-victim-of-regulatory-vacuum-2831275-2025-12-05",
      "headline": "Victim of regulatory vacuum: Avadhut Sathe Training Academy denies allegationsSebi's interim order said the academy and its founder were running an unregistered investment advisory service under the guise of training programmes and had collected large sums of money from the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-flight-refund-cancellation-delay-crisis-pilot-delhi-chennai-fdtl-regulations-back-government-2831236-2025-12-05",
      "headline": "IndiGo flight cancellations: What passengers need to know about refundsIndiGo has informed the DGCA that full operational stabilisation is expected only by February 10, 2026, with continued cancellations anticipated until December 8.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-mumbai-flight-prices-surge-70000-indigo-crisis-2831225-2025-12-05",
      "headline": "IndiGo crisis sends Delhi–Mumbai flight prices soaring to over Rs 80,000The Delhi–Mumbai corridor, which connects the national capital with the country's financial centre, is one of the busiest air routes globally. Any disruption on this route immediately affects business travellers, tourists, and daily commuters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-aviation-crisis-flight-cancellations-indigo-air-india-flight-duopoly-2831201-2025-12-05",
      "headline": "When two airlines rule the skies: Is India's aviation duopoly failing flyers?IndiGo's mass cancellations have exposed a deeper fault line in Indian aviation, where a growing duopoly means one airline's trouble can disrupt travel plans for the entire country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-personal-loans-become-cheaper-after-the-rbis-latest-repo-rate-cut-525-repo-rate-2831177-2025-12-05",
      "headline": "Will personal loans become cheaper after the RBI's latest repo rate cut?Are borrowers finally set to get some relief as the RBI trims the repo rate by 25 basis points? Could this policy shift translate into lower personal loan rates soon? Read here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/your-fd-investments-to-take-a-hit-as-rbi-cuts-repo-rate-2831107-2025-12-05",
      "headline": "Your FD investments to take a hit as RBI cuts repo rateIs your FD income set to shrink as banks prepare to reduce deposit rates after the RBI's rate cut? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-mpc-rate-cut-25-bps-home-loan-emi-to-get-cheaper-affordable-homes-real-estate-2831102-2025-12-05",
      "headline": "RBI reduces repo rate by 25 bps. Will your home loans get cheaper?RBI Governor Sanjay Malhotra said the committee unanimously agreed on the rate cut after assessing inflation trends, growth forecasts and liquidity needs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indigo-share-price-falls-mass-flight-cancellations-operational-disruptions-2831086-2025-12-05",
      "headline": "IndiGo shares tumble 2% as mass flight cancellations continue to disrupt travel IndiGo's stock fell over 2%, trading at Rs 5,326.35 by 10 am, amid mounting concerns over ongoing mass cancellations and delays across India's busiest airports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-key-lending-rate-by-25-points-to-525-2831083-2025-12-05",
      "headline": "RBI reduces key lending rate by 25 points to 5.25%, maintains neutral stanceThe rate cut takes the repo rate down from 5.5% to 5.25%. Alongside this, the Standing Deposit Facility (SDF) rate has been adjusted to 5%, while the Marginal Standing Facility (MSF) rate and the bank rate now stand at 5.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-avadhut-sathe-pune-finfluencer-sebi-ban-stock-market-trading-academy-2831077-2025-12-05",
      "headline": "Who is Avadhut Sathe, Pune finfluencer whose trading academy got banned by SebiSebi said that Avadhut Sathe Trading Academy was running an unregistered investment advisory business disguised as education, misleading investors through selective performance claims, paid WhatsApp groups, and live market recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-as-investors-eye-rbis-mpc-decision-2831076-2025-12-05",
      "headline": "Sensex, Nifty open flat as investors eye RBI's MPC decisionAround 9:36 am, the Sensex was down 60 points at 85,325, while the Nifty hovered just above the 26,000 mark with a modest 11 point gain. Broader market indices were largely in the red, reflecting the nervousness ahead of the policy outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-rate-cut-announcement-today-governor-sanjay-malhotra-rupee-all-time-low-inflation-gdp-growth-2831067-2025-12-05",
      "headline": "RBI MPC announcement today: Will the all-time low rupee force a rate cut?Earlier this year, the RBI cut the repo rate by 100 basis points across three rounds, supported by falling inflation. But the backdrop has now shifted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-finfluencer-avadhut-sathe-stock-market-biggest-crackdown-impounds-rs-546-crore-2831051-2025-12-05",
      "headline": "Sebi bans finfluencer Avadhut Sathe, freezes Rs 546 crore in major crackdownThe order, issued on December 4, marks a turning point in Sebi's push to clean up the finfluencer ecosystem, where many online trainers claim to offer education but end up giving specific stock tips, guidance and live trading calls without any regulatory licence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/certain-actors-dislike-indias-growing-role-in-markets-owing-to-russia-ties-putins-dig-at-trump-tariffs-2830908-2025-12-04",
      "headline": "Putin says Trump's tariff stance reflects fear of India's economic riseRussian President Putin said that the tariff actions by US President Donald Trump and concerns raised by Western nations over India's Russian oil imports reflect worry about India's rising economic influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-president-vladimir-putin-exclusive-dedollarisation-rupee-rouble-trade-brics-currency-2830962-2025-12-04",
      "headline": "No need for haste: Vladimir Putin on BRICS currency, de-dollarisationVladimir Putin's comments come at a time when conversations around de-dollarisation, alternative payment networks, and local currency trade have gained momentum within the BRICS bloc, especially after Western sanctions reshaped the global financial landscape."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-finalists-review-journeys-104th-episode-gaurav-khanna-farhana-bhatt-2831625-2025-12-05",
      "headline": "Bigg Boss 19 Ep 104: Gaurav looks back, Farrhana cries remembering father Housemates Gaurav Khanna, Pranit More, Amaal Mallik, Farrhana Bhatt and Tanya Mittal revisit key moments ahead of the Bigg Boss 19 finale, as the series highlights emotional recaps, house dynamics and personal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-gave-rs-32-crore-to-pushpa-2-victim-will-extend-more-help-dil-raju-2831479-2025-12-05",
      "headline": "Allu Arjun gave Rs 3.2 crore to Pushpa 2 victim, will extend more help: Dil Raju A year after the Pushpa 2 premiere tragedy, producer Dil Raju met the victim's father to address concerns over financial aid, confirming the assistance already provided and promising continued support."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhurandhar-hindi-cinema-violence-political-trauma-national-wounds-2831605-2025-12-05",
      "headline": "Dhurandhar: Can Aditya Dhar-style cinema just be termed rage-bait or is it more? Dhurandhar portrays India's political trauma through unflinching violence. The film forces audiences to confront pain and seek justice beyond spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/michelle-pfeiffer-oh-what-fun-prime-video-holiday-film-review-2831545-2025-12-05",
      "headline": "Oh. What. Fun. review: A star-powered Christmas caper that loses its way Michelle Pfeiffer leads Oh. What. Fun. in a festive film with charm and chaos. Despite strong performances, the film's script struggles to deliver emotional impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-may-hit-theatres-tomorrow-chennai-theatre-owner-hints-at-early-release-2831589-2025-12-05",
      "headline": "Balakrishna's Akhanda 2 likely to release tomorrow, Chennai theatre owner shares update Balakrishna's Akhanda 2 may release tomorrow after a Chennai theatre owner claimed issues are resolved, sparking fresh hope amid legal and financial delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jay-kelly-review-george-clooney-broken-hero-has-shades-of-imtiaz-ali-men-adam-sandler-2831534-2025-12-05",
      "headline": "Jay Kelly review: George Clooney's broken hero has shades of Imtiaz Ali's menRelease Date:Fri Dec 05, 2025 Jay Kelly explores a movie star dealing with lost identity and fading fame, brought to life through George Clooney's honest, vulnerable performance. The film's quiet sadness and reflective tone will connect with anyone who knows the bittersweet side of life behind the glamour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aryan-khan-directorial-debut-bads-of-bollywood-second-most-popular-indian-director-2025-imdb-2831508-2025-12-05",
      "headline": "Aryan Khan knew The Ba***ds of Bollywood would hit big: Not arrogance Aryan Khan reflects on the sustained success of his first series, discusses his approach to creativity, and hints at future projects, while The Ba***ds of Bollywood continues to attract critical and public attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zeenat-aman-highlights-evolving-social-attitudes-towards-women-in-films-2831449-2025-12-05",
      "headline": "Zeenat Aman recalls Dostana scene, calls out Amitabh's patronising stance Veteran actor Zeenat Aman reflects on the patriarchal attitudes of 1980s Bollywood through a scene from Dostana, highlighting shifts in societal views on women's rights and morality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-receives-warm-welcome-in-japan-at-special-baahubali-the-epic-screening-2831410-2025-12-05",
      "headline": "Prabhas receives warm welcome in Japan at special Baahubali The Epic screening Prabhas attended a special screening in Japan for the release of Baahubali: The Epic, a film combining both parts of the Baahubali saga. During the event, Prabhas expressed his gratitude and affection for his Japanese fans, marking a key moment in Indian cinema's global journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-bengaluru-trip-housekeeper-first-flight-experience-2831418-2025-12-05",
      "headline": "Archana Puran Singh films house-help's first flight: Like walking on clouds Actor Archana Puran Singh travelled to Bengaluru with her family and housekeeper Bhagyashree, marking Bhagyashree's first experience on a flight. The journey featured light-hearted interactions, family discussions, and local culinary exploration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/darshans-the-devil-trailer-release-sparks-buzz-ahead-of-december-11-film-debut-2831339-2025-12-05",
      "headline": "The Devil trailer: Darshan's new avatar and dialogues promise a mass entertainer The trailer for the much-anticipated film The Devil, starring Darshan, was released today. The film is set to arrive in cinemas on December 11, with early morning shows added for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mammootty-kalamkaval-review-psychological-thriller-malayalam-crime-drama-2831364-2025-12-05",
      "headline": "Kalamkaval review: Mammootty transforms into monster, Vinayakan anchors thrillerRelease Date:Fri Dec 05, 2025 Kalamkaval movie review: Director Jithin K Jose's crime drama, featuring Mammootty and Vinayakan, is a gripping thriller about a psychopathic killer. With exceptional performances and some delicious twists along the way, the film could have benefited from a crisper screenplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-kim-woo-bin-and-shin-min-ahs-love-story-has-lasted-2830662-2025-12-05",
      "headline": "Why Kim Woo-bin and Shin Min-ah's love story has lasted South Korean stars Kim Woo-bin and Shin Min-ah's decade-long romance blossoms into marriage after years of loyalty, resilience and quiet love. In this week's K-fix we explore their full love story here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-finale-elvish-yadav-not-supporting-any-finalist-gaurav-khanna-pranit-more-farrhana-bhatt-tanya-mittal-amaal-mallik-2831303-2025-12-05",
      "headline": "Exclusive: Why Elvish Yadav isn't supporting any Bigg Boss 19 finalist We asked Bigg Boss OTT 2 winner Elvish Yadav who he thought was likely to win the ongoing season 19. Hosted by Salman Khan, the grand finale of 'Bigg Boss 19' will stream on JioHotstar at 9 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-miss-world-films-and-why-shes-never-felt-insecure-red-sea-film-festival-2831307-2025-12-05",
      "headline": "Aishwarya Rai opens up on Miss World, films and why she's never felt insecure Speaking at the Red Sea Film Festival 2025, Aishwarya Rai Bachchan opened up about her career path, her measured presence on social media and her Miss World years. She also admitted that she has never faced moments of insecurity about her choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indigo-flight-cancellations-delay-passengers-nationwide-lauren-gottlieb-warns-travellers-2831315-2025-12-05",
      "headline": "Do not take IndiGo: Lauren Gottlieb slams airlines after Dubai flight is cancelled Actor Lauren Gottlieb has criticised IndiGo airlines after her Dubai flight was cancelled amid widespread delays and chaos at Indian airports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kuttram-purindhavan-whodunnit-series-review-pasupathy-performance-twists-2831293-2025-12-05",
      "headline": "Kuttram Purindhavan review: A slow crime thriller series with a gripping climaxRelease Date:Fri Dec 05, 2025 Kuttram Purindhavan series review: The Tamil crime thriller series streaming on SonyLiv is a classic whodunnit tale led by actor Pasupathy that tests your patience initially but gets interesting in the final three episodes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-khossla-calls-bollywood-a-place-with-crocodiles-says-wont-sell-her-soul-2831290-2025-12-05",
      "headline": "Divya Khossla calls Bollywood a place with crocodiles, says won't sell her soul Divya Khossla described Bollywood as a challenging industry filled with 'crocodiles' and stressed the importance of staying true to oneself without compromising values. She also shared insights on her memorable film experiences and addressed personal questions during a recent AMA session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dhurandhar-review-ranveer-singh-leads-but-akshaye-khanna-rules-this-labyrinth-of-war-politics-2831261-2025-12-05",
      "headline": "Dhurandhar review: Ranveer leads, but Akshaye rules this labyrinth of war, politicsRelease Date:Fri Dec 05, 2025 Dhurandhar is Aditya Dhar's most politically assertive film, tracing India's covert operations through real historical tragedies. Ranveer Singh leads with conviction, but Akshaye Khanna delivers the most compelling performance."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/over-1000-flights-cancelled-today-normalcy-expected-by-dec-10-15-indigo-ceo-in-video-message-2831447-2025-12-05",
      "headline": "1,000 IndiGo flights cancelled; Centre hopes for fix by Monday, CEO says Dec 10-15IndiGo CEO Pieter Elbers explained that the massive disruption was caused by the rebooting of IndiGo's entire operational system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/surprising-that-vladimir-putin-dinner-invite-was-accepted-congress-leader-slams-shashi-tharoor-2831576-2025-12-05",
      "headline": "Surprising that Putin dinner invite was accepted: Congress leader slams TharoorFollowing Shashi Tharoor's invitation to attend Putin's dinner at the Rashtrapati Bhavan, Pawan Khera expressed astonishment, saying that the Congress MP should not have accepted the invitation when the leaders of his own party were not invited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-pm-modi-putin-rode-toyota-fortuner-message-to-west-ukraine-war-2831120-2025-12-05",
      "headline": "Why PM Modi picked a Fortuner for carpool with Putin? Theories behind itPutin in India: There was a red carpet welcome, PM Modi breaking protocol to greet him on the tarmac, a firm handshake, followed by a warm hug. However, what caught the attention was PM Modi choosing a white Toyota Fortuner to carpool with Putin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ex-pentagon-official-says-trump-deserves-nobel-for-uniting-india-and-russia-glbs-2831650-2025-12-06",
      "headline": "Ex-Pentagon official says Trump deserves Nobel for uniting India and RussiaFormer Pentagon official Michael Rubin says Donald Trump deserves a Nobel Prize for bringing India and Russia closer, criticises Trump's handling of India ties and urges Washington to stop lecturing New Delhi on Russian fuel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/tamil-nadu-election-2026-our-land-continent-country-conflict-part-2-320-05-12-2025",
      "headline": "Our cosmos, continent, country and conflictNorth-based pundits, politicians, and academics have historically committed the intellectual trespass of equating the entirety of Bharat with Aryavart, despite their preceptor Manu's own Deccan delineation. In their narrative, the subcontinent becomes the exclusive, unbroken motherland of an indigenous Aryan identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/taliban-countering-terror-vladimir-putin-junks-pakistan-narrative-afghanistan-ttp-tehrik-e-taliban-balochistan-kp-terrorist-2831544-2025-12-05",
      "headline": "Putin destroys Pak narrative, says Taliban combatting terrorismRussian President Vladimir Putin, in an exclusive interview with India Today Group, said that the Taliban in Afghanistan were a reality. He said the Taliban regime was combating terrorism. With this, Putin destroyed Islamabad's narrative of Afghan Taliban's role in terrorism in Pakistani territory, in which it tried to show an Indian role as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flights-cancellation-status-live-updates-crew-shortage-delhi-mumbai-bengaluru-domestic-international-dgca-2831101-2025-12-05",
      "headline": "Live: Indian Railways adds 116 extra coaches across 37 trains amid passenger rushIndia's largest air carrier IndiGo's troubles dragged into a third straight day on Friday, with over 1,000 flights cancelled across major hubs, on top of more than 550 cancellations the day before. The airline cancelled all 235 flights at Delhi's Indira Gandhi International (IGI) Airport on Thursday, snarling airport operations and leaving passengers stranded.\r\n\r\nPieter Elbers, the CEO of IndiGo, expressed hope that normalcy will be restored by December 15. Earlier, IndiGo had admitted that the ongoing chaos stems from miscalculations and planning lapses while rolling out Phase 2 of the Flight Duty Time Limitations (FDTL) rules. The government has ordered a high-level inquiry into the matter, to find out the root cause of disruptions and hold accountable those responsible. Stay tuned with India Today for all Live Updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2026-draw-kylian-mbappe-vs-erling-haaland-france-norway-2831647-2025-12-06",
      "headline": "FIFA World Cup 2026 groups revealed: Mbappe's France, Haaland's Norway drawn togetherFIFA World Cup: The World Cup draw gave a big surprise to football fans as France and Norway were drawn together, which now sets the stage for an early Kylian Mbappe vs Erling Haaland clash in the group-stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/how-us-cold-war-blunder-pushed-india-into-soviet-arms-and-why-washington-refuses-to-learn-2831461-2025-12-05",
      "headline": "How cold war blunder pushed India into Soviet arms and why US refuses to learnUS favouritism toward Pakistan in the 1950s, driven by anti-Soviet fears, shattered India's trust, forging an Indo-Soviet alliance amid Nehru's non-alignment. History rhymes with Trump's tariff tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/something-wrong-with-h1b-visa-ex-visa-officer-simon-hankinson-says-working-visa-used-by-average-grads-china-india-2831370-2025-12-05",
      "headline": "H-1B programme being used by average grads: Former US visa officerFormer US visa official Simon Hankinson wrote in his Fox News op-ed that although the H-1B system was intended for highly skilled \"speciality\" professionals, it was being used by average college graduates. He further argued that the H-1B programme had major flaws and called for reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/from-jhol-momo-to-achaari-baingan-lavish-thali-served-at-state-dinner-for-putin-2831627-2025-12-05",
      "headline": "From Jhol Momo to Achaari Baingan, lavish thali served at state dinner for PutinIndia showcased its rich culinary heritage with a specially curated vegetarian thali for Russian President Vladimir Putin at a state dinner hosted by President Droupadi Murmu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-russia-strategic-partnership-sabka-sath-sabka-vikas-bilateral-cooperation-2831630-2025-12-05",
      "headline": "Putin echoes PM Modi's 'sabka saath, sabka vikas' in parting addressPutin concluded by highlighting ongoing cooperation in Brics, where India will assume the presidency in 2026, and other multilateral formats, aiming to build security, trust, and peace across Eurasia and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dhurandhar-review-ranveer-singh-leads-but-akshaye-khanna-rules-this-labyrinth-of-war-politics-2831261-2025-12-05",
      "headline": "Dhurandhar review: Ranveer leads, but Akshaye rules this labyrinth of war, politicsRelease Date:Fri Dec 05, 2025Dhurandhar is Aditya Dhar's most politically assertive film, tracing India's covert operations through real historical tragedies. Ranveer Singh leads with conviction, but Akshaye Khanna delivers the most compelling performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-exchange-heavy-fire-along-border-after-failed-peace-talks-glbs-2831653-2025-12-06",
      "headline": "Pakistan, Afghanistan exchange heavy fire along border after failed peace talksPakistan and Afghanistan exchanged gunfire along their border after peace talks failed, officials said. Both sides denied blame, accusing each other over militant attacks while trying to maintain a fragile ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-cites-india-pakistan-peace-deal-in-new-us-national-security-blueprint-glbs-2831649-2025-12-06",
      "headline": "Trump cites India–Pakistan peace deal in new US national security blueprint\r\nThe Trump administration's National Security Strategy renews the claim that Trump negotiated peace between India and Pakistan, a claim India rejects, while outlining deeper US–India cooperation across the Indo-Pacific and global alliances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/flight-time-rules-bend-for-indigo-passengers-stranded-airports-chaos-india-airlines-cancellations-delay-2831318-2025-12-05",
      "headline": "Flight time rules bend for IndiGo, because all's well that bends wellChaos broke out at airports because the government tried to implement global rules in the Indian scheme of things. Not just aviation, any sector will collapse in India if laws are implemented to the tee. The sacred rule is that rules are to be circumvented in India's well-greased machinery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-hat-trick-of-centuries-visakhapatnam-odi-next-act-2831531-2025-12-05",
      "headline": "Has Virat Kohli ever hit a hat-trick of centuries in ODIs? Vizag awaits his next actIND vs SA, 3rd ODI: All eyes turn to Kohli in Vizag as whispers of a rare ODI feat swirl again, though whether he's crossed that mark before remains part of the intrigue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/donald-trump-fifa-peace-prize-2026-world-cup-draw-gianni-infantino-washington-2831638-2025-12-05",
      "headline": "Donald Trump awarded FIFA Peace prize at 2026 World Cup drawFIFA World Cup 2026: US President Donald Trump received the inaugural FIFA Peace Prize during the 2026 World Cup draw ceremony. FIFA says the award recognises his efforts to promote global peace and diplomatic engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vladimir-putin-india-visit-live-updates-india-today-world-exclusive-interview-russia-india-ties-pm-modi-meeting-in-delhi-trade-defence-talks-private-dinner-2830531-2025-12-04",
      "headline": "Putin leaves for Russia after state dinner with PM Modi at Rashtrapati BhavanRussian President Putin in India highlights: Prime Minister Narendra Modi hosted Russian President Vladimir Putin in New Delhi, reiterating that \"India is on the side of peace\" amid the Ukraine war. The leaders reviewed trade ties, with Modi expressing confidence that the Rs 100-billion target will be achieved ahead of schedule. At the India–Russia Business Forum, Modi urged Russian firms to \"Make in India\". In a symbolic cultural gesture, he gifted Putin a Russian translation of the Bhagavad Gita, reflecting India's broader effort to share its literary and spiritual heritage globally. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/avadhut-sathe-training-academy-denies-sebi-allegations-fraud-stock-market-victim-of-regulatory-vacuum-2831275-2025-12-05",
      "headline": "Victim of regulatory vacuum: Avadhut Sathe Training Academy denies allegationsSebi's interim order said the academy and its founder were running an unregistered investment advisory service under the guise of training programmes and had collected large sums of money from the public."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-toothpaste-ad-rahul-dravid-oral-health-engagement-ring-missing-2831428-2025-12-05",
      "headline": "Smriti shares first post after wedding delay, fans spot missing engagement ringSmriti Mandhana ends social media silence with a toothpaste promotional video. Fans notice her missing engagement ring sparking questions about the shoot timing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/heliconia-the-special-plant-noticed-during-pm-modis-meeting-with-putin-2831274-2025-12-05",
      "headline": "Heliconia: The special plant noticed during PM Modi's meeting with PutinA quiet detail from the Modi–Putin meeting grabbed unexpected attention when viewers noticed a striking plant placed right behind the two leaders, sparking curiosity about its meaning and symbolism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mammootty-kalamkaval-review-psychological-thriller-malayalam-crime-drama-2831364-2025-12-05",
      "headline": "Kalamkaval review: Mammootty transforms into monster, Vinayakan anchors thrillerRelease Date:Fri Dec 05, 2025Kalamkaval movie review: Director Jithin K Jose's crime drama, featuring Mammootty and Vinayakan, is a gripping thriller about a psychopathic killer. With exceptional performances and some delicious twists along the way, the film could have benefited from a crisper screenplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lot-changed-but-putins-raj-kapoor-mention-to-highlight-india-russia-friendship-2831535-2025-12-05",
      "headline": "Lot changed but...: Putin's Raj Kapoor mention to highlight India-Russia friendshipPutin invoked Bollywood legend Raj Kapoor, who was very popular in Russia back in the day, and said that India has changed a lot since then but Moscow's ties with New Delhi remain stronger than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-gave-rs-32-crore-to-pushpa-2-victim-will-extend-more-help-dil-raju-2831479-2025-12-05",
      "headline": "Allu Arjun gave Rs 3.2 crore to Pushpa 2 victim, will extend more help: Dil RajuA year after the Pushpa 2 premiere tragedy, producer Dil Raju met the victim's father to address concerns over financial aid, confirming the assistance already provided and promising continued support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-may-hit-theatres-tomorrow-chennai-theatre-owner-hints-at-early-release-2831589-2025-12-05",
      "headline": "Balakrishna's Akhanda 2 likely to release tomorrow, Chennai theatre owner shares updateBalakrishna's Akhanda 2 may release tomorrow after a Chennai theatre owner claimed issues are resolved, sparking fresh hope amid legal and financial delays."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-west-indies-1st-test-day-5-live-score-updates-christchurch-2831648-2025-12-06",
      "headline": "New Zealand vs West Indies, 1st Test Day 5 Live Score and Updates from Christchurch NZ vs WI, 1st Test Day 5: New Zealand stay ahead but lose key bowlers, and Windies still have work to do. With Hope and Greaves resuming, the final day promises a thrilling finish with every result in play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2026-draw-kylian-mbappe-vs-erling-haaland-france-norway-2831647-2025-12-06",
      "headline": "FIFA World Cup 2026 groups revealed: Mbappe's France, Haaland's Norway drawn together FIFA World Cup: The World Cup draw gave a big surprise to football fans as France and Norway were drawn together, which now sets the stage for an early Kylian Mbappe vs Erling Haaland clash in the group-stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/prince-deep-sreejesh-india-beat-belgium-reach-junior-world-cup-semis-2831643-2025-12-05",
      "headline": "Wearing 16, Prince Deep pulls a Sreejesh to power India to Junior WC semis In Sreejesh's iconic No.16 jersey, young keeper Princedeep Singh delivered a breakout performance, making clutch saves in the shootout as India edged Belgium to reach the Junior World Cup semifinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/donald-trump-fifa-peace-prize-2026-world-cup-draw-gianni-infantino-washington-2831638-2025-12-05",
      "headline": "Donald Trump awarded FIFA Peace prize at 2026 World Cup draw FIFA World Cup 2026: US President Donald Trump received the inaugural FIFA Peace Prize during the 2026 World Cup draw ceremony. FIFA says the award recognises his efforts to promote global peace and diplomatic engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-3rd-odi-predicted-xi-washington-sundar-finisher-rishabh-pant-2831629-2025-12-05",
      "headline": "IND vs SA, 3rd ODI Predicted XI: How will India handle the Washington Sundar issue? IND vs SA: With the series tied 1–1, India face key selection questions ahead of the Vizag decider. Washington Sundar's role and Prasidh Krishna's form are under scrutiny as the team looks to fix its finishing and bowling balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-ryan-ten-doeschate-press-conference-video-desperate-to-win-2831618-2025-12-05",
      "headline": "India desperate to win ODI series vs South Africa: Assistant coach Ryan ten Doeschate IND vs SA: India assistant coach Ryan ten Doeschate emphasised that the team is carrying a sense of desperation to win the ODI series against the Proteas, and will go all-out in the Vizag decider to turn their fate around."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-maiden-ashes-century-australia-gabba-breakthrough-2831616-2025-12-05",
      "headline": "Joe Root on maiden Ashes century Down Under: Clear plans, backing current form Joe Root finally ends a 12-year wait for an Ashes century in Australia with an unbeaten 135 at the Gabba, lifting England from 5 for 2 and reminding the cricket world why his clarity and class endure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/after-commonwealth-games-ahmedabad-to-host-olympics-in-2036-says-amit-shah-2831602-2025-12-05",
      "headline": "After Commonwealth Games, Ahmedabad to host Olympics in 2036, says Amit Shah Amit Shah says Ahmedabad should prepare for a bigger global stage as he expresses confidence the city will secure the 2036 Olympics after winning the 2030 Commonwealth Games, with major venues already rising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-3rd-odi-washington-sundar-role-indian-team-ryan-ten-doeschate-reveals-details-2831598-2025-12-05",
      "headline": "What is Washington Sundar's role in India's ODI side? India coach reveals key details IND vs SA, 3rd ODI: India sheds light on Washington Sundar's evolving ODI role as the all-rounder sharpens his late overs batting and adapts to match-up based bowling demands, leaving his impact in the decider one to watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-beat-ireland-junior-womens-world-cup-purnima-yadav-2831583-2025-12-05",
      "headline": "India rout Ireland 4-0 at Junior Women's World Cup as Purnima Yadav nets brace Purnima Yadav's stellar brace powered India to a commanding 4-0 win over Ireland at the Junior Women's World Cup. The dominant victory sealed a confident finish to their Pool C campaign in Santiago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shah-rukh-khan-andre-russell-ipl-retirement-kolkata-knight-riders-venky-mysore-2831561-2025-12-05",
      "headline": "Shah Rukh Khan suggested Russel's power coach role: KKR CEO Venky MysoreKKR CEO Venky Mysore revealed that Shah Rukh Khan played a key role in guiding Andre Russell towards his new role in the team. The emotional decision marks the end of a 12-year purple-and-gold journey for the West Indies all-rounder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-hat-trick-of-centuries-visakhapatnam-odi-next-act-2831531-2025-12-05",
      "headline": "Has Virat Kohli ever hit a hat-trick of centuries in ODIs? Vizag awaits his next actIND vs SA, 3rd ODI: All eyes turn to Kohli in Vizag as whispers of a rare ODI feat swirl again, though whether he's crossed that mark before remains part of the intrigue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odis-dew-problem-ryan-ten-doeschate-timing-change-press-conference-2831530-2025-12-05",
      "headline": "No more day-night ODIs in India? Assistant coach discusses massive dew problemRyan ten Doeschate believes adjusting ODI start times could help India counter the heavy dew factor. Ahead of the Vizag decider, the batting coach says conditions, not effort, have created the widening gap between batting first and second."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-2nd-test-day-2-ben-stokes-steve-smith-gabba-2831473-2025-12-05",
      "headline": "Pink-ball Test: Clinical Australia punish sloppy England to edge ahead on Day 2England's first 300-run total in Ashes pink-ball Test could not secure advantage at Gabba. Poor bowling and fielding allowed Australia to take a crucial lead on Day 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-clubs-demand-aiff-resolution-december-8-commercial-crisis-2831438-2025-12-05",
      "headline": "12 ISL clubs urge AIFF for resolution by December 8, warn delays could hurt leagueISL clubs warn the AIFF that without clarity on the league's commercial framework by December 8, further delays could deepen financial strain and jeopardise the stability of India's top-tier football structure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-toothpaste-ad-rahul-dravid-oral-health-engagement-ring-missing-2831428-2025-12-05",
      "headline": "Smriti shares first post after wedding delay, fans spot missing engagement ringSmriti Mandhana ends social media silence with a toothpaste promotional video. Fans notice her missing engagement ring sparking questions about the shoot timing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-prep-kallis-south-africa-world-cup-india-missing-trick-2831392-2025-12-05",
      "headline": "Kallis says SA20 gives South Africa perfect World Cup prep: Is India missing a trick?With the SA20 ending days before the World Cup and India taking a different route, how these contrasting build-ups shape the 2026 tournament remains to be seen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-clinches-tri-series-title-six-wicket-win-sri-lanka-rawalpindi-2831338-2025-12-05",
      "headline": "Pakistan's Fakhar Zaman fined by ICC for on-field antics at Tri-series finalShaheen Afridi and Mohammad Nawaz claimed three wickets each to engineer Sri Lanka's dramatic collapse, before Babar Azam led a measured chase to secure Pakistan's six-wicket victory in the Tri-Series final at Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-nandre-burger-toni-de-zorzi-injury-scans-visakhapatnam-odi-2831325-2025-12-05",
      "headline": "IND vs SA: Nandre Burger and Tony de Zorzi set for injury scans ahead of Vizag ODIIND vs SA: South Africa face an anxious wait on Nandre Burger and Tony de Zorzi ahead of the Vizag decider. Their scan results could shape team balance in the must-win ODI against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-team-balance-matthew-breetzke-press-conference-vizag-odi-2831308-2025-12-05",
      "headline": "South Africa's team balance will help against hungry India in Vizag ODI: BreetzkeIND vs SA: South Africa's rising star Matthew Breetzke believes their balanced batting unit gives them an edge against a hungry India in the Visakhapatnam decider. With the series tied, both teams brace for a high-pressure showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-achilles-soreness-delays-ashes-2025-return-2831304-2025-12-05",
      "headline": "Josh Hazlewood's Ashes return in jeopardy after pacer develops Achilles sorenessJosh Hazlewood's hopes of playing in the Ashes 2025-26 suffer a setback due to Achilles soreness during rehab. Australia are suffering from injuries to both Hazlewood and captain Pat Cummins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/google-year-in-search-2025-vaibhav-suryavanshi-asia-cup-ipl-trends-2831295-2025-12-05",
      "headline": "Vaibhav Suryavanshi is India's most searched as cricket tops Google trends in 2025Google Year in Search 2025 placed Vaibhav Suryavanshi at the top of India's trends. The 14-year-old batter's breakout season matched his soaring public attention. Cricketers and cricket tournaments dominated the trends this year. Here's all that you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-icc-player-of-the-month-nomination-world-cup-final-performance-2831265-2025-12-05",
      "headline": "Shafali Verma nominated for ICC Player of the Month award after World Cup heroicsShafali Verma earns ICC Player of the Month nomination after a standout World Cup final performance. Her all-round display helped India secure their maiden World Cup title, beating South Africa by 52 runs in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/riyan-parag-ready-for-rajasthan-royals-captaincy-as-sanju-samson-exits-ipl-2026-2831229-2025-12-05",
      "headline": "Riyan Parag breaks silence on RR captaincy rumours after Sanju Samson exitWith Sanju Samson traded to Chennai Super Kings, Rajasthan Royals are set to appoint a new captain for IPL 2026. Riyan Parag, who led the team as stand-in captain in IPL 2025, addressed the possibility of taking over full-time duties while weighing the challenges of leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-shai-hope-closes-in-on-gary-sobers-with-hundred-in-christchurch-2831217-2025-12-05",
      "headline": "NZ vs WI: Shai Hope closes in on Gary Sobers with gritty hundred in ChristchurchWest Indies batter Shai Hope scored a gritty century on Day 4 against New Zealand at Hagley Oval. He rescued his team from a precarious position of 72/4 chasing 531."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-tickets-cuttack-2831206-2025-12-05",
      "headline": "VIPs get passes, fans get chaos: Ticket fiasco hits Cuttack ahead of T20I seriesIND vs SA: The fans were left scampering for match tickets in Cuttack on Friday, December 5. The less number of tickets released for the game meant that fans had to stand overnight in queues to get their hands on the T20I tickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-questions-shami-exclusion-india-lose-odi-south-africa-raipur-2831200-2025-12-05",
      "headline": "Where is Mohammed Shami? Agarkar faces tough questions as pacer stays sidelinedIndia vs South Africa: Senior fast bowler Mohammed Shami has been repeatedly overlooked for international assignments despite consistent performances on the domestic circuit. Former spinner Harbhajan Singh has questioned the selection committee over Shami's exclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-virat-kohli-hundred-celebration-ashwin-2831140-2025-12-05",
      "headline": "Are Kohli's wild century celebrations linked to the end of his Test career?IND vs SA: Virat Kohli's wild celebrations are going viral on social media in the ODI series. R Ashwin speculated that Kohli's celebrations might be linked to his Test retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-stunning-catch-mitchell-starc-six-wickets-ashes-test-gabba-2831123-2025-12-05",
      "headline": "Greatest catch in Ashes history? Marnus Labuschagne's flying attempt stuns fansAshes 2025: Marnus Labuschagne took a sensational one-handed diving catch to dismiss Jofra Archer and end a 60-run stand that was frustrating Australia in the pink-ball Test in Brisbane on Friday, December 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-dale-steyn-on-kl-rahul-century-drought-raipur-2831095-2025-12-05",
      "headline": "What stops KL Rahul from scoring barrage of centuries in ODIs? Dale Steyn revealsDale Steyn has praised KL Rahul's adaptability and finishing abilities in India's middle order during the ongoing ODI series against South Africa, suggesting Rahul would score more centuries if given top-order opportunities."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}