{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-orders-indigo-to-end-agreement-with-turkish-airlines-amid-diplomatic-tensions-2733472-2025-05-31",
      "headline": "India orders IndiGo to end agreement with Turkish Airlines amid diplomatic tensionsThe Indian government has ordered IndiGo Airlines to terminate its damp lease agreement with Turkish Airlines by August 31. This decision comes in response to Turkey's continued support for Pakistan against India. The aviation regulator DGCA has granted a final three-month extension to the current lease, which was set to expire on May 31. IndiGo is currently operating two Boeing aircraft on damp lease from Turkish Airlines. The move is part of India's broader response to Turkey's actions, including supplying arms to Pakistan and condemning India's Operation Sindhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-wife-maria-goretti-sebi-ban-57-others-stock-manipulation-case-sadhna-broadcast-ltd-2732975-2025-05-30",
      "headline": "Arshad Warsi, his wife, among 59 people banned from stock market for 1 yearSebi said the group was part of a scheme to artificially raise the price of Sadhna Broadcast shares before selling them to unsuspecting retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/veteran-investor-shankar-sharma-explains-why-most-investors-fail-in-markets-indian-stock-market-investment-tips-2732917-2025-05-30",
      "headline": "Veteran investor explains why most investors fail in marketsAce investor Shankar Sharma said many investors fail to ask tough questions and instead rely on myths. He was critical of the belief that great investors can see into the future, dismissing it as an unrealistic myth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-data-today-q4-fy25-world-fourth-largest-economy-projections-inflation-2732908-2025-05-30",
      "headline": "India GDP data to be released today: What should investors expect?Earlier this year, the National Statistical Office had estimated that India's economy would grow by 6.5% in 2024–25, with an expected growth of 7.6% in the March quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-tumble-10-percent-after-q4-net-loss-should-you-buy-hold-or-sell-2732905-2025-05-30",
      "headline": "Ola Electric shares nosedive 10% after Q4 net loss. Should you buy, hold or sell?Ola Electric's Q4 numbers have laid bare the challenges facing India's EV poster child, from falling volumes and margin pressures to delays in execution. While the company's aggressive bets on electric motorcycles and rural expansion could pay off, the near-term outlook is murky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mazagon-dock-shares-snap-winning-streak-slide-sharply-q4-results-profit-halves-2732892-2025-05-30",
      "headline": "Mazagon Dock shares snap winning streak, tumble 8%. Here's whyThe stock fell to an intraday low of Rs 3,450, retracing from Thursday's close of Rs 3,749. Around 10:07 am, shares of the company were trading 4.75% lower at Rs 3,574.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/suzlon-energy-share-price-13-percent-rise-strong-q4-results-hold-or-sell-expert-view-outlook-2732887-2025-05-30",
      "headline": "Suzlon Energy share price up 13% over strong Q4 results: Should you buy?Suzlon Energy stock price: The shares jumped as much as 13% in early trade, reaching an intraday high of Rs 74.30 on the BSE. This rise comes after Suzlon Energy Ltd announced a sharp rise in its quarterly profit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-suzlon-energy-shares-rose-13-percent-after-strong-q4-results-2732871-2025-05-30",
      "headline": "Explained: Why Suzlon Energy shares rose 13% after Q4 resultsThe sharp rally came after Suzlon posted a 365% year-on-year jump in consolidated net profit for Q4FY25. Profit rose to Rs 1,182 crore from Rs 254 crore in the same quarter last year. Revenue from operations increased 73% to Rs 3,773 crore, compared to Rs 2,179 crore in the year-ago period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-lower-nifty-below-24800-infosys-down-over-1-percent-it-stocks-fall-2732862-2025-05-30",
      "headline": "Sensex opens 150 points lower; Nifty below 24,800; Infosys down over 1%The S&P BSE Sensex was down by 45.58 points to 81,587.44, while the NSE Nifty50 added 24.20 points to 24,857.80 as of 9:25 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/prostarm-info-systems-ipo-allotment-may-30-online-guide-check-status-subscription-gmp-today-listing-date-2732855-2025-05-30",
      "headline": "Prostarm Info Systems IPO allotment: Step-by-step guide to check statusProstarm Info Systems was subscribed to nearly 100 times. The IPO opened for subscription on May 27, 2025, and closed on May 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-to-open-higher-trading-setup-nse-bse-dalal-street-expectation-2732841-2025-05-30",
      "headline": "Stock market opening: Sensex, Nifty likely to open higher today. Here's whyAt 8:14 am, Gift Nifty futures were trading at 24,950, suggesting a positive start above Thursday's Nifty50 close of 24,833.6. This indicates that markets may open with gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-30-lic-baja-auto-ola-electric-nykaa-mazagaon-dock-indigo-2732836-2025-05-30",
      "headline": "Stocks to watch on May 30: LIC, Baja Auto, Ola, Nykaa, Mazagaon Dock, IndiGoAs the week nears its end, investors will be looking out for key movements on Friday, May 30, especially as several companies are expected to release their quarterly earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elf-beauty-buys-hailey-biebers-rhode-in-usd-1-billion-deal-2732645-2025-05-29",
      "headline": "Elf beauty buys Hailey Bieber's Rhode in $1 billion dealElf will acquire Rhode for $600 million in cash and $200 million of newly issued shares of Elf Beauty common stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-dharavi-to-get-a-rs-95790-crore-makeover-in-7-years-2732592-2025-05-29",
      "headline": "Mumbai's Dharavi to get a Rs 95,790 crore makeover in 7 yearsThe redevelopment is being led by a special purpose vehicle (SPV), Navbharat Mega Developers Private Limited (NMDPL), formed through a joint venture between the Maharashtra government's Slum Rehabilitation Authority (SRA) and the Adani Group's Dharavi Redevelopment Project Private Limited (DRPPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-record-home-deal-usvs-chairperson-picks-up-duplexes-for-rs-639-crore-naman-xana-building-on-worli-sea-face-2732547-2025-05-29",
      "headline": "Mumbai's record home deal: USV's chairperson picks up duplexes for Rs 639 croreThese sea-facing homes are in the high-end 40-storey Naman Xana building on Worli Sea Face, offering stunning views of the Arabian Sea. The duplexes are spread across four floors – from the 32nd to the 35th, covering a total area of 22,572 sq ft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-321-points-higher-nifty-above-24800-indusind-bank-up-over-2-2732495-2025-05-29",
      "headline": "Sensex ends 321 points higher, Nifty above 24,800; IndusInd Bank up over 2%The BSE Sensex ended 320.70 points higher at 81,633.02, while the NSE Nifty50 settled 81.15 points higher at 24,833.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/key-financial-changes-in-june-2025-free-aadhaar-update-epfo-3-0-launch-financial-rule-changes-saving-credit-fd-rates-india-2732474-2025-05-29",
      "headline": "From PF access to free Aadhaar update: 5 key financial changes in June 2025The deadline to update your Aadhaar details online for free is June 14, 2025. Those who fail to update their identity and address proof documents by this date will incur a fee of Rs 25 for updates through the online portal or Rs 50 at physical Aadhaar centres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-1-vs-itr-2-eligibility-for-income-tax-filing-2025-26-budget-changes-which-tax-form-should-salaried-individuals-choose-2732371-2025-05-29",
      "headline": "ITR-1 or ITR-2: Know which form suits your 2025-26 tax filingAn informative guide on choosing between ITR-1 and ITR-2 for salaried individuals, highlighting the eligibility criteria and recent updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-nagarjuna-invites-revanth-reddy-to-younger-son-akhil-akkineni-zainabs-wedding-2733723-2025-05-31",
      "headline": "Nagarjuna invites Revanth Reddy to younger son Akhil Akkineni-Zainab's weddingActor Nagarjuna met Telangana Chief Minister Revanth Reddy to extend the invitation to his son Akhil Akkineni's wedding with Zainab Ravdjee. He was accompanied by his wife Amala and the bride's parents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-aishwarya-rajinikanth-son-yathra-school-graducation-2733722-2025-05-31",
      "headline": "Dhanush, Aishwarya Rajinikanth come together for son's school graduation. PicsDhanush and Aishwarya Rajinikanth were proud parents as their eldest son, Yathra, graduated from school. The couple got divorced in November 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bring-back-chinmayi-samantha-supports-singer-after-viral-thug-life-performance-2733686-2025-05-31",
      "headline": "Bring back Chinmayi: Samantha supports singer after being shadow-banned for 8 yearsActor Samantha Ruth Prabhu shared singer Chinmayi Sripada's viral clip from 'Thug Life' music launch event. She questioned the ban on the singer since 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-wishes-lady-love-sobhita-dhulipala-on-birthday-with-vacation-pic-2733670-2025-05-31",
      "headline": "Naga Chaitanya wishes lady love Sobhita Dhulipala on birthday with vacation picActor Naga Chaitanya wished his wife Sobhita Dhuliapala on her thirty third birthday with a cute selfie. The post drew warm reactions from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-pickleball-with-raj-nidimoru-happy-weekend-2733668-2025-05-31",
      "headline": "Samantha plays pickleball with Raj Nidimoru, gives glimpse of her happy weekendActor Samantha Ruth Prabhu shared a clip of herself playing pickleball with director Raj Nidimoru. The two are rumoured to be dating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manushi-chhillar-calls-out-misogynistic-remarks-against-women-a-deep-rooted-bias-2733653-2025-05-31",
      "headline": "Manushi Chhillar calls out misogynistic remarks against women: A deep-rooted biasManushi Chhillar has spoken against the deep-rooted misogynistic mindset undermining women's success in the entertainment industry. She called out the disrespectful comments against women achievers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathis-ai-generated-image-as-hera-pheri-baburao-goes-viral-fans-react-2733612-2025-05-31",
      "headline": "Pankaj Tripathi's AI-generated image as Hera Pheri's Baburao goes viral, fans reactActor Pankaj Tripathi's AI-generated image as Baburao has caught the attention of internet users. The picture has led to debate over casting Tripathi in 'Hera Pheri 3' after Paresh Rawal's departure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-victim-of-terrorism-operation-sindoor-2733655-2025-05-31",
      "headline": "Anupam Kher, victim of terrorism, applauds Operation Sindoor: Felt vindicatedAnupam Kher shared his personal pain as a victim of terrorism and reflects on the plight of Kashmiri Pandits. He commended the Indian Army's Operation Sindoor and urged strong leadership to combat terrorism effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/the-academy-revisits-iconic-aamir-khan-song-radha-kaise-na-jale-from-lagaan-fans-call-it-legendary-2733575-2025-05-31",
      "headline": "The Academy revisits iconic Aamir Khan song from Lagaan, fans call it legendaryThe Academy revisited a clip of the popular song 'Radha Kaise Na Jale' from 'Lagaan' featuring Aamir Khan and Gracy Singh. Indian fans got nostalgic about the iconic track and the groundbreaking visuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-shah-homebound-cinematographer-sexual-harassment-over-20-women-complaint-2733616-2025-05-31",
      "headline": "Homebound cinematographer accused of sexual harassment. Dharma Productions reacts'Homebound' cinematographer Pratik Shah has been accused of sexually inappropriate behaviour. He deleted his Instagram profile after allegations from over 20 women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/priyanka-chopra-lara-dutta-casting-choice-director-suneel-darshan-in-andaaz-2733601-2025-05-31",
      "headline": "Nobody had faith in Priyanka Chopra: Director Suneel Darshan on Andaaz castingFilmmaker Suneel Darshan shared exclusive insights on the casting choices behind the 2003 hit 'Andaaz' that introduced Lara Dutta and Priyanka Chopra to Bollywood. The film's fresh pairing and Akshay Kumar's support played key roles in their breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-on-admiring-keanu-reeves-in-the-matrix-john-wick-i-dig-those-movies-2733552-2025-05-31",
      "headline": "Tom Cruise on admiring Keanu Reeves in The Matrix, John Wick: I dig those moviesActor Tom Cruise recently opened up about his admiration for 'Speed,' 'The Matrix' and 'John Wick' franchise featuring Keanu Reeves. The 'Mission Impossible: 8' actor praised Reeves for his charisma in his films."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-nadu-movie-ticket-price-reduce-thug-life-release-local-body-tax-2733572-2025-05-31",
      "headline": "Movie ticket prices to reduce in Tamil Nadu ahead of Thug Life release. Here's howTamil Nadu movie ticket prices will reduce after the government slashed the local body tax by half. Kamal Haasan had earlier appealed to the government to cut down the local body tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-kannappa-akshay-kumar-cameo-2733558-2025-05-31",
      "headline": "Wasn't easy to reach Akshay Kumar: Vishnu Manchu on star-studded Kannappa castingActor Vishnu Manchu discussed the emotional and creative process behind casting for 'Kannappa', a personal passion project for his father Mohan Babu. He highlighted the importance of personal relationships and support from industry veterans in bringing the project to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-bollywood-silence-operation-sindoor-hypocrisy-2733490-2025-05-31",
      "headline": "Javed Akhtar weighs in on Bollywood's silence on Operation SindoorJaved Akhtar addressed criticism of Bollywood's silence on Operation Sindoor, stressing that not everyone is obliged to speak. He also challenged the notion of expecting artistes to respond to all issues when there are risks involved."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-accuse-brother-manoj-manchu-theft-kannappa-hard-disk-2733481-2025-05-31",
      "headline": "Actor Vishnu Manchu accuses brother Manoj over alleged theft of Kannappa hard diskTelugu actor Vishnu Manchu accused his brother Manoj Manchu over the alleged theft of Kannappa's hard disk. Over the past few months, the brothers have been involved in a family feud, which resulted in Manoj being ousted from their father Mohan Babu's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-can-you-watch-the-tony-awards-this-year-streaming-details-inside-glbs-2733445-2025-05-31",
      "headline": "How can you watch the Tony Awards this year? Streaming details insideThe 2025 Tony Awards will be live on June 8 with top nominees, historic firsts, and a Hamilton cast reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emmy-winning-actress-and-mash-star-loretta-swit-dies-at-87-glbs-2733439-2025-05-31",
      "headline": "Emmy-winning actress and MASH star Loretta Swit dies at 87Loretta Swit, renowned for her role as Major Houlihan in MASH, has died at 87. The Emmy-winning actress redefined female roles on TV and was also a passionate animal rights advocate."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-president-mallikarjun-kharge-slams-centre-as-cds-general-anil-chauhan-admits-jet-loss-2733715-2025-05-31",
      "headline": "Government misled nation: Mallikarjun Kharge on top general's 'jets downed' remarkMallikarjun Kharge's attack came after CDS Chauhan said that an unspecified number of India's fighter jets were downed during the military conflict with Pakistan, but asserted that the armed forces rectified mistakes quickly to hit Islamabad again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/active-covid-19-cases-india-kerala-maharashtra-highest-deaths-reported-health-ministry-2733740-2025-05-31",
      "headline": "Active Covid tally in India crosses 3,000-mark, 4 deaths reported so farFour deaths were reported in the past 24 hours as the number of active Covid-19 cases reached 3,395 across the country. Kerala has the most number of active cases so far, with 1,336."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-general-ani-chauhan-india-lost-fighter-jets-operation-sindoor-pakistan-2733656-2025-05-31",
      "headline": "Understood mistakes, rectified them: Top General reflects on Op Sindoor lossesChief of Defence Staff General Anil Chauhan, however, dismissed the Pakistan Prime Minister's claims that it shot down six Indian jets, calling it 'absolutely incorrect'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/security-drills-jammu-kashmir-punjab-rajasthan-india-pak-tensions-government-2733724-2025-05-31",
      "headline": "Evacuation simulations, blackout scenarios: Security drills in states bordering PakOperation Shield, the second phase of the nationwide security drills, was held in Jammu and Kashmir, Gujarat, Punjab and Rajasthan - the states bordering Pakistan. The exercise included blackout protocols, evacuation simulations and coordinated emergency response checks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/thailand-opal-suchata-crowned-miss-world-2025-winner-2733756-2025-05-31",
      "headline": "Thailand's Opal Suchata Chuangsri crowned Miss World 2025Thailand's Opal Suchata Chuangsri has won the Miss World 2025 title. Nandini Gupta represented India and made it to the top 20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-victim-of-terrorism-operation-sindoor-2733655-2025-05-31",
      "headline": "Anupam Kher, victim of terrorism, applauds Operation Sindoor: Felt vindicatedAnupam Kher shared his personal pain as a victim of terrorism and reflects on the plight of Kashmiri Pandits. He commended the Indian Army's Operation Sindoor and urged strong leadership to combat terrorism effectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-jairam-ramesh-pm-modi-silence-donald-trump-india-pakistan-ceasefire-nuclear-war-2733634-2025-05-31",
      "headline": "9th time in 20 days: Jairam Ramesh asks PM to clarify 'Donaldbhai's' Pak claimThe fresh attack by Congress's Jairam Ramesh came as Trump reiterated his claim that he avoided a potential nuclear disaster by mediating the ceasefire between India and Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/harvard-president-alan-garber-jab-donald-trump-speech-2025-batch-standing-ovation-2733586-2025-05-31",
      "headline": "Harvard president's dig at Trump with 'around the world' remark gets standing ovationHarvard University President Alan Garber's opening lines drew loud applause at the historic Tercentenary Theatre in Harvard Yard. This comes as the Donald Trump administration has been targeting the enrolment of international students at the institution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtube-video-confirms-isi-trained-indian-spy-kasim-visited-pakistan-twice-2733661-2025-05-31",
      "headline": "'Feels like home': Interview video of Indian 'spy' in Pak alerted agenciesKasim was apprehended from the Deeg area of Mewat in Rajasthan on Thursday for allegedly spying at the behest of Pakistani intelligence agency Inter-Service Intelligence (ISI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-rubbishes-rumours-of-rift-with-hardik-pandya-2733695-2025-05-31",
      "headline": "Shubman Gill rubbishes rumours of rift with Hardik Pandya through Instagram storyStar India batter Shubman Gill rubbished rumours of rift with Hardik Pandya after clips of their awkward exchange at the toss ahead of Gujarat Titans vs Mumbai Indians Eliminator game went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-colombia-statement-condemning-pakistan-deaths-in-operation-sindoor-2733470-2025-05-31",
      "headline": "Confident that…: Colombia's U-turn on Pak deaths after Shashi Tharoor's disapprovalColombia has withdrawn its statement condemning the deaths in Pakistan during India's Operation Sindoor following Congress MP Shashi Tharoor's rebuttal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-madhya-pradesh-operation-sindoor-indias-nari-shakti-brought-their-end-2733574-2025-05-31",
      "headline": "Sindoor biggest, most successful anti-terror operation in India's history: PMPM Modi said terror camps were destroyed by penetrating hundreds of kilometres into Pakistan, calling 'Sindoor'  the biggest and most successful operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jeff-bezoss-blue-origin-launches-six-customers-on-tourist-flight-to-space-2733709-2025-05-31",
      "headline": "Jeff Bezos's Blue Origin launches six customers on tourist flight to spaceThe suborbital flight lasted approximately 11 minutes, propelling the crew above the Kármán line—the internationally recognized boundary of space at 100 kilometers altitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mit-bans-indian-origin-student-megha-vemuri-graduation-ceremony-pro-palestine-speech-2733628-2025-05-31",
      "headline": "MIT bans Indian-origin student from graduation event over pro-Palestine speechThe Class of 2025 president, Megha Vemuri of Massachusetts Institute of Technology (MIT), earlier delivered a pro-Palestine speech following which she was barred from attending the official graduation commencement ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-law-student-arrested-gurugram-for-offensive-operation-sindoor-linked-remarks-2733510-2025-05-31",
      "headline": "Pune law student arrested in Gurugram for offensive Op Sindoor-linked remarksSharmistha Panoli, a Pune law student, was arrested by Kolkata Police from Gurugram on Thursday night over \"disrespectful and derogatory remarks\" targeting a particular religion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/firooza-amiri-afghanistan-womens-cricket-taliban-exclusive-interview-2733519-2025-05-31",
      "headline": "From hostility to hope: Afghanistan women's cricket sees a new dawnIn an exclusive chat with India Today Digital, Firooza Amiri narrated how the Afghanistan women's cricketers took exile in Australia after fleeing their home country following the Taliban takeover. Amiri spoke about her fandom for Virat Kohli and fondly recalled the match against Cricket Without Borders XI in Melbourne."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-pakistan-india-trade-talks-representatives-visit-washington-next-week-close-to-deal-operation-sindoor-2733602-2025-05-31",
      "headline": "Pak rushes to US for trade talks as Trump says close to sealing deal with IndiaUS President Donald Trump said that Pakistani representatives will be coming to America next week for trade talks, even as he highlighted that his administration is \"very close to making a deal with India\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-india-pakistan-conflict-strategy-indian-ocean-region-china-2733532-2025-05-31",
      "headline": "If we get hostility in return...: Chief of Defence Staff spells out Pak strategySpeaking at the Shangri-La Dialogue, General Anil Chauhan said India's current policy against Pakistan was of strategic disengagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-reacts-to-emmanuel-macron-wife-slap-video-says-couple-was-just-joking-2733433-2025-05-31",
      "headline": "Make sure door remains closed: Trump's advice to Emmanuel Macron after slap videoTrump said he had spoken to Macron and assured reporters that the couple was fine. He added that they are two good people he knows very well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Partition trauma lives in Sindhi hearts: Javed Akhtar slams Pak actor on rent rowJaved Akhtar countered Pakistani actor Bushra Ansari's statement on Muslims being denied homes in Mumbai, sharing his own experiences of prejudice. He urged people to reflect on the historical causes behind current social tensions, highlighting the trauma of Sindhis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/what-neet-counselling-guides-wont-tell-you-but-mentors-will-2733629-2025-05-31",
      "headline": "NEET rank isn't everything. Here's what truly shapes your medical seat allocationYour NEET UG rank is just one factor in securing a seat. It is far more complex. From choice-filling tactics to college fit, here's what experts say really influences your counselling outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-492-30-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-raj-kundra-press-conference-financial-irregularities-2733760-2025-05-31",
      "headline": "Former Rajasthan Royal co-owner threatens to expose finiachial irregularitiesFormer Rajasthan Royals co-owner Raj Kundra has stirred fresh controversy by alleging financial misconduct and offshore laundering by a top team promoter—adding to the franchise's woes after their disastrous IPL 2025 campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-final-live-score-updates-luis-enrique-simone-inzaghi-munich-2733758-2025-05-31",
      "headline": "UEFA Champions League final live updates: PSG, Inter battle for ultimate glory in MunichUEFA Champions League Final live score and updates: PSG and Inter Milan will lock horns for ultimate glory in the Champions League final in Munich on May 31. Inter are chasing their fourth UCL title while PSG look for their first one. Lautaro Martinez and Ousmane Dembele will hold the key for their respective sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-dabang-delhi-defeat-jaipur-patriots-campaign-kick-off-2733757-2025-05-31",
      "headline": "Dabang Delhi crush Jaipur Patriots 11-4 to begin UTT 2025 campaignDabang Delhi TTC kicked off their UTT 2025 journey in style, overpowering Jaipur Patriots 11-4 with dominant performances from Sathiyan Gnanasekaran, Quek Izaac, and Diya Chitale in the season opener on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/soham-desai-departure-india-cricket-strength-conditioning-coach-2733754-2025-05-31",
      "headline": "Indian team support staff confirms exit, Siraj pens heartfelt goodbyeSoham Desai has announced his departure from his role as the Indian cricket team's strength and conditioning coach. His exit marks a significant change following staff reshuffles after the Border-Gavaskar Trophy 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-7-results-alexander-zverev-jack-draper-joao-fonseca-2733755-2025-05-31",
      "headline": "Alexander Zverev advances, Joao Fonseca knocked out by Jack DraperAlexander Zverev continued his march at the French Open as he went past Flavio Cobolli in straight sets on Saturday, May 31. Joao Fonseca's impressive run at the tournament came to a screetching end as fifth seed Jack Draper dispatched him easily in the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-paulo-badosa-exit-mirra-andreeva-jessica-pegula-advance-2733745-2025-05-31",
      "headline": "10th seed Badosa crashes out of Roland Garros as Andreva and Pegula advancePaula Badosa's French Open journey ended in the third round, while Mirra Andreeva and Jessica Pegula surged into the last 16 with commanding wins, setting up a potentially explosive second-week showdown in Paris."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-asia-cup-relocation-india-visas-2733737-2025-05-31",
      "headline": "Pakistan hockey to seek Asia Cup relocation if India fails to assure visas: ReportThe Pakistan Hockey Federation has threatened to seek a relocation of the Asia Cup from India if the visas are not guaranteed for their national team, according to a report from PTI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-kagiso-rabada-drug-ban-2733721-2025-05-31",
      "headline": "Kagiso Rabada looking to move on from drug ban: Won't be Mr-I-Apologise-Too-MuchKagiso Rabada said that he is looking to move on from the drug ban and won't be apologizing too much about the incident ahead of the World Test Championship final against Australia. Rabada is expected to lead South Africa's pace attack in the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jannik-sinner-win-vs-jiri-lehechka-into-4th-round-paris-2733720-2025-05-31",
      "headline": "Jannik Sinner cruises into French Open 4th round with flawless Lehecka winJannik Sinner showed no mercy at Roland Garros, thrashing Jiri Lehecka in straight sets to book a spot in the French Open fourth round. The World No. 1 continued his flawless run in Paris, as he now gears up for a clash against Alexander Rublev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-2nd-odi-playing-xi-jamie-overto-ruled-out-cardiff-2733712-2025-05-31",
      "headline": "ENG vs WI: England forced to make one change for 2nd ODI as Overton ruled outEngland have been forced to make one change to their lineup for the second ODI as Jamie Overton has been ruled out for the rest of the series. Overton sustained a finger injury during the first ODI win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-medal-winners-full-list-tally-asian-athletics-championship-2025-2733708-2025-05-31",
      "headline": "Asian Athletics Championships 2025: India's full list of medal winnersThe Indian contingent at the Asian Athletics Championships 2025 finished with a strong outing in Gumi, Korea. On the final day of the competition, India won 6 medals, taking their tally to a total of 24 in the competition.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-asia-cup-relocation-india-visas-2733737-2025-05-31",
      "headline": "Pakistan hockey to seek Asia Cup relocation if India fails to assure visas: ReportThe Pakistan Hockey Federation has threatened to seek a relocation of the Asia Cup from India if the visas are not guaranteed for their national team, according to a report from PTI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-kagiso-rabada-drug-ban-2733721-2025-05-31",
      "headline": "Kagiso Rabada looking to move on from drug ban: Won't be Mr-I-Apologise-Too-MuchKagiso Rabada said that he is looking to move on from the drug ban and won't be apologizing too much about the incident ahead of the World Test Championship final against Australia. Rabada is expected to lead South Africa's pace attack in the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jannik-sinner-win-vs-jiri-lehechka-into-4th-round-paris-2733720-2025-05-31",
      "headline": "Jannik Sinner cruises into French Open 4th round with flawless Lehecka winJannik Sinner showed no mercy at Roland Garros, thrashing Jiri Lehecka in straight sets to book a spot in the French Open fourth round. The World No. 1 continued his flawless run in Paris, as he now gears up for a clash against Alexander Rublev."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-2nd-odi-playing-xi-jamie-overto-ruled-out-cardiff-2733712-2025-05-31",
      "headline": "ENG vs WI: England forced to make one change for 2nd ODI as Overton ruled outEngland have been forced to make one change to their lineup for the second ODI as Jamie Overton has been ruled out for the rest of the series. Overton sustained a finger injury during the first ODI win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-medal-winners-full-list-tally-asian-athletics-championship-2025-2733708-2025-05-31",
      "headline": "Asian Athletics Championships 2025: India's full list of medal winnersThe Indian contingent at the Asian Athletics Championships 2025 finished with a strong outing in Gumi, Korea. On the final day of the competition, India won 6 medals, taking their tally to a total of 24 in the competition.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}