{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-9705-minors-sign-up-on-day-1-how-to-open-account-online-offline-documents-2603579-2024-09-20",
      "headline": "NPS Vatsalya: 9,705 minors sign up on Day 1. Here's how to invest for your child?The scheme, overseen by the Pension Fund Regulatory and Development Authority (PFRDA), is part of the National Pension System (NPS) and aims to help parents and guardians begin retirement savings for their children from an early age"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-scans-paytm-qr-at-vishwakarma-exhibition-highlights-fintechs-role-for-small-merchants-2603537-2024-09-20",
      "headline": "PM Modi scans Paytm QR at Vishwakarma exhibition, highlights fintech's role for small merchantsPM Modi bought an artefact of Bhagwan Jagannath and paid via Paytm QR, showcasing not only the significance of the crafts but also the role of fintech in empowering small merchants and fostering increased trust in mobile payments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/study-shows-people-us-need-to-work-5-days-to-buy-iphone-16-how-long-do-indians-need-2603531-2024-09-20",
      "headline": "Study shows people in US work 5 days to buy iPhone 16; how long do Indians need?A recent study reveals how long people in different countries need to work in order to afford the iPhone 16, with citizens in Switzerland requiring the least number of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-work-no-pay-termination-samsung-warns-workers-on-strike-in-chennai-report-2603462-2024-09-20",
      "headline": "No work, no pay: Samsung warns workers on strike in Chennai The strike, which began on September 9, 2024, involves hundreds of workers at Samsung's home appliances factory near Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1400-points-higher-nifty-above-25800-icici-bank-jumps-5-2603442-2024-09-20",
      "headline": "Sensex ends 1,400 points higher, Nifty above 25,800; ICICI Bank jumps 5%At the closing bell, the S&P BSE Sensex was up 1,381.99 points to 84,566.79, while the NSE Nifty50 gained 375.15 points to settle at 25,790.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-shares-reason-behind-his-one-day-exit-from-ey-rs-1-crore-package-check-here-2603418-2024-09-20",
      "headline": "Ashneer Grover shares why he quit EY in a day despite Rs 1 crore salaryIn an old video, Grover shares why he left Ernst & Young (EY) on his very first day despite being offered a Rs 1 crore salary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-vodafone-idea-shares-after-20-percent-fall-ubs-nomura-novuma-new-target-price-2603391-2024-09-20",
      "headline": "Should you buy Vodafone Idea shares after 20% fall? UBS shares new target priceVodafone Idea shares fell 20% after the Supreme Court on Thursday dismissed the company's curative petition, which sought a re-computation of Adjusted Gross Revenue (AGR) dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-iifl-finance-shares-surged-13-percent-today-2603356-2024-09-20",
      "headline": "Explained: Why IIFL Finance shares surged 13% todayIIFL Finance stock climbed to a high of Rs 560.60, marking its peak since late February, before settling to trade 9.31% higher as of 2:06 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-shares-jump-10-percent-today-ftse-all-world-index-inclusion-2603280-2024-09-20",
      "headline": "Explained: Why Cochin Shipyard shares soared 10% todayAt around 12:25 pm, shares of the company were up 9.45% at Rs 1,837.30 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2603255-2024-09-20",
      "headline": " Western Carriers IPO allotment: Step-by-step guide to check statusWestern Carriers IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-16-in-10-minutes-quick-commerce-blinkit-steals-spotlight-from-e-commerce-giants-2603215-2024-09-20",
      "headline": "iPhone 16 in 10 minutes: Quick commerce firms bring fight to Amazon, FlipkartiPhone 16 sales: Quick commerce platforms like Blinkit, BigBasket and Zepto have started delivering the latest iPhone 16 in minutes, challenging traditional e-commerce giants Amazon and Flipkart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-ipo-allotment-latest-gmp-step-by-step-guide-to-check-status-2603206-2024-09-20",
      "headline": "Northern Arc IPO allotment: Latest GMP, step-by-step guide to check statusNorthern Arc IPO allotment: To check their share allocation, investors should visit the IPO registrar's portal or the BSE and NSE websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rites-share-price-up-over-7-percent-railway-psu-stock-ex-bonus-dividend-2603180-2024-09-20",
      "headline": "RITES shares rise 8% but why railway PSU stock may be showing 48% slideDespite this positive momentum, many investors were caught off guard, seeing what appeared to be a 48% slide in the stock price on their trading apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-intern-to-ceo-elliott-hill-32-year-journey-at-nike-linkendin-profile-goes-viral-2603178-2024-09-20",
      "headline": "Elliott Hill's 32-year journey at Nike from intern to CEO goes viralElliott Hill, who has spent over 32 years at Nike, started his journey as an intern and will now be leading the iconic company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-500-points-nifty-gains-momentum-rites-jumps-over-7-2603164-2024-09-20",
      "headline": "Sensex surges 500 points, Nifty gains momentum; JSW Steel jumps 3%The S&P BSE Sensex was up 415.45 points at 83,600.25 at 10:16 am, while the NSE Nifty50 gained 135.80 points to trade at 25,550.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-ipo-allotment-check-status-latest-subscription-gmp-listing-gains-2603115-2024-09-20",
      "headline": "Arkade Developers IPO allotment: Check status, GMP, subscription Arkade Developers IPO allotment: Investors can check their allotment status by logging into the BSE website or the Bigshare Services Pvt Ltd website, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-after-us-feds-50-bps-rate-cut-ntpc-gains-2602758-2024-09-19",
      "headline": "Sensex, Nifty end higher after US Fed's 50 bps rate cut; NTPC gainsThe S&P BSE Sensex ended 236.57 points higher at 83,184.80, while the NSE Nifty50 settled 38.25 points higher at 25,415.80. Both the indices had hit fresh all-time highs in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-arrives-in-us-to-join-quad-summit-meeting-with-president-biden-next-2604157-2024-09-21",
      "headline": "'Always a delight': PM arrives in US, meets Indian community ahead of Quad Summit Live UpdatesPM Modi's visit includes bilateral meetings with US President Joe Biden and other world leaders, focusing on strengthening cooperation in the Indo-Pacific and addressing global challenges like the Ukraine and Gaza conflicts. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/atishi-takes-oath-new-delhi-cm-arvind-kejriwal-aap-manish-sisodia-2604042-2024-09-21",
      "headline": "AAP's Atishi takes oath as Delhi's Chief Minister, 5 leaders join her CabinetAtishi succeeded Arvind Kejriwal who resigned earlier this week as Delhi Chief Minister after being released on bail in a liquor policy case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-remarks-sikhs-bjp-indians-practice-their-religion-congress-2604029-2024-09-21",
      "headline": "Rahul Gandhi breaks silence on his Sikh remark in US: BJP spreading liesDays after receiving criticism from BJP leaders over his comments on Sikhs in the US, Congress MP Rahul Gandhi said that the BJP has been spreading lies about his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoo-animal-fat-row-ayodhya-ram-temple-pran-pratishtha-2603906-2024-09-21",
      "headline": "Tirupati laddoos were distributed during Ram temple event, says chief priestTirupati laddoos row: Ram Temple chief priest Acharya Satyendra Das has said that laddoos from Tirupati temple were distributed as prasadam during the pran prathistha January ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-sleepmaxxing-and-why-influencers-are-doing-it-for-perfect-sleep-2602137-2024-09-21",
      "headline": "What is sleepmaxxing, and why influencers are doing it for perfect sleep Sleepmaxxing is a trend where people strive to perfect their sleep by eliminating potential disturbances and using various sleep-enhancing tools. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-3-report-rishabh-pant-shubman-gil-chennai-2604040-2024-09-21",
      "headline": "IND vs BAN, 1st Test Day 3: Pant-Gill brilliance puts India on the verge of winA brilliant partnership between Rishabh Pant and Shubman Gill put India on course for a win in the first Test in Chennai on Day 3. Gill and Pant scored hundreds on Saturday, September 21 as India need 6 more wickets for the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-us-visit-joe-biden-unga-address-quad-summit-indian-community-address-2603798-2024-09-21",
      "headline": "PM Modi greeted by Indian community in Philadelphia, to meet Quad leaders soonPrime Minister Narendra Modi arrived in the US on Saturday for a three-day visit to attend a Quad summit and address a key conclave at the United Nations. The Indian community in the US welcomed the prime minister in a grand manner, with music, dance, and warm greetings. A group of women also performed the Garba dance. PM Modi will hold separate bilateral meetings with US President Joe Biden and other world leaders on the sidelines of the Quad summit in Wilmington, Delaware, and the 'Summit of the Future' at the UN General Assembly in New York. He will also meet members of the Indian community in the US. Stay tuned to India Today for the latest updates on PM Modi's US visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-new-delhi-chief-minister-bring-back-arvind-kerjriwal-as-cm-first-speech-aap-2604090-2024-09-21",
      "headline": "Bring Arvind Kejriwal back: Atishi in 1st speech as Delhi Chief MinisterAtishi was sworn in as the 8th Chief Minister of Delhi on Saturday at Raj Niwas. She succeeded Arvind Kejriwal, who resigned from the post earlier this week after being released on bail in the liquor policy case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/decoding-the-fatigue-of-action-and-violence-in-indian-cinema-kill-thiruchitrambalam-bade-miyan-chote-miyan-leo-jailer-cinematic-saturday-2602727-2024-09-21",
      "headline": "Audiences have had enough, action movies need an intervalAction and violent films have been on the rise in Indian cinema in the last couple of years. However, not many action films have seen box office success in 2024. Is there an action-film fatigue among the audience?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-rocket-school-gaza-palestinians-israel-army-hamas-command-centre-2604095-2024-09-21",
      "headline": "22 killed as Israeli rocket hits school in Gaza: 'Kids, women were sitting...'Palestinians said an Israeli strike killed at least 22 people in a school sheltering displaced people in southern Gaza City on Saturday, while the Israeli military said the attack targeted a command centre of militant group Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-new-delhi-cm-woman-chief-ministers-in-india-aap-arvind-kejriwal-2604080-2024-09-21",
      "headline": "Atishi becomes Delhi's third woman Chief Minister, 17th in India's historyA first-time legislator, Atishi is a key face of the party and managed AAP's operations during Arvind Kejriwal's time in Tihar jail in connection with the excise policy case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/kourtney-kardashian-has-a-natural-ozempic-for-weight-loss-is-it-a-scam-2602790-2024-09-21",
      "headline": "Kourtney Kardashian has a 'natural Ozempic' for weight loss. Is it a scam?Ozempic is a medication for Type 2 diabetes that helps control blood sugar, with the added side effect of weight loss. Socialite and reality TV personality Kourtney Kardashian has a natural alternative to Ozempic that she is going gaga over. What do doctors have to say?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-takes-oath-delhi-chief-minister-arvind-kejriwal-lg-vk-saxena-bjp-leaders-2604084-2024-09-21",
      "headline": "Watch: Atishi touches Arvind Kejriwal's feet after taking oath as Chief MinisterAam Aadmi Party (AAP) leader Atishi touched Arvind Kejriwal's feet after taking oath as Chief Minister. She was sworn in as the 8th Chief Minister of Delhi on Saturday at Raj Niwas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tirupati-laddoos-row-animal-fat-amul-files-complaint-social-media-users-2603984-2024-09-21",
      "headline": "Amul files complaint against X users for linking it to Tirupati laddoos row Amul has lodged a complaint with the Ahmedabad Cyber Crime Police Station against false claims made on social media, alleging that the company supplied the ghee used in the Tirupati temple's laddoos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/student-films-women-bengaluru-college-bathroom-threatens-kill-exposed-arrested-2603915-2024-09-21",
      "headline": "Student films women in Bengaluru college bathroom, threatens to kill if exposedHundreds of students, including men and women, protested at the college campus after the incident came to light. Visuals showed police trying to pacify the protesting students. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-marshal-amar-preet-singh-new-air-force-chief-to-take-charge-from-september-30-2603960-2024-09-21",
      "headline": "Air Marshal Amar Preet Singh to take over as new Air Force chief from September 30The government has appointed Air Marshal Amar Preet Singh, currently serving as the Vice Chief of the Air Staff, to be the next Chief of the Air Staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-runs-number-3-2604082-2024-09-21",
      "headline": "Assured and calm Shubman Gill slowly making No.3 his ownShubman Gill scored a stunning century in the 1st Test match against Bangladesh. After his initial struggles at No.3, Shubman is slowly making the spot his own in the Indian Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-422-21-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/comedian-sudesh-lehri-gets-injured-with-knife-on-laughter-chefs-set-2604099-2024-09-21",
      "headline": "Comedian Sudesh Lehri gets injured with knife on Laughter Chefs setComedian Sudesh Lehri was cooking with co-contestant Nia Sharma, when he met with an accident in the kitchen. The incident happened on the same day Reem Shaikh got injured on the sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/edelweiss-ceo-radhika-gupta-shark-tank-airlines-flight-breakfast-menu-2603971-2024-09-21",
      "headline": "Spare us the sandwich: Edelweiss CEO's request to airlines on breakfast menuEdelweiss CEO Radhika Gupta has asked airlines to end boxed food items like sandwiches and include healthier and tastier dishes like parathas, idlis, and dhoklas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/neptune-visible-from-india-furthest-planet-solar-system-opposition-sun-2603632-2024-09-20",
      "headline": "Tiny blue dot: You can see Neptune from India tonightFor observers in India, Neptune will be visible throughout most of the night on September 21-22, rising in the east just as the sun sets in the west."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-drunk-driver-goes-on-rampage-in-lucknow-chased-down-by-locals-2603928-2024-09-21",
      "headline": "'Drunk' driver goes on rampage in Lucknow, chased down by localsThe Lucknow Police arrested a man after he rammed his car into several people in the city's Rumi Gate area allegedly under the influence of alcohol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-rohit-saraf-past-zero-calories-appreciation-post-2603900-2024-09-21",
      "headline": "Janhvi Kapoor treats Rohit Saraf with 'zero Kcal' pastaJanhvi Kapoor treated her co-star Rohit Saraf to a guilt-free pasta dish with zero calories. The two are set to star in the film Sunny Sanskari Ki Tulsi Kumari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-pager-blasts-lebanon-israel-businessman-kerela-india-hungary-norway-rinson-hose-bulgaria-2603617-2024-09-20",
      "headline": "Why Kerala-born businessman's name has come up in Hezbollah pager blasts?As the focus shifts to companies linked to the exploding pagers being used by Hezbollah members, the name of a Kerala-born businessman, Rinson Jose, and his Bulgaria-based company Norta Global cropped up. They have been given a clean chit by Bulgarian authorities. However, the entire saga points to a complex web of companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-paris-concert-fan-throws-phone-singer-reacts-2604134-2024-09-21",
      "headline": "Fan throws phone at Diljit Dosanjh in Paris, his reaction is winning heartsDiljit Dosanjh recently toured Paris. A viral video from his concert in the city captured a concertgoer hurling a phone at the singer. Diljit's reaction was everything. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-shines-in-purple-gown-at-her-brother-david-wedding-in-us-2604117-2024-09-21",
      "headline": "Samantha shines in purple gown at her brother David's wedding in USSamantha attended her older brother, David Prabhu's wedding in the United States on September 21. She shared stunning photos of herself in a stunning purple gown from the wedding on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-karanveer-mehra-padmini-kolhapure-2604103-2024-09-21",
      "headline": "Karanveer Mehra in Bigg Boss 18, Padmini Kolhapure also approachedThe highly anticipated Bigg Boss 18 is scheduled to premiere in October. In anticipation of its launch, India Today Digital has exclusively learnt that TV actor Karanveer Mehra is set to participate in the Salman Khan-hosted reality TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/comedian-sudesh-lehri-gets-injured-with-knife-on-laughter-chefs-set-2604099-2024-09-21",
      "headline": "Comedian Sudesh Lehri gets injured with knife on Laughter Chefs setComedian Sudesh Lehri was cooking with co-contestant Nia Sharma, when he met with an accident in the kitchen. The incident happened on the same day Reem Shaikh got injured on the sets. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-shreyas-iyer-ricky-bhui-2604172-2024-09-21",
      "headline": "Duleep Trophy: Shreyas Iyer, Ricky Bhui heroics help India D seize controlDuleep Trophy: Ricky Bhui neared his century while Shreyas Iyer scored a fifty to hand India D control in their match against Abhimanyu Easwaran's India C. India D led by 311 runs after Day 3 with 5 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-carlos-alcaraz-ben-shelton-frances-tiafoe-daniil-medvedev-2604167-2024-09-21",
      "headline": "Carlos Alcaraz beats Ben Shelton, Frances Tiafoe stuns Medvedev  Laver Cup 2024: Frances Tiafoe came back from behind to beat Daniil Medvedev while Carlos Alcaraz got the better of Ben Shelton at the Uber Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-injury-india-vs-bangladesh-test-match-2604159-2024-09-21",
      "headline": "Not aware of Shakib Al Hasan's injury: Batting coach David HempBangladesh batting coach David Hemp said that he was not aware of any injury to Shakib Al Hasan's finger. Hemp reacted to the speculation made by Murali Karthik during commentary in the Chennai Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-bangladesh-stick-to-positive-batting-against-attacking-indian-bowlers-2604147-2024-09-21",
      "headline": "Bangladesh stick to positive batting against attacking Indian bowlersIND vs BAN: Batting coach David Hemp said that Indian bowlers attacked the stumps, but also talked about the importance of Bangladesh batters sticking to their positive approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-adil-rashid-becomes-1st-england-spinner-to-complete-200-odi-wickets-2604130-2024-09-21",
      "headline": "ENG vs AUS: Adil Rashid becomes 1st England spinner to complete 200 ODI wicketsAdil Rashid became the 1st spinner and only the 3rd England bowler to pick 200 ODI wickets. He achieved this feat during the 2nd ODI match between England and Australia by dismissing Glenn Maxwell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-champions-cup-saim-ayub-babar-azam-century-stallions-panthers-2604120-2024-09-21",
      "headline": "Watch: Saim Ayub plunders 156 against Babar Azam's Stallions Pakistan Champions Cup: Saim Ayub smashed 156 runs off 130 balls with 13 fours and seven sixes, helping Panthers scored 326 for seven against Stallions at the Iqbal Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-finds-pleasure-seeing-rishabh-pant-score-his-comeback-ton-vs-ban-2604115-2024-09-21",
      "headline": "Shubman Gill finds pleasure seeing Rishabh Pant score his comeback ton vs BANShubman Gill said that he found pleasure in seeing Rishabh Pant scoring his 6th Test hundred after comeback to Test cricket. Gill was also content with his performance in 1st Test vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-chennai-rishabh-pant-2604109-2024-09-21",
      "headline": "Bro calm down: Shubman Gill reveals hilarious Chennai story ft. Rishabh PantIndia vs Bangladesh: India batter Shubman Gill revealed a hilarious story about Rishabh Pant from the Chennai Test match. Shubman said that he asked Rishabh Pant to calm down after the wicketkeeper came to tap bats while celebrating during their partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-travis-head-t20s-test-cricket-format-2604104-2024-09-21",
      "headline": "I find T20s the hardest, Test cricket the easiest: Travis Head ENG vs AUS: Travis Head said that he finds Test cricket the easiest and enjoys playing in the longer format while mentioning that pressure of expectation makes T20 cricket the hardest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-series-gave-me-confidence-to-bat-at-no3-says-shubman-gill-2604101-2024-09-21",
      "headline": "England series gave me confidence to bat at No.3 says Shubman GillIndia vs Bangladesh: India's centurion in Chennai Test match, Shubman Gill said that the Test series against England gave him the confidence to bat at No.3. Gill has been prolific in his last 5 Tests in his new position in the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rishabh-pant-hundred-test-cricket-comeback-2604087-2024-09-21",
      "headline": "With emotional hundred, Rishabh Pant seamlessly resumes love affair with TestsIndia vs Bangladesh, Chennai Test: India wicketkeeper Rishabh Pant marked his Test comeback with an emotional hundred on a hot afternoon in Chennai, rekindling his love affair with the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-finds-pleasure-seeing-rishabh-pant-score-his-comeback-ton-vs-ban-2604115-2024-09-21",
      "headline": "Shubman Gill finds pleasure seeing Rishabh Pant score his comeback ton vs BANShubman Gill said that he found pleasure in seeing Rishabh Pant scoring his 6th Test hundred after comeback to Test cricket. Gill was also content with his performance in 1st Test vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-chennai-rishabh-pant-2604109-2024-09-21",
      "headline": "Bro calm down: Shubman Gill reveals hilarious Chennai story ft. Rishabh PantIndia vs Bangladesh: India batter Shubman Gill revealed a hilarious story about Rishabh Pant from the Chennai Test match. Shubman said that he asked Rishabh Pant to calm down after the wicketkeeper came to tap bats while celebrating during their partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-travis-head-t20s-test-cricket-format-2604104-2024-09-21",
      "headline": "I find T20s the hardest, Test cricket the easiest: Travis Head ENG vs AUS: Travis Head said that he finds Test cricket the easiest and enjoys playing in the longer format while mentioning that pressure of expectation makes T20 cricket the hardest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-series-gave-me-confidence-to-bat-at-no3-says-shubman-gill-2604101-2024-09-21",
      "headline": "England series gave me confidence to bat at No.3 says Shubman GillIndia vs Bangladesh: India's centurion in Chennai Test match, Shubman Gill said that the Test series against England gave him the confidence to bat at No.3. Gill has been prolific in his last 5 Tests in his new position in the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rishabh-pant-hundred-test-cricket-comeback-2604087-2024-09-21",
      "headline": "With emotional hundred, Rishabh Pant seamlessly resumes love affair with TestsIndia vs Bangladesh, Chennai Test: India wicketkeeper Rishabh Pant marked his Test comeback with an emotional hundred on a hot afternoon in Chennai, rekindling his love affair with the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-3-shubman-gill-rishabh-pant-hundreds-sachin-tendulkar-chennai-2604083-2024-09-21",
      "headline": "IND vs BAN: Sachin Tendulkar lauds Chennai centurions Rishabh Pant, Shubman GillSachin Tendulkar heaped praise on Shubman Gill and Rishabh Pant after the duo scored hundreds on Day 3 of the first Test in Chennai against Bangladesh. The hundreds from Gill and Pant has put India on course for a win on September 21, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-runs-number-3-2604082-2024-09-21",
      "headline": "Assured and calm Shubman Gill slowly making No.3 his ownShubman Gill scored a stunning century in the 1st Test match against Bangladesh. After his initial struggles at No.3, Shubman is slowly making the spot his own in the Indian Test team."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-when-mohammed-siraj-almost-did-a-chris-woakes-on-day-3-of-chennai-test-2604081-2024-09-21",
      "headline": "When Siraj almost pulled off a Chris Woakes, ready to bowl spin vs BangladeshMohammed Siraj imitated bowling finger spin when the umpires and the teams were chatting about ending Day 3's play due to bad lighting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-tamim-iqbal-bangladesh-zakir-hasan-chennai-test-2604075-2024-09-21",
      "headline": "Tamim Iqbal urges Bangladesh batters to convert starts in Tests IND vs BAN: Tamim Iqbal said that Zakir Hasan and Shadman Islam would be disappointed after not being able to convert starts in the second innings of the opening Test at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iyer-scores-quickfire-fifty-after-getting-out-for-duck-in-duleep-trophy-2024-2604061-2024-09-21",
      "headline": "Duleep Trophy: After 0 in 1st innings, Shreyas Iyer makes amends with rapid 50Shreyas Iyer scored a quick-fire fifty from 37 balls for India D against India B on Day 3 of the Duleep Trophy 2024 match. However, he was soon dismissed by Avesh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mushfiqur-rahim-tamim-iqbal-record-2604057-2024-09-21",
      "headline": "Mushfiqur Rahim becomes Bangladesh's all-time highest run-scorer IND vs BAN, 2nd Test: Mushfiqur Rahim went past Tamim Iqbal to become the all-time top run-scorer for Bangladesh in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-ruturaj-gaikwad-dismisses-riyan-parag-with-one-handed-stunner-2604053-2024-09-21",
      "headline": "Ruturaj Gaikwad dismisses Riyan Parag with one-handed stunnerDuleep Trophy: India C captain Ruturaj Gaikwad stunned Riyan Parag with a one-handed stunner on Saturday, Day 3 of the match in Anantapur. Gaikwad helped his team remove a rampaging Riyan Parag who was batting on 73.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-3-report-rishabh-pant-shubman-gil-chennai-2604040-2024-09-21",
      "headline": "IND vs BAN, 1st Test Day 3: Pant-Gill brilliance puts India on the verge of winA brilliant partnership between Rishabh Pant and Shubman Gill put India on course for a win in the first Test in Chennai on Day 3. Gill and Pant scored hundreds on Saturday, September 21 as India need 6 more wickets for the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iyer-scores-quickfire-fifty-after-getting-out-for-duck-in-duleep-trophy-2024-2604061-2024-09-21",
      "headline": "Duleep Trophy: After 0 in 1st innings, Shreyas Iyer makes amends with rapid 50Shreyas Iyer scored a quick-fire fifty from 37 balls for India D against India B on Day 3 of the Duleep Trophy 2024 match. However, he was soon dismissed by Avesh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mushfiqur-rahim-tamim-iqbal-record-2604057-2024-09-21",
      "headline": "Mushfiqur Rahim becomes Bangladesh's all-time highest run-scorer IND vs BAN, 2nd Test: Mushfiqur Rahim went past Tamim Iqbal to become the all-time top run-scorer for Bangladesh in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-ruturaj-gaikwad-dismisses-riyan-parag-with-one-handed-stunner-2604053-2024-09-21",
      "headline": "Ruturaj Gaikwad dismisses Riyan Parag with one-handed stunnerDuleep Trophy: India C captain Ruturaj Gaikwad stunned Riyan Parag with a one-handed stunner on Saturday, Day 3 of the match in Anantapur. Gaikwad helped his team remove a rampaging Riyan Parag who was batting on 73.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-3-report-rishabh-pant-shubman-gil-chennai-2604040-2024-09-21",
      "headline": "IND vs BAN, 1st Test Day 3: Pant-Gill brilliance puts India on the verge of winA brilliant partnership between Rishabh Pant and Shubman Gill put India on course for a win in the first Test in Chennai on Day 3. Gill and Pant scored hundreds on Saturday, September 21 as India need 6 more wickets for the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faheem-ashraf-umpiring-champions-cup-viral-video-2604030-2024-09-21",
      "headline": "Faheem Ashraf exposes umpiring standards in Pakistan: 'Friends get saved'Pakistan all-rounder Faheem Ashraf has slammed the umpiring standards in domestic cricket. In an interview that has gone viral on social media. Faheem can be seen pleading with the PCB to fix this issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-afg-vs-sa-afghanistan-cricket-rahmanullah-gurbaz-2604027-2024-09-21",
      "headline": "Rashid Khan fought hamstring injury in historic series win spell vs South AfricaAfghanistan wrist spinner Rashid Khan revealed that he fought through a hamstring injury during his match-winning spell in the second ODI vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-2nd-odi-rashid-khan-rahmanullah-gurbaz-timeline-2604026-2024-09-21",
      "headline": "Rise of Afghanistan cricket since 2023 - A historic timeline AFG vs SA: Afghanistan beat South Africa by 177 runs in the second ODI on Friday at the Sharjah Cricket Stadium to take a 2-0 lead in the three-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-in-awe-of-shubman-gills-calmness-enroute-his-hundred-vs-bangladesh-2604023-2024-09-21",
      "headline": "Tamim Iqbal in awe of Shubman Gill's calmness enroute his hundred vs BangladeshTamim Iqbal hails Shubman Gill's calmness en route his hundred vs Bangladesh in the 1st Test match in Chennai. Gill notched up his 5th Test hundred as he scored 119 runs from 176 balls. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}