{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cas-taxpayers-slam-governments-midnight-1-day-itr-income-tax-filing-deadline-extension-2787951-2025-09-16",
      "headline": "Pathetic, insulting: CAs, taxpayers slam government's 1-day ITR deadline extensionThe government's last-minute one-day ITR extension has ignited anger, with taxpayers and chartered accountants slamming it as tokenism, mocking portal glitches and questioning accountability in digital governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-dalal-street-us-fed-rate-decision-september-16-2787943-2025-09-16",
      "headline": "Sensex, Nifty open flat as investors await key US Fed decisions on rate cutThe S&P BSE Sensex added 148.51 points to 81,934.25, while the NSE Nifty50 gained 40.25 points to 25,109.50 as of 9:28 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-surge-elon-musk-1-billion-investment-record-high-2787926-2025-09-16",
      "headline": "Tesla shares surge 3% as Elon Musk invests $1 billion in company stockTesla shares rose over 3% on Monday after CEO Elon Musk purchased more than 2.5 million shares, valued at about $1 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inox-siddharth-jain-buys-india-inc-first-tesla-ev-cars-elon-musk-2787917-2025-09-16",
      "headline": "INOX's Siddharth Jain buys India Inc's first Tesla EVSiddharth Jain's purchase follows the earlier delivery of India's first Tesla Model Y to Maharashtra Transport Minister Pratap Sarnaik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-agreement-talks-resume-trump-tariffs-shift-modi-commerce-ministry-2787907-2025-09-16",
      "headline": "India, US back at table for trade talks, eye breakthrough amid tariffsThe trade talks come after Trump softened his tone, saying he was optimistic about finalising a trade agreement with India. Government officials see a chance to rescue a free trade deal that had been thrown into doubt by punitive tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deadline-for-filing-income-tax-returns-extended-by-one-day-until-tuesday-government-glbs-2787853-2025-09-16",
      "headline": "Income tax return deadline extended till todayTo facilitate necessary updates and changes in the filing utilities, the department also announced that the e-filing portal will undergo maintenance from 12:00 am to 2:30 am on September 16, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-turns-to-barter-trade-to-dodge-sanctions-swaps-grain-for-chinese-cars-2787713-2025-09-15",
      "headline": "Russia turns to barter trade to dodge sanctions, swaps grain for Chinese carsEven as Russia builds warm ties with China and India, the return of barter shows just how far the war in Ukraine has distorted trading relationships for the world's biggest producer of natural resources, three decades after the 1991 collapse of the Soviet Union ushered in Russian economic integration with the West."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/last-chance-to-file-itr-2025-step-by-step-online-filing-process-explained-2787567-2025-09-15",
      "headline": "Last chance to file ITR 2025: Step-by-step online filing process explainedThe clock is ticking! Today is the final chance for taxpayers to file their ITR for AY 2025–26. Missing the deadline could mean penalties. Here's a quick guide to file online before midnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-coming-to-table-trump-aide-navarrros-big-claim-day-ahead-of-trade-talks-in-delhi-2787651-2025-09-15",
      "headline": "India coming to table: Trump aide Navarro's big claim ahead of Delhi trade talksIndia and the US will hold fast-tracked trade talks in New Delhi on Tuesday after White House trade adviser Peter Navarro said India is \"coming to the table,\" weeks after Washington imposed tariffs on Indian exports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-close-cautious-ahead-of-us-fed-meet-gst-20-seen-as-growth-trigger-2787628-2025-09-15",
      "headline": "Markets close flat ahead of US Fed meet, GST 2.0 driving consumption boostA cautious session kept Indian equities flat, with investors eyeing the US Fed's decision. Experts, however, expect GST 2.0 reforms to drive domestic consumption and benefit core sectors such as FMCG and banking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-119-points-lower-nifty-below-25100-titan-down-1-percent-2787607-2025-09-15",
      "headline": "Sensex ends 119 points lower, Nifty below 25,100; Titan down 1%The S&P BSE Sensex was down by 118.96 points to end at 81,785.74, while the NSE Nifty50 lost 44.80 points to end at 25,069.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-extension-glitch-income-tax-portal-what-to-do-september-15-2787597-2025-09-15",
      "headline": "Income tax portal faces glitch on last day of ITR filing. Here's what to doAs the September 15, 2025 deadline ticks away, users have been facing serious issues like very slow page loading, errors in uploading forms, and repeated system failures while submitting their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-gen-z-is-changing-money-habits-explains-financial-advisor-2787518-2025-09-15",
      "headline": "How Gen-Z is changing money habits, explains financial advisorGen-Z is shaking up traditional money habits. From saving to investing and spending on experiences, this generation is rewriting the rules of wealth. A financial advisor explains how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-relief-insurance-policyholders-tax-cut-benefit-hospital-bills-2787519-2025-09-15",
      "headline": "Can GST relief on insurance turn first-time buyers into long-term policyholders?For millions of families who hesitated to buy insurance because of the extra tax burden, the recent GST reforms could be a turning point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2025-deadline-know-penalties-and-benefits-you-lose-for-missing-the-due-date-2787482-2025-09-15",
      "headline": "ITR 2025 deadline: Know penalties and benefits you lose for missing the due dateThe deadline to file Income Tax Returns (ITR) for 2025 is here, and missing it can cost more than just a late fee. From penalties to lost tax perks, here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-deadline-today-september-15-how-much-to-pay-and-penalty-for-delay-2787458-2025-09-15",
      "headline": "Advance tax deadline today: How much to pay and penalty for delayThe second instalment of advance tax for financial year 2026 is due on 15 September. Here's what individuals need to pay, who is liable, and the consequences of missing the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/value-stocks-to-buy-on-dalal-street-top-picks-auto-psu-railways-nbfc-bajaj-finance-2787450-2025-09-15",
      "headline": "Looking for value-based stocks to buy on Dalal Street? Here are the top picksExperts believe the current market offers good opportunities, especially in sectors that have seen recent corrections and are expected to benefit from domestic demand, GST reforms, and a good monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-today-key-faqs-for-last-minute-filers-2787427-2025-09-15",
      "headline": "ITR filing deadline today: Key FAQs for last-minute filersToday marks the final chance to file Income Tax Returns for AY 2025–26. As the deadline closes in, last-minute filers are rushing to the portal. Here are the answers to the most common questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dev-accelerator-ipo-allotment-finalised-strong-subscription-listing-2025-2787414-2025-09-15",
      "headline": "Dev Accelerator IPO allotment today: Step-by-step guide to check status onlineThe share allotment for Dev Accelerator IPO was finalised on September 15, 2025. Investors can check their allotment status using official BSE or registrar websites following outlined procedures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-54-points-higher-nifty-above-25100-eternal-rises-1-percent-2787372-2025-09-15",
      "headline": "Sensex opens 54 points higher, Nifty above 25,100; Eternal rises 1%The S&P BSE Sensex was up by 57.17 points to 81,961.87, while the NSE Nifty50 added 5.35 points to 25,119.35 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-allotment-check-status-gmp-listing-date-profit-shares-rise-market-debut-2787348-2025-09-15",
      "headline": "Urban Company IPO allotment out today: Check status as GMP jumps ahead of debutUrban Comapny IPO allotment follows a strong response, with bidding exceeding 100 times during the three-day subscription period from September 10 to 12, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-deadline-september-15-deadline-extension-news-fake-income-tax-department-shares-clarification-2787335-2025-09-15",
      "headline": "ITR deadline extension rumours are fake, clarifies Income Tax DepartmentThe income tax department has issued a notification warning taxpayers about a fake message that is spreading widely on social media and messaging apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-20-reforms-big-win-for-every-citizen-finance-minister-nirmala-sitharaman-2787197-2025-09-14",
      "headline": "Tax reforms for rising Bharat: GST 2.0 big win for citizens, says Nirmala SitharamanThe Union Finance Minister said that GST reforms will be implemented much ahead of Prime Minister Narendra Modi's instructions of launching them before Deepavali festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-highs-3-key-reasons-behind-the-rally-2786181-2025-09-12",
      "headline": "Gold hits record highs. 3 key reasons behind the rallyThe shine of gold is brighter than ever. Prices have soared to record levels, with global and domestic markets witnessing a strong rally. So, what's driving this rise? Three major factors are at play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-seniors-can-unlock-rs-15-lakh-a-month-from-their-home-explains-expert-2786140-2025-09-12",
      "headline": "How seniors can unlock Rs 1.5 lakh a month from their home, explains expertRising medical bills and everyday expenses often strain retirees who have no pension. But for those who own a house, there's a way out. An expert says reverse mortgage can turn property into a monthly pension of Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-income-reporting-to-form-selection-7-key-checks-every-taxpayer-should-make-before-filing-itr-2786109-2025-09-12",
      "headline": "From income reporting to form selection: 7 must-do ITR stepsThis article outlines the key things taxpayers in India need to remember while filing their income tax return for the current assessment year, with a focus on accuracy, compliance, and timely processing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-draws-hilarious-parallel-between-salman-khan-and-baba-ramdev-2787927-2025-09-16",
      "headline": "Farah Khan draws hilarious parallel between Salman Khan and Baba RamdevFarah Khan's visit to Baba Ramdev's Haridwar ashram was full of humour and filmi banter, as she playfully compared Salman Khan's lavish lifestyle with Ramdev's simple living. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-on-aryan-khan-the-director-he-is-a-perfectionist-2787752-2025-09-16",
      "headline": "Bobby Deol on Aryan Khan the director: He is a perfectionistBobby Deol opens up on Aryan Khan's directorial debut with Netflix's 'The Bads of Bollywood'. He praises Aryan's maturity, hard work, and perfectionist approach as a filmmaker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-manchu-confirms-father-mohan-babus-role-in-nani-the-paradise-2787921-2025-09-16",
      "headline": "Lakshmi Manchu confirms father Mohan Babu's role in Nani The ParadiseNani's upcoming film 'The Paradise' is already turning heads with the addition of veteran actor Mohan Babu in a lead role. His daughter and actor Lakshmi Manchu reportedly confirmed the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-completes-ustaad-bhagat-singh-shoot-makers-release-video-2787749-2025-09-15",
      "headline": "Pawan Kalyan completes Ustaad Bhagat Singh shoot, makers release videoPawan Kalyan wrapped his portions for the much-anticipated action entertainer 'Ustaad Bhagat Singh', with the makers releasing a celebratory video from the set. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-slams-actors-for-making-producers-pay-for-trainers-cooks-live-kitchen-2787718-2025-09-15",
      "headline": "Aamir Khan slams actors for making producers pay for trainers and cooksActor Aamir Khan, who is also a producer, has opened up about a trend that he finds extremely strange and unfair. He called out actors who ask producers to pay for personal staff and luxuries in a recent interview. 'When will this stop?', he quipped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tesher-reacts-jalebi-baby-replaces-pakistan-anthem-during-asia-cup-2025-match-2787727-2025-09-15",
      "headline": "Rapper Tesher reacts as Jalebi Baby replaces Pakistan anthem during Asia Cup matchIndia vs Pakistan Asia Cup match in Dubai turned into a talking point after Tesher's hit song 'Jalebi Baby' was accidentally played instead of Pakistan's national anthem, creating a viral moment on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-shares-hera-pheri-3-shoot-update-talks-bond-with-priyadarshan-2787700-2025-09-15",
      "headline": "Paresh Rawal shares Hera Pheri 3 shoot update, talks bond with PriyadarshanParesh Rawal has confirmed his return to 'Hera Pheri 3', reuniting with Akshay Kumar and Suniel Shetty, with filming set to begin early next year. The actor addressed his earlier exit, saying he returned the signing amount with interest and maintained a strong bond with director Priyadarshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-reacts-fans-calling-deserving-national-award-shah-rukh-khan-2787729-2025-09-15",
      "headline": "Manoj Bajpayee reacts to fans calling him more deserving of National Award than SRKActor Manoj Bajpayee, in an exclusive interview, spoke about losing the National Award to Shah Rukh Khan. He dismissed the entire debate as a 'loser conversation.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nagma-mirajkars-eviction-from-bigg-boss-19-is-a-lesson-for-influencers-2787673-2025-09-15",
      "headline": "Nagma Mirajkar's eviction from Bigg Boss 19 is a lesson for influencersHaving a massive social media following is not a sure-shot guarantee of success in 'Bigg Boss 19' or in life. The eviction of Nagma Mirajkar, who has over 8 million Instagram followers, is proof of that. Here's how her eviction is a lesson for influencers aspiring to come on the reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/composer-gv-prakash-on-turning-down-raayan-role-wont-betray-dhanush-even-in-films-2787696-2025-09-15",
      "headline": "Composer GV Prakash on turning down Raayan role: Won't betray Dhanush even in filmsGV Prakash, who has scored several of Dhanush's films, revealed he turned down a key role in the actor-director's third outing, 'Raayan'. The two are now awaiting the release of 'Idli Kadai'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-birthday-emotional-post-son-aarav-bhatia-is-proud-sidekick-moment-for-star-father-2787685-2025-09-15",
      "headline": "Akshay Kumar's son Aarav turning 23 is a proud sidekick moment for star fatherAkshay Kumar celebrated his son Aarav's 23rd birthday with a special note on Instagram. The actor reflected on fatherhood and his son's growth. Kumar is currently promoting 'Jolly LLB 3', set for release on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lily-collins-new-york-fashion-week-health-debate-2787654-2025-09-15",
      "headline": "Emily In Paris' Lily Collins flaunts flat abs, leaves Internet worried about healthLily Collins' appearance at New York Fashion Week has sparked debate about her health. While a section of fans complimented her flat abs, others pointed out that she looks 'unhealthy'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-emotional-message-flood-victims-punjab-watch-2787669-2025-09-15",
      "headline": "Badshah's emotional message for flood victims in Punjab. WatchRapper Badshah sent a powerful message to flood victims in Punjab. He paused to address the crisis and how the state will bounce back soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/real-kashmir-football-club-zeeshan-ayyub-manav-kaul-lead-inspiring-sports-drama-2787630-2025-09-15",
      "headline": "Real Kashmir Football Club: Zeeshan Ayyub-Manav Kaul lead inspiring sports dramaActors Zeeshan Ayyub and Manav Kaul star in 'Real Kashmir Football Club', a series inspired by the true story of Kashmir's first professional football team. The show highlights resilience, teamwork, and passion as two men and a group of rookies chase their sporting dreams against the odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-wrong-paris-review-this-love-story-is-glossy-cheeky-and-worth-the-ride-2787455-2025-09-15",
      "headline": "The Wrong Paris review: This love story is glossy, cheeky, and worth the rideRelease Date:Fri Sep 12, 2025'The Wrong Paris', starring Miranda Cosgrove, Pierson Fode, is currently streaming on Netflix. Is the one-hour, 49-minute movie worth a watch? This review is all you need to find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-son-linga-dance-heartfelt-moment-idli-kadai-audio-launch-event-2787608-2025-09-15",
      "headline": "Dhanush dances with son Linga, enjoys heartfelt moment at Idli Kadai event. WatchDhanush and his youngest son, Linga, danced on stage at the 'Idli Kadai' audio launch in Chennai. The actor-director performed a song with composer GV Prakash on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-calls-yogita-bihani-a-worthy-bahu-after-her-stunning-new-look-2787583-2025-09-15",
      "headline": "Archana Puran Singh calls Yogita Bihani a worthy bahu after her stunning new lookAaryamann Sethi's family celebrated in style as fiancee Yogita Bihani debuted a trendy haircut, triggering playful banter and glowing praise from parents Archana Puran Singh and Parmeet Sethi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-shinchan-became-india-most-loved-naughty-cartoon-japanese-cartoon-2787540-2025-09-15",
      "headline": "How Shinchan became India's most loved naughty Japanese cartoonFrom banned cartoon to cultural icon, here's why 'Shinchan' still makes Indian viewers laugh, relate and rewind after two decades on TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-cameo-kd-the-devil-dhruva-sarja-sanjay-dutt-2787531-2025-09-15",
      "headline": "Kichcha Sudeep will appear in a cameo in KD The Devil, makers confirmKannada star Kichcha Sudeep will be seen in a guest appearance in the upcoming film 'KD: The Devil', which stars Dhruva Sarja and Sanjay Dutt. The film, directed by Prem, features an ensemble cast and the announcement was made by KVN Productions onsocial media."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-triggers-cloudburst-in-uttarakhands-dehradun-cars-shops-washed-away-2-people-missing-2787900-2025-09-16",
      "headline": "2 missing as heavy rain triggers cloudburst in Dehradun, washes away cars and shopsA cloudburst in Dehradun triggered by heavy rain washed away cars and shops and resulted in two people going missing. Rescue personnel are at the spot to search and rescue the missing persons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-agreement-talks-resume-trump-tariffs-shift-modi-commerce-ministry-2787907-2025-09-16",
      "headline": "India, US back at table for trade talks, eye breakthrough amid tariffsThe trade talks come after Trump softened his tone, saying he was optimistic about finalising a trade agreement with India. Government officials see a chance to rescue a free trade deal that had been thrown into doubt by punitive tariffs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cas-taxpayers-slam-governments-midnight-1-day-itr-income-tax-filing-deadline-extension-2787951-2025-09-16",
      "headline": "Pathetic, insulting: CAs, taxpayers slam government's 1-day ITR deadline extensionThe government's last-minute one-day ITR extension has ignited anger, with taxpayers and chartered accountants slamming it as tokenism, mocking portal glitches and questioning accountability in digital governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-us-howard-lutnick-donald-trump-aide-corn-attack-linked-to-india-ethanol-rush-2787793-2025-09-16",
      "headline": "Is US corn attack linked to India's ethanol rush?US Commerce Secretary Howard Lutnick attacked India for not importing American corn. India was an exporter of maize till 2023 but the diversion of corn to produce ethanol for fuel blending turned it into an importer. DC's desperation as China skips its grains and India's corn imports are behind the Trump aide's attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/india-speed-skating-golds-anandkumar-velkumar-krish-sharma-world-championships-2787831-2025-09-15",
      "headline": "India script history with two gold medals at Speed Skating World ChampionshipsAnandkumar Velkumar made history by clinching India's first-ever World Championship title in the senior men's 1000m speed skating event in China. Krish Sharma also secured gold in the junior 1000m sprint, marking a memorable day for Indian speed skating."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-mans-beheading-in-texas-was-completely-preventable-us-homeland-security-glbs-2787878-2025-09-16",
      "headline": "Was preventable if...: US Homeland Security after Indian man beheaded in DallasChandra Nagamalliah was attacked last week at the Downtown Suites motel in Dallas, where he and the Cuban murderer Yordanis Cobos-Martinez worked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-bmw-crash-what-accused-said-on-taking-victim-to-far-19km-hosiptal-2787775-2025-09-15",
      "headline": "What Delhi BMW crash accused said on taking victim to faraway hospitalThe accused, Gaganpreet Kaur, took the victim to a hospital that was 19 kilometres away from the incident spot and not to any nearby trauma centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-sues-new-york-times-over-its-reporting-on-his-links-with-epstein-2787950-2025-09-16",
      "headline": "Lying about me for decades: Trump to sue NYT over reporting on Epstein linksUS President Donald Trump on Monday (local time) said he will be filing a USD 15 billion defamation lawsuit against The New York Times over its reporting on his links with disgraced financier and sex offender Jeffrey Epstein."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-r-vaishali-grand-swiss-win-mother-video-viral-2787916-2025-09-16",
      "headline": "Vaishali celebrates Grand Swiss win with mother, video goes viralIndian Grandmaster R Vaishali won Grand Swiss for the second time in a row. As the win helped her seal a spot in the Candidates tournament, Vaishali celebrated the moment with her mother, the video of which has now gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/puja-khedkar-father-dilip-khedkar-road-rage-kidnapping-truck-driver-manorama-khedkar-cops-dogs-bungalow-2787901-2025-09-16",
      "headline": "Puja Khedkar's father kidnapped driver, mother used dogs to scare cops: PoliceDilip Khedkar, the father of ex-IAS probationer Puja Khedkar, kidnapped a truck driver in Navi Mumbai and took him to his wife Manorama Khedkar's bungalow, police said. Manorama allegedly unleashed two dogs to scare a police team and helped her husband flee."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-battered-heavy-rain-bus-depot-flooded-mandi-landslide-disrupts-traffic-2787928-2025-09-16",
      "headline": "Heavy rain lashes Himachal; bus depot flooded, landslide disrupts trafficBesides the heavy downpour, parts of Himachal Pradesh also witnessed thunderstorms, while 493 roads, including three national highways, remained closed for traffic on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-mondo-duplantis-pole-vault-world-record-2787812-2025-09-15",
      "headline": "Duplantis soars to 14th world record as Tokyo falls in love with pole vault KingWorld Athletics Championships 2025: On a night of soaring drama and raw emotion, Mondo Duplantis turned Tokyo into his stage once more. Rivals became cheerleaders, a stadium held its breath, and history bowed as the pole vault king cleared 6.30m — his 14th world record and perhaps his most beautiful yet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-woman-claims-cheated-of-rs-200-in-welfare-scheme-names-rjd-leader-tejashwi-yadav-in-fir-2787908-2025-09-16",
      "headline": "Woman claims cheated of Rs 200 in welfare scheme, names Tejashwi Yadav in FIRThe FIR was filed on the complaint of Gudiya Devi, a resident of Ward No. 7 under Singhwara police station. She alleged that she was duped of Rs 200 while applying for benefits under the Mai-Bahan Yojana, which promised women Rs 2,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-match-referee-pycroft-asia-cup-pakistan-protest-handshake-controversy-2787843-2025-09-15",
      "headline": "ICC likely to reject Pakistan's request to replace match referee Pycroft: SourcesThe International Cricket Council (ICC) has yet to issue an official response to the Pakistan Cricket Board's (PCB) request for a change of match referee. However, sources suggest that the ICC rarely entertains such demands and is expected to stand by its appointed official."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/several-feared-dead-as-truck-rams-into-crowd-in-indore-another-vehicle-catches-fire-2787788-2025-09-15",
      "headline": "2 dead, vehicles catch fire as drunk driver rams truck into crowd in IndoreA speeding truck lost control and ploughed into a crowd and multiple vehicles on Indore's Airport Road, killing at least two people and injuring several others, with the toll likely to rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-launched-at-rs-1050-lakh-arenas-new-flagship-suv-2787693-2025-09-15",
      "headline": "Maruti Suzuki Victoris launched at Rs 10.50 lakh, Arena's new flagship SUVMaruti Suzuki has launched the Victoris at Rs 10.50 lakh, a new flagship mid-size SUV in its Arena lineup, combining advanced features, multiple powertrains, and top-notch safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-netanyahu-didnt-inform-him-of-qatar-strike-vows-israel-wont-hit-again-glbs-2787890-2025-09-16",
      "headline": "Trump says Netanyahu didn't inform him of Qatar strike, vows Israel won't hit againThe US President denied having prior knowledge of Israel's strike in Qatar that killed Hamas leaders. Netanyahu said the attack was a \"wholly independent\" Israeli operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-dies-odisha-son-in-law-home-found-alive-hospital-before-cremation-2787931-2025-09-16",
      "headline": "Woman dies during visit to son-in-law's home; found alive minutes before cremationAn 86-year-old woman, who was believed to be dead while on her visit to her son-in-law's house, was found alive at a hospital minutes before her last rites were to be performed in Odisha's Puri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/alice-in-wonderland-syndrome-rare-neurological-brain-disorder-that-warps-perception-2787662-2025-09-16",
      "headline": "When the mind plays tricks: All about Alice in Wonderland syndromeTrapped between a dollhouse world and a giant playground, this is the disorienting reality of Alice in Wonderland syndrome, where size and space lose all sense. The condition is rare, but it happens. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-on-aryan-khan-the-director-he-is-a-perfectionist-2787752-2025-09-16",
      "headline": "Bobby Deol on Aryan Khan the director: He is a perfectionistBobby Deol opens up on Aryan Khan's directorial debut with Netflix's 'The Bads of Bollywood'. He praises Aryan's maturity, hard work, and perfectionist approach as a filmmaker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-ravi-floods-lahore-after-40-years-indus-waters-treaty-iwt-history-pakistan-punjab-badshahi-mosque-2787553-2025-09-15",
      "headline": "India's Ravi floods Lahore after 40 years, triggers blame gameThe River Ravi returned to Lahore after almost 40 years, causing severe floods, and reminding the Pakistani city of its historical connection to the river. The floods of August and September exposed vulnerabilities from unchecked urban development and ecological neglect. This came even as India kept the Indus Waters Treaty in abeyance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jd-vance-hosts-charlie-kirks-show-vows-to-honor-him-by-being-a-better-father-glbs-2787866-2025-09-16",
      "headline": "JD Vance hosts Charlie Kirk's show, vows crackdown on far-left violenceUS Vice President JD Vance hosted Charlie Kirk's radio show, saying he'll honour his slain friend by being a better husband and father. He praised Kirk as a \"joyful warrior\" and urged national unity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-military-strike-kills-three-venezuelan-narcoterrorists-drug-trafficking-glbs-2787868-2025-09-16",
      "headline": "3 killed in 2nd US strike on vessel moving drugs from Venezuela, says TrumpThe US President said American forces carried out a second strike in Venezuela, killing three terrorists transporting drugs in international waters. Trump said the strike was necessary to counter threats to US national security. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-boring-no-competition-sourav-ganguly-2787938-2025-09-16",
      "headline": "India vs Pakistan boring? Sourav Ganguly finds more thrill in City vs UnitedFormer India captain Sourav Ganguly has landed a telling blow on the India-Pakistan rivalry. Ganguly, at an event in Kolkata, said that Pakistan were a no contest against India, and he switched over to the Manchester Derby after only 15 overs in the Asia Cup contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-2025-india-wins-youtuber-refuses-revive-channel-2787322-2025-09-16",
      "headline": "A cricket clash, a YouTube dream, and a shocking choiceIndia secured a notable win over Pakistan in the Asia Cup 2025 cricket match. An auto driver, who is also an aspiring YouTuber, chose ethics over views, refusing to revive his channel amid political tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-r-vaishali-grand-swiss-win-mother-video-viral-2787916-2025-09-16",
      "headline": "Vaishali celebrates Grand Swiss win with mother, video goes viralIndian Grandmaster R Vaishali won Grand Swiss for the second time in a row. As the win helped her seal a spot in the Candidates tournament, Vaishali celebrated the moment with her mother, the video of which has now gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-how-can-salman-agha-team-exit-asia-cup-2787867-2025-09-16",
      "headline": "Asia Cup: Even without boycott, Pakistan can exit early. Here's howPakistan faces a crucial test in Asia Cup 2025 after a heavy defeat to India and a controversial handshake incident. The team's qualification hopes hinge on their next match against the UAE amid several controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-day-4-full-schedule-timings-sarvesh-kushare-high-jump-final-2787896-2025-09-16",
      "headline": "World Athletics Champs Day 4 schedule: How to watch Sarvesh in high jump finalWorld Athletics Championships 2025: After a riveting Monday that saw Mondo Duplantis capture Tokyo's heart, several big names are set to take the stage on Tuesday. India's Sarvesh Kushare will aim to make his mark in the men's high jump final, which will notably be without two of the sport's biggest stars - Mutaz Barshim and Gianmarco Tamberi. Here's the full schedule of events for Day 4 of the world meet in the Japanese capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/k9-esports-slug-bgms-2025-victory-rs-60-lakh-prize-2787842-2025-09-16",
      "headline": "A tale of grit: K9 Esports flip the script to claim BGMS Season 4 titleK9 Esports emerged victorious at BGMS 2025 after a challenging season. The win silences critics and marks a new chapter for the team and its players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-edge-hong-kong-asia-cup-2025-dropped-catches-pathum-nissanka-2787864-2025-09-16",
      "headline": "Hong Kong captain rues dropped chances after close finish against Sri LankaSri Lanka defeated Hong Kong by four wickets in a thrilling Asia Cup 2025 encounter in Dubai. Dropped catches by Hong Kong proved costly as Sri Lanka edged closer to Super 4 qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sri-lanka-vs-hong-kong-pathum-nissanka-nizakat-khan-2787849-2025-09-15",
      "headline": "Sri Lanka inch closer to Super 4 after overcoming Hong Kong in tricky chaseSri Lanka beat Hong Kong by four wickets in the Asia Cup 2025 to register their second successive win of the tournament. Pathum Nissanka emerged as Player of the Match with his remarkable innings of 68 (44)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-match-referee-pycroft-asia-cup-pakistan-protest-handshake-controversy-2787843-2025-09-15",
      "headline": "ICC likely to reject Pakistan's request to replace match referee Pycroft: SourcesThe International Cricket Council (ICC) has yet to issue an official response to the Pakistan Cricket Board's (PCB) request for a change of match referee. However, sources suggest that the ICC rarely entertains such demands and is expected to stand by its appointed official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-bronze-world-athletics-championships-tokyo-2025-2787319-2025-09-15",
      "headline": "Noah Lyles embraces bronze in Tokyo, admits reinvention still ongoingOlympic champion Noah Lyles clinched the bronze medal in the 100m at the 2025 World Athletics Championships in Tokyo. Despite injury setbacks and a tough season, he showed resilience but was outpaced by Jamaican sprinters Oblique Seville and Kishane Thompson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sports-politics-have-never-been-separate-sunil-gavaskar-on-handshake-controversy-2787841-2025-09-15",
      "headline": "Sports, politics have never been separate: Sunil Gavaskar on handshake controversyFormer India captain Sunil Gavaskar, while talking to consulting editor of the India Today group, downplayed the handshake controversy after India's Asia Cup win over Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-edge-hong-kong-asia-cup-2025-dropped-catches-pathum-nissanka-2787864-2025-09-16",
      "headline": "Hong Kong captain rues dropped chances after close finish against Sri LankaSri Lanka defeated Hong Kong by four wickets in a thrilling Asia Cup 2025 encounter in Dubai. Dropped catches by Hong Kong proved costly as Sri Lanka edged closer to Super 4 qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sri-lanka-vs-hong-kong-pathum-nissanka-nizakat-khan-2787849-2025-09-15",
      "headline": "Sri Lanka inch closer to Super 4 after overcoming Hong Kong in tricky chaseSri Lanka beat Hong Kong by four wickets in the Asia Cup 2025 to register their second successive win of the tournament. Pathum Nissanka emerged as Player of the Match with his remarkable innings of 68 (44)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-match-referee-pycroft-asia-cup-pakistan-protest-handshake-controversy-2787843-2025-09-15",
      "headline": "ICC likely to reject Pakistan's request to replace match referee Pycroft: SourcesThe International Cricket Council (ICC) has yet to issue an official response to the Pakistan Cricket Board's (PCB) request for a change of match referee. However, sources suggest that the ICC rarely entertains such demands and is expected to stand by its appointed official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-bronze-world-athletics-championships-tokyo-2025-2787319-2025-09-15",
      "headline": "Noah Lyles embraces bronze in Tokyo, admits reinvention still ongoingOlympic champion Noah Lyles clinched the bronze medal in the 100m at the 2025 World Athletics Championships in Tokyo. Despite injury setbacks and a tough season, he showed resilience but was outpaced by Jamaican sprinters Oblique Seville and Kishane Thompson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sports-politics-have-never-been-separate-sunil-gavaskar-on-handshake-controversy-2787841-2025-09-15",
      "headline": "Sports, politics have never been separate: Sunil Gavaskar on handshake controversyFormer India captain Sunil Gavaskar, while talking to consulting editor of the India Today group, downplayed the handshake controversy after India's Asia Cup win over Pakistan."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}