{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-tax-benefits-under-old-tax-regime-hra-80c-standard-deduction-be-available-under-new-tax-regime-get-details-2671567-2025-01-28",
      "headline": "Budget 2025: Will 80C and standard deduction be available under new tax regime?Under the old tax regime, a standard deduction of Rs 50,000 is available for the salaried class, while under the new tax regime, the same has been increased to Rs 75,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/making-upi-payments-with-credit-card-a-good-decision-or-a-risky-habit-check-details-2671439-2025-01-28",
      "headline": "Is linking your credit card with UPI a risky habit? Know hereUPI payments reached Rs 2.34 lakh crore in October 2024, recording a rise of 37% from last year, as per the RBI's latest report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-annual-result-118-billion-annual-loss-largest-since-2020-share-price-dips-ceo-kelly-ortberg-said-company-to-focus-on-core-business-2671505-2025-01-28",
      "headline": "Boeing reports $11.8 billion in annual loss, largest since 2020Boeing posted an annual loss of $11.83 billion owing to problems at its commercial and defense units, reported Reuters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itc-hotels-bse-nse-market-listing-eligibility-and-other-details-2670948-2025-01-28",
      "headline": "ITC Hotels to list on BSE, NSE tomorrow. Check eligibility and other key details Earlier this month, ITC Ltd allotted equity shares of ITC Hotels amounting to Rs 125.11 crore to its shareholders and the latter ceased to be a subsidiary of ITC ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-big-liquidity-boost-what-it-means-for-the-economy-central-bank-to-inject-rs-60000-crore-into-economy-know-the-3-steps-2671369-2025-01-28",
      "headline": "RBI's big liquidity boost: What it means for the economy The RBI has announced OMO purchase auctions of Government of India securities for an aggregate amount of Rs 60,000 crore in three tranches of Rs 20,000 crore each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-but-volatility-caps-gains-key-things-to-know-2671362-2025-01-28",
      "headline": "Sensex, Nifty end higher but volatility caps gains. All you need to knowStock Market Today: The S&P BSE Sensex closed 535.24 points higher at 75,901.41, while the NSE Nifty settled 146.90 points higher at 22,976.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebounds-today-but-volatility-remains-high-investor-strategy-2671291-2025-01-28",
      "headline": "Stock market rebounds but remains volatile. What should investors do? Indian Share Market: Should the increased stock market volatility prompt investors to exit the market, or is it better to stay calm and stick with their investments? Should they even consider adding more to their portfolios?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/200-uk-companies-to-move-to-permanent-4-day-work-week-with-no-pay-loss-2671268-2025-01-28",
      "headline": "200 UK companies sign up for 4-day workweek amid '70-hour debate' in IndiaThe 4 Day Week Foundation campaign director, mentioned that the traditional 9-5, five-day working week which was invented 100 years ago, is now outdated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-ground-boieng-737-max-jet-operational-january-29-2671246-2025-01-28",
      "headline": "Explained: Why SpiceJet shares rose 4% todaySpiceJet shares were trading 3.94% higher at Rs 45.60 on the Bombay Stock Exchange at around 12:54 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-to-lay-off-nearly-3000-employees-post-credit-suisse-takeover-says-report-2671194-2025-01-28",
      "headline": "UBS to lay off nearly 3,000 employees post Credit Suisse takeover: Report UBS Group AG: The impacted employees have been given an option to join a program that allows up to a year to find a new role within the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-up-700-points-nifty-gains-key-reasons-2671218-2025-01-28",
      "headline": "Sensex jumps 900 points: 3 things to know about today's stock market rallyShare Market: While global markets were hit due to a slide in AI and tech stocks, Sensex and Nifty displayed resilience and surged sharply, supported by a rally in heavyweight banking and financial services stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepseek-china-ai-startup-global-technology-stocks-selloff-wall-street-nvidia-openai-microsoft-2671177-2025-01-28",
      "headline": "Explained: Why China's DeepSeek triggered a slide in global AI stocksChinese startup DeepSeek has turned up the heat in the global AI race and its new models have raised hard questions about whether US companies can keep their edge as the landscape shifts beneath their feet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-open-higher-despite-tech-sell-off-sparked-by-deepseek-2671137-2025-01-28",
      "headline": "Sensex, Nifty open higher despite global tech sell-off sparked by DeepSeek Share Market Today: The S&P BSE Sensex was up 366.45 points to 75,732.62 at around 9:16 am, while the NSE Nifty50 rose 111.25 points to trade at 22,940.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-us-chipmaker-biggest-market-loss-in-history-deepseek-china-tech-shockwaves-2671112-2025-01-28",
      "headline": "Nvidia plunges $593 billion as DeepSeek soars, biggest market loss in historyUS chipmaker Nvidia dived 17 per cent, wiping off nearly USD 593 billion in the biggest market capitalisation loss in history, following a wave of selling as China's DeepSeek developed a free AI assistant using lower-cost chips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-business-loan-differs-from-a-personal-loan-interest-emis-guideline-2670901-2025-01-27",
      "headline": "How business loan differs from a personal loan?Personal loans can be taken for almost anything, be it meeting medical expenses, buying a car or house, for marriage of a son or daughter, etc."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-oil-turns-to-sweet-crude-as-russian-oil-supplies-tighten-report-2670897-2025-01-27",
      "headline": "Indian Oil turns to sweet crude as Russian oil supplies tighten: ReportThe United States recently imposed sweeping sanctions on Russia, targeting its oil producers and shipping networks. This has made it difficult for many countries, including India, to continue sourcing Russian crude oil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-ceos-4-month-salary-beats-sunder-pichai-and-tim-cook-annual-pay-who-is-he-2670836-2025-01-27",
      "headline": "This CEO's 4-month salary beats Sunder Pichai and Tim Cook's annual pay. Who is he?Niccol, who was earlier the CEO of Chipotle, joined Starbucks in September 2024. He was granted a $5 million sign-on bonus within the first month of stepping into his new role as revealed in company filings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-founder-sridhar-vembu-to-take-new-role-steps-down-as-ceo-social-media-post-shailesh-kumar-davey-2670853-2025-01-27",
      "headline": "Zoho founder Sridhar Vembu to take new role, steps down as CEOSridhar Vembu resigns as Zoho CEO: As part of the leadership transition, Sridhar Vembu has handed over the role of group CEO to Shailesh Kumar Davey, a co-founder of the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-dalal-street-bleeds-sensex-tanks-824-points-nifty-below-23000-2670815-2025-01-27",
      "headline": "Dalal Street bleeds: Sensex tanks 824 points, Nifty below 23,000The S&P BSE Sensex was down 824.29 points to close at 75,366.17, while the NSE Nifty50 lost 263.05 points to end at 22,829.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-government-may-prioritise-infrastructure-and-introduce-supply-chain-reforms-2670760-2025-01-27",
      "headline": "Budget 2025: Will government prioritise infrastructure and supply-chain reforms? Budget 2025 Expectations: Experts hope that Budget 2025 might announce key reforms to strengthen the infrastructure sector, which is the backbone of the country."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-on-coldplay-ticket-chaos-first-time-we-tried-democratic-ticketing-2671564-2025-01-28",
      "headline": "BookMyShow CEO on Coldplay ticket chaos: First time we tried democratic ticketingAshish Hemrajani, CEO of BookMyShow, addressed the chaos surrounding Coldplay concert tickets in India, explaining that they employed a democratic ticketing system, which required everyone to join a queue and prevented individuals from using their privilege to gain unfair access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shinde-bigg-boss-makers-decide-winner-2671562-2025-01-28",
      "headline": "Actor Shilpa Shinde accuses Bigg Boss makers of rigging resultsTV actor Shilpa Shinde called out Bigg Boss makers for deciding the winner themselves, saying the audience has figured out their strategy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-malik-sad-musicians-have-keep-drilling-themselves-people-heads-exclusive-2671541-2025-01-28",
      "headline": "Armaan Malik: Sad that musicians have to keep drilling themselves in people's headsSinger Armaan Malik spoke to India Today Digital about the challenges musicians face to stay relevant in a competitive industry. He also spoke about the evolving concert culture in India and the rise of independent music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/roadies-prince-narula-fights-elvish-yadav-for-teaming-up-with-rhea-chakrobarty-2671537-2025-01-28",
      "headline": "Roadies XX: Prince Narula hits out at Elvish Yadav for teaming up with RheaPrince Narula clashed with Elvish Yadav and Rhea Chakraborty in the latest episode of MTV Roadies: Double Cross after they teamed up to bid for a contestant he wanted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-reacts-to-pms-push-for-a-concert-economy-after-coldplay-india-tour-2671518-2025-01-28",
      "headline": "BookMyShow CEO reacts to PM's push for a 'concert economy' after Coldplay tourColdplay's recent concerts in Navi Mumbai and Ahmedabad have left audiences in awe. India Today spoke with BookMyShow's CEO about the event's success and India's potential as a global concert destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-interacts-with-team-on-set-of-his-netflix-series-stardom-2671422-2025-01-28",
      "headline": "Watch: Aryan Khan interacts with team on set of his Netflix series StardomSuperstar Shah Rukh Khan's son Aryan Khan is all set to make his showbiz debut with the Netflix series Stardom, which he will be directing. It will reportedly star Mona Singh in a pivotal role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rekha-brings-elegance-to-ghum-hai-kisikey-pyaar-meiin-promo-watch-2671377-2025-01-28",
      "headline": "Rekha brings elegance to Ghum Hai Kisikey Pyaar Meiin promo as show takes new leapRekha introduces new characters in the promo of Ghum Hai Kisikey Pyaar Meiin's new season, which promises to explore love and sacrifice. The show will premiere on January 30 at 8 pm on Star Plus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-kartar-ujagar-singh-hanging-case-real-story-zahaan-kapoor-vikramaditya-motwane-2671344-2025-01-28",
      "headline": "Black Warrant's Kartar-Ujagar Singh and their real-story: Hanged for Rs 500?Vikramaditya Motwane's Black Warrant shows the real-life story of two brothers, Kartar and Ujagar Singh, who were executed for a crime orchestrated by a Delhi doctor. But why were they hanged while the man who hired him walked free? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-2-actors-yim-siwan-and-jo-yuri-on-squid-game-2-bollywood-bts-v-cameo-rumours-2671331-2025-01-28",
      "headline": "Exclusive: Yim Si-wan, Jo Yu-ri talk about Squid Game 2, Bollywood, and moreYim Si-wan and Jo Yu-ri, stars of Netflix's Squid Game 2, discussed their roles and aspirations for lighter dramas in an exclusive interview with India Today Digital. They also revealed interest in Bollywood and reacted to BTS V cameo rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-third-marriage-shaadi-pakistan-mein-hogi-2671310-2025-01-28",
      "headline": "Rakhi Sawant plans to marry again: 'Shaadi Pakistan mein hogi, Islamic rituals'Rakhi Sawant shared her plans to marry a Pakistani suitor, Dodi Khan, in Pakistan, reception in India, and honeymoon in Europe. The Bigg Boss fame was previously married to businessman Adil Khan Durrani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-announces-new-album-mayhem-2671232-2025-01-28",
      "headline": "Lady Gaga announces new album MayhemPop star Lady Gaga has announced her new album, Mayhem, which will release in March. It will consist of 14 songs in total. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-concert-on-disney-hotstar-83-lakh-views-165-crore-minutes-watched-2671205-2025-01-28",
      "headline": "Coldplay Concert on Disney+ Hotstar: 83 lakh views, 16.5 crore minutes watchedBritish rock band Coldplay's Ahmedabad concert, which was held on January 26, invited a whopping 83 lakh views. The music group also performed in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-wi-ha-joon-on-bts-v-cameo-rumours-in-squid-game-3-spills-the-beans-on-s2-2671155-2025-01-28",
      "headline": "IT Exclusive: Wi Ha-joon on BTS' V cameo rumours in Squid Game 3, spills the beans on S2In an exclusive chat with India Today's Bhavna Agarwal, Wi Ha-jun of Squid Game shared insights on staying grounded despite his meteoric rise to fame, addressed concerns about Jun-ho's reduced screen time in Season 2, and expressed his desire to star in a Bollywood action movie. He also reacted to rumors of BTS' V making a cameo in Squid Game 3."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-squid-game-2s-lee-byung-hun-on-frontman-gi-hun-bollywood-working-in-hollywood-2671151-2025-01-28",
      "headline": "IT Exclusive: Squid Game 2's Lee Byung-hun on Frontman-Gi-hun, BollywoodIn an exclusive chat with India Today's Bhavna Agarwal, Squid Game actor Lee Byung-hun explored his character's evolution into an active player this season, the nuanced dynamics with Gi-hun (Lee Jung-jae), and the rising global prominence of Korean content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-to-face-off-against-manoj-bajpayee-in-the-family-man-3-2671005-2025-01-27",
      "headline": "Jaideep Ahlawat to face off against Manoj Bajpayee in The Family Man 3: ReportPataal Lok's Jaideep Ahlawat is expected to play Manoj Bajpayee's nemesis in The Family Man 3. The makers wrapped up shooting the web series  in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sharda-sinha-son-calls-her-long-awaited-padma-vibhushan-honour-matter-of-pride-2670945-2025-01-27",
      "headline": "Sharda Sinha's son calls her 'long awaited' Padma Vibhushan honour 'matter of pride'Sharda Sinha, the legendary folk singer known for her Chhath songs, was posthumously awarded the Padma Vibhushan. Her son called it a proud moment for Bihar and a message to future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-and-actor-dakota-johnson-at-maha-kumbh-2670923-2025-01-27",
      "headline": "Watch: Coldplay's Chris Martin and actor Dakota Johnson at Maha KumbhColdplay's lead singer Chris Martin and his partner and actor Dakota Johnson were seen arriving at the Maha Kumbh Mela 2025. The band recently concluded the final leg of its Indian concert in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-actor-wi-ha-jun-wants-to-do-a-bollywood-action-film-2670878-2025-01-27",
      "headline": "Squid Game actor Wi Ha-jun wants to do a Bollywood action filmSouth Korean star Wi Ha-jun wants to do a Bollywood action film. In a conversation with India Today Digital, he also opened up about BTS singer V's rumoured cameo appearance in Squid Game Season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-trailer-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-premiere-on-february-7-2670852-2025-01-27",
      "headline": "Mrs trailer: Sanya Malhotra leads film about a woman's quest for her identityThe trailer of Mrs released on January 27. Featuring Sanya Malhotra in the main role, the film will release on Zee 5 on February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wont-perform-infrastructure-remark-social-media-criticism-reactions-coldplay-ahmedabad-concert-2670783-2025-01-27",
      "headline": "X users turn on Diljit Dosanjh after Coldplay's Ahmedabad triumph: Stop complainingAfter Coldplay's massive final concert in Ahmedabad, singer Diljit Dosanjh came under fire from X users for his remarks that he would not perform in India again due to inadequate infrastructure."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/election-commission-asks-arvind-kejriwal-for-proof-yamuna-poisoning-claims-haryana-delhi-election-2671566-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Give proof of Yamuna poisoning by 8 pm tomorrow, poll panel tells Arvind KejriwalThe Election Commission wrote to AAP chief Arvind Kejriwal, seeking proof of his claims that the Haryana government had \"mixed poison\" into the Yamuna water. The poll body asked Kejriwal to submit his response by 8 pm on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-icc-cricketer-of-the-year-award-emulates-virat-kohli-2671447-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah becomes 1st Indian pacer to win ICC Cricketer of the Year awardJasprit Bumrah has emulated the likes of Sachin Tendulkar and Virat Kohli to become ICC's men's Cricketer Of The Year for his incredible performance in 2024. He became the first Indian pacer to win the award. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-attacks-arvind-kejriwal-delhi-election-rally-sheeshmahal-jibe-aap-congress-2671500-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi echoes 'sheeshmahal' dig, gets Arvind Kejriwal's 'rajmahal' retortAddressing an election rally in Delhi, Rahul Gandhi slammed Arvind Kejriwal for not standing up for the poor and being not available when communal riots broke out in the capital city in 2020. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-china-liang-wenfeng-built-deepseek-stock-trader-to-ai-titan-2671503-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Liang Wenfeng, the 39-year-old behind AI disruptor DeepSeekDeepSeek, a 20-month-old startup founded by Liang Wenfeng, has disrupted the AI industry with its cost-effective, open-source chatbot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-2025-shahi-snan-airfare-soar-formula-decide-ticket-prices-prayagraj-delhi-mumbai-dgca-what-is-happening-2671352-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Airfare unfair: What formula do airlines use to decide ticket prices?Airfares to and from Prayagraj have shot up fivefold on Shahi Snan days of Maha Kumbh. But Kumbh or no Kumbh, airfares remain sky-high in India all year round. There are several questions on fare monitoring and fair-play. The biggest question, amid allegations of profiteering, is what formula airlines use to determine ticket prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-on-coldplay-ticket-chaos-first-time-we-tried-democratic-ticketing-2671564-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BookMyShow CEO on Coldplay ticket chaos: First time we tried democratic ticketingAshish Hemrajani, CEO of BookMyShow, addressed the chaos surrounding Coldplay concert tickets in India, explaining that they employed a democratic ticketing system, which required everyone to join a queue and prevented individuals from using their privilege to gain unfair access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-summons-sri-lankan-envoy-fishermen-injured-firing-2671355-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Unacceptable: India summons Sri Lankan envoy after 5 fishermen injured in firingAn incident of firing by the Sri Lankan Navy during the apprehension of 13 Indian fishermen in the proximity of Delft Island was reported in the early hours of Tuesday. India has lodged a strong protest with the Sri Lankan envoy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/coldplay-live-streamed-a-turning-point-for-concert-culture-in-india-2671463-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Coldplay live-streamed: A turning point for concert culture in India?Coldplay's Music of the Spheres show in Ahmedabad was live-streamed for the audience across India to enjoy. What does that mean for the booming concert culture in India?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sam-pitroda-controversy-illegal-bangladeshi-migrants-india-bjp-delhi-elections-2671323-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sam Pitroda, again. Remark on illegal Bangladeshis sparks row, gives BJP ammoThe controversial remarks by Sam Pitroda, in a video that has gone viral, come days ahead of the Delhi elections, where illegal immigration has been a burning topic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/who-is-ruby-dhalla-indian-origin-politician-gunning-for-canada-prime-minister-justin-trudeaus-job-2671365-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Ruby Dhalla, Indian-origin politician gunning for Justin Trudeau's job?Ruby Dhalla is aiming to succeed Justin Trudeau as the leader of the Liberal Party, a role that could lead to the prime ministership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/i-140-form-petition-h1b-visa-petition-indians-form-green-card-permanent-residency-new-executive-order-trump-2670952-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How H-1B visa holders stay beyond 6 years in US. It's the I-140 magicThe H-1B visa system, used by mostly by American companies to hire Indians, is under the scanner after now-President Donald Trump made immigration and employment key campaign issues. How is the temporary H-1B visa, which affords a maximum six-year stay in the US, used for permanent residency? Here's all about the I-140 petition that is the gateway to the US Green Card and permanent residency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-kartar-ujagar-singh-hanging-case-real-story-zahaan-kapoor-vikramaditya-motwane-2671344-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Black Warrant's Kartar-Ujagar Singh and their real-story: Hanged for Rs 500?Vikramaditya Motwane's Black Warrant shows the real-life story of two brothers, Kartar and Ujagar Singh, who were executed for a crime orchestrated by a Delhi doctor. But why were they hanged while the man who hired him walked free? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-enemy-property-case-grandmother-wrongly-made-bhopal-nawab-successor-lawyer-2671445-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enemy property: Lawyer claims Saif's grandmother wrongly made Nawab's successorEnemy property expert Jagdish Chhavani said Sajida Sultan was made the successor of Bhopal's Nawab against the rule as Jawaharlal Nehru had good relations with Saif Ali Khan's grandfather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deepseek-r1-china-global-markets-llm-good-rivals-chat-gpt-copilot-gemini-have-to-say-what-they-said-2671514-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is DeepSeek good? This is what rivals ChatGPT, Gemini, Copilot have to say\"What is DeepSeek and is it good? How does DeepSeek stack up against other AI chatbots like ChatGPT, Gemini and Copilot?\" We gave this prompt to ChatGPT, Google Gemini and Microsoft's Perplexity even as the world takes note of the low-cost, China-made AI LLM programme DeepSeek R1. This is what they had to say about their rival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/budget-2025-auto-sector-expects-tax-rationalisation-enhanced-infrastructure-support-2671558-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budget 2025: Auto sector expects tax rationalisation, enhanced infrastructure supportIn India, 2,54,98,763 units of passenger vehicles, commercial vehicles, two-wheelers, three-wheelers and quadricycles were sold in 2024, according to data from SIAM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/thomas-edison-light-bulb-innovation-electrified-the-world-changed-nights-forever-2671550-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Edison's light bulb electrified the world and changed nights foreverThomas Edison's incandescent light bulb, patented in 1880, made electric lighting practical, affordable, and long-lasting. It completely transformed homes, cities, and industries worldwide, going on to electrify the world."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-delhi-vs-railways-livestream-where-to-watch-virat-kohli-2671504-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli Ranji match to be livestreamed as BCCI makes last minute change in plansThe Indian Cricket Board has made a late change in its broadcast plans for the Ranji Trophy. The BCCI is set to livestream the Delhi vs Railways game after it was confirmed that Virat Kohli will play his first match in the domestic tournament after a long break of 12 years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pm-modi-illegal-immigration-us-india-h1b-visa-issue-phone-call-2671168-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi 'will do what's right' on taking back illegal immigrants: TrumpAmid reports that India and the US identified 18,000 undocumented Indians in America, President Donald Trump said Prime Minister Narendra Modi \"will do what's right\" when it came to taking back Indian immigrants who are living in the US illegally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/revenge-quitting-new-workplace-trend-to-rise-in-2025-2671351-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revenge Quitting: Why employees are walking out and how companies can respondRevenge quitting, a new workplace trend where employees leave their jobs abruptly out of frustration, is expected to rise in 2025. Here are the top reasons why people revenge quit, how it can impact companies, and what employers can do to address it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-bitten-punched-during-brawl-coldplay-ahmedabad-concert-viral-video-2671490-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Man bitten, punched during brawl at Coldplay's Ahmedabad concertA video of two men in the audience engaging in a furious brawl during Coldplay's concert in Ahmedabad has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/satellite-photos-show-china-building-large-fusion-research-facility-experts-2671427-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Satellite photos show China building large fusion research facility: ExpertsSatellite photos show four outlying \"arms\" that will house laser bays, and a central experiment bay that will hold a target chamber containing hydrogen isotopes the powerful lasers will fuse together, producing energy, said Decker Eveleth, a researcher at US-based independent research organisation CNA Corp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/deepseek-ai-what-is-it-how-it-works-is-it-better-than-chatgpt-everything-to-know-2671407-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DeepSeek AI: What is it, how it works, is it better than ChatGPT? Everything to knowDeepSeek AI has quickly become a major contender in the world of Artificial Intelligence (AI), giving tough competition to platforms like ChatGPT. But, what exactly is DeepSeek AI, how does it work, when was it founded, how can you access DeepSeek R1, and is it better than ChatGPT? We try to answer all these questions in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-nitish-stalin-pinarayi-have-united-against-modi-govt-over-new-ugc-rules-2670758-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Nitish, Stalin, Pinarayi have united against Modi govt over new UGC rulesUGC draft regulations 2025 face the ire of NDA allies and Opposition-ruled states, sparking a political, legal and ideological battle over state autonomy in higher education\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-called-hrithik-roshan-after-being-shot-kaho-naa-pyaar-hai-2671581-2025-01-28",
      "headline": "Duggu, don't leave house: Rakesh Roshan recounts call to Hrithik after being shotRakesh Roshan shares details about being shot after the success of Hrithik Roshan's Kaho Naa Pyaar Hai. He recalls trying to stop the bleeding from his bullet wound with a handkerchief and visiting the police station before heading to the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-malik-sad-musicians-have-keep-drilling-themselves-people-heads-exclusive-2671541-2025-01-28",
      "headline": "Armaan Malik: Sad that musicians have to keep drilling themselves in people's headsSinger Armaan Malik spoke to India Today Digital about the challenges musicians face to stay relevant in a competitive industry. He also spoke about the evolving concert culture in India and the rise of independent music."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-and-kareena-kapoor-request-paparazzi-to-not-take-photos-of-taimur-jeh-ali-khan-2671543-2025-01-28",
      "headline": "Saif Ali Khan, Kareena Kapoor request paparazzi not to take photos of Taimur, JehAfter the attack on Saif Ali Khan, he and his wife and actor Kareena Kapoor released a statement to the media wherein they requested the paparazzi not to take photos of their children, Taimur and Jeh Ali Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-barjatya-on-saif-ali-khan-attack-a-warrior-2671519-2025-01-28",
      "headline": "Director Sooraj Barjatya on Saif Ali Khan's attack: He is a warriorDirector and producer Sooraj Barjatya recently reacted to the knife attack on actor Saif Ali Khan and wished him a speedy recovery. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sanju-samson-catch-drs-ms-dhoni-rajkot-2671556-2025-01-28",
      "headline": "Watch: Sanju Samson does an MS Dhoni, calls DRS right after stunning catchIndia vs England, 3rd T20I: Sanju Samson got a Decision Review System call spot on, helping Varun Charkvarthy pick the first of his five wickets on Tuesday in Rajkot. Samson took a sharp catch to dismiss Jos Buttler. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-harry-brook-struggles-vs-spin-t20is-2671561-2025-01-28",
      "headline": "Smog or not, Harry Brook's struggles vs spin persist in India T20IsEngland batter Harry Brook continued to fail against spin vs India in the ongoing 5-match T20I series. Brook was dismissed by Ravi Bishnoi in the 3rd match of the series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-t20i-varun-chakaravarthy-five-wicket-haul-rajkot-2671557-2025-01-28",
      "headline": "Chakaravarthy becomes 3rd Indian bowler to take multiple T20I 5-wicket haulsVarun Chakaravarthy joined Kuldeep Yadav and Bhuvneshwar Kumar in an elite list as he picked up his 2nd 5-wicket haul in Rajkot on Tuesday, January 28. Varun ended with figures of 24 for 5 in his 4 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-narendra-modi-2036-olympics-hosting-indian-sports-national-games-2671548-2025-01-28",
      "headline": "Hosting 2036 Olympics will take Indian sports to new heights: PM ModiPrime Minister Narendra Modi has announced that India are actively pursuing the hosting rights for the 2036 Olympics, expressing confidence that it will elevate the country's sports to new heights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-t20-world-cup-win-cricketer-of-the-year-best-moment-2671549-2025-01-28",
      "headline": "Cricketer Of The Year or T20 World Cup win? Jasprit Bumrah reveals best momentJasprit Bumrah rated the T20 World Cup win for India over his ICC Cricketer Of The Year award win on Tuesday, January 28. Bumrah was the star for India as they won the T20 World Cup by beating South Africa in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-best-players-awards-2024-full-list-jasprit-bumrah-amelia-kerr-2671520-2025-01-28",
      "headline": "Full list of ICC award winners, as Jasprit Bumrah, Amelia Kerr dominateJasprit Bumrah and Amelia Kerr were named the ICC best player of the year in men's and women's category on Tuesday, January 28. Here is the full list of honours for 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-coldplay-concert-ahmedabad-signed-jersey-wife-mother-video-2671516-2025-01-28",
      "headline": "Watch: Bumrah gifts Coldplay signed jersey, enjoys Ahmedabad concert with familySuperstar cricketer Jasprit Bumrah recalled his visit to the Coldplay concert in Ahmedabad. The fast bowler was seen gifting Coldplay a signed jersey with a heartwarming message. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-delhi-vs-railways-livestream-where-to-watch-virat-kohli-2671504-2025-01-28",
      "headline": "Virat Kohli Ranji match to be livestreamed as BCCI makes last minute change in plansThe Indian Cricket Board has made a late change in its broadcast plans for the Ranji Trophy. The BCCI is set to livestream the Delhi vs Railways game after it was confirmed that Virat Kohli will play his first match in the domestic tournament after a long break of 12 years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shami-comeback-playing-xi-toss-2671499-2025-01-28",
      "headline": "Shami plays Rajkot T20I, makes international comeback after 435 daysVeteran India pacer Mohammed Shami made his much-awaited comeback to the Indian side in the third T20I of the five-match series against England in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-icc-cricketer-of-the-year-award-emulates-virat-kohli-2671447-2025-01-28",
      "headline": "Jasprit Bumrah becomes 1st Indian pacer to win ICC Cricketer of the Year awardJasprit Bumrah has emulated the likes of Sachin Tendulkar and Virat Kohli to become ICC's men's Cricketer Of The Year for his incredible performance in 2024. He became the first Indian pacer to win the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-coldplay-concert-ahmedabad-signed-jersey-wife-mother-video-2671516-2025-01-28",
      "headline": "Watch: Bumrah gifts Coldplay signed jersey, enjoys Ahmedabad concert with familySuperstar cricketer Jasprit Bumrah recalled his visit to the Coldplay concert in Ahmedabad. The fast bowler was seen gifting Coldplay a signed jersey with a heartwarming message. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-delhi-vs-railways-livestream-where-to-watch-virat-kohli-2671504-2025-01-28",
      "headline": "Virat Kohli Ranji match to be livestreamed as BCCI makes last minute change in plansThe Indian Cricket Board has made a late change in its broadcast plans for the Ranji Trophy. The BCCI is set to livestream the Delhi vs Railways game after it was confirmed that Virat Kohli will play his first match in the domestic tournament after a long break of 12 years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shami-comeback-playing-xi-toss-2671499-2025-01-28",
      "headline": "Shami plays Rajkot T20I, makes international comeback after 435 daysVeteran India pacer Mohammed Shami made his much-awaited comeback to the Indian side in the third T20I of the five-match series against England in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-icc-cricketer-of-the-year-award-emulates-virat-kohli-2671447-2025-01-28",
      "headline": "Jasprit Bumrah becomes 1st Indian pacer to win ICC Cricketer of the Year awardJasprit Bumrah has emulated the likes of Sachin Tendulkar and Virat Kohli to become ICC's men's Cricketer Of The Year for his incredible performance in 2024. He became the first Indian pacer to win the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-team-training-lun-ch-chhole-poori-kadhi-chawal-2671443-2025-01-28",
      "headline": "Kohli skips chhole poori for old-time favourite during Delhi training returnVirat Kohli decided to skip chhole poori and decided to settle for an old-time favourite during lunch after practising with the Delhi Ranji Trophy team on Tuesday, January 28. Kohli is gearing up for his return to the tournament after a gap of 13 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-2025-gongadi-trisha-india-vs-scotland-2671437-2025-01-28",
      "headline": "All-round Trisha stars as India floor Scotland in U19 Women's T20 World CupU19 T20 Women's World Cup: Gongadi Trisha scored 110 runs and picked up three wickets as India beat Scotland by 150 runs in the Super Sixes match at the Bayuemas Oval in Kuala Lumpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-hugs-childhood-friend-ranji-trophy-delhi-training-shawez-khan-2671373-2025-01-28",
      "headline": "Watch: Kohli hugs childhood friend during Ranji Trophy training in DelhiRanji Trophy: Virat Kohli reunited with his childhood friend Shawez Khan during a training session with the Delhi Ranji team at Arun Jaitley Stadium, showcasing his humble side while preparing for a highly-anticipated return to domestic cricket after over a decade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-virat-kohli-kl-rahul-sunil-gavaskar-delhi-karnataka-2671349-2025-01-28",
      "headline": "Sunil Gavaskar questions Virat Kohli, KL Rahul missing previous Ranji Trophy gameSunil Gavaskar questioned the reason behind Virat Kohli and KL Rahul missing the previous round of Ranji Trophy games for Delhi and Karnataka respectively. Kohli and Rahul said they were dealing with niggles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-axar-patel-batting-aakash-chopra-all-rounders-2671334-2025-01-28",
      "headline": "Axar Patel a responsible batter, he can't bat as low as No. 8 in T20Is: Aakash ChopraIndia vs England: All-rounder Axar Patel should bat higher-up the order and India need to use their all-rounders better, said former opener Aakash Chopra. India played three all-rounders in the second T20I in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/archery-sheetal-devi-anand-mahindra-scorpio-n-gift-2671295-2025-01-28",
      "headline": "Anand Mahindra moved by Sheetal Devi's determination, gifts armless archer new SUVAnand Mahindra gifted India's armless archer Sheetal Devi a brand-new Mahindra Scorpio-N. He also praised the para-athlete for her grit and determination. Last year, Sheetal bagged the bronze medal in the mixed team compound event in archery at Paris Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/virat-kohli-young-fan-advice-how-to-become-a-cricketer-ranji-trophy-training-delhi-2671296-2025-01-28",
      "headline": "Watch: Kohli's wholesome advice to young fan on how to become a cricketerVirat Kohli took time to greet a young fan attending his training session with the Delhi Ranji Trophy squad at the Arun Jaitley Stadium in New Delhi. He even offered advice on how to become a future Indian cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ab-de-villiers-cricket-return-changers-south-africa-champions-world-championship-of-legends-2671280-2025-01-28",
      "headline": "AB de Villiers set for cricket return in World Championship of LegendsAB de Villiers announced his cricket comeback, set to captain Game Changers South Africa Champions in the World Championship of Legends, reigniting excitement among fans as he prepares to showcase his brilliance nearly four years after retiring from the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-axar-patel-batting-aakash-chopra-all-rounders-2671334-2025-01-28",
      "headline": "Axar Patel a responsible batter, he can't bat as low as No. 8 in T20Is: Aakash ChopraIndia vs England: All-rounder Axar Patel should bat higher-up the order and India need to use their all-rounders better, said former opener Aakash Chopra. India played three all-rounders in the second T20I in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/archery-sheetal-devi-anand-mahindra-scorpio-n-gift-2671295-2025-01-28",
      "headline": "Anand Mahindra moved by Sheetal Devi's determination, gifts armless archer new SUVAnand Mahindra gifted India's armless archer Sheetal Devi a brand-new Mahindra Scorpio-N. He also praised the para-athlete for her grit and determination. Last year, Sheetal bagged the bronze medal in the mixed team compound event in archery at Paris Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/virat-kohli-young-fan-advice-how-to-become-a-cricketer-ranji-trophy-training-delhi-2671296-2025-01-28",
      "headline": "Watch: Kohli's wholesome advice to young fan on how to become a cricketerVirat Kohli took time to greet a young fan attending his training session with the Delhi Ranji Trophy squad at the Arun Jaitley Stadium in New Delhi. He even offered advice on how to become a future Indian cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ab-de-villiers-cricket-return-changers-south-africa-champions-world-championship-of-legends-2671280-2025-01-28",
      "headline": "AB de Villiers set for cricket return in World Championship of LegendsAB de Villiers announced his cricket comeback, set to captain Game Changers South Africa Champions in the World Championship of Legends, reigniting excitement among fans as he prepares to showcase his brilliance nearly four years after retiring from the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-gongadi-trisha-century-india-vs-scotland-2671259-2025-01-28",
      "headline": "India's Trisha hits historic first-ever century in U19 Women's T20 World CupU19 Women's T20 World Cup: India's G Trisha etched her name in the history books after becoming the first-ever batter to score a hundred in the tournament. She got to the landmark in the match against Scotland at the Bayuemas Oval in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-delhi-training-back-foot-batting-ranji-trophy-arun-jaitley-stadium-2671247-2025-01-28",
      "headline": "Watch: Virat Kohli focuses on backfoot game, plays cracking shots at Delhi netsRanji Trophy 2024-25: Virat Kohli focused on playing off the backfoot when he trained with the Delhi Ranji team at the Arun Jaitley Stadium in New Delhi on Tuesday, January 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-amelia-kerr-smriti-mandhana-icc-womens-cricketer-of-the-year-award-new-zealand-2671225-2025-01-28",
      "headline": "New Zealand sensation Amelia Kerr named Women's Cricketer of the Year New Zealand all-rounder Amelia Kerr won the ICC Women's Cricketer of the Year award after a stellar 2024 where she also became the Player of the Tournament in the Women's T20 World Cup in the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-joins-delhis-ranji-trophy-squad-ahead-of-return-to-domestic-cricket-2671219-2025-01-28",
      "headline": "Virat Kohli joins Delhi's Ranji trophy squad ahead of return to domestic cricketIndian batter Virat Kohli has joined Delhi's Ranji Trophy squad in preparation for his return to domestic cricket. Kohli returns to the Ranji Trophy after 12 years, set to play for Delhi against Railways, his first appearance since facing Uttar Pradesh in 2012."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}