{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-on-used-cars-5-faqs-you-should-know-2655687-2024-12-26",
      "headline": "GST on used cars: 5 FAQs you should knowGST on used cars rises to 18%, impacting dealer margins and platform sales, but personal sales remain unaffected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-close-flat-fmcg-stocks-drag-markets-adani-ports-gain-5-percent-2655649-2024-12-26",
      "headline": "Sensex, Nifty end flat as early gains wiped out by decline in FMCG stocks The S&P BSE Sensex added 18.18 points to close at 78,491.05, while the NSE Nifty50 was up 22.55 points to end the day at 23,750.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-day-3-latest-subscription-gmp-why-are-brokers-bullish-on-it-2655642-2024-12-26",
      "headline": "Unimech Aerospace IPO: Why are brokers bullish on it? Check latest GMPUnimech Aerospace IPO: Unimech Aerospace aims to raise Rs 500 crore through the IPO, which includes a fresh issue of Rs 250 crore and an offer for sale (OFS) of Rs 250 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/newgen-software-share-price-surges-8-percent-why-multibagger-it-stock-gained-today-2655636-2024-12-26",
      "headline": "Newgen Software share price surges 8%. Why multibagger IT stock gained today?Newgen Software stock price: The stock surged 7.67% to touch a day's high of Rs 1,725.15 on the Bombay Stock Exchange, up from its previous close of Rs 1,602.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-for-uan-and-aadhaar-linking-under-the-employment-linked-incentive-eli-scheme-all-you-need-to-know-2655614-2024-12-26",
      "headline": "EPFO extends deadline for UAN and Aadhaar linking: All you need to knowThe EPFO's deadline extension to January 15, 2025, allows employees extra time to activate UAN and link Aadhaar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-soar-earn-up-to-74-percent-with-dcb-indusind-yes-bank-of-baroda-axis-bank-karur-vysya-bank-hdfc-bank-and-icici-bank-2655583-2024-12-26",
      "headline": "FD rates soar: Earn up to 7.4% with DCB, IndusInd, YES, Axis and other top banksWith appealing FD rates of up to 7.4%, investors can enjoy guaranteed returns and financial security, making FDs a preferred option for low-risk investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-share-price-surges-15-hits-record-high-whats-should-investors-do-2655585-2024-12-26",
      "headline": "Mobikwik share price surges 15%, hits record high: Shoud investors book profit? At around 1:38 pm, shares of the company were trading 11% higher at Rs 675.90. The stock has delivered stellar returns, surging over 150% from its issue price of Rs 279, marking it as a multibagger for investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sips-analysis-34-mutual-funds-lost-money-in-2024-quant-psu-fund-aditya-birla-sl-psu-equity-fund-2655577-2024-12-26",
      "headline": "SIPs in red: Mutual funds that lost money for investors in 2024SIPs (systematic investment plans) have been the go-to strategy for people looking to dodge market volatility while building a financial cushion, but over 34 mutual funds lost money for investors in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anya-polytech-and-fertilizers-ipo-check-latest-gmp-price-band-lot-size-stmp-2655561-2024-12-26",
      "headline": "Anya Polytech & Fertilizers IPO: Check latest GMP, price band, lot sizeAnya Polytech and Fertilizers IPO: Investors opting for a single lot will require Rs 1,40,000 at the upper price band. Non-retail investors must apply for at least two lots, amounting to Rs 2,80,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-stock-price-rises-nearly-5-in-early-trade-should-you-buy-2655539-2024-12-26",
      "headline": "Mazagon Dock share price rises nearly 5% in early trade. Should you buy?Mazagon Dock stock price: The company's shares gained nearly 5% in early trade, but pared some gains as the session progressed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-apples-steve-jobs-advice-fueled-the-creation-of-salesforces-appexchange-marc-benioff-2655538-2024-12-26",
      "headline": "How Steve Jobs' advice fuelled the creation of Salesforce's AppExchangeSalesforce's Marc Benioff credits Steve Jobs' visionary advice for inspiring the creation of the transformative AppExchange platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/international-gemmological-institute-share-price-jumped-10-percent-today-2655527-2024-12-26",
      "headline": "Explained: Why International Gemmological Institute share price jumped 10% todayInternational Gemmological Institute stock price: In a stock exchange filing, IGI confirmed that it had acquired a 100% stake in IGI Netherlands B.V. and International Gemmological Institute BV for $88.44 million and $69.76 million, respectively."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-falls-sharply-today-explained-2655519-2024-12-26",
      "headline": "NTPC Green Energy share price falls sharply today. Here's whyNTPC Green Energy Stock: The company debuted on the Indian stock exchanges on November 29, listing at Rs 111.50 on the NSE, just 3.2% above its issue price of Rs 108 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sumitomo-mitsui-financial-group-smfg-infuses-rs-3000-crore-into-smfg-india-credit-via-rights-2655515-2024-12-26",
      "headline": "Sumitomo Mitsui strengthens Indian subsidiary with Rs 3,000 crore fundingWith this, SMFG India Credit has seen its highest-ever annual fund infusion of Rs 4,300 crore in the 2024 financial year, following an earlier investment of Rs 1,300 crore in April 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/svamitva-scheme-what-is-it-and-3-things-to-know-pm-modi-to-five-million-additional-property-cards-across-india-2655508-2024-12-26",
      "headline": "SVAMITVA scheme: What is it and 3 things to know The SVAMITVA initiative enables Rs 1.37 lakh crore in rural assets to be monetised, resolving land disputes and boosting rural prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-price-jumps-5-percent-to-hit-upper-circuit-today-will-rally-continue-stmp-2655493-2024-12-26",
      "headline": "Sagility India share price jumps 5%, up 71% post-listing. More gains ahead?Sagility India stock price: Since its listing, Sagility India's shares have delivered a 71% return, significantly outperforming the broader indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claims-rejected-pending-irdai-report-premiums-to-remain-high-india-insurers-2655186-2024-12-26",
      "headline": "11% of all health insurance claims rejected, premiums to remain high: ReportInsurance companies in India rejected 11% of all health insurance claims in 2023-24, according to the latest report from India's insurance regulator. The Insurance Regulatory Authority of India (IRDAI) report also predicts that health insurance premiums are \"likely to remain elevated\" this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-stock-price-jumps-6-percent-early-trade-key-reason-stmp-2655477-2024-12-26",
      "headline": "Explained: Why Ola Electric share price surged 6% in early tradeOla Electric stock price: The company's share price hit an intraday high of Rs 99.90 on Thursday, reflecting a 6.22% increase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-ipo-allotment-status-check-latest-gmp-expected-gain-listing-date-2655473-2024-12-26",
      "headline": "Senores Pharmaceuticals IPO allotment: Check status, GMP, and listing dateSenores Pharmaceuticals IPO allotment status: Investors can check their allotment by visiting the websites of the Bombay Stock Exchange (BSE) or Link Intime India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-day-3-check-latest-gmp-allotment-date-subscription-last-day-for-bidding-stmp-2655463-2024-12-26",
      "headline": "Unimech Aerospace IPO: Check GMP as listing enters last day for biddingThe IPO comprises a fresh issue of 32 lakh shares valued at Rs 250 crore and an offer for sale (OFS) of an equal number of shares, also worth Rs 250 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-complaint-delhi-false-schemes-aam-aadmi-party-wants-remove-congress-india-bloc-alliance-request-members-2655503-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's 24-hour ultimatum to Congress: Will ask INDIA bloc to remove party if...The AAP is upset with the Congress after it filed a complaint against Arvind Kejriwal accusing him of 'misleading and deceiving' the public with promises of 'non-existent' welfare schemes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-missile-azerbaijan-baku-passenger-aircraft-killed-38-what-happened-poor-weather-drone-attack-2655573-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Russian missile bring down Azerbaijan passenger aircraft, killing 38?An Azerbaijani passenger aircraft crashed in Kazakhstan, killing at least 38 people. Some reports are suggesting that it wasn't a technical snag or crew error, but an anti-aircraft missile that might have brought down the aircraft. Azerbaijan has initiated an investigation into the deadly crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-15000-taliban-fighters-relations-ttp-airstrike-islamabad-kabul-explained-2655570-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "15,000 Taliban fighters march to take on Pak. Why is Taliban biting back?For decades, Pakistan nurtured the Taliban for strategic reasons. It recognised it as a legitimate government and provided military assistance. Now, the same Taliban is biting the hand that fed it. This is how the Afghan Taliban is compounding Pakistan's woes from the Tehreek-e-Taliban Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sam-konstas-shoulder-punch-boxing-day-india-vs-australia-test-fine-match-fee-20-per-cent-icc-2655552-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli escapes ban, fined for Sam Konstas bust-up at MCGAUS vs IND, 1st Test, Day 1: Virat Kohli has been fined 20 percent of his match fees after his altercation with Australian debutant Sam Konstas on Day 1 of the Melbourne Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/squid-game-2-review-lee-jung-jae-2655574-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Squid Game 2 review: Lee Jung-jae show not just raises the stake but amplifies itReleased-Thu Dec 26, 2024Squid Game Season 2 delivers on fan expectations with intense action and complex character development, pushing the boundaries of the deadly game. The season explores deeper themes of morality and choice, offering a psychological battle alongside the physical challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-banners-distorted-india-map-belagavi-cwc-session-bjp-massive-row-2655541-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Row over Congress banners showing distorted India map, BJP's 'Soros' dig at partyThe BJP accused the Congress of doing appeasement politics after Congress banners displaying a distorted map of India were spotted in Karnataka's Belagavi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-sam-konstas-reaction-virat-kohli-jasprit-bumrah-2655602-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Think Virat Kohli accidentally bumped into me, altercations fire me up: Sam KonstasAustralia vs India, 4th Test: 19-year-old opener Sam Konstas said the on-field exchanges with India players, including Virat Kohli, fired him up. On debut, Konstas smashed 60 off just 65 balls in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rss-magazine-organiser-counter-mohan-bhagwat-temple-mosque-disputes-2655620-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS-linked magazine differs with Mohan Bhagwat over temple-mosque disputesRSS-affiliated magazine, The Organiser, took a different stance than Mohan Bhagwat, saying knowing the real history of disputed sites was important for 'civilisational justice'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-origin-ceo-aravind-srinivas-reaction-to-elon-musk-ozempic-santa-pic-goes-viral-2655637-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin CEO's reaction to Elon Musk's 'Ozempic Santa' pic goes viral To celebrate Christmas, Elon Musk posted a photograph of himself dressed as Santa Claus and called himself an 'Ozempic Santa', referring to the type-2 diabetes drug for weight loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/troops-withdrawn-but-de-escalation-eludes-india-china-border-satellite-images-2655668-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Troops withdrawn but de-escalation eludes India-China border: Satellite imagesA visual review of the border situation with China reveals an immediate troop pullback but highlights rapid infrastructure upgrades in disputed areas, casting doubts on China's commitment to long-term de-escalation.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-congress-brs-political-donations-2023-2024-electoral-bonds-2655600-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "KCR's party received more donations than Congress in 2023-24, BJP tops listK Chandrashekar Rao's Bharat Rashtra Samithi (BRS) received the second-highest donation at Rs 580 crore, pipping the Congress, which got Rs 289 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kazakhstan-plane-crash-azerbaijan-airlines-flight-passenger-records-before-after-crash-2655432-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Survivor captures horror moments before and after Kazakhstan plane crashKazakhstan Plane Crash: An Azerbaijan Airlines passenger aboard the flight that crashed in Kazakhstan's Aktau, recorded a video showing the horror moments inside the plane before and after the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-arjun-kapoor-i-am-single-comment-his-prerogative-2655478-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Malaika Arora reacts to Arjun Kapoor's 'I am single' commentMalaika Arora recently shared her thoughts on ex-boyfriend Arjun Kapoor's 'I am single' comment. The actor said that whatever Arjun said was his 'prerogative.' "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-film-industry-meet-telangana-minister-revanth-reddy-allu-aravind-venkatesh-and-others-2655455-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Celebrities must control fans, Revanth Reddy tells Telugu stars in meet: SourcesSandhya Theatre Stampede Case: Telangana Chief Minister Revanth Reddy met with Telugu film industry representatives and told them that actors were responsible for controlling fans, sources said, amid a row over the Pushpa 2 stampede screening case, in which a woman died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-integrates-two-spadex-satellites-with-pslv-c60-for-launch-2655643-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro integrates two Spadex satellites with PSLV-C60 for launchThe SpaDeX mission involves two identical satellites, designated SDX01 (Chaser) and SDX02 (Target), each weighing approximately 220 kg. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-sam-konstas-mcg-test-2655661-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How much fine does Virat Kohli need to pay after Konstas altercation? AUS vs IND, Boxing Day Test: Virat Kohli was fined 20 percent of his match fee after his altercation with Sam Konstas where he shouldered the young Australian batter in the first session of the opening day's play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kiara-advani-faces-backlash-for-shoutout-to-jani-master-edits-post-later-2655594-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kiara Advani faces backlash for shoutout to Jani Master, edits post laterKiara Advani recently shared a behind-the-scene video from her first day on the set of Game Changer, giving a shoutout to the film's cast and crew, including choreographer Jani Master. However, after facing backlash, she edited the post to remove his name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-rushdie-satanic-verses-book-india-delhi-bookstore-ban-36-years-2655383-2024-12-25?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Rushdie's The Satanic Verses hits Delhi bookstores after 36-year banSalman Rushdie's The Satanic Verses, priced at Rs 1,999, is only available at Bahrisons Booksellers stores across Delhi-NCR."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-pradesh-couple-dies-by-suicide-over-sons-relationship-with-transgender-person-2655648-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra couple dies by suicide after son insists on marrying transgenderA middle-aged couple in Nandyal in Andhra Pradesh allegedly died by suicide over a conflict with their son's relationship with a transgender person. The son also reportedly spent Rs 1.5 lakh that belonged to the transgender community."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-war-update-peace-deal-guarantee-security-russia-zelenskyy-putin-moscow-foreign-minister-sergei-lavrov-2655641-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Any Ukraine peace deal reached should guarantee Russia's security: MoscowRussia wants a legally binding deal for a lasting peace in war-torn Ukraine that would ensure security in the region, Foreign Minister Sergei Lavrov said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ranveer-allahbadia-girlfriend-rescued-from-drowning-goa-shares-terrifying-experience-beerbiceps-2655549-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Started fading away': Ranveer Allahbadia, girlfriend rescued from drowning in GoaIn his heartfelt post, Ranveer Allahbadia revealed how a seemingly fun swim with his girlfriend turned into a struggle for survival."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-murder-woman-hacks-husband-to-death-over-domestic-dispute-2655613-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman axes husband to death after he threatens to leave her for not conceivingBefore the attack, the husband verbally abused her and warned that he would leave her for another woman if she was unable to conceive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-fans-confront-pro-khalistani-group-over-anti-india-slogan-at-mcg-during-4th-test-at-border-gavaskar-series-2655492-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fans confront Khalistani group shouting anti-India slogans during Australia gameA pro-Khalistani group with the sole intention of creating a ruckus had barged into the stadium without any tickets, waving Khalistani flags, shouting slogans against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/why-honey-singh-did-not-talk-about-mafia-mundeer-in-his-netflix-documentary-2655628-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Honey Singh didn't talk about Mafia Mundeer in his Netflix documentarySinger-rapper Honey Singh addresses why Mafia Mundeer was left out of his Netflix documentary, explaining that the makers chose to focus on untold stories. Director Mozez Singh adds that the band is no longer relevant to Singh's journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anurag-kashyap-bollywood-would-not-let-him-make-films-like-rifle-club-2655639-2024-12-26",
      "headline": "Anurag Kashyap says Bollywood 'won't let' him make films like Rifle ClubAnurag Kashyap discussed the challenges he faced in Bollywood compared to the collaborative spirit of Malayalam cinema, as seen in his debut Malayalam film, Rifle Club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/video-sussane-khan-heads-off-on-new-year-vacation-with-boyfriend-arslan-goni-2655672-2024-12-26",
      "headline": "Video: Sussane Khan heads off on New Year vacation with boyfriend Arslan GoniHrithik Roshan's ex-wife Sussane Khan jetted off with boyfriend Arslan Goni today. The couple is off an undisclosed location to celebrate the New Year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/barroz-box-office-day-1-mohanlal-film-opens-to-rs-36-crore-after-mixed-talk-2655587-2024-12-26",
      "headline": "Barroz box office Day 1: Mohanlal's film opens to Rs 3.6 crore after mixed talkMohanlal's much-anticipated directorial debut, Barroz, released on December 25, made a modest Rs 3.65 crore on its first day. Despite being a Christmas release, the film faced tough competition and witnessed limited attendance across theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/why-honey-singh-did-not-talk-about-mafia-mundeer-in-his-netflix-documentary-2655628-2024-12-26",
      "headline": "Why Honey Singh didn't talk about Mafia Mundeer in his Netflix documentarySinger-rapper Honey Singh addresses why Mafia Mundeer was left out of his Netflix documentary, explaining that the makers chose to focus on untold stories. Director Mozez Singh adds that the band is no longer relevant to Singh's journey."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/how-virat-kohli-and-rohit-sharma-geared-up-for-mcg-test-abhishek-nayar-reveals-2655689-2024-12-26",
      "headline": "How Virat Kohli and Rohit Sharma geared up for MCG Test: Abhishek Nayar revealsIndia's assistant coach Abhishek Nayar reveals how Virat Kohli and Rohit Sharma have geared up for the Boxing Day Test in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-sam-konstas-mcg-test-2655661-2024-12-26",
      "headline": "How much fine does Virat Kohli need to pay after Konstas altercation? AUS vs IND, Boxing Day Test: Virat Kohli was fined 20 percent of his match fee after his altercation with Sam Konstas where he shouldered the young Australian batter in the first session of the opening day's play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-sam-konstas-reaction-virat-kohli-jasprit-bumrah-2655602-2024-12-26",
      "headline": "Think Virat Kohli accidentally bumped into me, altercations fire me up: Sam KonstasAustralia vs India, 4th Test: 19-year-old opener Sam Konstas said the on-field exchanges with India players, including Virat Kohli, fired him up. On debut, Konstas smashed 60 off just 65 balls in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-fined-for-altercation-with-sam-konstas-at-mcg-sources-2655593-2024-12-26",
      "headline": "Virat Kohli fined for altercation with Sam Konstas at MCG: SourcesAccording to the sources, Virat Kohli has been fined 20 percent of his match fee for his altercation with Sam Konstas in 4th Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-rohit-sharma-opening-aus-vs-ind-2655580-2024-12-26",
      "headline": "AUS vs IND: Rohit Sharma will return to opening in MCG Test, confirms Abhishek Nayar AUS vs IND, Border Gavaskar Trophy: Rohit Sharma will open the batting in the Melbourne Test after failing to perform in the middle order in the Brisbane and Adelaide Tests, confirmed by Abhishek Nayar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sam-konstas-shoulder-punch-boxing-day-india-vs-australia-test-fine-match-fee-20-per-cent-icc-2655552-2024-12-26",
      "headline": "Virat Kohli escapes ban, fined for Sam Konstas bust-up at MCGAUS vs IND, 1st Test, Day 1: Virat Kohli has been fined 20 percent of his match fees after his altercation with Australian debutant Sam Konstas on Day 1 of the Melbourne Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shikha-pandey-canterbury-magicians-super-smash-2655537-2024-12-26",
      "headline": "Shikha Pandey signs for Canterbury Magicians for New Zealand Super Smash Indian speedster Shikha Pandey has signed for the Canterbury Magicians in the Women's Super Smash. The 35-year-old recently played for Brisbane Heat in the Women's Big Bash League (WBBL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-boxing-day-test-day-1-report-konstas-bumrah-2655518-2024-12-26",
      "headline": "Jasprit Bumrah, India recover from Sam Konstas punch on Boxing DayBoxing Day Test: Australia's top-order stepped with the bat to guide the hosts to 311 for six at the close of play on Day 1. Jasprit Bumrah-inspired India took 4 wickets in the final session to script a small comeback after Sam Konstas's special hammering in the fourth Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-steve-smith-don-bradman-mcg-tests-australia-vs-india-record-2655514-2024-12-26",
      "headline": "Smith joins Bradman in elite club with 10th 50 plus score in MCG Tests AUS vs IND: Steve Smith scored a fifty off 71 balls in the Boxing Day Test and joined Don Bradman, Greg Chappell and Ricky Ponting in an elite list of batters with 10 or more plus scores in Tests at the MCG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sam-konstas-shoulder-punch-boxing-day-india-vs-australia-test-fine-match-fee-20-per-cent-icc-2655552-2024-12-26",
      "headline": "Virat Kohli escapes ban, fined for Sam Konstas bust-up at MCGAUS vs IND, 1st Test, Day 1: Virat Kohli has been fined 20 percent of his match fees after his altercation with Australian debutant Sam Konstas on Day 1 of the Melbourne Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shikha-pandey-canterbury-magicians-super-smash-2655537-2024-12-26",
      "headline": "Shikha Pandey signs for Canterbury Magicians for New Zealand Super Smash Indian speedster Shikha Pandey has signed for the Canterbury Magicians in the Women's Super Smash. The 35-year-old recently played for Brisbane Heat in the Women's Big Bash League (WBBL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-boxing-day-test-day-1-report-konstas-bumrah-2655518-2024-12-26",
      "headline": "Jasprit Bumrah, India recover from Sam Konstas punch on Boxing DayBoxing Day Test: Australia's top-order stepped with the bat to guide the hosts to 311 for six at the close of play on Day 1. Jasprit Bumrah-inspired India took 4 wickets in the final session to script a small comeback after Sam Konstas's special hammering in the fourth Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-steve-smith-don-bradman-mcg-tests-australia-vs-india-record-2655514-2024-12-26",
      "headline": "Smith joins Bradman in elite club with 10th 50 plus score in MCG Tests AUS vs IND: Steve Smith scored a fifty off 71 balls in the Boxing Day Test and joined Don Bradman, Greg Chappell and Ricky Ponting in an elite list of batters with 10 or more plus scores in Tests at the MCG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-jasprit-bumrah-travis-head-bowled-video-mcg-record-2655509-2024-12-26",
      "headline": "Watch: Jasprit Bumrah bowls Travis Head for 0, breaks Anil Kumble's MCG recordAustralia vs India, 4th Test: Jasprit Bumrah became India's leading wicket-taker in Tests at the Melbourne Cricket Ground. The top-ranked fast bowler took 3 wickets on Day 1 of the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-to-review-altercation-between-virat-kohli-and-sam-konstas-2655494-2024-12-26",
      "headline": "ICC to review altercation between Virat Kohli and Sam KonstasICC will be reviewing the on-field altercation involving batting star Virat Kohli and Australian debutant Sam Konstas on Day 1 of the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-melbourne-shane-warne-floppy-hat-tribute-2655483-2024-12-26",
      "headline": "Watch: Melbourne crowd pays floppy hat tribute to Shane Warne on Boxing Day Border-Gavaskar Trophy: Shane Warne's children joined the crowd at Melbourne to pay tribute to the leg-spinner, who died in March 2022. Fans doffed their floppy hats in memory of the legendary cricketer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-icc-review-virat-kohli-shouldering-sam-konstas-sources-2655485-2024-12-26",
      "headline": "ICC likely to punish Virat Kohli for shouldering Sam Konstas: SourcesA top source within the ICC has indicated that Virat Kohli could face punishment for shouldering Sam Konstas on Day 1 of the Boxing Day Test. The source stated that the match referee and umpires will review the matter and may call the players for an explanation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-fiery-virat-kohli-instructions-mcg-test-siraj-stump-mic-2655471-2024-12-26",
      "headline": "Fiery Virat Kohli instructions at MCG caught on stump micVirat Kohli was caught on the stump mic delivering stern instructions to pacer Mohammed Siraj, saying, \"Has ke baat nahi karna inse\" (Don't smile while talking to them) on Day 1 of the fourth Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-justin-langer-sam-konstas-60-mcg-virender-sehwag-2655460-2024-12-26",
      "headline": "Sam Konstas reminded me of 2003 Virender Sehwag: Justin LangerBorder-Gavaskar Trophy: Former Australian opener Justin Langer likened Sam Konstas to ex-Indian opener Virender Sehwag after the teenage debutant lit up the MCG with a stroke-filled 60 against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-virat-kohli-sam-konstas-sunil-gavaskar-alyssa-healy-2655436-2024-12-26",
      "headline": "King rattled? Pundits react to Virat Kohli's confrontation with Sam Konstas Border-Gavaskar Trophy: Sunil Gavaskar and Michael Vaughan were among the many who criticised Virat Kohli after the former India captain was involved in a physical altercation with 19-year-old debutant, Sam Konstas in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mcg-virat-kohli-sam-konstas-icc-ban-rules-explained-2655420-2024-12-26",
      "headline": "Will Virat Kohli be banned for Sam Konstas on-field bust-up? ICC rules explainedBorder-Gavaskar Trophy 2024: Virat Kohli might face a strict sanction from the International Cricket Council for his bust-up with teenage opener Sam Konstas on Day 1 of the Boxing Day Test in Melbourne. Kohli appeared to make deliberate contact with the opener on December 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-fiery-virat-kohli-instructions-mcg-test-siraj-stump-mic-2655471-2024-12-26",
      "headline": "Fiery Virat Kohli instructions at MCG caught on stump micVirat Kohli was caught on the stump mic delivering stern instructions to pacer Mohammed Siraj, saying, \"Has ke baat nahi karna inse\" (Don't smile while talking to them) on Day 1 of the fourth Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-justin-langer-sam-konstas-60-mcg-virender-sehwag-2655460-2024-12-26",
      "headline": "Sam Konstas reminded me of 2003 Virender Sehwag: Justin LangerBorder-Gavaskar Trophy: Former Australian opener Justin Langer likened Sam Konstas to ex-Indian opener Virender Sehwag after the teenage debutant lit up the MCG with a stroke-filled 60 against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-virat-kohli-sam-konstas-sunil-gavaskar-alyssa-healy-2655436-2024-12-26",
      "headline": "King rattled? Pundits react to Virat Kohli's confrontation with Sam Konstas Border-Gavaskar Trophy: Sunil Gavaskar and Michael Vaughan were among the many who criticised Virat Kohli after the former India captain was involved in a physical altercation with 19-year-old debutant, Sam Konstas in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mcg-virat-kohli-sam-konstas-icc-ban-rules-explained-2655420-2024-12-26",
      "headline": "Will Virat Kohli be banned for Sam Konstas on-field bust-up? ICC rules explainedBorder-Gavaskar Trophy 2024: Virat Kohli might face a strict sanction from the International Cricket Council for his bust-up with teenage opener Sam Konstas on Day 1 of the Boxing Day Test in Melbourne. Kohli appeared to make deliberate contact with the opener on December 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-sam-konstas-virat-kohli-controversy-fight-mcg-2655421-2024-12-26",
      "headline": "Sam Konstas reacts to on-field bust-up with Virat Kohli at MCGIND vs AUS, 4th Test: Young Australia opener Sam Konstas has reacted to his heated altercation with Virat Kohli on Day 1 of the Boxing Day Test match. Konstas spoke about the incident on the live broadcast during the Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohli-slammed-bumping-sam-konstas-tempers-flare-4th-test-2655408-2024-12-26",
      "headline": "Virat Kohli slammed for bumping into Sam Konstas as tempers flare at MCGSenior India batter Virat Kohli was engaged in a heated altercation with Australia debutant Sam Konstas on Boxing Day at Melbourne Cricket Ground (MCG). Konstas hit a superb fifty on his Test debut against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-mcg-test-sam-konstas-hits-jasprit-bumrah-first-test-six-3-years-2655405-2024-12-26",
      "headline": "Brave Sam Konstas reverse scoops as Jasprit Bumrah concedes first Test six in 3 yearsSam Konstas hit two boundaries and a six with reverse ramp shots against India pace spearhead Jasprit Bumrah. Bumrah was hit for a six in Test cricket after 4483 deliveries and three years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-virat-kohli-reaction-poor-run-boxing-day-test-2655403-2024-12-26",
      "headline": "Haven't been disciplined enough: Virat Kohli makes bold admissionStar Indian batter Virat Kohli has admitted his lack of discipline with the bat on the livelier pitches during the ongoing Border-Gavaskar Trophy. Kohli has managed to score 126 runs at an average of 31.50."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}