{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-friday-2025-stock-market-holiday-sensex-nifty-closed-no-trading-today-april-18-nse-bse-2710808-2025-04-18",
      "headline": "Good Friday 2025: Are Sensex and Nifty closed for trading today?This week has been a short one for stock market participants. The markets opened only for three days, from April 15 to April 17. They were shut on Monday, April 14, in observance of Dr. Baba Saheb Ambedkar Jayanti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opting-for-new-tax-regime-check-out-these-5-benefits-2710601-2025-04-17",
      "headline": "Opting for new tax regime? Check out these 5 benefitsThe revisions introduced under the new tax regime aim to make the new regime easier, cut down on paperwork, and minimise the confusion many individuals experience in filing their returns."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaideep-ahlawat-on-comparisons-with-irrfan-its-a-very-personal-feeling-exclusive-2710977-2025-04-18",
      "headline": "Jaideep Ahlawat on comparisons with Irrfan: It's a very personal feeling | ExclusiveJaideep Ahlawat, in an exclusive interview, shares his thoughts on being compared to the late Irrfan, expressing a mix of honour and responsibility while discussing his role in the upcoming Netflix film, 'Jewel Thief.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mizuki-itagaki-japanese-actor-found-dead-at-24-after-missing-for-3-months-2710964-2025-04-18",
      "headline": "Mizuki Itagaki, Japanese actor missing for 3 months, found dead at 24Japanese actor Mizuki Itagaki, who had been missing for three months, has been found dead at the age of 24. The family shared the news in a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sister-midnight-radhika-apte-new-poster-out-fans-are-reminded-of-taxi-driver-2710915-2025-04-18",
      "headline": "Sister Midnight: Radhika Apte's new poster out, fans are reminded of Taxi DriverThe makers of the upcoming film 'Sister Midnight' unveiled an intriguing poster of actor Radhika Apte. Excited fans quickly noted the resemblance to the poster of the 1976 hit 'Taxi Driver'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-k-balachander-thug-life-2710913-2025-04-18",
      "headline": "Kamal Haasan says Mani Ratnam reminds him of K Balachander at Thug Life eventKamal Haasan, speaking at the 'Thug Life' event in Chennai, spoke about his association with director Mani Ratnam. He said that Ratnam's work style reminds him of his guru and legendary Tamil director, K Balachander."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sinners-review-michael-b-jordan-gripping-vampire-drama-2710879-2025-04-18",
      "headline": "Sinners review: Michael B Jordan's twin engine roars loud in this gripping vampire dramaReleased-Fri Apr 18, 2025Sinners movie review: Michael B Jordan delivers a captivating performance in Ryan Coogler's 'Sinners,' where he plays the Smokestack twins in a 1930s vampire drama. Coogler creates a suspenseful and dramatic narrative enriched with music and unexpected twists, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-rasha-thadani-enjoy-ipl-match-together-veer-pahariya-joins-2710894-2025-04-18",
      "headline": "Ibrahim Ali Khan, Rasha Thadani enjoy IPL match together, Veer Pahariya joinsActors Ibrahim Ali Khan and Rasha Thadani were clicked together, enjoying the IPL match in Mumbai. They were also joined by Veer Pahariya."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vincy-aloshious-withdraws-complaint-against-shine-tom-chacko-requests-anonymity-2710884-2025-04-18",
      "headline": "Malayalam actor retracts complaint against Shine Tom Chacko, requests anonymityMalayalam actor Vincy Aloshious has reportedly decided to withdraw her complaint against fellow actor Shine Tom Chacko. She had accused her co-star of using drugs on set and misbehaving with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/adolesence-court-state-vs-nobody-nani-priyadarshi-2710525-2025-04-18",
      "headline": "Liked Adolescence? Telugu film Court has important message, pertinent in IndiaIf you liked Netflix's 'Adolescence', which talked about teenage sexuality and alpha male syndrome, here's a Telugu film, Court: State vs A Nobody, that talks about the POCSO Act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahesh-babu-wife-namrata-shirodkar-enjoys-nick-jonas-broadway-show-children-priyanka-chopra-sends-love-2710864-2025-04-18",
      "headline": "Namrata Shirodkar, children enjoy Nick Jonas's show, Priyanka sends loveMahesh Babu's wife and former actor Namrata Shirodkar enjoyed watching Nick Jonas' Broadway show, The Last Five Years. Priyanka Chopra reacted to their lovable message after the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-akshay-kumar-ananya-panday-r-madhavan-celeb-review-vicky-kaushal-avneet-kaur-2710867-2025-04-18",
      "headline": "Vicky Kaushal, Huma Qureshi, celebs in awe of Akshay's Kesari 2: Absolute magicA star-studded screening for Akshay Kumar's 'Kesari Chapter 2' was hosted by the makers on Thursday. Celebs including Vicky Kaushal, Huma Qureshi, Avneet Kaur and Nandish Sandhu, among others, praised the film, calling it 'absolute magic'. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sri-shriram-natarajan-under-expert-medical-care-positing-explicit-content-on-instagram-lokesh-kanagaraj-statement-2710860-2025-04-18",
      "headline": "Tamil actor, MIA after posting explicit content, found undergoing medical careTamil actor Sri alias Shriram Natarajan, who had gone missing for the past few days, is currently under medical care, a statement issued by director Lokesh Kanagaraj read. His family and friends were looking out for him after he posted explicit videos on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-rolls-her-eyes-visibly-irked-by-paps-while-posing-with-ananya-panday-at-kesari-2-screening-2710852-2025-04-18",
      "headline": "Kajol rolls her eyes, looks visibly irked by paps at Kesari 2 screening. WatchKajol was visibly irked by the paparazzi, who were shouting while she was posing with Ananya Panday at 'Kesari 2' screening. She asked them to 'calm down'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-8-detailed-report-sunny-deol-dhai-kilo-ka-haath-wins-audience-in-1st-week-2710834-2025-04-18",
      "headline": "Jaat box office Day 8: Sunny Deol's 'dhai kilo ka haath' wins audience in 1st weekSunny Deol's 'Jaat' continues to move at a decent pace at the box office even amid a fresh controversy involving Christian community members claiming that a scene in the film hurt their religious sentiments. The film has finished its first week's run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/case-against-sunny-deol-and-jaat-team-for-hurting-religious-sentiments-2710826-2025-04-18",
      "headline": "Jaat movie scene stirs row, case against Sunny Deol, Randeep HoodaA man in Jalandhar has filed a case against Sunny Deol, Randeep Hooda and Vineet Kumar Siingh, among others from the 'Jaat' team, for hurting religious sentiments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-diverse-roles-hum-tum-omkara-2710820-2025-04-18",
      "headline": "Saif Ali Khan on playing diverse roles: Great to have done a Hum Tum, OmkaraActor Saif Ali Khan, in an exclusive conversation with India Today, shared interesting anecdotes about 'Omkara'. He expressed his happiness in getting to play diverse roles throughout his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-responds-to-trolls-predicting-divorce-with-zaheer-iqbal-2710816-2025-04-18",
      "headline": "Sonakshi Sinha makes sassy promise to troll predicting divorce with Zaheer IqbalSonakshi Sinha addressed online trolls who commented that her divorce with Zaheer Iqbal is not far. She responded with a witty remark, dismissing the baseless claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-stolen-girl-review-a-taut-emotionally-charged-thriller-that-stirs-and-surprises-holliday-grainger-denise-gough-ambika-mod-2710780-2025-04-18",
      "headline": "The Stolen Girl review: A taut, emotionally charged thriller that stirs and surprisesReleased-Wed Apr 16, 2025'The Stolen Girl' is a gripping series that delves into the emotional turmoil of a mother's worst nightmare. With compelling performances and a focus on the complexities of motherhood, this thriller keeps viewers guessing. Read our review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-rumours-quitting-films-busier-than-shah-rukh-khan-2710799-2025-04-18",
      "headline": "Anurag Kashyap rejects rumours of quitting films: I'm busier than Shah Rukh KhanFilmmaker Anurag Kashyap shut down rumours of him quitting cinema. In a post on X, he listed his line-up and stated that he's busier than Shah Rukh Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lorrie-morgan-cancels-shows-to-support-husband-battling-mouth-cancer-glbs-2710792-2025-04-18",
      "headline": "Lorrie Morgan cancels shows to support husband battling mouth cancerLorrie Morgan cancels upcoming performances to care for her husband, Randy White, who is undergoing mouth cancer treatment. Morgan, grateful for support, focuses on family and privacy during this challenging time.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-elon-musk-donald-trump-collaboration-speaks-technology-innovation-2710965-2025-04-18",
      "headline": "PM speaks to Elon Musk ahead of Tesla's India entry, discusses tech, innovationPM Modi and Elon Musk discussed a wide range of topics, building upon their earlier meeting in Washington DC earlier this year. The conversation highlighted the growing synergy between India's rapidly evolving tech ecosystem and Musk's ventures in cutting-edge innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-peace-deal-us-abandon-if-no-clear-signs-of-progress-marco-rubio-donald-trump-other-priorities-ultimatum-2710962-2025-04-18",
      "headline": "US ultimatum on Russia-Ukraine peace deal: Will move on if no progress madeUS Secretary of State Marco Rubio warned that peace efforts between Russia and Ukraine may be halted soon if no progress is seen.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-recent-remark-west-bengal-waqf-violence-protests-slams-focus-protecting-rights-minorities-2710882-2025-04-18",
      "headline": "Focus on own minorities: India slams Bangladesh over Bengal riots remarkIndia's strong remarks come a day after Bangladesh called on Indian authorities to protect minority Muslim communities affected by the violence in Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/kevin-patel-indian-american-man-shot-in-chest-chicago-dies-investigation-underway-2710976-2025-04-18",
      "headline": "Indian-American man shot dead in Chicago parkKevin Patel, a 28-year-old Indian-American man, was shot in the chest in Chicago's Lincoln Park and later died in the hospital. The Chicago Police have not identified any person or taken suspects into custody yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/vice-president-jagdeep-dhankar-ignites-row-over-judicial-activism-versus-overreach-after-supreme-court-tamil-nadu-governor-judgment-2709337-2025-04-18",
      "headline": "SC's judicial overreach? Vice President joins experts with fierce criticismVice President Jagdeep Dhankhar fiercely criticised the Supreme Court's judgment that set deadlines for the President to clear Bills passed by state Assemblies and its use of extraordinary powers under Article 142. Dhankhar joined a growing voice of critics who see the SC's landmark Tamil Nadu case judgment as a case of judicial overreach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/swanky-condos-girlfriend-experience-cambridge-massachusetts-behind-the-elite-brothel-scandal-in-us-sex-service-2709865-2025-04-18",
      "headline": "Inside Cambridge's elite brothel scandal that got Indian-origin CEO trappedBehind luxury condos and Harvard's shadow was an elite brothel for the ultrarich, complete with background checks for a USD 600-an-hour 'girlfriend experience'. An Indian-origin CEO is among its long list of patrons that includes doctors, lawyers and entrepreneurs of the Massachusetts-based sex-service network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-chief-secretary-prabodh-saxena-holi-party-bill-controversy-2710926-2025-04-18",
      "headline": "Himachal top bureaucrat's Holi bash cost Rs 1.22 lakh, he asks government to payHimachal Pradesh chief secretary's Holi party has sparked outrage among retired IAS officers, who are questioning the use of taxpayer money for a 'personal event'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/soviet-ussr-factory-worker-valentina-tereshkova-first-woman-in-space-60-years-before-katy-perry-blue-origins-new-shepard-2710856-2025-04-18",
      "headline": "Secret hobby helped in first woman astronaut's safe return after 3 days in spaceSixty years before pop star Katy Perry's 10-minute spaceflight, a factory worker from the Soviet Union created history, becoming the first woman in space. In 1963, Valentina Tereshkova, who worked in textile and tyre factories, went into space on a solo mission that lasted three days. Tereshkova's secret hobby helped her land back safely after orbiting the earth 48 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anaya-bangar-alleged-sexual-harassment-nude-pictures-gender-transformation-2710874-2025-04-18",
      "headline": "Cricketers sent me nudes: Anaya Bangar's bombshell claim post gender changeAnaya Bangar spoke out about alleged harassment from fellow cricketers after her gender transition. She shared how difficult her journey has been, and called for more understanding and respect for transgender people in cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/guntur-student-vangavolu-deepti-dies-in-texas-road-accident-a-month-before-graduation-usd-80000-raised-for-treatment-2710966-2025-04-18",
      "headline": "Andhra student in Texas succumbs to accident injuries month before graduationAn Andhra Pradesh native and a master's student in Texas succumbed to injuries she got after being hit by a speeding car while walking with a friend. She was set to graduate in a month. Crowdfunding supported her treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-shubhanshu-shukla-axiom-4-launch-experiments-space-station-tardigrades-2710906-2025-04-18",
      "headline": "Isro is sending water bears to space with astronaut Shubhanshu ShuklaThe Indian astronaut will launch to the Space Station with Axiom Space on a 14-day-long mission to live and work in zero gravity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sri-shriram-natarajan-under-expert-medical-care-positing-explicit-content-on-instagram-lokesh-kanagaraj-statement-2710860-2025-04-18",
      "headline": "Tamil actor, MIA after posting explicit content, found undergoing medical careTamil actor Sri alias Shriram Natarajan, who had gone missing for the past few days, is currently under medical care, a statement issued by director Lokesh Kanagaraj read. His family and friends were looking out for him after he posted explicit videos on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-general-asim-munir-hardline-speech-general-yahya-khan-two-nation-theory-2710803-2025-04-18",
      "headline": "Pakistan Army chief's Baloch rhetoric echoes Yahya Khan's Bangladesh playbookPakistan Army Chief General Asim Munir's hardline speech invoking the two-nation theory and threatening Baloch insurgents has sparked alarm over the country's return to a rigid, militarised stance eerily reminiscent of the pre-1971 East Pakistan crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-1971-war-atrocities-apology-pakistan-first-talks-in-15-years-2710859-2025-04-18",
      "headline": "Bangladesh seeks Pak's apology for 1971 atrocities during 1st talks in 15 yearsBangladesh has also sought $4.52 billion from Pakistan as part of its share of pre-1971 assets. The demands were made during the first Foreign Office Consultations (FOC) meeting in 15 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaideep-ahlawat-on-comparisons-with-irrfan-its-a-very-personal-feeling-exclusive-2710977-2025-04-18",
      "headline": "Jaideep Ahlawat on comparisons with Irrfan: It's a very personal feeling | ExclusiveJaideep Ahlawat, in an exclusive interview, shares his thoughts on being compared to the late Irrfan, expressing a mix of honour and responsibility while discussing his role in the upcoming Netflix film, 'Jewel Thief.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/jagan-mohan-reddy-former-andhra-pradesh-chief-minister-quid-pro-quo-money-laundering-enforcement-directorate-land-shares-attach-2710889-2025-04-18",
      "headline": "ED attaches Jagan Reddy's Rs 27.5 crore shares in 14-year-old laundering caseThe ED has attached over Rs 400 crore in assets linked to YS Jagan Mohan Reddy and Dalmia Cements in a 14-year-old money laundering case. The case involved alleged quid pro quo investments and illegal mining lease transfers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gangster-happy-passia-punjab-grenade-attack-detained-in-us-exclusive-2710722-2025-04-17",
      "headline": "Not a 'Happy' ending: Gangster behind 14 attacks in Punjab arrested in USHappy Passia was carrying a Rs 5 lakh reward announced by the National Investigation Agency (NIA) and had become a major headache for both Punjab Police and central intelligence units. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-shivamogga-janeu-janivara-row-students-brahmins-forced-remove-sacred-thread-before-pu-cet-exam-2710910-2025-04-18",
      "headline": "Students made to remove sacred thread at Karnataka CET exam centre, sparks rowTwo PU students were allegedly asked to remove their sacred thread before entering a Common Entrance Test exam centre in Shivamogga. The incident triggered protests from the Brahmin community, who demanded action against the security guard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/new-study-flips-the-script-marriage-may-raise-dementia-risk-2710850-2025-04-18",
      "headline": "New study flips the script: Marriage may raise dementia riskClaims that marriage has a positive effect on your mental health are up for challenge as the new study by researchers at Florida State University suggests that people who are unmarried, whether never married or divorced, may actually have a lower risk of developing dementia than their married counterparts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-seelampur-teen-17-year-old-stabbed-to-death-by-muslim-men-residents-put-up-hindu-exodus-posters-help-yogi-adityanath-rekha-gupta-2710843-2025-04-18",
      "headline": "Teen stabbed to death in Delhi, protesting locals seek 'Yogi model' justiceA case of murder has been registered, and CCTV footage is being examined to identify the accused. Police say the suspects were known to the victim and from another community. They are also trying to confirm whether the attackers are minors or adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/case-against-sunny-deol-and-jaat-team-for-hurting-religious-sentiments-2710826-2025-04-18",
      "headline": "Jaat movie scene stirs row, case against Sunny Deol, Randeep HoodaA man in Jalandhar has filed a case against Sunny Deol, Randeep Hooda and Vineet Kumar Siingh, among others from the 'Jaat' team, for hurting religious sentiments. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-chief-minister-sukhvinder-sukhu-defiant-amid-national-herald-ads-row-bjp-takes-arrogance-dig-2710907-2025-04-18",
      "headline": "Sukhvinder Sukhu defiant amid National Herald ads row, BJP takes arrogance digSukhvinder Sukhu's statement came on the heels of the Enforcement Directorate (ED) filing a chargesheet against Congress leaders Sonia Gandhi and Rahul Gandhi in connection with the alleged National Herald money laundering case."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-2025-match-preview-predicted-11s-team-news-pitch-report-2710981-2025-04-18",
      "headline": "After historic defence vs KKR, can Punjab gun down RCB in Chinnaswamy?Punjab Kings have travelled to Bengaluru to play their 7th game of the season. Both sides have 8 points from 6 games and would be attempting to pull clear towards the top of the table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-mumbai-indians-batter-will-jacks-press-conference-2710972-2025-04-18",
      "headline": "Coach Mahela wants me to go and express myself: Will Jacks happy after SRH winMumbai Indians' all-rounder Will Jacks credited coach Mahela Jayawardene after starring in an all-round performance as the hosts defeated Sunrisers Hyderabad by four wickets in their IPL 2025 clash on Thursday.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-brendon-mccullum-158-carnival-new-era-indian-premier-league-2710893-2025-04-18",
      "headline": "IPL turns 18: When Brendon McCullum's record 158 kickstarted cricket's new eraThe Indian Premier League started in 2008 with KKR opener Brendon McCullum lighting up the M. Chinnaswamy Stadium with an unforgettable 158* off just 73 deliveries, smashing ten fours and thirteen sixes against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-captaincy-calm-bhuvneshwar-kumar-2710909-2025-04-18",
      "headline": "Calm Rajat Patidar has been superb with RCB captaincy: Bhuvneshwar KumarIPL 2025: Bhuvneshwar Kumar heaped praise on Rajat Patidar's RCB captaincy and said that the MP batter remains calm irrespective of the results. Patidar has been sensational as RCB skipper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-middle-order-failures-travis-head-abhishek-sharma-dependent-michael-clarke-2710895-2025-04-18",
      "headline": "SRH cannot just depend on Travishek, middle order needs to step up: ClarkeIPL 2025: Michael Clarke criticised SRH's middle order for failing to support their openers once again, after the side collapsed to a loss against MI—further denting their already shaky IPL 2025 campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anaya-bangar-alleged-sexual-harassment-nude-pictures-gender-transformation-2710874-2025-04-18",
      "headline": "Cricketers sent me nudes: Anaya Bangar's bombshell claim post gender changeAnaya Bangar spoke out about alleged harassment from fellow cricketers after her gender transition. She shared how difficult her journey has been, and called for more understanding and respect for transgender people in cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-sunrisers-hyderabad-coach-daniel-vettori-press-conference-2710849-2025-04-18",
      "headline": "MI read conditions exceptionally well, Wankhede pitch was difficult: SRH coachSRH coach Daniel Vettori credited Mumbai's bowlers for their match-winning performance, particularly in the middle overs. He noted that the surface was challenging and praised Mumbai for reading the conditions well, especially their use of slower balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-great-vandana-katariya-thanks-pm-modi-for-heartfelt-letter-on-her-retirement-2710858-2025-04-18",
      "headline": "Hockey great Vandana Katariya thanks PM Modi for heartfelt letter on her retirementIndia's hockey legend Vandana Katariya thanked Prime Minister Narendra Modi on Thursday for an emotional letter congratulating her on her remarkable career serving Team India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-no-ball-controversy-varun-chakravarthy-reaction-2710837-2025-04-18",
      "headline": "Should be dead ball: Varun Chakravarthy chimes in to MI vs SRH no-ball rowVarun Chakravarthy questioned the no-ball rule for wicketkeepers, saying it's unfair to punish bowlers for something they didn't do—sparking fresh debate after the controversial call in the MI vs SRH match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andre-russell-kkr-form-future-2710831-2025-04-18",
      "headline": "IPL 2025: Is this the beginning of Andre Russell's glorious run for KKR?IPL 2025, PBKS vs KKR: West Indies all-rounder Andre Russell has not only struggled for KKR this year, but his performances in the ILT20 and Bangladesh Premier League were also underwhelming to say the least."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-pbks-brad-haddin-press-conference-2710818-2025-04-18",
      "headline": "Brad Haddin says Punjab Kings now believe they can win in any situationPunjab Kings (PBKS) assistant coach Brad Haddin said the players now believe they can win in any situation. \"I think it reinsures everything that we're doing; the playing group starts to trust. And wins like that, as you've seen the other night, the way we got ourselves back into the game was special. The players have started to believe that they can win from any situation,\" Haddin told the reporters ahead of the Royal Challengers Bengaluru (RCB) clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-pbks-sunrisers-hyderabad-coach-daniel-vettori-press-conference-2710849-2025-04-18",
      "headline": "MI read conditions exceptionally well, Wankhede pitch was difficult: SRH coachSRH coach Daniel Vettori credited Mumbai's bowlers for their match-winning performance, particularly in the middle overs. He noted that the surface was challenging and praised Mumbai for reading the conditions well, especially their use of slower balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-great-vandana-katariya-thanks-pm-modi-for-heartfelt-letter-on-her-retirement-2710858-2025-04-18",
      "headline": "Hockey great Vandana Katariya thanks PM Modi for heartfelt letter on her retirementIndia's hockey legend Vandana Katariya thanked Prime Minister Narendra Modi on Thursday for an emotional letter congratulating her on her remarkable career serving Team India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-no-ball-controversy-varun-chakravarthy-reaction-2710837-2025-04-18",
      "headline": "Should be dead ball: Varun Chakravarthy chimes in to MI vs SRH no-ball rowVarun Chakravarthy questioned the no-ball rule for wicketkeepers, saying it's unfair to punish bowlers for something they didn't do—sparking fresh debate after the controversial call in the MI vs SRH match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andre-russell-kkr-form-future-2710831-2025-04-18",
      "headline": "IPL 2025: Is this the beginning of Andre Russell's glorious run for KKR?IPL 2025, PBKS vs KKR: West Indies all-rounder Andre Russell has not only struggled for KKR this year, but his performances in the ILT20 and Bangladesh Premier League were also underwhelming to say the least."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-pbks-brad-haddin-press-conference-2710818-2025-04-18",
      "headline": "Brad Haddin says Punjab Kings now believe they can win in any situationPunjab Kings (PBKS) assistant coach Brad Haddin said the players now believe they can win in any situation. \"I think it reinsures everything that we're doing; the playing group starts to trust. And wins like that, as you've seen the other night, the way we got ourselves back into the game was special. The players have started to believe that they can win from any situation,\" Haddin told the reporters ahead of the Royal Challengers Bengaluru (RCB) clash."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}