{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-court-restrains-journalists-publishing-unverified-defamatory-content-adani-enterprise-limited-2783317-2025-09-07",
      "headline": "Court restrains media from publishing defamatory content against Adani EnterpriseAEL alleged that coordinated defamatory publications on paranjoy.in, adaniwatch.org and adanifiles.com.au, along with related videos and posts, were deliberately designed to tarnish its reputation and disrupt its global business operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-files-for-rs-3820-crore-ipo-amid-edtech-sector-slowdown-alakh-pandey-2783282-2025-09-07",
      "headline": "PhysicsWallah files for Rs 3,820 crore IPO amid edtech sector slowdownEdtech unicorn PhysicsWallah has filed for a ₹38.2 billion ($437M) IPO, aiming to expand physical centers, tech, and acquisitions. The move comes as India's IPO market gains momentum after a slow start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-advance-booking-india-gets-5-am-shows-first-for-any-japanese-film-2783378-2025-09-07",
      "headline": "Demon Slayer Infinity Castle set for historic 5 am shows in IndiaThe highly-anticipated anime film 'Demon Slayer: Infinity Castle' is set to release globally on September 12, including early morning screenings in Mumbai, marking a first for Japanese cinema in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-krishnan-cheers-loudest-for-thalapathy-vijay-wishes-him-well-for-his-next-chapter-siima-2025-2783375-2025-09-07",
      "headline": "Trisha cheers for Thalapathy Vijay, wishes him success in his next chapterAt the 2025 SIIMA awards in Dubai, Trisha Krishnan was honoured for her 25-year journey in South Indian cinema and warmly wished co-star Vijay success in his new ventures. She also praised Ajith Kumar's humility and kindness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoors-emotional-birthday-note-for-wife-mira-rajput-my-love-you-complete-me-2783338-2025-09-07",
      "headline": "My love, you complete me: Shahid Kapoor's emotional birthday note for wife Mira RajputMira Rajput Kapoor turned 31 on Sunday, September 7. On the occasion, her actor-husband Shahid Kapoor had the sweetest birthday note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/not-just-acting-aamir-khan-serenades-fans-with-his-singing-skills-2783325-2025-09-07",
      "headline": "Not just acting, Aamir Khan serenades fans with his singing skills. WatchAamir Khan has caught everyone's attention with his singing skills in a viral video, showcasing a new side of the star. A video from a recent event has now gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-in-tears-as-kunickaas-son-ayaan-narrates-her-life-story-2783314-2025-09-07",
      "headline": "Bigg Boss 19: Salman Khan in tears as Kunickaa's son Ayaan narrates her life storyThe latest 'Weekend Ka Vaar' episode of 'Bigg Boss 19' touched hearts as Kunickaa Sadanand's son, Ayaan Lal, stood up for his mother against hurtful remarks, revealing her struggles and resilience. Salman Khan and the audience were visibly moved by this emotional moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-awards-winners-amaran-aadujeevitham-prithviraj-sukumaran-sai-pallavi-2783288-2025-09-07",
      "headline": "SIIMA 2025 Tamil, Malayalam: Prithviraj Sukumaran, Sai Pallavi win top honoursSIIMA 2025 honours Tamil and Malayalam cinema: Sivakarthikeyan's 'Amaran' and Prithviraj Sukumaran's 'The Goat Life' take top honours. Sai Pallavi won Best Actor (Female) and Sukumaran bagged Best Actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anuparna-roy-makes-history-wins-best-director-at-82nd-venice-film-festival-2783284-2025-09-07",
      "headline": "India's Anuparna Roy makes history, wins Best Director at 82nd Venice Film FestivalThe 82nd Venice Film Festival concluded with Indian filmmaker Anuparna Roy making history, winning Best Director for her debut 'Songs of Forgotten Trees', while American indie 'Father Mother Sister Brother' took home the Golden Lion for Best Film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-leads-beach-clean-up-drive-in-mumbai-amruta-fadnavis-champions-public-responsibility-2783265-2025-09-07",
      "headline": "Akshay Kumar leads beach clean-up drive in Mumbai, champions public responsibilityAkshay Kumar actively participated in a beach clean-up drive at Mumbai's Juhu Beach, joining hands with Amruta Fadnavis and BMC officials to promote environmental responsibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-vs-bengal-files-box-office-day-2-tiger-shroffs-action-hits-high-gear-2783262-2025-09-07",
      "headline": "Baaghi 4 vs Bengal Files box office Day 2: Tiger Shroff's action hits high gearThe box office clash between 'Baaghi 4' and 'The Bengal Files' reflects audiences' stronger pull towards action, as the Tiger Shroff-starrer leads while the political drama gains attention for its historical narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-stuns-london-crowd-with-surprise-saiyaara-rendition-2783242-2025-09-07",
      "headline": "Arijit Singh stuns London crowd with surprise Saiyaara renditionArijit Singh mesmerised fans at London's Tottenham Hotspur Stadium with a soulful and retro-infused performance of 'Saiyaara'. The unexpected choice of this hit track had the entire stadium singing along. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-slays-in-silver-at-birmingham-event-fans-flock-in-a-flurry-2783228-2025-09-07",
      "headline": "Kareena Kapoor slays in silver at Birmingham event, fans flock in a flurryBollywood icon Kareena Kapoor Khan created a buzz in Birmingham as she dazzled fans at a store launch, charming the crowd with her elegance and warmth. Several videos and pictures from the event went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-announces-break-from-tour-says-been-unwell-for-an-year-2783217-2025-09-07",
      "headline": "Comedian Zakir Khan announces break, says been unwell for a yearStand-up comedian Zakir Khan has decided to take a break from his touring schedule to prioritise his health after a decade of rigorous performances across India. He will continue with a limited 'Papa Yaar India' tour starting October 2025, followed by a much-needed long break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-turns-76-ameesha-simi-garewal-extend-wishes-throwback-pics-2783021-2025-09-06",
      "headline": "Rakesh Roshan turns 76: Ameesha, Simi Garewal extend wishes with throwback picsActor Ameesha Patel wished her mentor Rakesh Roshan on his 76th birthday. She called him a 'beacon of hope' by sharing a throwback photo. His actor-friend Simi Garewal also wrote a sweet birthday note for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-cheers-for-kalyani-priyadarshan-lokah-chandra-gave-me-goosebumps-2783018-2025-09-06",
      "headline": "Chandra gave me goosebumps: Samantha cheers for Kalyani Priyadarshan's Lokah'Lokah: Chapter 1', featuring Kalyani Priyadarshan as India's first female superhero, has garnered widespread acclaim for its captivating blend of mythology and fantasy. Recently, Samantha joined the list of celebs who hailed the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-scolds-amaal-malik-asks-if-he-only-came-to-sleep-2783002-2025-09-06",
      "headline": "Bigg Boss 19: Salman Khan scolds Amaal Malik, asks if he only came to sleepBigg Boss 19 host Salman Khan scolded singer Amaal Malik for not living up to the audience's expectations as a contestant on the reality show. Salman asked Amaal whether he wanted to make a difference or not."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amol-parashar-responds-to-relationship-buzz-with-konkona-sensharma-people-made-it-official-2782999-2025-09-06",
      "headline": "Amol Parashar responds to relationship buzz with Konkona: People made it officialAmol Parashar addressed rumours about his relationship with Konkona Sensharma, clarifying their public appearance was just a casual event with friends and family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-full-winners-list-allu-arjun-rashmika-mandanna-win-big-2782980-2025-09-06",
      "headline": "SIIMA 2025 full winners list: Allu Arjun, Rashmika Mandanna win bigThe South Indian International Movie Awards 2025 celebrated outstanding achievements in South Indian cinema, with 'Kalki 2898 AD' winning Best Film and multiple honours for 'Pushpa 2: The Rule'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-vikram-bhatts-mother-dies-at-85-after-prolonged-illness-report-2782978-2025-09-06",
      "headline": "Director Vikram Bhatt's mother dies at 85 after prolonged illness. ReportDirector-producer Vikram Bhatt's mother Varsha Bhatt died at 85 after a prolonged illness, according to reports. The family is yet to release an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tanya-mittal-family-reacts-criticism-requests-kindness-humanity-2782961-2025-09-06",
      "headline": "Bigg Boss 19: Tanya Mittal's family reacts to criticism, requests people to be kind'Bigg Boss 19' contestant Tanya Mittal is currently at the centre of social media debates. Her parents have now appealed for fairness and asked viewers to reserve judgment until the show ends."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-beats-jannik-sinner-world-no-1-crown-2783466-2025-09-08",
      "headline": "Brutally beautiful Alcaraz wins US Open to dethrone Sinner as No. 1US Open 2025: In one of his most clinical Grand Slam performances, Carlos Alcaraz decimated Jannik Sinner in four sets to claim his second title in New York. Showcasing impeccable serving throughout the fortnight, including in the final, Alcaraz outclassed the Italian and reclaimed the World No. 1 ranking after nearly two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-korea-asia-cup-2025-final-result-match-report-hockey-title-2783410-2025-09-07",
      "headline": "India lift Asia Cup after 8 years, beat Korea 4-1 to book World Cup spotIndia ended their eight-year wait for the Asia Cup title with a convincing 4-1 win over Korea in the final on Sunday, September 7. India also sealed their spot in the World Cup 2026 with the win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-treasury-secretary-scott-bessent-sanctions-oil-buyers-russia-for-ukraine-peace-talks-2783413-2025-09-07",
      "headline": "Tariffs on oil-buyers will lead to Russian economy collapse: US treasury chiefUS Treasury Secretary Scott Bessent accused India and China of supporting Russia's war in Ukraine, and called for more sanctions and secondary tariffs on countries doing trade with Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-murder-mystery-man-killed-by-3rd-wife-body-found-by-her-sister-his-2nd-wife-2783417-2025-09-07",
      "headline": "Man killed by third wife, body found by woman's sister, who was victim's ex-wifeThe deceased, identified as Bhayalal Rajak, had been married three times. At the heart of the crime lies a web of deceit and conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/total-lunar-eclipse-blood-moon-live-watch-the-moon-turn-blood-red-india-pictures-2783110-2025-09-07",
      "headline": "Watch Blood Moon LIVE: Total lunar eclipse turns the Moon blood-redThis rare astronomical event, often called a \"Blood Moon,\" is visible from all parts of India, delighting stargazers and families across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/prized-h1b-visa-us-donald-trump-ashes-indians-relations-india-immigrant-america-work-visas-rejected-2783066-2025-09-07",
      "headline": "Lucky with H-1B, unlucky with TrumpOnce the ultimate ticket to the American Dream, the H-1B visa stands vilified now. As the Trump administration cracks down, Indians with H-1B and jobs are scared to go to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-arrives-at-mens-us-open-final-in-new-york-glbs-2783446-2025-09-07",
      "headline": "Trump greeted with boos and some cheers at US Open final in New YorkDonald Trump's arrival at the US Open sparked boos, cheers, and tighter security. His return after years highlighted both his tennis ties and political divide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-final-carlos-alcaraz-vs-jannik-sinner-live-score-updates-new-york-2783415-2025-09-07",
      "headline": "Final Highlights: Alcaraz decimates Sinner to win 2nd US Open crownUS Open 2025 final Highlights: Carlos Alcaraz is the new US Open champion. The Spaniard decimates Jannik Sinner in 2 hours and 42 minutes in the big final. A near-perfect display from the Spaniard as he dethrones Sinner as the new No. 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-r-madhavan-action-movie-teaser-chase-thala-2783330-2025-09-07",
      "headline": "MS Dhoni in an action flick? Thala goes guns blazing with R Madhavan in new teaserMS Dhoni has stunned fans with a high-octane action teaser alongside R Madhavan in Vasan Bala's The Chase. The cricket legend turned task-force officer has left the internet buzzing over his unexpected on-screen avatar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jailed-ex-mp-prajwal-revanna-to-work-as-library-clerk-for-rs-522-per-day-pay-2783333-2025-09-07",
      "headline": "Ex-MP Prajwal Revanna to work as library clerk inside jail for Rs 522 daily wageFormer JD(S) MP Prajwal Revanna's main responsibilities include issuing books to other inmates and maintaining records of borrowed books, according to jail authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-woman-raped-by-two-acquaintances-on-her-birthday-in-regent-park-flat-accused-on-the-run-2783266-2025-09-07",
      "headline": "20-year-old gang-raped by acquaintances during birthday celebration in KolkataA 20-year-old woman from Haridevpur has accused two acquaintances of gang-raping her during her birthday celebration in Kolkata's Regent's Park area. The suspects are at large, while police have registered a case and launched an investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kejriwal-urges-modi-impose-75-percent-tariff-us-imports-protect-indian-farmers-2783363-2025-09-07",
      "headline": "Show courage, slap 75% tariffs on US goods: Arvind Kejriwal's dare to PMArvind Kejriwal also criticised the Narendra Modi government's decision to exempt an 11 per cent duty on US cotton imports until December 31, 2025, warning that such a move would disadvantage local farmers while enriching American agriculturists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/carlo-acutis-15-year-old-coder-spread-his-faith-made-first-millennial-catholic-saint-2783346-2025-09-07",
      "headline": "Teen coder, known as God's influencer, becomes first millennial Catholic saintCarlo Acutis was a British-born Italian boy and was born in 1991. He died of Leukaemia (blood cancer) in October 2006 at the age of 15. He used computer coding to spread the Catholic faith around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/urban-indias-silent-cafes-your-quiet-sanctuary-in-a-noisy-chaotic-world-2783094-2025-09-06",
      "headline": "Urban India's silent cafés: Your quiet sanctuary in a noisy, chaotic worldAcross Indian metros such as Bengaluru, Chennai and Pune, silent cafés are creating oases where silence is not awkward but empowering\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-sits-last-row-bjp-mp-workshop-vice-president-poll-2783315-2025-09-07",
      "headline": "In rare gesture, PM Modi sits in last row at BJP MPs' workshop for Veep pollPrime Minister Narendra Modi attended the BJP MPs' workshop at the GMC Balayogi Auditorium, choosing to sit in the last row among parliamentarians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-lobbyist-jason-miller-meets-president-in-action-trump-amid-tariff-row-2783377-2025-09-07",
      "headline": "India lobbyist Jason Miller meets 'President in-action' Trump amid tariff rowMiller, who leads SHW Partners LLC, was engaged by the Indian mission in Washington earlier this year under a reported one-year agreement worth USD 1.8 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/blood-moon-total-lunar-eclipse-over-india-live-from-hanle-kodaikanal-vainu-bappu-observatories-2783405-2025-09-07",
      "headline": "Blood Moon over India: Lunar eclipse seen from India's top observatoriesThe Indian Institute of Astrophysics (IIA) is bringing this event directly to viewers across the nation through live streams from some of the country's top observatories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-520-05-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-breaks-fastest-race-record-michael-schumacher-italian-grand-prix-monza-2025-2783400-2025-09-07",
      "headline": "Max Verstappen wins Italian GP, breaks Michael Schumacher's fastest race time recordMax Verstappen claimed a record-breaking win at the Italian Grand Prix, shattering Michael Schumacher's fastest race time. The Red Bull driver dominated at Monza, while Lando Norris salvaged second for McLaren after late pit stop drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-season-of-nativist-angst-against-north-indians-an-app-soon-to-learn-marathi-2783095-2025-09-06",
      "headline": "In season of nativist angst against north Indians, an app soon to learn Marathi\"Assaulting those who cannot speak Marathi is no option. It is essential to teach them the language,\" says Uday Samant, Maharashtra minister for Marathi language\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-call-you-back-himanta-sarma-grants-boys-wish-to-visit-chief-ministers-house-2783383-2025-09-07",
      "headline": "Will call you back: Himanta Sarma grants boy's wish to visit chief minister's houseThe Assam chief minister's gesture is winning hearts as social media users have heaped a lot of praise on him for his approachable demeanour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-mukesh-rajput-sister-reena-rajput-filmed-taking-bath-thrashed-by-in-laws-protesting-2783441-2025-09-08",
      "headline": "BJP MP's sister filmed while taking bath, thrashed by in-laws after protestingThe incident occurred in Rani Avantibai Nagar. In the viral video, the woman's father-in-law is seen repeatedly striking her with sticks in full public view."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-scientists-say-cancer-vaccine-enteromix-mrna-technology-ready-for-use-2783326-2025-09-07",
      "headline": "Russian scientists say cancer vaccine ready for use after successful trialsThe cancer vaccine, called Enteromix, is based on mRNA technology — the same approach used in some Covid-19 vaccines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yemen-launches-drone-strike-on-israel-two-intercepted-before-entry-sirens-sounded-2783362-2025-09-07",
      "headline": "Houthi drone strike damages Israeli airport, forces temporary airspace shutdownThe IDF claimed to have intercepted three Unmanned Aerial Vehicles (UAVs), saying two of them were shot down before they could cross into Israeli territory."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-stats-records-us-open-2025-sixth-grand-slam-world-no-1-2783470-2025-09-08",
      "headline": "Carlos Alcaraz equals Rafael Nadal's feat with US Open crown: In StatsUS Open 2025: Carlos Alcaraz achieved some stunning records and numbers after winning his second title at Flushing Meadows, beating Jannik Sinner in four sets in the grand finale on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-us-open-final-tied-celebrity-attendance-2783463-2025-09-08",
      "headline": "US Open final draws President Trump, Pep Guardiola and a sea of starsThe US Open final was a star-studded affair. As Carlos Alcaraz faced Jannik Sinner in the New York showdown, a sea of celebrities filled Arthur Ashe Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-reclaims-world-no-1-ranking-us-open-2025-2783467-2025-09-08",
      "headline": "Carlos Alcaraz ends Jannik Sinner's 65-week reign as World No.1Carlos Alcaraz has reclaimed the world no 1 tennis ranking after winning the US Open 2025. His victory ends Jannik Sinner's 65-week reign at the top and marks a significant comeback for the young Spaniard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-beats-jannik-sinner-world-no-1-crown-2783466-2025-09-08",
      "headline": "Brutally beautiful Alcaraz wins US Open to dethrone Sinner as No. 1US Open 2025: In one of his most clinical Grand Slam performances, Carlos Alcaraz decimated Jannik Sinner in four sets to claim his second title in New York. Showcasing impeccable serving throughout the fortnight, including in the final, Alcaraz outclassed the Italian and reclaimed the World No. 1 ranking after nearly two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-pm-modi-congratulates-india-rajgir-hossts-2783461-2025-09-08",
      "headline": "PM Modi hails Asia Cup win, lauds vibrant Rajgir for hosting brilliant tournamentAsia Cup 2025: Prime Minister Narendra Modi congratulated the Indian men's hockey team on their remarkable victory over Korea on Sunday. He also praised Rajgir for successfully hosting the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-nawaz-hat-trick-pakistan-spinner-t20i-sharjah-final-triseries-win-2783454-2025-09-08",
      "headline": "Nawaz's historic hat-trick stuns Afghanistan as Pakistan clinch tri-seriesMohammad Nawaz became the first Pakistani spinner to claim a hat-trick in men's T20Is during the UAE tri-series final. His spell led Pakistan to a commanding 75-run victory over Afghanistan, boosting their Asia Cup prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-south-africa-odi-highest-margin-win-jacob-bethell-joe-root-2783426-2025-09-07",
      "headline": "Bethell, Root and Archer star in England's record 342-run win vs South AfricaENG vs SA: England produced a record-breaking performance in Southampton, thrashing South Africa by 342 runs — the biggest win in men's ODI history — as Jacob Bethell's maiden century, Joe Root's class and Jofra Archer's fiery spell stole the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-frustrated-asia-cup-2025-omission-india-a-captaincy-icc-champions-trophy-2783420-2025-09-07",
      "headline": "Shreyas Iyer opens up on Asia Cup 2025 snub: Frustrating when you know you deserve itShreyas Iyer admitted feeling frustrated after being left out of India's Asia Cup 2025 squad. He remains determined to prove his worth through strong performances and leadership of India A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-final-carlos-alcaraz-vs-jannik-sinner-live-score-updates-new-york-2783415-2025-09-07",
      "headline": "Final Highlights: Alcaraz decimates Sinner to win 2nd US Open crownUS Open 2025 final Highlights: Carlos Alcaraz is the new US Open champion. The Spaniard decimates Jannik Sinner in 2 hours and 42 minutes in the big final. A near-perfect display from the Spaniard as he dethrones Sinner as the new No. 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-korea-asia-cup-2025-final-result-match-report-hockey-title-2783410-2025-09-07",
      "headline": "India lift Asia Cup after 8 years, beat Korea 4-1 to book World Cup spotIndia ended their eight-year wait for the Asia Cup title with a convincing 4-1 win over Korea in the final on Sunday, September 7. India also sealed their spot in the World Cup 2026 with the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-south-africa-odi-highest-margin-win-jacob-bethell-joe-root-2783426-2025-09-07",
      "headline": "Bethell, Root and Archer star in England's record 342-run win vs South AfricaENG vs SA: England produced a record-breaking performance in Southampton, thrashing South Africa by 342 runs — the biggest win in men's ODI history — as Jacob Bethell's maiden century, Joe Root's class and Jofra Archer's fiery spell stole the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-frustrated-asia-cup-2025-omission-india-a-captaincy-icc-champions-trophy-2783420-2025-09-07",
      "headline": "Shreyas Iyer opens up on Asia Cup 2025 snub: Frustrating when you know you deserve itShreyas Iyer admitted feeling frustrated after being left out of India's Asia Cup 2025 squad. He remains determined to prove his worth through strong performances and leadership of India A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-final-carlos-alcaraz-vs-jannik-sinner-live-score-updates-new-york-2783415-2025-09-07",
      "headline": "Final Highlights: Alcaraz decimates Sinner to win 2nd US Open crownUS Open 2025 final Highlights: Carlos Alcaraz is the new US Open champion. The Spaniard decimates Jannik Sinner in 2 hours and 42 minutes in the big final. A near-perfect display from the Spaniard as he dethrones Sinner as the new No. 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-korea-asia-cup-2025-final-result-match-report-hockey-title-2783410-2025-09-07",
      "headline": "India lift Asia Cup after 8 years, beat Korea 4-1 to book World Cup spotIndia ended their eight-year wait for the Asia Cup title with a convincing 4-1 win over Korea in the final on Sunday, September 7. India also sealed their spot in the World Cup 2026 with the win. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}