{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-4-trading-tips-hdfc-bank-wipro-ola-electric-nestle-yes-bank-2735387-2025-06-04",
      "headline": "Stocks to watch on June 4: HDFC Bank, Wipro, Ola Electric, Nestle, Yes BankExplore the latest stock market movements with major stakes sold in Yes Bank, HDFC Bank's IPO plans, and strategic advancements by companies like Wipro and Ola Electric."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cartier-confirms-client-data-stolen-in-cyberattack-glbs-2735327-2025-06-04",
      "headline": "Cartier confirms client data stolen in cyberattackCartier confirmed a cyberattack in which client data was stolen, joining a growing list of major brands hit by breaches, including Victoria's Secret, Marks & Spencer, and The North Face."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-on-viksit-bharat-indian-economy-gdp-growth-2735251-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanCan India turn its economic momentum into lasting prosperity? As global risks loom and GDP rankings rise, Raghuram Rajan lays out what it will really take to become a developed nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-needs-8-9-growth-to-become-viksit-bharat-by-2047-raghuram-rajan-2735233-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanIn an exclusive interview with India Today TV's Consulting Editor Rajdeep Sardesai, former RBI Governor Raghuram Rajan discussed India's economic outlook in uncertain global times. He emphasised the need for 8-9% growth for India to become a developed nation by 2047."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/oecd-cuts-global-growth-forecast-to-29-percent-in-2025-2026-trade-war-tariffs-impact-2735081-2025-06-03",
      "headline": "OECD cuts global growth forecast citing trade war risksThe OECD has reduced its global growth forecast to 2.9% for 2025 and 2026, attributing the slowdown to heightened trade tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/credit-score-made-easy-check-it-fix-it-boost-it-2735057-2025-06-03",
      "headline": "Credit score made easy: Check it, fix it, boost itYour credit score is mostly shaped by how timely you are with payments, missing even one EMI or credit card due can bring it down.  A score of 750 or above is considered good by most banks and lending companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-636-points-lower-nifty-below-24600-adani-ports-down-2-percent-2735021-2025-06-03",
      "headline": "Sensex closes 636 points lower, Nifty below 24,600; Adani Ports down 2%The S&P BSE Sensex was down by 636.24 points to close at 80,737.51, while the NSE Nifty50 fell by 174.10 points to end at 24,542. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-news-investment-tips-smallcap-stocks-should-you-invest-expert-view-2734964-2025-06-03",
      "headline": "Smallcap stocks are back in action again. Should you ride the wave?Since the market's low in February 2025, the Nifty50 index has risen by 12%. But the real jump has been in the mid and smallcap space. The midcap index has gone up by 20%, and the smallcap index has climbed 22% during the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-bloodbath-dalal-street-key-reasons-explained-2734954-2025-06-03",
      "headline": "Sensex tumbles 700 points: What's behind today's stock market decline?The BSE Sensex was trading 740.82 points lower at 80,632.93 at around 1:13 pm, while the NSE Nifty50 fell 187.65 points to 24,528.95. All the other Nifty sectoral indices also fell as volatility rose during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/own-property-in-india-why-you-must-fix-any-paperwork-issues-now-registration-bill-2025-2734925-2025-06-03",
      "headline": "Own property in India? Why you must fix any paperwork issues nowIn fact, for years, the biggest property scam in India has been when someone who isn't the real owner sells a property. The buyer, after paying a huge amount, later finds out they were cheated, and the actual owner was someone else all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-made-easy-here-is-simple-step-by-step-guide-to-file-income-tax-return-2734897-2025-06-03",
      "headline": "ITR filing made easy: Here's a simple step-by-step guide to file income tax returnBefore starting your income tax return, ensure you have key documents in hand. These include Form 16 from your employer, Form 26AS, the Annual Information Statement (AIS) and Tax Information Statement (TIS) from the income tax portal, and your bank statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-growth-fy26-slow-down-further-nomura-prediction-stock-market-2734854-2025-06-03",
      "headline": "India's GDP growth may decline to 6.2% in FY26, says NomuraThe assessment, published in a research note on Monday, comes amid what the brokerage describes as a growing \"divergence\" between headline indicators like GST collections and other key economic metrics such as automobile sales and bank credit growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/prostarm-info-systems-share-price-listing-strong-market-debut-19-percent-premium-bse-nse-2734852-2025-06-03",
      "headline": "Prostarm Info Systems shares make strong D-Street debut; list at 19% premiumProstarm Info Systems share price: The stock listed at Rs 125 on the BSE, which was 19.04% higher than its issue price of Rs 105. On the NSE, the stock opened at Rs 120, marking a 14.28% premium over its issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-falls-sharply-today-block-deal-buzz-hyundai-weak-q4-results-2734850-2025-06-03",
      "headline": "Ola Electric shares tumble over 6% today. Here's whyBy 10:15 am, the stock was trading at Rs 50.52, down 5.9%, after reports of a large equity transaction rattled investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-fall-today-8-percent-why-reason-sbmc-stake-sale-clarification-2734844-2025-06-03",
      "headline": "Yes Bank shares fall 8% after 3 sessions of gain. Here's whyYes Bank's shares fell 7.95% to touch a low of Rs 21.43. This was a huge change from the recent trend, as the stock had risen 8.4% in the previous session and was gaining for three days in a row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-cuts-over-300-jobs-in-fresh-round-of-layoffs-report-2734843-2025-06-03",
      "headline": "Microsoft cuts over 300 jobs in fresh round of layoffs: ReportThe layoffs come just weeks after the company executed its biggest workforce reduction in recent years, signalling a deeper shift across the industry as artificial intelligence takes center stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-adani-enterprises-why-adani-group-shares-are-in-focus-today-wall-street-journal-report-links-iran-lpg-shipments-2734835-2025-06-03",
      "headline": "Adani Ports, Adani Enterprises: Why are Adani Group shares in focus today?As of 9:41 am, both Adani Ports and Adani Enterprises were the top losers on the NSE Nifty50, down 1.5% each. Other companies in the Adani portfolio also saw marginal declines in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nse-shares-surge-in-unlisted-market-amid-ipo-buzz-heres-what-analysts-say-2734826-2025-06-03",
      "headline": "NSE shares surge in unlisted market amid IPO buzz. Here's what analysts sayWith over one lakh retail shareholders, a record for any unlisted Indian company, NSE has become a hotspot in the grey market. But analysts tracking the unlisted space suggest the rally may not be over just yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-150-points-nifty-below-24700-adani-ports-fall-3-percent-2734815-2025-06-03",
      "headline": "Sensex down 150 points, Nifty below 24,700; Adani Ports falls 3%The S&P BSE Sensex was down by 226.44 points to 81,147.31, while the NSE Nifty50 fell by 45.05 points to 24,671.55 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-june-3-trading-setup-rbi-mpc-india-us-trade-2734799-2025-06-03",
      "headline": "Sensex, Nifty today: Will stock market open higher to break recent downtrend?As of 8:15 am, Gift Nifty futures were trading at 24,845.5, showing a higher start compared to Nifty50's Monday close of 24,716.6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/prostarm-info-systems-ipo-listing-strong-market-debut-dalal-street-check-gmp-today-2734796-2025-06-03",
      "headline": "Prostarm Info Systems IPO listing: Will it make strong market debut? Check GMPThe listing of Prostarm Info Systems comes at a time when recent mainboard IPOs have not performed very well on debut. Bidding was open from May 27 to May 29, 2025, and saw a total subscription of 96.68 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-june-3-itc-hcltech-biocon-prostarm-info-listing-market-2734783-2025-06-03",
      "headline": "Stocks to watch on June 3: ITC, HCLTech, Biocon, Prostarm Info SystemsThe markets had a shaky start to the week with the Sensex falling over 700 points in early trade, but later recovered to end flat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-import-tariff-not-too-distant-future-us-commerce-secretary-howard-lutnick-donald-trump-2734774-2025-06-03",
      "headline": "Trade deal with India in not-too-distant future: US Commerce SecretaryA trade deal between India and the United States could be finalised soon, as negotiations gain momentum following reciprocal tariff tensions, with US Commerce Secretary Howard Lutnick expressing optimism that both sides have found common ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uber-delivery-uber-eats-chief-steps-down-andrew-macdonald-new-coo-2734760-2025-06-03",
      "headline": "Uber delivery chief steps down after 13 Years; Andrew Macdonald named COOAs senior vice president of Uber's delivery unit, Pierre-Dimitri Gore-Coty oversaw the company's Uber Eats business as well as grocery and other on-demand delivery offerings, and is credited with steering the division through the COVID-19 pandemic."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-fresh-scrutiny-us-prosecutors-iranian-oil-imports-report-2734610-2025-06-02",
      "headline": "Adani faces US scrutiny over Iran LPG 'links', denies role, says unaware of probeGautam Adani's firms are under scrutiny from US prosecutors for reportedly importing Iranian LPG into India through Mundra port. A spokesperson denied the company's involvement and said it was not aware of such a probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/40-and-earning-rs-25-lakh-per-month-here-is-how-you-can-save-rs-1-crore-in-just-5-years-2734520-2025-06-02",
      "headline": "Rs 1 crore in 5 years: Check this guide for 40-year-olds earning Rs 2.5 lakh/monthIf you're earning Rs 2.5 lakh a month, building a corpus of Rs 1 crore in just five years may sound ambitious, but it's certainly achievable with the right planning, discipline, and smart investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-likely-to-become-a-30-trillion-dollar-economy-by-2047-says-amitabh-kant-former-niti-aayog-ceo-2734534-2025-06-02",
      "headline": "India likely to become a $30 trillion economy by 2047, says Amitabh KantAt present, India's economy is valued at around $4 trillion. It recently became the fourth largest economy in the world. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-not-coming-india-union-minister-hd-kumaraswamy-report-2734482-2025-06-02",
      "headline": "Elon Musk's Tesla not interested in manufacturing cars in India: Union MinisterThe Union Minister said that Tesla is not expected to begin manufacturing vehicles in India in the near future. He mentioned that the company is currently interested only in opening showrooms in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-77-points-lower-nifty-below-24700-adani-ports-gains-2-percent-2734450-2025-06-02",
      "headline": "Sensex closes 77 points lower, Nifty below 24,700; Adani Ports gains 2%The S&P BSE Sensex was down by 77.26 points to close at 81,373.75, while the NSE Nifty50 lost 34.10 points to end at 24,716.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-extends-uan-aadhaar-linking-deadline-for-eli-scheme-to-june-30-check-steps-2734401-2025-06-02",
      "headline": "EPFO extends UAN-Aadhaar linking deadline for ELI scheme to June 30. Check stepsAs per a recent circular issued by the EPFO, the new last date to activate your UAN and link your Aadhaar-linked bank account is June 30, 2025. This deadline has already been pushed back several times, giving employees extra time to complete the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-price-rise-today-8-percent-gradual-increase-what-should-investors-know-2734379-2025-06-02",
      "headline": "Reliance Power shares surge 8% today, 23% in last week. Should you buy?Reliance Power share price: Over the last six months, it has gone up by 59.92%. The stock has more than doubled in a year with a 141.40% rise. Over the last five years, the rise has been massive; 2,602.61%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/living-paycheck-to-paycheck-analyst-says-india-has-worst-family-financial-planning-2734347-2025-06-02",
      "headline": "Living paycheck to paycheck: Analyst says India has worst family financial planningAn analyst said that in 2025 we need to teach kids not just how to earn money but how to manage it. He pointed out a common but dangerous mindset, the one with no room for budgeting, risk awareness, or financial learning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-expectation-june-2025-rate-cut-on-card-25-bps-2734327-2025-06-02",
      "headline": "RBI MPC: 25 bps rate cut on the cards? Here's all you need to knowSo far in 2025, the RBI has already cut the repo rate twice, once in February and then in April, by 25 bps each time. These cuts brought the key lending rate down to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/nps-pensioners-to-get-more-benefits-under-unified-pension-scheme-ups-details-here-2734290-2025-06-02",
      "headline": "NPS pensioners to get more benefits under Unified Pension Scheme. Details hereEligible NPS retirees can either get a one-time payment based on their last drawn Basic Pay and Dearness Allowance (DA) for every six months of service, or receive a monthly top-up if their current pension is less than what they'd get under UPS with Dearness Relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/leela-hotels-listing-opening-share-price-discount-7-percent-nse-bse-market-debut-2734250-2025-06-02",
      "headline": "Leela Hotels share price: Stock lists at 7% discount on Dalal StreetThe company's stock opened at Rs 406 on the NSE, which is Rs 29 below the issue price of Rs 435. On the BSE, it opened slightly higher at Rs 406.50, still lower by Rs 28.50, or about 6.55%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-today-why-is-sensex-and-nifty-falling-gdp-growth-global-cues-us-china-2734224-2025-06-02",
      "headline": "Sensex tumbles 700 points. Why is stock market falling despite strong GDP growth?The BSE Sensex was down 732.71 points to 80,718.30 around 9:25 am, while the NSE Nifty50 traded 197.45 points lower at 24,553.25. Most of the broader market indices also fell sharply amid a surge in volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-aegis-vopak-terminals-listing-market-debut-which-ipo-better-check-gmp-today-2734216-2025-06-02",
      "headline": "Leela Hotels vs Aegis Vopak listing: Which IPO will make stronger market debut?Leela Hotels and Aegis Vopak had their initial public offerings (IPOs) open for subscription from May 26 to May 28. While both IPOs were fully subscribed, they did not see very high demand during the bidding period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-fall-opening-bell-sensex-opens-587-points-lower-nifty-below-24600-ril-down-2-percent-it-stocks-2734212-2025-06-02",
      "headline": "Sensex, Nifty open lower as IT, metal stocks drag market despite good GDP dataThe S&P BSE Sensex declined 723 points to 80,728.03, while the NSE Nifty50 lost 191 points to 24,559.95 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-trading-setup-nse-bse-trading-2734207-2025-06-02",
      "headline": "Stock market opening: Will Sensex, Nifty rally today after GDP numbers?India's economy grew by 7.4% in the January-March quarter, surprising many analysts. The growth was mainly driven by strong activity in the construction and manufacturing sectors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-indigo-nykaa-leela-hotels-tata-motors-bpcl-trading-bse-nse-2734196-2025-06-02",
      "headline": "Stocks to watch on June 2: IndiGo, Nykaa, Leela Hotels, Tata Motors, BPCLStocks such as Apollo Hospitals, IndiGo, Tata Motors, BPCL, Leela Hotels, and Aegis Vopak Terminals are expected to be in the spotlight, driven by recent news updates and their fourth-quarter earnings announcements."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/allu-arjun-ranveer-singh-vijay-deverakonda-rashmika-mandanna-rcb-ipl-win-worth-the-wait-2735384-2025-06-04",
      "headline": "Worth the wait: Allu Arjun, Ranveer Singh, others celebrate RCB's maiden IPL winAllu Arjun, Ranveer Singh, Vicky Kaushal, Vijay Deverakonda, Rashmika Mandanna and several other celebrities congratulated Royal Challengers Bengaluru on their maiden IPL title win. This win ended their 18-year wait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-jumps-in-joy-rcb-big-ipl-2025-win-virat-kohli-2735369-2025-06-04",
      "headline": "Anushka Sharma's ecstatic celebration after RCB's maiden IPL win is pure joyActor Anushka Sharma couldn't control her excitement after Royal Challengers Bengaluru (RCB) ended up as the champions of IPL 2025. In a viral video, she could be seen jumping in joy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/love-island-usa-season-7-how-to-watch-stream-schedule-and-premiere-details-glbs-2735354-2025-06-04",
      "headline": "Love Island USA Season 7: How to watch, stream schedule, and premiere detailsLove Island USA Season 7 premieres June 3 on Peacock with new twists, ten fresh Islanders in Fiji, and real-time audience interaction through the app. Episodes also air on Bravo and Hulu.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diddy-gave-bag-of-cash-to-bury-hotel-assault-tape-ex-guard-tells-court-glbs-2735348-2025-06-04",
      "headline": "Diddy gave bag of cash to bury hotel assault tape, ex-guard tells courtA former hotel guard testified that Sean Combs paid $100,000 to suppress assault footage. The video, now key evidence in a federal case, supports multiple abuse allegations Combs denies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-are-labubu-dolls-tiktoks-viral-collectible-is-selling-out-fast-glbs-2735344-2025-06-04",
      "headline": "What are Labubu Dolls? TikTok's viral collectible is selling out fastLabubu dolls, creepy-cute collectibles from Pop Mart, have gone viral on TikTok due to celebrity influence, surprise unboxing, and high resale value — some fetching up to $7,000 online.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-taylor-swift-pregnant-internet-buzzes-over-baby-bump-photo-glbs-2735329-2025-06-04",
      "headline": "Is Taylor Swift pregnant? Internet buzzes over 'baby bump' photoA viral photo of Taylor Swift sparked speculation that she may be pregnant with Travis Kelce's child, though fans are divided and the couple has not publicly addressed the rumors.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-on-being-replaced-by-aaman-devgan-in-azaad-waited-an-entire-year-2735182-2025-06-03",
      "headline": "Siddharth Nigam on being replaced by Aaman Devgan in Azaad: Waited an entire yearActor Siddharth Nigam recently opened up on being replaced by Ajay Devgn's nephew Aaman Devgan in 'Azaad.' His mother recalled their shocking reaction after finding out Aaman was playing the lead in the period drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-supports-deepika-padukone-8-hour-workday-request-2735185-2025-06-03",
      "headline": "Pankaj Tripathi on long working hours amid Deepika-Sandeep Vanga's Spirit rowActor Pankaj Tripathi talked about fixed work hours in films, saying it's important to set limits. He believes saying \"no\" politely is necessary to maintain a healthy balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-invites-chandrababu-naidu-son-akhil-akkineni-zainab-ravdjee-wedding-2735159-2025-06-03",
      "headline": "Nagarjuna invites Chandrababu Naidu to son Akhil Akkineni-Zainab's weddingActor Nagarjuna met Andhra Pradesh Chief Minister N Chandrababu Naidu to invite him to his son Akhil Akkineni's wedding with Zainab Ravdjee on June 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/good-boy-cast-exclusive-park-bo-gum-kim-so-hyun-lee-sang-yi-on-bollywood-india-their-playlist-2735156-2025-06-03",
      "headline": "Good Boy Cast Exclusive: Park Bo Gum, Kim So Hyun, Lee Sang Yi on Bollywood, India, their playlistPark Bo Gum, Kim So Hyun, Lee Sang Yi, Heo Seong Tae and Tae Won Seo get real in this exclusive interview with Bhavna Agarwal on all things Good Boy—their action-packed K-drama that's already winning hearts, premiering on Prime Video in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-ex-wife-avantika-malik-on-divorce-struggles-to-save-her-marriage-2735133-2025-06-03",
      "headline": "Avantika Malik on divorce with Imran Khan: Was the worst thing I had to go throughActor Imran Khan's ex-wife Avantika Malik recently spoke about their painful separation. The couple ended their eight-year marriage in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-might-be-comedy-king-but-lets-discuss-when-he-was-villain-supreme-2735069-2025-06-03",
      "headline": "Paresh Rawal might be comedy king, but let's discuss when he was villain supremeBefore he became everyone's favourite Baburao Ganpatrao Apte, Paresh Rawal was one of Bollywood's most chilling and realistic villains. It's time to revisit his powerful negative roles that showed his true range long before he wore the crown of a comedy king. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-thiruvothu-criticises-kerala-cm-pinarayi-vijayan-over-hema-committee-inaction-wcc-member-bina-paul-agrees-2735138-2025-06-03",
      "headline": "Actor Parvathy slams Kerala government's inaction on Hema Committee's findingsActor Parvathy Thiruvothu criticised the Kerala government's delay in acting on the Hema Committee report, which was submitted over five years ago. She called out the lack of urgency, and pushed for overdue reforms in the Malayalam film industry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maalik-teaser-rajkummar-rao-as-gangster-unleashes-wrath-violent-thriller-2735022-2025-06-03",
      "headline": "Maalik teaser: Rajkummar Rao unleashes wrath on adversaries in violent thrillerThe teaser of Rajkummar Rao starrer 'Maalik' is out. The film debuts the actor in a dark, ruthless gangster avatar in the teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-shares-wedding-pics-on-52nd-anniversary-expresses-gratitude-to-fans-2735090-2025-06-03",
      "headline": "Big B shares wedding pics on 52nd anniversary, expresses gratitude to fansAmitabh Bachchan shared unseen pictures from his wedding on his 52nd anniversary. The actor even posted a note and expressed his gratitude to fans. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-denies-kamal-haasan-collaboration-language-concerns-2734970-2025-06-03",
      "headline": "Pankaj Tripathi denies being part of Kamal Haasan's Thug LifeActor Pankaj Tripathi has dismissed rumours of working with Kamal Haasan in 'Thug Life'. He stresses his preference for Hindi-speaking roles citing difficulty with other languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-close-to-taare-zameen-par-son-junaid-struggle-with-dyslexia-2734960-2025-06-03",
      "headline": "Aamir Khan on why Taare Zameen Par was personal: Junaid is dyslexicAamir Khan recently recalled his son Junaid's struggle with dyslexia. The actor spoke about how the story of 'Taare Zameen Par' (2007) resonated with him because of personal experiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-exit-no-entry-2-scheduling-issues-anees-bazmee-2734942-2025-06-03",
      "headline": "Anees Bazmee reacts to Diljit Dosanjh's exit from No Entry 2Anees Bazmee clarified that Diljit Dosanjh's exit from 'No Entry 2' was due to scheduling conflicts. The director remained hopeful the issue would be resolved and filming would begin soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-with-malti-marie-and-nick-jonas-2734974-2025-06-03",
      "headline": "Priyanka Chopra shares adorable family moments with Malti and Nick Jonas. See picsPriyanka Chopra shared heartwarming family moments with Nick Jonas and their daughter Malti Marie on Instagram. The adorable photos gave fans a peek into their quality time together during her break from work."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-18-year-wait-punjab-kings-2735295-2025-06-03",
      "headline": "RCB crowned IPL champions, 18-year-long wait for Virat Kohli, Bengaluru endsIPL 2025 Final: The 18-year wait finally ended on Tuesday in Ahmedabad. For Virat Kohli and RCB, it was a moment of redemption, relief, and ecstasy. For Punjab Kings, who had exceeded expectations throughout the season, the final brought yet another heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signs-order-imposing-50-tariffs-for-steel-and-aluminum-spares-uk-glbs-2735347-2025-06-04",
      "headline": "Trump signs order hiking US steel, aluminium tariffs to 50% from today; UK sparedTrump signs executive order doubling tariffs on imported steel and aluminium to 50 per cent, citing national security risks and unfair pricing. The policy, effective June 4, aims to protect domestic industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-classroom-construction-scam-manish-sisodia-satyendar-jain-aam-aadmi-party-anti-corruption-bureau-summon-fir-2735365-2025-06-04",
      "headline": "Manish Sisodia, Satyendar Jain summoned in classroom construction scamThe anti-corruption bureau has summoned AAP leaders and ex-Delhi ministers Satyendar Jain and Manish Sisodia on June 6 and 9, respectively, in the Rs 2,000-crore classroom construction scam less than two months after an FIR was registered against them in the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-losses-4-day-conflict-with-india-6-fighter-jets-2-surveillance-planes-30-missiles-2735197-2025-06-03",
      "headline": "6 fighter jets, 2 surveillance planes: Pak's losses in 4-day conflict with IndiaSources told India Today that technical analysis of operational data confirms that six fighter aircraft belonging to the Pakistan Air Force were shot down during the air battles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-celebrations-rcb-lifts-title-ee-sala-cup-namde-fireworks-red-2735339-2025-06-04",
      "headline": "Ee Sala Cup Namdu: Bengaluru celebrates like never before after RCB wins IPL 2025The moment RCB sealed their maiden IPL title, Bengaluru celebrated like never before. Fans flooded the streets in every direction, lit fireworks, and filled the night with chants of 'Ee Sala Cup Namdu!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/toronto-shooting-leaves-6-injured-1-hospitalised-in-critical-condition-hunt-on-for-gunman-local-media-2735371-2025-06-04",
      "headline": "1 killed, 5 injured in Toronto shooting, hunt on for gunman: ReportGunfire erupted Tuesday night in Toronto's Lawrence Heights, leaving one dead and five injured. Police have set up a command post, but no suspect details have been released yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-virat-kohli-compares-ipl-2025-win-with-test-cricket-2735362-2025-06-04",
      "headline": "IPL win among my best, but five rungs below Test cricket: Virat KohliIndia and Royal Challengers Bengaluru (RCB) star Virat Kohli compared his historic Indian Premier League 2025 (IPL 2025) triumph with Test cricket and ranked it five levels below the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-on-viksit-bharat-indian-economy-gdp-growth-2735251-2025-06-03",
      "headline": "India needs 8-9% growth to become Viksit Bharat by 2047: Raghuram RajanCan India turn its economic momentum into lasting prosperity? As global risks loom and GDP rankings rise, Raghuram Rajan lays out what it will really take to become a developed nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-feature-2735361-2025-06-04",
      "headline": "Kohli's IPL triumph: A testament to loyalty and greatnessIPL 2025 Final, RCB vs PBKS: Virat Kohli's loyalty to the Royal Challengers Bengaluru paid off after he lifted the Indian Premier League title in his 18th season. On Tuesday, RCB beat Punjab Kings by six runs at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/no-thug-life-for-karnataka-as-no-malice-no-sorry-remains-kamal-haasan-stand-2735167-2025-06-03",
      "headline": "No 'Thug Life' for Karnataka as no malice, no sorry, remains Kamal Haasan's standWhat did Kamal Haasan say? That Kannada language came out of Tamil. Why did he say so? Because he wanted to convey to Kannada actor Shiva Rajkumar, who was present in the audience, that Kannada and Tamil came from the same family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-4-wednesday-pm-modi-operation-sindoor-kamal-haasan-kannada-row-rahul-gandhi-haryana-visit-bihar-polls-maharashtra-monsoon-rain-updates-2735373-2025-06-04",
      "headline": "News Menu, June 4: Op Sindoor delegation to meet PM; Rahul Gandhi in Haryana todayIndia Today's Wednesday news menu serves up a fiery mix of Kamal Haasan upping the ante after being pulled up by the Karnataka High Court over his Kannada remarks, Rahul Gandhi's visit to Haryana in a bid to revamp Congress, the Operation Sindoor delegation led by Shrikant Shinde set to meet PM Modi, and more."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/i-just-cant-stand-it-anymore-elon-musk-explodes-over-trumps-budget-bill-glbs-2735324-2025-06-04",
      "headline": "Disgusting abomination: Elon Musk explodes over Trump's big, beautiful billElon Musk slammed Trump's massive tax-and-spending bill as a \"disgusting abomination,\" warning it will spike the deficit to $2.5 trillion and burden Americans with crushing, unsustainable debt."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-sana-yousaf-pakistan-teen-influencer-17-shot-dead-islamabad-honour-killing-2735135-2025-06-03",
      "headline": "Who is Sana Yousaf? The 17-year-old Pakistani influencer shot dead in IslamabadPakistani influencer Sana Yousaf, 17, was shot dead at her Islamabad home on Monday evening. Read on to know more about her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/retail-gets-personal-how-brands-are-fast-learning-what-you-want-2735043-2025-06-03",
      "headline": "Retail gets personal: How brands are fast learning what you wantAn abundance of choice has brought personalisation into vogue. The consumer's journey may start digitally but end at an offline store\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/three-indians-who-went-missing-in-iran-rescued-by-tehran-police-government-sources-2735292-2025-06-03",
      "headline": "3 Indians missing in Iran rescued by cops in TehranThree Indians who were travelling to Iran and went missing last month have been rescued by Tehran police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/kcr-daughters-letter-bomb-fuels-brs-flux-will-party-fade-into-bjp-2735092-2025-06-03",
      "headline": "KCR daughter's letter bomb fuels BRS flux: Will party fade into BJP?The BJP won't inherit any baggage associated with KCR's family rule. What it wants are BRS MLAs and grassroots leaders who can deliver votes and influence\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/texas-man-jumps-mar-a-lago-wall-to-marry-trumps-granddaughter-arrested-glbs-2735355-2025-06-04",
      "headline": "Texas man jumps Mar-a-Lago wall to marry Trump's granddaughter, arrestedAnthony Reyes, 23, was arrested for trespassing at Mar-a-Lago, claiming he wanted to \"spread the Gospel\" to Trump and marry his granddaughter Kai. He's being held on a $50,000 bond."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-jibe-india-pakistan-ceasefire-bjp-rss-pm-modi-surrendered-trump-call-2735175-2025-06-03",
      "headline": "Trump said Narender surrender, says Rahul Gandhi, gets branded Pak agent by BJPRahul Gandhi accused the BJP and RSS of bowing under pressure and contrasted their response with Congress leaders of the past. Reacting to his remarks, the BJP called him uncivilised and said Indians look at him as \"an agent of Pakistan\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/whos-in-charge-democracy-or-generals-uk-mp-calls-pakistan-a-failed-state-glbs-2735357-2025-06-04",
      "headline": "Who's in charge, democracy or generals? UK MP calls Pakistan a failed stateUK MP Bob Blackman called Pakistan a \"failed state\" and questioned whether it's ruled by democracy or the military. He accused Pakistan of backing terrorism against India and misusing foreign aid. Blackman voiced strong UK support for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/karnataka-high-court-judge-acted-as-kannadiga-tamil-nadu-mla-backs-kamal-haasan-2735293-2025-06-04",
      "headline": "Karnataka High Court judge acted as Kannadiga: Tamil Nadu MLA backs Kamal HaasanAmid the ongoing controversy over Kamal Haasan's remarks, which led to demands for a ban on his upcoming film 'Thug Life' in Karnataka, a Tamil Nadu MLA has expressed his support for the actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-sydney-sweeneys-viral-soap-has-the-internet-gagged-and-curious-2735005-2025-06-03",
      "headline": "Why Sydney Sweeney's viral soap has the Internet gagged (and curious)Sydney Sweeney's latest soap bar, in collaboration with a men's skincare brand, has created a buzz. Not just because it is Sweeney endorsing it, but because it allegedly has her used bathwater infused in it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-to-lead-unsc-taliban-sanctions-committee-glbs-2735342-2025-06-04",
      "headline": "Pakistan to lead UNSC Taliban sanctions committeePakistan will chair the 1988 Taliban Sanctions Committee for 2025, while also holding key roles in other UN Security Council bodies during its 2025–26 non-permanent membership term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-gold-card-to-be-a-game-changer-for-indian-investors-us-commerce-secretary-glbs-2735333-2025-06-04",
      "headline": "Trump Gold Card to be a game-changer for Indian investors: US Commerce SecretaryUS Commerce Secretary Howard Lutnick says the USD 5 million Trump Gold Card residency program will thrive in India, offering wealthy Indians a Green Card-like opportunity to invest and live in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/rich-thief-owning-flat-bungalow-bought-money-stolen-arrested-mumbai-2735240-2025-06-03",
      "headline": "Flat in Mumbai, bungalow in Bihar: Cross-dressing thief who amassed wealth caughtThe accused had been committing thefts in posh areas of Mumbai and was able to evade the police and the CCTV cameras installed in the vicinity by disguising himself as a woman."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ee-sala-cup-namde-was-like-a-jinx-staying-quiet-worked-for-rcb-sunil-gavaskar-2735396-2025-06-04",
      "headline": "'Ee Sala Cup Namde' felt like a jinx, staying quiet worked for RCB: Sunil GavaskarLegendary India cricketer Sunil Gavaskar said toning down 'Ee Sala Cup Namde' slogan helped Royal Challengers Bengaluru (RCB) massively as it helped them break the jinx and lift the title after 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-the-loyal-challenger-from-royal-challengers-bangalore-2735397-2025-06-04",
      "headline": "Virat Kohli, the Loyal Challenger from Royal Challengers BangaloreVirat Kohli's 18-year journey with RCB is a testament to unwavering loyalty, perseverance, and the transformation of raw potential into greatness. The long-awaited IPL triumph not only marked the end of RCB's title drought but also elevated him as a symbol of devotion, character, and the enduring bond between a player and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-ipl-2025-final-rajeev-shukla-interview-2735394-2025-06-04",
      "headline": "Knew RCB would win IPL, but didn't think it would take this long: Rajeev ShuklaIPL 2025 Final, RCB vs PBKS: In an interview with India Today, Rajeev Shukla said that he didn't believe that Royal Challengers Bengaluru would take 18 seasons to win their maiden Indian Premier League trophy. On Tuesday, RCB beat PBKS by six runs at the Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rajeev-shukla-interview-2735391-2025-06-04",
      "headline": "Virat Kohli isn't right for an IPL team, people said: Rajeev Shukla slams criticsIPL 2025, RCB vs PBKS: In an interview with India Today, Rajeev Shukla praised Virat Kohli as the latter won his maiden title after waiting for 18 long seasons. On Tuesday, Bengaluru beat Punjab by six runs at the Narendra Modi Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-krunal-pandya-rcb-vs-pbks-final-2735375-2025-06-04",
      "headline": "Krunal Pandya: Mumbai's main man once, RCB's IPL final hero nowIPL 2025 Final, RCB vs PBKS: Krunal Pandya's stupendous spell of 4-0-17-2 helped Royal Challengers Bengaluru win their maiden Indian Premier League title after beating Punjab Kings by six runs on Tuesday at the Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-feature-2735361-2025-06-04",
      "headline": "Kohli's IPL triumph: A testament to loyalty and greatnessIPL 2025 Final, RCB vs PBKS: Virat Kohli's loyalty to the Royal Challengers Bengaluru paid off after he lifted the Indian Premier League title in his 18th season. On Tuesday, RCB beat Punjab Kings by six runs at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ravi-shastri-final-rcb-vs-pbks-2735370-2025-06-04",
      "headline": "Watch: Kohli leaps into Shastri's arms in pure joy as long IPL wait endsIPL 2025: Virat Kohli ran and leapt into Ravi Shastri's arms in joy after the Royal Challengers Bengaluru (RCB) won the title for the first time in 18 years on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-victory-parade-in-bengaluru-when-and-where-to-watch-2735366-2025-06-04",
      "headline": "RCB IPL 2025 victory parade: When and where to watch celebrations in Bengaluru?Royal Challengers Bengaluru (RCB) have announced a victory parade for their fans following their team's maiden IPL title after beating Punjab Kings (PBKS) by six runs in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-virat-kohli-compares-ipl-2025-win-with-test-cricket-2735362-2025-06-04",
      "headline": "IPL win among my best, but five rungs below Test cricket: Virat KohliIndia and Royal Challengers Bengaluru (RCB) star Virat Kohli compared his historic Indian Premier League 2025 (IPL 2025) triumph with Test cricket and ranked it five levels below the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-18-year-wait-worth-virat-kohli-victory-speech-2735358-2025-06-04",
      "headline": "Virat Kohli's stirring IPL victory speech was worth the 18-year waitAfter 18 long years, RCB finally lifted their maiden IPL trophy on Tuesday. Virat Kohli's stirring, emotional victory speech made the wait feel profoundly worth it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735337-2025-06-04",
      "headline": "Virat Kohli's message to RCB captain Rajat Patidar: IPL win is as big for othersVirat Kohli had a special message for Rajat Patidar and the RCB squad as they ended their IPL jinx and won the title on Tuesday, June 3. Kohli and Patidar were able to mastermind RCB's first title win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ravi-shastri-final-rcb-vs-pbks-2735370-2025-06-04",
      "headline": "Watch: Kohli leaps into Shastri's arms in pure joy as long IPL wait endsIPL 2025: Virat Kohli ran and leapt into Ravi Shastri's arms in joy after the Royal Challengers Bengaluru (RCB) won the title for the first time in 18 years on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-victory-parade-in-bengaluru-when-and-where-to-watch-2735366-2025-06-04",
      "headline": "RCB IPL 2025 victory parade: When and where to watch celebrations in Bengaluru?Royal Challengers Bengaluru (RCB) have announced a victory parade for their fans following their team's maiden IPL title after beating Punjab Kings (PBKS) by six runs in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-virat-kohli-compares-ipl-2025-win-with-test-cricket-2735362-2025-06-04",
      "headline": "IPL win among my best, but five rungs below Test cricket: Virat KohliIndia and Royal Challengers Bengaluru (RCB) star Virat Kohli compared his historic Indian Premier League 2025 (IPL 2025) triumph with Test cricket and ranked it five levels below the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-18-year-wait-worth-virat-kohli-victory-speech-2735358-2025-06-04",
      "headline": "Virat Kohli's stirring IPL victory speech was worth the 18-year waitAfter 18 long years, RCB finally lifted their maiden IPL trophy on Tuesday. Virat Kohli's stirring, emotional victory speech made the wait feel profoundly worth it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-virat-kohli-rajat-patidar-ahmedabad-2735337-2025-06-04",
      "headline": "Virat Kohli's message to RCB captain Rajat Patidar: IPL win is as big for othersVirat Kohli had a special message for Rajat Patidar and the RCB squad as they ended their IPL jinx and won the title on Tuesday, June 3. Kohli and Patidar were able to mastermind RCB's first title win. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}