{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/launching-a-startup-this-government-scheme-simplifies-early-funding-2791851-2025-09-23",
      "headline": "Launching a startup? This government scheme simplifies early fundingStarting a startup is exciting but securing funds at the initial stage is often a hurdle. This government scheme provides seed funding through incubators, giving you the financial boost to test, prototype, and launch your product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-and-itr-7-filing-opens-online-who-can-file-and-by-when-2791813-2025-09-23",
      "headline": "ITR-5 and ITR-7 filing opens online. Who can file and by when?The Income Tax Department has opened online filing for ITR-5 and ITR-7 forms for AY 2025–26. These forms are not meant for individuals but for specific entities. Here's a quick look at who needs to file and the deadlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-srini-gopalan-t-mobile-ceo-net-worth-profile-education-experience-indian-origin-2791808-2025-09-23",
      "headline": "Who is Srini Gopalan, T-Mobile's new Indian-origin CEOSrini Gopalan will take over from Mike Sievert, who has been named Vice Chairman. Mike Sievert, the outgoing CEO, said that Gopalan was the natural choice to take T-Mobile forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-all-time-high-festive-season-buy-safe-to-invest-expert-view-silver-yellow-metal-price-today-2791785-2025-09-23",
      "headline": "Gold shines at an all-time high, but is it safe to invest?The yellow metal, traditionally seen as a safe haven in uncertain times, has surged sharply in the past year, supported by global factors ranging from geopolitical tensions to central bank buying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-100-points-nifty-above-25200-maruti-jumps-over-2-2791752-2025-09-23",
      "headline": "Markets edge higher, auto stocks lead early gains; volatility loomsThe Sensex climbed nearly 100 points in early trade, while the Nifty50 hovered above 25,200. Broader indices, however, struggled to find traction as pockets of profit booking introduced early volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-gifting-festive-season-ministry-of-finance-bans-notice-orders-all-departments-to-comply-2791723-2025-09-23",
      "headline": "Ministry of Finance bans spending on Diwali gifts, orders all to complyThe latest notice from the Ministry of Finance comes as part of the government's continuing efforts to enforce fiscal discipline and restrict non-essential spending."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nvidia-invest-100-billion-dollars-openai-next-gen-ai-growth-glbs-2791630-2025-09-22",
      "headline": "Nvidia to invest $100 billion in OpenAI for next-gen AI infrastructureThe companies unveiled a letter of intent for a landmark strategic partnership to deploy at least 10 gigawatts of Nvidia chips for OpenAI's AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-noida-is-emerging-as-indias-next-hotspot-for-branded-residences-2791571-2025-09-22",
      "headline": "Why Noida is emerging as India's next hotspot for branded residencesNoida is shedding its image as just a satellite city of Delhi. With luxury developers entering the market, it's fast becoming India's go-to destination for branded residences that promise prestige, comfort, and modern living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indusind-bank-ex-cfo-gobind-jain-records-statement-accounting-lapse-probe-2791491-2025-09-22",
      "headline": "IndusInd Bank's ex-CFO records statement in accounting lapse probeMumbai Police's Economic Offences Wing (EOW) has so far recorded statements of seven to eight employees of the bank. Ex-CFO Gobind Jain recorded his statement today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-refund-claim-rejected-ca-explains-how-to-rectify-and-reapply-itr-refund-2025-2791446-2025-09-22",
      "headline": "Income tax refund claim rejected? CA explains how to rectify and reapplyGetting your income tax refund rejected can be unsettling, especially after filing on time. But in most cases, the issues are minor and fixable. Here's a look at why rejections occur and how to reapply successfully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/gold-silver-stock-market-where-should-you-invest-right-now-invest-2791440-2025-09-22",
      "headline": "Gold, silver or equity: Where should you invest right now?Gold prices touched a fresh record high on the 1st day of Navrartri, once again sparking the age-old debate among investors: where should money be parked during this time, gold, silver, or equity?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/best-chapter-of-our-lives-katrina-kaif-vicky-kaushal-announce-pregnancy-2791886-2025-09-23",
      "headline": "Best chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancyBest chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-gargs-wife-garima-saikia-cries-inconsolably-as-she-stands-in-front-of-his-pyre-guwahati-2791874-2025-09-23",
      "headline": "Video: Zubeen Garg's wife cries inconsolably as she says goodbye to singerWearing a mekhela chador, a traditional dress worn by Assamese women, Garima Saikia Garg stood in front of her husband Zubeen Garg's pyre with folded hands as she cried inconsolably."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-jethwa-emotional-homebound-premiere-mumbai-oscars-entry-2791845-2025-09-23",
      "headline": "Actor Vishal Jethwa tears up at Homebound premiere, fans rally onlineAt the Mumbai premiere of 'Homebound', actor Vishal Jethwa was seen getting emotional on the red carpet. The film, starring Vishal alongside Ishaan Khatter and Janhvi Kapoor, has gained acclaim after its Cannes premiere and is India's official entry for the 2026 Oscars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-high-court-suspends-rs-200-cinema-ticket-price-cap-2791843-2025-09-23",
      "headline": "Karnataka High Court grants interim stay on Rs 200 cinema ticket price capKarnataka High Court granted an interim stay on the cinema ticket price cap of Rs 200. Multiplex Association of India and others challenged the regulation, citing business rights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-teaser-yami-gautam-emraan-hashmi-bring-shah-bano-case-back-to-courtroom-2791839-2025-09-23",
      "headline": "HAQ teaser: Yami Gautam, Emraan Hashmi bring Shah Bano case back to courtroomThe teaser for 'HAQ', a film inspired by the Supreme Court's Shah Bano case judgement, has been released. The movie, featuring Yami Gautam and Emraan Hashmi, revisits significant questions around justice, personal law, and the Uniform Civil Code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-warns-against-ai-misinformation-as-his-fake-valmiki-video-goes-viral-2791815-2025-09-23",
      "headline": "Akshay Kumar warns against AI misinformation as his fake Valmiki video goes viralActor Akshay Kumar called out a viral AI-generated fake video showing him as Maharishi Valmiki. Kumar urged the media to verify content before sharing. The actor asked fans not to produce or circulate misleading AI-manipulated videos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-pallavi-swimsuit-photos-social-media-criticism-fans-defend-choice-2791804-2025-09-23",
      "headline": "Actor Sai Pallavi trolled for wearing swimwear at beach, fans defend herActor Sai Pallavi received backlash online for wearing a swimsuit during a beach vacation with her sister. Social media users questioned her choice in light of her traditional image on-screen. However, her fans defended her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-collection-day-4-detailed-report-slow-monday-but-strong-rs-60-crore-week-ahead-2791797-2025-09-23",
      "headline": "Jolly LLB 3 box office day 4: Slow Monday but strong Rs 60 crore week aheadAkshay Kumar and Arshad Warsi's 'Jolly LLB 3' crosses Rs 59.25 crore in 4 days at the box office. After a strong weekend, the legal comedy shows steady momentum with a Rs 5.75 crore Monday collection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-recalls-rishi-kapoor-cancer-battle-choreographs-aryan-khan-debut-song-2791749-2025-09-23",
      "headline": "Farah Khan recalls crying on call with Rishi Kapoor after his cancer diagnosisFilmmaker Farah Khan shared memories of her emotional conversation with Rishi Kapoor after his cancer diagnosis. Khan reflected on her experiences working with Kapoor early in her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/raghav-juyal-is-the-hero-you-didnt-see-coming-in-the-bads-of-bollywood-aryan-khan-2791402-2025-09-23",
      "headline": "Raghav Juyal is the hero you didn't see coming in The Ba***ds of BollywoodDid you watch Aryan Khan's debut series 'The Ba***ds of Bollywood'? If yes, you'd agree that Raghav Juyal made sure your weekend binge was far more entertaining with his stellar performance. While you might be hooked on knowing more about the show, you might also be introduced to some spoilers ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-malaika-arora-share-warm-hug-at-homebound-premiere-watch-2791760-2025-09-23",
      "headline": "Exes Arjun Kapoor, Malaika Arora share warm hug at Homebound premiere. WatchEx-couple Arjun Kapoor and Malaika Arora shared a warm hug and smile at the screening of 'Homebound'. The two, who have mostly kept their distance since their split, surprised many with the cordial gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-denies-shefali-jariwala-anti-ageing-drug-claims-its-half-baked-information-2791734-2025-09-23",
      "headline": "Parag Tyagi denies Shefali's anti-ageing drug claims: It's half-baked informationParag Tyagi recently dismissed claims about his late wife, Shefali Jariwal, taking anti-ageing medication. He called it half-baked information. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/video/demon-slayer-infinity-castles-takahiro-sakurai-on-giyu-tanjiro-films-serious-tone-indian-fans-2791742-2025-09-23",
      "headline": "Demon Slayer Infinity Castle's Takahiro Sakurai on Giyu & Tanjiro, film's serious tone, Indian fans In an exclusive chat with India Today's Bhavna Agarwal, Takahiro Sakurai san spoke on his journey with the character, the evolution arc of Giyu and Tanjiro, and the overwhelming response from Indian fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/kpop-demon-hunters-arden-cho-on-asian-american-bts-blackpink-jungkooks-reaction-2791733-2025-09-23",
      "headline": "KPop Demon Hunters' Arden Cho on Asian-American, BTS, BLACKPINK, JungKook's reactionKPop Demon Hunters' Arden Cho, who gave her voice to Rumi, spoke to India Today's Bhavna Agarwal about the Netflix's most watched film of all times and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/the-morning-show-s4-india-exclusive-is-ai-the-new-threat-the-cast-answers-india-today-2791730-2025-09-23",
      "headline": "The Morning Show S4 India Exclusive: Is AI the new threat? The cast answers | India TodayThe Morning Show Season 4 premiered on Apple TV+ on September 17. The cast spoke to India Today's Bhavna Agarwal over AI- one of the central themes for the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-funeral-2791728-2025-09-23",
      "headline": "Live: Zubeen Garg cremated with full state honours, 21-gun saluteZubeen Garg Last Rites Live Updates: The singer was cremated with full state honours and a 21-gun salute on September 23. The last rites were performed by his younger sister, Palmi Borthakur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/jennifer-aniston-and-reese-witherspoon-discuss-ai-india-the-morning-show-s4-india-exclusive-2791727-2025-09-23",
      "headline": "Jennifer Aniston and Reese Witherspoon discuss AI, India, The Morning Show S4 | India ExclusiveJennifer Aniston and Reese Witherspoon spoke to India Today's Bhavna Agarwal on The Morning Show S4, dangers related to AI taking over the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-tributes-sridevi-iconic-saree-homebound-premiere-india-oscar-entry-2791703-2025-09-23",
      "headline": "Janhvi Kapoor wears Sridevi's gorgeous saree, pays tribute at Homebound premiereActor Janhvi Kapoor honoured her late mother Sridevi at the Mumbai premiere of 'Homebound', wearing a saree once worn by her. Meanwhile, the film is announced as India's official Oscar entry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-company-hybe-officially-launches-indian-subsidiary-hybe-india-2791696-2025-09-23",
      "headline": "BTS' company HYBE officially launches Indian subsidiary HYBE IndiaHYBE has inaugurated its Indian subsidiary, HYBE India Entertainment Private Limited, establishing Mumbai as its strategic hub to connect the Indian music market with the global ecosystem."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-republican-party-alexander-duncan-hanuman-statue-hindu-god-controversy-2791790-2025-09-23",
      "headline": "False Hindu God: Trump party leader's remark on Hanuman statue sparks furyThe Hanuman statue, the tallest in North America, has received backlash on social media by MAGA members ever since it was inaugurated in August 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-heavy-rain-record-rain-floods-city-days-before-durga-puja-metro-services-impacted-2791750-2025-09-23",
      "headline": "Rain cripples Kolkata ahead of Durga Puja, streets flooded, 7 die of electrocutionFloodwater entered many buildings and residential complexes across Kolkata as heavy rain, which began past midnight, left roads waterlogged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/best-chapter-of-our-lives-katrina-kaif-vicky-kaushal-announce-pregnancy-2791886-2025-09-23",
      "headline": "Best chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancyBest chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancy"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-potholes-dk-shivakumar-repairs-bjp-infrastructure-congress-karnataka-2791746-2025-09-23",
      "headline": "Potholes even on PM's residence road, media only shows Karnataka: DK ShivakumarKarnataka Deputy Chief Minister DK Shivakumar said civic teams are filling thousands of potholes daily despite rain. He blamed the BJP for poor roads nationwide and accused the media of singling out Karnataka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jamaat-student-wings-victory-signal-on-bangladesh-elections-polls-muhammad-yunus-bnp-tarique-rahman-chhatra-shibir-2791517-2025-09-23",
      "headline": "Is Jamaat student wing's victory a signal on Bangladesh polls?Bangladesh's interim government promised elections in February, but doubts persist with the Jamaat-e-Islami and the NCP seeking reforms first. Should the victory of the Jamaat's students' wing in the Dhaka University elections and Muhammad Yunus' push for local polls be seen as signals?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sc-slams-dmk-led-tn-government-for-using-public-funds-for-m-karunanidhi-statue-2791798-2025-09-23",
      "headline": "Why use public funds? Tamil Nadu gets Supreme Court rap over Karunanidhi statueThe Supreme Court criticised the Tamil Nadu government over plans to install M Karunanidhi's statue. The Supreme Court asked the state to withdraw its plea and approach Madras High Court. The High Court had barred statues in public places.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-gargs-wife-garima-saikia-cries-inconsolably-as-she-stands-in-front-of-his-pyre-guwahati-2791874-2025-09-23",
      "headline": "Video: Zubeen Garg's wife cries inconsolably as she says goodbye to singerWearing a mekhela chador, a traditional dress worn by Assamese women, Garima Saikia Garg stood in front of her husband Zubeen Garg's pyre with folded hands as she cried inconsolably."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/west-rushes-to-officially-recognise-palestine-will-israel-be-isolated-the-lowdown-2791824-2025-09-23",
      "headline": "West rushes to officially recognise Palestine; will Israel be isolated?On September 21, four Western nations formally recognised the State of Palestine, aligning with over 140 countries and intensifying pressure for a two-state solution amid the escalating Gaza conflict.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tdp-andhra-pradesh-nara-lokesh-chandrababu-naidu-son-technology-entrepreneurs-vizag-visakhapatnam-hyderabad-bengaluru-2791603-2025-09-23",
      "headline": "Is Nara Lokesh seeking father of all revenges via Vizag?Nara Lokesh, Andhra Pradesh minister and CM Chandrababu Naidu's son, recently invited a tech entrepreneur to set shop in Vizag. Nara Lokesh has been pitching Vizag as an alternative to Bengaluru and Hyderabad. It seems like the TDP leader is out to avenge his father's loss in the Hyderabad-Bangalore cybercity battle of the 1990s. Bengaluru, having won the IT race and with Hyderabad going to Telangana, Vizag is the port of call for the big daddy of all revenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/kolkata/video/video-cars-submerged-as-kolkata-neighbourhood-turns-into-massive-lake-2791836-2025-09-23",
      "headline": "Video: Cars submerged as Kolkata neighbourhood turns into massive lakeOvernight downpour crippled normal life in Kolkata and nearby areas on Tuesday, leaving several neighbourhoods submerged under knee-deep water and traffic at a standstill. The heaviest rainfall was recorded in the city's southern and eastern parts, with Garia Kamdahari logging 332 mm, followed by Jodhpur Park (285 mm), Kalighat (280.2 mm), Topsia (275 mm), Ballygunge (264 mm) and Chetla (262 mm), according to the Kolkata Municipal Corporation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/raghav-juyal-is-the-hero-you-didnt-see-coming-in-the-bads-of-bollywood-aryan-khan-2791402-2025-09-23",
      "headline": "Raghav Juyal is the hero you didn't see coming in The Ba***ds of BollywoodDid you watch Aryan Khan's debut series 'The Ba***ds of Bollywood'? If yes, you'd agree that Raghav Juyal made sure your weekend binge was far more entertaining with his stellar performance. While you might be hooked on knowing more about the show, you might also be introduced to some spoilers ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-stabbed-11-times-by-husband-at-sunkadakatte-bus-stand-police-suspect-marital-discord-2791835-2025-09-23",
      "headline": "Suspecting affair, Bengaluru man stabs wife to death in front of daughterA 32-year-old woman was stabbed 11 times by her husband at Sunkadakatte bus stand in Bengaluru. Her 13-year-old daughter witnessed the attack. The accused later surrendered to police."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-madurai-ragging-iti-college-student-stripped-assaulted-warden-suspended-2791791-2025-09-23",
      "headline": "Madurai student stripped, hit on private parts in shocking ragging caseA student at Thirumangalam ITI College hostel in Tamil Nadu's Madurai was stripped naked and assaulted by fellow students. Three students were booked, and the hostel warden suspended. Police investigation is ongoing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-funeral-song-mayabini-ratir-bukut-song-anthem-procession-guwahati-fans-grief-2791423-2025-09-22",
      "headline": "A phenomenon called Zubeen Garg and how Mayabini became an anthemAssam has been plunged into an unprecedented mourning after Zubeen Garg's death, with lakhs singing and humming Zubeen's song 'Mayabini Ratir Bukut' into a collective anthem of grief. From Guwahati to cities across India, the outpouring has revealed the true scale of Zubeen Da's cultural and social influence and the enigma he was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-kids-really-grow-up-without-screens-2791403-2025-09-23",
      "headline": "Can kids really grow up without screens?Can children really thrive without screens in today's connected world, and should parents even attempt it? Find out from experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/aditya-l1-to-get-new-neighbour-as-nasas-imap-aims-to-chart-solar-systems-edge-2791834-2025-09-23",
      "headline": "Aditya-L1 to get a new neighbour as Nasa targets Solar System's edgeIMAP will launch aboard a SpaceX Falcon-9 on a mission to chart the very edge of the solar system — the heliosphere's boundary— where the Sun's influence yields to the interstellar medium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-i-love-muhammad-row-and-why-it-sparked-protests-across-india-barawafat-procession-kanpur-nagpur-hyderabad-owaisi-full-story-2791497-2025-09-22",
      "headline": "What is 'I Love Muhammad' row and why did it spark protests across India?The 'I Love Muhammad' slogan, first contested during a Barawafat procession in Kanpur, has triggered protests and processions by Muslims across several states. Clashes with police, FIRs, and social media debates have intensified the controversy, drawing attention from political leaders and religious organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/h1b-visa-row-the-end-of-the-american-dream-from-the-india-today-archives-2025-2791439-2025-09-22",
      "headline": "H1B visa row: The end of the American dream? | From the archives (2025)As India grapples with the Trump administration's H1B visa fee spike, we analyse another setback: barriers for foreign students seeking education in the US"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-may-exempt-doctors-from-100000-h-1b-visa-fee-glbs-2791652-2025-09-22",
      "headline": "US may exempt doctors from $100,000 H-1B visa fee: ReportThe H-1B visa programme is regarded as critical for hospitals that depend on foreign-trained doctors to work in remote regions. Several health systems rely on visas to bring in medical residents and specialists, often to serve areas that struggle to attract US-trained professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/afghan-boy-hides-in-landing-gear-kabul-delhi-flight-caught-at-igi-airport-2791628-2025-09-22",
      "headline": "13-year-old Afghan boy hides in plane's landing gear for 2 hours, lands in DelhiThe boy was apprehended by the airline personnel and handed over to the Central Industrial Security Force personnel, who brought him to Terminal 3 of the airport for questioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/kerala-nurse-migration-crisis-healthcare-shortage-2791504-2025-09-23",
      "headline": "Missing nurses: Kerala's silent shortageKerala faces a paradox as thousands of trained nurses migrate abroad for better opportunities. This exodus intensifies local healthcare staffing shortages and strains hospitals across the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-teaser-yami-gautam-emraan-hashmi-bring-shah-bano-case-back-to-courtroom-2791839-2025-09-23",
      "headline": "HAQ teaser: Yami Gautam, Emraan Hashmi bring Shah Bano case back to courtroomThe teaser for 'HAQ', a film inspired by the Supreme Court's Shah Bano case judgement, has been released. The movie, featuring Yami Gautam and Emraan Hashmi, revisits significant questions around justice, personal law, and the Uniform Civil Code."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-ballon-dor-psg-fc-barcelona-disrespect-panache-2791872-2025-09-23",
      "headline": "From ambulance jibes to Ballon d'Or glory: Dembele's chapter from the book of panacheOusmane Dembele's journey from ridicule at Barcelona to Ballon d'Or glory with PSG epitomizes resilience and redemption. Once mocked as injury-prone, he now stands among football's greats, silencing critics with brilliance on Europe's grandest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ilt20-big-bash-league-ricky-ponting-auction-2025-2791814-2025-09-23",
      "headline": "Ashwin set for double-role? Spinner likely to play in ILT20, Big Bash League: ReportThe Indian spin-bowling great, Ravichandran Ashwin, is reportedly almost certain to feature in both the ILT20 in the UAE and the Big Bash League in Australia despite the overlapping schedules. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-india-outclass-pakistan-dubai-super-4-2791765-2025-09-23",
      "headline": "Asia Cup: Even on rare off-days, India outclass Pakistan, says Sanjay ManjrekarAsia Cup 2025: Former India cricketer, Sanjay Manjrekar, believes that even when India are not at their best, their talent-stacked players somehow find a way to wi,n showcasing the gap in levels with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-slams-umpire-fakhar-zaman-dismissal-india-asia-cup-2025-2791740-2025-09-23",
      "headline": "Shahid Afridi slams umpire for Fakhar Zaman dismissal vs India: They need the IPL jobAsia Cup 2025: Former Pakistan captain, Shahid Afridi indicated that the umpires might be biased to favour India after his cheeky comment, reacting to Fakhar Zaman's dismissal in the recent IND vs PAK clash in the Super 4 stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-clow-courts-favour-carlos-alcaraz-jannik-sinner-grand-slam-finals-laver-cup-2791731-2025-09-23",
      "headline": "Tennis rigged? Roger Federer says courts slowed to favour Alcaraz, SinnerRoger Federer has criticised modern tennis for uniform, slower courts, saying they favour stars like Alcaraz and Sinner. He urges tournament directors to reintroduce surface variety to keep matches unpredictable and exciting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sri-lanka-asia-cup-super-4-match-abu-dhabi-spin-battle-preview-2791651-2025-09-23",
      "headline": "Pakistan, Sri Lanka desperate for redemption after poor Super 4 startsPakistan and Sri Lanka face a high-stakes Super 4 clash in the Asia Cup on September 23, where a win keeps their campaign alive and a loss could end it. Both teams need to address key issues after losses to India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-misses-india-a-vs-australia-a-second-unofficial-test-dhruv-jurel-captain-2791712-2025-09-23",
      "headline": "Shreyas Iyer ruled out of 2nd unofficial Test, Dhruv Jurel to lead India AShreyas Iyer has withdrawn from the second unofficial Test against Australia A in Lucknow. Wicketkeeper Dhruv Jurel will lead India A, stepping into the captaincy after his century in the opening game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-joins-surrey-county-championship-final-vs-hampshire-washington-sundar-2791704-2025-09-23",
      "headline": "Rahul Chahar joins Surrey for County Championship finale against HampshireIndian spinner Rahul Chahar has joined Surrey for their decisive County Championship clash against Hampshire. His late inclusion bolsters Surrey's depleted spin department as they chase a fourth successive domestic title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-d-or-full-list-of-winners-2791688-2025-09-23",
      "headline": "Ballon d'Or 2025: Full list of winners in ParisOusmane Dembele and Aitana Bonmati were named the best players at the 2025 Ballon d'Or ceremony in Paris. Here are the full list of winners from the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-president-sourav-ganguly-2791671-2025-09-22",
      "headline": "Sourav Ganguly returns as CAB president after 6 years, replaces brotherFormer India captain Sourav Ganguly was re-elected as president of the Cricket Association of Bengal (CAB) on Monday, marking his return after a six-year gap. He replaced his brother Snehashish."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-misses-india-a-vs-australia-a-second-unofficial-test-dhruv-jurel-captain-2791712-2025-09-23",
      "headline": "Shreyas Iyer ruled out of 2nd unofficial Test, Dhruv Jurel to lead India AShreyas Iyer has withdrawn from the second unofficial Test against Australia A in Lucknow. Wicketkeeper Dhruv Jurel will lead India A, stepping into the captaincy after his century in the opening game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-joins-surrey-county-championship-final-vs-hampshire-washington-sundar-2791704-2025-09-23",
      "headline": "Rahul Chahar joins Surrey for County Championship finale against HampshireIndian spinner Rahul Chahar has joined Surrey for their decisive County Championship clash against Hampshire. His late inclusion bolsters Surrey's depleted spin department as they chase a fourth successive domestic title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-d-or-full-list-of-winners-2791688-2025-09-23",
      "headline": "Ballon d'Or 2025: Full list of winners in ParisOusmane Dembele and Aitana Bonmati were named the best players at the 2025 Ballon d'Or ceremony in Paris. Here are the full list of winners from the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psgs-ousmane-dembele-ballon-dor-lamine-yamal-2791684-2025-09-23",
      "headline": "PSG's Ousmane Dembele beats Lamine Yamal to win his first Ballon d'Or trophyParis Saint-Germain's Ousmane Dembele lifted his first Ballon d'Or award on Monday, September 22 in Paris. The Champions League winner beat Barcelona's Lamine Yamal to finally deliver on the promise of his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-president-sourav-ganguly-2791671-2025-09-22",
      "headline": "Sourav Ganguly returns as CAB president after 6 years, replaces brotherFormer India captain Sourav Ganguly was re-elected as president of the Cricket Association of Bengal (CAB) on Monday, marking his return after a six-year gap. He replaced his brother Snehashish."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}