{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/look-rich-or-be-rich-startup-founder-on-middle-class-dilemma-2748370-2025-06-30",
      "headline": "Look rich or be rich: Startup founder on middle class dilemmaToday, many people in the middle class are busy trying to look rich, rather than actually becoming rich. Costly gadgets, fancy brunches and trendy holidays are often paid for with loans and EMIs, says founder and CEO, Shyam Achuthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8-years-of-gst-top-5-achievements-you-should-know-2748325-2025-06-30",
      "headline": "8 years of GST: Top 5 achievements you should knowSince its launch, GST has strengthened India's revenue and expanded the taxpayer base, with collections reaching a record Rs 22.08 lakh crore in 2024–25, as per PIB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-defends-diljit-dosanjh-sardaar-ji-3-row-no-role-in-casting-pakiatni-actor-hania-aamir-2748407-2025-06-30",
      "headline": "Naseeruddin Shah backs Diljit, slams political attacks: He had no role in castingVeteran actor Naseeruddin Shah shared a post and backed Diljit Dosanjh amid the 'Sardaar Ji 3' controversy. The actor stated how such acts hamper personal interactions between the people of India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-calls-saif-ali-khan-iron-man-for-sons-jeh-taimur-coping-with-stabbing-attack-2748333-2025-06-30",
      "headline": "Kareena calls Saif Iron Man for sons, says she's still coping with knife attackKareena Kapoor opened up about Saif Ali Khan's stabbing incident, sharing that she's still coming to terms with it. She revealed how the attack exposed the harsh realities of the world to their children.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rashmika-mandanna-says-she-will-never-smoke-on-screen-will-let-the-film-go-2748304-2025-06-30",
      "headline": "Rashmika Mandanna says she will never smoke on-screen: Will let the film goDuring a recent interview, Rashmika Mandanna opened up about her opinion on smoking on-screen, stating that she would rather walk away from a film than agree to smoke on-screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-salman-khan-shah-rukh-khan-drinking-parties-all-night-interview-lallantop-2748367-2025-06-30",
      "headline": "Aamir Khan often drinks with Salman-SRK all night, and they never stop at oneAamir Khan discussed his close friendship with Shah Rukh Khan and Salman Khan, including their late-night gatherings. He shared how his friendships with the two superstars grew over the years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hansal-mehta-and-karan-johar-review-brad-pitt-film-f1-2748351-2025-06-30",
      "headline": "Same drug, different packaging: Hansal Mehta, KJo review Brad Pitt's F1Filmmakers Karan Johar and Hansal Mehta reviewed Brad Pitt's film 'F1', saying it's full of cliches but still very entertaining. They praised the racing scenes and Brad Pitt's performance, calling the film a fun watch despite its predictable story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-leaked-online-vishnu-manchu-claims-30000-pirated-links-taken-down-2748338-2025-06-30",
      "headline": "Kannappa leaked online: Vishnu Manchu claims 30,000 pirated links taken downAfter a solid opening weekend at the box office, Vishnu Manchu's 'Kannappa' faced a major setback with widespread piracy leaks. The actor has publicly urged fans to reject pirated versions and support cinema through legal means."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanvi-the-great-trailer-shubhangi-impressive-debut-story-of-hope-grit-2748317-2025-06-30",
      "headline": "Tanvi The Great trailer: Shubhangi debuts in Anupam Kher's film about hope and gritThe trailer of 'Tanvi The Great' introduces Shubhangi as an autistic girl who dreams of joining the Indian Army. The story explores her inspiring journey of hope, determination, and acceptance amid societal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-silambarasan-49th-film-sequel-to-dhanush-vada-chennai-vetri-maaran-clarifies-2748337-2025-06-30",
      "headline": "Is Silambarasan's 49th film a sequel to Dhanush's Vada Chennai? Vetri Maaran clarifiesSilambarasan's upcoming film 'STR49' is confirmed to be a distinct project set in the same universe as 'Vada Chennai', but not its sequel, according to director Vetri Maaran. He also opened up about his close bond with actor Dhanush. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-ateez-calls-golden-hour-era-bold-and-playful-message-to-indian-atinys-2748200-2025-06-30",
      "headline": "Exclusive: ATEEZ calls GOLDEN HOUR era 'bold and playful'; message to Indian ATINYsK-pop sensation ATEEZ continues to break new ground with their historic Billboard entry and evolving artistry. Their latest album, GOLDEN HOUR : Part.3, showcases maturity and creativity, while they acknowledge the love they receive from Indian ATINYs. Read the full exclusive interview with ATEEZ. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/charlize-therone-slams-jeff-bezos-lauren-sanchez-wedding-2748247-2025-06-30",
      "headline": "Charlize Theron roasts Bezos-Sanchez's lavish wedding: They suck and we're coolActor Charlize Theron slammed the guests who attended Jeff Bezos and Lauren Sanchez's wedding. The wedding is estimated to have cost $50 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-batman-2-makers-finally-finish-script-2748316-2025-06-30",
      "headline": "The Batman 2 makers finally finish script, share update on Robert Pattinson's filmThree years after 'The Batman' premiered in cinemas, director Matt Reeves and screenwriter Mattson Tomlin have now officially completed the script. The sequel is one step closer to moving into production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anti-ageing-skin-glow-medicines-found-at-shefali-jariwalas-house-police-2748292-2025-06-30",
      "headline": "Shefali Jariwala's death probe: Anti-ageing, skin glow medicines, fasting in focusShefali Jariwala was found dead at her residence on June 27. The police officials collected anti-ageing and skin-glow medicines from her place during their investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-teaser-prithviraj-sukumaran-ibrahim-ali-khan-fight-terrorism-in-kashmir-2748269-2025-06-30",
      "headline": "Sarzameen teaser: Ibrahim plays terrorist, Prithviraj a soldier in high-stakes dramaPrithviraj Sukumaran, Kajol and Ibrahim Ali Khan's upcoming film 'Sarzameen' is officially announced by JioHoistar. The movie will stream from July 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-label-hybe-is-coming-to-india-new-subsidiary-to-open-in-second-half-of-2025-2748263-2025-06-30",
      "headline": "BTS' label HYBE is coming to India: New subsidiary to open in second half of 2025HYBE is setting up a subsidiary in India by 2025 to tap into the country's vibrant music market and digitally savvy youth. This strategic expansion seeks to blend K-pop's global success formula with India's rich cultural diversity, potentially transforming the local music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukones-old-interview-demanding-work-life-balance-surfaces-amid-sandeep-reddy-vanga-row-2748239-2025-06-30",
      "headline": "Deepika Padukone's old interview demanding work-life balance surfaces amid Vanga rowActor Deepika Padukone had been advocating for work-life balance long before she walked out of filmmaker Sandeep Reddy Vanga's upcoming film 'Spirit.' An old interview of the actor has resurfaced, in which she spoke about the importance of fixed working hours for a film's cast and crew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-celebrates-25-years-in-industry-with-refugee-posters-2748249-2025-06-30",
      "headline": "Forever to go: Kareena Kapoor celebrates 25 years in industry with Refugee postersKareena Kapoor Khan celebrated 25 years in Bollywood, marking a journey of versatility and enduring stardom. She shared nostalgic posters from her debut film 'Refugee' as fans and celebrities joined in the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/vishnu-manchu-admits-poor-vfx-kannappa-reacts-to-criticism-2748188-2025-06-30",
      "headline": "Vishnu Manchu admits to poor VFX in Kannappa, reacts to criticismActor Vishnu Manchu recently addressed the criticism over his latest release 'Kannappa'. He talked about the production challenges, and shared that he had to remove a few scenes due to poor VFX."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-25-years-refugee-premiere-with-kareena-kapoor-locked-in-projector-room-2748231-2025-06-30",
      "headline": "When Abhishek, Kareena were locked in projector room during Refugee premiereAs 'Refugee' completes 25 years, Abhishek Bachchan reflects on his debut and shares a memorable incident where he and Kareena Kapoor had to hide in a theatre projector room due to excited fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-amar-upadhyay-kyunki-saas-bhi-bahu-thi-2-premiere-postponed-2748230-2025-06-30",
      "headline": "Smriti Irani, Amar Upadhyay's Kyunki Saas Bhi...2 premiere postponed. Here's whyActors Smriti Irani and Amar Upadhyay's 'Kyunki Saas Bhi Kabhi Bahu Thi 2' premiere has been postponed. Upadhayay confirmed the development and shared the reason behind the delay. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejasvi-surya-takes-dig-at-mallikarjun-kharges-high-command-comment-calling-it-unseen-unheard-ghost-2748364-2025-06-30",
      "headline": "Who's the high command, if not Congress chief? BJP trolls Mallikarjun KhargeCongress president Mallikarjun Kharge told the media that the question of changing Karnataka Chief Minister can only be answered by the party high command. BJP MP Tejasvi Surya asks who exactly is this 'high command'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-pakistan-bangladesh-meeting-regional-seeks-replace-saarc-multilateral-organisation-india-south-asia-afghanistan-kunming-2748301-2025-06-30",
      "headline": "To counter India, China, Pakistan and Bangladesh creating a Saarc-replacementChina, Pakistan and Bangladesh have formed a nexus and are trying to create a regional grouping to replace Saarc, which includes India as a member. The three plan to get other South Asian nations to become part of the grouping. Saarc activities came to a halt after India boycotted the summit in Pakistan over the Uri terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-woman-raped-beaten-over-rs-35000-family-loan-fazar-ali-bnp-leader-2748355-2025-06-30",
      "headline": "Bangladesh Hindu woman raped, beaten over Rs 35,000 family loan: ReportThe loan repayment date had passed, prompting Fazar Ali to visit the family. At that time, neither the survivor's brothers nor her parents were present. As she refused to answer the door, Fazar broke it open, stripped her naked, beat and raped her, according to the survivor and her brother's accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-us-iran-strikes-india-accelerates-bunker-buster-missile-project-2748410-2025-06-30",
      "headline": "After US's Iran strikes, India accelerates bunker buster missile projectThe Defence Research and Development Organisation (DRDO) is developing a modified version of the Agni-5 intercontinental ballistic missile. The new variant will be a conventional weapon capable of carrying a massive 7500-kilogram bunker-buster warhead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-one-big-beautiful-bill-slashes-remittance-tax-to-1-percent-big-relief-for-nri-indians-tech-workers-2748320-2025-06-30",
      "headline": "Indians to benefit as Trump's Big Beautiful Bill reduces remittance tax to 1%US President Donald Trump's flagship One Big Beautiful Bill Act, which passed a key Senate hurdle, cut remittance tax to 1%, from the proposed 5%. The high rate sparked widespread concern among Indian professionals in the US. The reduced tax rate will be a big relief for them and the NRIs who send money home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-rape-accused-stalked-victim-from-first-day-of-college-plot-pre-planned-2748398-2025-06-30",
      "headline": "Kolkata rape accused stalked victim from first day of college, plot pre-plannedUpon investigation, the police found that the trio had recorded several instances of harassing women on their mobile phones, which they later used as ammunition to blackmail them. 'The trio had been plotting for several days to carry out this torture on the victim,' said police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/old-is-gold-bjp-elevates-veterans-in-telangana-and-andhra-2748354-2025-06-30",
      "headline": "Old is gold: BJP elevates veterans in Telangana and AndhraIn Telangana, N Ramchander Rao, an old-timer in the state's BJP unit, returned to the spotlight. PVN Madhav, a second-generation BJP leader with strong ties to the RSS, replaced D Purandeswari in Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anti-ageing-skin-glow-medicines-found-at-shefali-jariwalas-house-police-2748292-2025-06-30",
      "headline": "Shefali Jariwala's death probe: Anti-ageing, skin glow medicines, fasting in focusShefali Jariwala was found dead at her residence on June 27. The police officials collected anti-ageing and skin-glow medicines from her place during their investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/anti-ageing-treatments-risks-shefali-jariwala-death-highlights-dangers-of-iv-glutathione-and-botox-in-india-2748361-2025-06-30",
      "headline": "The anti-ageing trap: Inside the unregulated world of longevity medicationsActor Shefali Jariwala's sudden death has put a spotlight on the anti-ageing industry in India. Doctors warn about serious health risks while chasing popular but unregulated procedures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-updates-aryna-sabalenka-carlos-alcaraz-daniil-medvedev-2748366-2025-06-30",
      "headline": "Day 1 Live Updates: Medvedev, Ostapenko to kick off proceedingsWimbledon 2025 Day 1 Live Updates: Daniil Medvedev and Jelena Ostapenko will start proceedings in the opening round. Later in the day, Carlos Alcaraz and Aryna Sabalenka will be in action. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-mayor-candidate-zohran-mamdani-says-billionaires-should-not-exist-2748377-2025-06-30",
      "headline": "Do billionaires have a right to exist? Zohran Mamdani's replyZohran Mamdani emphasised the need for greater equality across the city, state, and country while expressing willingness to work with all residents, including billionaires, to create a fairer society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zohran-mamdani-eating-with-hands-viral-video-us-politician-go-back-to-third-world-remark-2748328-2025-06-30",
      "headline": "Go back to Third World: US politician on Zohran Mamdani's eating with hands videoA video of Zohran Mamdani eating with his hands during an interview has sparked debate online. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/10-killed-after-a-fire-broke-out-following-a-reactor-explosion-at-chemical-factory-in-telangana-2748291-2025-06-30",
      "headline": "12 dead, several injured after reactor explodes at Telangana chemical factoryAn explosion at Telangana chemical factory blast killed at least 12 workers and injured several others, prompting a major rescue effort and orders for relief from Chief Minister Revanth Reddy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-case-accused-admitted-to-law-college-despite-low-rank-alleges-bjp-2748225-2025-06-30",
      "headline": "Who gave him seat? BJP flags rape-accused student's low rank, targets TrinamoolMalviya alleged that Zaib Ahmed was admitted to South Calcutta Law College despite securing a \"dismal\" rank of 2634 in the Calcutta University Law Entrance Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/cm-pinarayi-vijayan-writes-to-governor-arlekar-over-unconstitutional-rss-linked-bharat-mata-image-at-raj-bhavan-2748341-2025-06-30",
      "headline": "Pinarayi Vijayan calls 'Bharat Mata' image unconstitutional, writes to GovernorKerala Chief Minister Pinarayi Vijayan wrote to Governor Rajendra Arlekar, objecting to using images like 'Bharat Mata' with an RSS flag at official events. Minister Sivankutty had boycotted a Raj Bhavan event over it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/2025-mercedes-amg-gt-63-4matic-first-look-mercedes-gt-sportscar-mercedes-amg-gt-2748356-2025-06-30",
      "headline": "2025 Mercedes-AMG GT 63 4MATIC+ First LookWe got a chance to get up close with the new second-gen Mercedes-AMG GT, in its 63 avatar that can now be purchased in India"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-is-foreign-word-ambedkar-university-vice-chancellor-on-using-bharatiya-in-curriculum-2748365-2025-06-30",
      "headline": "India is foreign word: Ambedkar University VC on using 'Bharatiya' in curriculumAsserting its cultural identity and academic autonomy, the university's choice of terminology reflects a deeper philosophical and historical consciousness, according to Anu Singh Lather."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-madurai-bench-slams-police-over-tamil-nadu-ajit-kumar-custodial-death-case-2748353-2025-06-30",
      "headline": "Was he terrorist, Madras High Court asks Tamil Nadu police over custodial deathTaking note of a custodial death case in Tamil Nadu's Sivagangai district on its own, the Madras High Court asked the police why the victim was treated violently. \"Was he a terrorist to deserve this,\" the court asked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-murdered-by-live-in-partner-body-dumped-20-km-away-accused-nabbed-within-20-hours-2748251-2025-06-30",
      "headline": "Live-in partner killed Bengaluru woman, took body on bike to dump in garbage truckThe Bengaluru police reportedly solved a murder case where a woman's body was found in a garbage truck. According to the police, the woman's live-in partner killed her and then dumped her body in a garbage truck to get rid of the evidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-salman-khan-shah-rukh-khan-drinking-parties-all-night-interview-lallantop-2748367-2025-06-30",
      "headline": "Aamir Khan often drinks with Salman-SRK all night, and they never stop at oneAamir Khan discussed his close friendship with Shah Rukh Khan and Salman Khan, including their late-night gatherings. He shared how his friendships with the two superstars grew over the years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-tourist-pahalgam-tourist-attacked-maharashtra-bail-sick-mentality-anantnag-court-bail-2748327-2025-06-30",
      "headline": "'Treated so shockingly': 70-year-old tourist gagged, raped in Pahalgam hotelA 70-year-old woman tourist was raped in Jammu and Kashmir's Pahalgam as a reflection of moral decay that threatens the region's cultural integrity and reputation as a tourist destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-constitution-assembly-did-not-include-term-secular-rss-preamble-indira-gandhi-emergency-2747289-2025-06-30",
      "headline": "Why framers of India's Constitution didn't include secular in itAs the 50th anniversary of the Emergency rekindles debate over secularism, it is worth recalling that the framers of the Constitution debated and decided against the inclusion of the term 'secular' in it. Here's why the Constituent Assembly decided not to use 'secular' to define the nature of the State."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-mlc-texas-super-kings-vs-mi-new-york-world-record-2748383-2025-06-30",
      "headline": "Faf du Plessis scripts world record with second hundred after turning 40Faf du Plessis became the first T20 batter to score more then one hundred after turning 40. His stellar form helped Texas Super Kings defeat MI New York in a crunch Major League Cricket match in Dallas on Sunday, June 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/f1-australia-vs-west-indies-steve-smith-injury-update-2748376-2025-06-30",
      "headline": "Batting cage and tennis balls: Steve Smith fast tracks recovery before 2nd TestSteve Smith revealed that he trained in a New York baseball cage while recovering from his finger injury. Smith is in the running for a return in the 2nd Test match against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-updates-aryna-sabalenka-carlos-alcaraz-daniil-medvedev-2748366-2025-06-30",
      "headline": "Day 1 Live Updates: Medvedev, Ostapenko to kick off proceedingsWimbledon 2025 Day 1 Live Updates: Daniil Medvedev and Jelena Ostapenko will start proceedings in the opening round. Later in the day, Carlos Alcaraz and Aryna Sabalenka will be in action. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-luke-williams-southern-brave-hundred-women-coach-2748326-2025-06-30",
      "headline": "RCB head coach joins Southern Brave for Hundred Women's 2025Southern Brave have roped in Luke Williams as their head coach and Marcus Trescothick as their batting coach for the 2025 edition of the Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmood-red-ball-head-coach-2748265-2025-06-30",
      "headline": "Pakistan appoint former all-rounder as 'acting coach' for Test teamPakistan have appointed former all-rounder Azhar Mahmood as their acting red-ball head coach. Pakistan finished at the bottom in the 2023-25 edition of the World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-prepares-england-test-pietersen-guidance-dual-spin-2748221-2025-06-30",
      "headline": "Armed with English wisdom, Kuldeep makes bold promise ahead of Test comebackEngland vs India: Spinner Kuldeep Yadav recalled his experience of learning from Kevin Pietersen about the nuances of bowling in England. The wrist-spinner might make his way into the XI for the second Test, starting July 02 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-india-birmingham-record-2748226-2025-06-30",
      "headline": "Can India make a comeback in Birmingham?  Here's what history suggestsENG vs IND: Shubman Gill's India are looking to make a comeback in the five-match Test series after losing the opening Test at Headingley in Leeds by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmood-red-ball-head-coach-2748265-2025-06-30",
      "headline": "Pakistan appoint former all-rounder as 'acting coach' for Test teamPakistan have appointed former all-rounder Azhar Mahmood as their acting red-ball head coach. Pakistan finished at the bottom in the 2023-25 edition of the World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-prepares-england-test-pietersen-guidance-dual-spin-2748221-2025-06-30",
      "headline": "Armed with English wisdom, Kuldeep makes bold promise ahead of Test comebackEngland vs India: Spinner Kuldeep Yadav recalled his experience of learning from Kevin Pietersen about the nuances of bowling in England. The wrist-spinner might make his way into the XI for the second Test, starting July 02 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-india-birmingham-record-2748226-2025-06-30",
      "headline": "Can India make a comeback in Birmingham?  Here's what history suggestsENG vs IND: Shubman Gill's India are looking to make a comeback in the five-match Test series after losing the opening Test at Headingley in Leeds by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}