{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-baba-siddique-salman-khan-responsibility-2616117-2024-10-13",
      "headline": "Lawrence Bishnoi gang claims Baba Siddique murder, sends Salman Khan a message Live UpdatesThe Lawrence Bishnoi gang claimed responsibility for killing NCP leader Baba Siddique. In a Facebook post, a gang member claimed Siddique's ties to Bollywood actor Salman Khan led to his murder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-death-accused-lawrence-bishnoi-gang-gurmail-singh-dharmaraj-rajesh-kashyap-2616155-2024-10-13",
      "headline": "Baba Siddique murder accused's families claim no contact, one was out on bail Two accused--Gurmail Baljit Singh and Dharmaraj Rajesh Kashyap--have been arrested for the murder of NCP leader Baba Siddique, while the third one--Shiv Kumar--is on the run. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-lawrence-bishnoi-gang-responsibility-jail-phone-faster-salman-khan-2616134-2024-10-13",
      "headline": "Exclusive: Lawrence Bishnoi's video call from jail with Pak gangster resurfacesLawrence Bishnoi, lodged in Sabarmati Central Jail in Ahmedabad, has been on a silent fast for the past nine days. It is believed that the gangster observes this silent fast whenever his gang commits a major crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/antonio-guterres-israel-ban-letter-condemnation-india-abstains-p-chidambaram-2616119-2024-10-13",
      "headline": "Inexplicable: Chidambaram as India refuses to condemn Israel's ban on UN chiefCongress leader P Chidambaram said India broke ranks with BRICS partners and allies by not signing the letter condemning Israel's decision to ban UN Secretary General Antonio Guterres from entering the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/october-heat-like-summer-humidity-resulting-in-fever-cough-flu-delhi-lucknow-kolkata-hospital-monsoon-heatwave-2615111-2024-10-13",
      "headline": "Sweating and sneezing: How October heat is fuelling a health crisis in IndiaEarlier, October marked the transition between seasons, and was a month of mild weather and festivities. However, a rise in global temperatures and a shift in weather patterns have given rise to October heat. And October heat has become a serious health risk, with hospitals in several cities flooded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-cancels-meetings-family-requests-privacy-baba-siddique-death-killing-lawrence-bishnoi-2616144-2024-10-13",
      "headline": "Salman Khan cancels meetings, family requests privacy after Baba Siddique's deathActor Salman Khan, who has been affected by NCP leader Baba Siddique's death, cancelled all his meetings. The actor's family has requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-recalls-gautam-gambhirs-old-tweet-on-sanju-samson-best-young-batter-in-india-2616150-2024-10-13",
      "headline": "Chopra recalls Gambhir's old tweet on Samson: Best young batter in IndiaFormer cricketer Aakash Chopra believes that Gautam Gambhir is a big fan of Sanju Samson. Chopra reminded fans of an old tweet from the Indian head coach's account.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mallikarjun-kharge-returns-land-allotted-by-karnataka-amid-muda-scam-probe-2616149-2024-10-13",
      "headline": "Mallikarjun Kharge returns land allotted by Karnataka amid Muda 'scam' probeThe controversy began in March 2024, when the Karnataka Congress government granted land to the Siddhartha Vihar Trust, headed by Rahul Kharge. The BJP was quick to criticise the allotment, accusing the government of \"misuse of power\" and \"nepotism\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/man-thrashed-hockey-sticks-group-miscreants-kolkata-sskm-hospital-2616159-2024-10-13",
      "headline": "Man thrashed with hockey sticks at Kolkata hospital, left bloodiedHospital sources said Sourav Modak is currently undergoing treatment in critical condition. He sustained serious injuries to his head, face, legs, and wrists, and several bones in his arms and legs were broken."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-killing-accused-found-hiding-bushes-before-arrest-video-gunshot-shot-dead-2616118-2024-10-13",
      "headline": "Video: Baba Siddique murder accused found hiding in bushes before arrestBaba Siddique was shot dead while leaving his office for his residence in Bandra West on Saturday night. A total of six rounds of bullets were fired at Baba Siddique, three of which hit him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-bypolls-by-election-key-bjp-meet-today-delhi-decision-on-seat-sharing-allies-likely-2616100-2024-10-13",
      "headline": "UP bypolls: Key BJP meet today in Delhi, decision on seat-sharing likelyThere is speculation that discussions in the meeting will focus on which seats will be allotted to the BJP's allies. Sources suggest that while the BJP is ready to leave the Mirapur seat for its ally, the RLD, it remains unwilling to concede the Khair seat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/baba-siddique-killed-ritiesh-deshmukh-to-saqib-saleem-celebs-mourn-his-death-2616120-2024-10-13",
      "headline": "Baba Siddique killed: Riteish Deshmukh to Saqib Saleem, celebs mourn his deathNCP leader and former Maharashtra minister Baba Siddique was killed on Saturday, October 12. Celebrities including Riteish Deshmukh, Saqib Saleem, Raj Kundra and others mourned his death. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-hundred-india-vs-bangladesh-hyderabad-t20i-2616075-2024-10-13",
      "headline": "Sanju Samson 3.0 Unlocked? Making sense of his Hyderabad T20I heroicsIndia vs Bangladesh: Is Hyderabad T20I going to be remembered as a significant turning point in Sanju Samson's career? Having been an enigma in the T20I format, Samson finally arrived at the party, repaying the faith that the new team management showed in him. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/video/jaipur-driverless-car-engulfed-flames-descends-ajmer-bridge-road-sparks-panic-2616109-2024-10-13",
      "headline": "Watch: Driverless car engulfed in flames descends on Jaipur roadA video has emerged from Jaipur, showing a burning running down the roads. Preliminary investigations suggest that a short circuit was the cause of the fire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-shot-dead-2013-iftar-party-shah-rukh-khan-salman-khan-feud-end-hug-2616051-2024-10-13",
      "headline": "Baba Siddique's iftar and SRK-Salman patch-up: It was Allah, I had no roleBaba Siddique was known for his close ties with Bollywood's biggest stars, including Shah Rukh Khan and Salman Khan. He played a pivotal role in ending the Khans' five-year-long feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/starships-5th-flight-today-spacex-aims-to-catch-a-building-sized-rocket-2616123-2024-10-13",
      "headline": "Starship to launch today: SpaceX to catch a building-sized rocketThis test flight aims to push the boundaries of rocket technology with an ambitious manoeuvre never before attempted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-entertainment-sports-425-11-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-lebanon-attack-beirut-hezbollah-netanyahu-middle-east-war-iran-gaza-2616067-2024-10-13",
      "headline": "Ground Report: Displaced Lebanese see no end to conflict amid Israeli bombingLebanese citizens, internally displaced and now living in relief camps, do not see a swift end to the Israel-Hezbollah war. India Today reports from South Beirut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/jd-vance-catholic-wife-usha-vance-hindu-attends-mass-every-sunday-church-spiritual-journey-2616097-2024-10-13",
      "headline": "JD Vance 'feels bad' about taking wife Usha to church: She didn't sign up to...Donald Trump's running mate JD Vance said his Hindu wife Usha, who was raised in a religious household and has not converted to Catholicism herself, attends Mass with him every Sunday after he became a Catholic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/should-you-boil-the-milk-you-get-in-a-packet-2615115-2024-10-13",
      "headline": "Should you boil the milk you get in a packet?When a packet of milk arrives at your home, do you immediately boil it? Find out from experts whether this is a healthy practice or if it compromises milk's nutritional value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lpg-cylinder-found-railway-track-roorkee-another-train-derailment-bid-landaura-dhandhera-station-northern-railways-2616089-2024-10-13",
      "headline": "LPG cylinder found on railway track in Roorkee in another train derailment bidThe Northern Railway's Chief Public Relations Officer (CPRO), Himanshu Upadhyay, stated that the incident occurred at 6:35 am between Landaura and Dhandhera stations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gn-saibaba-former-delhi-university-professor-dies-health-issues-gall-bladder-infection-maoist-link-case-2616049-2024-10-13",
      "headline": "Former Delhi University professor GN Saibaba dies at 54 GN Saibaba, a former Delhi University professor, died at a state-run hospital on Saturday due to post-operative complications. The 57-year-old's death comes seven months after his acquittal in a case involving alleged Maoist links."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shiv-sena-dussehra-rallies-eknath-shinde-uddhav-thackeray-shivaji-statue-maharashtra-election-dharavi-2616024-2024-10-13",
      "headline": "Polls, Shivaji, Dharavi take centrestage in Sena vs Sena Dussehra showdownWith the Maharashtra Assembly election around the corner, Eknath Shinde and Uddhav Thackeray focused their attacks on developmental issues while also trying to play the emotional \"who is real Shiv Sena\" card."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-celebrates-goat-success-with-producer-archana-kalpathi-2616173-2024-10-13",
      "headline": "Thalapathy Vijay celebrates GOAT success with producer Archana Kalpathi Actor Thalapathy Vijay celebrated the success of his film GOAT, which earned Rs 100 crore in Tamil Nadu. The film was directed by Venkat Prabhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/sanjay-dutt-zaheer-iqbal-celebs-visit-hospital-after-baba-siddiques-death-2616146-2024-10-13",
      "headline": "Sanjay Dutt, Zaheer Iqbal, celebs visit hospital after Baba Siddique's deathAfter NCP leader Baba Siddique was shot dead on October 12, several celebrities, including Sanjay Dutt, his sister Priya Dutt, Veer Pahariya, and Zaheer Iqbal, visited Lilavati Hospital in Mumbai on Saturday night. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-cancels-meetings-family-requests-privacy-baba-siddique-death-killing-lawrence-bishnoi-2616144-2024-10-13",
      "headline": "Salman Khan cancels meetings, family requests privacy after Baba Siddique's deathActor Salman Khan, who has been affected by NCP leader Baba Siddique's death, cancelled all his meetings. The actor's family has requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/smriti-irani-jaya-bhattacharya-tusli-payal-kyunki-saas-bhi-kabhi-bahu-thi-reunite-dussehra-ektaa-kapoor-2616138-2024-10-13",
      "headline": "Smriti Irani reunites with Kyunki... co-star Jaya for Dussehra, Ektaa Kapoor reactsKyunki Saas Bhi Kabhi Bahu Thi actors Smriti Irani and Jaya Bhattacharya reunited on Dussehra 2024 to extend their wishes to fans. Smriti shared a picture of the two on social media, which was met with love and admiration from their followers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-tesla-humanoid-optimus-says-hardest-part-of-being-a-robot-is-trying-to-be-human-2615330-2024-10-11",
      "headline": "Elon Musk's Tesla humanoid Optimus reveals hardest part of being a robotElon Musk unveiled the latest generation of Tesla's humanoid Optimus at the We, Robot event. While according to Musk, the robots can now do anything, Optimus reveals that the hardest part of being a robot is learning how to be human. Read on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/star-health-insurance-hack-led-to-personal-data-of-31-million-customers-being-compromised-story-in-5-points-2615354-2024-10-11",
      "headline": "Star Health hack led to data leak of 31 million customers: Story in 5 pointsIndia's popular health insurers, Star Health insurance, faced a massive data leak this week, which may have led to the data of 31 million customers being compromised. Here is everything that has happened in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/how-to-get-new-siri-with-apple-intelligence-in-india-first-look-at-ios-181-more-features-2615301-2024-10-11",
      "headline": "How to get new Siri with Apple Intelligence in India? First look at iOS 18.1 & more featuresApple has released the latest developer Beta for iOS 18.1, showcasing some new features like the new Siri, Writing Tools and more. Watch the video to know more. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lee-carsley-does-not-want-england-manager-permanent-basis-2616163-2024-10-13",
      "headline": "Interim manager Carsley says he has not formally applied for England jobInterim England manager Lee Carsley has confirmed that he does not seek the role of permanent head coach, despite his ongoing success with the team during his temporary tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-recalls-gautam-gambhirs-old-tweet-on-sanju-samson-best-young-batter-in-india-2616150-2024-10-13",
      "headline": "Chopra recalls Gambhir's old tweet on Samson: Best young batter in IndiaFormer cricketer Aakash Chopra believes that Gautam Gambhir is a big fan of Sanju Samson. Chopra reminded fans of an old tweet from the Indian head coach's account.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-fielder-of-the-series-award-washington-sundar-hardik-pandya-2616148-2024-10-13",
      "headline": "Washington Sundar pips Hardik Pandya to win fielder's medal in Bangladesh T20IsIndian all-rounder Washington Sundar pipped Hardik Pandya for the Impact Fielder of the series award in their 3-T20I outing against Bangladesh, Washington beat Hardik and Riyan Parag to clinch the medal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-table-tennis-championships-india-three-medals-women-doubles-bronze-2616143-2024-10-13",
      "headline": "Asian TT Championships: India win three medals, including women's doubles bronzeIndia's table tennis team concluded their campaign at the Asian Championships with three medals. The women's doubles team made history by securing a bronze, marking India's first-ever medal in this category at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-failed-to-bat-bowl-or-field-well-vs-india-towhid-hridoy-2616124-2024-10-13",
      "headline": "Bangladesh failed to bat, bowl or field well: Hridoy on 3-0 series loss to IndiaTowhid Hridoy acknowledged Bangladesh's shortcomings across all departments but emphasized the need for more experience on flat, high-scoring pitches to sharpen their skills and improve performances in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-pak-vs-england-test-series-pcb-meeting-babar-azam-dropped-2616125-2024-10-13",
      "headline": "Big changes on cards? Pakistan board top brass meets after England lossThe Pakistan Cricket Board top brass met for a 2-hour-long meeting after the team's horror loss against England in the 1st Test match. PCB chairman Mohsin Naqvi not only reviewed the recent performances from players but also instructed to make better pitches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-test-spot-uncertain-coach-gary-stead-2616112-2024-10-13",
      "headline": "Will Southee lose his spot in New Zealand side on India tour? Coach Stead reactsFormer New Zealand captain Tim Southee's position in the Test squad is under scrutiny as the team prepares for their series against India. With Southee stepping down as captain, New Zealand considers new options for their bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-emotional-hundred-celebration-captain-suryakumar-yadav-2616098-2024-10-13",
      "headline": "Watch: Samson decodes emotional hundred celebration with captain SuryakumarIndia vs Bangladesh: Sanju Samson, in a post-match interview with Suryakumar Yadav, shared insights into his emotional celebration after scoring his maiden T20I century against Bangladesh in Hyderabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/was-doubtful-if-i-would-play-again-after-2-ducks-vs-sri-lanka-sanju-samson-2616094-2024-10-13",
      "headline": "Was doubtful if I would play again after 2 ducks vs Sri Lanka: Sanju SamsonIndia's centurion in the 3rd T20I vs Bangladesh - Sanju Samson - has said that he doubted he would play against India after his successive failures in Sri Lanka. Sanju credited Suryakumar Yadav and Gautam Gambhir for backing him and giving him continued chances in the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-suryakumar-yadav-ravi-bishnoi-2616091-2024-10-13",
      "headline": "Suryakumar Yadav told us India were defending 170, not 300: Ravi BishnoiIndia spinner Ravi Bishnoi picked 3 wickets in India's terrific win over Bangladesh on Saturday, October 12. Bishnoi spoke about the team's mentality with the ball where India restricted Bangladesh to just 164 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-pak-vs-england-test-series-pcb-meeting-babar-azam-dropped-2616125-2024-10-13",
      "headline": "Big changes on cards? Pakistan board top brass meets after England lossThe Pakistan Cricket Board top brass met for a 2-hour-long meeting after the team's horror loss against England in the 1st Test match. PCB chairman Mohsin Naqvi not only reviewed the recent performances from players but also instructed to make better pitches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-test-spot-uncertain-coach-gary-stead-2616112-2024-10-13",
      "headline": "Will Southee lose his spot in New Zealand side on India tour? Coach Stead reactsFormer New Zealand captain Tim Southee's position in the Test squad is under scrutiny as the team prepares for their series against India. With Southee stepping down as captain, New Zealand considers new options for their bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-emotional-hundred-celebration-captain-suryakumar-yadav-2616098-2024-10-13",
      "headline": "Watch: Samson decodes emotional hundred celebration with captain SuryakumarIndia vs Bangladesh: Sanju Samson, in a post-match interview with Suryakumar Yadav, shared insights into his emotional celebration after scoring his maiden T20I century against Bangladesh in Hyderabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/was-doubtful-if-i-would-play-again-after-2-ducks-vs-sri-lanka-sanju-samson-2616094-2024-10-13",
      "headline": "Was doubtful if I would play again after 2 ducks vs Sri Lanka: Sanju SamsonIndia's centurion in the 3rd T20I vs Bangladesh - Sanju Samson - has said that he doubted he would play against India after his successive failures in Sri Lanka. Sanju credited Suryakumar Yadav and Gautam Gambhir for backing him and giving him continued chances in the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-suryakumar-yadav-ravi-bishnoi-2616091-2024-10-13",
      "headline": "Suryakumar Yadav told us India were defending 170, not 300: Ravi BishnoiIndia spinner Ravi Bishnoi picked 3 wickets in India's terrific win over Bangladesh on Saturday, October 12. Bishnoi spoke about the team's mentality with the ball where India restricted Bangladesh to just 164 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-on-target-as-portugal-maintain-perfect-nations-league-start-2616083-2024-10-13",
      "headline": "Ronaldo on target as Portugal maintain perfect Nations League startPortugal maintained their perfect record in Group A1 with a 3-1 win over Poland. Bernardo Silva and Cristiano Ronaldo were pivotal in the victory, keeping Portugal at the top of the league standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-samson-pose-with-hyderabad-ground-staff-after-india-beat-bangladesh-2616082-2024-10-13",
      "headline": "Hardik, Samson pose with Hyderabad ground staff after India beat BangladeshIndia stars Hardik Pandya and Sanju Samson posed for photographs with the ground staff at the Rajiv Gandhi International Stadium in Hyderabad in a heartwarming gesture following India's series win over Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-hundred-india-vs-bangladesh-hyderabad-t20i-2616075-2024-10-13",
      "headline": "Sanju Samson 3.0 Unlocked? Making sense of his Hyderabad T20I heroicsIndia vs Bangladesh: Is Hyderabad T20I going to be remembered as a significant turning point in Sanju Samson's career? Having been an enigma in the T20I format, Samson finally arrived at the party, repaying the faith that the new team management showed in him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-hundred-india-vs-bangladesh-3rd-t20i-hyderabad-2616058-2024-10-13",
      "headline": "Sanju Samson reveals how he thrived after 3-week heads-up from leadership groupOpener Sanju Samson hit an incredible century against Bangladesh in the 3rd T20I match of the series. After the match, Samson revealed that he was given three weeks to prepare for the role of an opener by the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-hyderabad-t20i-sanju-samson-suryakumar-yadav-gautam-gambhir-rohit-sharma-2616009-2024-10-13",
      "headline": "From Kanpur to Hyderabad: Gautam Gambhir's India begin to push limits of aggressionTeam India has continued to push limits of aggressive intent through their batting under the new regime of head coach Gautam Gambhir resulting in record breaking wins in two weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-highlights-hyderabad-hardik-pandya-suryakumar-yadav-gautam-gambhir-2616050-2024-10-13",
      "headline": "Hardik credits Suryakumar, Gambhir for wholesome atmosphere in Indian teamIndia vs Bangladesh: All-rounder Hardik Pandya credited a wholesome atmosphere in the Indian team behind the side's incredible performance against Bangladesh in the 3rd T20I. Hardik said that everyone on the team enjoyed each other's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-preview-predicted-xi-where-to-watch-womens-t20-world-cup-harmanpreet-alyssa-healy-smriti-mandhana-2615911-2024-10-13",
      "headline": "India look to strengthen semis berth vs injury-marred Australia Women's T20 World Cup 2024: Harmanpreet Kaur's India will be looking to carry on with their winning momentum and strengthen their chances of qualifying for the semis when they face Australia on Sunday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-five-sixes-rishad-hossain-ind-vs-ban-suryakumar-yadav-2616017-2024-10-13",
      "headline": "Sanju Samson delighted to fulfill his mentor's wish of hitting five sixes in an overIndia wicketkeeper batter Sanju Samson revealed that he had been trying to hit five sixes in an over to fulfil the request of his mentor following his match-winning century in the third T20I against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-hyderabad-t20i-sanju-samson-suryakumar-yadav-gautam-gambhir-rohit-sharma-2616009-2024-10-13",
      "headline": "From Kanpur to Hyderabad: Gautam Gambhir's India begin to push limits of aggressionTeam India has continued to push limits of aggressive intent through their batting under the new regime of head coach Gautam Gambhir resulting in record breaking wins in two weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-highlights-hyderabad-hardik-pandya-suryakumar-yadav-gautam-gambhir-2616050-2024-10-13",
      "headline": "Hardik credits Suryakumar, Gambhir for wholesome atmosphere in Indian teamIndia vs Bangladesh: All-rounder Hardik Pandya credited a wholesome atmosphere in the Indian team behind the side's incredible performance against Bangladesh in the 3rd T20I. Hardik said that everyone on the team enjoyed each other's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-preview-predicted-xi-where-to-watch-womens-t20-world-cup-harmanpreet-alyssa-healy-smriti-mandhana-2615911-2024-10-13",
      "headline": "India look to strengthen semis berth vs injury-marred Australia Women's T20 World Cup 2024: Harmanpreet Kaur's India will be looking to carry on with their winning momentum and strengthen their chances of qualifying for the semis when they face Australia on Sunday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-five-sixes-rishad-hossain-ind-vs-ban-suryakumar-yadav-2616017-2024-10-13",
      "headline": "Sanju Samson delighted to fulfill his mentor's wish of hitting five sixes in an overIndia wicketkeeper batter Sanju Samson revealed that he had been trying to hit five sixes in an over to fulfil the request of his mentor following his match-winning century in the third T20I against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-bangladesh-tazmin-brits-group-b-report-2616016-2024-10-12",
      "headline": "Brits stars as South Africa hammer Bangladesh to reclaim top spot in Group BWomen's T20 World Cup: South Africa reclaimed the top spot in Group B after beating Bangladesh by seven wickets on Saturday at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-suryakumar-yadav-gautam-gambhir-hyderabad-2616011-2024-10-12",
      "headline": "No one bigger than team: Suryakumar Yadav reveals Gambhir's message IND vs BAN: Suryakumar Yadav revealed a strong message from Gautam Gambhir before India's T20I series against Bangladesh. On Saturday, India won by 133 runs in Hyderabad and claimed the series 3-0. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/focus-on-australia-not-thinking-about-new-zealand-vs-pakistan-harmanpreet-kaur-2615994-2024-10-12",
      "headline": "Focus on Australia, not thinking about New Zealand vs Pakistan: Harmanpreet Women's T20 World Cup 2024: Harmanpreet Kaur said that India are focussed on their clash against Australia rather than thinking about how the outcome of the match between New Zealand and Pakistan could affect their chances of qualifying for the semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-2024-25-yash-dayal-stars-with-4-wicket-haul-uttar-pradesh-vs-bengal-2615989-2024-10-12",
      "headline": "Ranji Trophy: Yash Dayal stars with 4-wicket haul after New Zealand Tests snubLeft-arm seamer Yash Dayal picked up a 4-wicket haul for Uttar Pradesh against Bengal in the Ranji Trophy a day after being snubbed from the India squad for New Zealand Tests. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}