{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elss-explained-check-tax-benefits-under-section-80c-and-other-key-details-2681815-2025-02-18",
      "headline": "ELSS explained: Check tax benefits under Section 80C and other key details ELSS offers market-linked returns and has the potential to generate higher long-term returns as compared to other Section 80C options, including PPF, ULIPS, and NPS, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-tariffs-could-hurt-indian-exports-which-sectors-are-at-risk-2681818-2025-02-18",
      "headline": "Trump's reciprocal tariffs could hurt Indian exports. Which sectors are at risk?While officials are still waiting for details on how these tariffs will be calculated, they are already preparing countermeasures and working on a trade deal proposal to reduce tariffs and boost two-way trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsSugar price hike: A drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-overseas-bank-iob-rolls-out-aadhaar-based-account-opening-check-details-2681655-2025-02-18",
      "headline": "Indian Overseas Bank rolls out Aadhaar-based account opening. Check detailsThis new initiative allows customers to open savings bank accounts online with minimal documentation, as per Reserve Bank of India's eKYC guidelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-weakness-continues-sensex-nifty-down-again-3-things-to-know-2681648-2025-02-18",
      "headline": "Sensex, Nifty tumble again as volatility grips Dalal Street. 3 things to knowStock Market Today, 18 Feb 2025: Dalal Street remains under pressure with no immediate relief in sight. Here are some key points investors should know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla in India: Tesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh picks father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-student-suicide-bhubaneswar-kiit-university-protest-odisha-arrested-2681920-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 Odisha university staffers arrested after protests over Nepal student suicideFive officials, including two security guards, were arrested in connection with the alleged suicide of Nepali student Prakriti Lamsal at KIIT, Bhubaneswar. The arrests followed protests over her death and allegations of forceful actions against protesting students.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-volodymyr-zelenskyy-kremlin-us-talks-saudi-arabia-visit-postponed-2681963-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No decision on Ukraine war behind Kyiv's back: Zelenskyy on US-Russia talksUkrainian President Volodymyr Zelenskyy postponed his Saudi Arabia visit. He insisted that any peace talks must include Ukraine and stressed the need for US and European involvement in Kyiv's security guarantees.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-slams-samajwadi-party-for-urdu-bias-uttar-pradesh-vidhan-sabha-2681872-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath's 'English-medium' dig over Urdu translation demand in UP AssemblySamajwadi Party leader Mata Prasad Pandey demanded inclusion of the Urdu translation of House proceedings. The SP leader's remark evoked a sharp response from Yogi Adityanath, who slammed Akhilesh Yadav's party for advocating Urdu only."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/high-level-fecal-bacteria-sangam-water-ganga-yamuna-cpcb-ngt-prayagraj-high-health-risks-maha-kumbh-2025-2681769-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High levels of faecal bacteria in Sangam water. How high is health risk?The National Green Tribunal has raised concerns over high faecal coliform bacteria levels in water near Sangam in Prayagraj. A report by the Central Pollution Control Board indicated high levels of faecal coliform amid the Maha Kumbh. What are the health risks associated with high levels of faecal bacteria in water?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/at-home-enema-kits-are-now-on-amazon-would-you-try-one-for-good-poop-2681916-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enema, anytime? DIY kits for constipation relief are viralWhat to do when life is complicated, uhm sorry, constipated? Use at-home enema kits, apparently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-online-buzz-reveals-about-delhi-chief-minister-probables-2681887-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What online buzz reveals about Delhi Chief Minister probablesParvesh Verma, former Leader of Opposition Vijender Gupta, Rekha Gupta, Satish Upadhyay, Ashish Sood, and Jitender Mahajan are among the leading contenders for the Delhi Chief Minister post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-russia-donald-trump-vladimir-putin-ukraine-war-zelenskyy-riyadh-meeting-appont-teams-2681928-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US, Russia appoint teams to work on ending Ukraine war 'as soon as possible'Washington and Moscow agreed to address longstanding tensions in the US-Russia bilateral relationship and the process will begin with efforts to resolve the war in Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/delta-jet-crashed-caught-fire-flipped-toronto-pearson-airport-canada-2681947-2025-02-18?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Moment Delta jet crashed, caught fire and flipped at Canada airportA video going viral on social media captured the moment when a Delta Air Lines jet flipped upside down upon landing at Canada's Toronto Pearson Airport. The video shows the flight landing and catching fire, before the jet flipped on its roof. All 80 people on board managed to survive the crash. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ranveer-allahbadias-lawyer-abhinav-chandrachud-indias-got-latent-show-supreme-court-2681764-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet Ranveer Allahbadia's lawyer Abhinav Chandrachud who was 'disgusted' by jokeRanveer Allahbadia's lawyer Abhinav Chandrachud, while representing him in the Supreme Court, said he was \"personally disgusted\" by the obscene joke on 'India's Got Latent' show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-just-railways-others-might-be-to-blame-for-new-delhi-railway-station-stampede-rpf-grp-delhi-police-special-train-2681708-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Delhi stampede wasn't solely a Railway blunder?The Railways did miss red flags in the recent New Delhi Railway Station stampede in which 18 people were killed. But is it the only agency that is to be blamed for failing to prevent the tragedy or is there a bigger question of intelligence failure and local police inaction? How far is the Railways enabled, technically and manpower-wise, to prevent such tragedies?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/australian-muslim-organisations-support-of-nurses-who-threatened-jewish-patients-2681738-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Muslim outfits rally behind Australian nurses who vowed to kill Israeli patientsSeveral Islamic organisations, including the extremist group Hizb ut-Tahrir, have supported two nurses who had said they would kill Israeli patients. The now-suspended nurses had vowed in the video to send Israelis to \"jahannam\" (hell). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/president-droupadi-murmu-prosecution-satyendra-jain-ed-probe-money-laundering-case-2681811-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "President clears prosecution sanction for Satyendar Jain in fraud case: SourcesPresident Droupadi Murmu has given her sanction to prosecute former Delhi minister Satyendra Jain in a money-laundering case. Jain, who was previously arrested by the ED, is out on bail. Arvind Kejriwal has defended him, calling the case politically motivated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/passengers-walk-on-ceiling-to-escape-as-delta-jet-overturns-in-toronto-video-2681914-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Passengers walk on ceiling to escape as Delta jet overturns in TorontoA video of passengers walking on the ceiling of a Delta Air Lines flight to escape as their jet overturned at Toronto Pearson Airport went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-has-become-mrityu-kumbh-mamata-banerjees-big-attack-on-yogi-government-2681772-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mamata Banerjee's 'mrityu kumbh' remark stokes row, BJP hits backA political showdown erupted on Monday after West Bengal Chief Minister Mamata Banerjee on Tuesday referred to the Maha Kumbh Mela as 'Mrityu Kumbh (Kumbh of Death)' over the stampede deaths. The BJP hit back, accusing her of hostility towards Hindus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-got-latent-row-supreme-court-to-hear-ranveer-allahbadias-plea-today-2681583-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vomited dirt in his mind: Supreme Court roasts Ranveer Allahbadia over jokeThe Supreme Court pulled up Ranveer Allahbadia while hearing his plea over FIRs filed against him in connection with the row over an obscene joke on India Got Latent show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-kiit-university-staff-apology-remarks-protests-nepali-student-suicide-2681830-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Student suicide: Odisha university staff who mocked Nepal's 'budget' apologisesTwo staff members of the Kalinga Institute of Industrial Technology issued video apologies for the insensitive remarks they made against Nepal during a confrontation with the protesting students on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/dil-dosti-donald-trump-russian-ukraine-peace-talk-diplomacy-gold-steve-witkoff-vladmir-putin-saudi-arabia-2681702-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dil, dosti, Donald: Trump's golf buddy part of Russia-Ukraine war talksTop American bureaucrats, including Secretary of State Marco Rubio, are holding talks with Russian officials in Saudi Arabia over the Ukraine-Russia war. However, it is Trump's golf buddy, Steve Witkoff, who is said to be one of the crucial players in the talks. This is why Trump has despatched a real estate magnate to be part of the talks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-dissent-note-midnight-decision-modi-amit-shah-appoint-chief-election-commissioner-2681715-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disrespectful: Rahul Gandhi's dissent on 'midnight' move to pick poll body chiefRahul Gandhi, who was part of the panel to pick the chief election commissioner, said the government's hasty move was disrespectful and discourteous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-latest-car-audi-rs-3-crore-customised-2681939-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Neeraj Chopra adds Rs 3 crore beast to his collection of luxury cars Neeraj Chopra has added a Rs 3 crore customised SUV to his luxury car collection, featuring exclusive blue-themed details and high-performance upgrades. With a top speed of 305 km/h and a roaring custom exhaust, this the car is the most special addition to his garage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/what-ranveer-allahbadia-did-after-making-crass-joke-audience-member-reveals-2681751-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranveer Allahbadia did this after cracking obscene joke, claims 'audience member'In a now-viral video, a man who claimed to be a member of the audience during the shoot of the controversial episode of India's Got Latent, revealed what Ranveer Allahbadia did after cracking the obscene joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-king-pakistan-2681839-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "King kar lega? After Babar Azam's plea, Rizwan reacts to viral one-linerChampions Trophy: Mohammad Rizwan responded to repeating Hasan Ali's popular one-liner 'King kar lega' while showing faith in Babar Azam's ability. Rizwan attended the press conference before Pakistan's clash against New Zealand in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-notice-centre-view-regulating-obscene-content-youtube-misuse-ranveer-allahbadia-2681689-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Need to do something: Top court notice to Centre over obscene content on YouTubeNoting that YouTubers were misusing the lack of regulation of obscene content on YouTube, the Supreme Court issued notice to Centre and called for regulation of vulgar content amid Ranveer Allahbadia's 'India's Got Latent' row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-brutalist-actor-guy-pearce-says-kevin-spacey-made-him-feel-uncomfortable-2681972-2025-02-18",
      "headline": "The Brutalist actor Guy Pearce says Kevin Spacey made him 'feel uncomfortable'In a recent interview, The Brutalist actor Guy Pearce spoke about how his once co-star, Kevin Spacey made him feel 'uncomfortable'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/pawan-kalyan-juhi-chawla-and-singer-shaan-at-maha-kumbh-2681892-2025-02-18",
      "headline": "Video: Pawan Kalyan, Juhi Chawla and singer Shaan at Maha KumbhActor-politician Pawan Kalyan, actor Juhi Chawla and singer Shaan were seen at the Maha Kumbh 2025. Both Shaan and Pawan Kalyan took a holy dip at the Triveni Sangam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/internet-hopes-vineet-singh-can-buy-a-house-after-chhaava-success-actor-reacts-2681852-2025-02-18",
      "headline": "Internet hopes Vineet Singh can buy a house after Chhaava success. Actor reactsVineet Singh is receiving praise for his role of Kavi Kalash in Chhaava. He shared a long post on X, writing how he went from having 'almost no work' to being thankful to the whole cast, including Vicky Kaushal and Rashmika Mandanna."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-latest-car-audi-rs-3-crore-customised-2681939-2025-02-18",
      "headline": "Watch: Neeraj Chopra adds Rs 3 crore beast to his collection of luxury cars Neeraj Chopra has added a Rs 3 crore customised SUV to his luxury car collection, featuring exclusive blue-themed details and high-performance upgrades. With a top speed of 305 km/h and a roaring custom exhaust, this the car is the most special addition to his garage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-g-kamalini-mumbai-indians-youngest-2681935-2025-02-18",
      "headline": "India U19 hero G Kamalini becomes youngest debutant with Mumbai Indians capWPL 2025: G Kamalini became the youngest debutant in the history of the tournament after getting her maiden cap for the Mumbai Indians (MI) in the clash against Gujarat Giants (GG) on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shardul-thakur-county-championship-essex-contract-ipl-snub-2681912-2025-02-18",
      "headline": "Shardul Thakur signs for Essex, to play County Championship after IPL 2025 snubAll-rounder Shardul Thakur will make his County Championship debut for Essex. The Mumbai star will play the premier first-class tournament in England after having lost out on an IPL contract. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-where-to-watch-live-streaming-full-squads-schedule-2681833-2025-02-18",
      "headline": "Champions Trophy Live Streaming: When and where to watch matches, full squadsThe Champions Trophy 2025 returns to the cricket calendar after a hiatus of nearly 7 and a half years. Here's everything you need to know about the matches, venues, timings and the squads in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammad-rizwan-press-conference-pakistan-will-enjoy-champions-trophy-as-a-nation-2681874-2025-02-18",
      "headline": "Pakistan will enjoy Champions Trophy as a nation: Mohammad Rizwan Champions Trophy 2025: In the press-conference before the clash against New Zealand, Pakistan skipper Mohammad Rizwan welcomed the return of an ICC event to Pakistan after 29 years, and praised the people who worked hard to organise the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-mohammad-rizwan-underestimate-secret-icc-tournament-return-2681862-2025-02-18",
      "headline": "Keep underestimating us: Pakistan captain's plea to pundits before Champions TrophyChampions Trophy 2025: On the eve of Pakistan's opening match against New Zealand in Karachi, captain Mohammad Rizwan addressed the press, discussing the return of an ICC tournament to Pakistan and the team's enduring underdog status at major events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-injury-shikhar-dhawan-2681851-2025-02-18",
      "headline": "India will miss accuracy and calm of Jasprit Bumrah in Champions Trophy: Shikhar DhawanIndia have a strong squad but will miss the accuracy and calm of Jasprit Bumrah in the Champions Trophy, said Shikhar Dhawan. Bumrah has been ruled out of the side due to a back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-king-pakistan-2681839-2025-02-18",
      "headline": "King kar lega? After Babar Azam's plea, Rizwan reacts to viral one-linerChampions Trophy: Mohammad Rizwan responded to repeating Hasan Ali's popular one-liner 'King kar lega' while showing faith in Babar Azam's ability. Rizwan attended the press conference before Pakistan's clash against New Zealand in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-pakistan-opening-2681793-2025-02-18",
      "headline": "Babar Azam is the right man to open in Champions Trophy: Rizwan Champions Trophy 2025: Mohammad Rizwan said that Babar Azam would open the batting in the mega event. Babar has only 88 runs to his name as an ODI opener at an average of 17.60. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-mohammad-rizwan-underestimate-secret-icc-tournament-return-2681862-2025-02-18",
      "headline": "Keep underestimating us: Pakistan captain's plea to pundits before Champions TrophyChampions Trophy 2025: On the eve of Pakistan's opening match against New Zealand in Karachi, captain Mohammad Rizwan addressed the press, discussing the return of an ICC tournament to Pakistan and the team's enduring underdog status at major events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-injury-shikhar-dhawan-2681851-2025-02-18",
      "headline": "India will miss accuracy and calm of Jasprit Bumrah in Champions Trophy: Shikhar DhawanIndia have a strong squad but will miss the accuracy and calm of Jasprit Bumrah in the Champions Trophy, said Shikhar Dhawan. Bumrah has been ruled out of the side due to a back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-king-pakistan-2681839-2025-02-18",
      "headline": "King kar lega? After Babar Azam's plea, Rizwan reacts to viral one-linerChampions Trophy: Mohammad Rizwan responded to repeating Hasan Ali's popular one-liner 'King kar lega' while showing faith in Babar Azam's ability. Rizwan attended the press conference before Pakistan's clash against New Zealand in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-pakistan-opening-2681793-2025-02-18",
      "headline": "Babar Azam is the right man to open in Champions Trophy: Rizwan Champions Trophy 2025: Mohammad Rizwan said that Babar Azam would open the batting in the mega event. Babar has only 88 runs to his name as an ODI opener at an average of 17.60. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}