{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adarsh-gourav-on-criticism-of-hindi-cinema-hansal-mehta-praise-originality-in-films-exclusive-2699921-2025-03-27",
      "headline": "Stop dumbing down films, audiences are smarter than you think: Adarsh GouravIn an exclusive interview with India Today, actor Adarsh Gourav reacted to Hansal Mehta calling him a 'chameleon'. He urged Bollywood to take risks, criticised the obsession with box office numbers, and said filmmakers should stop underestimating audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-wants-to-work-with-ananya-panday-janhvi-kapoor-people-talk-about-age-gap-2699908-2025-03-27",
      "headline": "Salman Khan on working with Ananya, Janhvi: Difficult when people talk about age gapSalman Khan expressed his willingness to work with younger actors like Ananya Panday and Janhvi Kapoor, despite facing criticism over the age gap. He believes collaborating with them provides valuable opportunities for their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruthi-narayanan-first-post-after-private-video-leak-casting-couch-2699909-2025-03-27",
      "headline": "Tamil actor Shruthi Narayanan shares post after alleged casting couch video leakTamil actor Shruthi Narayanan is back in public view on Instagram after a casting couch video allegedly featuring her was leaked online. She had briefly made her Instagram account private."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-south-vs-bollywood-their-audience-isnt-very-accepting-2699865-2025-03-27",
      "headline": "Salman Khan on South vs Bollywood: Their audience isn't very accepting of our filmsSalman Khan recently discussed the popularity of South Indian films and the fan following enjoyed by the actors there. The actors cited \r\n fewer theatres in Bollywood as compared to the South to recover costs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-reacts-breaking-down-booed-melbourne-concert-youll-regret-judging-2699894-2025-03-27",
      "headline": "Neha Kakkar on being booed at Melbourne concert: Wait for the truthSinger Neha Kakkar addressed her recent Melbourne incident where she broke down after arriving three hours late for the concert. In a social media post, Kakkar asked fans to 'wait for the truth' to come out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vikram-veera-dheera-sooran-release-delayed-due-to-legal-issues-2699898-2025-03-27",
      "headline": "Actor Vikram's Veera Dheera Sooran release delayed due to legal issuesThe release of actor Vikram's upcoming film Veera Dheera Sooran has been affected, with shows cancelled at the last minute. The Delhi High Court has imposed an interim stay, halting the film's release for the next four weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/michael-caine-was-terrified-of-heath-ledger-on-dark-knight-set-2699878-2025-03-27",
      "headline": "Actor Michael Caine was 'terrified' of Heath Ledger on Dark Knight setVeteran actor Michael Caine has praised Heath Ledger's dedication to his craft in the memoir, Don't Look Back, You'll Trip Over: My Guide to Life. The actors worked together in Dark Knight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-charan-40th-birthday-mahesh-babu-jr-ntr-chiranjeevi-share-wishes-2699870-2025-03-27",
      "headline": "Ram Charan turns 40: Jr NTR, Mahesh Babu and actors share sweet birthday wishesActor Ram Charan marked his 40th birthday on March 27. On the special day, actors, including Mahesh Babu, Jr NTR, Janhvi Kapoor, and Chiranjeevi, extended heartwarming wishes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/intimate-messages-between-kim-soo-hyun-and-kim-sae-ron-leaked-from-2016-2699862-2025-03-27",
      "headline": "Intimate messages between Kim Soo-hyun and Kim Sae-ron from 2016 leaked: ReportA bunch of intimate messages allegedly exchanged between K-drama actors Kim Soo-hyun and Kim Sae-ron have been shared by the late actor's family during a recent press meet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-hesitant-to-send-his-daughters-away-after-watching-adolescence-2699867-2025-03-27",
      "headline": "Hansal Mehta hesitant to send his daughters away after watching AdolescenceHansal Mehta says Adolescence changed his perspective on parenting. The Netflix series left him shaken, increasing his interactions with his daughters and making him hesitant to send them away for studies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/explained-mohanlal-controversy-and-why-his-lord-ayyappa-sabarimala-puja-for-mammootty-triggered-row-over-faith-2699578-2025-03-27",
      "headline": "Explained: Why Mohanlal's Sabarimala puja for Mammootty triggered row over 'faith' Actor Mohanlal recently offered special prayers for his friend Mammootty at the Sabarimala temple in Kerala. Now, a row has erupted over his gesture towards his friend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-ground-zero-gets-release-date-new-poster-unveiled-2699823-2025-03-27",
      "headline": "Emraan Hashmi's Ground Zero gets release date, new poster unveiledEmraan Hashmi's next, Ground Zero, is set to release in April. On March 27, the makers announced the release date with an intriguing poster of the actor. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-fan-tries-to-breach-security-at-ipl-opening-ceremony-meet-actor-thrashed-by-police-2699810-2025-03-27",
      "headline": "SRK fan tries to breach security at IPL to meet actor, gets thrashed by policeA fan tried to breach security at the IPL 2025 opening match to meet Shah Rukh Khan. However, his attempts landed in vain when police thrashed him for his attempt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-x-review-mohanlal-prithviraj-sukumaran-stunning-action-2699809-2025-03-27",
      "headline": "Empuraan X review: Stunning visuals and action, but fans split over 2nd halfL2: Empuraan opened to massive fan reactions, with many praising its visuals and action-packed second half. However, some felt it turned into a formulaic revenge drama. The film is set for a big box office run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiyaan-vikram-wife-says-mohanlal-is-a-better-actor-than-her-husband-2699794-2025-03-27",
      "headline": "Actor Vikram's wife admits she has a favourite, and it's not her husbandIn a light-hearted revelation, Tamil actor Vikram shared that his wife often compares his skills to actor Mohanlal's, always finding the latter superior. Vikram is gearing up for the release of his upcoming film Veera Dheera Sooran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-janhvi-kapoor-titled-peddi-gritty-first-look-poster-buchi-babu-sana-2699789-2025-03-27",
      "headline": "Ram Charan's next with Janhvi titled Peddi, makers share his gritty 1st look posterActor Ram Charan's first look from the upcoming film titled Peddi is out. The makers treated fans with the news on the actor's 40th birthday today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-breaks-silence-on-death-threats-god-is-watching-over-2699782-2025-03-27",
      "headline": "Salman Khan on death threats: Life lately is home, shooting films, homeSalman Khan, who has received several death threats, said he believes in God and will live as long as destined. However, he finds heavy security challenging at times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/snow-white-producer-marc-platt-son-jonah-platt-claims-rachel-zegler-political-remarks-poor-box-office-2699767-2025-03-27",
      "headline": "Snow White producer's son slams Rachel Zegler's political remarks: She hurt the filmSnow White producer Marc Platt's eldest son, Jonah Platt, slammed actor Rachel Zegler and blamed her for the film's poor box office performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-watches-first-show-of-l2-empuraan-with-fans-prithviraj-and-son-pranav-2699759-2025-03-27",
      "headline": "Mohanlal watches first show of L2: Empuraan with fans, Prithviraj and son PranavMohanlal watched Empuraan's first show with fans, Pranav Mohanlal, and Prithviraj Sukumaran in Kochi. The film released on Thursday amid much fanfare."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-india-ties-vladimir-putin-narendra-modi-russian-foreign-minister-visit-sergey-lavrov-preparations-underway-2699917-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Now it's our turn': Putin to visit India soon, first since start of Ukraine warThis will be the first visit by Vladimir Putin, who has cultivated close ties with PM Modi, since the war with Ukraine broke out in 2022."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-assembly-congress-workers-protest-gherao-clash-with-police-water-cannons-2699934-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress workers attempt to gherao Odisha Assembly, police use water cannonCongress workers clashed with police in Odisha after 14 party MLAs were suspended for disrupting House proceedings. Water cannons were used as protests escalated."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/story/cbse-class-12-dummy-school-students-not-allowed-board-exams-parents-2699939-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Class 12 students attending 'dummy schools' may be barred from board exam, say CBSE officials: News agency PTIClass 12 students attending 'dummy schools' may be barred from board exam, say CBSE officials: News agency PTI"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-rattled-baloch-women-turn-suicide-bombers-explained-army-china-cpec-balochistan-bla-majeed-brigade-2699545-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan rattled as Baloch women turn suicide bombersIt was a woman suicide bomber of the BLA's elite Majeed Brigade who blew herself in Kalat recently, causing death and destruction to the Pakistani army. Once silent victims, Baloch women from diverse backgrounds are now at the forefront of a growing resistance against the joint exploitation of Balochistan by Pakistan and China. Here's what's driving this trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-breaks-silence-on-death-threats-god-is-watching-over-2699782-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan on death threats: Life lately is home, shooting films, homeSalman Khan, who has received several death threats, said he believes in God and will live as long as destined. However, he finds heavy security challenging at times. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/language-row-tamil-nadu-mk-stalin-yogi-adityanath-on-delimitation-bjp-rattled-by-tamil-nadus-firm-stand-2699802-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath lecturing us on hate? The irony: Stalin hits back in language rowTamil Nadu Chief Minister MK Stalin hit back at his Uttar Pradesh counterpart for criticising the DMK's stand on delimitation and language policy, calling the BJP's response hypocritical and dubbing it \"political black comedy at its darkest\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/elon-musk-doge-usaid-shutdown-donald-trump-millions-risk-hiv-cases-deaths-united-nations-lancet-study-2699913-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Elon Musk's USAID shutdown could fuel a global HIV crisisThe Elon Musk-led DOGE has paused foreign aid to the United Nations. Funding cuts to global HIV programs could lead to a rise in infections and deaths, a new Lancet study said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/explained-mohanlal-controversy-and-why-his-lord-ayyappa-sabarimala-puja-for-mammootty-triggered-row-over-faith-2699578-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why Mohanlal's Sabarimala puja for Mammootty triggered row over 'faith' Actor Mohanlal recently offered special prayers for his friend Mammootty at the Sabarimala temple in Kerala. Now, a row has erupted over his gesture towards his friend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-test-series-india-england-tour-2699935-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma likely to opt out of England tour, Virat Kohli to retain spotSources told India Today that Rohit Sharma might not feature in India's upcoming Test series against England to be held later this year. But Virat Kohli is most likely to retain his spot. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-are-bullish-india-trajectory-pm-modi-approval-trump-administration-tariffs-carnegie-yougov-survey-2699869-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-Americans more bullish about India's trajectory than 4 years agoIndian-Americans are more bullish on India's future than four years ago, with 10% more respondents believing the country is on the right track, according to a Carnegie and YouGov survey. Forty-one percent of Indian-Americans said the 2024 election strengthened India's democracy. PM Modi's rating remains stable among the respondents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/not-a-disney-movie-princess-syndrome-can-mess-with-real-life-relationships-2699772-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Papa ki pari' are you? It can mess with real-life relationshipsThis Karen-like privileged behaviour is not born out of nothing. It begins as a child, and when it goes unchecked, it could turn someone 'sinister'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saugat-e-modi-scheme-for-muslims-uddhav-thackeray-slams-bjp-satta-jihad-2699901-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Satta jihad: Uddhav Thackeray slams BJP over Saugat-e-Modi scheme for MuslimsUddhav Thackeray slammed the BJP's Saugat-e-Modi scheme, calling it 'satta jihad' and accusing the party of abandoning Hindutva for electoral gains in the upcoming Bihar Assembly elections.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-will-die-soon-zelenskyy-bold-claim-russia-ukraine-war-2699800-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin will die soon: Zelenskyy's bold claim amid Russian leader's health rumoursVolodymyr Zelenskyy's remarks, during an interview in Paris, come amid widespread speculation about the Russian President's health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-saweety-boora-deepak-hooda-shocking-video-husband-2699914-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Boxer Saweety, seen attacking husband in video, alleges he's interested in menIn a video on social media, boxer Saweety Boora said that her husband Deepak Hooda has an interest in men. In the video, the boxer broke down in tears, and she expressed her distress in tough times. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-reacts-breaking-down-booed-melbourne-concert-youll-regret-judging-2699894-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Neha Kakkar on being booed at Melbourne concert: Wait for the truthSinger Neha Kakkar addressed her recent Melbourne incident where she broke down after arriving three hours late for the concert. In a social media post, Kakkar asked fans to 'wait for the truth' to come out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dri-arrests-key-suspect-sahil-jain-for-disposing-gold-in-ranya-rao-smuggling-case-2699608-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Big catch' in Ranya Rao case: Gold dealer who abetted smuggling arrestedThe Directorate of Revenue Intelligence (DRI) arrested a key suspect in the Ranya Rao smuggling case for allegedly disposing of smuggled gold. They got custody of him for four days to probe the wider network.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-lsg-match-preview-ipl-2025-sunrisers-hyderabad-vs-lucknow-super-giants-indian-premier-league-rishabh-pant-2699834-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rishabh Pant's Lucknow run into rapid shots of fire at Sunrisers' kingdomIPL 2025, Sunrisers Hyderabad vs Lucknow Super Giants Match Preview: LSG will be looking to make a comeback against a confident SRH team on Thursday at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/first-vertical-lift-sea-bridge-to-be-inaugurated-by-pm-modi-heres-how-it-works-2699902-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi to inaugurate first vertical lift sea bridge: How does it work?The New Pamban Bridge features an innovative vertical lift mechanism that allows a central span to rise vertically to a height of 22 meters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/chatgpts-studio-ghibli-style-images-take-over-internet-here-is-how-you-can-create-your-own-2699841-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ChatGPT's Studio Ghibli-style images take over internet: How is how to create itChatGPT's new image generator is doing wonders for the internet. The social media platform, X (formerly Twitter), is overflowing with AI-manufactured Ghibli-style images. If you have not tried it yet, here is a step-by-step guide on how to generate your own. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/turkish-doctoral-student-arrested-in-massachusetts-after-visa-termination-glbs-2699515-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Pro-Palestinian Turkish student, out to break Ramzan fast, arrested in USUS immigration officers in plain clothes and their faces covered with masks detained the student while she was on her way to a friend's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sahkari-taxi-announcement-drivers-full-profit-ola-uber-pricing-complaints-amit-shah-2699733-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uber, Ola's new competitor. Government's 'Sahkar Taxi' that will benefit driversThe government's upcoming 'Sahkar Taxi' will empower drivers with direct profit without intermediaries taking a cut from their earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adarsh-gourav-on-criticism-of-hindi-cinema-hansal-mehta-praise-originality-in-films-exclusive-2699921-2025-03-27",
      "headline": "Stop dumbing down films, audiences are smarter than you think: Adarsh GouravIn an exclusive interview with India Today, actor Adarsh Gourav reacted to Hansal Mehta calling him a 'chameleon'. He urged Bollywood to take risks, criticised the obsession with box office numbers, and said filmmakers should stop underestimating audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-wants-to-work-with-ananya-panday-janhvi-kapoor-people-talk-about-age-gap-2699908-2025-03-27",
      "headline": "Salman Khan on working with Ananya, Janhvi: Difficult when people talk about age gapSalman Khan expressed his willingness to work with younger actors like Ananya Panday and Janhvi Kapoor, despite facing criticism over the age gap. He believes collaborating with them provides valuable opportunities for their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruthi-narayanan-first-post-after-private-video-leak-casting-couch-2699909-2025-03-27",
      "headline": "Tamil actor Shruthi Narayanan shares post after alleged casting couch video leakTamil actor Shruthi Narayanan is back in public view on Instagram after a casting couch video allegedly featuring her was leaked online. She had briefly made her Instagram account private."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-south-vs-bollywood-their-audience-isnt-very-accepting-2699865-2025-03-27",
      "headline": "Salman Khan on South vs Bollywood: Their audience isn't very accepting of our filmsSalman Khan recently discussed the popularity of South Indian films and the fan following enjoyed by the actors there. The actors cited \r\n fewer theatres in Bollywood as compared to the South to recover costs. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-test-series-india-england-tour-2699935-2025-03-27",
      "headline": "Rohit Sharma likely to opt out of England tour, Virat Kohli to retain spotSources told India Today that Rohit Sharma might not feature in India's upcoming Test series against England to be held later this year. But Virat Kohli is most likely to retain his spot. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-saweety-boora-deepak-hooda-shocking-video-husband-2699914-2025-03-27",
      "headline": "Boxer Saweety, seen attacking husband in video, alleges he's interested in menIn a video on social media, boxer Saweety Boora said that her husband Deepak Hooda has an interest in men. In the video, the boxer broke down in tears, and she expressed her distress in tough times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-watson-fires-warning-to-rcb-ahead-of-csk-clash-2699907-2025-03-27",
      "headline": "Shane Watson fires warning to RCB ahead of crucial CSK clash: Chepauk is a fortressFormer Australia all-rounder Shane Watson has fired a warning to Royal Challengers Bengaluru (RCB) ahead of their all-important clash against Chennai Super Kings (CSK) in the "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-on-mohammad-rizwans-keeping-srh-vs-lsg-2699875-2025-03-27",
      "headline": "Ishan Kishan's hilarious Mohammad Rizwan comparison leaves Anil Chaudhary flooredIndia and Sunrisers Hyderabad (SRH) wicketkeeper batter Ishan Kishan made a hilarious comparison with Pakistan ODI Mohammad Rizwan's keeping style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-alexandra-eala-iga-swiatek-miami-open-motivation-2699868-2025-03-27",
      "headline": "Keep dreaming: Nadal sends words of motivation for sensation AlexandraMiami Open 2025: Rafael Nadal heaped praise on 19-year-old sensation Alexandra Eala, who knocked World No.2 Iga Swiatek out in the quarterfinals with a 6-2, 7-5 win on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shane-watson-on-quinton-de-kock-kolkata-knight-riders-vs-rajasthan-royals-2699842-2025-03-27",
      "headline": "IPL 2025: Shane Watson in awe of vintage Quinton de Kock vs Rajasthan RoyalsFormer Australia all-rounder Shane Watson revealed that he was left awestruck by Quinton de Kock's phenomenal innings against Rajasthan Royals (RR) in Match 6 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-lsg-match-preview-ipl-2025-sunrisers-hyderabad-vs-lucknow-super-giants-indian-premier-league-rishabh-pant-2699834-2025-03-27",
      "headline": "Rishabh Pant's Lucknow run into rapid shots of fire at Sunrisers' kingdomIPL 2025, Sunrisers Hyderabad vs Lucknow Super Giants Match Preview: LSG will be looking to make a comeback against a confident SRH team on Thursday at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-sairaj-bahutule-on-rajasthan-royals-spinners-rr-vs-kkr-2699821-2025-03-27",
      "headline": "There was enough purchase for spinners, we should've executed better: Sairaj BahutuleRajasthan Royals (RR) spin bowling coach Sairaj Bahutule said that their spinners failed to execute their plans well during the game against Kolkata Knight Riders (KKR) despite having enough assistance in the pitch. KKR beat Rajasthan by eight wickets in their second match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-lsg-playing-11-ipl-2025-team-prediction-pat-cummins-rishabh-pant-2699808-2025-03-27",
      "headline": "SRH vs LSG Playing XI Prediction, IPL 2025: Avesh Khan fit for selectionSunrisers Hyderabad (SRH) and Lucknow Super Giants (LSG) are all set to lock horns in Match 7 of the Indian Premier League 2025 (IPL 2025) at Rajiv Gandhi International Cricket Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-uncapped-stars-vignesh-puthur-priyansh-arya-vipraj-nigam-2699514-2025-03-27",
      "headline": "IPL 2025: Four uncapped stars who shone in first weekThe first week of the Indian Premier League 2025 (IPL 2025) has seen several young stars rise to the limelight with their marvellous performances. Here's a look at the top four uncapped players who managed to grab the attention of fans:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-weather-forecast-pitch-report-hyderabad-2699431-2025-03-27",
      "headline": "SRH vs LSG pitch, weather report: Hot temperatures, big scores expected?Hyderabad (SRH) vs Lucknow (LSG) Match Pitch Report, Weather forecast: SRH will welcome LSG to the high-scoring Rajiv Gandhi International stadium on Thursday, March 27. Will we see another big-scoring thriller in the IPL 2025 season?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-lsg-match-preview-ipl-2025-sunrisers-hyderabad-vs-lucknow-super-giants-indian-premier-league-rishabh-pant-2699834-2025-03-27",
      "headline": "Rishabh Pant's Lucknow run into rapid shots of fire at Sunrisers' kingdomIPL 2025, Sunrisers Hyderabad vs Lucknow Super Giants Match Preview: LSG will be looking to make a comeback against a confident SRH team on Thursday at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-sairaj-bahutule-on-rajasthan-royals-spinners-rr-vs-kkr-2699821-2025-03-27",
      "headline": "There was enough purchase for spinners, we should've executed better: Sairaj BahutuleRajasthan Royals (RR) spin bowling coach Sairaj Bahutule said that their spinners failed to execute their plans well during the game against Kolkata Knight Riders (KKR) despite having enough assistance in the pitch. KKR beat Rajasthan by eight wickets in their second match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-lsg-playing-11-ipl-2025-team-prediction-pat-cummins-rishabh-pant-2699808-2025-03-27",
      "headline": "SRH vs LSG Playing XI Prediction, IPL 2025: Avesh Khan fit for selectionSunrisers Hyderabad (SRH) and Lucknow Super Giants (LSG) are all set to lock horns in Match 7 of the Indian Premier League 2025 (IPL 2025) at Rajiv Gandhi International Cricket Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-uncapped-stars-vignesh-puthur-priyansh-arya-vipraj-nigam-2699514-2025-03-27",
      "headline": "IPL 2025: Four uncapped stars who shone in first weekThe first week of the Indian Premier League 2025 (IPL 2025) has seen several young stars rise to the limelight with their marvellous performances. Here's a look at the top four uncapped players who managed to grab the attention of fans:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-weather-forecast-pitch-report-hyderabad-2699431-2025-03-27",
      "headline": "SRH vs LSG pitch, weather report: Hot temperatures, big scores expected?Hyderabad (SRH) vs Lucknow (LSG) Match Pitch Report, Weather forecast: SRH will welcome LSG to the high-scoring Rajiv Gandhi International stadium on Thursday, March 27. Will we see another big-scoring thriller in the IPL 2025 season?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}