{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-securities-says-bullish-2025-ahead-nifty-outlook-to-hit-28800-with-sectoral-leaders-in-focus-2651753-2024-12-18",
      "headline": "Will 2025 bring a bull run? Key trends for Nifty to watchICICI Securities projects a 20% rise in Nifty for 2025, driven by historical trends, sectoral strength, and strategic stock picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rama-mohan-rao-amara-appointed-sbi-new-managing-director-report-2651798-2024-12-18",
      "headline": "Rama Mohan Rao Amara appointed as SBI's new managing director: ReportThe decision was made by the Appointments Committee of the Cabinet (ACC), which is headed by the Prime Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/own-foreign-assets-or-income-disclose-in-itr-december-31-2024-to-avoid-rs-10-lakh-penalty-2651692-2024-12-18",
      "headline": "Own foreign assets or income? Disclose now to avoid Rs 10 lakh penaltyTaxpayers must disclose foreign income and assets by December 31, 2024, to avoid hefty penalties under the Income Tax and Black Money Acts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-fall-sensex-nifty-stumble-will-2024-end-with-dalal-street-in-red-outlook-what-to-expect-2651763-2024-12-18",
      "headline": "Sensex, Nifty stumble: Will 2024 end with stock markets in red?Sensex, Nifty stumble: The market has been under pressure for three consecutive days, with the Sensex losing 1,951 points during this period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-us-trade-and-fed-jitters-spook-investors-banking-financial-stocks-2651734-2024-12-18",
      "headline": "Sensex, Nifty end lower as US trade and Fed jitters spook investorsThe S&P BSE Sensex was down by 502.25 points to end at 80,182.20, while the NSE Nifty50 lost 137.15 points to close the day at 24,198.85. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/va-tech-wabag-shares-price-stocks-down-16-percent-in-focus-why-reason-stmp-2651694-2024-12-18",
      "headline": "Va Tech Wabag shares: Why VA Tech Wabag stocks are in focus?As of 2:50 PM, the shares were trading at Rs 1,655.15, down 12.20% from the previous close. Earlier in the day, the stock dropped to Rs 1,586.50 on the NSE, marking a 15.8% decline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nmdc-share-price-fall-over-6-percent-today-reason-here-is-why-stock-market-update-2651608-2024-12-18",
      "headline": "NMDC share price falls over 6% today. Here's whyShares of NMDC and steel firms fell as Karnataka proposed a mining tax bill, impacting iron ore costs and profitability across the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-life-insurance-rs-880-crore-unclaimed-is-your-policy-among-them-here-is-how-to-check-2651538-2024-12-18",
      "headline": "Rs 880 crore unclaimed: Is your LIC policy among them? Here's how to checkOver Rs 880 crore in LIC maturity benefits remain unclaimed by nearly 3.72 lakh policyholders in FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-3-reasons-why-sensex-nifty-are-under-pressure-fed-rate-cut-low-rupee-banking-stock-decline-2651585-2024-12-18",
      "headline": "Stock market crash: 3 reasons why Sensex, Nifty are under pressure todayThe S&P BSE Sensex declined by 612.55 points, or 0.76%, to 80,071.90, while the NSE Nifty50 shed 179.55 points, or 0.74%, to 24,156.45 as of 12:50 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-share-price-fall-10-percent-reason-why-in-early-trade-today-q2-results-trading-circuit-limit-stmp-2651530-2024-12-18",
      "headline": "Explained: Why Enviro Infra share price fell 10% in early trade today The decline in Enviro Infra's share price comes on the same day the company is set to announce its financial performance for the quarter ended September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-listing-share-price-make-bumper-debut-at-58-percent-premium-should-you-book-profit-hold-review-2651508-2024-12-18",
      "headline": "Mobikwik shares make bumper debut: Should you book profit? Mobikwik share price: The stock of Mobikwik opened on the BSE at Rs 442.25, listing at a premium of 58.51% over the issue price of Rs 279."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sai-life-sciences-listing-share-price-decent-debut-stock-market-opening-18-percent-premium-rs-650-nse-stmp-2651500-2024-12-18",
      "headline": "Sai Life Sciences shares debut at 18% premium on stock exchanges Sai Life Sciences share price today: Sai Life Sciences shares made a strong debut on Wednesday, listing at a premium of 18% on the NSE, with the stock opening at Rs 650, which is Rs 101 above its issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-listing-share-price-stocks-list-at-59-percent-premium-rs-442-nse-dalal-street-stock-market-stmp-2651490-2024-12-18",
      "headline": "Bumper debut for Mobikwik shares as stocks list at 59% premium on Dalal StreetMobikwik share price: The shares of One Mobikwik Systems debuted on the BSE at Rs 442.25, marking a 58.51% premium over the issue price of Rs 279."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-listing-share-price-strong-market-debut-at-33-percent-premium-nse-dalal-street-stock-market-2651489-2024-12-18",
      "headline": "Vishal Mega Mart shares make strong market debut at 33% premium on D-Street Vishal Mega Mart share price: The stock began trading at Rs 104, at a premium of 33% over its issue price of Rs 78. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-cautious-investors-weigh-global-trends-tata-motors-down-2-percent-2651485-2024-12-18",
      "headline": "Sensex, Nifty open lower as cautious investors weigh global trendsThe S&P BSE Sensex was down 15.56 points to 80,668.89, while the NSE Nifty50 lost 4 points to 24,332.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/facebook-owner-meta-hit-with-251-million-euros-in-fines-for-2018-data-breach-2651188-2024-12-17",
      "headline": "Facebook owner Meta hit with 251 million euros in fines for 2018 data breachIreland's Data Protection Commission issued the penalties to Meta after wrapping up its inquiry into the breach, when hackers gained access to user accounts by exploiting bugs in the platform's code. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-on-cryptocurrencies-capital-gains-itat-ruling-relief-for-pre-fy23-earnings-2651095-2024-12-17",
      "headline": "Cryptocurrencies to be taxed as capital gains: Relief for pre-FY23 earningsThe Income Tax Appellate Tribunal (ITAT) decision defines cryptocurrencies as capital assets, distinguishing pre-2022 profits as capital gains and applying a 30% flat tax to post-2022 transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-wrong-itr-notice-clarification-check-details-2651076-2024-12-17",
      "headline": "Income Tax Department admits error of sending wrong ITR notices. Check details The Income Tax Department has acknowledged its mistake in sending defective ITR notices, offering relief to many, though taxpayers who filed revised returns could face complications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economic-growth-gdp-pick-up-pace-fm-nirmala-sitharaman-lok-sabha-address-2651079-2024-12-17",
      "headline": "Will India's economic growth pick up pace? Nirmala Sitharaman answersFinance Minister Nirmala Sitharaman acknowledged that July to September was a challenging period for the economy but called the slowdown a 'temporary blip'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dormant-account-here-is-how-to-easily-reactivate-it-at-sbi-pnb-hdfc-idfc-first-bank-2651008-2024-12-17",
      "headline": "Dormant account? Here's how to easily reactivate it at SBI, PNB and 2 more banksKeep your bank account active with periodic transactions and KYC updates. Reactivate dormant accounts at HDFC, PNB, SBI, and IDFC FIRST Banks with simple steps."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-speedboat-ferry-collision-death-toll-navy-accident-case-filed-2652025-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against Navy speedboat driver after boat accident off Mumbai coast kills 13The case was filed against the driver of a Navy speedboat, which lost control and crashed into a passenger ferry off Mumbai's Gateway of India on Wednesday, killing 13 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-supriya-sule-sambit-patra-parliamentary-panel-one-nation-one-election-bill-2651927-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Priyanka Gandhi, Anurag Thakur part of Parliamentary panel on One Poll billsThis came a day after Union Law Minister Arjun Ram Meghwal introduced in the Lok Sabha the constitutional amendment bills for simultaneously holding Lok Sabha and state Assembly elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-air-quality-index-enters-severe-plus-category-2652003-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi's pollution worsens as Air Quality Index enters 'severe plus' categoryThe current reading, taken at 11 pm, marks a spike in the AQI reading, which was 442 at 7 am today. The air quality has deteriorated in the past few days due to lower temperatures and low wind speeds, which is hindering the dispersal of pollutants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-federal-reserve-cuts-key-interest-rates-by-025-glbs-2652034-2024-12-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Federal Reserve cuts key interest rates by 0.25%The Federal Reserve cut its key interest rate by a quarter-point — its third cut this year — but also signaled that it expects to reduce rates more slowly next year than it previously envisioned, largely because of still-elevated inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-president-elect-donald-trump-new-haircut-viral-video-2651709-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Have you seen US President-elect Donald Trump's new hairstyle? Video goes viralA video showing US President-elect Donald Trump sporting a new hairstyle went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-border-pilgrimage-indians-6-terms-reached-ajit-doval-wang-yi-meet-2652019-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China border, pilgrimage for Indians: 6 terms reached at Ajit Doval-Wang Yi meetNSA Ajit Doval and Chinese Foreign Minister Wang Yi reaffirmed their commitment to resolving the India-China border dispute and strengthening bilateral ties during their 23rd Special Representatives meeting. Doval invited Wang to India for future discussions on the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/anil-kumble-reveals-his-disappointment-with-r-ashwin-as-veteran-spinner-retires-2652026-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A bit disappointed you retired, wanted you to go past 619: Anil Kumble to AshwinAnil Kumble shared his retirement message for Ravichandran Ashwin after the veteran spinner called it a time on his international career. Ashwin ended his career as India's 2nd highest wicket-taker in Tests after Kumble. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-row-ambedkar-remark-rajya-sabha-congress-nehru-indira-gandhi-2651799-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I can never speak against Ambedkar, Congress twisted my remarks: Amit Shah At a press conference on Wednesday, Amit Shah lashed out at Congress and said that his remarks on Ambedkar were twisted. I can never speak against Ambedkar ji, he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/video/video-speeding-boat-crashes-into-passenger-ferry-mumbai-elephanta-caves-neelkamaluran-2651845-2024-12-18?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Moment speedboat crashed into passenger ferry in MumbaiA video, recorded by a passenger on board the ferry, captured the speedboat circling the ferry before crashing into it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reveals-what-the-world-champion-will-do-with-prize-money-of-rs-1145-cr-2651964-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "D Gukesh reveals how he plans to spend Rs 11.45 crore world championship prize Chess prodigy D Gukesh shares insight into the world champion's plan for the Rs 11.45 crore prize money. The 18-year-old's  parents made huge sacrifices in his journey to the top."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-congress-claims-tear-gas-caused-party-worker-death-police-deny-charges-2651921-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Assam Congress claims tear gas caused party worker's death, police deny chargeAssam Congress on Wednesday alleged that its party worker died due to the injuries caused by a tear gas shell during a protest rally in Guwahati. The police has denied charges of brutality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-white-ball-cricket-odis-retirement-test-heroics-australia-vs-india-2651920-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why 'all format star' R Ashwin should not just be remembered for his Test heroicsAs Ravichandran Ashwin calls it a time on his international career, the veteran spinner shouldn't just be remembered for his wizardry in the longest format of the game. Let us recall some of Ashwin's memorable performances in the blue jersey for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/binaca-geetmala-kishore-kumar-indira-gandhi-rift-radio-ban-2651616-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Binaca Geetmala and the Kishore Kumar-Indira Gandhi rift that led to his banBinaca Geetmala, the iconic radio show that defined Indian music for over 40 years, found itself mired in politics during the 1975 Emergency, when a Kishore Kumar-Indira Gandhi rift led to a radio ban on the voice of the King of Bollywood playback singing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/department-of-homeland-security-final-rule-h1b-visa-uscis-quick-jobs-in-us-retain-top-talent-us-employers-comapanies-2651572-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US announces H-1B visa overhaul to fill jobs faster; Indians may benefit mostThe Department of Homeland Security (DHS) has announced its decision to modernise the H-1B visa programme, effective January 17, 2025. The aim is to streamline and expedite the H1-B visa approval process and provide greater flexibility for employers to retain top talent. Indians are likely to benefit the most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-amit-shah-visited-a-security-camp-in-maoist-epicentre-of-chhattisgarh-2651693-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Amit Shah visited a security camp in Maoist epicentre of ChhattisgarhThe Gundam camp is in the midst of the ongoing face-off with Maoists in Bastar, which has witnessed the most concerted security offensive this year\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-develops-mrna-cancer-vaccine-research-medicine-distribute-it-free-of-cost-patients-2651830-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia develops cancer vaccine, will distribute it for free from 2025Russia announced that it had developed an mRNA vaccine for cancer patients. The vaccine will be available from early 2025 and will be distributed for free. The vaccine will cost the Russian government 300,000 rubles per dose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/girls-will-be-girls-review-preeti-panigrahi-kani-kasruti-suchi-talati-2651893-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Girls Will Be Girls Review: Uncomfortably accurate coming-of-age filmReleased-Wed Dec 18, 2024Girls Will Be Girls is a compelling coming-of-age film that explores the complexities of human emotions and societal expectations. Directed by Shuchi Talati, it features Preeti Panigrahi and Kani Kastruti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/diljit-dosanjh-chandiagrh-concert-breached-noise-limit-state-informs-punjab-and-haryana-high-court-2651757-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Diljit Dosanjh's concert breached noise limit, Chandigarh informs High CourtThe court's direction prior to the concert required that noise levels at the venue not exceed the ambient air quality standard of 75 decibels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-all-retirements-in-2024-james-anderson-ravi-ashwin-2651922-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From James Anderson to R Ashwin: Legends who retired in 20242024 has been a tough year for cricket fans. Several exceptional cricketers have retired this year leaving a gaping hole in the cricketing world. From James Anderson to Ravichandran Ashwin, here's a list of players that retired in 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-amit-shah-ambedkar-remark-congress-rajya-sabha-mallikarjun-kharge-2651769-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM should sack Amit Shah by midnight if he respects Ambedkar: Mallikarjun KhargeCongress chief Mallikarjun Kharge demanded that PM Narendra Modi should sack Amit Shah from the Union Cabinet for his remarks on Dalit icon Dr BR Ambedkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/india-today-insight/story/20241223-christmas-is-here-give-your-home-a-merry-makeover-2651767-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Christmas is here: Give your home a merry makeoverDecked up but retaining its earthy charm, this Mumbai home sets the benchmark in styling your interiors for the festivities\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/d-gukesh-winning-chess-move-kathak-dance-video-will-give-you-goosebumps-viral-2651890-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "D Gukesh's winning chess move performed through Kathak. Video will give you goosebumpsTo celebrate D Gukesh, Anushka Chandak and Maitreyee Nirgun meticulously choreographed their movements to symbolise Gukesh's winning move and also represented Ding Liren's counterstrategies with equal finesse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-father-allu-aravind-visits-injured-child-hyderabad-stampede-pushpa-2-screening-sandhya-theatre-2651875-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun's father Allu Aravind visits child injured in Hyderabad stampedeAllu Aravind, father of actor Allu Arjun, visited the nine-year-old boy who got injured during a stampede at Pushpa 2 screening in Hyderabad, providing updates on his recovery. He explained his son's absence due to legal advice and hospital restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-congress-jawaharlal-nehru-obc-reservation-kalelkar-commission-report-backward-classes-2651544-2024-12-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "First OBC commission wanted 70% reservation. Why Nehru govt junked its reportHome Minister Amit Shah spoke about the long-forgotten Kalelkar Commission report to brand Congress \"anti-reservation\". Set up in 1953 by the President, it was India's first Commission on backward classes. What did the Nehru-era panel recommend, and why didn't the government junk its recommendations?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nora-fatehi-joins-karan-aujla-delhi-second-concert-daces-2652032-2024-12-18",
      "headline": "Watch: Nora Fatehi joins Karan Aujla on stage in Delhi, dances to Aaye HaayeKaran Aujla's second concert in Delhi NCR featured a special appearance by Nora Fatehi, who joined him on stage for a lively performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-at-keerthy-suresh-wedding-antony-thattil-new-photos-2652022-2024-12-18",
      "headline": "Keerthy Suresh shares 'dream icon' Thalapathy Vijay's photos from her weddingKeerthy Suresh recently got married to Antony Thattil in Goa. She shared new photos from the ceremony, where superstar Thalapathy Vijay graced the occasion with his presence and blessed the newlyweds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/exclusive-rana-daggubati-on-dubbing-for-barca-in-solo-leveling-2651999-2024-12-18",
      "headline": "Exclusive: Rana Daggubati on dubbing for Barca in Solo LevelingRana Daggubati, who has dubbed for the character of Barca from Solo Leveling in Hindi, Tamil and Telugu, spoke to India Today about his love for anime and how it began with One Piece, plans for Indian animation and the challenges of dubbing for a character in three languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-thanks-japan-for-showering-love-on-his-films-ahead-of-kalki-2898-ad-release-2651925-2024-12-18",
      "headline": "Prabhas thanks Japan ahead of Kalki release, promises to watch it togetherIn a heartfelt new video, Prabhas addressed his Japanese fans ahead of the release of Kalki in Japan. The blockbuster film is set to hit theatres in the country on January 3, 2025.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/anil-kumble-reveals-his-disappointment-with-r-ashwin-as-veteran-spinner-retires-2652026-2024-12-18",
      "headline": "A bit disappointed you retired, wanted you to go past 619: Anil Kumble to AshwinAnil Kumble shared his retirement message for Ravichandran Ashwin after the veteran spinner called it a time on his international career. Ashwin ended his career as India's 2nd highest wicket-taker in Tests after Kumble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wtc-final-south-africa-test-squad-vs-pakistan-2652001-2024-12-18",
      "headline": "Hunt for WTC Final begins as South Africa announces Test squad vs PakistanSouth Africa has announced its 16-man squad for the upcoming Test series against Pakistan, set to begin on December 26 in Centurion, with a clear focus on securing a place in next year's World Test Championship (WTC) final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reveals-what-the-world-champion-will-do-with-prize-money-of-rs-1145-cr-2651964-2024-12-18",
      "headline": "D Gukesh reveals how he plans to spend Rs 11.45 crore world championship prize Chess prodigy D Gukesh shares insight into the world champion's plan for the Rs 11.45 crore prize money. The 18-year-old's  parents made huge sacrifices in his journey to the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-andrew-flintoff-son-rocky-england-lions-australia-tour-2651954-2024-12-18",
      "headline": "Coach Andrew Flintoff calls up son Rocky for England LionsEngland Lions head coach Andrew Flintoff has called-up his son Rocky for the team's tour of Australia. Rocky, who is 16, made his first class debut in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-record-india-women-vs-west-indies-women-2651928-2024-12-18",
      "headline": "Smriti Mandhana eyes T20I history in series decider vs West IndiesIND-W vs WI-W: Smriti Mandhana has the chance of making the record for most runs in Women's T20Is in a calendar year. Currently, she has 686 runs from 22 matches at an average of 40.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-white-ball-cricket-odis-retirement-test-heroics-australia-vs-india-2651920-2024-12-18",
      "headline": "Why 'all format star' R Ashwin should not just be remembered for his Test heroicsAs Ravichandran Ashwin calls it a time on his international career, the veteran spinner shouldn't just be remembered for his wizardry in the longest format of the game. Let us recall some of Ashwin's memorable performances in the blue jersey for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-all-retirements-in-2024-james-anderson-ravi-ashwin-2651922-2024-12-18",
      "headline": "From James Anderson to R Ashwin: Legends who retired in 20242024 has been a tough year for cricket fans. Several exceptional cricketers have retired this year leaving a gaping hole in the cricketing world. From James Anderson to Ravichandran Ashwin, here's a list of players that retired in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-simona-halep-lleyton-hewitt-wildcard-qualifiers-2651913-2024-12-18",
      "headline": "Halep, Hewitt's son get wildcard for Australian Open 2025 qualifiers Australian Open 2025: Former World No.1 Simona Halep and Lleyton Hewitt's son Cruz have been included as wildcards for the qualifying round for the hard court major at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-ravichandran-ashwin-retirement-shocks-haddin-brett-lee-2651889-2024-12-18",
      "headline": "R Ashwin's retirement shocks Brad Haddin, Brett LeeIND vs AUS: India spinner Ravichandran Ashwin's retirement shocked several former cricketers. Former Australia stars Brad Haddin and Brett Lee wondered why Ashwin decided to leave in the middle of the Australia tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-better-with-marcus-rashford-ruben-amorim-amid-exit-talks-2651876-2024-12-18",
      "headline": "Manchester United are better with Rashford: Manager Ruben Amorim amid exit talksManchester United manager Ruben Amorim said that the Premier League club are \"better\" with Marcus Rashford after the forward suggested he could leave Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-aaron-finch-r-ashwin-retirement-mankad-2651856-2024-12-18",
      "headline": "Thanks for not running me out: Finch's witty wish on Ashwin's retirementAUS vs IND: Former Australian captain Aaron Finch wished Ravi Ashwin after the latter announced his retirement from international cricket. Ashwin called time in his career after the Gabba Test against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-all-retirements-in-2024-james-anderson-ravi-ashwin-2651922-2024-12-18",
      "headline": "From James Anderson to R Ashwin: Legends who retired in 20242024 has been a tough year for cricket fans. Several exceptional cricketers have retired this year leaving a gaping hole in the cricketing world. From James Anderson to Ravichandran Ashwin, here's a list of players that retired in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-simona-halep-lleyton-hewitt-wildcard-qualifiers-2651913-2024-12-18",
      "headline": "Halep, Hewitt's son get wildcard for Australian Open 2025 qualifiers Australian Open 2025: Former World No.1 Simona Halep and Lleyton Hewitt's son Cruz have been included as wildcards for the qualifying round for the hard court major at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-ravichandran-ashwin-retirement-shocks-haddin-brett-lee-2651889-2024-12-18",
      "headline": "R Ashwin's retirement shocks Brad Haddin, Brett LeeIND vs AUS: India spinner Ravichandran Ashwin's retirement shocked several former cricketers. Former Australia stars Brad Haddin and Brett Lee wondered why Ashwin decided to leave in the middle of the Australia tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-better-with-marcus-rashford-ruben-amorim-amid-exit-talks-2651876-2024-12-18",
      "headline": "Manchester United are better with Rashford: Manager Ruben Amorim amid exit talksManchester United manager Ruben Amorim said that the Premier League club are \"better\" with Marcus Rashford after the forward suggested he could leave Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-aaron-finch-r-ashwin-retirement-mankad-2651856-2024-12-18",
      "headline": "Thanks for not running me out: Finch's witty wish on Ashwin's retirementAUS vs IND: Former Australian captain Aaron Finch wished Ravi Ashwin after the latter announced his retirement from international cricket. Ashwin called time in his career after the Gabba Test against Australia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/amid-r-ashwins-retirement-call-ravi-shastri-recalls-ms-dhonis-surprise-call-in-2014-2651848-2024-12-18",
      "headline": "Amid R Ashwin's retirement, Ravi Shastri recalls Dhoni's 'surprise' call in 2014As Ravichandran Ashwin announced his retirement from international cricket, Ravi Shastri recalled when MS Dhoni called it a time on his Test career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-kl-rahul-ravindra-jadeja-sunil-gavaskar-exclusive-2651826-2024-12-18",
      "headline": "KL Rahul, Ravindra Jadeja's resolve in Gabba augurs well for India: Sunil Gavaskar AUS vs IND: In an interview with India Today, Sunil Gavaskar said that KL Rahul and Ravindra Jadeja's knocks in the third Test at the Gabba would keep India in good stead ahead before the remaining two Test matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-announce-test-squad-for-all-important-2-match-series-vs-pakistan-2651809-2024-12-18",
      "headline": "South Africa announce Test squad for all-important 2-match series vs PakistanSouth Africa announced a 16-member squad for the 2-match Test series vs Pakistan. Corbin Bosch and Kwena Maphaka earned their maiden Test call-ups as the series will be crucial in the lead-up to the WTC final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/r-ashwin-retires-what-pushed-indias-best-red-ball-spinner-to-call-it-quits-2651768-2024-12-18",
      "headline": "R Ashwin retires: What pushed India's best red-ball spinner to call it quitsRavichandran Ashwin's decision to retire from international cricket has shaken Indian cricket. Despite being India's best red-ball spinner, non-selection controversies and undervaluation of specialist skills likely influenced his decision.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-r-ashwin-retirement-parting-speech-dressing-room-gabba-2651781-2024-12-18",
      "headline": "Watch: Retiring R Ashwin's emotional parting speech at Gabba dressing room Australia vs India, 3rd Test: R Ashwin addressed the Indian dressing room, hours after announcing his retirement from international cricket. While thanking Rohit Sharma, Virat Kohli and Gautam Gambhir, Ashwin said the 'cricket nut' in him will keenly follow the rest of the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravi-ashwin-retirement-date-nathan-lyon-pat-cummins-signed-shirt-ind-vs-aus-bgt-2651776-2024-12-18",
      "headline": "Nathan Lyon, Pat Cummins present signed Australian shirt to R AshwinAustralia cricketers Nathan Lyon and Pat Cummins presented Ravichandran Ashwin with a signed shirt. Cummins congratulated Ashwin on his stellar career during their short interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharmas-emotional-farewell-message-for-r-ashwin-you-are-a-true-og-2651751-2024-12-18",
      "headline": "Rohit Sharma's emotional farewell message for R Ashwin: You are a true OGRohit Sharma penned down an emotional message for Ravichandran Ashwin as the veteran spinner announced his retirement from international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-t20i-series-win-mehidy-hasan-2651741-2024-12-18",
      "headline": "Bangladesh bounce back from ODIs heartbreak to win T20I series WI vs BAN: Bangladesh beat West Indies by 27 runs on Tuesday in St Vincent to claim the series 2-0. Shamim Hossain Patowary won the Player of the Match award for his 35-run knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-r-ashwin-retirement-parting-speech-dressing-room-gabba-2651781-2024-12-18",
      "headline": "Watch: Retiring R Ashwin's emotional parting speech at Gabba dressing room Australia vs India, 3rd Test: R Ashwin addressed the Indian dressing room, hours after announcing his retirement from international cricket. While thanking Rohit Sharma, Virat Kohli and Gautam Gambhir, Ashwin said the 'cricket nut' in him will keenly follow the rest of the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravi-ashwin-retirement-date-nathan-lyon-pat-cummins-signed-shirt-ind-vs-aus-bgt-2651776-2024-12-18",
      "headline": "Nathan Lyon, Pat Cummins present signed Australian shirt to R AshwinAustralia cricketers Nathan Lyon and Pat Cummins presented Ravichandran Ashwin with a signed shirt. Cummins congratulated Ashwin on his stellar career during their short interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharmas-emotional-farewell-message-for-r-ashwin-you-are-a-true-og-2651751-2024-12-18",
      "headline": "Rohit Sharma's emotional farewell message for R Ashwin: You are a true OGRohit Sharma penned down an emotional message for Ravichandran Ashwin as the veteran spinner announced his retirement from international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-t20i-series-win-mehidy-hasan-2651741-2024-12-18",
      "headline": "Bangladesh bounce back from ODIs heartbreak to win T20I series WI vs BAN: Bangladesh beat West Indies by 27 runs on Tuesday in St Vincent to claim the series 2-0. Shamim Hossain Patowary won the Player of the Match award for his 35-run knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-retirement-date-ind-vs-aus-bgt-sachin-tendulkar-2651731-2024-12-18",
      "headline": "Tendulkar on Ashwin's retirement: One of India's greatest match winnersLegendary Sachin Tendulkar hailed Ravichanadran Ashwin as one of India's greatest match winners. Sachin's comments came after the player's shock retirement decision after the conclusion of the Gabba Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-r-ashwin-sunil-gavaskar-melbourne-2651725-2024-12-18",
      "headline": "Ashwin could have come in handy in Melbourne and Sydney Tests: Sunil Gavaskar AUS vs IND: Legendary batter Sunil Gavaskar said that R Ashwin retiring midway in a Test series may disrupt India's plans for the remainder of their matches in the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/late-soldiers-son-from-sehwag-international-school-selected-for-vijay-merchant-trophy-2651724-2024-12-18",
      "headline": "Soldier's son from Virender Sehwag's school selected for Vijay Merchant TrophyRahul Soreng, son of the late Pulwama hero Vijay Soreng, has made it to the Haryana Under-16 team for the Vijay Merchant Trophy. A proud moment celebrated by Virender Sehwag, showcasing the power of opportunity and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-pat-cummins-r-ashwin-retirement-2651681-2024-12-18",
      "headline": "Pat Cummins praises 'all-time great' R Ashwin on retirement AUS vs IND: Pat Cummins said that he was surprised after R Ashwin announced his retirement from international cricket. Ashwin took the call after the Gabba Test against Australia in Brisbane. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}