{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-drops-over-10-percent-this-week-5-reasons-behind-this-fall-2686345-2025-02-27",
      "headline": "Bitcoin sees 10% drop this week: 5 reasons behind the fallThe largest crypto has witnessed a decline of more than 10% over the last seven days. This downward trend comes amid US President Donald Trump's aggressive trade policies and EU tariff threats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-seeks-to-cut-states-share-of-central-taxes-explained-check-impact-2686346-2025-02-27",
      "headline": "Government seeks to cut states' share of central taxes: ReportBased on the expected tax collections for the ongoing financial year, a 1% swing in the states' share of tax revenue could give the central government about Rs 3,500 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-tumble-4-percent-this-month-should-share-market-investors-be-worried-2686334-2025-02-27",
      "headline": "Sensex, Nifty tumble 4% this month: Should share market investors be worried? Brokerage firm Emkay Global said falling prices make market investors nervous, but there are good signs too. The RBI lowering risk for NBFCs and micro-borrowers helps, and Nifty is now priced better at around 22,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-trainees-complain-to-pm-office-over-forceful-layoffs-mysuru-campus-report-2686326-2025-02-27",
      "headline": "Infosys trainees complain to PM's Office over 'forceful' layoffs: ReportThe employees have sought intervention to be reinstated in their jobs and to prevent similar terminations in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-golden-visa-trump-gold-card-visa-5-key-things-you-need-to-know-about-5-million-path-to-us-citizenship-2686297-2025-02-27",
      "headline": "Trump Gold Card Visa: 5 key things you need to knowUS President Donald Trump believes the new visa will attract wealthy individuals to the US who will spend large sums, pay high taxes, and boost the economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-nuvama-cut-spicejet-share-price-target-despite-profit-in-q3-2686307-2025-02-27",
      "headline": "Explained: Why Nuvama cut Spicejet share price target despite profit in Q3SpiceJet attributed its Q3 performance to strong passenger demand, better efficiency, and smarter pricing. In the third quarter, the company's revenue jumped 35% to Rs 1,651 crore, and occupancy stayed at 87%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-partners-with-perplexity-for-ai-powered-search-feature-on-app-2686295-2025-02-27",
      "headline": "Paytm partners with Perplexity for AI-powered search feature on appPaytm says this move is to keep up with growing digital demand. The AI search will work in local languages, making it easier for people to use."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ultratech-cement-shares-price-fall-6-percent-why-reason-polycab-india-havells-india-kei-industries-rr-kabel-2686284-2025-02-27",
      "headline": "Explained: Why UltraTech Cement shares fell 6% todayUltraTech Cement Ltd shares fell 6%. The stock opened at Rs 10,796.15 after having closed at Rs 10,968.45 in the previous session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rbi-bank-bandhan-bank-au-small-finance-bank-shares-are-rising-today-2686275-2025-02-27",
      "headline": "Why RBI Bank, Bandhan Bank, AU Small Finance Bank shares are rising today? Shares of RBL Bank, Bandhan Bank, AU Small Finance Bank, IDFC First Bank, and IndusInd Bank gained up to 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multiple-uans-here-how-to-consolidate-them-effective-epf-management-2686271-2025-02-27",
      "headline": "Do you have multiple UANs? Here's how to merge them Every time you join a new company, give your employer the existing UAN so they don't create another. If they've already made a new one, you need to merge it with your old one."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-stake-sale-in-five-psu-banks-up-to-20-percent-ofs-qip-report-2686251-2025-02-27",
      "headline": "5 PSU banks may see government stake sale of up to 20%: ReportThe government is working on a plan in consultation with the Department of Investment and Public Asset Management (DIPAM), the Department of Financial Services (DFS), and state-run banks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-as-banking-and-financial-stocks-gain-in-early-trade-2686229-2025-02-27",
      "headline": "Sensex, Nifty open higher as banking and financial stocks gain in early tradeThe S&P BSE Sensex gained 115.61 points to 74,717.73, while the NSE Nifty50 added37.30 points to 22,584.85 as of 9:20 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-todaytop-3-stocks-deliver-good-return-near-term-bajaj-finance-bajaj-finserv-cholamandalam-holdings-2686222-2025-02-27",
      "headline": "Stock market today: Top 3 stocks that could deliver good return in near term Since peaking at an all-time high in September last year, Dalal Street has seen nearly a 12% correction, leading investors to search for stocks that could offer gains despite market uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-best-place-to-invest-why-is-world-bank-bullish-dalal-street-despite-fii-sell-off-2686213-2025-02-27",
      "headline": "Best place to invest: Why is World Bank bullish on India despite FII sell-off?World Bank Country Director Auguste Tano Kouame, while speaking at the Advantage Assam 2.0 Business Summit, dismissed concerns over the recent market downturn and reaffirmed confidence in India's growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/100-crore-indians-have-no-extra-money-to-spend-report-2686042-2025-02-26",
      "headline": "100 crore Indians have no extra money to spend: ReportA report by a venture capital firm, Blume Ventures, says India's 'consuming class' comprises roughly 140 million people. But about 1 billion (100 crore) Indians do not have the kind of incomes to be able to spend anything on discretionary good."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-planning-universal-pension-scheme-who-will-it-benefit-check-details-eligibility-2685950-2025-02-26",
      "headline": "Government plans Universal Pension Scheme: Who will benefit?The ministry of labour and employment is working on the proposed plan, which is expected to bring existing pension schemes under one framework. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-european-union-trade-tariff-cut-cars-wine-boost-ties-reduce-china-dependence-2685923-2025-02-26",
      "headline": "Explained: Why European Union wants India to cut tariffs on cars, wineApart from trade, the EU also sees India as an important security partner, given rising cyber threats and tensions in regions like the South China Sea and the Indo-Pacific."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/azad-engineering-qip-launch-rs-700-crore-all-you-need-to-know-share-price-2685905-2025-02-26",
      "headline": "Azad Engineering launches Rs 700 crore QIP: All you need to knowThe company's board approved the opening of the issue on February 25 for the QIP of equity shares with a face value of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-only-carmaker-to-wrongly-classify-car-imports-tax-authorities-2685885-2025-02-26",
      "headline": "Volkswagen only carmaker to wrongly classify car imports: Tax authoritiesIndia says Volkswagen used a clandestine scheme to import auto parts in separate shipments, to evade detection and cut taxes, instead of declaring items as \"completely knocked down\", or CKD, units that face higher taxes of 30% to 35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-gold-real-estate-which-investment-can-make-you-richer-where-to-invest-money-expert-view-2685862-2025-02-26",
      "headline": "Gold, stocks, or property: Which investment can make you richer?More people are turning to stocks, gold, and real estate to grow their wealth, but choosing the right one can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capgemini-ceo-ashwin-yardi-on-ideal-workweek-not-90-70-not-even-50-hours-2685788-2025-02-26",
      "headline": "Capgemini CEO on ideal workweek: Not 90, not 70, not even 50 hoursCapgemini India's CEO, Ashwin Yardi, has introduced a different perspective, one that supports a more balanced approach in the debate about work-life balance and working hours in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-like-bel-hal-are-in-a-slump-3-reasons-why-analysts-are-bullish-2685763-2025-02-26",
      "headline": "Defence stocks like BEL, HAL are in a slump. Is it an opportunity to buy? Even after the drop, analysts remain bullish about defence stocks. In the case of BEL, 24 out of 27 analysts have a 'buy' rating on the stock. Most analysts also remain positive about HAL's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-tumble-nearly-9-percent-market-value-dips-below-1-trillion-dollar-key-reasons-2685741-2025-02-26",
      "headline": "Tesla shares tumble nearly 9%, market value dips below $1 trillion. Here's whyTesla share price: The decline followed data from the European Automobile Manufacturers Association, which reported Tesla's sales in Europe fell 45% in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-44-percent-from-52-week-high-should-you-buy-the-dip-2685727-2025-02-26",
      "headline": "Tata Motors shares down 44% from 52-week high. Should you buy the dip?Tata Motors shares: In the previous trading session, the stock closed lower 1.2% lower at Rs 660.30. So far this year, it's lost over 11%. In six months, it's down 40%. Over a year, it's fallen 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-lending-rules-ease-in-borrowing-for-small-borrowers-and-nbfcs-what-it-means-2685720-2025-02-26",
      "headline": "RBI eases lending rules for small borrowers and NBFCs. Here's what it meansThe RBI has also put on hold its earlier proposals to increase the capital that banks must set aside for new project loans and the liquidity they need to maintain for digital deposits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/new-india-co-op-bank-vault-had-12-times-its-capacity-on-paper-rs-122-crore-report-2685718-2025-02-26",
      "headline": "New India Co-op Bank vault had 12 times its capacity on paper: Report The Mumbai Police's Economic Offences Wing (EOW) is probing an alleged Rs 122-crore embezzlement at the bank and has arrested three people so far, including two former senior executives of the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-employees-get-5-to-8-percent-salary-hikes-lower-than-before-report-2685688-2025-02-26",
      "headline": "Infosys employees get 5-8% salary hikes, lower than before: ReportThe IT firm sent salary revision letters to employees, offering hikes between 5% and 8% for most, depending on their performance rating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/failed-to-deposit-tds-tcs-officials-may-be-knocking-soon-income-tax-department-notice-2685678-2025-02-26",
      "headline": "Failed to deposit TDS? Tax officials may be knocking soonAround 40,000 taxpayers are under scrutiny for potential defaults in tax deductions for the financial years 2022-23 and 2023-24."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/personal-loan-5-hidden-charges-by-banks-you-must-check-2685448-2025-02-25",
      "headline": "Applying for personal loan? 5 hidden charges you must check While banks may not disclose the hidden charges when applying for personal loans, borrowers must understand them when applying for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-dip-check-indusind-dcb-bank-city-union-and-other-top-banks-2685370-2025-02-25",
      "headline": "FD rates dip: Check IndusInd, DCB, City Union and other top banksWith a drop in FD interest rates, depositors might witness a marginal decline in their earnings on fixed deposits.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jubilant-foodworks-issues-clarification-on-fir-against-chairman-2685338-2025-02-25",
      "headline": "Chairman says allegations are false: Jubilant FoodWorks after reports of FIRIn a stock exchange filing, Jubilant FoodWorks said its Chairman Shyam Sundar Bhartia has denied all allegations against him, calling them \"baseless, false and disparaging, and made with clear malafide intent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-markets-stay-range-bound-as-cautious-sentiment-prevails-sensex-gains-nifty-loses-2685279-2025-02-25",
      "headline": "Sensex gains, Nifty loses: Markets stay range-bound as cautious sentiment prevailsThe S&P BSE Sensex gained 147.71 points to close at 74,602.12, while the NSE Nifty50 lost 5.80 points to end at 22,547.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-withdrawal-relief-for-new-india-cooperative-bank-depositors-check-details-here-2685236-2025-02-25",
      "headline": "RBI withdrawal relief for New India Co-op Bank depositors. Check details hereThis announcement comes just over a week after the central bank prohibited the bank from issuing new loans, dissolved its board and took control owing to 'supervisory concerns.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sell-india-buy-china-why-foreign-investors-are-shifting-bets-2685237-2025-02-25",
      "headline": "Sell India, Buy China: Why FIIs are falling out of love with Dalal StreetDalal Street has witnessed correction over the past six months, with the Nifty50 plummeting from 25,200 levels to around 22,500 levels by the end of February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bets-big-on-assam-to-invest-rs-50000-crore-in-next-5-years-summit-pm-modi-2685213-2025-02-25",
      "headline": "Reliance bets big on Assam, to invest Rs 50,000 crore in next 5 yearsManaging Director Mukesh Ambani announced an investment of Rs 50,000 crore in Assam. A major part of Reliance's investment will be directed towards making Assam a leader in technology and artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hungary-announces-tax-exemption-for-mothers-with-2-or-more-children-2685199-2025-02-25",
      "headline": "Hungary announces tax exemption for mothers with 2 or more children The said announcement comes ahead of the 2026 elections and is a part of Orban's efforts to boost the country's birth rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dbs-set-to-cut-4000-jobs-over-3-years-due-to-ai-says-ceo-2685206-2025-02-25",
      "headline": "DBS set to cut 4,000 jobs over 3 years due to AI, says CEODBS CEO Piyush Gupta said the bank will shrink its workforce by 10% in the next three years due to artificial intelligence replacing human roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hein-schumacher-to-step-down-as-unilever-ceo-in-march-2685192-2025-02-25",
      "headline": "Hein Schumacher to step down as Unilever CEO in MarchThe departure comes just weeks after Unilever announced underwhelming full-year earnings and chose Amsterdam over London and New York as the primary listing for its ice cream business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-10-percent-today-ipo-news-group-company-details-2685184-2025-02-25",
      "headline": "Explained: Why Tata Investment share price jumped 10% todayAt around 12:56 pm, shares of the non-banking financial company were up 7.65% to Rs 6,195.85 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-universal-pension-scheme-here-all-you-need-to-know-2685156-2025-02-25",
      "headline": "What is Universal Pension Scheme? Here's all you need to know With India's senior citizen population aged 60 years and above expected to touch 227 million by 2036, a comprehensive social security or pension scheme is necessary."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/o-saathi-re-new-netflix-show-imtiaz-ali-aditi-rao-hydari-avinash-tiwary-arjun-rampal-2686276-2025-02-27",
      "headline": "O Saathi Re: Imtiaz Ali's Netflix series is a modern story with a vintage heartNetflix has released the first look of its new series O Saathi Re, starring Avinash Tiwary, Aditi Rao Hydari, and Arjun Rampal. The series, directed by Arif Ali, will be an 'ode to vintage love in modern times'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-hilarious-dance-mere-husband-mujhko-piyar-nahi-karte-at-sangeet-watch-2686265-2025-02-27",
      "headline": "Prajakta Koli hilariously dances to 'Mere Husband Mujhko Piyar…' at sangeet. WatchPrajakta Koli danced to Mere Husband Mujhko Piyar Nahin Karte at her sangeet, leaving guests in splits. She married Vrishank Khanal in Karjat on February 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kj-yesudas-hospitalised-chennai-old-age-2686238-2025-02-27",
      "headline": "Vijay Yesudas reacts to fake news about father Yesudas's hospitalisationReports were rife that playback singer Yesudas was hospitalised in Chennai due to age-related illness. His son and playback singer Vijay Yesudas exclusively spoke to India Today and shut down the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sex-education-actor-alexander-westwood-jailed-for-15-years-for-multiple-sex-offenses-2685969-2025-02-26",
      "headline": "Sex Education actor Alexander Westwood jailed for 15 years for sex offencesSex Education actor Alexander Westwood received a 15-year prison sentence for multiple sex offenses. The case has captured widespread media attention due to Westwood's role in the popular Netflix show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-1-ending-explained-pammi-aaditi-pohankar-revenge-baba-nirala-bobby-deol-prakash-jha-2685961-2025-02-26",
      "headline": "Aashram 3 Part 1 ending explained: Will Pammi's revenge end Baba Nirala's reign?With Aashram Season 3 Part 2 releasing on February 27, let us take a look at how the season ended on a cliffhanger with Baba Nirala's misuse of power and a change in dynamics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-jasleen-royal-criticism-coldplay-opening-one-bad-act-wont-damage-reputation-of-indian-2685917-2025-02-26",
      "headline": "Amit Trivedi says Jasleen Royal's opening act for Coldplay was 'unfortunate'Amit Trivedi, in an interview with India Today Digital, discussed the controversy over Jasleen Royal's opening act for Coldplay's India tour and whether it would impact on the image of Indian artists."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-trying-to-save-marriage-with-bianca-censori-report-2685911-2025-02-26",
      "headline": "Rapper Kanye West trying to save marriage with Bianca Censori: ReportKanye West is reportedly trying to prevent his marriage with Bianca Censori from ending. An insider reveals that Bianca is considering divorce, and Kanye is panicking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/euphoria-palash-sen-akshay-kumar-bollywood-mahakal-chalo-mahashivratri-2685899-2025-02-26",
      "headline": "Singer Palash Sen on working with Akshay Kumar, not being 'accepted' by BollywoodEuphoria's lead vocalist Palash Sen spoke to India Today Digital about collaborating with Bollywood star Akshay Kumar on the song Mahakal Chalo, work opportunities in the Hindi film industry, and more in an exclusive interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-vandana-lalwani-separate-9-years-of-marriage-2685910-2025-02-26",
      "headline": "Actors Aman Verma and Vandana Lalwani to separate after 9 years of marriageActors Aman Verma and Vandana Lalvani are separating after nine-years of marriage. Amid growing speculation, Aman has addressed the rumours about their relationship. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-abhishek-bachchan-inayat-verma-prime-video-series-release-date-2685817-2025-02-26",
      "headline": "Be Happy: Abhishek Bachchan, Inayat Verma series to stream in MarchThe streaming date of Abhishek Bachchan and Inayat Verma-starrer Be Happy is out. It promises to be a touching film about a single father's journey to support his daughter's dream of performing on a dance reality show."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-delimitation-makes-south-india-nervous-2686324-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why are southern states wary of delimitation? Understanding the exerciseThe sceptre of delimitation has once again shrouded Tamil Nadu, and other southern states. But why are they so nervous? It has much to do with the reduction in their representation in Parliament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/maharashtra-satara-woman-neelam-shinde-accident-us-family-seeks-visa-2686269-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre requests emergency US visa for family of injured Indian student: SourcesAs a result of the accident on February 14, Neelam Shinde suffered serious injuries to her head, hands, legs and chest. She also had to undergo immediate surgery and is currently in critical condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-not-happy-with-dk-shivakumar-thanking-sadhguru-2686280-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shivakumar faces Congress heat over Sadhguru invite: Aligns with RSS narrativeA Congress leader questioned DK Shivakumar's loyalties after the latter posted a thank you note to Sadhguru. Shivakumar was thanking Sadhguru for his invitation to celebrate Mahashivratri at Sadhguru's Isha Yoga Center in Coimbatore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bonnie-and-clyde-the-french-connection-hollywood-actor-gene-hackman-wife-betsy-dog-found-dead-inside-new-mexico-home-2686360-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oscar-winning actor Gene Hackman, wife Betsy and dog found dead at home: ReportTwo-time Oscar winner, actor Gene Hackman, was found dead at his New Mexico home on Thursday along with his wife, Betsy, and their dog. The police didn't suspect any foul play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/blue-ghost-sends-clearest-visuals-of-moon-giant-craters-await-underneath-2686336-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Blue Ghost sends clearest visuals of Moon, giant craters await underneathThe stunning footage, taken during the spacecraft's orbit around the Moon, provides a detailed view of the lunar terrain, showcasing its rugged and cratered landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-beawar-sexual-exploitation-charges-schoolgirls-minors-11-arrested-tensions-extortion-2686344-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan's Beawar tense after charges of sexual exploitation of schoolgirlsCommunal tension has gripped areas of Rajasthan's Beawar after charges that several schoolgirls were sexually exploited and blackmailed, and attempts were made at religious conversion. Markets were shut down in several areas and rallies taken out, demanding justice. Police have detained 11 accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-slams-build-first-regularise-later-approach-rejects-plea-against-demolition-2686188-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Court slams 'build first, regularise later' approach, rejects plea over demolitionThe Bombay High Court dismissed a petition challenging the demolition of an illegal structure, warning against the widespread belief that unauthorised constructions can be regularised later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-firms-can-now-hire-indian-graduates-under-trumps-gold-card-citizenship-plan-2686197-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US firms can now hire Indian graduates under 'gold card' citizenship plan: TrumpUS President Donald Trump announced that American companies can now hire Indian graduates from US universities under the new 'gold card' citizenship plan. Trump emphasised that the current system has forced top Indian talent to leave the US, missing key opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/two-cbse-class-10-board-exams-from-2026-draft-proposal-explained-2686315-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two CBSE Class 10 board exams from 2026: Draft proposal explainedCBSE's proposal to introduce two board exams for Class 10 has sparked discussions among students, parents, and educators. The new system, expected to be implemented in 2026, aims to provide flexibility by allowing students to appear for either of the two exams or both. Here are the highlights of the CBSE draft proposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/where-is-arvind-kejriwal-aap-chief-punjab-election-strategy-2686332-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As AAP firefights BJP in Delhi, where is Arvind Kejriwal?Arvind Kejriwal, who was defeated by the BJP's Parvesh Verma, was last seen publicly on February 23 at the AAP legislative party meeting where Atishi was announced as leader of the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-trainees-complain-to-pm-office-over-forceful-layoffs-mysuru-campus-report-2686326-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Infosys trainees complain to PM's Office over 'forceful' layoffs: ReportThe employees have sought intervention to be reinstated in their jobs and to prevent similar terminations in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/two-men-publicly-flogged-in-indonesia-for-gay-sex-dozens-watch-2686357-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two men publicly flogged in Indonesia for gay sex, dozens watchWhile gay sex is not illegal elsewhere in Indonesia -- the world's most populous Muslim-majority nation -- it is outlawed in Aceh, which imposes a version of sharia, the Islamic legal code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-techie-compares-work-culture-in-india-and-the-uk-after-moving-to-london-2686305-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie compares work culture in India and the UK after moving to LondonReflecting on his experiences, Arnav Gupta observed a stark contrast in the work culture between India and the UK. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-2686242-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Afghanistan winning is no shock: Cricket's elite have ambitious new rivalsAfghanistan's latest victory over England in the Champions Trophy 2025 reaffirms their place amongst cricket's elite, proving their success is no longer an underdog story. Overcoming war, instability, and infrastructural challenges, the Afghan men's team has written its success story in 2X speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aaps-big-charge-mlas-not-being-allowed-to-enter-delhi-assembly-2686246-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suspended AAP MLAs blocked from Delhi Assembly in new showdown with BJPAAP leaders claimed they were blocked from entering the Delhi Assembly on Thursday, alleging barricades were placed on the entry road to stop them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/mk-stalin-slams-hindi-push-says-regional-languages-are-disappearing-2686337-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin says Hindi erased 25 regional languages, many gasping for survivalTamil Nadu MK Stalin accused Hindi of swallowing regional languages and erasing diversity. He reiterated Tamil Nadu's opposition to the Centre's three-language policy, insisting on Tamil and English. Several regional tongues that he claimed were 'gasping for survival', he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-is-mono-diet-and-is-it-even-practical-2686223-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is mono diet, and is it even practical?The mono diet may seem like a quick fix for your weight loss woes, but it might not be as sustainable or practical as it appears."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-girl-rape-blackmail-multiple-times-tuition-teacher-threat-mental-harassment-2686293-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi teen repeatedly raped, blackmailed by tuition teacher for 3 yearsIn her complaint, the girl, a resident of the Chittaranjan Park area in South Delhi, said she had been attending classes at the tuition centre for the past three years from 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/no-class-10-pass-without-punjabi-punjab-government-strict-order-to-schools-after-cbse-draft-2686199-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjabi must to pass Class 10: State government's strict order after CBSE draftThe Punjab government has made Punjabi mandatory for Class 10, requiring all schools to teach it as a primary subject. Schools failing to comply will face action under the Punjab Learning of Punjabi and Other Languages Act, 2008."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pune-rape-case-cops-form-13-teams-to-arrest-accused-ajit-pawar-demands-death-penalty-2686239-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Out on bail, Pune rape accused used mask to hide identity, manhunt to arrest himA history-sheeter out on bail since 2019 allegedly raped a 26-year-old woman inside a stationary state transport bus at the busy Swargate bus station in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/katrina-kaif-peaceful-austrian-escape-2686329-2025-02-27#?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Katrina Kaif's peaceful Austrian escape: Time comes to a standstillKatrina Kaif shared breathtaking glimpses from her serene Austria vacation, enjoying snow-clad mountain walks and tranquil lake views. She called the trip a \"perfect reset.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-nitish-kumar-cabinet-rejig-new-ministers-portfolios-allocated-check-list-2686363-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Bihar ministers get portfolios, Mangal Pandey gets law in Cabinet rejigHealth Minister Mangal Pandey has been given the additional responsibility of the Law Department, while information technology has been taken back from Santosh Suman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/guru-randhawa-supports-government-move-to-make-punjabi-mandatory-in-schools-2686266-2025-02-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Guru Randhawa supports government's move to make Punjabi mandatory in schoolsSinger Guru Randhawa on Thursday shared a post on X supporting the Punjab government's decision to make Punjabi mandatory in schools irrespective of which board they are affiliated to. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-closes-fraud-case-against-hdil-promoters-rakesh-wadhawan-son-2686155-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai Police closes fraud case against real estate developers Rakesh Wadhawan, sonThe case involved allegations of illegal sale of office units in the Kaledonia commercial tower in Andheri East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bonnie-and-clyde-the-french-connection-hollywood-actor-gene-hackman-wife-betsy-dog-found-dead-inside-new-mexico-home-2686360-2025-02-27",
      "headline": "Oscar-winning actor Gene Hackman, wife Betsy and dog found dead at home: ReportTwo-time Oscar winner, actor Gene Hackman, was found dead at his New Mexico home on Thursday along with his wife, Betsy, and their dog. The police didn't suspect any foul play. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/mouni-roy-celebrates-mahashivratri-at-sadhguru-aashram-photos-2686338-2025-02-27",
      "headline": "Mouni Roy celebrates Mahashivratri at Sadhguru's aashram: A night of awakeningActor Mouni Roy shared a glimpse of her Mahashivratri celebrations at Sadhguru's Isha Foundation on Thursday. She posted the pictures on her Instagram handle. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/havoc-teaser-tom-hardy-bruised-detective-gareth-evans-directed-action-film-2686311-2025-02-27",
      "headline": "Havoc teaser: Tom Hardy is a bruised detective in Gareth Evans' upcoming actionerTom Hardy will next be seen in the role of Detective Walker in the upcoming film, Havoc. The film arrives in Netflix on April 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/katrina-kaif-peaceful-austrian-escape-2686329-2025-02-27",
      "headline": "Katrina Kaif's peaceful Austrian escape: Time comes to a standstillKatrina Kaif shared breathtaking glimpses from her serene Austria vacation, enjoying snow-clad mountain walks and tranquil lake views. She called the trip a \"perfect reset.\""
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-new-head-coach-yograj-singh-suggestion-aaqib-javed-2686365-2025-02-27",
      "headline": "Clash of Champions: Pakistan's new coach? Yograj Singh has a bold suggestionPakistan's turbulent run, capped by an early Champions Trophy exit, has reignited talks of another coaching change. If PCB moves on from Aaqib Javed, Yograj Singh has made a bold and unexpected suggestion for Pakistan's next head coach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-press-conference-semi-final-qualification-2686355-2025-02-27",
      "headline": "Afghanistan won't put pressure on themselves thinking of semis: ShahidiAfghanistan captain Hasmatullah Shahidi has claimed that his side won't pressure on themselves too much by thinking about qualifying into the semi-finals of the Champions Trophy. Afghanistan defeated England by 8 runs to retain hope of making it to the final four rounds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jonathan-trott-press-conference-lahore-2686341-2025-02-27",
      "headline": "Self-belief in Afghanistan squad is quite infectious: coach Jonathan TrottAfghanistan coach Jonathan Trott has claimed that the self-belief within the squad is quite infectious. Afghanistan defeated England to remain in the hunt for a spot in the Champions Trophy semi-finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-live-score-rawalpindi-weather-rizwan-shanto-2686330-2025-02-27",
      "headline": "PAK vs BAN Champions Trophy Live: Toss delayed due to rain in RawalpindiChampions Trophy, Pakistan (PAK) vs Bangladesh (BAN) Updates: The toss for the clash between Pakistan and Bangladesh has been delayed due to consistent rain at Rawalpindi. The two sides are playing for pride as both teams are out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-nasser-hussain-michael-atherton-jos-buttler-captaincy-move-on-2686320-2025-02-27",
      "headline": "England legends urge team to move on from captain Jos Buttler: He is doneMichael Atherton and Nasser Hussain believe Jos Buttler's England captaincy has run its course after their Champions Trophy exit. With mounting criticism, England may soon consider a leadership change following a string of poor performances under Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajasthan-wushu-player-dies-of-heart-attack-during-match-at-chandigarh-university-2686316-2025-02-27",
      "headline": "Rajasthan Wushu player dies of heart attack during match at Chandigarh UniversityMohit, a 21-year-old Wushu player from Rajasthan, suffered a fatal heart attack during a championship match at Chandigarh University on Monday, February 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-wushu-player-dies-due-to-heart-attack-while-competing-in-chandigarh-2686313-2025-02-27",
      "headline": "Rajasthan's Wushu player dies due to heart attack while competing in ChandigarhMohit Sharma, a Wushu player from Rajasthan University, collapsed due to a heart attack in the ring while competing at the All India Inter University Wushu Championship at Chandigarh University on Monday, February 24. Despite immediate medical assistance, he was declared dead at the hospital in Kharar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-press-conference-lahore-2686292-2025-02-27",
      "headline": "Got to work out if I am part of the problem or solution for England: Jos ButtlerEngland captain Jos Buttler has admitted that he needs to work out if he is part of the problem or solution for England after their Champions Trophy 2025 exit. England have been going through a rough patch in white-ball cricket, with the loss to Afghanistan being the latest low point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-vs-bangladesh-work-under-system-mohammed-salahudin-2686289-2025-02-27",
      "headline": "Bangladesh need to work on improving their system: Mohammed SalahudinBangladesh assistant coach emphasised the need for a structured system to improve performances, stating that past Champions Trophy defeats won't affect their mindset ahead of their final group-stage clash against Pakistan. The focus remains on learning and executing a stronger game plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-rawalpindi-weather-forecast-updates-2686283-2025-02-27",
      "headline": "PAK vs BAN Rawalpindi weather forecast: Will rain wash out dead rubber?Pakistan and Bangladesh are aiming to finish off their campaign on a positive note as both teams are set to lock horns in Rawalpindi on February 27. But will weather play spoilsport on Thursday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajasthan-wushu-player-dies-of-heart-attack-during-match-at-chandigarh-university-2686316-2025-02-27",
      "headline": "Rajasthan Wushu player dies of heart attack during match at Chandigarh UniversityMohit, a 21-year-old Wushu player from Rajasthan, suffered a fatal heart attack during a championship match at Chandigarh University on Monday, February 24. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/rajasthans-wushu-player-dies-due-to-heart-attack-while-competing-in-chandigarh-2686313-2025-02-27",
      "headline": "Rajasthan's Wushu player dies due to heart attack while competing in ChandigarhMohit Sharma, a Wushu player from Rajasthan University, collapsed due to a heart attack in the ring while competing at the All India Inter University Wushu Championship at Chandigarh University on Monday, February 24. Despite immediate medical assistance, he was declared dead at the hospital in Kharar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-press-conference-lahore-2686292-2025-02-27",
      "headline": "Got to work out if I am part of the problem or solution for England: Jos ButtlerEngland captain Jos Buttler has admitted that he needs to work out if he is part of the problem or solution for England after their Champions Trophy 2025 exit. England have been going through a rough patch in white-ball cricket, with the loss to Afghanistan being the latest low point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-vs-bangladesh-work-under-system-mohammed-salahudin-2686289-2025-02-27",
      "headline": "Bangladesh need to work on improving their system: Mohammed SalahudinBangladesh assistant coach emphasised the need for a structured system to improve performances, stating that past Champions Trophy defeats won't affect their mindset ahead of their final group-stage clash against Pakistan. The focus remains on learning and executing a stronger game plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-bangladesh-rawalpindi-weather-forecast-updates-2686283-2025-02-27",
      "headline": "PAK vs BAN Rawalpindi weather forecast: Will rain wash out dead rubber?Pakistan and Bangladesh are aiming to finish off their campaign on a positive note as both teams are set to lock horns in Rawalpindi on February 27. But will weather play spoilsport on Thursday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mitchell-starc-australia-squad-withdrawal-reasons-wtc-final-2686264-2025-02-27",
      "headline": "Ankle pain, personal views: Mitchell Starc cites Champions Trophy withdrawal reasonsAustralia pacer Mitchell Starc said that ankle pain and some personal views were the reasons behind him withdrawing from the Champions Trophy 2025 squad. Starc is one of the big names missing from the Australia squad for the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-afghanistan-vs-england-jonathan-trott-will-never-be-taken-lightly-2686259-2025-02-27",
      "headline": "Afghanistan will never be taken lightly again: Coach Jonathan TrottAfghanistan head coach Jonathan Trott stressed that his team's thrilling win over England wasn't just about the result but about establishing Afghanistan as a side that commands respect. He reiterated their mission to ensure no opponent ever underestimates them, regardless of their stature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jos-buttler-captaincy-tag-afghanistan-vs-england-enjoy-it-2686252-2025-02-27",
      "headline": "Jos Buttler ready to lead England even without captaincy tag: I enjoy itJos Buttler remains unfazed by captaincy criticism after England's Champions Trophy exit, stating his leadership goes beyond just the title. Meanwhile, Afghanistan's historic win keeps their semi-final hopes alive, leaving Australia and South Africa in contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/anthony-albanese-australia-womens-football-team-marty-sheargold-2686243-2025-02-27",
      "headline": "Anthony Albanese slams presenter for offensive Australia women's football team remarkAustralia Prime Minister Anthony Albanese has slammed the remarks made by radio host Marty Sheargold for his offensive comments about the Australia women's football team. Sheargold called the Matildas a 'group of high school girls.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-2686242-2025-02-27",
      "headline": "Afghanistan winning is no shock: Cricket's elite have ambitious new rivalsAfghanistan's latest victory over England in the Champions Trophy 2025 reaffirms their place amongst cricket's elite, proving their success is no longer an underdog story. Overcoming war, instability, and infrastructural challenges, the Afghan men's team has written its success story in 2X speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-congratulations-reaction-vs-england-sachin-tendulkar-social-media-2686226-2025-02-27",
      "headline": "How cricket greats reacted to AFG beating ENG, ft Sachin TendulkarAfghanistan's stunning win over England in the Champions Trophy kept their semi-final hopes alive while knocking out the defending champions. Cricket legends, including Sachin Tendulkar and Shoaib Akhtar, showered praise on the team's heroic performance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-jos-buttler-captaincy-future-reaction-2686214-2025-02-27",
      "headline": "No emotional statements: Jos Buttler on England captaincy futureChampions Trophy 2025: Jos Buttler said that England should 'consider all possibilities' as far as choosing their next ODI captain is concerned. On Wednesday, the Three Lions lost to Afghanistan by eight runs at the Gaddafi Stadium in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-win-vs-england-shoaib-akshtar-message-gulbadin-naib-2686208-2025-02-27",
      "headline": "Shoaib Akhtar recalls message to Afghan player, celebrates England's exitShoaib Akhtar celebrated Afghanistan's historic Champions Trophy win over England, revealing how he had motivated Gulbadin Naib before the match. The Afghan side's thrilling victory also knocked England out of the semi-final race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-hasmatullah-shahidi-2686242-2025-02-27",
      "headline": "Afghanistan winning is no shock: Cricket's elite have ambitious new rivalsAfghanistan's latest victory over England in the Champions Trophy 2025 reaffirms their place amongst cricket's elite, proving their success is no longer an underdog story. Overcoming war, instability, and infrastructural challenges, the Afghan men's team has written its success story in 2X speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-congratulations-reaction-vs-england-sachin-tendulkar-social-media-2686226-2025-02-27",
      "headline": "How cricket greats reacted to AFG beating ENG, ft Sachin TendulkarAfghanistan's stunning win over England in the Champions Trophy kept their semi-final hopes alive while knocking out the defending champions. Cricket legends, including Sachin Tendulkar and Shoaib Akhtar, showered praise on the team's heroic performance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-england-jos-buttler-captaincy-future-reaction-2686214-2025-02-27",
      "headline": "No emotional statements: Jos Buttler on England captaincy futureChampions Trophy 2025: Jos Buttler said that England should 'consider all possibilities' as far as choosing their next ODI captain is concerned. On Wednesday, the Three Lions lost to Afghanistan by eight runs at the Gaddafi Stadium in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-win-vs-england-shoaib-akshtar-message-gulbadin-naib-2686208-2025-02-27",
      "headline": "Shoaib Akhtar recalls message to Afghan player, celebrates England's exitShoaib Akhtar celebrated Afghanistan's historic Champions Trophy win over England, revealing how he had motivated Gulbadin Naib before the match. The Afghan side's thrilling victory also knocked England out of the semi-final race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-win-vs-england-no-fluke-lahore-semi-final-berth-2686201-2025-02-27",
      "headline": "Afghanistan replicate Delhi heroics to show World Cup win was no fluke Champions Trophy 2025: Afghanistan are one win away from securing their maiden semi-final berth in the history of the tournament. On Wednesday, Hashmatullah Shahidi's men beat England by eight runs and knocked the Three Lions out of the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-pakistan-preview-rawalpindi-weather-2686050-2025-02-27",
      "headline": "Bangladesh, Pakistan look to salvage pride as rain threat looms largeChampions Trophy: Pakistan and Bangladesh will be looking to salvage some pride when they face each other, but there is a chance of rain in the penultimate Group A match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-up-warriorz-harmanpreet-2686182-2025-02-27",
      "headline": "All-round Nat Sciver-Brunt fires as Mumbai Indians hammer UP WarriorzWPL 2025: Nat Sciver-Brunt scored an unbeaten 75 and picked up three wickets as Mumbai Indians beat UP Warriorz by eight wickets on Wednesday to go to the top of the points table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-afghanistan-vs-england-strong-message-lahore-2686170-2025-02-27",
      "headline": "Thrilled by Afghan win, Ravi Shastri fires sharp message to England: No excusesFormer India head coach Ravi Shastri and other pundits congratulated Afghanistan following their stunning win over England in the ICC Champions Trophy 2025. Afghanistan beat England by eight runs to knock them out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-afghanistan-qualification-scenario-for-semi-finals-group-b-qualification-scenario-2686154-2025-02-26",
      "headline": "England knocked out, can Afghanistan qualify for semfinals from Group B?Afghanistan beat England by eight runs in the ICC Champions Trophy 2025 which has kept them alive in the tournament as they're in contention to make it to the semi finals. Here's how they can reach the last four in the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ibrahim-zadran-england-afghanistan-semi-final-2686127-2025-02-26",
      "headline": "Afghanistan knock England out of Champions Trophy in last-over thrillerChampions Trophy 2025: Afghanistan beat England by eight runs at the Gaddafi Stadium in Lahore to stay alive in the competition. They also knocked the Three Lions out of the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-aaqib-javed-gets-irritated-by-india-match-questions-pak-vs-ban-2686129-2025-02-26",
      "headline": "Aaqib Javed gets irritated by India match questions ahead of Bangladesh fixturePakistan's head coach Aaqib Javed got irritated by questions about India vs Pakistan match during the pre-match press conference ahead of their last fixture in the ICC Champions Trophy 2025 against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-bangladesh-assistant-muhammad-salahudin-pak-vs-ban-pakistan-vs-bangladesh-2686124-2025-02-26",
      "headline": "Bangladesh assistant coach expects good performances from batters vs PakistanBangladesh assistant coach Muhammad Salahudin said that they will have to bat well in order to beat Pakistan in their last fixture of the ICC Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-fan-shows-love-for-virat-kohli-by-printing-his-name-and-jersey-number-on-bike-2686113-2025-02-26",
      "headline": "Pakistan fan shows love for Virat Kohli by printing his name and jersey number on bikeA Virat Kohli fan in Pakistan went out of his way to show his love for the India star as he printed his name and jersey number on his bike. Kohli recently scored a century against Pakistan in the Champions Trophy 2025, which was widely celebrated across the border. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-fakhar-zaman-retirement-test-pakistan-2686106-2025-02-26",
      "headline": "Fakhar Zaman refutes retirement rumours, wants to play Test cricketChampions Trophy 2025: Fakhar Zaman said that he has no intentions of retiring from the game, also expressing his wishes to represent Pakistan in Test cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-bangladesh-pan-vs-ban-lahore-pitch-report-live-streaming-results-2686097-2025-02-26",
      "headline": "Pakistan vs Bangladesh, all you need to know: Lahore pitch report, live streamingPakistan and Bangladesh are all set to lock horns in their respective last fixtures of the ICC Champions Trophy 2025 on Thursday, February 27 in Rawalpindi. Both teams will be eager for a win, having not been able to win a single match in the tournament so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-mohammad-amir-on-virat-kohli-playing-in-pakistan-2686078-2025-02-26",
      "headline": "If Kohli scored century in Pakistan, he'd receive same love as India: Mohammad AmirFormer Pakistan fast bowler Mohammad Amir said that Virat Kohli wouldn't have been able to differentiate between Pakistan and India, had he scored his century in Pakistan instead of Dubai. Kohli scored an unbeaten 100* (111) against Pakistan to help India win by six wickets in Champions Trophy 2025. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}