{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-204-points-lower-nifty-below-24800-indusind-bank-down-2-2731884-2025-05-28",
      "headline": "Sensex ends 240 points lower, Nifty below 24,800; ITC falls 3%The BSE Sensex ended 239.31 points lower at 81,312.32, while the NSE Nifty50 fell 73.75 points to settle at 24,752.45. Most of the broader market indices also fell due to high volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodhas-nithin-kamath-explains-why-indias-gdp-growth-isnt-enough-india-becomes-fourth-largest-economy-2731874-2025-05-28",
      "headline": "Zerodha's Nithin Kamath explains why India's GDP growth isn't enoughNithin Kamath mentioned that both the government and private companies need to work together to improve education, research, and regulations. Otherwise, many talented Indians may choose to work abroad, and India will miss out on its chance to grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extension-why-it-happened-and-what-you-need-to-do-now-income-tax-filing-by-september-15-2731832-2025-05-28",
      "headline": "ITR deadline extension: Why it happened and what you need to do nowEven though the deadline to file your ITR has been extended to September 15, 2025, it's still wise to get started early. Waiting till the last minute often leads to unnecessary stress and errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-move-monaco-why-tax-free-haven-no-wealth-capital-gain-tax-2731780-2025-05-28",
      "headline": "Why the world's ultra-rich are looking for a Monaco addressMore and more of the world's richest people are looking to move to Monaco or at least have an address there. But why is this tiny country, smaller than many cities, drawing so much interest from the ultra-rich?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/decoding-finfluencer-stock-tips-investor-crypto-gensol-ipos-risks-2731777-2025-05-28",
      "headline": "Finfluencer frenzy: Why you shouldn't chase viral stock tipsCan you spot when a finfluencer's tip will make you money or cost you everything? How much are you really risking chasing the next viral stock? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/soon-every-indian-address-may-get-a-unique-digital-id-government-to-introduce-digipin-2731752-2025-05-28",
      "headline": "Soon, every Indian address may get a unique Digital IDThe Centre wants to bring addresses under India's Digital Public Infrastructure (DPI) matrix. Right now, there is no proper system or rule to manage address details in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/belrise-industries-share-price-listing-below-expectation-11-percent-premium-2731711-2025-05-28",
      "headline": "Belrise Industries share price: Stock lists below expectations with 11% premiumBelrise Industries listing: The company's shares listed at Rs 100 on the BSE, which is an 11.11% rise over the issue price of Rs 90. On the NSE, the stock started trading at Rs 98.50, which is a gain of 9.44%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-bill-online-property-registration-key-details-explained-2731694-2025-05-28",
      "headline": "Centre proposes bill for online property registration. What it means for you?The Centre has floated a draft bill to digitise property registration. If passed, it could change how you buy, sell, or prove ownership of real estate."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-reacts-to-meme-supporting-deepika-padukone-over-vanga-row-2732064-2025-05-28",
      "headline": "Actor Tamannaah reacts to liking meme supporting Deepika Padukone over Vanga rowActor Tamannaah Bhatia reacted to liking a social media meme backing Deepika Padukone over the recent controversy with filmmaker Sandeep Reddy Vanga. She alleged that it was due to a technical glitch on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/zamaana-lage-metro-in-dino-first-song-explores-love-and-loneliness-in-city-2732053-2025-05-28",
      "headline": "Zamaana Lage: Metro In Dino's first song explores love and loneliness in cityThe first song 'Zamaana Lage' from Anurag Basu's film 'Metro…In Dino' has been released, highlighting the emotional struggles of four couples in urban life. Featuring vocals by Arijit Singh and Shashwat Singh with music by Pritam, the track explores themes of love, loss, and loneliness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-season-2-announced-mismatched-to-conclude-with-season-4-2732023-2025-05-28",
      "headline": "Black Warrant Season 2 announced, Mismatched to conclude with Season 4Netflix India announced the second season of 'Black Warrant' and the final season of 'Mismatched' with Season 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nidhi-dutta-ivf-journey-infertility-pregnancy-border-2-2732032-2025-05-28",
      "headline": "Filmmaker Nidhi Dutta on miscarriage, IVF, filming Border 2 during pregnancyFilmmaker Nidhi Dutta shared her four-year IVF journey to normalise infertility in India. Her story highlights the emotional struggles and strength of women facing similar challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-click-rashmika-mandanna-saree-pics-2732011-2025-05-28",
      "headline": "Did Vijay Deverakonda click Rashmika Mandanna's saree pics? Fans think soActor Rashmika Mandanna shared saree pictures on Instagram, sparking fan speculation. Many believe Vijay Deverakonda is the photographer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohlis-celebratory-pic-rcb-win-against-lsg-ipl-match-2732009-2025-05-28",
      "headline": "Anushka Sharma, Virat Kohli's celebratory pic after RCB's win against LSGAnushka Sharma and Virat Kohli celebrated RCB's win against LSG on May 28. A picture of the couple after the match has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nirahua-kusha-kapila-join-ravi-kishan-maamla-legal-hai-season-2-2731983-2025-05-28",
      "headline": "Bhojpuri star Nirahua, Kusha Kapila join Ravi Kishan in Maamla Legal Hai 2Ravi Kishan is set to reprise his role as VD Tyagi in Netflix's Maamla Legal Hai Season 2. The new season brings fresh faces and promises more legal mischief and laughter in the Patparganj court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/stolen-trailer-out-abhishek-banerjees-relentless-hunt-for-a-missing-baby-2731979-2025-05-28",
      "headline": "Stolen trailer: Abhishek Banerjee's relentless hunt for a missing baby'Stolen' is a gripping thriller about two brothers on a desperate search for a kidnapped baby. Starring Abhishek Banerjee and Mia Maelzer, the film premieres globally on June 4, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-joins-forces-with-hombale-films-for-pan-india-project-2731985-2025-05-28",
      "headline": "Hrithik Roshan collaborates with Hombale Films for pan-India projectHrithik Roshan has joined hands with Hombale Films for an upcoming pan-India project. The makers shared the announcement on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-teaser-out-manchu-manoj-teja-sajja-fantasy-film-eyes-september-release-2731950-2025-05-28",
      "headline": "Mirai teaser out: Manchu Manoj, Teja Sajja's fantasy film eyes September releaseDirected by Karthik Ghattamaneni, this fantasy adventure film stars Hanu-Man star Teja Sajja in the lead alongside Manchu Manoj, Shriya Saran, among others, and is scheduled to have a global release in 8 different languages in 2D and 3D formats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashok-saraf-anant-nag-shobana-chandrakumar-and-others-conferred-with-padma-awards-2731899-2025-05-28",
      "headline": "Actors Ashok Saraf, Anant Nag, Shobana and others conferred with Padma awardsPresident Droupadi Murmu presented Padma awards to actors Anant Nag, Ashok Saraf, Shobana Chandrakumar, and musician Ricky Kej among others from the entertainment industry. Singer Sharda Sinha was posthumously honoured with the Padma Vibhushan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-to-play-mukesh-his-grandfather-and-legendary-musician-in-biopic-2731831-2025-05-28",
      "headline": "Neil Nitin to play Mukesh, his grandfather and legendary musician, in biopicNeil Nitin Mukesh is set to bring the life of his legendary grandfather, singer Mukesh, to the screen in a heartfelt biopic, which he's co-writing and producing. Gathering material from family stories and rare archives, Neil hopes to portray grandfather Mukesh himself in the biopic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jennifer-winget-karan-singh-grover-to-reunite-after-11-years-karan-johar-show-the-traitirs-2731903-2025-05-28",
      "headline": "Jennifer Winget, Karan Singh Grover to reunite after 11 years on KJo's show: ReportActors Jennifer Winget, Karan Singh Grover to reunite after 11 years on Karan Johar's 'The Traitors'. The show will premiere on Prime Video on June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-welcomes-ali-fazal-to-south-films-calls-him-important-actor-for-india-2731891-2025-05-28",
      "headline": "Kamal Haasan welcomes Ali Fazal to South films, calls him important actor for IndiaActor Kamal Haasan welcomed Ali Fazal to the South cinema at the latest 'Thug Life' event. The legendary icon, also called Fazal, an important actor for India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-father-kasthuri-raja-good-bad-ugly-makers-unauthorised-use-of-songs-2731889-2025-05-28",
      "headline": "Dhanush's father warns Good Bad Ugly makers of legal action over use of his songsFilmmaker and writer Kasthuri Raja, at a recent interaction with the media, called out the makers of 'Good Bad Ugly' over unauthorised use of his songs in the film. Earlier, Ilaiyaraaja issued a legal notice to the makers for using his songs without consent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-amruta-subhash-on-losing-confidence-for-being-rejected-over-skin-colour-2731812-2025-05-28",
      "headline": "Actor Amruta Subhash on losing confidence for being rejected over skin colourAmruta Subhash recently opened up on how rejection by a dance teacher over skin tone affected her self-confidence. She revealed how it took her years to get over the insecurity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-to-have-multiple-twisted-endings-different-screen-different-climax-2731842-2025-05-28",
      "headline": "Different screen, different climax: Housefull 5 to have multiple twisted endingsIn a first for the audience, 'Housefull 5' is going to feature different climaxes on different screens, providing an unlikely experience everytime you watch it in a theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-looks-regal-in-white-at-friends-wedding-dances-with-bridesmaids-2731823-2025-05-28",
      "headline": "Alia Bhatt looks regal in white at friend's wedding, grooves with bridesmaidAlia Bhatt looked stunning in a white outfit at a friend's wedding in Spain. One of the viral videos featured her dancing along with other bridesmaids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-emiway-bantai-receives-death-threat-after-sidhu-moosewala-tribute-song-2731814-2025-05-28",
      "headline": "Rapper Emiway Bantai receives death threat after Sidhu Moosewala tribute songRapper Emiway Bantai filed a police complaint in Mumbai after receiving a threatening message from a person claiming to be gangster Goldy Brar. The threat came days after he released a tribute to the late singer Sidhu Moosewala. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/thirteen-stuck-at-zero-line-india-bangladesh-army-dig-heels-illegal-immigrants-border-guard-bangladesh-2732046-2025-05-28",
      "headline": "13 stranded at Zero Line as India, Bangladesh dig heels on illegal immigrantsThirteen people were stranded at the Indo-Bangladesh Zero Line after being barred from entering Bangladesh by the BGB and India refusing them re-entry. As India tries to hand over illegal immigrants to Bangladesh, leaders in Dhaka accuse New Delhi of \"violating its sovereignty\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-visa-ban-foreign-officials-censorship-of-americans-online-on-social-media-marco-rubio-2732144-2025-05-28",
      "headline": "US to ban visas for foreign officials who censor Americans onlineMarco Rubio warned that those who threaten free speech \"are attacking one of the pillars of our shared interest, our shared culture, our shared values.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lokpal-clean-chit-ex-sebi-chief-madhabi-buch-conflict-of-interest-claims-2732043-2025-05-28",
      "headline": "Lokpal's clean chit to Madhabi Buch on Hindenburg report-based graft allegationsThe Lokpal concluded that, based on the presented evidence and legal principles, the complaints were devoid of merit and did not establish a cognisable offence or a basis for investigation against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-stefanos-tsitsipas-casper-ruud-crash-out-2732177-2025-05-28",
      "headline": "Big upsets as Stefanos Tsitsipas and Casper Ruud shocked in Round 2Italian qualifier Matteo Gigante sent former finalist Stefanos Tsitsipas tumbling out of the Grand Slam in the second round, while Casper Ruud's campaign also ended prematurely as a lingering knee injury hampered his performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-4th-largest-economy-is-not-all-cheer-but-it-is-not-a-tragedy-either-2731900-2025-05-28",
      "headline": "Calm down...4th largest economy is not all cheer, but it's not a tragedy eitherWe are still fourth. Not even a podium finish. No medals. A rank which an embarrassed Indian parent would sugarcoat in front of relatives by saying we are in the Top 5 of the class. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/kamal-haasan-kannada-tamil-remark-controversy-what-i-said-was-out-of-love-2732004-2025-05-28",
      "headline": "Said it out of love, let's leave debate to experts: Kamal Haasan on Kannada rowActor Kamal Haasan has addressed the backlash over his Kannada-Tamil remark, clarifying it was spoken out of affection and urging politicians to leave language debates to experts amid strong criticism from Karnataka leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-says-hamas-gaza-chief-mohammad-sinwar-killed-2732035-2025-05-28",
      "headline": "Hamas's Gaza chief Mohammad Sinwar has been eliminated: NetanyahuMohammad Sinwar had stepped into a senior leadership role in Gaza's south after the death of his brother Yahya Sinwar in October 2024. Yahya had masterminded the October 7, 2023, attacks on Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-ab-de-villiers-angry-commentators-2732095-2025-05-28",
      "headline": "AB de Villiers slams commentators for negative take on RCB: It got me so angryFormer South Africa captain AB de Villiers criticised commentators for their negative remarks on RCB's bowling during their match against LSG in Lucknow on Tuesday. RCB conceded 227, but chased the target down in 18.4 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-singaporean-vaishali-bhatt-prime-minister-narendra-modi-for-codenaming-operation-sindoor-2732042-2025-05-28",
      "headline": "Cried over Op Sindoor codename: Indian-origin woman who was in Pahalgam on Apr 22Vaishali Bhatt, a Singaporean citizen of Indian origin, who left Baisaran Valley shortly before the attack began, said she was deeply moved when she later learned of India's military response — Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradeshs-energy-minister-pradhuman-singh-tomar-energy-conservation-will-not-use-ac-sleep-in-park-2732059-2025-05-28",
      "headline": "No cold water, no AC for entirety of June nights for this Madhya Pradesh MinisterMadhya Pradesh's Energy Minister Pradhuman Singh Tomar has announced that in the month of June, he would forgo air conditioning during the night, whether at home, in his office, or in his official vehicle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-unable-to-explain-cash-found-at-home-misconduct-calls-for-impeachment-probe-report-2731942-2025-05-28",
      "headline": "1.5-ft cash stacks, all unexplained: Justice Varma probe calls for impeachmentThe report of the Supreme Court-appointed committee, details of which were accessed by India Today, said the allegations of misconduct against Justice Yashwant Varma were serious enough to seek his impeachment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rachel-gupta-resigns-miss-grand-international-2024-organisers-terminated-2731897-2025-05-28",
      "headline": "Rachel Gupta resigns as Miss Grand International 2024. Organisers say no, terminatedRachel Gupta's dream run as Miss Grand International 2024 ended in controversy after the organisation revoked her crown. However, Gupta said she walked away first, and for a good reason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2732148-2025-05-28",
      "headline": "Rohan Bopanna, Yuki Bhambri progress to 2nd round, Bollipalli crashes outRohan Bopanna and his Czech partner Adam Pavlasek progressed to the second round of the French Open after securing a hard-fought win over American duo of Robert Cash and JJ Tracy. Yuki Bhambri also progressed while Rithvik Bollipalli crashed out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bholari-airbase-pakistan-saab-200-awec-fighter-jets-operation-sindoor-indian-air-force-2731888-2025-05-28",
      "headline": "Pak's Bholari base hangar hit by India had Saab airborne control aircraft, 4 jetsThe Bholari base is located less than 100 miles from the port city of Karachi, and was one of nearly a dozen air force targets struck by India during Operation Sindoor.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-wins-2nd-round-2nd-fastest-rafael-nadal-2732067-2025-05-28",
      "headline": "Carlos Alcaraz completes special 20 at Roland Garros, eases into Round 3Carlos Alcaraz became the second-fastest man to reach 20 singles wins at Roland Garros since 2020. The defending champion defeated Fabian Marozsan in four sets on Wednesday, May 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/salt-therapy-is-growing-wellness-trend-but-take-it-with-a-pinch-of-salt-2731365-2025-05-28",
      "headline": "Salt therapy is a growing wellness trend, but take it with a pinch of saltWellness retreats are getting salty with the rise of salt therapy or halotherapy in India. It claims to help with holistic well-being, but to what extent?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-chandrababu-naidu-denies-hal-relocation-karnataka-seeks-defence-hub-rayalseema-2732013-2025-05-28",
      "headline": "Karnataka leaders misunderstood: Chandrababu Naidu denies HAL shift claimsAndhra Pradesh Chief Minister Chandrababu Naidu denied claims he sought to relocate HAL from Karnataka to Andhra Pradesh. He said his request to the Centre was only to establish a new defence manufacturing hub in Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-love-saga-row-lalu-yadav-family-bihar-politics-2731972-2025-05-28",
      "headline": "For Tej Pratap, Lalu Yadav and family have drawn a line in the sandTej Pratap's 'relationship reveal' on Saturday triggered a fracture in the Lalu Yadav family. Tej Pratap, born to RJD chief Lalu Yadav and Rabri Devi after the couple had six daughters, now finds himself exiled from the party and from the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-alcaraz-paolini-sabalenka-ruud-2731911-2025-05-28",
      "headline": "Day 4 Live: Alcaraz and Iga into Rd 3, Tsitsipas and Ruud suffer shock lossesFrench Open 2025 Day 4 Live Score: Former finalist Casper Ruud has been knocked out in the second round by Portugal's No. 1 Nuno Borges. Carlos Alcaraz has bounced back after dropping the second set to Marozsan of Hungary. Earlier in the day, Jasmine Paolini, Qinwen Zheng and Lorenzo Musetti progressed to the third round with easy wins on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-kanpur-officer-kshitij-mishra-bites-off-society-secretary-rs-yadavs-nose-over-parking-dispute-2731910-2025-05-28",
      "headline": "Video: Kanpur man bites off society secretary's nose over parking disputeAfter a case was registered against him, the accused officer, Kshitij Mishra, was hospitalised while the victim, RS Yadav, was advised to undergo surgery in Delhi.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-big-war-to-fight-former-pm-imran-khan-blows-bugle-pti-mass-movement-nationwide-here-is-more-2731811-2025-05-28",
      "headline": "Pak Army has a big war to fight as Imran Khan blows bugleThe Pakistani Army will soon have a more pressing issue to deal with at its home front. Former Prime Minister and Pakistan Tehreek-e-Insaf (PTI) chief, Imran Khan, has called upon his party to gear up for a large-scale national agitation against the current hybrid regime of PM Shehbaz Sharif and Army Chief Asim Munir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-starlink-india-launch-details-revealed-leaked-plan-prices-availability-and-other-details-2731917-2025-05-28",
      "headline": "Starlink India launch: Leaked plans, prices, availability, and moreElon Musk's satellite internet company Starlink is reportedly preparing to launch its services in India, and new details from NDTV suggest the rollout could happen within the next 12 months."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/three-indians-go-missing-after-travelling-to-iran-delhi-urges-tehran-to-trace-ensure-safety-2731913-2025-05-28",
      "headline": "Hands tied, cuts on body: Family of 3 Indians missing in Iran alleges kidnappingThe Indian mission in Tehran is keeping the families of those missing regularly updated about the efforts being made to trace them."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-stefanos-tsitsipas-casper-ruud-crash-out-2732177-2025-05-28",
      "headline": "Big upsets as Stefanos Tsitsipas and Casper Ruud shocked in Round 2Italian qualifier Matteo Gigante sent former finalist Stefanos Tsitsipas tumbling out of the Grand Slam in the second round, while Casper Ruud's campaign also ended prematurely as a lingering knee injury hampered his performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2732148-2025-05-28",
      "headline": "Rohan Bopanna, Yuki Bhambri progress to 2nd round, Bollipalli crashes outRohan Bopanna and his Czech partner Adam Pavlasek progressed to the second round of the French Open after securing a hard-fought win over American duo of Robert Cash and JJ Tracy. Yuki Bhambri also progressed while Rithvik Bollipalli crashed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-storms-third-round-tv-shows-reactions-2732138-2025-05-28",
      "headline": "Iga Swiatek shuns TV shows to stay sharp in French Open title defenceFrench Open 2025: Iga Swiatek extended her Roland Garros winning streak to 23 matches with a commanding win over Emma Raducanu. The Pole, ranked five, is bidding to win her fourth successive title in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-ab-de-villiers-angry-commentators-2732095-2025-05-28",
      "headline": "AB de Villiers slams commentators for negative take on RCB: It got me so angryFormer South Africa captain AB de Villiers criticised commentators for their negative remarks on RCB's bowling during their match against LSG in Lucknow on Tuesday. RCB conceded 227, but chased the target down in 18.4 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-reaction-shreyas-iyer-india-test-squad-england-tour-2025-2732081-2025-05-28",
      "headline": "Gambhir avoids question on Shreyas Iyer's Test exclusion: I am not selectorIndia head coach Gautam Gambhir avoided addressing questions about Shreyas Iyer's surprising omission from the Indian Test squad for the upcoming England tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-captaincy-punjab-kings-ipl-2025-playoffs-leadership-aakash-chopra-2732066-2025-05-28",
      "headline": "What makes Shreyas Iyer's captaincy success at Punjab Kings extra specialFormer India opener Aakash Chopra said that Shreyas Iyer didn't have the opportunity to pick the Punjab Kings squad, as he was himself bought in the auction. However, he still delivered impressive results with the team he was given.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-wins-2nd-round-2nd-fastest-rafael-nadal-2732067-2025-05-28",
      "headline": "Carlos Alcaraz completes special 20 at Roland Garros, eases into Round 3Carlos Alcaraz became the second-fastest man to reach 20 singles wins at Roland Garros since 2020. The defending champion defeated Fabian Marozsan in four sets on Wednesday, May 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-shreyas-india-tour-of-england-mohammed-kaif-2732058-2025-05-28",
      "headline": "Sai Sudharsan over Shreyas Iyer for England: Mohammed Kaif unhappy with callMohammed Kaif has questioned the double standards when it comes to Sai Sudharsan being selected for the England tour ahead of Shreyas Iyer. Kaif feels that Sudharsan was selected by his form in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-casper-ruud-knocked-out-nuno-borges-2732044-2025-05-28",
      "headline": "Injured Casper Ruud gets knocked out in 2nd round shock by Nuno BorgesAn injured Casper Ruud was knocked out in the second round of the French Open by Nuno Borges, who created history on Wednesday, May 28. Ruud suffered an injury in the second set as Borges completed a comeback win in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-shubman-gill-new-india-test-captain-abhishek-sharma-2731994-2025-05-28",
      "headline": "Shubman Gill is one of best India has produced in all 3 formats: Abhishek SharmaAbhishek Sharma heaped praise on new India Test team captain Shubman Gill and hailed him as one of the best players produced by the country in all three formats of the game. Gill was appointed as the successor to Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/suhail-bhat-india-call-up-thailand-football-friendly-afc-asian-cup-qualifiers-2731987-2025-05-28",
      "headline": "Suhail Ahmad Bhat gets first India call-up for Thailand friendlyIndian football team head coach Manolo Marquez announced the squad for the international friendly against Thailand on Wednesday. Suhail Ahmad Bhat has earned his maiden India senior team call-up. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-wins-2nd-round-2nd-fastest-rafael-nadal-2732067-2025-05-28",
      "headline": "Carlos Alcaraz completes special 20 at Roland Garros, eases into Round 3Carlos Alcaraz became the second-fastest man to reach 20 singles wins at Roland Garros since 2020. The defending champion defeated Fabian Marozsan in four sets on Wednesday, May 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-shreyas-india-tour-of-england-mohammed-kaif-2732058-2025-05-28",
      "headline": "Sai Sudharsan over Shreyas Iyer for England: Mohammed Kaif unhappy with callMohammed Kaif has questioned the double standards when it comes to Sai Sudharsan being selected for the England tour ahead of Shreyas Iyer. Kaif feels that Sudharsan was selected by his form in the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-results-casper-ruud-knocked-out-nuno-borges-2732044-2025-05-28",
      "headline": "Injured Casper Ruud gets knocked out in 2nd round shock by Nuno BorgesAn injured Casper Ruud was knocked out in the second round of the French Open by Nuno Borges, who created history on Wednesday, May 28. Ruud suffered an injury in the second set as Borges completed a comeback win in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-shubman-gill-new-india-test-captain-abhishek-sharma-2731994-2025-05-28",
      "headline": "Shubman Gill is one of best India has produced in all 3 formats: Abhishek SharmaAbhishek Sharma heaped praise on new India Test team captain Shubman Gill and hailed him as one of the best players produced by the country in all three formats of the game. Gill was appointed as the successor to Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/suhail-bhat-india-call-up-thailand-football-friendly-afc-asian-cup-qualifiers-2731987-2025-05-28",
      "headline": "Suhail Ahmad Bhat gets first India call-up for Thailand friendlyIndian football team head coach Manolo Marquez announced the squad for the international friendly against Thailand on Wednesday. Suhail Ahmad Bhat has earned his maiden India senior team call-up. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}