{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-news-publishers-body-seeks-copyright-protection-in-ai-training-practices-2744532-2025-06-22",
      "headline": "Generative AI must pay for using copyright content, says DNPAThe Digital News Publishers Association said it \"firmly believes that utilising the content of digital news publishers, without consent, for AI training and subsequent generative AI applications, such as search assistance and information purposes, constitutes an infringement of copyright.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/two-new-gst-levies-health-and-clean-energy-may-replace-compensation-cess-but-at-what-cost-2744140-2025-06-21",
      "headline": "Two new GST levies may replace compensation cess, but at what cost?Health and Clean Energy levies may replace the Compensation Cess, but tax experts warn of rising compliance burdens and fresh coordination challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-turns-51-atlee-and-dulquer-salman-extend-wishes-2744460-2025-06-22",
      "headline": "Thalapathy Vijay turns 51: Atlee, Dulquer Salman and celebs extend wishesThalapathy Vijay, who is celebrating his 51th birthday on Sunday, received wishes from the big wigs of Tamil film industry. Filmmaker Atlee shared a picture of fans celebrating the re-release of 'Mersal' to wish the actor on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-love-stories-have-evolved-but-dilwale-dulhania-le-jayenge-would-still-win-hearts-today-2744582-2025-06-22",
      "headline": "Kajol says love stories have evolved but DDLJ would still win hearts todayKajol feels that while love stories have evolved with time, a classic like 'Dilwale Dulhania Le Jayenge' would still resonate with today's audience. In an exclusive interview with India Today, she emphasised that timeless films with strong storytelling and memorable music continue to hold their charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-in-new-delhi-with-kareena-kapoor-khan-and-saif-ali-khan-for-sunjay-kapur-prayer-meet-2744543-2025-06-22",
      "headline": "Karisma Kapoor in Delhi with Kareena and Saif for Sunjay Kapur's prayer meetActor Karisma Kapoor is in New Delhi with her family to attend the prayer service of her ex-husband Sunjay Kapoor. Actors Kareena Kapoor Khan and Saif Ali Khan also accompanied her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-reacts-to-trespassing-incident-at-galaxy-kapil-sharma-show-2744557-2025-06-22",
      "headline": "Salman Khan reacts to trespassing incident at Galaxy: Definitely didn't call herA month after the trespassing incident at his Galaxy apartment, Salman Khan reacted to the incident. He addressed it during his appearance on 'The Great Indian Kapil Show'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/case-against-actor-vijay-deverakonda-under-scst-act-for-remarks-while-promoting-movie-retro-2744536-2025-06-22",
      "headline": "Case against actor Vijay Deverakonda under SC/ST Act for remarks on tribal community A case has been filed against actor Vijay Deverakonda for his remarks on the tribal community at Suriya's 'Retro' event. Vijay had issued an apology. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/varun-dhawan-and-ahan-shetty-get-lost-in-pune-board-crowded-metro-to-reach-hotel-2744505-2025-06-22",
      "headline": "Varun Dhawan and Ahan Shetty get lost in Pune, board crowded metro to reach hotelActors Varun Dhawan and Ahan Shetty travelled in a crowded metro recently after they got lost in Pune. They are shooting for 'Border 2' in the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/canadian-rapper-tommy-genesis-faces-heat-for-dressing-as-maa-kali-in-bold-music-video-2744498-2025-06-22",
      "headline": "Rapper Tommy Genesis faces backlash for dressing as Maa Kali in explicit music videoA Canadian rapper is facing backlash for portraying Maa Kali in an explicit video. The act has sparked outrage and renewed debate over cultural appropriation in entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-day-2-dhanushs-crime-thriller-shows-growth-crosses-rs-30-crore-2744487-2025-06-22",
      "headline": "Kuberaa box office Day 2: Dhanush's crime-thriller shows growth, crosses Rs 30 crore'Kuberaa' is going strong at the box office and has earned Rs 30 crore. On day 2, the Dhanush-starrer earned Rs 16 crore at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-day-2-aamir-khan-film-maintains-pace-earns-rs-30-crore-2744482-2025-06-22",
      "headline": "Sitaare Zameen Par box office Day 2: Aamir's film outshines itself, earns Rs 30 croreAamir Khan's 'Sitaare Zameen Par' is steadily winning over audiences, showing promising signs at the box office. Boosted by positive word of mouth, the film continued to draw consistent footfall on Day 2, reflecting growing momentum after a solid opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-wishes-son-ruhaan-on-2nd-birthday-with-adorable-candid-video-2744475-2025-06-22",
      "headline": "Dipika Kakar wishes son Ruhaan on 2nd birthday with adorable candid videoV actor Dipika Kakar shared an adorable birthday wish for her son Ruhaan. The little munchkin turned two on June 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aandhi-a-cinematic-storm-that-echoed-indiras-era-retro-review-2744458-2025-06-22",
      "headline": "Aandhi: A cinematic storm that echoed Indira's era'Aandhi' is a classic political satire that delicately portrays the personal sacrifices behind public power, drawing subtle parallels with Indira Gandhi's life. The film remains a timeless gem, celebrated for its nuanced storytelling and memorable performances in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-trigeminal-neuralgia-brain-aneurysm-av-malformation-great-indian-kapil-show-2744428-2025-06-22",
      "headline": "Salman Khan, 59, says he has brain aneurysm and AV malformationSalman Khan spoke candidly about his severe health issues, including trigeminal neuralgia, AV malformation and brain aneurysm, during his appearance on The Great Indian Kapil Show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tushar-ghadigaonkar-dies-by-suicide-2744403-2025-06-22",
      "headline": "Marathi actor Tushar Ghadigaonkar dies by suicide at 34Marathi actor Tushar Ghadigaonkar was found dead in his Goregaon West flat. Police suspect suicide caused by prolonged stress over lack of work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-admires-son-abhishek-bachchan-calls-him-true-inheritor-in-new-post-2744401-2025-06-22",
      "headline": "Amitabh Bachchan admires son Abhishek, calls him true inheritor in new postAmitabh Bachchan has expressed heartfelt admiration for his son Abhishek Bachchan's dedication and courage as an artist. The proud father also shared his blessings for his upcoming film 'Kaalidhar Laapata'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jack-betts-known-for-spider-man-dies-at-96-2744386-2025-06-22",
      "headline": "Veteran actor Jack Betts, known for Spider-Man, dies at 96Actor Jack Betts, renowned for his role as Henry Balkan in 'Spider-Man', died peacefully at his home. Tributes poured in from fans and theatre communities remembering his remarkable career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-thalapathy-vijay-first-glimpse-out-on-51st-birthday-2744385-2025-06-22",
      "headline": "Jana Nayagan: Thalapathy Vijay's first glimpse out on 51st birthdayThalapathy Vijay's final film 'Jana Nayagan' teaser was unveiled on his 51st birthday, showing him in a fierce police avatar. The film will release on January 9, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-tere-naam-look-was-inspired-by-apj-abdul-kalam-2744267-2025-06-21",
      "headline": "Salman Khan's Tere Naam look was inspired by APJ Abdul KalamActor Salman Khan revealed that his look in 'Tere Naam' was inspired by Dr APJ Abdul Kalam. He made this revelation during his appearance on the new season of 'The Great Indian Kapil Show'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-drishyam-3-eyes-october-2025-release-2744242-2025-06-21",
      "headline": "Mohanlal announces Drishyam 3, eyes October 2025 releaseThe much-anticipated 'Drishyam 3', starring Mohanlal, has been announced. The actor shared the announcement on June 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaalidhar-laapata-trailer-abhishek-bachchan-slice-of-life-film-is-soul-stirring-2744218-2025-06-21",
      "headline": "Kaalidhar Laapata trailer: Abhishek Bachchan seeks joy in slice-of-life filmAfter 'Housefull 5', actor Abhishek Bachchan is set to surprise fans with a new avatar in his upcoming film 'Kaalidhar Laapata'. The trailer for the film, which will premiere on Zee5, was released on Saturday. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/decoys-deception-2-dozen-tomahawk-missiles-pentagon-details-how-us-struck-iran-n-sites-in-25-minutes-2744591-2025-06-22",
      "headline": "Operation Midnight Hammer: US details how it struck Iran's N-sites in 25 minutesOperation Midnight Hammer - This was the name given by the US following its air strikes on Iran's three nuclear sites. It involved over 125 aircraft and bombers being deployed in the Pacific as a \"decoy\" in an operation that lasted 25 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-live-updates-tel-aviv-tehran-donald-trump-white-house-missiles-drones-2743961-2025-06-20",
      "headline": "Live: Strikes on Iran not about regime change, says US defence chiefIsrael-Iran Conflict Live Updates: The Israeli military on Sunday launched a fresh series of strikes targeting military targets including missile launchers in western Iran after Tehran launched two waves of missiles at multiple locations across northern and central Israel, including Haifa, Nes Ziona, Rishon LeZion and Tel Aviv. Iran's attack on Sunday morning came hours after the United States attacked the country's three nuclear sites: Fordow, Natanz and Esfahan. After days of deliberation, Trump's move to join Israel's military campaign marks a significant escalation in the regional conflict, which is on its tenth day. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-iran-turns-to-russia-after-us-strike-top-putin-aide-hints-at-nuke-support-2744570-2025-06-22",
      "headline": "Iran turns to Russia after US strike, top Putin aide hints at nuke supportIn a series of posts on X, Dmitry Medvedev said the US operation-targeting sites in Isfahan, Natanz, and Fordow - had not only failed to achieve its objective but had, in fact, produced the opposite result."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/israel-iran-conflict-decoding-the-us-strikes-on-iran-2744598-2025-06-22",
      "headline": "Decoding the US strikes on IranOver 40 tons of explosives were dropped on multiple targets. What will Iran do next? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/did-iran-shifting-assets-from-fordow-prompt-early-us-nuclear-site-strike-2744418-2025-06-22",
      "headline": "Trump sought 2 weeks to decide on Iran attack: Why he struck nuke sites in 2 daysIn the days leading up to the US attack on Iran's Fordow site, satellite imagery revealed increased vehicular activity near the entrance of the underground military complex."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-nuclear-ambitions-obliterated-us-secretary-of-defence-pete-hegseth-on-airstrikes-2744596-2025-06-22",
      "headline": "Iran's nuclear ambitions obliterated: US defence chief on airstrikesEarlier on Sunday, US President Donald Trump said the \"very successful\" strikes had hit the Natanz, Fordow and Isfahan nuclear sites in Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-3-leeds-updates-2744508-2025-06-22",
      "headline": "Day 3 Live: Jamie Smith falls, India take second new ballEngland (ENG) vs India (IND), 1st Test Day 3 Live Score and Updates: England lose Jamie Smith. India take the second new ball. Jasprit Bumrah and Mohammed Siraj are operating with the new cherry, looking to get a few more here. Chris Woakes has joined Harry Brook, who is nearing a three-figure score. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-nobel-peace-prize-asaduddin-owaisi-us-iran-strikes-israel-conflict-2744537-2025-06-22",
      "headline": "Should Trump win Nobel Prize for this? Asaduddin Owaisi mocks Pak as US bombs IranAIMIM chief Asaduddin Owaisi took a dig at Pakistan for its Nobel Peace Prize's pitch to US President Donald Trump, before the United States launched air strikes on Iran's three nuclear facilities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dissent-ball-change-denied-leeds-test-england-india-cricket-2744562-2025-06-22",
      "headline": "Watch: Rishabh Pant throws ball in anger after umpire declines ball change requestEngland vs India: Rishabh Pant showed visible dissent after his request to change the ball was denied during the Leeds Test. Indian bowlers were not happy with the shape of a 60-over-old ball in the first session on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-us-strikes-on-iran-nuclear-sites-could-lead-to-spiral-of-crisis-in-middle-east-us-forever-war-israel-conflict-closure-of-strait-of-hormuz-global-oil-prices-five-big-points-2744539-2025-06-22",
      "headline": "What US strikes on Iran N-sites could lead to: 5 big pointsUS President Donald Trump's decision to do what he vowed not to could lead to a shake-up in the Middle East. The strikes curb Iran's power while revealing American assertions. However, this could also lead to another \"forever war\" for the US and skyrocketing oil prices for the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/expressed-deep-concern-pm-modi-dials-iran-president-after-us-strikes-on-nuke-sites-calls-for-de-escalation-2744527-2025-06-22",
      "headline": "Iran President dials PM Modi after US strikes, thanks for promoting regional peacePM Modi spoke to Iran President after US strikes on three nuclear sites and expressed deep concern. He also reiterated call for immediate de-escalation and peace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attackers-two-arrested-for-harbouring-terrorists-helped-identify-three-involved-in-attack-2744438-2025-06-22",
      "headline": "Two caught for harbouring Pahalgam attackers, three LeT terrorists identifiedThe arrested accused, Parvaiz Ahmad Jothar and Bashir Ahmad Jothar, also disclosed the names of three of the terrorists involved in the April 22 attack, in which 25 tourists and a local were killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/why-height-matters-modern-dating-marriage-tinder-bumble-hinge-filter-women-men-tall-short-heres-why-2743703-2025-06-22",
      "headline": "Why height is a big filter in dating, marriage marketTinder's new height filter has formalised what was once an unspoken bias, height, as a key marker of desirability, especially for men. From arranged marriage proposals to queer dating spaces, taller men are still preferred, often tied to outdated ideas of masculinity, safety, and status."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-iran-israel-conflict-has-brought-back-crude-price-worries-2744127-2025-06-21",
      "headline": "How Iran-Israel conflict has brought back crude price worriesContinued escalation will hike India's import bill, widening the current account deficit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/case-against-actor-vijay-deverakonda-under-scst-act-for-remarks-while-promoting-movie-retro-2744536-2025-06-22",
      "headline": "Case against actor Vijay Deverakonda under SC/ST Act for remarks on tribal community A case has been filed against actor Vijay Deverakonda for his remarks on the tribal community at Suriya's 'Retro' event. Vijay had issued an apology. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-breach-of-un-charter-risk-to-middle-east-stability-china-slams-us-strikes-on-iran-2744593-2025-06-22",
      "headline": "Breach of UN Charter, risk to Middle East stability: China slams US strikes on IranIn a statement released on Sunday, a spokesperson for China's Foreign Ministry said the strikes had targeted nuclear facilities that were under the safeguards of the International Atomic Energy Agency (IAEA), and described the operation as a breach of the UN Charter and international law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-love-stories-have-evolved-but-dilwale-dulhania-le-jayenge-would-still-win-hearts-today-2744582-2025-06-22",
      "headline": "Kajol says love stories have evolved but DDLJ would still win hearts todayKajol feels that while love stories have evolved with time, a classic like 'Dilwale Dulhania Le Jayenge' would still resonate with today's audience. In an exclusive interview with India Today, she emphasised that timeless films with strong storytelling and memorable music continue to hold their charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-498-20-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/irans-foreign-minister-after-us-attacks-nuke-sites-criminal-behavior-will-have-everlasting-consequences-2744411-2025-06-22",
      "headline": "Outrageous: Iran says US strikes on N-sites will have everlasting consequencesAraghchi said the attacks on Iran's peaceful nuclear program were \"outrageous\" and would carry \"everlasting consequences.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/66-of-indian-workers-rely-on-degrees-for-long-term-career-gains-report-2744509-2025-06-22",
      "headline": "Click, Learn, Repeat? Not yet. 2 of 3 Indians prefer degrees over online coursesDespite the rise of short-term courses globally, 66% of Indian professionals still see traditional degrees as more valuable for career growth, especially in the long-term, says the TeamLease EdTech report.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-says-left-average-america-life-extraordinary-india-life-viral-video-2744594-2025-06-22",
      "headline": "US woman says she traded 'average life' in America for something extraordinary in IndiaAn American woman said she gave up an \"average\" life in the US to embrace an extraordinary journey in India, and she has no regrets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/entrepreneur-couple-bengaluru-is-slowly-killing-us-viral-video-sparks-debate-2744465-2025-06-22",
      "headline": "Entrepreneur couple's 'Bengaluru is slowly killing us' video sparks debateA Bengaluru-based couple decided to leave the city, blaming its worsening air quality for frequent illnesses. They documented their experience in a now-viral video on Instagram, which has sparked debate online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/the-end-of-hacking-how-isro-and-drdo-are-building-an-unhackable-quantum-future-2743715-2025-06-22",
      "headline": "India's quantum leap: How Isro and DRDO are building an unhackable futureAt the heart of this revolution is quantum entanglement, a phenomenon Albert Einstein famously described as \"spooky action at a distance.\" "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-department-of-state-warns-citizens-updated-india-travel-advisory-against-rape-violence-terror-2744503-2025-06-22",
      "headline": "Rape, terror: US updates travel advisory for India, asks women not to travel aloneThe advisory asked US citizens to avoid travelling to tourist locations, transportation hubs, markets/shopping malls and government facilities, claiming they are vulnerable to terrorist attacks."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ufc-jon-jones-retirement-statement-legal-trouble-claims-dana-white-2744592-2025-06-22",
      "headline": "Jon Jones issues statement after UFC retirement, breaks silence on legal trouble claimsJon Jones issued a lengthy statement to comment on his retirement from the UFC on Saturday, June 21. Jones also commented on the reported legal trouble claims which emerged on Saturday right after his retirement announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andy-flower-meets-spiritual-guru-swami-chidanand-saraswati-rishikesh-international-yoga-day-ipl-win-2744573-2025-06-22",
      "headline": "After guiding RCB to IPL crown, coach Andy Flower finds spirituality in RishikeshAfter leading RCB to their maiden IPL title, Andy Flower visited spiritual guru Swami Chidanand Saraswati in Rishikesh on International Yoga Day. He reflected on the deeper meaning of winning and shared his experience practising yoga during his stay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-dissent-ball-change-denied-leeds-test-england-india-cricket-2744562-2025-06-22",
      "headline": "Watch: Rishabh Pant throws ball in anger after umpire declines ball change requestEngland vs India: Rishabh Pant showed visible dissent after his request to change the ball was denied during the Leeds Test. Indian bowlers were not happy with the shape of a 60-over-old ball in the first session on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-somersault-celebration-gymnastics-school-accident-2744534-2025-06-22",
      "headline": "Rishabh Pant on somersault celebration: Worked hard on gymnastics post my accidentEngland vs India, 1st Test: Rishabh Pant said he is now able to perform somersaults with ease, having trained in gymnastics during his school days. The wicketkeeper-batter executed a front flip to celebrate his first Test century as vice-captain in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-jasprit-bumrah-richard-hadlee-wicket-flat-pitches-2744529-2025-06-22",
      "headline": "Manjrekar compares Bumrah to Hadlee for breakthrough bowling on flat pitchesFormer India cricketer Sanjay Manjrekar lavished praise on Jasprit Bumrah for his uncanny ability to produce breakthroughs even on batting-friendly surfaces, comparing the Indian pace spearhead to New Zealand legend Sir Richard Hadlee—the first cricketer to reach 400 Test wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-3-leeds-updates-2744508-2025-06-22",
      "headline": "Day 3 Live: Jamie Smith falls, India take second new ballEngland (ENG) vs India (IND), 1st Test Day 3 Live Score and Updates: England lose Jamie Smith. India take the second new ball. Jasprit Bumrah and Mohammed Siraj are operating with the new cherry, looking to get a few more here. Chris Woakes has joined Harry Brook, who is nearing a three-figure score. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-qualify-icc-t20-world-cup-2026-americas-qualifier-win-2744501-2025-06-22",
      "headline": "Canada qualify for men's T20 World Cup 2026 with win vs BahamaThe Canadian men's cricket team has qualified for next year's ICC T20 World Cup in India and Sri Lanka after defeating the Bahamas by seven wickets in the Americas Qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jon-jones-retires-ufc-tom-aspinall-2744504-2025-06-22",
      "headline": "Jon Jones retires from UFC before highly anticipated fight against Tom AspinallJon Jones has officially retired from UFC, leaving the heavyweight title vacant. He calls time on his career right before his much-anticipated fight against Tom Aspinall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-on-rishabh-pant-134-leeds-test-2744479-2025-06-22",
      "headline": "Rishabh Pant plays the numbers game beautifully, has his own computer: ShastriFormer India head coach Ravi Shastri said Rishabh Pant 'plays the numbers game beautifully and has his own computer, the workings of which only he understands,' after the swashbuckling wicketkeeper-batter's audacious and entertaining show against England in the opening Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-coaching-gautam-gambhir-india-vs-england-2744478-2025-06-22",
      "headline": "Sourav Ganguly rates Gautam Gambhir's coaching style, open to India roleFormer India captain Sourav Ganguly reveals interest in coaching the national team. He also praises Gautam Gambhir's passion, anticipating growth in his coaching journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-3-leeds-updates-2744508-2025-06-22",
      "headline": "Day 3 Live: Jamie Smith falls, India take second new ballEngland (ENG) vs India (IND), 1st Test Day 3 Live Score and Updates: England lose Jamie Smith. India take the second new ball. Jasprit Bumrah and Mohammed Siraj are operating with the new cherry, looking to get a few more here. Chris Woakes has joined Harry Brook, who is nearing a three-figure score. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/canada-qualify-icc-t20-world-cup-2026-americas-qualifier-win-2744501-2025-06-22",
      "headline": "Canada qualify for men's T20 World Cup 2026 with win vs BahamaThe Canadian men's cricket team has qualified for next year's ICC T20 World Cup in India and Sri Lanka after defeating the Bahamas by seven wickets in the Americas Qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jon-jones-retires-ufc-tom-aspinall-2744504-2025-06-22",
      "headline": "Jon Jones retires from UFC before highly anticipated fight against Tom AspinallJon Jones has officially retired from UFC, leaving the heavyweight title vacant. He calls time on his career right before his much-anticipated fight against Tom Aspinall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-on-rishabh-pant-134-leeds-test-2744479-2025-06-22",
      "headline": "Rishabh Pant plays the numbers game beautifully, has his own computer: ShastriFormer India head coach Ravi Shastri said Rishabh Pant 'plays the numbers game beautifully and has his own computer, the workings of which only he understands,' after the swashbuckling wicketkeeper-batter's audacious and entertaining show against England in the opening Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-coaching-gautam-gambhir-india-vs-england-2744478-2025-06-22",
      "headline": "Sourav Ganguly rates Gautam Gambhir's coaching style, open to India roleFormer India captain Sourav Ganguly reveals interest in coaching the national team. He also praises Gautam Gambhir's passion, anticipating growth in his coaching journey."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}