{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-dismisses-vodafone-idea-airtel-plea-on-agr-interest-dues-2726933-2025-05-19",
      "headline": "Supreme Court dismisses Vodafone Idea, Airtel plea on AGR interest duesThe court dismissed the writ petitions filed by the telecom operators, calling the move \"shocking\" and stating that the petitions were \"misconceived.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/brent-crude-oil-price-usd-65-stocks-that-may-benefit-investors-share-market-2726911-2025-05-19",
      "headline": "Brent crude slips below $65: These stocks may benefit investorsBrent futures for July delivery were trading at $64.98 a barrel, down 0.66%. This is a steep fall from January, when prices were above $80 a barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/once-earning-rs-128-crore-metaverse-engineer-now-sidelined-by-ai-and-delivering-food-2726903-2025-05-19",
      "headline": "Once earning Rs 1.28 crore, metaverse engineer now sidelined by AI and delivering foodShawn Kay has worked in tech for 20 years. He was involved in virtual reality, web development and artificial intelligence. But after being laid off in April last year, things took a turn for the worse. The metaverse boom faded and jobs in that space dried up, especially with the sudden rise of AI tools like ChatGPT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dreaming-of-a-job-abroad-these-are-the-easiest-countries-to-get-a-work-visa-2726861-2025-05-19",
      "headline": "Dreaming of a job abroad? These are the easiest countries to get a work visaLatvia is the easiest country to get a skilled worker visa. It scored 7.64 out of 10 for ease of entry. The visa itself costs around 83 pounds and typically gets approved in ten working days, according to a study conducted by Remitly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-crash-protean-egov-technologies-why-reason-income-tax-department-tech-revamp-project-2726833-2025-05-19",
      "headline": "Explained: Why did Protean shares crash 20% todayProtean eGov Technologies, earlier known as NSDL e-Governance Infrastructure, provides technology solutions for various citizen-focused services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-turkey-relation-celebi-loss-usd-200-million-airport-operation-hit-market-cap-job-loss-2726820-2025-05-19",
      "headline": "India ousts Turkey's Celebi: $200 million lost in market-cap, jobs on the lineThe company, listed on the Istanbul Stock Exchange, saw its shares drop 20% in just two trading sessions. On 16 May, the stock fell 222 points to close at 2,002 lira. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-50-points-lower-nifty-above-25000-it-stocks-down-in-early-trade-2726798-2025-05-19",
      "headline": "Sensex opens 50 points lower, Nifty above 25,000; IT stocks down in early tradeThe S&P BSE Sensex was up 36.40 points to 82,366.99, while the NSE Nifty50 lost 5.65 points to 25,014.15 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-today-key-levels-sectors-to-watch-how-to-trade-share-market-trading-setup-2726797-2025-05-19",
      "headline": "Sensex, Nifty today: Key levels and sectors to watch. Here's how to tradeMarket experts say there is still positive momentum in the market, but traders should be cautious and focus on key levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-today-dalal-street-nse-bse-shares-trading-2726783-2025-05-19",
      "headline": "Stock market opening today: Sensex, Nifty to open flat. Here's whyThe Nifty50 index gained 4.2%, and foreign investors bought shares worth Rs 15,925 l . Thast week. This was the fifth week in a row of buying by foreign portfolio investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-19-bajaj-auto-delhivery-dr-reddys-jsw-steel-bel-2726770-2025-05-19",
      "headline": "Stocks to watch on May 19: Bajaj Auto, Delhivery, Dr Reddy's, JSW Steel, BELMany companies will be in focus due to their earnings and key updates, such as Power Grid Corporation of India, Bharat Electronics, DLF, ACME Solar Holdings, Bajaj Auto, Delhivery, Dr Reddy's, JSW Steel, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bangladesh-port-import-restrictions-bengal-impact-processed-foods-garments-2726727-2025-05-18",
      "headline": "Bengal to be impacted by Bangladesh import curbs, but nation first: OfficialsThe central government on Saturday imposed port restrictions on the import of a few Bangladeshi goods, such as readymade garments and processed food items."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-no-muscle-flexing-approach-that-worked-shivam-nair-2726883-2025-05-19",
      "headline": "John Abraham's The Diplomat, and the 'no muscle-flexing' approach that workedJohn Abraham's 'The Diplomat' is anchored in realism and driven by restraint. The movie brings to life the remarkable true story of Uzma Ahmed and the quiet, calculated world of diplomacy that ultimately saved her. Read to know how the espionage drama delves into the behind-the-scenes operations of international diplomacy, where power moves quietly. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-challenges-kumbh-shoot-for-hollywood-debut-lost-and-found-in-kumbh-exclusive-2726881-2025-05-19",
      "headline": "Exclusive: Rahul Bhat on challenges of shooting at Kumbh for his Hollywood debutRahul Bhat unveiled the first look of his Hollywood debut film 'Lost and Found in Kumbh' at Cannes Film Festival 2025. In an exclusive interview, Bhat spoke about the light-hearted comedy is set against the backdrop of the Kumbh Mela and promises a unique blend of Indian culture and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-eyes-top-gun-3-days-of-thunder-2-thinking-many-different-stories-2726877-2025-05-19",
      "headline": "Tom Cruise eyes Top Gun, Days of Thunder sequels: Thinking many different storiesActor Tom Cruise hinted at potential sequels to 'Top Gun: Maverick' and 'Days of Thunder' sequels. In an interview for the film, he said he is currently discussing 'many different stories'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-set-mumbai-ablaze-with-a-nostalgic-no-holds-barred-rock-spectacle-2726898-2025-05-19",
      "headline": "Guns N' Roses set Mumbai ablaze with a nostalgic, no-holds-barred rock spectacleAfter a 13-year hiatus, Guns N' Roses delivered a powerful and memorable concert in Mumbai, winning hearts with their classic hits. The band's energetic performance and crowd interaction made it a night to remember for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-americans-have-no-idea-about-kashmir-india-pakistan-conflict-2726884-2025-05-19",
      "headline": "Americans have no idea about Kashmir, India-Pakistan conflict: Vivek AgnihotriFilmmaker Vivek Agnihotri, in an exclusive interview with India Today, spoke about the West's perception of the India-Pakistan conflict, and the Kashmir issue. He said we need to make more films about the Valley the way the US made on the Holocaust. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-makes-it-to-forbes-30-list-rumoured-partner-walker-blanco-reacts-2726867-2025-05-19",
      "headline": "Ananya Panday makes it to Forbes 30 list, rumoured partner Walker Blanco reactsAnanya Panday has been named in the Forbes' 30 Under 30 Asia list for 2025. Her rumoured partner, Walker Blanco, celebrated the achievement with a supportive note on Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-daughter-nurvi-amitabh-bachchan-fan-arts-passion-2726864-2025-05-19",
      "headline": "Neil Nitin Mukesh on daughter Nurvi's love for arts and Big B's filmsActor Neil Nitin Mukesh reveals his six-year-old daughter Nurvi's growing passion for the arts and admiration for Amitabh Bachchan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-vedan-kerala-concert-crowd-mismanagement-no-major-injuries-2726851-2025-05-19",
      "headline": "Rapper Vedan's Kerala concert ends early due to crowd mismanagementKerala rapper Vedan's concert in Palakkad faced chaos due to overwhelming crowd turnout. Police intervened with lathi charge but confirmed no major injuries at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhay-deol-turns-dj-at-gurugram-nightclub-fans-call-him-ord-dj-bobby-student-2726845-2025-05-19",
      "headline": "Abhay Deol turns DJ at Gurugram nightclub, fans call him 'lord Bobby's student'Actor Abhay Deol took over the DJ console at a nightclub in Gurugram. A video of his set has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ravi-kishan-warning-to-pakistan-against-terrorist-activity-will-get-a-befitting-reply-2726832-2025-05-19",
      "headline": "Will get fitting reply: Ravi Kishan's warning to Pak against 'terrorist activity'Actor and BJP MP Ravi Kishan talked about India's Operation Sindoor against Pakistan-backed terrorism, and highlighted that we will give a 'fitting reply' to our neighbour if they 'provoke' us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-recreates-mother-raveena-tandon-iconic-tip-tip-barsa-paani-steps-watch-award-show-2726819-2025-05-19",
      "headline": "Rasha Thadani recreates mother Raveena's iconic Tip Tip Barsa Paani at event. WatchActor Rasha Thadani stole attention after she recreated her mother Raveena Tandon's iconic hit 'Tip Tip Barsa' from 'Mohra' at an award show. The video of her performance has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keneeshaa-cryptic-post-ravi-mohan-aarti-divorce-2726816-2025-05-19",
      "headline": "New beginnings: Singer Keneeshaa's cryptic post amid actor Ravi Mohan's divorceSinger Keneeshaa shared a poetry about 'noise' and 'new beginnings' on her Instagram page. This post comes days after actor Ravi Mohan called her companion in four-page note against his ex-wife Aarti amid divorce battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-fame-achint-kaur-asks-for-work-says-actor-life-has-peaks-and-pauses-2726815-2025-05-19",
      "headline": "Kyunki... fame Achint Kaur asks for work, says actor's life has peaks and pausesAchint Kaur, known for playing Mandira in 'Kyunki Saas Bhi Kabhi Bahu Thi', posted a video asking for suitable work opportunities as an actor and voice-artiste. She also mentioned that her profession has its highs and lows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-is-bewitching-in-black-at-cannes-but-fans-spot-wardrobe-glitch-2726802-2025-05-19",
      "headline": "Urvashi Rautela is bewitching in black at Cannes, but fans spot wardrobe glitchActor Urvashi Rautela's black outfit at Cannes drew attention after a viral video highlighted a small tear in her dress. Despite the mishap, she earned praise for her fashion choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-the-girlfriend-delayed-rahul-ravindran-2726794-2025-05-19",
      "headline": "Rashmika Mandanna asks fans to wait amid 'The Girlfriend' delay: Delivering soonActor Rashmika Mandanna and director Rahul Ravindran appealed to their fans to be patient amid 'The Girlfriend's' delay.  The actor promised that the updates would follow soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-final-reckoning-box-office-day-2-detailed-report-solid-opening-weekend-for-tom-cruise-film-beats-oppenheimer-2726792-2025-05-19",
      "headline": "Mission Impossible 8 box office Day 2: Solid opening weekend, beats OppenheimerTom Cruise's 'Mission: Impossible-The Final Reckoning' is working fabulously at the box office in India. The film finished its first-weekend run on a strong note, also surpassing the two-day business of 'Oppenheimer'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-athiya-praise-kl-rahul-after-he-smashes-5th-century-at-ipl-2726782-2025-05-19",
      "headline": "Suniel Shetty, Athiya praise KL Rahul after he smashes 5th century in IPLAthiya and her father-actor Suniel Shetty, praised KL Rahul after he smashed a century for at least three different franchises. This came after the Delhi Capitals game against the Gujarat Titans (GT) on May 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-gender-equality-cannes-resist-ageism-2726764-2025-05-19",
      "headline": "Resist ageism: Nicole Kidman's advice at Cannes as she champions gender equalityActor Nicole Kidman is 2025's recipient of Women in Motion Award at the Cannes Film Festival. Speaking at the event, she advocated for 'resisting ageism' in the world of cinema.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-recreates-main-tera-tota-tu-meri-maina-with-father-chunky-pandey-2726641-2025-05-18",
      "headline": "Nothing, just Ananya Panday recreating Main Tera Tota… with father ChunkyAnanya Panday and her father Chunky Pandey recreated the iconic song 'Main Tera Tota Tu Meri Maina' at a Saturday award function. Videos shared on Ananya's fan pages quickly won hearts online."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/crocodile-tears-top-court-orders-special-probe-into-minister-vijay-shahs-remarks-against-col-sofiya-qureshi-2726922-2025-05-19",
      "headline": "Top court rejects Minister's apology for Col Sofiya Qureshi remarks, orders probeThe Supreme Court on Monday constituted a Special Investigation Team of three IPS officers to investigate the FIR filed against Madhya Pradesh Minister Vijay Shah for his communal and offensive remarks against Army officer Colonel Sofiya Qureshi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-operation-sindoor-attack-jammu-border-pahalgam-terrorist-post-2726795-2025-05-19",
      "headline": "A Bajrang Bali war cry and payback: How Rajput Regiment soldiers destroyed Pak postsIndia Today spoke to the Indian Army bravehearts stationed along the International Border in Jammu, who swiftly and resolutely countered Pakistan's attacks, inflicting heavy casualties and destroying enemy posts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistani-spy-network-busted-in-haryanas-nuh-second-arrest-in-2-days-2726880-2025-05-19",
      "headline": "Pakistani 'spy' network busted in Haryana's Nuh, second arrest in 2 daysA Haryana man was arrested as the police busted a Pakistani spy network, marking the second arrest in two days in Haryana's Nuh, amid a spate of recent anti-espionage operations.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-professor-in-uk-loses-oci-status-anti-india-activities-nitasha-kaul-university-of-westminster-2726943-2025-05-19",
      "headline": "Indian-origin professor in UK loses OCI status over anti-India activitiesThe OCI status of UK-based Indian-origin academician Nitasha Kaul has been cancelled over \"anti-India activities\", driven by \"malice and complete disregard for facts or history\". The government notice was shared by Kaul, who was deported from Bengaluru airport last year within hours of her landing in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/joe-biden-advanced-prostate-cancer-diagnosis-expert-debate-rapid-progression-screening-2726857-2025-05-19",
      "headline": "After Biden's prostate cancer diagnosis, questions about timeline, transparencyFormer US President Joe Biden has been diagnosed with advanced prostate cancer that has spread to his bones. Experts and doctors are debating how quickly the cancer could have progressed without earlier detection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/was-on-leave-ola-on-bengaluru-techies-suicide-due-to-alleged-work-pressure-2726889-2025-05-19",
      "headline": "Was on leave: Ola Krutrim on Bengaluru techie's 'suicide' due to work pressureKrutrim, an artificial intelligence unit of Ola, came under fire after a social media post claimed that its employee died by suicide due to toxic work culture and pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-targeted-amritsar-on-may-8-how-indias-air-defence-saved-golden-temple-2726817-2025-05-19",
      "headline": "Pakistan targeted Amritsar on May 8. How India's air defence saved Golden TemplePakistan engaged in an air assault with aerial weapons, including drones and long-range missiles, targeting the Golden Temple, which was \"thwarted\" by the army personnel, who remained prepared for such situations and attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/puducherry/story/us-based-eye-doctor-stopped-from-boarding-at-puducherry-airport-for-carrying-satellite-phone-2726912-2025-05-19",
      "headline": "US doctor stopped from boarding at Puducherry airport for carrying satellite phoneA 32-year-old US-based ophthalmologist was stopped from boarding at the Puducherry airport for carrying a satellite phone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-made-in-india-armoured-jeep-used-to-fire-missiles-on-pak-posts-2726818-2025-05-19",
      "headline": "Watch: Made-in-India armoured jeep used to fire missiles on Pak postsGaurav Sawant from India Today shot and interviewed on Made in India Light Specialist Vehicle — a 3600cc special bulletproof jeep used to fire missiles on Pakistani positions and transport troops in combat zones during Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/rohit-joy-texas-republican-party-us-termination-call-for-h-1b-visas-donald-trump-clamp-down-immigration-2726892-2025-05-19",
      "headline": "Scrap H-1B visas, deport holders, says Indian-origin politician, faces backlashRohit Joy, an Indian-origin Republican from Texas, sought the termination of the H-1B visa programme and deportation of its holders. Joy's remarks, which clashed with fellow Republican Rich McCormick's push for the domestic renewal of H-1b visas, earned him massive blowback. People were quick to remind him of his immigrant background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-world-is-full-of-idiots-grok-is-this-true-2726872-2025-05-19",
      "headline": "The world is full of idiots, @grok is this true?What does a world where people have outsourced their thinking to AI look like? It looks like the one where everyone is groking all the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-is-bewitching-in-black-at-cannes-but-fans-spot-wardrobe-glitch-2726802-2025-05-19",
      "headline": "Urvashi Rautela is bewitching in black at Cannes, but fans spot wardrobe glitchActor Urvashi Rautela's black outfit at Cannes drew attention after a viral video highlighted a small tear in her dress. Despite the mishap, she earned praise for her fashion choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-reacts-after-his-mother-shares-results-of-his-1989-computer-aptitude-test-2726850-2025-05-19",
      "headline": "Elon Musk reacts after his mother shares results of his 1989 computer aptitude testThe document, dated May 17, 1989, was issued by the University of Pretoria, where Elon Musk studied for a short period before moving to Canada at the age of 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/joe-biden-aggressive-prostate-cancer-bone-metastases-hormone-therapy-2726830-2025-05-19",
      "headline": "Joe Biden faces prostate cancer with Gleason score 9: What it meansFormer US President Joe Biden has been diagnosed with an aggressive form of prostate cancer that has spread to his bones. The diagnosis highlights challenges in treatment, but offers hope through hormone therapy options."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-arrests-former-uco-bank-chairman-subodh-goel-in-connection-with-fraud-case-2726866-2025-05-19",
      "headline": "ED arrests UCO Bank ex-chairman Subodh Goel in Rs 6,210 crore fraud caseThe ED arrested former UCO Bank chairman Subodh Kumar Goel in a Rs 6,210 crore bank fraud case linked to Concast Steel and Power Limited.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/heart-attack-cardiac-arrest-explained",
      "headline": "Decoding heart attack: The silent pandemic raging worldwideIn the post-Covid world, changing lifestyles, increased stress conditions, and poor environment are putting the heart under extreme pressure. We look at how the heart is at risk, and the world is eying a raging \"silent pandemic.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arrested-youtuber-jyoti-malhotras-instagram-account-suspended-over-alleged-pak-link-2726865-2025-05-19",
      "headline": "Arrested YouTuber Jyoti Malhotra's Instagram suspended over alleged Pak linkTwo days after Haryana-based travel vlogger Jyoti Malhotra was arrested for allegedly sharing critical intel with Pakistani operatives and spying for them, her Instagram account has been blocked today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bcci-withdraws-asia-cup-2025-tensions-pakistan-sources-2726836-2025-05-19",
      "headline": "India won't play or host Asia Cup 2025 amid Pakistan tensions: SourcesIndia has decided not to play or host the Asia Cup this year amidst tensions with Pakistan, sources told India Today on Monday, May 19. The Women's Emerging Teams Asia Cup, which was slated to be held in June, has reportedly been cancelled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-takes-up-ashoka-university-professors-plea-against-arrest-for-op-sindoor-post-hearing-tomorrow-2726846-2025-05-19",
      "headline": "Top court to hear plea of professor arrested over Op Sindoor post tomorrowAppearing on behalf of Ashoka University professor, Ali Khan Mahmudabad, senior advocate Kapil Sibal said that the professor was arrested for an 'entirely patriotic statement on Operation Sindoor.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranchi-dancing-thieves-sweet-shop-robbery-caught-on-cctv-jharkhand-2726822-2025-05-19",
      "headline": "Heist with twist: Ranchi thieves dance and feast while robbing sweets shopTwo unidentified thieves robbed a Ranchi sweet shop while dancing and feasting inside. The bizarre heist was caught on CCTV, showing them carefree and fearless.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-outreach-foreign-tour-yusuf-pathan-trinamool-congress-all-party-delegation-2726812-2025-05-19",
      "headline": "Trinamool's Yusuf Pathan snubs government's Op Sindoor delegation inviteTrinamool Congress MP Yusuf Pathan has declined to join the Operation Sindoor foreign outreach delegation, after the government named him allegedly without consulting his party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-sarma-says-gaurav-gogoi-visited-pakistan-on-isis-invite-2726801-2025-05-19",
      "headline": "Will resign if..: Himanta Sarma doubles down on Pak charge against Gaurav GogoiSarma claimed that Gogoi went to Pakistan at the invitation of Pakistan's spy agency Inter-Services Intelligence (ISI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/overnight-rain-sees-parts-of-city-waterlogged-lowlying-areas-flooded-silk-board-2726790-2025-05-19",
      "headline": "Heavy overnight rain floods parts of Bengaluru, traffic takes a hitBengaluru residents woke up to another wet Monday with roads waterlogged as rains lashed the city overnight. Several low-lying areas were flooded and many parts of the city saw waterlogging. With gridlocks across many parts of Karnataka's capital city."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-parents-pok-india-vs-pakistan-operation-sindoor-2726951-2025-05-19",
      "headline": "Moeen Ali reveals his parents were in PoK during India-Pakistan conflictFormer England all-rounder Moeen Ali has revealed that his parents were stranded in Pakistan-Occupied Kashmir (PoK) while he was in India earlier this month during a period of rising military tensions with Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-daniel-vettori-no-break-excuse-2726935-2025-05-19",
      "headline": "SRH won't use break as excuse ahead of LSG clash: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori made it clear that the team won't use their extended break as an excuse ahead of their clash against Lucknow Super Giants on May 19. While both teams return after the break, SRH will play for pride, and LSG will fight to keep their fading playoff hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/javelin-neeraj-chopra-90-metre-barrier-gagan-narang-2726934-2025-05-19",
      "headline": "Neeraj Chopra is free to push his limits after breaching 90m mark: Gagan NarangGagan Narang feels that Neeraj Chopra is now free to push his limits after breaking the 90-metre barrier during the Doha Diamond League on May 16. Neeraj finished second at the Diamond League in Doha but was finally able to get the monkey off his back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-lungi-ngidi-replacement-blessing-muzurabani-playoffs-2726908-2025-05-19",
      "headline": "IPL 2025: RCB replace Lungi Ngidi with Zimbabwe pacer ahead of playoffsRCB have replaced Lungi Ngidi with Zimbabwe pacer Blessing Muzurabani ahead of the IPL 2025 play-offs on Monday, May 19. The replacement will come into effect on May 26 when Ngidi will leave to join the South Africa squad for the WTC final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-quits-alcohol-injury-rehabilitation-fitness-india-test-series-ashes-2726901-2025-05-19",
      "headline": "Ben Stokes quits alcohol during injury rehab to stay fit for India seriesBen Stokes revealed he quit alcohol in January to speed up his recovery from a hamstring injury. With major series against India and Australia looming, the England captain made fitness his top priority during rehabilitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-preview-team-news-lucknow-pitch-weather-rishabh-pant-pat-cummins-2726887-2025-05-19",
      "headline": "LSG vs SRH: Lucknow look to keep faint playoff hopes alive against HyderabadLucknow Super Giants aim to keep their faint play-off hopes alive against Sunrisers Hyderabad, who look to avoid the wooden spoon in IPL 2025. Both teams will miss a few key players in the contest at the Ekana stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-focussed-to-win-last-3-games-says-william-orourke-2726719-2025-05-19",
      "headline": "LSG focussed to win last 3 games and somehow sneak into playoffs: William O'RourkeLucknow Super Giants (LSG) are focussing on winning their last three league fixtures and qualifying for the play-offs of the Indian Premier League 2025 (IPL 2025), revealed fast bowler William O'Rourke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-ms-dhoni-reference-aashis-kapoor-assistant-coach-2726855-2025-05-19",
      "headline": "GT assistant coach backs Shubman Gill's captaincy with MS Dhoni referenceGT assistant coach Aashish Kapoor backed Shubman Gill's calm, strategic leadership during IPL 2025, drawing parallels with MS Dhoni as speculation grows around Gill becoming India's next Test captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-abishek-porel-playoff-qualification-press-conference-delhi-2726849-2025-05-19",
      "headline": "IPL 2025: DC's Abishek Porel upbeat about playoff qualification despite GT lossDC's Abishek Porel is upbeat about the play-off qualification despite their loss to GT on Sunday. Delhi need to win their remaining two games to stand a chance of making it to the play-offs this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bcci-withdraws-asia-cup-2025-tensions-pakistan-sources-2726836-2025-05-19",
      "headline": "India won't play or host Asia Cup 2025 amid Pakistan tensions: SourcesIndia has decided not to play or host the Asia Cup this year amidst tensions with Pakistan, sources told India Today on Monday, May 19. The Women's Emerging Teams Asia Cup, which was slated to be held in June, has reportedly been cancelled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-true-leader-sai-sudharsan-shine-sunil-gavaskar-dc-vs-gt-2726800-2025-05-19",
      "headline": "Shubman Gill a true leader, he's happy to let Sai Sudharsan shine: Sunil GavaskarIPL 2025, DC vs GT: Batting great Sunil Gavaskar lauded the hugely-successful partnership between Shubman Gill and Sai Sudharsan. The duo added 205 runs for the opening partnership as Gujarat hammered Delhi by 10 wickets on Sunday to secure their spot in the playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-focussed-to-win-last-3-games-says-william-orourke-2726719-2025-05-19",
      "headline": "LSG focussed to win last 3 games and somehow sneak into playoffs: William O'RourkeLucknow Super Giants (LSG) are focussing on winning their last three league fixtures and qualifying for the play-offs of the Indian Premier League 2025 (IPL 2025), revealed fast bowler William O'Rourke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-ms-dhoni-reference-aashis-kapoor-assistant-coach-2726855-2025-05-19",
      "headline": "GT assistant coach backs Shubman Gill's captaincy with MS Dhoni referenceGT assistant coach Aashish Kapoor backed Shubman Gill's calm, strategic leadership during IPL 2025, drawing parallels with MS Dhoni as speculation grows around Gill becoming India's next Test captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-abishek-porel-playoff-qualification-press-conference-delhi-2726849-2025-05-19",
      "headline": "IPL 2025: DC's Abishek Porel upbeat about playoff qualification despite GT lossDC's Abishek Porel is upbeat about the play-off qualification despite their loss to GT on Sunday. Delhi need to win their remaining two games to stand a chance of making it to the play-offs this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bcci-withdraws-asia-cup-2025-tensions-pakistan-sources-2726836-2025-05-19",
      "headline": "India won't play or host Asia Cup 2025 amid Pakistan tensions: SourcesIndia has decided not to play or host the Asia Cup this year amidst tensions with Pakistan, sources told India Today on Monday, May 19. The Women's Emerging Teams Asia Cup, which was slated to be held in June, has reportedly been cancelled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-true-leader-sai-sudharsan-shine-sunil-gavaskar-dc-vs-gt-2726800-2025-05-19",
      "headline": "Shubman Gill a true leader, he's happy to let Sai Sudharsan shine: Sunil GavaskarIPL 2025, DC vs GT: Batting great Sunil Gavaskar lauded the hugely-successful partnership between Shubman Gill and Sai Sudharsan. The duo added 205 runs for the opening partnership as Gujarat hammered Delhi by 10 wickets on Sunday to secure their spot in the playoffs."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}