{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-350-points-higher-nifty-above-25400-infosys-wipro-lead-gains-2789196-2025-09-18",
      "headline": "Sensex, Nifty rise on US Fed rate cut; Infosys, Wipro gainThe S&P BSE Sensex gained over 350 points to trade above the 83,000 mark, while the NSE Nifty50 crossed 25,400 in early trade. Broader market indices also saw gains, with volatility remaining stable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dreamfolks-crisis-explained-what-is-going-on-and-what-it-means-for-investors-2789185-2025-09-18",
      "headline": "DreamFolks crisis explained: What's going on and what it means for investorsFounded in 2013, DreamFolks acted as a platform connecting banks, credit card companies, and passengers to airport lounges, food services, baggage handling, and other airport amenities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-cuts-rates-for-1st-time-this-year-will-it-give-a-boost-to-dalal-street-2789174-2025-09-18",
      "headline": "US Fed cuts rates for 1st time this year. Will it give a boost to Dalal Street?Lower US interest rates tend to make emerging markets like India more attractive to foreign portfolio investors (FPIs), as dollar assets lose some shine and Treasury yields ease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/urban-company-share-price-blockbuster-stock-market-listing-debut-decoding-rally-what-next-2789167-2025-09-18",
      "headline": "Urban Company shares register bumper debut on Dalal Street, but what's next?Urban Company's shares, issued at Rs 103, opened at Rs 162.25 and surged as much as 74% during the day. For those who got shares in the IPO, that meant instant profits and a near $3 billion market value for the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ben-and-jerrys-co-founder-jerry-greenfield-quits-accuses-unilever-of-silencing-brands-activism-2788978-2025-09-17",
      "headline": "Ben & Jerry's co-founder quits, accuses Unilever of silencing brand's activismBen & Jerry's co-founder Jerry Greenfield has stepped down from the company after 47 years, saying its independence to speak on social issues has been eroded under Unilever's ownership. Unilever, which is spinning off its ice cream business, thanked Greenfield for his service but disagreed with his claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-it-defence-psu-banking-sector-likely-to-see-growth-on-dalal-street-expert-advice-2788858-2025-09-17",
      "headline": "IT, defence or PSU banking: Which sector is likely to see growth on D-Street?PSU banking stocks have started gaining attention after a long period of underperformance, while the IT sector remains in a state of uncertainty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-run-amid-india-us-trade-talk-optimism-2788829-2025-09-17",
      "headline": "Sensex, Nifty continue winning run amid India-US trade talk optimismThe S&P BSE Sensex rose 313.02 points to close at 82,693.71, while the NSE Nifty50 added 91.25 points to end at 25,330.25. Broader markets also held their ground, with midcap and smallcap indices finishing in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-birthday-wishes-business-leaders-ambani-kotak-mahindra-bill-gates-2788816-2025-09-17",
      "headline": "Business leaders extend heartfelt wishes to PM Modi on 75th birthdayProminent business leaders across India as he celebrated his 75th birthday on Tuesday, with several industrialists praising his transformational leadership and unwavering commitment to the nation's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/home-loan-easy-method-ai-tool-hom-i-basic-home-loan-fintech-atul-monga-2788796-2025-09-17",
      "headline": "Want a home loan without the headache? Here's how AI can help youFrom lengthy paperwork to long waiting periods, applying for a home loan often becomes a tedious process filled with red tape, but an AI tool can now make it easy for you. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cotton-farmers-face-new-challenge-as-quality-issues-threaten-msp-2788758-2025-09-17",
      "headline": "Cotton farmers face new challenge as quality issues threaten MSPDuring this Kharif season, northern states such as Haryana, Punjab, and Rajasthan, and southern states including Andhra Pradesh and Telangana, experienced prolonged and abnormal rainfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-launch-siddharth-jain-first-india-inc-tesla-owner-boost-ev-adoption-2788714-2025-09-17",
      "headline": "Elon Musk congratulates Siddharth Jain, India Inc's 1st executive to own a TeslaElon Musk congratulated Siddharth Jain of INOX Group on owning the first Tesla in India Inc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-startup-usd-1-billion-leaves-office-bengaluru-pothole-ceo-rajesh-kumar-yabaji-2788677-2025-09-17",
      "headline": "$1 billion startup BlackBuck leaves Bengaluru office, blames potholesBengaluru firm BlackBuck, worth over $1 billion has decided to move out of their office in the city due to worsening pothole conditions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/ranbir-kapoor-alia-bhatt-madhuri-dixit-the-bads-of-bollywood-premiere-2789199-2025-09-18",
      "headline": "Ranbir-Alia, Madhuri Dixit and celebs shine at The Ba***ds of Bollywood premiereMadhuri Dixit, Ranbir Kapoor, Alia Bhatt, and Bollywood's biggest stars lit up The 'Ba***ds of Bollywood' premiere with glamour, style, and star power.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-renews-we-were-liars-second-season-new-mysteries-2789188-2025-09-18",
      "headline": "Prime Video renews We Were Liars for a darker, twistier Season 2Prime Video has greenlit a second season of the hit thriller 'We Were Liars', after a debut that enthralled audiences with its intoxicating blend of privilege, secrets, and betrayal. The new chapter promises sharper twists and a darker dive into the Sinclair family's haunting past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-collection-day-6-teja-sajja-rs-45-crore-after-rs-100-crore-run-2789190-2025-09-18",
      "headline": "Mirai box office Day 6: Teja Sajja film adds Rs 4.5 crore after Rs 100 crore runTeja Sajja and Manoj Manchu's 'Mirai' added another Rs 4.5 crore nett to the box office collection on Day 6. The film surpassed Rs 100 crore globally within a week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amazon-prime-video-feature-film-the-summer-i-turned-pretty-finale-2789179-2025-09-18",
      "headline": "One last summer: The Summer I Turned Pretty gets its movie finalePrime Video is giving 'The Summer I Turned Pretty' a curtain call – a feature film that will bring the beloved saga to its grand finale, with creator Jenny Han and the original cast stepping back into the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samay-raina-say-no-to-cruise-tshirt-aryan-khan-premiere-bollywood-2789166-2025-09-18",
      "headline": "Samay Raina wears 'Say no to cruise' T-shirt at The Ba***ds of Bollywood screeningComedian Samay Raina wore a T-shirt with the message 'Say no to cruise' at 'The Ba***ds of Bollywood' premiere. The statement is seen as an indirect reference to Aryan Khan's 2021 drug case linked to a cruise party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/park-chan-wook-discusses-ai-and-no-other-choice-at-busan-film-festival-2789155-2025-09-18",
      "headline": "Exclusive: Director Park Chan-wook discusses AI, No Other Choice at Busan festDirector Park Chan-wook's latest film, 'No Other Choice' opened at the Busan Film Festival. The filmmaker, in an exclusive interaction with India Today at Busan, talked about the influence of AI and the nuances in his film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/aryan-khan-turns-photographer-as-srk-poses-at-the-bads-of-bollywood-premiere-2789067-2025-09-17",
      "headline": "Aryan Khan turns photographer as SRK poses at The B***ds of Bollywood premiereAryan Khan turned photographer for Shah Rukh Khan at 'The B***ds of Bollywood' premiere. Gauri, Suhana and AbRam also arrived for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/no-other-choice-review-park-chan-wook-comedy-satire-family-drama-busan-film-festival-2789041-2025-09-17",
      "headline": "No Other Choice review: Park Chan-wook film is darkly funny and deeply unsettlingRelease Date:Fri Aug 29, 2025No Other Choice movie review: Park Chan-wook's 'No Other Choice' is a darkly funny film blending satire and family drama. It critiques capitalism's cruelty while delivering a deeply unsettling narrative. It was the opening film at the Busan International Film Festival today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-morning-show-season-4-review-ai-threat-newsroom-drama-2789006-2025-09-17",
      "headline": "The Morning Show 4 review: Jennifer-Reese's show remains compulsively watchableRelease Date:Wed Sep 17, 2025The Morning Show season 4 sees Jennifer Aniston and Reese Witherspoon return with fierce performances. The season explores AI's impact on newsrooms and power struggles behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-defends-200-cinema-ticket-cap-court-multiplex-challenge-2788855-2025-09-17",
      "headline": "Karnataka government defends Rs 200 ticket cap in court, cites public interestThe Karnataka government defended its Rs 200 cinema ticket cap in court, calling it a public measure, while theatre owners argued it curbs business rights and investments.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anaconda-trailer-jack-black-paul-rudd-join-forces-meta-horror-reboot-2788993-2025-09-17",
      "headline": "Anaconda trailer: Jack Black, Paul Rudd join forces in meta horror reboot'Anaconda' returns to cinemas this Christmas with a mix of action and comedy. The film brings a fresh take on creature chaos featuring actors Jack Black and Paul Rudd in pivotal roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sydney-sweeney-offered-rs-530-crore-deal-for-bollywood-debut-report-2788989-2025-09-17",
      "headline": "Hollywood star Sydney Sweeney offered Rs 530 crore deal for Bollywood debut: ReportAs a testament to her growing popularity in India, Hollywood actor Sydney Sweeney has reportedly been offered a role in a high-budget Bollywood film. The offer includes a paycheck of over Rs 530 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-slams-amaal-malliks-language-in-bb-19-says-respect-legacy-2788986-2025-09-17",
      "headline": "Gauahar slams Amaal Mallik's language in BB 19, says respect legacyIn a staunch criticism, actor Gauahar Khan urged singer Amaal Mallik to pay attention to his remarks against other contestants in 'Bigg Boss 19'. In her X post, the 'Bigg Boss 7' winner said she hopes his language is discussed during Weekend Ka Vaar. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-johar-calls-aryan-khan-debut-big-night-says-proud-beyond-words-2788971-2025-09-17",
      "headline": "Karan Johar calls Aryan Khan's debut a big night, says he's proud beyond wordsDirector-producer Karan Johar wrote an emotional note ahead of the premiere of Aryan Khan's directorial debut 'The B***ds of Bollywood'. He praised Aryan's dedication towards storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/who-is-unni-mukundan-the-malayalam-actor-playing-pm-modi-in-his-biopic-maa-vande-2788962-2025-09-17",
      "headline": "Who is Unni Mukundan, the Malayalam actor playing PM Modi in his biopic Maa Vande?On PM Narendra Modi's 75th birthday, a biopic titled 'Maa Vande' was announced with Malayalam actor Unni Mukundan set to play the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prahlad-kakkar-recalls-priyanka-chopra-early-career-struggle-with-bad-skin-2788832-2025-09-17",
      "headline": "Prahlad Kakkar recalls Priyanka Chopra's early career struggle with bad skinAd filmmaker Prahlad Kakkar recalled the struggles Priyanka Chopra faced at the start of her career, from industry biases to personal challenges, and praised her determination to succeed. He also praised her bold move to Hollywood when Bollywood began sidelining her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-siddharth-celebrate-first-wedding-anniversary-with-special-note-2788910-2025-09-17",
      "headline": "Aditi Rao Hydari-Siddharth celebrate first wedding anniversary with special noteActors Aditi Rao Hydari and Siddharth celebrated their first wedding anniversary with heartfelt photos and a touching Instagram note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-3-finale-review-dreamy-parisian-farewell-worth-the-wait-belly-conrad-jeremiah-fisher-2788934-2025-09-17",
      "headline": "The Summer I Turned Pretty 3 finale review: Dreamy Parisian farewell worth the waitRelease Date:Wed Sep 17, 2025A romantic fairytale, some butterflies, and a few tears. The finale of 'The Summer I Turned Pretty Season 3' on Prime Video was a perfect send-off to the love story we've been bingeing on for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/manipuri-film-boong-premiere-indian-cinemas-19-september-2025-2788921-2025-09-17",
      "headline": "Manipuri film Boong gets India release date after festival acclaimManipuri film 'Boong', directed by Lakshmipriya Devi, will be released in select Indian theatres on September 19. The film, previously premiered at the Toronto International Film Festival, marks a significant moment for Manipuri cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-chamoli-heavy-rain-cloudburst-houses-swet-away-people-missing-2789141-2025-09-18",
      "headline": "Cloudburst in Uttarakhand's Chamoli, 10 missing, houses washed awayThe incident took place late Wednesday night in Nanda Nagar. While two people were rescued from the debris, search operations are currently underway. A medical team and three ambulances are being rushed to the affected area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-vote-chori-hydrogen-bomb-press-conference-live-updates-congress-mp-2789207-2025-09-18",
      "headline": "Live: Rahul Gandhi's press meet shortly days after 'hydrogen bomb' remarkRahul Gandhi vote chori press meeting Live: Days after Rahul Gandhi said he would soon come out with a \"hydrogen bomb\" of revelations about \"vote chori\", the Congress announced that the Leader of Opposition in the Lok Sabha will hold a press conference on Thursday.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/abc-suspends-broadcasts-of-jimmy-kimmels-show-over-charlie-kirk-comments-glbs-2789130-2025-09-18",
      "headline": "Jimmy Kimmel taken off air over Charlie Kirk comments; great news, says TrumpDuring his monologue on Monday night, Jimmy Kimmel criticised Republicans who allegedly sought to politicise Kirk's shooting and took a jab at Trump for behaving like a child mourning his \"goldfish\" after his ally's murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-study-implications-for-our-national-security-india-on-pakistan-saudi-defence-pact-2789180-2025-09-18",
      "headline": "Will study implications for our national security: India on Pak-Saudi defence pactPakistan and Saudi Arabia have signed a major mutual defence agreement in Riyadh, declaring that any attack on either country will be treated as an attack on both. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/beyond-yadavs-the-coalition-rjd-needs-to-reclaim-bihar-in-assembly-elections-2025-2788949-2025-09-18",
      "headline": "Beyond Yadavs: The Coalition RJD Needs to Reclaim BiharDespite being the single largest party in the 2015 and 2020 polls, the chief minister's post remains out of reach for RJD. The party now faces the challenge of expanding beyond its Muslim-Yadav base to attract non-Yadav OBCs, EBCs, Dalits, and upper castes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-police-pcr-van-accident-kills-man-near-ram-krishna-ashram-metro-2789175-2025-09-18",
      "headline": "Man killed as Delhi Police vehicle mounts ramp, crushes himAn unidentified man was killed when a Delhi Police PCR van struck him near Ram Krishna Ashram Metro station. Police are investigating the incident and have promised support for the deceased's family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-vs-uae-boycott-drama-pointless-powerplay-2789128-2025-09-18",
      "headline": "Pakistan's Asia Cup own goal: When handshake row turned into pointless powerplayIn Dubai, Pakistan's Asia Cup campaign was nearly undone not by cricket but by theatre. A handshake snub against India spiralled into boycott threats and frantic U-turns, leaving players distracted before a must-win clash. The PCB claimed to defend pride, but none of its demands were met."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/turkish-zigana-austrian-glock-pistols-recovered-disha-patani-house-firing-2789169-2025-09-18",
      "headline": "Turkish pistols smuggled via Pak drone seized from Disha Patani home shootersThe same Turkish-made Zigana pistol, smuggled into India via drones from Pakistan and cargo routes through Nepal, was earlier used in the killings of gangster Atiq Ahmed and singer Sidhu Moosewala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-javelin-final-neeraj-vs-arshad-india-pakistan-2789014-2025-09-17",
      "headline": "Neeraj's one and done, Arshad's save: Javelin set for fascinating final in TokyoThe World Athletics Championship saw a fascinating contest in the men's javelin qualification round. After struggling for months to reach his peak, Neeraj got the job done in just one throw. Arshad Nadeem, the Olympic champion, nearly got knocked out in the first round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-designates-anti-fascist-antifa-movement-as-terrorist-organization-glbs-2789140-2025-09-18",
      "headline": "Sick, dangerous: Trump declares anti-fascist Antifa movement as terrorist groupThe White House linked the decision to the killing of Charlie Kirk, a prominent right-wing figure. Trump said in a video statement after the assassination that he would take every possible step to cut off support for left-wing organisations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-abbas-ramsada-grew-up-with-modi-at-his-gujarat-vadnagar-home-pm-75-birthday-childhood-friend-heeraben-pankaj-2788982-2025-09-17",
      "headline": "Who is Abbas, who grew up with Modi at his Vadnagar home?Prime Minister Narendra Modi, in a blogpost on his mother Heeraben in 2022, spoke about Abbas, who as a child stayed at their Vadnagar home. Who was Abbas? Revisiting Abbas and Modi's childhood on his 75th birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/12-foot-golden-statue-of-trump-holding-bitcoin-unveiled-outside-us-capitol-glbs-2789135-2025-09-18",
      "headline": "12-foot golden statue of Trump holding Bitcoin unveiled outside US CapitolA 12-foot golden statue of President Donald Trump holding a Bitcoin has been installed outside the US Capitol."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disha-patani-house-firing-case-cctv-footage-accused-on-the-run-did-recce-day-before-shooting-bareilly-2789184-2025-09-18",
      "headline": "Shooters conducted many recces of Disha Patani home before firing, CCTV emergesThe September 12 firing at the actor's house in Bareilly was allegedly orchestrated by five shooters affiliated with the Goldy Brar gang. While two shooters were killed on Wednesday in a police encounter, two are on the run. One backed out due to illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/telangana-hyderabad-flood-rain-imd-yellow-alert-one-biker-dead-balkampet-underpass-revanth-reddy-ghmc-traffic-2789187-2025-09-18",
      "headline": "Hyderabad biker dies as rain floods underpass, Revanth Reddy orders flood-relief opsHeavy rains flooded Hyderabad, killing a biker swept away at Balkampet underpass. Flash floods crippled traffic and inundated homes. Chief Minister Revanth Reddy ordered emergency teams and urged residents in low-lying areas to stay indoors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/ranbir-kapoor-alia-bhatt-madhuri-dixit-the-bads-of-bollywood-premiere-2789199-2025-09-18",
      "headline": "Ranbir-Alia, Madhuri Dixit and celebs shine at The Ba***ds of Bollywood premiereMadhuri Dixit, Ranbir Kapoor, Alia Bhatt, and Bollywood's biggest stars lit up The 'Ba***ds of Bollywood' premiere with glamour, style, and star power.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amazon-prime-video-feature-film-the-summer-i-turned-pretty-finale-2789179-2025-09-18",
      "headline": "One last summer: The Summer I Turned Pretty gets its movie finalePrime Video is giving 'The Summer I Turned Pretty' a curtain call – a feature film that will bring the beloved saga to its grand finale, with creator Jenny Han and the original cast stepping back into the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/urban-company-share-price-blockbuster-stock-market-listing-debut-decoding-rally-what-next-2789167-2025-09-18",
      "headline": "Urban Company shares register bumper debut on Dalal Street, but what's next?Urban Company's shares, issued at Rs 103, opened at Rs 162.25 and surged as much as 74% during the day. For those who got shares in the IPO, that meant instant profits and a near $3 billion market value for the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/special-intensive-revision-delhi-election-commission-preparations-for-voter-roll-revision-in-city-2789091-2025-09-18",
      "headline": "SIR in Delhi: Poll panel kicks off preparations for voter roll revision in cityThe Delhi poll body said that anyone whose name does not appear on the 2002 voter list will need to provide identity proof when submitting their enumeration form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/park-chan-wook-discusses-ai-and-no-other-choice-at-busan-film-festival-2789155-2025-09-18",
      "headline": "Exclusive: Director Park Chan-wook discusses AI, No Other Choice at Busan festDirector Park Chan-wook's latest film, 'No Other Choice' opened at the Busan Film Festival. The filmmaker, in an exclusive interaction with India Today at Busan, talked about the influence of AI and the nuances in his film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pay-attention-trumps-air-force-one-has-close-encounter-with-spirit-jet-glbs-2789086-2025-09-17",
      "headline": "Get off iPad: Pilot scolded after plane gets too close to Trump's Air Force OneA Spirit Airlines jet came too close to Air Force One over Long Island, prompting urgent controller warnings as President Trump and Melania travelled to London.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-cji-gavai-pray-lord-vishnu-khajuraho-idol-remark-controversy-impeachment-2788939-2025-09-17",
      "headline": "Go ask deity: Chief Justice Gavai's remark on plea to restore Vishnu idol stirs rowA bench led by Chief Justice of India BR Gavai rejected a plea seeking the restoration of a damaged Lord Vishnu idol in Madhya Pradesh. However, the CJI's remarks to the petitioner were perceived as insensitive by a section of advocates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-names-india-pakistan-china-major-drug-transit-countries-glbs-2789122-2025-09-18",
      "headline": "Trump names India, Pakistan, China among 23 drug producing, transit countriesIn his statement, delivered to Congress through a Presidential Determination, Trump stated that these nations, by producing or facilitating the movement of illegal narcotics and precursor chemicals, were threatening the safety of the US and its citizens."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-liverpool-vs-atletico-madrid-virgil-van-dijk-stoppage-time-winner-bayern-munich-2789182-2025-09-18",
      "headline": "Champions League: Van Dijk's stoppage-time winner for Liverpool spoils Atletico comebackLiverpool snatched a dramatic 3-2 win over Atletico Madrid thanks to Van Dijk's stoppage-time header, keeping Anfield buzzing in their Champions League opener. Bayern and PSG also impressed, with Kane starring for Bayern and the French champions cruising past Atalanta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-2025-javelin-final-neeraj-chopra-vs-arshad-nadeem-live-streaming-time-2789181-2025-09-18",
      "headline": "Neeraj Chopra at World Athletics Championships: When and where to watch finalNeeraj Chopra will be aiming to defend his crown at the World Athletics Championships 2025 as the javelin throw final is set to take place on Thursday, September 18. With a strong field of competitors, including Pakistan's Arshad Nadeem, all eyes will be on Neeraj in Tokyo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-performance-depressed-wasim-akram-india-loss-uae-2789176-2025-09-18",
      "headline": "One-sided India loss left me depressed: Wasim Akram on Pakistan's Asia Cup showWasim Akram admitted Pakistan's one-sided loss to India and their nervy win over UAE left him feeling down. He said technical flaws and underwhelming performances have shaken fans' confidence despite reaching the Super Four."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-world-athletics-championships-javelin-final-maximum-effort-consistency-2789146-2025-09-18",
      "headline": "Neeraj Chopra eyes renewed consistency in World Champs final: Ready to give maximumNeeraj Chopra will aim to rediscover his consistency in the men's javelin final at the World Athletics Championships in Tokyo, looking to end an uneven season on a high with maximum effort and renewed focus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-vs-uae-boycott-drama-pointless-powerplay-2789128-2025-09-18",
      "headline": "Pakistan's Asia Cup own goal: When handshake row turned into pointless powerplayIn Dubai, Pakistan's Asia Cup campaign was nearly undone not by cricket but by theatre. A handshake snub against India spiralled into boycott threats and frantic U-turns, leaving players distracted before a must-win clash. The PCB claimed to defend pride, but none of its demands were met."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-haris-rauf-pakistan-boycott-drama-controversy-uae-clash-2789117-2025-09-18",
      "headline": "Asia Cup 2025: Haris Rauf distances himself from Pakistan's boycott dramaHaris Rauf he stayed focused despite off-field controversies during the Asia Cup. The team now prepares for a crucial Super 4 clash against India amid ongoing tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/veteran-steelers-writer-dale-lolley-dies-at-56-after-battling-cancer-glbs-2789119-2025-09-18",
      "headline": "Veteran Steelers writer Dale Lolley dies at 56 after battling cancerVeteran Steelers writer Dale Lolley, 56, died after battling cancer. A trusted voice for fans, he shaped team coverage, mentored colleagues, and championed youth baseball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-on-india-vs-pakistan-asia-cup-2025-no-handshake-2789115-2025-09-18",
      "headline": "Salman confident of beating India in 2nd Asia Cup clash: Ready for any challengePakistan captain Salman Agha is looking forward to their second clash against India in the Asia Cup 2025. The recent events in the aftermath of the no-handshake controversy have added even more spice to the upcoming fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-beat-uae-seals-super-4-spot-face-india-2789113-2025-09-18",
      "headline": "Asia Cup: Pakistan beat UAE after boycott drama, to face India in Super 4Pakistan secured their place in the Asia Cup Super 4s with a 41-run win over the UAE in Dubai on Wednesday. The victory, which came on a drama-filled evening, set up a high-voltage Super 4 opener against arch-rivals India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-health-comeback-break-navratilova-record-la-2028-olympics-2789097-2025-09-18",
      "headline": "Venus Williams fights health to chase record and Olympic dreamDespite facing health challenges, Venus Williams remains determined to break a long-standing tennis record, highlighting her resilience and her pursuit of Olympic glory at LA 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-on-match-winning-century-vs-australia-mullanpur-2789099-2025-09-18",
      "headline": "Smriti Mandhana delighted with her first match-winning century against AustraliaSmriti Mandhana scored a match-winning 117 to guide India to a 102-run victory over Australia in the second ODI at Dubai. It was her first match-winning century against Australia in ODIs as the last two ended in losing cause."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/veteran-steelers-writer-dale-lolley-dies-at-56-after-battling-cancer-glbs-2789119-2025-09-18",
      "headline": "Veteran Steelers writer Dale Lolley dies at 56 after battling cancerVeteran Steelers writer Dale Lolley, 56, died after battling cancer. A trusted voice for fans, he shaped team coverage, mentored colleagues, and championed youth baseball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-on-india-vs-pakistan-asia-cup-2025-no-handshake-2789115-2025-09-18",
      "headline": "Salman confident of beating India in 2nd Asia Cup clash: Ready for any challengePakistan captain Salman Agha is looking forward to their second clash against India in the Asia Cup 2025. The recent events in the aftermath of the no-handshake controversy have added even more spice to the upcoming fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-beat-uae-seals-super-4-spot-face-india-2789113-2025-09-18",
      "headline": "Asia Cup: Pakistan beat UAE after boycott drama, to face India in Super 4Pakistan secured their place in the Asia Cup Super 4s with a 41-run win over the UAE in Dubai on Wednesday. The victory, which came on a drama-filled evening, set up a high-voltage Super 4 opener against arch-rivals India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-health-comeback-break-navratilova-record-la-2028-olympics-2789097-2025-09-18",
      "headline": "Venus Williams fights health to chase record and Olympic dreamDespite facing health challenges, Venus Williams remains determined to break a long-standing tennis record, highlighting her resilience and her pursuit of Olympic glory at LA 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-on-match-winning-century-vs-australia-mullanpur-2789099-2025-09-18",
      "headline": "Smriti Mandhana delighted with her first match-winning century against AustraliaSmriti Mandhana scored a match-winning 117 to guide India to a 102-run victory over Australia in the second ODI at Dubai. It was her first match-winning century against Australia in ODIs as the last two ended in losing cause."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}