{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/work-life-balance-debate-90-hour-work-week-larsen-and-toubro-chairman-sn-subrahmanyan-indian-inc-reacts-2663307-2025-01-11",
      "headline": "90-hour workweek: What India Inc thinks of L&T chief's suggestionL&T Chairman SN Subrahmanyan recently expressed regret over not being able to make employees work on Sundays, suggesting that a 90-hour workweek is key to success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-budget-2025-high-hopes-industries-real-estate-startups-healthcare-sector-economic-slowdown-2663281-2025-01-11",
      "headline": "Union Budget 2025: High hopes as dark clouds loom over economyAmid fears of an economic slowdown, here's what key sectors are demanding from Finance Minister Nirmala Sitharaman in Union Budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-stock-market-recover-next-week-sensex-nifty-under-pressure-fii-selling-it-shares-trade-strategy-explained-2663291-2025-01-11",
      "headline": "Will the stock market recover next week? 4 things you should knowGlobal headwinds and FII outflows weigh on the Sensex and Nifty. Will Dalal Street see a recovery next week after the turbulent run? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-files-counter-lawsuit-against-cognizant-over-anti-competitive-practices-2663283-2025-01-11",
      "headline": "Explained: Why Infosys has filed counter lawsuit against CognizantInfosys vs Cognizant legal battle: The Bengaluru-based firm accused its US-based rival of contractually restricting clients from awarding IT services to competitors and withholding software training, which Infosys claims hindered its ability to compete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-return-fd-offers-in-2025-sbi-idbi-indian-bank-punjab-and-sind-bank-2662959-2025-01-10",
      "headline": "High-return FD offers in 2025: SBI, IDBI, Indian Bank, and moreEnhance your savings in 2025 with FD schemes offering up to 8.05% interest, valid until March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gives-big-relief-for-online-gaming-sector-details-here-2662919-2025-01-10",
      "headline": "Supreme Court gives big relief for online gaming sector. Details hereThe Supreme Court has stayed Rs 1.12 lakh crore GST notices against online gaming firms, with a final hearing scheduled for March 18, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/industry-leaders-lt-chairman-sn-subrahmanyan-infosys-narayana-murthy-90-hour-workweek-more-pay-labour-laws-2662833-2025-01-10",
      "headline": "Industry leaders call for up to 90-hour workweek. Are they willing to pay more? L&T Chairman SN Subrahmanyan made waves by suggesting employees should work on Sundays. Last year, Infosys co-founder Narayana Murthy proposed that millennials work 70-hour weeks to improve India's productivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-do-not-expect-these-tax-changes-no-rise-in-standard-deduction-no-major-change-in-old-tax-regime-2662877-2025-01-10",
      "headline": "Budget 2025: Don't expect these tax changesBudget 2025 is likely to prioritise fiscal discipline, minor tax tweaks, and cautious consumption boosts over bold reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-all-time-low-of-nearly-86-against-us-dollar-key-reasons-explained-2662866-2025-01-10",
      "headline": "Rupee hits all-time low, nears 86 mark against US dollarRupee hits all-time: Closing at 85.9650, the rupee marked its tenth consecutive weekly loss, slipping 0.2% this week amid a strong dollar and persistent capital outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-lower-amid-earnings-concerns-tcs-gains-6-percent-it-stocks-rise-2662858-2025-01-10",
      "headline": "Sensex, Nifty close lower amid earnings concerns; TCS gains 6% The S&P BSE Sensex lost 241.30 points to end at 77,378.91, while the NSE Nifty50 was down 95 points to end at 23,431.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-irctc-share-price-jumped-up-to-5-today-2662834-2025-01-10",
      "headline": "Explained: Why IRCTC share price jumped up to 5% todayIRCTC share price: The stock rose nearly 5% to hit a day's high of Rs 800.65 on the Bombay Stock Exchange (BSE), compared to the previous close of Rs 763.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-launches-bistro-app-for-10-minute-food-delivery-2662816-2025-01-10",
      "headline": "Blinkit launches Bistro app for 10-minute food deliveryBlinkit's Bistro delivers canteen-style food in 10 minutes, rivalling Swiggy's Snacc and Zepto Cafe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-sees-strong-institutional-growth-mutual-fund-stake-surges-by-33-total-holdings-up-4-2662792-2025-01-10",
      "headline": "Paytm sees strong institutional growth: Mutual fund stake surges by 3.3%, total holdings up 4%Paytm's progress toward achieving EBITDA before ESOP breakeven by Q4 FY2025 further reinforces its strong fundamentals and appeal to institutional investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-looking-back-at-tax-relief-measures-for-senior-citizens-in-2024-2662787-2025-01-10",
      "headline": "Budget 2025: Looking back at tax relief measures for senior citizens in 2024Senior citizens seek tax relief and reforms in Budget 2025 to tackle inflation, income challenges and enhance their qulity of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-filing-delayed-as-portal-glitches-persist-deadline-extension-expected-stmp-2662757-2025-01-10",
      "headline": "GST return filing delayed. Deadline extension expectedGST return filing faces delays due to GSTN portal glitches, with a potential deadline extension expected to ease compliance challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-chairman-sn-subrahmanyan-salary-rs-51-crore-fy24-53457-times-median-salary-of-peers-2662743-2025-01-10",
      "headline": "L&T chairman earned 534.57 times median salary of peers in FY24. Check detailsLarsen & Toubro (L&T) Chairman SN Subrahmanyan's remarks on the 90-hour workweek have been a topic of debate. Amid all this, his salary for FY24 has attracted eyeballs, which is 534.57 times the median salary of peers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-link-and-use-your-credit-card-for-upi-transactions-a-simple-guide-2662736-2025-01-10",
      "headline": "How to link and use your credit card for UPI transactions. A simple guideUPI integration with credit cards simplifies payments offering instant, secure, and contactless transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rebound-what-should-stock-market-investors-do-in-volatile-setup-trading-strategy-experts-2662718-2025-01-10",
      "headline": "Sensex, Nifty in volatile territory: What should stock market investors do? Stock market today: Sensex and Nifty rebounded on IT gains, but volatility persists amid FII outflows and global uncertainty. Here's what's driving the market and how investors should tackle it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-is-joint-taxation-for-married-couples-how-this-works-everything-explained-stmp-2662702-2025-01-10",
      "headline": "Budget 2025: What is joint taxation for married couples?The ICAI's Budget 2025 proposal for joint taxation of married couples aims to ease financial stress, boost compliance, and modernise India's tax system with higher exemptions and flexible slabs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-elxsi-share-price-falls-8-percent-why-did-it-hit-52-week-low-after-q3-results-stmp-2662686-2025-01-10",
      "headline": "Tata Elxsi share price down 8%. Why did it hit 52-week low after Q3 results?Tata Elxsi stock price: At 10:40 a.m., Tata Elxsi's share price was down 7% at Rs 5992.95. In early trade, the stock hit a 52-week low of Rs 5,924."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-arvind-kejriwal-says-bjp-will-demolish-slums-if-its-wins-polls-2663550-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP will raze Delhi slums if it wins polls: Arvind Kejriwal counters Amit ShahAfter visiting slums in Delhi's Shakur Basti, AAP chief Arvind Kejriwal said the BJP does not love slum dwellers and considers them \"insects\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/ajit-pawar-ncp-to-go-solo-in-delhi-likely-to-field-candidates-sources-2663607-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ajit Pawar's NCP to go solo in Delhi, likely to field 25-30 candidates: SourcesThe Nationalist Congress Party (NCP) faction led by Ajit Pawar has announced its plans to contest the upcoming Delhi Assembly elections independently, marking its debut in the national capital's electoral politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-cities-safest-for-women-mk-stalin-dmk-pongal-letter-amid-anna-university-sexual-assault-case-2663600-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil Nadu cities safest for women: MK Stalin amid Anna University case falloutIn a letter to DMK cadres on the occasion of Pongal, MK Stalin wrote that cities in Tamil Nadu are the safest for women in the country due to his government's pro-women policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/if-yuvraj-had-died-from-cancer-during-world-cup-i-wouldve-been-proud-says-his-father-yograj-singh-2663616-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If Yuvraj had died from cancer during World Cup, I would've been proud: Yograj SinghLegendary India cricketer Yuvraj Singh's father Yograj Singh recently said that he would've been proud of his son had he died from cancer during India's 2011 World Cup campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/adar-poonawalla-jabs-at-90-hour-workweek-my-wife-loves-staring-at-me-on-sundays-2663582-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "My wife loves staring at me on Sundays: Adar Poonawalla's dig at 90-hour workweekSerum Institute of India CEO Adar Poonawalla took a jibe at the ongoing 90-hour workweek. In a post on X, he tagged industrialist Anand Mahindra and said \"My wife loves staring at me on Sundays.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-atishi-launches-crowdfunding-campaign-for-kalkaji-poll-expenses-2663589-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi launches crowdfunding for Delhi polls: AAP does not have corruption moneyWhile launching the crowdfunding campaign, Atishi said that she hoped people would support her party's \"politics of work\" and donate generously to meet her target of Rs 40 lakh for election expenses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ukrainian-nationals-among-masterminds-of-mumbai-torres-jewellery-investment-scam-ponzi-scheme-2663581-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 Ukrainian nationals among masterminds of Rs 22 crore ponzi scheme in MumbaiThe complainant, Pradeep Kumar Mamraj Vaishya, a vegetable vendor residing in Nariman Point, reported the alleged fraud, which occurred between June 21 and December 30, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-ms-dhoni-captain-yuvraj-singh-retirement-2663603-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yograj Singh takes massive U-turn, praises MS Dhoni for brave captaincyYears after blaming MS Dhoni for his son's early retirement, Yograj Singh has taken a massive U-turn and praised the former India captain. Speaking in an interview with YouTuber Samdish Bhatia, Yograj said that MS Dhoni is a fearless man."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/daaku-maharaaj-movie-review-nandamuri-balakrishna-template-vigilante-thriller-bobby-kolli-bobby-deol-2663569-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Daaku Maharaaj review: Balakrishna shines in template vigilante thrillerReleased-Sun Jan 12, 2025Daaku Maharaaj movie review: Director Bobby Kolli's Daaku Maharaaj, starring Nandamuri Balakrishna, Bobby Deol and Shraddha Srinath, is a predictable vigilante thriller. Though clichéd, the film strikes the right notes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-polls-poster-war-heats-up-between-aap-bjp-assembly-polls-gaalibaaz-aapda-2663540-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Gaalibaaz' vs 'AAP-da': Poster war heats up in Delhi ahead of Assembly pollsWith the Delhi Assembly polls fast approaching, the poster war highlights the high-stakes battle between the BJP and AAP. Both parties are leaving no stone unturned in their efforts to win the trust of Delhi voters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-meeting-champions-trophy-rohit-sharma-virat-kohli-future-indian-team-2663574-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy set to decide Rohit, Virat's futures in Indian team: SourcesChampions Trophy: Senior India players Virat Kohli and Rohit Sharma's futures hang in the balance ahead of the Champions Trophy. Rohit and Kohli, both in the wrong side of 30s were underperformers in the Border-Gavaskar Trophy 2024/25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/external-affairs-minister-s-jaishankar-attend-us-president-elect-donald-trumps-swearing-in-on-january-20-2663521-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar to attend Donald Trump's oath taking ceremony on January 20The invitation for Jaishankar's attendance was extended by the Trump-Vance Inaugural Committee. This visit is expected to further cement the diplomatic ties between the two nations as the incoming US administration begins its tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/stare-at-wife-memes-jokes-flood-x-as-sunday-arrives-lt-ceo-sn-subrahmanyan-viral-remarks-2663611-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunday is here and so are the 'stare at wife' memes. Of course, you know whyAs Sunday arrived, social media users flooded X with 'stare at wife' memes and jokes. Of course, you know why. Best ones here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/hic-hic-hurray-the-best-bars-of-2024-2663308-2025-01-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hic hic hurray! The best bars of 2024In the dynamic world of mixology, where every drink tells a story and every pour is a masterpiece, these eight bars have set the standard higher\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nitin-gadkari-kangana-ranaut-emergency-anupam-kher-special-screening-2663559-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kangana Ranaut, Anupam Kher host Emergency screening for Nitin GadkariA special screening of Kangana Ranaut's Emergency was organised for Union Minister Nitin Gadkari. Praising the film on social media, the minister also encouraged everyone to watch it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-devajit-saikia-former-assam-cricketer-replaces-jay-shah-as-bcci-secretary-2663572-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Devajit Saikia? Ex-Assam cricketer replaces Jay Shah as BCCI secretaryFrom the cricket field to the corridors of power, Assam's Devajit Saikia brings a unique blend of experience as he takes over as BCCI secretary, succeeding Jay Shah, who now leads the ICC as its chairman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/pickleball-courts-mushrooming-delhi-mumbai-investment-corporates-tennis-players-good-business-idea-2662602-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pickleball serves new business idea, merges passion with profitsThe pickleball rage in India has taken a new turn. The US-born game, which entered the sports scene in India just four years ago, has opened up a new investment option, promising big returns. Players are now putting in money as passion is meeting profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-business-sports-442-10-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-wildfire-joe-biden-fire-away-pun-gaffe-viral-video-kamala-harris-reaction-social-media-backlash-2663548-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Fire away': Biden's pun at wildfire briefing, Kamala Harris's double takeDuring the briefing, Biden turned to Harris and said, \"Madam Vice President, I know you're directly affected, so you fire away,\" prompting her to look at him with a startled expression. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/paatal-lok-indias-got-latent-jaideep-ahlawat-samay-raina-hilarious-banter-farida-jalal-rinku-singh-2663583-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Paatal Lok x India's Got Latent: Jaideep Ahlawat, Samay Raina's hilarious crossoverJaideep Ahlawat and Samay Raina's hilarious banter in a new video surprised fans. Prime Video released a video featuring Farida Jalal, Samay Raina, and cricketer Rinku Singh expressing their worries for Hathi Ram Chaudhary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-viswanathan-anand-d-gukesh-dance-during-pongal-breakfast-2663586-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Viswanathan Anand, D Gukesh dance during Pongal breakfastFive-time World Chess Champion Viswanathan Anand hosted a vibrant Pongal celebration with Indian chess prodigies, blending tradition with camaraderie. D Gukesh, R Praggnanandhaa, and others joined him for breakfast, traditional attire, and even dancing, marking a festive start to Thai month."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/rajasthan-man-finds-blade-in-samosa-jain-namkeen-bhandaar-tonk-viral-video-2663567-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Rajasthan man finds blade in samosa purchased from popular snack shop in TonkA man found a piece of a shaving blade inside a samosa he purchased from a well-known snack shop in Tonk, Rajasthan. A video of the blade-laden samosa went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-gautam-gambhir-rohit-sharma-meeting-dinesh-karthik-2663544-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Gautam Gambhir happy with his players? Ex-player as transitions loomsFormer India cricketer Dinesh Karthik has questioned if Gautam Gambhir is happy with the current set of players in the Test team. Karthik feels that Gambhir needs to figure out the best way to move forward after the series losses against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-thamizhaga-vazhvurimai-katchi-vijay-accuses-dmk-of-deceiving-voters-over-neet-ban-2663561-2025-01-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Vijay accuses DMK of deceiving voters over NEET ban U-turnThe NEET ban issue remains a contentious topic in Tamil Nadu, with political parties and leaders continuing to spar over the promises made and the steps taken to address it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/story/roopal-tyagi-blessed-escape-devastating-los-angeles-wildfires-2663617-2025-01-12",
      "headline": "TV actor Roopal Tyagi feels 'blessed' to escape devastating Los Angeles wildfiresActor Roopal Tyagi recalled her trip to Los Angeles and revealed how she managed to escape unharmed amid the fire ravage. The actor even shared videos of smoke billowing into the sky as she flew from Los Angeles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/madha-gaja-raja-movie-review-vishal-sundar-c-film-takes-you-on-a-nostalgic-ride-2663605-2025-01-12",
      "headline": "Madha Gaja Raja review: Vishal, Sundar C's film takes you on a nostalgic rideReleased-Sun Jan 12, 2025Madha Gaja Raja movie review: Director Sundar C's Madha Gaja Raja aka MGR, starring Vishal, Sonu Sood and Santhanam, is a comedy caper reminding you of the good old days. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-updates-after-leg-injury-apologises-to-directors-for-film-delays-2663591-2025-01-12",
      "headline": "Rashmika Mandanna shares update after leg injury, apologises to directorsRashmika Mandanna has sustained a leg injury, leading to delays in her film projects. Sharing pictures and health update on social media, she expressed her apologies to her directors for the inconvenience caused."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-raveena-tandon-rasha-thadani-aaman-devgn-azaad-promotion-salman-khan-shilpa-shirodkar-rajat-dalal-2663592-2025-01-12",
      "headline": "Bigg Boss 18: Shilpa Shirodkar slams Rajat Dalal for rude behaviourIn the latest episode of Bigg Boss 18, Shilpa Shirodkar called out Rajat Dalal's ill-mannered way of speaking. This came after the contestants were assigned a task. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-completes-1000-odi-runs-enroute-her-maiden-hundred-vs-ireland-2663608-2025-01-12",
      "headline": "Jemimah Rodrigues hits maiden international hundred, completes 1000 ODI runs Jemimah Rodrigues' maiden ODI century and 1000 runs milestone led India to a record-breaking total of 358/4. With a stellar partnership alongside Deol, Rodrigues anchored India's innings, capping off an explosive finish that left Ireland with a daunting target."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-highest-odi-total-ireland-women-jemimah-rodrigues-smriti-mandhana-rajkot-2663606-2025-01-12",
      "headline": "Powered by Jemimah's hundred, India post their highest-ever total in ODIsIndia Women, led by Smriti Mandhana, posted a record-breaking 370/5 in the second ODI against Ireland, powered by Jemimah Rodrigues' maiden century and dominant top-order batting, surpassing their previous best total set in 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-ms-dhoni-captain-yuvraj-singh-retirement-2663603-2025-01-12",
      "headline": "Yograj Singh takes massive U-turn, praises MS Dhoni for brave captaincyYears after blaming MS Dhoni for his son's early retirement, Yograj Singh has taken a massive U-turn and praised the former India captain. Speaking in an interview with YouTuber Samdish Bhatia, Yograj said that MS Dhoni is a fearless man."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-deepti-sharma-enters-the-elite-100-odi-club-in-womens-cricket-stmp-2663598-2025-01-12",
      "headline": "IND-W vs IRE-W: Deepti Sharma enters the elite '100 ODI club' in women's cricketDeepti Sharma became only the second Indian woman cricketer to play 100 ODIs and 100 T20Is. The all-rounder, known for her consistency and versatility, achieved this milestone during India's ODI series against Ireland in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-women-tharsh-england-women-odi-series-opener-ashleigh-gardner-all-round-show-2663594-2025-01-12",
      "headline": "Gardner all-round show helps Australia thrash England in ODI series openerAshleigh Gardner's all-round brilliance and Alyssa Healy's composed knock guided Australia to a commanding four-wicket win over England in the Women's Ashes opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-viswanathan-anand-d-gukesh-dance-during-pongal-breakfast-2663586-2025-01-12",
      "headline": "Watch: Viswanathan Anand, D Gukesh dance during Pongal breakfastFive-time World Chess Champion Viswanathan Anand hosted a vibrant Pongal celebration with Indian chess prodigies, blending tradition with camaraderie. D Gukesh, R Praggnanandhaa, and others joined him for breakfast, traditional attire, and even dancing, marking a festive start to Thai month."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-meeting-champions-trophy-rohit-sharma-virat-kohli-future-indian-team-2663574-2025-01-12",
      "headline": "Champions Trophy set to decide Rohit, Virat's futures in Indian team: SourcesChampions Trophy: Senior India players Virat Kohli and Rohit Sharma's futures hang in the balance ahead of the Champions Trophy. Rohit and Kohli, both in the wrong side of 30s were underperformers in the Border-Gavaskar Trophy 2024/25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-devajit-saikia-former-assam-cricketer-replaces-jay-shah-as-bcci-secretary-2663572-2025-01-12",
      "headline": "Who is Devajit Saikia? Ex-Assam cricketer replaces Jay Shah as BCCI secretaryFrom the cricket field to the corridors of power, Assam's Devajit Saikia brings a unique blend of experience as he takes over as BCCI secretary, succeeding Jay Shah, who now leads the ICC as its chairman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-ac-milan-transfer-zlatan-ibrahimovic-not-an-easy-deal-manchester-united-2663570-2025-01-12",
      "headline": "Ibrahimovic on Marcus Rashford transfer to AC Milan: Not an easy dealZlatan Ibrahimovic acknowledges AC Milan's ambitious pursuit of Manchester United star Marcus Rashford but admits the transfer poses challenges. Despite competition from Europe's elite, Milan remains determined to bring the English forward to bolster their attacking lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/perth-scorchers-pacer-jhye-richardson-opts-out-of-bbl-due-to-shoulder-surgery-2663566-2025-01-12",
      "headline": "Perth Scorcher's pacer Jhye Richardson opts out of BBL due to shoulder surgeryJhye Richardson has opted for shoulder surgery, ending his BBL season with Perth Scorchers. The 28-year-old pacer aims to regain full fitness for the 2025-26 Ashes, prioritizing long-term stability after years of recurring shoulder injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-bangladesh-squad-announcement-no-shakib-al-hasan-2663557-2025-01-12",
      "headline": "No Shakib Al Hasan as Bangladesh announce 15-member Champions Trophy squadBangladesh's ICC Champions Trophy squad shocks fans by excluding veteran all-rounder Shakib Al Hasan and experienced batter Litton Das. Captain Najmul Hossain Shanto now leads a mix of seasoned players and rising stars for the high-stakes tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-meeting-champions-trophy-rohit-sharma-virat-kohli-future-indian-team-2663574-2025-01-12",
      "headline": "Champions Trophy set to decide Rohit, Virat's futures in Indian team: SourcesChampions Trophy: Senior India players Virat Kohli and Rohit Sharma's futures hang in the balance ahead of the Champions Trophy. Rohit and Kohli, both in the wrong side of 30s were underperformers in the Border-Gavaskar Trophy 2024/25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-devajit-saikia-former-assam-cricketer-replaces-jay-shah-as-bcci-secretary-2663572-2025-01-12",
      "headline": "Who is Devajit Saikia? Ex-Assam cricketer replaces Jay Shah as BCCI secretaryFrom the cricket field to the corridors of power, Assam's Devajit Saikia brings a unique blend of experience as he takes over as BCCI secretary, succeeding Jay Shah, who now leads the ICC as its chairman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-ac-milan-transfer-zlatan-ibrahimovic-not-an-easy-deal-manchester-united-2663570-2025-01-12",
      "headline": "Ibrahimovic on Marcus Rashford transfer to AC Milan: Not an easy dealZlatan Ibrahimovic acknowledges AC Milan's ambitious pursuit of Manchester United star Marcus Rashford but admits the transfer poses challenges. Despite competition from Europe's elite, Milan remains determined to bring the English forward to bolster their attacking lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/perth-scorchers-pacer-jhye-richardson-opts-out-of-bbl-due-to-shoulder-surgery-2663566-2025-01-12",
      "headline": "Perth Scorcher's pacer Jhye Richardson opts out of BBL due to shoulder surgeryJhye Richardson has opted for shoulder surgery, ending his BBL season with Perth Scorchers. The 28-year-old pacer aims to regain full fitness for the 2025-26 Ashes, prioritizing long-term stability after years of recurring shoulder injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-bangladesh-squad-announcement-no-shakib-al-hasan-2663557-2025-01-12",
      "headline": "No Shakib Al Hasan as Bangladesh announce 15-member Champions Trophy squadBangladesh's ICC Champions Trophy squad shocks fans by excluding veteran all-rounder Shakib Al Hasan and experienced batter Litton Das. Captain Najmul Hossain Shanto now leads a mix of seasoned players and rising stars for the high-stakes tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devajit-saikia-elected-new-bcci-secretary-replaces-jay-shah-2663556-2025-01-12",
      "headline": "Devajit Saikia elected new BCCI secretary, replaces Jay ShahFormer Assam wicketkeeper Devajit Saikia has been elected as the new BCCI secretary. Saikia replaces Jay Shah, who had vacated the position after his appointment as the head of the International Cricket Council."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pcb-racing-against-time-to-complete-construction-before-champions-trophy-2663555-2025-01-12",
      "headline": "Watch: PCB racing against time to complete construction before Champions TrophyPakistan are set to host the Champions Trophy 2025. With just a little over one month left for the tournament, Pakistan look unprepared with the stadiums looking far away from completion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irelands-aimee-maguire-reported-for-suspect-bowling-action-vs-india-in-wodis-2663552-2025-01-12",
      "headline": "Ireland's Aimee Maguire reported for suspect bowling action vs India in WODIsIreland's Aimee Maguire, 18, has been reported for suspect bowling action after taking 3 wickets in the first WODI against India. The young spinner will undergo ICC testing but can continue bowling until the results are confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-india-squad-announcement-live-updates-rohit-bumrah-shami-pant-2663546-2025-01-12",
      "headline": "India Squad Announcement Live Updates: Bumrah's participation under doubtChampions Trophy 2025 India Squad Announcement Live Updates: The wait for India's Champions Trophy 2025 squad continues after the BCCI selectors announced the T20I squad vs England. Meanwhile, star India pacer Jasprit Bumrah's participation in the Champions Trophy is under clouds.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-gautam-gambhir-rohit-sharma-meeting-dinesh-karthik-2663544-2025-01-12",
      "headline": "Is Gautam Gambhir happy with his players? Ex-player as transitions loomsFormer India cricketer Dinesh Karthik has questioned if Gautam Gambhir is happy with the current set of players in the Test team. Karthik feels that Gambhir needs to figure out the best way to move forward after the series losses against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kyle-walker-ac-milan-hold-discussions-transfer-news-manchester-city-january-window-2663536-2025-01-12",
      "headline": "AC Milan set to hold discussion with Kyle Walker after player's transfer requestAC Milan have reportedly opened talks for Manchester City full-back Kyle Walker, who seeks a new challenge abroad after a decorated career in England. The 34-year-old's potential move signals a significant shift for both clubs in the transfer market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-date-south-africa-vs-australia-jonty-rhodes-comments-2663535-2025-01-12",
      "headline": "South Africa hold no advantage over Australia in WTC Final: Jonty RhodesSouth Africa will not hold any advantage over Australia in the World Test Championship Final despite their strong bowling attack, feels Jonty Rhodes. The former SA player believes that Australians are well adept at playing pace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-gautam-gambhir-rohit-sharma-meeting-dinesh-karthik-2663544-2025-01-12",
      "headline": "Is Gautam Gambhir happy with his players? Ex-player as transitions loomsFormer India cricketer Dinesh Karthik has questioned if Gautam Gambhir is happy with the current set of players in the Test team. Karthik feels that Gambhir needs to figure out the best way to move forward after the series losses against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kyle-walker-ac-milan-hold-discussions-transfer-news-manchester-city-january-window-2663536-2025-01-12",
      "headline": "AC Milan set to hold discussion with Kyle Walker after player's transfer requestAC Milan have reportedly opened talks for Manchester City full-back Kyle Walker, who seeks a new challenge abroad after a decorated career in England. The 34-year-old's potential move signals a significant shift for both clubs in the transfer market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-date-south-africa-vs-australia-jonty-rhodes-comments-2663535-2025-01-12",
      "headline": "South Africa hold no advantage over Australia in WTC Final: Jonty RhodesSouth Africa will not hold any advantage over Australia in the World Test Championship Final despite their strong bowling attack, feels Jonty Rhodes. The former SA player believes that Australians are well adept at playing pace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-t20is-yashasvi-jaiswal-exclusion-perplexing-aakash-chopra-2663524-2025-01-12",
      "headline": "Yashasvi Jaiswal's exclusion from England T20Is little perplexing: Aakash ChopraAakash Chopra finds Yashasvi Jaiswal's exclusion from the India squad for the England T20Is 'little perplexing.' Jaiswal was one of the major absentees from the squad as BCCI announced the side to take on England in the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/pickleball-courts-mushrooming-delhi-mumbai-investment-corporates-tennis-players-good-business-idea-2662602-2025-01-12",
      "headline": "Pickleball serves new business idea, merges passion with profitsThe pickleball rage in India has taken a new turn. The US-born game, which entered the sports scene in India just four years ago, has opened up a new investment option, promising big returns. Players are now putting in money as passion is meeting profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-matches-paarl-hand-royal-thrashing-to-sunrisers-joburg-beat-cape-town-via-dls-2663516-2025-01-12",
      "headline": "Paarl hand 'Royal' thrashing to SunRisers, JoBurg beat Cape Town via DLS2-time champions SunRisers Eastern Cape fell to their second straight defeat in the SA20 on Saturday, January 11. Paarl Royals openers put up a superb show to win the game by 9 wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kyle-walker-asked-to-leave-manchester-city-pep-guardiola-confirms-transfer-news-january-2663514-2025-01-12",
      "headline": "Kyle Walker has asked to leave Manchester City: Pep GuardiolaKyle Walker's decision to leave Manchester City for a new chapter abroad marks a pivotal shift for the club as Pep Guardiola confirms the veteran defender's immediate departure amidst a challenging season for the reigning champions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}