{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-on-june-12-nse-bse-trading-wipro-hdfc-bank-ireda-nazara-tech-ntpc-2739463-2025-06-12",
      "headline": "Stocks to watch on June 12: Wipro, HDFC Bank, IREDA, Nazara Tech, NTPCThe Sensex and Nifty closed higher after a rangebound session on Wednesday. While gains in IT stocks supported the indices, profit booking and the absence of strong triggers limited the overall rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-real-estate-middle-class-indian-investors-rental-yields-residency-benefits-2739165-2025-06-11",
      "headline": "Dubai's billionaire realty map: Can India's salaried class invest there?For years, Dubai's skyline has glittered like a dream, much like that tempting NRI cousin who always seemed a step ahead in life. But things are changing as salaried Indians are looking to venture into Dubai's posh real estate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-123-points-higher-nifty-above-25100-hcltech-gains-3-percent-2739147-2025-06-11",
      "headline": "Sensex closes 123 points higher, Nifty above 25,100; HCLTech gains 3%The S&P BSE Sensex added 123.42 points to end at 82,515.14, while the NSE Nifty gained 37.15 points to close at 25,141.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bharat-rising-why-tier-2-cities-drive-job-growth-explains-hireveda-co-founder-saurabh-agarwal-2739099-2025-06-11",
      "headline": "Bharat rising: Why Tier-2 cities drive job growth, explains HireVeda co-founderWhile the metros still lead in the number of jobs, the speed of growth in smaller cities is hard to ignore, noted co-founder of HireVeda and ExecEdge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ultra-rich-india-hnwi-us-china-japan-usd-10-million-report-knight-frank-2739078-2025-06-11",
      "headline": "India now home to over 85,000 millionaires, ranks 4th globally: ReportIndia now trails only the United States, China, and Japan in terms of the number of wealthy individuals, accounting for 3.7% of the global HNWI population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-form-16-step-by-step-guide-to-download-and-use-it-for-easy-itr-filing-income-tax-return-2739064-2025-06-11",
      "headline": "Digital Form 16: Step-by-step guide to download and use it for easy ITR filingWith the advent of digital platforms, accessing and using Form 16 has become more straightforward, making it a vital document for accurate and hassle-free income tax return (ITR) filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/chasing-rs-10-discounts-ca-explains-why-tracking-every-rupee-is-not-making-you-rich-2739016-2025-06-11",
      "headline": "Chasing Rs 10 discounts? CA explains why tracking every rupee isn't making you richIt's a common belief that managing every rupee wisely equals financial discipline. People cut back on little indulgences and chase discounts, feeling financially in control, yet, their money may be slipping away in unnoticed ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharat-forge-chairman-baba-kalyani-defence-artillery-guns-india-procurement-2738946-2025-06-11",
      "headline": "'Make in India' gave us breakthrough in defence, says Bharat Forge's Baba Kalyani\"A lot of army guys walked by, some laughed at it,\" Chairman Baba Kalyani said during an episode of the New India Junction podcast  \"Not a single guy stopped to even see what the hell it was.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paramount-to-cut-35-percent-of-us-jobs-as-cable-tv-declines-says-report-2738976-2025-06-11",
      "headline": "Paramount to cut 3.5% of US jobs as cable TV declines: ReportThis is not the first round of job losses at Paramount. Back in August last year, the company had already cut 15% of its workforce, indicating ongoing adjustments in response to market changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/law-tribunal-nclt-clears-merger-inox-wind-energy-limited-with-inox-wind-new-shares-investors-2738958-2025-06-11",
      "headline": "Law tribunal clears merger of Inox Wind Energy Limited with Inox WindThe merger is expected to reduce liabilities by around Rs 2,050 crore. The company also expects to save costs by improving how resources are used and by simplifying various processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-86-points-higher-nifty-above-25100-ril-gains-1-percent-maruti-suzuki-falls-2738927-2025-06-11",
      "headline": "Sensex opens 86 points higher, Nifty above 25,100; RIL gains 1%The S&P BSE Sensex gained 104.24 points to 82,495.96, while the NSE Nifty50 added 36.70 points to 25,140.95 as of 9:31 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-opens-june-13-rs-1387-crore-target-solar-pump-growth-2738921-2025-06-11",
      "headline": "Oswal Pumps IPO to open soon with Rs 1,387 crore target. Check detailsOswal Pumps is launching an IPO aiming to raise Rs 1,387.34 crore. Here are essential details potential investors need to consider before subscribing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-eyeing-interim-trade-deal-by-june-end-inside-the-closed-door-talks-tariffs-2738918-2025-06-11",
      "headline": "Tariff cuts, easing digital barriers: India, US make headway in trade talksBoth nations are aiming for an interim trade pact by the end of June, before the pause on Trump's proposed tariffs expires. India is advocating for full exemption from a 26% reciprocal tariff on domestic goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-sensex-nifty-today-trading-setup-june-11-us-trade-talk-nse-bse-2738914-2025-06-11",
      "headline": "Stock market opening: Will Sensex, Nifty open higher today? Check key levelsSensex and Nifty closed flat on Tuesday, ending a four-day winning streak. The flat close was largely due to profit booking, especially in financial stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-11-nse-bse-trading-market-wipro-reliance-infra-indigo-maruti-suzuki-iifl-finance-2738901-2025-06-11",
      "headline": "Stocks to watch on June 11: Wipro, Reliance Infra, IndiGo, Maruti SuzukiExperts suggest that the positive sentiment is likely to persist on Dalal Street with the key support level of Nifty at 24,850. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-slashes-global-growth-forecast-cites-higher-tariffs-uncertainty-2738753-2025-06-10",
      "headline": "World Bank slashes global growth forecast, cites higher tariffs and uncertaintyIn its twice-yearly Global Economic Prospects report, the bank lowered its forecasts for nearly 70 per cent of all economies as well as six emerging market regions, from the levels it projected just six months ago before US President Donald Trump took office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/applying-for-a-personal-loan-how-many-years-of-itrs-do-you-need-2738641-2025-06-10",
      "headline": "Applying for a personal loan? How many years of ITRs do you needBanks need to be sure you can pay back the money you borrow. For salaried individuals, a regular pay cheque and Form 16 usually provide enough assurance. However, for self-employed individuals, ITRs over several years give a more consistent and reliable picture of earnings and financial health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/raymond-realty-likely-to-list-in-early-july-says-chairman-gautam-singhania-2738575-2025-06-10",
      "headline": "Raymond Realty likely to list in early July, says chairman Gautam SinghaniaEach shareholder will receive one share of Raymond Realty for every share held in Raymond, the group said previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-ends-50-points-lower-nifty-settles-above-25100-tech-mahindra-gains-2-market-flat-2738549-2025-06-10",
      "headline": "Sensex, Nifty end flat as profit booking halts rally; IT gains capped by banksThe S&P BSE Sensex was down by 53.49 points to end at 82,391.72, while the NSE Nifty50 ended flat with a gain of 1 point to 25,104.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-may-equity-mutual-fund-data-investors-choose-sip-stocks-expert-view-market-trading-2738535-2025-06-10",
      "headline": "Mutual fund inflows fall: Should beginners still trust SIPs or go for stocks?Data from the Association of Mutual Funds in India (AMFI) shows that net inflows into equity schemes dropped 22% month-on-month to Rs 19,013 crore in May, marking the fifth straight month of decline and the weakest level since April 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-emerges-as-apple-new-bet-but-china-and-trump-raise-red-flags-report-2738521-2025-06-10",
      "headline": "India emerges as Apple's new bet, but China and Trump raise red flags: ReportLast week, Foxconn announced a fresh $1.5 billion investment in its Indian operations, offering some reassurance to officials in New Delhi. This move may ease tensions in New Delhi that began when Donald Trump publicly stated he told Tim Cook not to expand Apple's manufacturing in India, casting doubt on hopes that most iPhones for the US would be made in India by 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-under-old-tax-regime-new-itr-rules-you-should-know-in-2025-2738486-2025-06-10",
      "headline": "Filing under old tax regime? New ITR rules you should know in 2025Key changes in the Income Tax Return (ITR) filing process for those opting for the old tax regime in the Assessment Year 2025–26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-currency-rupee-under-pressure-asia-currencies-ahead-weak-dollar-2738483-2025-06-10",
      "headline": "Rupee stuck in neutral as Asia's currencies race ahead on weak dollarWhile the Singapore dollar, Korean won, and Taiwanese dollar have jumped between 6% and 9.5% so far this year, the rupee has barely moved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sips-continue-strong-run-touch-rs-26688-crore-in-may-latest-amfi-data-2738454-2025-06-10",
      "headline": "Mutual fund SIPs continue strong run, touch Rs 26,688 crore in May: AMFIMutual fund SIPs reached a fresh high of Rs 26,688 crore in May, inching up from Rs 26,632 crore the previous month, as per AMFI data released on June 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rcb-new-owner-stake-sale-diageo-ipl-cricket-team-virat-kohli-rajat-patidar-report-2738430-2025-06-10",
      "headline": "RCB to get new owner? Diageo looking for stake sale, says reportDiageo Plc, the British company that owns RCB through its Indian arm United Spirits Ltd., is exploring options to sell a part or all of its stake in the franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-pay-zero-tax-by-setting-up-in-dubai-coinswitch-co-founder-ashish-singhal-calls-it-a-trap-2738408-2025-06-10",
      "headline": "Planning to pay 0 tax by setting up in Dubai? Coinswitch co-founder calls it a trapStarting a company in Dubai sounds appealing with no income tax and easy formalities. But if you operate from India, authorities might still consider it an Indian firm. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lilavati-trust-hits-back-at-hdfc-bank-rejects-outstanding-dues-2738409-2025-06-10",
      "headline": "Lilavati Trust hits back at HDFC Bank, rejects outstanding duesIn a sharply worded statement issued Monday, the Trust asserted that neither it nor its permanent trustee Prashant Kishor Mehta has ever borrowed from HDFC Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-share-price-today-stock-plit-record-date-announcement-2738378-2025-06-10",
      "headline": "Paras Defence shares in focus today, rise over 1% in early trade. Here's whyAlongside the 1:2 stock split, Paras Defence also declared its first-ever dividend of Rs 0.50 per share during its Q4 FY25 earnings on April 30. The announcement came on the back of a strong financial performance for the quarter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bengaluru-paying-guest-crisis-explained-2738365-2025-06-10",
      "headline": "Bengaluru's PG crisis: What's behind the mass shutdowns?Once the lifeline for Bengaluru's migrant workforce, why are PGs now vanishing from the city's tech hubs at an alarming pace? Read on know why hundreds of PG accommodations have shut down in the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-higher-nifty-above-25100-ntpc-gains-1-percent-2738360-2025-06-10",
      "headline": "Sensex, Nifty extend gains at open but lose steam as profit booking sets inThe S&P BSE Sensex added 68.34 points to 82,513.55, while the NSE Nifty50 gained 19.40 points to 25,128.05 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hiring-news-india-jobs-it-real-estate-september-quarter-q2-fy26-uae-china-asia-report-2738359-2025-06-10",
      "headline": "Hiring plans steady in India Inc for Q3 FY25: ReportIndia ranked second globally, behind the UAE, which reported the strongest hiring sentiment. India reported a Net Employment Outlook (NEO) of 42%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-trading-setup-nse-bse-sensex-nifty-open-higher-global-rbi-policy-2738347-2025-06-10",
      "headline": "Stock market opening today: Sensex, Nifty likely to open higher. Here's whyThe Sensex and Nifty are likely to extend their gains, helped by improving hopes around global trade discussions and the Reserve Bank of India's (RBI) policy measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-10-nse-bse-trading-wipro-tech-mahindra-motilal-oswal-premier-energies-2738334-2025-06-10",
      "headline": "Stocks to watch on June 10: Wipro, Tech Mahindra, Motilal Oswal, Premier EnergiesSensex and Nifty rose nearly half a percent in the last session, driven by favourable trends in both domestic and global markets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-starlinks-india-entry-plan-rs-33000-per-device-rs-3000-monthly-post-trial-2738230-2025-06-09",
      "headline": "Rs 33,000 per device, Rs 3,000 monthly post-trial: Starlink's India entry planStarlink customers will need to purchase a satellite dish-essential hardware for accessing the service-at an estimated cost of Rs 33,000. The monthly unlimited data plan will be offered at Rs 3,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-bros-discovery-splits-in-two-as-streaming-takes-the-lead-ceo-david-zaslav-will-lead-the-new-company-that-focuses-on-streaming-and-film-studios-2738089-2025-06-09",
      "headline": "Warner Bros Discovery to become two separate companies: ReportThe decision comes as more people stop watching traditional TV and move to streaming platforms. This shift has forced many media companies to rethink how they work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/currency-devaluation-wealth-erosion-property-value-drop-investment-timing-your-rs-1-crore-flat-is-now-rs-90-lakh-investor-explains-why-value-is-shrinking-2738044-2025-06-09",
      "headline": "Your Rs 1 crore flat is now Rs 90 lakh: Investor explains why value is shrinkingA financial influencer warns that unchecked money printing and currency devaluation could be reducing the real value of properties and other assets, urging investments in inflation-resistant assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-set-to-grow-27-percent-in-fy25-says-report-2738039-2025-06-09",
      "headline": "Pakistan's economy set to grow 2.7% in FY25: ReportPakistan's central bank, in a bid to encourage growth, cut its policy rate by more than 1,000 basis points in the current fiscal year. Its latest cut last month brought the key rate to 11%, resuming an easing cycle that had brought rates down from 22% after a brief pause in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-over-200-points-nifty-above-25100-kotak-bank-gains-3-percent-2738004-2025-06-09",
      "headline": "Sensex settles over 200 points; Nifty above 25,100; Kotak Bank gains 3%The S&P BSE Sensex was up 256.22 points to close at 82,445.21, while the NSE Nifty50 added 100.20 points to end at 25,103.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sashidhar-jagdishan-hdfc-bank-ceo-fir-mehta-family-lilavati-trust-hospital-2737948-2025-06-09",
      "headline": "Who is Sashidhar Jagdishan? HDFC Bank CEO under financial fraud lensSashidhar Jagdishan has been a part of HDFC Bank since 1996. He joined as a manager in the finance division and quickly rose through the ranks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shein-reliance-aim-to-sell-india-made-clothes-globally-within-a-year-2737928-2025-06-09",
      "headline": "Shein, Reliance aim to sell India-made clothes globally within a year: ReportThe aim is to make Shein-branded clothes in India not just for local sales but also for international markets, starting with the US and UK, within the next 6 to 12 months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-denies-retirement-plans-mahabharat-last-film-2739464-2025-06-12",
      "headline": "Aamir Khan clarifies Mahabharat isn't his final film amid retirement buzzAamir Khan recently put all speculations to rest about his retirement plans. The buzz erupted after the superstar shared his views on the film 'Mahabharat'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-7-kamal-haasan-film-crashes-earns-rs-42-crore-in-7-days-2739451-2025-06-12",
      "headline": "Thug Life box office Day 7: Kamal Haasan's film crashes, Rs 42 crore in Week 1Kamal Haasan and director Mani Ratnam's 'Thug Life' seems to have crashed at the box office. After seven days in theatres, Rs 50 crore-mark still feels distant for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sabrina-carpenter-announces-release-date-of-new-album-mans-best-friend-glbs-2739436-2025-06-12",
      "headline": "Sabrina Carpenter announces release date of new album 'Man's Best Friend'Sabrina Carpenter announces her bold new album Man's Best Friend, dropping August 29. Featuring chart-topping single Manchild, daring cover art, and a fall tour, the pop star is back with major momentum.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-zahara-jolie-pitt-engaged-to-actor-elijah-cooper-glbs-2739431-2025-06-12",
      "headline": "Is Angelina Jolie and Brad Pitt's daughter engaged to actor Elijah Cooper?Zahara Jolie-Pitt sparked engagement rumours after being spotted with a diamond ring while out with actor Elijah Cooper in L.A. The 20-year-old daughter of Angelina Jolie and Brad Pitt has yet to confirm the buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disney-and-nbcuniversal-sue-ai-firm-midjourney-over-copyright-infringement-glbs-2739428-2025-06-12",
      "headline": "Disney and NBCUniversal sue AI firm Midjourney over copyright infringementDisney and NBCUniversal have sued AI firm Midjourney for large-scale copyright infringement, accusing it of enabling users to generate unauthorised images of iconic characters like Darth Vader and the Minions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/youtuber-p2isthenames-cause-of-death-revealed-after-tragic-mail-room-discovery-glbs-2739420-2025-06-12",
      "headline": "YouTuber P2istheName's cause of death revealed after tragic mail room discoveryYouTuber P2istheName, also known as Philip Enewally, died from sudden cardiac dysfunction due to a rare heart condition. The 26-year-old had nearly 4 million subscribers and was known for his gaming content and entrepreneurial spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brian-wilson-iconic-beach-boys-co-founder-passes-away-at-82-glbs-2739416-2025-06-12",
      "headline": "Brian Wilson, iconic Beach Boys co-founder, passes away at 82Brian Wilson, co-founder of The Beach Boys and a pop music legend, has died at 82. Known for his melodic genius and personal struggles, Wilson leaves behind a lasting legacy in American music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-is-milind-chandwani-actor-avika-gor-soon-to-be-husband-2739333-2025-06-11",
      "headline": "Who is Milind Chandwani, actor Avika Gor's soon-to-be husband?Actor Avika Gor recently got engaged to 'MTV Roadies Real Heroes' fame Milind Chandwani. Chandwani is an IIM-Ahmedabad graduate and currently runs an NGO dedicated to underprivileged children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-opens-up-about-height-insecurities-recalls-support-from-javed-akhtar-2739328-2025-06-11",
      "headline": "Aamir Khan opens up about height insecurities, recalls support from Javed AkhtarAamir Khan, known as the perfectionist of Hindi cinema, recently spoke about his early career insecurities regarding his height. He credited humour and advice from Javed Akhtar for helping him overcome these fears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-back-on-ustaad-bhagat-singh-sets-makers-release-video-2739334-2025-06-11",
      "headline": "Pawan Kalyan back on Ustaad Bhagat Singh sets, makers release video After wrapping up 'Hari Hara Veera Mallu' and 'OG', actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan has now resumed work on 'Ustaad Bhagat Singh'. A behind-the-scenes video shared by the makers shows him arriving on set, interacting with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-reacts-with-pride-after-pm-narendra-modi-talks-menstrual-hygiene-2739313-2025-06-11",
      "headline": "Rupali Ganguly reacts with pride after PM Modi talks menstrual hygieneRupali Ganguly has expressed her admiration for PM Narendra Modi's efforts in breaking menstrual taboos. She feels proud of the positive impact this initiative has on society and awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mark-ruffalo-dedicates-poetic-anniversary-post-to-wife-my-love-partner-and-friend-2739235-2025-06-11",
      "headline": "Mark Ruffalo dedicates poetic anniversary post to wife: My love, partner and friendActor Mark Ruffalo recently wrote a romantic note for his wife Sunrise Coigney on social media. He shared a series of pictures with Sunrise, while cherishing their 25th wedding anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/goldy-brar-justifies-shooting-at-ap-dhillon-canada-home-we-have-to-be-feared-2739246-2025-06-11",
      "headline": "We have to be feared: Goldy Brar justifies shooting at AP Dhillon's Canada homeGangster Goldy Brar reacted to the 2024 shooting outside singer AP Dhillon's Canada residence. In a documentary, Brar justified the incident, and said thousands of families are dependent on his gang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/avika-gor-engaged-to-boyfriend-milind-chandwani-2739297-2025-06-11",
      "headline": "Avika Gor engaged to boyfriend Milind Chandwani in filmy, magical ceremonyActor Avika Gor has announced her engagement to 'MTV Roadies Real Heroes' fame Milind Chandwani through Instagram. The couple has been together for over five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-3-unreleased-songs-out-on-his-birth-anniversary-go-viral-2739262-2025-06-11",
      "headline": "Sidhu Moose Wala's 3 unreleased songs out on his birth anniversary, go viralThree new tracks by the late Punjabi rapper Sidhu Moose Wala went viral within hours of its release on YouTube and Spotify. The tracks were released to mark his birth anniversary on June 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/bts-v-kim-taehyung-back-on-instagram-after-military-discharge-shares-throwback-pics-2739253-2025-06-11",
      "headline": "BTS V back on Instagram after military discharge, shares throwback picsA day after being discharged from mandatory military service, BTS' V treated his fans with a bunch of throwback pictures from his time. BTS' RM, Jungkook, V and Jimin were officially discharged from the services. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-slams-manufactured-shame-against-women-after-baldoni-lawsuit-dismissal-2739107-2025-06-11",
      "headline": "Blake Lively slams manufactured shame against women after Baldoni lawsuit dismissalActor Blake Lively recently highlighted the manufactured shame and emotional toll women have to endure after her win over Justin Baldoni's $400 million defamation lawsuit against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jr-ntr-begins-dubbing-for-war-2-his-action-film-with-hrithik-roshan-2739193-2025-06-11",
      "headline": "Jr NTR begins dubbing for 'War 2', his action film with Hrithik RoshanJr NTR has officially begun dubbing for his much-anticipated Bollywood film, 'War 2'. The film, which also stars Hrithik Roshan and Kiara Advani, is slated for release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-jason-isaacs-reacts-to-tom-felton-return-as-draco-in-broadway-harry-potter-2739056-2025-06-11",
      "headline": "Actor Jason Isaacs reacts to Tom Felton's return as Draco in Broadway's Harry PotterActor Tom Felton is set to reprise his role as Draco Malfoy on Broadway starting November 11. Jason Isaacs, who played his on-screen father Lucius in the film franchise, reacted to his return in the Harry Potter play. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dangerous-place-trump-orders-withdrawal-us-troops-middle-east-iran-iraq-israel-tensions-nuclear-2739459-2025-06-12",
      "headline": "Dangerous place: Trump orders US pullback from Middle East amid Iran tensionsThe decision comes against the backdrop of heightened tensions in the Middle East as talks between the US and Iran over its rapidly advancing nuclear program appear to have hit an impasse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asked-pm-modi-to-stop-hasina-from-reaching-out-to-bangladesh-he-said-muhammad-yunus-2739368-2025-06-11",
      "headline": "Asked PM Modi to stop Hasina from reaching out to Bangladesh, he said...: YunusWhen asked whether India was doing what Bangladesh expected, Muhammad Yunus responded without hesitation: \"No.\" He confirmed that Bangladesh had written to the Indian government requesting Hasina's extradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-card-5-million-dollars-permanent-us-residency-wait-list-is-open-website-visa-2739442-2025-06-12",
      "headline": "Trump Card, offering path to US residency for $5 million, now open for applicantsThe fine print of Donald Trump's social media post suggests that the Gold Card doesn't guarantee anyone US citizenship but is only a 'beautiful road in gaining access to the Greatest Country.' Trump has maintained that he would not need Congress's approval as the 'Gold Card' does not grant citizenship to the buyers, only a path to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-general-kurillas-big-backing-for-pakistan-phenomenal-counter-terrorism-partner-2739330-2025-06-11",
      "headline": "Phenomenal counter-terrorism partner: US general's big backing for PakistanTestifying before the House Armed Services Committee on Tuesday, General Kurilla strongly advocated for maintaining strategic ties with both India and Pakistan, asserting that the US must not view its South Asia policy through a zero-sum lens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-protests-donald-trump-anti-immigration-stir-more-us-states-cities-curfew-national-guard-marines-arrests-detains-2739452-2025-06-12",
      "headline": "LA protests: 400 arrested, curfew imposed again as stir spreads to more US citiesNearly 400 people have been detained or arrested in Los Angeles for the anti-immigration protests, which entered its sixth day on Wednesday. A curfew has been imposed again following a brief lift on Wednesday morning as the demonstrations swelled to other US cities, with more planned over the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/red-alert-for-heat-wave-in-delhi-thunderstorms-expected-maximum-temperature-2739393-2025-06-11",
      "headline": "Red alert for heat wave in Delhi today, thunderstorms expected by eveningMaximum temperatures ranged from 40.9 to 45.0 degrees Celsius, the data from Delhi's various weather stations showed on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-musks-apology-was-very-nice-after-ugly-public-feud-glbs-2739432-2025-06-12",
      "headline": "Very nice: Donald Trump responds to Musk's public apology after ugly feudDonald Trump has reacted to Elon Musk's public apology following a week-long online feud. Musk said his comments about the president had \"gone too far.\" Trump told the New York Post he was \"really surprised\" but held \"no hard feelings,\" though he added he was \"a little disappointed.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tripura-love-triangle-murder-body-found-ice-cream-freezer-2739446-2025-06-12",
      "headline": "Man strangled, body stuffed in freezer in Tripura love triangle murderA man in Tripura was murdered by a love rival and his body was hidden in an ice-cream freezer. Police arrested six people, including the main accused and his parents.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-30-can-government-deliver-jobs-private-investment-2739435-2025-06-12",
      "headline": "PM Modi 3.0: Can the government deliver on jobs and private investment?As the PM Modi-led government has completed 11 years in power, let's have a look at how India's economy has done, and what's the road ahead. Naysayers have often questioned the government and its economic policies. Has the Indian economy really done well?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-sonam-mangalsutra-left-homestay-helped-cops-2739417-2025-06-12",
      "headline": "Meghalaya honeymoon murder: How Sonam's mangalsutra left at homestay helped copsSonam Raghuvanshi left behind her 'mangalsutra' at a Meghalaya homestay, giving police the first clue in the murder of her husband Raja Raghuvanshi during their honeymoon. Five people, including her boyfriend, are now in custody."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ashok-gehlot-softens-tone-sachin-pilot-says-we-were-never-far-away-2739440-2025-06-12",
      "headline": "Ashok Gehlot softens tone on Sachin Pilot, says 'we were never far away'Ashok Gehlot made the remark during an interaction with the media at the venue of the 'Prarthna Sabha' held in memory of Rajesh Pilot, a veteran Congress leader and father of Sachin Pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kim-jong-un-vows-unwavering-support-for-russia-calls-putin-dearest-comrade-glbs-2739439-2025-06-12",
      "headline": "Kim Jong Un vows unwavering support for Russia, calls Putin 'dearest comrade'North Korean leader Kim Jong Un pledged unwavering support for Russia, calling Putin his \"dearest comrade\" and confirming Pyongyang's commitment to strong ties and military backing in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-trump-greeted-with-cheers-boos-first-kennedy-center-appearance-glbs-2739443-2025-06-12",
      "headline": "Watch: Trump greeted with cheers, boos at first Kennedy Centre appearancePresident Trump received a mix of cheers and boos as he attended Les Misérables at the Kennedy Centre. He attended the show just days after deploying US Marines and the National Guard to address the ongoing violent protests in Los Angeles following his immigration raids."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/blood-on-sindoor-why-indian-marriages-are-turning-deadly-2739170-2025-06-11",
      "headline": "Blood on sindoor: Why Indian marriages are turning deadlyFrom Sonam Raghuvanshi in Indore to Muskan of Meerut, a trail of women who allegedly killed their husbands casts a harsh light on contemporary Indian marriage and domestic life\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/railways-send-filthy-broken-rickety-train-for-bsf-jawans-travel-from-tripura-to-jammu-and-kashmir-amarnath-yatra-duty-2739272-2025-06-11",
      "headline": "Row over filthy train sent for BSF jawans on Amarnath duty; 4 officials suspendedThe train provided to BSF jawans for their travel to Amarnath Yatra was in a dirty, dilapidated condition. The incident sparked outrage, following which four railway officials were suspended."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-announces-rare-earth-minerals-universities-tariff-agreements-relationship-excellent-2739269-2025-06-11",
      "headline": "Rare minerals to us, college admissions to them: Trump's done deal with ChinaWith this deal, Beijing will supply magnets and rare earth minerals to the US while the latter will allow Chinese students in its colleges and universities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/raja-raghuvanshi-murder-case-sonam-killed-husband-meghalaya-honeymoon-horror-2739337-2025-06-11",
      "headline": "Murder, matrimony, and melodrama: A honeymoon in Meghalaya ends in horrorA couple's honeymoon in Meghalaya turns into a chilling murder tale involving a suspected love triangle, a viral influencer sister, and a public outcry for justice wrapped in online melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-deployed-more-troops-to-los-angeles-than-syria-iraq-combined-report-glbs-2739426-2025-06-12",
      "headline": "Trump deployed more troops to Los Angeles than Syria, Iraq combined: ReportUS President Donald Trump has deployed more troops to Los Angeles to curb protests than the combined number stationed in Iraq and Syria. With around 4,700 personnel on the ground, the move has drawn backlash from California officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cutting-sugar-30-days-benefits-weight-loss-skin-health-mental-clarity-2739074-2025-06-11",
      "headline": "What happens when you cut sugar from your diet for 30 daysCan a 30-day sugar break improve physical and mental health? Here's what experts say."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-case-sonam-admits-to-hatching-raja-raghuvanshis-murder-plan-breaks-down-before-cops-2739195-2025-06-11",
      "headline": "Sonam admits to plotting honeymoon murder, breaks down before cops: SourcesSonam Raghuvanshi confessed to hatching a plan to get her husband killed with the help of her alleged lover Raj Kushwaha, who, too, confessed to the crime a day before. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-cant-broker-peace-between-his-ego-and-reality-forget-about-india-pak-ceasefire-2738998-2025-06-11",
      "headline": "Trump can't broker peace between his ego and reality, forget about India-Pak ceasefireFrom his trade war dud against China to burning his fingers in the Ukraine-Russia war to his fake claims of brokering India-Pak ceasefire to stoking fire in Los Angeles, it's a global Donald Trump clown show in the White House. And we are running out of patience and popcorn."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/muhammad-yunus-rules-out-staying-in-power-after-bangladesh-2026-elections-glbs-2739411-2025-06-12",
      "headline": "Muhammad Yunus rules out staying in power after Bangladesh 2026 electionsInterim Bangladeshi leader Muhammad Yunus has confirmed he will step down after the April 2026 elections, saying there is \"no way\" he will stay in power. His statement comes amid rising political tensions and the recent indictment of former PM Sheikh Hasina on mass murder charges linked to the 2024 protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/delhi-university-can-relationships-be-taught-as-a-curriculum-in-a-classroom-2739290-2025-06-11",
      "headline": "Can relationships be taught as a curriculum in a classroom?Delhi University (DU) has launched a course that will cover everything from understanding love and friendships to spotting red flags and building healthier bonds. The question is: Can relationships be taught as a curriculum in a classroom? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ex-movie-mogul-harvey-weinstein-convicted-of-sexual-assault-in-new-york-retrial-glbs-2739415-2025-06-12",
      "headline": "Ex-movie mogul Harvey Weinstein convicted of sexual assault in New York retrialEx-movie mogul Harvey Weinstein was convicted of sexually assaulting one woman in his New York retrial, acquitted of another charge, with jurors still undecided on a third rape allegation."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-2025-steve-smith-left-surprised-by-south-africas-drs-blunder-vs-beau-webster-2739465-2025-06-12",
      "headline": "Steve Smith left 'surprised' by South Africa's DRS blunder against Beau WebsterStar Australia batter Steve Smith said he was left surprised by South Africa not opting to go for DRS for a close lbw shout against Beau Webster during Day 1 of the World Test Championship (WTC) final at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-failure-indian-football-aiff-india-vs-hong-kong-isl-vs-i-league-2739450-2025-06-12",
      "headline": "Why Manolo Marquez's India stint proves FIFA Career Mode isn't real lifeIndian football tried to play Career Mode in real life—handing one man two jobs, but now it's all gone glitchy. No wins, no goals, no direction. Time to uninstall the experiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-test-series-morne-morkel-on-nitish-kumar-reddy-2739447-2025-06-12",
      "headline": "Nitish Reddy is skillful with ball, want to see him bowl more in Tests: Morne MorkelNitish Kumar Reddy has the knack for delivering \"magical\" balls, but India's bowling coach Morne Morkel believes the young all-rounder must take on greater bowling responsibility to truly complement his batting prowess.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-sreeja-akula-jaipur-patriots-semi-final-2739403-2025-06-11",
      "headline": "Sreeja Akula leads Jaipur Patriots to maiden UTT semi-final with 9-6 winUndefeated Sreeja Akula starred as she sealed Jaipur Patriots' maiden UTT semi-final berth with a 9-6 win over PBG Pune Jaguars—her Clarke-like dominance continuing a season of brilliance under the bright lights at Ahmedabad's EKA Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-coach-brendon-mccullum-reaction-home-test-series-2739400-2025-06-11",
      "headline": "India will come with high hopes, England looking forward to battle: McCullumEngland head coach Brendon McCullum said he is clear about the direction he wants to take his Test side as they brace for a stern challenge from India in what promises to be a demanding summer of cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beau-webster-hails-bowlers-australia-vs-south-africa-wtc-final-day-1-2739395-2025-06-11",
      "headline": "Australia tough to beat: Beau Webster hails bowlers for WTC Final startBeau Webster's gritty 72 and Australia's fiery bowling fightback, led by Mitchell Starc, flipped the momentum on Day 1 of the WTC Final, as South Africa's top order crumbled under relentless pressure at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-australia-vs-south-africa-14-wickets-day-1-kagiso-rabada-2739390-2025-06-11",
      "headline": "Australia fight back with pace on 14-wicket Day 1 after Kagiso Rabada specialWTC 2025 final: Australia fought back, picking four South African wickets on a lively Lord's pitch on Day 1. Earlier in the day, Kagiso Rabada's five-wicket haul helped the first-time finalists dismiss Australia for 212. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-apex-council-meeting-ipl-victory-celebration-bengaluru-stampede-2739388-2025-06-11",
      "headline": "BCCI to discuss formulation of norms for IPL celebration after Bengaluru stampedeThe Indian cricket board will discuss the need to formulate norms for victory celebration of Indian Premier League franchises during its apex council meeting on June 14. The matter has gained urgency following the stampede in Bengaluru that killed 11 people and left over 50 injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-morne-morkel-energy-workload-management-india-england-tests-2739356-2025-06-11",
      "headline": "Jasprit Bumrah's energy mind-blowing, in great shape for England Tests: MorkelIndia bowling coach Morne Morkel has praised pace spearhead Jasprit Bumrah's rhythm and intensity during training sessions in England. The Indian team management plans to manage Bumrah's workload carefully due to his back injury history, aiming for peak fitness in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-ravi-shastri-sad-india-tour-of-england-2739346-2025-06-11",
      "headline": "Sad Virat Kohli retired like this, I'd have made him Test captain again: ShastriFormer India captain Ravi Shastri said Virat Kohli's sudden retirement from Test cricket could have been handled better by the stakeholders of Indian cricket. Kohli ended his Test career on May 12, a month before India's tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-sa-vs-aus-kagiso-rabada-five-wickets-haul-allan-donald-2739349-2025-06-11",
      "headline": "Five-star Kagiso Rabada goes past Allan Donald, rattles Australia at Lord'sWorld Test Championship 2025 final: South Africa fast bowler Kagiso Rabada took a five-wicket haul as Australia were bundled out for 212 on Day 1 of the big final. Rabada was well supported by left-arm pacer Marco Jansen at Lord's, London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-australia-vs-south-africa-14-wickets-day-1-kagiso-rabada-2739390-2025-06-11",
      "headline": "Australia fight back with pace on 14-wicket Day 1 after Kagiso Rabada specialWTC 2025 final: Australia fought back, picking four South African wickets on a lively Lord's pitch on Day 1. Earlier in the day, Kagiso Rabada's five-wicket haul helped the first-time finalists dismiss Australia for 212. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-apex-council-meeting-ipl-victory-celebration-bengaluru-stampede-2739388-2025-06-11",
      "headline": "BCCI to discuss formulation of norms for IPL celebration after Bengaluru stampedeThe Indian cricket board will discuss the need to formulate norms for victory celebration of Indian Premier League franchises during its apex council meeting on June 14. The matter has gained urgency following the stampede in Bengaluru that killed 11 people and left over 50 injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-morne-morkel-energy-workload-management-india-england-tests-2739356-2025-06-11",
      "headline": "Jasprit Bumrah's energy mind-blowing, in great shape for England Tests: MorkelIndia bowling coach Morne Morkel has praised pace spearhead Jasprit Bumrah's rhythm and intensity during training sessions in England. The Indian team management plans to manage Bumrah's workload carefully due to his back injury history, aiming for peak fitness in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retirement-ravi-shastri-sad-india-tour-of-england-2739346-2025-06-11",
      "headline": "Sad Virat Kohli retired like this, I'd have made him Test captain again: ShastriFormer India captain Ravi Shastri said Virat Kohli's sudden retirement from Test cricket could have been handled better by the stakeholders of Indian cricket. Kohli ended his Test career on May 12, a month before India's tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-sa-vs-aus-kagiso-rabada-five-wickets-haul-allan-donald-2739349-2025-06-11",
      "headline": "Five-star Kagiso Rabada goes past Allan Donald, rattles Australia at Lord'sWorld Test Championship 2025 final: South Africa fast bowler Kagiso Rabada took a five-wicket haul as Australia were bundled out for 212 on Day 1 of the big final. Rabada was well supported by left-arm pacer Marco Jansen at Lord's, London. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}