{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to alll-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-it-firm-consolidated-net-profit-up-5-percent-yoy-to-rs-11909-crore-2614736-2024-10-10",
      "headline": "TCS Q2 Results: IT firm's net profit up 5% YoY to Rs 11,909 crore The company's net profit reached Rs 11,909 crore, up from Rs 11,342 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-higher-banking-metal-stocks-shine-2614706-2024-10-10",
      "headline": "Sensex, Nifty end marginally higher; banking, metal stocks shine The S&P BSE Sensex added 144.31 points to close at 81,611.41, while the NSE Nifty50 gained 16.50 points to end at 24,998.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-family-tree-look-at-its-members-from-jamsetji-to-noel-tata-2614692-2024-10-10",
      "headline": "Ratan Tata family tree: Look at its members from Jamsetji to Noel TataRatan Tata was born on December 28, 1937, and belonged to one of India's most well-known business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-kumar-mangalam-birla-pays-tribute-lost-true-visionary-2614609-2024-10-10",
      "headline": "Kumar Mangalam Birla pays tribute to Ratan Tata: Lost true visionaryKumar Mangalam Birla, the Chairman of the Aditya Birla Group, expressed his sorrow and paid tribute to Ratan Tata, highlighting the long-standing relationship between their families and the impact Ratan Tata had on the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-confirms-data-breach-clears-ciso-of-wrongdoing-amid-hacker-claims-2614583-2024-10-10",
      "headline": "Star Health confirms data breach, clears CISO of wrongdoing amid claimsStar Health Insurance released a statement acknowledging the cyberattack. The company confirmed that it was a victim of a targeted malicious cyberattack, which led to unauthorised access to certain data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-mumbai-tata-group-philanthropy-investments-education-technology-steel-2614512-2024-10-10",
      "headline": "Remembering Ratan Tata, a beacon of philanthropyRatan Tata death: Ratan Tata played a key role with his philanthropic efforts in various sectors, including healthcare, technology, disaster relief and social welfare. Here's how Ratan Tata made a profound impact through his philanthropy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-visionary-who-fuelled-indias-startup-revolution-paytm-ola-firstcry-upstox-2614508-2024-10-10",
      "headline": "Ratan Tata: The visionary who fuelled India's startup revolutionEven after his retirement, Ratan Tata continued to embody the spirit of entrepreneurship, emerging as a formidable investor and mentor to a multitude of startups across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-today-press-conference-doubtful-after-ratan-tatas-demise-2614473-2024-10-10",
      "headline": "TCS Q2 results today, press conference doubtful after Ratan Tata's demiseRatan Naval Tata, one of India's most influential industrialists and chairman emeritus of the Tata Group, passed away late Wednesday night at the age of 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-10-2024-precious-metals-record-hike-on-mcx-2614472-2024-10-10",
      "headline": "Gold, silver price today, October 10, 2024: Precious metals record hike on MCXGold Price Today October 10, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-tata-shares-in-spotlight-after-ratan-tata-death-2614464-2024-10-10",
      "headline": "Sensex, Nifty open higher; Tata shares in spotlight after Ratan Tata's deathThe S&P BSE Sensex added 110.95 points to 81,578.05, while the NSE NIfty50 gained 19.80 points to 25,001.75. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-samajwadi-party-bjp-jp-narayan-centre-lucknow-gate-barricade-tin-sheets-2615051-2024-10-11",
      "headline": "Akhilesh Yadav vs BJP over barricade at Lucknow's JP Narayan CentreThe BJP hit out at Samajwadi Party chief Akhilesh Yadav's claim that tin sheets were installed in front of the JP Narayan Centre's main gate to prevent his entry to mark the birth anniversary of the socialist leader, calling it \"childish\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-east-asia-summit-terrorism-indo-pacific-asean-cooperation-israel-ukraine-russia-conflict-peace-2615134-2024-10-11",
      "headline": "Solutions to problems can't come from battlefield: PM at East Asia summitAddressing the East Asia Summit in Laos, PM Modi emphasised the importance of India's engagement with ASEAN countries and the need for global cooperation in the face of rising conflicts and tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-goddess-kali-jeshoreshwari-temple-crown-pm-modi-gift-stolen-2615057-2024-10-11",
      "headline": "Goddess Kali's crown, gifted by PM, stolen from Bangladesh temple, India reactsThe silver, gold-plated crown was gifted to the goddess Kali at the Jeshoreshwari Temple in Satkhira by Indian Prime Minister Narendra Modi in 2021 during his visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-man-fired-from-job-threatening-message-acid-attack-on-woman-choice-clothes-2615102-2024-10-11",
      "headline": "Bengaluru man threatens woman with acid attack for her choice of clothes, firedA man in Bengaluru was fired from his job after he threatened to throw acid at a woman when he objected to her choice of clothes in a social media post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/geomagnetic-storm-hits-earth-northern-lights-seen-india-leh-world-aurora-borealis-2615118-2024-10-11",
      "headline": "Aurora lights up Leh skies as geomagnetic storm hits EarthSkies in Leh, Ladakh were lit up by a rare aurora borealis due to a strong geomagnetic storm that reached Earth on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-jammu-and-kashmir-election-win-results-comeback-ktr-mk-stalin-congratulations-2615083-2024-10-11",
      "headline": "KTR's shoutout to Omar Abdullah on J&K comeback, he respondsPolitical leaders from across party lines congratulated National Conference leader Omar Abdullah after his party won a majority in the Jammu and Kashmir Assembly elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/vicky-aur-vidya-ka-woh-wala-video-review-rajkummar-rao-triptii-dimri-film-is-a-yawnfest-2615107-2024-10-11",
      "headline": "Vicky Aur Vidya Ka Woh Wala Video review: Rajkummar-Triptii's film is a yawnfestReleased-Fri Oct 11, 2024Rajkummar Rao and Triptii Dimri's Vicky Aur Vidya Ka Woh Wala Video shows potential, but fails to live up to expectations. The film is a yawnfest, says our review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saurabh-chandrakar-mahadev-app-betting-scam-mastermind-arrested-in-dubai-interpol-notice-cbi-red-corner-notice-ed-2615131-2024-10-11",
      "headline": "Saurabh Chandrakar, mastermind of Mahadev app betting scam, arrested in DubaiThe Mahadev app allegedly operated through a network of panel operators across India, facilitating money laundering from illegal betting activities. Chandrakar is also suspected of having links to the D Company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bhavish-aggarwal-recalls-ratan-tata-key-role-in-the-founding-of-ola-electric-2615126-2024-10-11",
      "headline": "Bhavish Aggarwal recalls Ratan Tata's key role in the founding of Ola ElectricOla CEO Bhavish Aggarwal remembered Ratan Tata's key role in the founding of his second venture, Ola Electric. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-audi-hit-and-run-bike-rider-killed-google-building-2615063-2024-10-11",
      "headline": "Delivery man killed after Audi rams his bike in Pune, driver detainedThe accident occurred in Pune when the Audi first hit three people riding an Activa, causing them to fall and sustain minor injuries. Shortly after, the luxury car rammed a biker, a Swiggy delivery agent, who later succumbed to his injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-food-plate-greenest-world-latest-living-planet-report-2615041-2024-10-11",
      "headline": "India's food plate is greenest in the world, says international study The report underscores that if more countries were to adopt India's dietary habits, it would lead to a notable reduction in environmental damage and help mitigate the impacts of climate change by the year 2050. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ryan-salame-ftx-cryptocurrency-fraud-case-linked-in-update-jail-term-caroline-ellison-2615099-2024-10-11",
      "headline": "Ryan Salame, crypto fraud convict, announces 'new position' on LinkedInRyan Salame, a convict in the FTX cryptocurrency fraud case, updated his LinkedIn profile to announce his \"new position\" as an inmate at the Federal Correctional Institution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/tesla-cybercab-robotaxi-revealed-to-cost-below-usd-30000-2615138-2024-10-11",
      "headline": "Tesla Cybercab robotaxi revealed, to cost below $30,000Tesla revealed its fully autonomous driverless robotaxi, the Cybercab, on Friday.  Priced below $30,000, the Cybercab does not have a traditional charging port and will rely on wireless charging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-slams-indigo-delay-flight-mumbai-airlines-apologise-2615106-2024-10-11",
      "headline": "Actor Shruti Haasan slams IndiGo over 4-hour delay in Mumbai, airline respondsActor Shruti Haasan recently called out IndiGo after her flight from Mumbai was delayed for four hours 'without Information'. Soon after the actor's post on X, the airline apologised for the inconvenience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-grand-slams-retirement-video-2615095-2024-10-11",
      "headline": "Thank you Rafael Nadal for teaching the world why it's important to not give upRafael Nadal's tennis career was defined by his warrior spirit, fighting every point as if it were life or death. His dominance on clay courts, particularly at Roland Garros with 14 French Open titles, was unmatched. Nadal's legacy will be remembered not just for his titles, but for his perseverance, humility, and the heart he poured into every match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-prime-minister-narendra-modi-gujarat-one-word-message-ratan-tata-2008-2615037-2024-10-11",
      "headline": "When PM brought Nano plant to Gujarat after 1 word SMS to Ratan Tata in 2008Then Gujarat Chief Minister Narendra Modi had sent a one word SMS to the then Tata Group Chairman Ratan Tata after the Nano project was withdrawn from West Bengal in 2008."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-virat-kohli-fan-hilarious-reaction-2615117-2024-10-11",
      "headline": "Kisme? Virat Kohli's hilarious reaction to fan's Border Gavaskar Trophy requestVirat Kohli had a hilarious reaction when a fan asked him to set the Border Gavaskar Trophy stage on fire in Australia. Kohli will be a key player for India during the series down under, which will begin in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ratan-tata-death-french-president-emmanuel-macron-message-india-france-ties-friend-2615076-2024-10-11",
      "headline": "Emmanuel Macron remembers Ratan Tata: France lost a dear friend from IndiaFrench President Emmanuel Macron praised Ratan Tata's contributions to innovation and manufacturing, as well as his role in strengthening India-France ties, along with his lasting legacy of philanthropy and humility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/samajwadi-party-worker-chains-himself-protest-jp-narayan-centre-barricaded-2615127-2024-10-11",
      "headline": "Samajwadi Party worker chains himself in protest as JP Narayan Centre barricadedA Samajwadi Party worker chained himself in protest outside the residence of party chief Akhilesh Yadav. Police sealed and barricaded JP Narayan Centre in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-lebanon-hezbollah-israel-war-gulf-states-us-allies-middle-east-crisis-oil-facilities-attack-warning-2615046-2024-10-11",
      "headline": "Iran warns Gulf nations against helping Israel, says 'will respond accordingly'The Gulf Arab nations have urged the US to prevent Israel from targeting Iran's oil facilities, fearing that Tehran may retaliate by striking their own oil infrastructure in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/can-a-pretty-office-desk-help-you-work-better-2615036-2024-10-11",
      "headline": "Can a pretty office desk help you work better?Millennials and Gen Zers are sprucing up their work desks with all things beautiful, even if it comes with spending significant money. And it turns out, the move is not solely driven by the motive of acing the social media game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-conflict-wafiq-safa-strikes-central-beirut-lebanon-gaza-netanyahu-iran-2615047-2024-10-11",
      "headline": "Hezbollah leader escapes assassination as Israeli strikes kill 22 in BeirutSenior Hezbollah official Wafiq Safa narrowly escaped an assassination attempt during Israeli airstrikes on central Beirut, which resulted in the deaths of 22 people and wounded dozens more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-says-tesla-humanoid-optimus-can-now-do-anything-that-you-can-think-of-2615105-2024-10-11",
      "headline": "Elon Musk says Tesla humanoid Optimus can now do anything that you can think ofAt the We, Robot event, Elon Musk once again showed off the Tesla humanoid Optimus. At the showcase, he said, \"anything that you can think of, it will do\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-orders-schools-it-companies-hoist-flag-hold-functions-kannada-rajyotsava-day-state-formation-day-2615143-2024-10-11",
      "headline": "Karnataka orders schools to hold functions on Kannada on November 1Karnataka orders all schools to hold functions in Kannada on November 1"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/k-dramas-korean-fix-lee-min-ho-boys-over-flowers-and-the-heirs-did-not-age-well-2614882-2024-10-11",
      "headline": "From iconic to cringe: How Boys Over Flowers and The Heirs didn't age wellOnce the pinnacle of K-drama, Boys Over Flowers and The Heirs, now appear as relics of a bygone era. With problematic plotlines and dated tropes, these dramas offer more cringe than charm today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jigra-box-office-collection-day-1-prediction-detailed-report-alia-bhatt-dussehra-thriller-set-for-average-rs-5-crore-opening-2615137-2024-10-11",
      "headline": "Jigra box office Day 1 prediction: Alia Bhatt's thriller set for Rs 5 crore openingJigra, starring Alia Bhatt and Vedang Rana, hit the screens on Dussehra. The film is going to rely heavily on positive word-of-mouth, which will determine its box office performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/hrithik-roshan-girlfriend-saba-azad-paps-siddharth-anand-wife-mamta-party-war-2-2615122-2024-10-11",
      "headline": "Video: Hrithik Roshan, Saba Azad wade through paps at Siddharth Anand's partyActor Hrithik Roshan along with his girlfriend Saba Azad attended director Siddharth Anand's wife's birthday party. The two made their way through the photographers who surrounded them for pictures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/vicky-aur-vidya-ka-woh-wala-video-review-rajkummar-rao-triptii-dimri-film-is-a-yawnfest-2615107-2024-10-11",
      "headline": "Vicky Aur Vidya Ka Woh Wala Video review: Rajkummar-Triptii's film is a yawnfestReleased-Fri Oct 11, 2024Rajkummar Rao and Triptii Dimri's Vicky Aur Vidya Ka Woh Wala Video shows potential, but fails to live up to expectations. The film is a yawnfest, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-says-tesla-humanoid-optimus-can-now-do-anything-that-you-can-think-of-2615105-2024-10-11",
      "headline": "Elon Musk says Tesla humanoid Optimus can now do anything that you can think ofAt the We, Robot event, Elon Musk once again showed off the Tesla humanoid Optimus. At the showcase, he said, \"anything that you can think of, it will do\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-reveals-tesla-cybercab-at-we-robot-event-driverless-and-no-steering-wheel-in-the-car-2615089-2024-10-11",
      "headline": "Elon Musk reveals Tesla Cybercab at We, Robot event, driverless and no steering wheel in the carDuring the We, Robot event, Tesla CEO Elon Musk unveiled a prototype of a fully autonomous car, called the Cybercab. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/intel-arrow-lake-launched-brings-ai-chipsets-for-gaming-release-date-specs-pricing-2615072-2024-10-11",
      "headline": "Intel Arrow Lake launched, brings AI chipsets for gaming: Release date, specsIntel Core Ultra 200S series is set to be launched on October 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/samsung-issues-apology-for-lagging-innovation-vows-to-regain-competitive-edge-2614878-2024-10-10",
      "headline": "Samsung issues apology for lagging innovation, vows to regain competitive edgeSamsung Electronics has openly acknowledged its recent shortcomings in an official letter following the release of its Q3 2024 earnings guidance."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-common-sense-joe-root-pak-vs-eng-multan-test-2615140-2024-10-11",
      "headline": "He lacks common sense outside of cricket: Root's hilarious praise for BrookSenior England batter Joe Root heaped praise on Harry Brook for his sensational triple-century in Multan Test. Root hilariously said that for someone who has so little common sense outside of cricket, it was incredible how mature Brook was with the bat in Multan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-virat-kohli-fan-hilarious-reaction-2615117-2024-10-11",
      "headline": "Kisme? Virat Kohli's hilarious reaction to fan's Border Gavaskar Trophy requestVirat Kohli had a hilarious reaction when a fan asked him to set the Border Gavaskar Trophy stage on fire in Australia. Kohli will be a key player for India during the series down under, which will begin in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-first-test-harry-brook-triple-hundred-joe-root-nasser-hussain-2615097-2024-10-11",
      "headline": "Shots of Pietersen, rhythm of Root: Nasser Hussain's heavy praise for Harry BrookNasser Hussain has claimed that Harry Brook has the shots of Kevin Pietersen and the rhythm and hunger of Joe Root after the 25-year-old scored a blazing 317 in the Multan Test on October 10, Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-grand-slams-retirement-video-2615095-2024-10-11",
      "headline": "Thank you Rafael Nadal for teaching the world why it's important to not give upRafael Nadal's tennis career was defined by his warrior spirit, fighting every point as if it were life or death. His dominance on clay courts, particularly at Roland Garros with 14 French Open titles, was unmatched. Nadal's legacy will be remembered not just for his titles, but for his perseverance, humility, and the heart he poured into every match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-clear-favourites-in-world-championship-final-vs-ding-liren-nakamura-2615085-2024-10-11",
      "headline": "D Gukesh clear favourites in World Championship final vs Ding Liren: NakamuraIndia's 18-year-old Grand Master D Gukesh is clear favourite in the World Championship final against Ding Liren, says Hikaru Nakamura. Gukesh has been in sensational form of late and recently guided India to their maiden Chess Olympiad victory.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/south-american-world-cup-qualifiers-results-lionel-messi-argentina-brazil-2615075-2024-10-11",
      "headline": "Lionel Messi's return spoiled as Venezuela hold Argentina, Brazil edge past ChileLionel Messi's return to the Argentina team was spoiled by Venezuela, who held the World Champions to a 1-1 draw on October 10, Thursday. Brazil secured a last-gasp win to edge past Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-new-zealand-test-series-tom-lathams-plan-captaincy-bengaluru-2615064-2024-10-11",
      "headline": "Tom Latham's plan for New Zealand against India: No fear, take it to themNewly-appointed New Zealand captain Tom Latham wants his side to be fearless and take the game to India during the upcoming Test series, which begins on October 16. The India series will be Latham's first assignment as full-time Test captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-england-vs-greece-vangelis-pavlidis-george-baldock-death-wembley-2615050-2024-10-11",
      "headline": "We gave our soul for George Baldock in England win: Greece's Vangelis PavlidisGreece's hero against England, Vangelis Pavlidis, claimed that the entire team gave their soul for George Baldock in their historic win at Wembley on October 10, Thursday. Pavlidis scored a brace as Greece defeated England 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-video-carlos-alcaraz-emotional-davis-cup-2615048-2024-10-11",
      "headline": "Watch: Alcaraz gets emotional seeing Rafael Nadal's retirement announcementCarlos Alcaraz and his team were seen to be emotional as they watched Rafael Nadal's retirement video on October 10, Thursday. Nadal announced that he would be ending his career after the Davis Cup finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abrar-ahmed-hospitalised-after-suffering-from-high-fever-in-multan-test-2615023-2024-10-10",
      "headline": "Abrar Ahmed hospitalised after suffering from high fever in Multan TestPakistan wrist spinner Abrar Ahmed has been hospitalized after suffering from high fever in the ongoing first Test against Pakistan in Multan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/south-american-world-cup-qualifiers-results-lionel-messi-argentina-brazil-2615075-2024-10-11",
      "headline": "Lionel Messi's return spoiled as Venezuela hold Argentina, Brazil edge past ChileLionel Messi's return to the Argentina team was spoiled by Venezuela, who held the World Champions to a 1-1 draw on October 10, Thursday. Brazil secured a last-gasp win to edge past Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-new-zealand-test-series-tom-lathams-plan-captaincy-bengaluru-2615064-2024-10-11",
      "headline": "Tom Latham's plan for New Zealand against India: No fear, take it to themNewly-appointed New Zealand captain Tom Latham wants his side to be fearless and take the game to India during the upcoming Test series, which begins on October 16. The India series will be Latham's first assignment as full-time Test captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-england-vs-greece-vangelis-pavlidis-george-baldock-death-wembley-2615050-2024-10-11",
      "headline": "We gave our soul for George Baldock in England win: Greece's Vangelis PavlidisGreece's hero against England, Vangelis Pavlidis, claimed that the entire team gave their soul for George Baldock in their historic win at Wembley on October 10, Thursday. Pavlidis scored a brace as Greece defeated England 2-1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-video-carlos-alcaraz-emotional-davis-cup-2615048-2024-10-11",
      "headline": "Watch: Alcaraz gets emotional seeing Rafael Nadal's retirement announcementCarlos Alcaraz and his team were seen to be emotional as they watched Rafael Nadal's retirement video on October 10, Thursday. Nadal announced that he would be ending his career after the Davis Cup finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abrar-ahmed-hospitalised-after-suffering-from-high-fever-in-multan-test-2615023-2024-10-10",
      "headline": "Abrar Ahmed hospitalised after suffering from high fever in Multan TestPakistan wrist spinner Abrar Ahmed has been hospitalized after suffering from high fever in the ongoing first Test against Pakistan in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-india-clash-pakistan-annabel-sutherland-press-conference-2615021-2024-10-10",
      "headline": "Australia not worried about India clash, focus on Pakistan: SutherlandWomen's T20 World Cup 2024: All-rounder Annabel Sutherland said that Australia haven't discussed about the clash against India and are rather focussed on doing well against Pakistan on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/annabel-sutherland-australia-vs-pakistan-press-conference-2615018-2024-10-10",
      "headline": "Annabel Sutherland, Australia wary of Pakistan 'spin threat'Women's T20 World Cup 2024: Annabel Sutherland said that Australia are aware of the strength of Pakistan's spin attack, comprising Nida Dar, Nashra Sandhu, Tuba Hassan and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-vs-australia-fatima-sana-father-death-muneeba-ali-press-coference-2615003-2024-10-10",
      "headline": "Pakistan will try to beat Australia for Fatima Sana, her father: Muneeba AliWomen's T20 World Cup 2024: in the pre-match press conference, Muneeba Ali said that missing Fatima Sana would affect the team combination, but said that Pakistan would try and beat Australia and dedicate the win to Fatima and her father, who passed away recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-pays-visit-to-injured-musheer-khan-and-his-father-naushad-2614995-2024-10-10",
      "headline": "Rohit Sharma pays visit to injured Musheer Khan and his father NaushadIndia captain Rohit Sharma paid a visit to the injured Mumbai batter Musheer Khan and his father Naushad. Notably, Musheer recently got injured in a car accident ahead of Irani Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-joty-bangladesh-vs-west-indies-record-2614989-2024-10-10",
      "headline": "Joty makes history for Bangladesh with 2000 Women's T20I runsWomen's T20 World Cup 2024: Nigar Sultana Joty reached the landmark of 2000 runs in Women's T20Is, but Bangladesh lost to West Indies by eight wickets in Sharjah on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-comments-on-rafael-nadals-retirement-2614985-2024-10-10",
      "headline": "Novak Djokovic to retiring Rafael Nadal: Will be there in person to pay respectNovak Djokovic wrote a long post for legendary Tennis player Rafael Nadal who announced his retirement from the game on Thursday, October 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-stafanie-taylor-nigar-sultana-joty-report-sharjah-2614953-2024-10-10",
      "headline": "West Indies near semis after thumping 8-wicket win vs Bangladesh Women's T20 World Cup 2024: West Indies beat Bangladesh by eight wickets in Sharjah and stayed in contention for a berth in the semi-final. Karishma Ramharack picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-to-miss-border-gavaskar-trophy-2024-25-2614950-2024-10-10",
      "headline": "Cameron Green set to miss entire Border Gavaskar Trophy: ReportsAustralia all-rounder Cameron Green is likely to miss the entire Border Gavaskar Trophy 2024-25 as he's likely to fly to New Zealand to undergo a surgery for his back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-joty-bangladesh-vs-west-indies-record-2614989-2024-10-10",
      "headline": "Joty makes history for Bangladesh with 2000 Women's T20I runsWomen's T20 World Cup 2024: Nigar Sultana Joty reached the landmark of 2000 runs in Women's T20Is, but Bangladesh lost to West Indies by eight wickets in Sharjah on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-comments-on-rafael-nadals-retirement-2614985-2024-10-10",
      "headline": "Novak Djokovic to retiring Rafael Nadal: Will be there in person to pay respectNovak Djokovic wrote a long post for legendary Tennis player Rafael Nadal who announced his retirement from the game on Thursday, October 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-stafanie-taylor-nigar-sultana-joty-report-sharjah-2614953-2024-10-10",
      "headline": "West Indies near semis after thumping 8-wicket win vs Bangladesh Women's T20 World Cup 2024: West Indies beat Bangladesh by eight wickets in Sharjah and stayed in contention for a berth in the semi-final. Karishma Ramharack picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-to-miss-border-gavaskar-trophy-2024-25-2614950-2024-10-10",
      "headline": "Cameron Green set to miss entire Border Gavaskar Trophy: ReportsAustralia all-rounder Cameron Green is likely to miss the entire Border Gavaskar Trophy 2024-25 as he's likely to fly to New Zealand to undergo a surgery for his back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-joe-root-multan-test-2614923-2024-10-10",
      "headline": "Harry Brook 'lost for words' after 317 in Multan Test, credits Joe RootPAK vs ENG: Harry Brook was lost for words after he became the sixth English batter to score a triple hundred in Test cricket. The right-hander made 317 runs in Multan with 29 fours and three sixes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-may-miss-opening-test-against-australia-reports-2614926-2024-10-10",
      "headline": "Rohit Sharma may miss first Test of Border Gavaskar Trophy in AustraliaRohit Sharma is likely to miss the opening Test of the Border Gavaskar Trophy 2024-25 Trophy against Australia, which is scheduled to take place in Perth from November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-on-rafael-nadals-retirement-shanghai-masters-2614920-2024-10-10",
      "headline": "Carlos Alcaraz reacts to Rafael Nadal's retirement: Tough to accept itWorld number two Tennis player Carlos Alcaraz gave his first reaction on the retirement of his idol Rafael Nadal from the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/arctic-open-lakshya-sen-knocked-out-in-round-of-16-2614887-2024-10-10",
      "headline": "Lakshya Sen knocked out in Round of 16, George loses to ChristieStar Indian shuttler Lakshya Sen was knocked out of the Arctic Open badminton tournament after a hard-fought match against Chou Tien Chen of Chinese Taipei in the pre-quarterfinals on Thursday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}