{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-hailed-as-key-post-brexit-success-by-the-british-media-2761344-2025-07-25",
      "headline": "Remainers will choke on their cornflakes: British media hails India trade dealThe India-UK Free Trade Agreement (FTA) or the Comprehensive Economic and Trade Agreement (CETA) seeks to enhance bilateral trade by around USD 34 billion annually, besides ensuring better market access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ftas-with-eu-us-in-talks-says-commerce-secretary-after-india-uk-trade-deal-2761327-2025-07-25",
      "headline": "FTAs with EU, US in talks, says Commerce Secretary after India-UK trade dealThe agreement now needs to pass through both houses of the British Parliament. A special committee will study it before giving final approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-721-points-lower-nifty-below-24900-bajaj-finance-falls-5-2761243-2025-07-25",
      "headline": "Sensex ends 721 points lower, Nifty below 24,900; Bajaj Finance falls 5%The S&P BSE Sensex was down 721.08 points to 81,463.09 at the closing bell, while the NSE Nifty50 declined 225.10 points to trade at 24,837. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother alleges business coercion, attempt to 'usurp family legacy'Rani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "This key agreement in UK trade deal will hugely benefit Indian firms, workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-has-to-file-itr-by-when-all-2025-deadlines-explained-income-tax-filing-2761076-2025-07-25",
      "headline": "Who has to file ITR by when? All 2025 deadlines explainedFiling your ITR on time can save you from paying extra penalties. But not everyone has the same deadline this year. Here's a quick look at who must file by when for the 2025 cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-why-stock-markets-are-in-the-red-today-2761014-2025-07-25",
      "headline": "Sensex tumbles over 700 points: Why stock markets are in the red today The benchmark S&P BSE Sensex fell 624.64 points to 81,559.53 by 10:41 am, while the NSE Nifty50 slipped 215.85 points to 24,846.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-gain-11-percent-why-reason-q1-results-indian-energy-exchange-stock-up-2761005-2025-07-25",
      "headline": "Explained: Why IEX share price gained 11% todayIEX stock opened at Rs 137.00 today, higher than the previous close of Rs 132.45. It climbed further to touch a high of Rs 149.45 in morning trade. As of 9:37 am, the share was trading at Rs 146.80, up 10.84%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-bajaj-finance-shares-tumbled-up-to-6-percent-despite-strong-q1-results-2761000-2025-07-25",
      "headline": "Explained: Why Bajaj Finance shares tumbled 6% despite strong Q1 resultsThe Bajaj Finance stock was down 5.42% at Rs 907 on the BSE at around 9:28 am, while Bajaj Finserv also fell nearly 5%. Bajaj Finance touched an intraday low of Rs 898.10, marking a 6.3% decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-ipo-check-price-band-gmp-key-dates-issue-size-and-more-2760994-2025-07-25",
      "headline": "NSDL IPO: Check price band, GMP, key dates, issue size and moreThe IPO, a pure offer for sale, aims to raise Rs 4,011 crore. It will open for subscription on July 30 and close on August 1, with anchor bids starting a day earlier on July 29."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-facing-isolation-childhood-not-boy-or-man-enough-labelled-feminine-2761318-2025-07-25",
      "headline": "Karan Johar on being isolated as a kid for being too feminine: Wasn't boy enoughKaran Johar opened up about his childhood struggles with being labelled as feminine. He recalled his challenges as a child in seeking acceptance and belonging from his peers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/s-line-could-just-be-the-most-genius-k-drama-of-2025-sex-secrets-2761153-2025-07-25",
      "headline": "S Line could just be the most genius K-Drama of 2025. Because sex and secrets!Lee Soo-hyuk's 'S Line' blends a provocative premise, sharp social commentary, and gripping mystery. In this week's K-Fix we will discuss why it is 2025's boldest K-drama yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-regrets-making-ok-jaanu-says-felt-uncertain-but-ignored-instincts-2761284-2025-07-25",
      "headline": "Karan Johar regrets making OK Jaanu, says felt uncertain but ignored instinctsKaran Johar expressed regret over making 'OK Jaanu', admitting he ignored his instincts despite feeling uncertain about the remake. The film did not meet expectations, and Johar acknowledges this as a mistake he often makes, even as he prepares for his next production, 'Dhadak 2'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-countdown-begins-makers-annouce-with-1st-promo-eye-logo-2761317-2025-07-25",
      "headline": "All eyes on Bigg Boss 19 as makers officially begin countdown with bold logo'Bigg Boss 19' is all set to premiere this August on JioHotstar. Ahead of its premiere, the makers shared an exciting promo on July 23, to build the intrigue. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-title-track-copied-jubin-nautiyal-one-direction-2761246-2025-07-25",
      "headline": "Is Saiyaara's title track copied from Jubin Nautiyal and One Direction?Fans believe that Saiyaara's title track is copied from songs by One Direction and Jubin Nautiyal. This follows speculation that the movie itself is a remake of the Korean film 'A Moment to Remember'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/cheran-directs-ayya-biopic-ramadoss-1987-vanniyar-reservation-2761305-2025-07-25",
      "headline": "Ayya The Lion of Tamil Nadu: PMK founder Ramadoss's biopic announced with posterDirector Cheran to helm the biopic 'Ayya - The Lion of Tamil Nadu', with Aari Arujunan in the lead role. The film will explore the life of PMK founder Ramadoss and the Vanniyar reservation agitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-sparks-meme-fest-over-bizarre-speedboat-scene-on-f1-track-hrithik-roshan-jr-ntr-2761259-2025-07-25",
      "headline": "War 2 trailer sparks meme fest over bizarre speedboat scene on F1 trackThe trailer of 'War 2' has sparked a wave of amusement and criticism online, especially for a surreal scene featuring a speedboat on a Formula 1 racetrack. The highly-anticipated trailer was released on July 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matt-shakman-vanessa-kirby-pedro-pascal-on-rebooting-fantastic-four-2761300-2025-07-25",
      "headline": "Matt Shakman, Vanessa Kirby, Pedro Pascal on rebooting Fantastic FourMarvel Studios introduces The Fantastic Four: First Steps, a fresh take on the iconic superhero family set in an alternate 1960s universe. The film combines cosmic adventure with heartfelt themes of parenthood and vulnerability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-review-style-swag-and-jarring-bikini-moment-in-hrithik-roshan-jr-ntr-kiara-advani-film-2761277-2025-07-25",
      "headline": "War 2 trailer review: Style, swag and jarring bikini moment in Hrithik-Jr NTR's film'War 2' looks unbelievably stylish, and packed with swag. But is that all? Are we getting another spy film that glorifies that one saviour of the country? And more importantly, what is an Indian Air Force officer doing in a bikini? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-release-date-august-8-2025-supreme-court-clearance-2761285-2025-07-25",
      "headline": "Udaipur Files to release on August 8 after Supreme Court clearanceThe film 'Udaipur Files' is set for release on August 8, 2025 post Supreme Court direction. The decision comes after censor and legal challenges caused a delay to its original release date. Starring Vijay Raaz, it aims to reach a global audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-trailer-x-reaction-fans-praise-hrithik-roshan-jr-ntr-kiara-advani-2761186-2025-07-25",
      "headline": "War 2 trailer X reaction: Fans praise Hrithik Roshan, Jr NTR, Kiara's action festThe 'War 2' trailer starring Hrithik Roshan, Jr NTR, and Kiara Advani has earned praise online. Fans are excited for the Hrithik-Jr NTR showdown and Kiara's action-packed role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hulk-hogan-wrestling-legend-dies-aged-71-celebrities-pay-tribute-varun-dhawan-arjun-kapoor-the-rock-brooke-shields-2761127-2025-07-25",
      "headline": "Varun Dhawan to Arjun Kapoor, celebs mourn WWE icon Hulk Hogan's deathWWE star Hulk Hogan died aged 71 after suffering a cardiac arrest at his home in Florida. Actors Varun Dhawan, Arjun Kapoor and others paid tribute to the wrestling icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-prime-video-this-weekend-2761227-2025-07-25",
      "headline": "Top films and shows to watch on Prime Video this weekendStill thinking about what to watch this weekend? Here's a list of new films and series you can watch on Prime Video this weekend. This includes 'Rangeen', 'Kannappa', episode 3 of 'The Summer I Turned Pretty season 2', and more.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/thalaivan-thalaivii-review-vijay-sethupathi-pandiraaj-nithya-menen-loud-regressive-film-anti-divorce-stance-2761199-2025-07-25",
      "headline": "Thalaivan Thalaivii review: Loud, regressive film with anti-divorce stanceRelease Date:Fri Jul 25, 2025Thalaivan Thalaivii movie review: Director Pandiraaj's 'Thalaivan Thalaivii', starring Vijay Sethupathi and Nithya Menen, is a noisy family drama that promotes and glorifies regressive ideas. The film ridicules divorce and people who opt for it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-7-detailed-report-what-a-fascinating-1st-week-for-ahaan-panday-aneet-padda-love-story-2761173-2025-07-25",
      "headline": "Saiyaara box office Day 7: What a fascinating 1st week for Ahaan-Aneet's love story!YRF's 'Saiyaara' has made the audience rush to theatres. The Ahaan Panday and Aneet Padda starrer finished its glorious first week at the box office, and performed so well that every day seemed like a celebration in cinema halls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-sreeleela-bobby-deol-team-new-film-title-to-be-out-soon-2761146-2025-07-25",
      "headline": "Ranveer Singh, Sreeleela, Bobby Deol team up for new film, title to be out soonRanveer Singh, Sreeleela and Bobby Deol are set to team up for a new film. The title and first look of the upcoming project will be out next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-collection-day-1-detailed-report-pawan-kalyan-film-beats-vakeel-saab-for-biggest-opening-of-career-2761140-2025-07-25",
      "headline": "Hari Hara Veera Mallu box office Day 1: Pawan Kalyan's film beats Vakeel SaabPawan Kalyan's film 'Hari Hara Veera Mallu' breaks records with Rs 44 crore opening day collection, surpassing the opening record of his previous hit, 'Vakeel Saab'. Here's how the film fared on its first day at the box office in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-x-review-marvel-new-film-masterpiece-vanessa-kirby-pedro-pascal-2761023-2025-07-25",
      "headline": "Fantastic Four First Steps X review: Fans praise MCU's strongest masterpiece yetMarvel's 'The Fantastic Four: First Steps' released in theatres today with mixed reviews. Fans praised the stellar performances of the actors Vanessa Kirby and Pedro Pascal, who stand out in the film."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/narendra-modi-not-a-big-problem-rahul-gandhi-says-pm-is-all-optics-no-substance-2761247-2025-07-25",
      "headline": "Narendra Modi not a big problem: Rahul Gandhi says PM is all show, no substanceRahul Gandhi claimed that after meeting PM Modi two to three times and \"sitting with him in the same room,\" he had figured that the Prime Minister was never a \"big problem.\" He then went on to say, \"Dum nahin hai\" (He doesn't have guts)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/muizzu-by-his-side-pm-gets-21-gun-salute-at-maldives-independence-day-event-2761241-2025-07-25",
      "headline": "Muizzu by his side, PM gets 21-gun salute at Maldives Independence Day event  Live UpdatesPrime Minister Narendra Modi, who landed in Male, Maldives on Friday to attend the 60th Independence Day celebrations of the country, was welcomed with a 21-gun salute at the event. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother alleges business coercion, attempt to 'usurp family legacy'Rani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: Sundar gets Pope as India get breakthroughIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: Right after lunch, Washington Sundar has got the breakthrough for India. He gets the wicket of the well-set Ollie Pope to end the stand with Joe Root. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-nuke-scare-cia-nanda-devi-nuclear-device-itbp-himalayas-1965-mission-uttarakhand-china-test-guru-rinpoche-2761183-2025-07-25",
      "headline": "How an India-US spy mission lost a nuclear device in the HimalayasAfter China's first atomic test, the US and India, as part of a covert operation, tried to place a nuclear-powered listening device at 25,000 feet in the Himalayas near the Nanda Devi peak. A blizzard forced the CIA-IB team to leave the device on the route. A recovery mission, and several search operations, failed to locate the device."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-girl-raped-for-months-three-accused-try-to-bury-her-alive-knowing-she-is-pregnant-2761291-2025-07-25",
      "headline": "3 men rape Odisha girl, try to bury her alive after finding out she's pregnantThe three accused raped the girl for months on several occasions and tried to bury her alive when they found out that she was five-months pregnant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-government-mea-raises-indian-students-visa-delays-issue-with-us-state-department-embassy-kirti-vardhan-singh-2761200-2025-07-25",
      "headline": "US visa delays for students: India takes up issue with State Dept, EmbassyThe MEA has raised concerns with the US over student visa appointment delays affecting Indian students, following expanded American screening measures. MoS for External Affairs Kirti Vardhan Singh said that while the issuance of visas is a sovereign prerogative, India has consistently raised the issues being faced by students with the US Embassy in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-cag-is-alarmed-by-maharashtras-off-budget-borrowings-2760687-2025-07-24",
      "headline": "Why CAG is alarmed by Maharashtra's off-Budget borrowingsThe statutory auditor, in its report, cautioned that continuing with the trend could worsen the debt/GSDP ratio, reducing the government's fiscal flexibility"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-working-on-deploying-six-helicopters-on-mars-all-about-skyfall-2761293-2025-07-25",
      "headline": "Skyfall: Nasa's ambitious plan to deploy six helicopters on MarsThese helicopters will assist in scouting safe landing zones for future robotic missions and, crucially, America's first Martian astronauts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-release-date-august-8-2025-supreme-court-clearance-2761285-2025-07-25",
      "headline": "Udaipur Files to release on August 8 after Supreme Court clearanceThe film 'Udaipur Files' is set for release on August 8, 2025 post Supreme Court direction. The decision comes after censor and legal challenges caused a delay to its original release date. Starring Vijay Raaz, it aims to reach a global audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-a-53-year-old-rape-convict-man-will-be-sentenced-as-a-juvenile-explained-2761245-2025-07-25",
      "headline": "Explained: Why a 53-year-old rape convict will be sentenced as a juvenileA 53-year-old man convicted of raping a minor in 1988 will be sentenced as a juvenile, the Supreme Court of India ruled. This explainer delves into why this ruling was made, highlighting the application of India's Juvenile Justice laws. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-hailed-as-key-post-brexit-success-by-the-british-media-2761344-2025-07-25",
      "headline": "Remainers will choke on their cornflakes: British media hails India trade dealThe India-UK Free Trade Agreement (FTA) or the Comprehensive Economic and Trade Agreement (CETA) seeks to enhance bilateral trade by around USD 34 billion annually, besides ensuring better market access."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-title-track-copied-jubin-nautiyal-one-direction-2761246-2025-07-25",
      "headline": "Is Saiyaara's title track copied from Jubin Nautiyal and One Direction?Fans believe that Saiyaara's title track is copied from songs by One Direction and Jubin Nautiyal. This follows speculation that the movie itself is a remake of the Korean film 'A Moment to Remember'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-test-runs-third-all-time-list-dravid-kallis-2761299-2025-07-25",
      "headline": "Joe Root surpasses Rahul Dravid to become third-highest run-scorer in Test cricketEngland vs India: Joe Root went past Jacques Kallis and Rahul Dravid on the all-time Tests scorers list when he went past 30 on Day 3 of the Manchester Test. Root is now only behind Sachin Tendulkar and Ricky Ponting on the elite list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/isha-jajodias-icw-2025-collection-charts-a-womans-journey-into-power-2761298-2025-07-25",
      "headline": "Isha Jajodia's ICW 2025 collection charts a woman's journey into powerIsha Jajodia's new collection, Whispers of Love To Myself, presented at Hyundai India Couture Week 2025, brought together a modern, unvarnished take on femininity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-review-vaani-kapoor-ambitious-thriller-dares-to-dig-deep-but-loses-its-way-2761160-2025-07-25",
      "headline": "Mandala Murders Review: An ambitious thriller that dares to dig deep, but loses its wayRelease Date:Fri Jul 25, 2025Mandala Murders series review: 'Mandala Murders', Netflix's latest Hindi thriller, weaves Indian mythology and crime in a gripping yet uneven narrative set in Uttar Pradesh. While rich in atmosphere and performances, the series struggles with pacing and clarity, making it a one-time watch for thriller enthusiasts in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-looming-google-earth-lens-how-indias-strategic-assets-lie-exposed-vulnerable-to-harm-2760192-2025-07-23",
      "headline": "How India's strategic assets lie exposed, vulnerable to harmWith detailed imagery of military bases, nuclear plants, border posts and more easily accessible to Open Source Intelligence, how dangerous is this for national security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-vp-jagdeep-dhankar-saved-salman-khan-blackbuck-case-jail-poaching-bailsaif-ali-khan-sonali-bendre-2761144-2025-07-25",
      "headline": "When Dhankhar got Salman Khan bail in blackbuck caseJagdeep Dhankhar resigned from the Vice-President's post, citing his health. Before becoming the Veep, Dhankhar was a seasoned lawyer who also represented actor Salman Khan in the 1998 blackbuck poaching case and helped him and other accused secure bail."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ayodhya-elderly-woman-deserted-by-family-in-up-dies-during-treatment-in-hospital-2761335-2025-07-25",
      "headline": "Caught on CCTV: Sick elderly woman dumped by family on roadside in Ayodhya, diesCCTV footage showed a man, most likely an e-rickshaw driver, helping two women drop the elderly woman by the roadside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/suneet-varmas-sehr-casts-a-couture-spell-at-india-couture-week-2025-2761209-2025-07-25",
      "headline": "Suneet Varma's Sehr casts a couture spell at ICW 2025From bold headgear to elaborate designs, Suneet Varma captivated India Couture Week 2025 with a collection inspired by the magical twilight hour and the mysteries of an enchanted forest. Blending romance, drama, and fantasy, he brought a dreamlike elegance to the runway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/ankiva-fall-12th-floor-vasai-east-child-safety-high-rise-thane-2761192-2025-07-25",
      "headline": "Placed atop shoe rack near window ledge, girl, 4, falls to death from 12th floorA four-year-old girl in Thane died after falling from the 12th floor while sitting on a window ledge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "This key agreement in UK trade deal will hugely benefit Indian firms, workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/paralysed-indore-school-teacher-has-sought-permission-from-president-droupadi-murmu-to-undergo-euthanasia-2761328-2025-07-25",
      "headline": "Unbearable pain: Paralysed Indore teacher seeks President's nod for euthanasiaKumari Chandrakanta Jethani  who teaches daily while confined to a wheelchair, is battling severe physical ailments. Teaching for 7 to 8 hours a day in such a condition has become extremely painful for her"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-facing-isolation-childhood-not-boy-or-man-enough-labelled-feminine-2761318-2025-07-25",
      "headline": "Karan Johar on being isolated as a kid for being too feminine: Wasn't boy enoughKaran Johar opened up about his childhood struggles with being labelled as feminine. He recalled his challenges as a child in seeking acceptance and belonging from his peers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/s-line-could-just-be-the-most-genius-k-drama-of-2025-sex-secrets-2761153-2025-07-25",
      "headline": "S Line could just be the most genius K-Drama of 2025. Because sex and secrets!Lee Soo-hyuk's 'S Line' blends a provocative premise, sharp social commentary, and gripping mystery. In this week's K-Fix we will discuss why it is 2025's boldest K-drama yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-regrets-making-ok-jaanu-says-felt-uncertain-but-ignored-instincts-2761284-2025-07-25",
      "headline": "Karan Johar regrets making OK Jaanu, says felt uncertain but ignored instinctsKaran Johar expressed regret over making 'OK Jaanu', admitting he ignored his instincts despite feeling uncertain about the remake. The film did not meet expectations, and Johar acknowledges this as a mistake he often makes, even as he prepares for his next production, 'Dhadak 2'.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-title-track-copied-jubin-nautiyal-one-direction-2761246-2025-07-25",
      "headline": "Is Saiyaara's title track copied from Jubin Nautiyal and One Direction?Fans believe that Saiyaara's title track is copied from songs by One Direction and Jubin Nautiyal. This follows speculation that the movie itself is a remake of the Korean film 'A Moment to Remember'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-batter-veda-krishnamurthy-announces-retirement-from-professional-cricket-2761348-2025-07-25",
      "headline": "India batter Veda Krishnamurthy announces retirement from professional cricketIndia batter Veda Krishnamurthy announced her retirement from professional cricket on Friday, July 25. Krishnamurthy was known for her explosive batting in the middle-order and was part of India's 2017 World Cup squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-tour-of-west-indies-squads-shaheen-shah-afridi-2761325-2025-07-25",
      "headline": "Shaheen Afridi makes T20I return as Pakistan announce West Indies tour squadsShaheen Shah Afridi has made a return to the T20I side as Pakistan announced their squads for the upcoming tour of the West Indies. Pakistan will play 3 ODIs and 3 T20Is against West Indies, starting on July 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-appointed-up-warriorz-head-coach-wpl-2025-2761290-2025-07-25",
      "headline": "Abhishek Nayar named UP Warriorz head coach for WPL season 4Abhishek Nayar has been named head coach of UP Warriorz ahead of the WPL season 4. His appointment aims to strengthen the team and nurture domestic talent for a title challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-viktor-gyokeres-agreement-no-14-shirt-transfer-news-2761306-2025-07-25",
      "headline": "Arsenal reach full agreement for Viktor Gyokeres, set to take iconic No.14: ReportArsenal have reportedly had a final agreement with Sporting CP regarding the transfer of Viktor Gyokeres. He is set to switch to the London-based club and even don the iconic No.14 shirt as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-test-runs-third-all-time-list-dravid-kallis-2761299-2025-07-25",
      "headline": "Joe Root surpasses Rahul Dravid to become third-highest run-scorer in Test cricketEngland vs India: Joe Root went past Jacques Kallis and Rahul Dravid on the all-time Tests scorers list when he went past 30 on Day 3 of the Manchester Test. Root is now only behind Sachin Tendulkar and Ricky Ponting on the elite list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-bhuvneshwar-kumar-dukes-ball-debate-cricket-change-manchester-test-2761270-2025-07-25",
      "headline": "Cricket has changed quite a bit: Bhuvneshwar weighs in on Dukes ball debateBhuvneshwar Kumar suggested that multiple factors could be in play for the Dukes ball to not provide the expected levels of movement in the ongoing Test series between England and India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hemang-badani-england-vs-india-manchester-2761256-2025-07-25",
      "headline": "Rishabh Pant is someone who can lead India in the future: Hemang BadaniENG vs IND: Hemang Badani said that Rishabh Pant has excellent leadership qualities and can be India's captain in the future. Pant conjured cheers from the cricket fraternity for batting with a broken toe on the second day at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-manchester-test-england-trying-to-win-bazball-evolution-steve-smith-2761218-2025-07-25",
      "headline": "England trying to win, not be entertainers: Steve Smith sees evolution in BazballSteve Smith reckons that England may have evolved from trying to entertain the crowd to winning games as seen in the ongoing Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: India in dire need of a miracle at LunchIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: At the end of the first session, India ended up wicketless with the fast bowlers unable to get the breakthrough. So far, it has been a dominating show by Joe Root and Ollie Pope as both men eye a big total after scoring their respective fifties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-anshul-kamboj-r-ashwin-england-vs-india-4th-test-2761191-2025-07-25",
      "headline": "Shubman's decision to give Kamboj new ball highly debatable: AshwinENG vs IND: Ravichandran Ashwin has backed Indian skipper Shubman Gill's decision to hand the new ball to Anshul Kamboj, citing the debutant's skillset and expressing hope that the youngster will take wickets on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-hemang-badani-england-vs-india-manchester-2761256-2025-07-25",
      "headline": "Rishabh Pant is someone who can lead India in the future: Hemang BadaniENG vs IND: Hemang Badani said that Rishabh Pant has excellent leadership qualities and can be India's captain in the future. Pant conjured cheers from the cricket fraternity for batting with a broken toe on the second day at Old Trafford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-manchester-test-england-trying-to-win-bazball-evolution-steve-smith-2761218-2025-07-25",
      "headline": "England trying to win, not be entertainers: Steve Smith sees evolution in BazballSteve Smith reckons that England may have evolved from trying to entertain the crowd to winning games as seen in the ongoing Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-3-updates-manchester-bumrah-stokes-2761203-2025-07-25",
      "headline": "4th Test Day 3 Live: India in dire need of a miracle at LunchIndia (IND) vs England (ENG), 4th Test, Day 3 Live Score and Updates: At the end of the first session, India ended up wicketless with the fast bowlers unable to get the breakthrough. So far, it has been a dominating show by Joe Root and Ollie Pope as both men eye a big total after scoring their respective fifties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-anshul-kamboj-r-ashwin-england-vs-india-4th-test-2761191-2025-07-25",
      "headline": "Shubman's decision to give Kamboj new ball highly debatable: AshwinENG vs IND: Ravichandran Ashwin has backed Indian skipper Shubman Gill's decision to hand the new ball to Anshul Kamboj, citing the debutant's skillset and expressing hope that the youngster will take wickets on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dc-open-emma-raducanu-naomi-osaka-venus-williams-round-of-16-results-2761182-2025-07-25",
      "headline": "DC Open: Raducanu dominates Osaka, Venus Williams defeated in pre-quartersEmma Raducanu cruised past Naomi Osaka 6-4, 6-2 to reach the Washington Open quarter-finals and reclaim the British No. 1 spot. Venus Williams' comeback ended with a straight-sets loss to Magdalena Frech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-aakash-chopra-england-vs-india-manchester-test-2761149-2025-07-25",
      "headline": "Pant wasn't even able to walk: Chopra hails batter's unbreakable spiritENG vs IND, 4th Test: Rishabh Pant showed incredible courage by batting with a fractured toe during the fourth Test against England. Former cricketer Aakash Chopra praised his spirit, calling it inspiring and unforgettable. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-needs-virat-kohli-mentality-test-series-comeback-manchester-2761123-2025-07-25",
      "headline": "Need that Virat Kohli mentality: Gill urged to lead India's series comebackENG vs IND: Michael Vaughan feels that Shubman Gill and Co need to channel in that Virat Kohli mentality to lead a fightback on Day 3 of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-england-vs-india-manchester-test-2761115-2025-07-25",
      "headline": "Not one backup middle-order batter: Chopra questions India's squad balanceENG vs IND, 4th Test: Aakash Chopra raised concerns about India's lack of middle-order depth after Day 2 of the fourth Test. While the visitors struggled with their batting balance, Ben Stokes and Jofra Archer's standout performances helped keep England in the game with a disciplined effort.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-rishabh-pant-jofra-archer-manchester-test-2761071-2025-07-25",
      "headline": "Just not cricket: Should Stokes and Archer have attacked Pant's broken toe?ENG vs IND, 4th Test: Rishabh Pant sustained a toe injury on Day 1 at Old Trafford, but the left-handed batter returned to score a gutsy half-century on the second day, helping India put up a score of 358 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ravi-shastri-england-vs-india-4th-test-2761054-2025-07-25",
      "headline": "If Rishabh Pant's bravery doesn't lift India, nothing will: Ravi ShastriENG vs IND, 4th Test: Rishabh Pant showed grit and came out to bat in Manchester despite a toe injury. He scored 54 runs and helped India put up 358 on the board in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-applicant-aiff-head-coaching-job-vacancy-2761044-2025-07-25",
      "headline": "Barcelona legend Xavi applies for coaching role, AIFF rejects: ReportThe AIFF was left stumped after the legendary Spanish midfielder, Xavi Hernandez had applied for the role of India's new head coach after Manolo Marquez's departure from the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-kuldeep-yadav-england-vs-india-manchester-2761015-2025-07-25",
      "headline": "Obsession with batting: Ashwin slams India for underutilising KuldeepENG vs IND, 4th Test: Former Indian spinner R Ashwin questioned India's priorities in the series against England, urging the team to value wicket-taking ability over marginal lower-order runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-rishabh-pant-jofra-archer-manchester-test-2761071-2025-07-25",
      "headline": "Just not cricket: Should Stokes and Archer have attacked Pant's broken toe?ENG vs IND, 4th Test: Rishabh Pant sustained a toe injury on Day 1 at Old Trafford, but the left-handed batter returned to score a gutsy half-century on the second day, helping India put up a score of 358 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ravi-shastri-england-vs-india-4th-test-2761054-2025-07-25",
      "headline": "If Rishabh Pant's bravery doesn't lift India, nothing will: Ravi ShastriENG vs IND, 4th Test: Rishabh Pant showed grit and came out to bat in Manchester despite a toe injury. He scored 54 runs and helped India put up 358 on the board in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-applicant-aiff-head-coaching-job-vacancy-2761044-2025-07-25",
      "headline": "Barcelona legend Xavi applies for coaching role, AIFF rejects: ReportThe AIFF was left stumped after the legendary Spanish midfielder, Xavi Hernandez had applied for the role of India's new head coach after Manolo Marquez's departure from the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-kuldeep-yadav-england-vs-india-manchester-2761015-2025-07-25",
      "headline": "Obsession with batting: Ashwin slams India for underutilising KuldeepENG vs IND, 4th Test: Former Indian spinner R Ashwin questioned India's priorities in the series against England, urging the team to value wicket-taking ability over marginal lower-order runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-tactics-ricky-ponting-jasprit-bumrah-bowling-end-manchester-test-2761011-2025-07-25",
      "headline": "Shubman Gill's tactics slammed by Ponting: Bumrah bowled from wrong endRicky Ponting was heavily critical of Shubman Gill's captaincy on Day 2 of the Manchester Test. The former Australian skipper reckons that Gill has gotten it wrong tactically giving England a quick start in the first innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-england-nasser-hussain-manchester-2760969-2025-07-25",
      "headline": "Poor India handed Rishabh Pant's runs back to England: Nasser HussainENG vs IND, 4th Test: Nasser Hussain said that India were poor in their tactics on Day 2, allowing England to dominate in the ongoing Test at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-yash-dayal-sexual-harrasment-case-trouble-2760979-2025-07-25",
      "headline": "Yash Dayal in more trouble, faces another sexual harassment caseAn FIR has been registered against cricketer Yash Dayal after a woman accused him of sexually assaulting her over two years, allegedly using emotional manipulation and false promises of helping her build a cricket career to exploit her.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zak-crawley-shubman-gill-lords-test-manchester-press-conference-2760956-2025-07-25",
      "headline": "It wasn't intentional: Crawley hits back at Shubman's 90 seconds claimENG vs IND, 4th Test: England opener Zak Crawley responded to Shubman Gill's claims that England were 90 seconds late to come out to bat in their second innings of the Lord's Test. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pants-pain-bearing-capacity-is-immense-shardul-thakur-2760919-2025-07-25",
      "headline": "Rishabh Pant's pain-bearing capacity is high, spirit unmatched: Shardul ThakurIndia all-rounder Shardul Thakur hailed Rishabh Pant for his immense pain-bearing capacity as the wicketkeeper-batter battled through a toe fracture to bat for the team during the fourth Test at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-manchester-test-injury-substitutes-system-drs-2760922-2025-07-25",
      "headline": "DRS: Is it time for injury replacements in cricket?Rishabh Pant braved the pain to come out and bat for India on Day 2 of the Manchester Test after suffering a broken toe. While Pant won hearts with his bravery, was it a move that was necessary? Could we have a system where a substitute for a seriously injured player can be brought in to maintain the balance between both sides? In the latest edition of India Today's Democratic Review System, we discuss whether substitutes are needed in cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/hulk-hogan-death-john-cena-triple-h-ric-flair-tribute-2760911-2025-07-25",
      "headline": "Hulk Hogan dies: Cena, Triple H and wrestling world mourn death of WWE legendJohn Cena, Triple H and the wrestling world paid their tributes to Hulk Hogan after the WWE Hall Of Famer passed away on Thursday, July 24. Hogan leaves behind a rich legacy as one of the greatest of all time in wrestling history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-slams-41-ball-century-vs-england-champions-in-wcl-2760907-2025-07-25",
      "headline": "AB de Villiers goes berserk, slams 41-ball century vs England Champions in WCLSouth Africa Champions captain AB de Villiers clobbered a 41-ball hundred during Match 8 of the World Championship of Legends (WCL) against England Champions and guided them to a 10-wicket win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-4th-test-day-2-rishabh-pant-fight-indian-bowlers-manchester-2760878-2025-07-24",
      "headline": "Manchester Test: Injured Pant puts up brave fight, but bowlers drop the ballManchester Test, Day 2: Rishabh Pant showed great courage batting with a fractured toe to push India's total past 350. However, India's bowling unit failed to contain England as they reduced the deficit significantly by stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-6th-t20i-report-tim-seifert-ish-sodhi-2760876-2025-07-24",
      "headline": "Seifert, Rachin and Sodhi help New Zealand thump Zimbabwe before finalTim Seifert and Ish Sodhi starred as New Zealand defeated Zimbabwe by 60 runs in the tri-series. The win keeps New Zealand unbeaten and gain momentum ahead of their final against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-reaches-final-faces-divya-deshmukh-all-indian-womens-world-cup-2760871-2025-07-24",
      "headline": "Koneru Humpy sets up historic all-Indian Women's World Cup final vs Divya DeshmukhGrandmaster Koneru Humpy advanced to the final of the FIDE Women's World Cup after a thrilling tiebreak victory over China's Lei Tingjie. She will face 19-year-old Divya Deshmukh in the first-ever all-Indian final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-3rd-t20i-score-shahibzada-farhan-2760867-2025-07-24",
      "headline": "Pakistan avoid embarrassing clean sweep in Bangladesh, win 3rd T20I in DhakaBAN vs PAK, 3rd T20I: Pakistan rode on a quick-fire 63 from Sahibzada Farhan and an all-round bowling effort to hammer Bangladesh by 74 runs and avoid a clean sweep in Dhaka. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}