{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adidas-puma-rivalry-dassler-brothers-history-sibling-feud-adolf-rudolf-succession-war-2611900-2024-10-06",
      "headline": "Succession Wars: Sibling rivalry that led to the birth of Adidas and PumaAdolf 'Adi' Dassler and Rudolf Dassler, transformed the world of sports footwear through innovation, ambition, and intense sibling rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-flight-restrictions-lifted-iran-safe-conditions-2612311-2024-10-07",
      "headline": "Iran lifts flight restrictions after ensuring safe conditionsFlight restrictions have been lifted in Iran after conditions were deemed safe, state media reported on Monday, shortening the period of flight cancellations announced earlier by the Civil Aviation Organisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-indian-air-force-airshow-2024-lakhs-of-people-stranded-on-streets-without-water-2612186-2024-10-06",
      "headline": "3 spectators dead at Chennai air show, 230 hospitalised due to dehydrationChennai Air Show: The air show, which aimed to enter the Limca Book of World Records by gathering around 16 lakh people, began at 11 am and continued until 1 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/massive-blast-karachi-airport-city-pakistan-2612310-2024-10-07",
      "headline": "1 killed, 10 injured in explosion near Karachi airportPeople in Karachi could see plumes of smoke billowing after hearing a loud sound as a massive blast near the airport area rocked the city. At least four people were reportedly injured in the blast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-1st-t20i-report-gwalior-mayank-varun-arshdeep-2612264-2024-10-06",
      "headline": "Young India blow away Bangladesh in Gwalior for 1-0 series leadIndia vs Bangladesh, 1st T20I: Mayank Yadav, Varun Chakravarthy and Arshdeep Singh starred with the ball to help India beat Bangladesh by seven wickets in Gwalior. India chased down the 128-run target with 49 balls to spare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/is-meal-prep-a-good-idea-in-india-2609472-2024-10-06",
      "headline": "Is meal prep a good idea in India? Meal prepping, in simple terms, is the practice of planning, preparing, and cooking meals in bulk ahead of time, so you have ready-to-eat food throughout the week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-cancels-flights-israel-october-7-hamas-attack-anniversay-gaza-palestine-hezbollah-lebanon-2612283-2024-10-06",
      "headline": "Iran cancels flights overnight as threat of Israeli strikes looms largeFlights from all Iran's airports will remain cancelled from 9 pm on Sunday till 6 am on Monday (11 pm-8 am IST). The move comes on the first anniversary of the October 7 attacks, when Gaza-based terror group Hamas launched armed incursions into southern Israel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bisleri-fake-water-bottle-baghpat-dm-bilseri-bulldozer-uttar-pradesh-counterfeit-products-2612216-2024-10-06",
      "headline": "'Bilseri' water served to UP Collector at police event. Bulldozer action followedAuthorities in Uttar Pradesh's Baghpat district conducted a bulldozer action on a fake bottled water racket, imitating the original brand -- Bisleri -- during a raid led by the District Magistrate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mass-shooting-bus-station-in-israel-beersheba-attacker-killed-dead-injured-2612189-2024-10-06",
      "headline": "One cop dead, 10 injured in mass shooting at bus station in Israel's BeershebaOne person was killed, and 10 others were injured in a terror attack at Beersheba's central bus station in Israel on Sunday, according to Israeli police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ola-ceo-bhavish-aggarwal-comedian-kunal-kamra-clash-electric-vehicle-ev-2612151-2024-10-06",
      "headline": "Sit quiet: Bhavish Aggarwal after comedian Kunal Kamra flags issues with Ola EVsOla CEO Bhavish Aggarwal and stand-up comic Kunal Kamra exchanged verbal volleys on social media platform X after the latter highlighted issues with the Bengaluru-based company's electric vehicles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-conflict-rocket-gaza-october-7-anniversary-palestine-middle-east-conflict-2612240-2024-10-06",
      "headline": "Rockets fired from Gaza cross into Israel day before Hamas attack anniversaryAs tensions escalate between Israel and Gaza, global protests intensify, demanding an end to the violence, while the world braces for the one-year anniversary of Hamas's deadly October 7 attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-fatima-sana-harmanpreet-kaur-report-dubai-2612213-2024-10-06",
      "headline": "T20 World Cup: India fend off resurgent Pakistan to secure hard-fought winWomen's T20 World Cup 2024: Harmanpreet Kaur's India secured their maiden win of the tournament after beating Pakistan by six wickets on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-grand-premiere-live-salman-khan-returns-host-unique-theme-time-ka-taandav-jio-cinema-colors-tv-2612140-2024-10-06",
      "headline": "Bigg Boss 18 Grand Premiere Highlights: Salman Khan welcomes contestants Bigg Boss 18 Grand Premiere Highlights: Salman Khan's reality show Bigg Boss is back with season 18. The new season features 18 contestants entering the house, where tempers will flare, patience will be tested, and mind games will unfold as they compete to win.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/qantas-flight-sexually-explicit-film-daddio-on-plane-passengers-airlines-apologises-2612289-2024-10-06",
      "headline": "Japan-bound flight plays erotic film for all passengers with no option to switchThe in-flight entertainment system on a Qantas flight from Sydney to Haneda (Japan) was impacted by technical issues which led to the broadcast of an explicit movie for all passengers onboard. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-shahjahanpur-mbbs-student-found-dead-hostel-up-police-probe-suicide-foul-play-2612221-2024-10-06",
      "headline": "Medical student found dead on campus under suspicious circumstances in UPThe student, identified as Kushagra Pratap Singh, was found lying in a pool of blood outside his hostel room early in the morning, according to the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chinese-spy-balloon-exercise-indian-air-force-rafale-jet-eastern-command-2612239-2024-10-06",
      "headline": "Air Force demonstrates ability to shoot down Chinese spy balloon-type objectsThe operation took place a few months ago using a Rafale fighter jet under the Eastern Air Command's area of responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/un-like-old-company-not-entirely-keeping-up-with-market-jaishankar-2612268-2024-10-06",
      "headline": "UN like 'old company', not entirely keeping up with market: JaishankarS Jaishankar said the UN was \"like an old company\", not entirely keeping up with the market and doesn't take steps on key issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-aniruddhacharya-find-a-bride-for-salman-khan-2612235-2024-10-06",
      "headline": "Aniruddhacharya promises to find Salman Khan a bride 'who won't run away'In a recent Bigg Boss 18 promo, Aniruddhacharya, also known as Pookie Baba, jokingly told Salman Khan that he would find him a bride. The new season will premiere tonight at 9 pm on Colors TV. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-424-04-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/maldives-india-president-mohamed-muizzu-bilateral-talks-india-visit-draupadi-murmu-pm-modi-2612131-2024-10-06",
      "headline": "Maldives President Muizzu meets S Jaishankar in Delhi day before talks with PMDuring his visit to India from October 6 to October 10, Maldivian President Mohamed Muizzu will meet President Droupadi Murmu and hold discussions with Prime Minister Narendra Modi on bilateral, regional, and international issues of mutual interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-yogi-adityanath-plays-cricket-tries-hand-at-batting-in-lucknow-2612251-2024-10-06",
      "headline": "Watch: Yogi Adityanath plays cricket, tries hand at batting in LucknowA lighter side of Uttar Pradesh Chief Minister Yogi Adityanath was on display when he picked up a bat and played cricket at Lucknow's Ekana Stadium on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-mani-ratnam-to-collaborate-after-33-years-for-a-film-after-halapathi-report-2612225-2024-10-06",
      "headline": "Rajinikanth, Mani Ratnam to collaborate after 33 years for a film: ReportRajinikanth and director Mani Ratnam are reportedly teaming up for a new film after 33 years. The official announcement is anticipated on Rajinikanth's birthday, stirring excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/sonagachi-durga-puja-kolkata-soil-sex-workers-tradition-rg-kar-protest-2611715-2024-10-06",
      "headline": "How a Durga Puja link to red-light districts is fast becoming historyThe age-old tradition of soil from a red-light district being used for making Durga idols was depicted in Shah Rukh Khan-starrer Devdas. It came as a revelation to millions of people in India. The custom is mentioned in the Puranas and is also associated with Lord Ram. However, 'punya mati' has been commercialised now, and the tradition is on the wane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-police-officer-sexual-molestation-female-civic-volunteer-park-street-police-station-2612192-2024-10-06",
      "headline": "Case against Kolkata cop after woman civic volunteer alleges molestationIn her complaint, the woman claimed that the cop called her to the resting room and offered her a salwar suit as a gift for Durga Puja. He then tried to make advances towards her and touched her inappropriately, she claimed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/irans-quds-force-leader-missing-after-israeli-strike-in-beirut-reports-2612198-2024-10-06",
      "headline": "Iran's Quds Force leader missing after Israeli strike in Beirut: ReportsAccording to reports, the Israeli airstrikes in Beirut's southern suburb Dahiyeh were targeted at Hashem Safieddine, the successor to slain Hezbollah chief Hassan Nasrallah. Esmail Qaani was also reportedly present in Dahiyeh at the time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/tajinder-pal-singh-bagga-bjp-leader-bigg-boss-18-salman-khan-2612307-2024-10-07",
      "headline": "All about Tajinder Pal Bagga, BJP leader now part of Bigg Boss 18BJP leader Tajinder Pal Singh Bagga is among the contestants in Salman Khan's Bigg Boss 18. This article delves into Bagga's political journey and explores how his time on the reality show may unfold.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-london-concert-gajraj-rao-2612306-2024-10-07",
      "headline": "Diljit Dosanjh greets Gajraj Rao at London concert, actor kisses his handIn a viral video from Diljit Dosanjh's London concert, the singer is seen greeting and bowing to veteran actor Gajraj Rao. Gajraj shared several videos and images from the concert and expressed his gratitude to the singer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-shehzada-dhami-rajan-shahi-yeh-rishta-kya-kehtlata-hai-humiliating-him-2612278-2024-10-06",
      "headline": "Bigg Boss 18: Shehzada Dhami accuses Yeh Rishta… makers of humiliating himTV actor Shehzada Dhami slammed Yeh Rishta Kya Kehlata Hai makers for 'publicly humiliating' him on the sets. He also spoke about director-producer Rajan Shahi's unprofessional behaviour towards him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-marathi-5-winner-is-suraj-chavan-takes-home-trophy-and-rs-146-lakh-prize-money-2612234-2024-10-06",
      "headline": "Bigg Boss Marathi 5 winner is Suraj ChavanSuraj Chavan was crowned the winner of Bigg Boss Marathi 5. The actor claimed the coveted trophy and a cash prize of Rs 14.6 lakh.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-t20i-varun-chakravarthy-on-dream-comeback-2612291-2024-10-06",
      "headline": "Feels like rebirth: Varun Chakravarthy on dream comeback vs BangladeshVarun Chakravarthy termed his sensational comeback to the India squad as a rebirth after finishing with a match-winning haul of 3 for 31 in the first T20I vs Bangladesh in Gwalior, on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-arundhati-reddy-press-conference-2612290-2024-10-06",
      "headline": "India are looking forward to improving their net run rate: Arundhati Reddy Women's T20 World Cup 2024: India beat Pakistan by 6 wickets in Dubai, but are in a precarious position as their net run rate of -1.217 is inferior to New Zealand's +2.900 and Australia's +1.908. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-ind-vs-ban-gwalior-varun-chakravarthy-hardik-pandya-2612285-2024-10-06",
      "headline": "IND vs BAN: Arshdeep Singh reveals how 'adapting quickly' helped him in 1st T20IIndia seamer Arshdeep Singh highlighted the importance of adapting quickly to conditions after match-winning performance against Bangladesh in the first T20I in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-t20i-suryakumar-yadav-reaction-2612284-2024-10-06",
      "headline": "Suryakumar Yadav delighted after debutants shine vs BangladeshIndia captain Suryakumar Yadav was very pleased after his team executed their plans successfully, leading to a seven-wicket victory over Bangladesh in the opening T20I on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-najmul-hossain-shanto-gwalior-t20i-2612282-2024-10-06",
      "headline": "Shanto looks for 'better plan' after Bangladesh's batting debacle   IND vs BAN: Najmul Hossain Shanto said that Bangladesh need to put up a better showing with the bat after losing the first T20I in Gwalior by seven wickets on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-hardik-pandya-arshdeep-singh-varun-chakravarthy-mayank-yadav-2612276-2024-10-06",
      "headline": "Watch: Hardik Pandya loses his bat, entertains crowd with quick cameo vs BangladeshIndia all rounder Hardik Pandya put on a magnificent exhibition of his marvellous shots during the first T20I against Bangladesh as he scored an unbeaten 39 (16). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-scotland-afy-fletcher-hayley-matthews-report-dubai-2612272-2024-10-06",
      "headline": "West Indies recover from South Africa loss to beat ScotlandWomen's T20 World Cup 2024: West Indies made a stupendous comeback after their loss against South Africa. Hayley Matthews' women beat Scotland by 6 wickets on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-1st-t20i-report-gwalior-mayank-varun-arshdeep-2612264-2024-10-06",
      "headline": "Young India blow away Bangladesh in Gwalior for 1-0 series leadIndia vs Bangladesh, 1st T20I: Mayank Yadav, Varun Chakravarthy and Arshdeep Singh starred with the ball to help India beat Bangladesh by seven wickets in Gwalior. India chased down the 128-run target with 49 balls to spare."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-fatima-sana-press-conference-batting-2612266-2024-10-06",
      "headline": "Pakistan were 10 to 15 runs short: Fatima Sana rues poor batting vs IndiaWomen's T20 World Cup 2024: Skipper Fatima Sana said that Pakistan would have made India fight hard had they got a score of around the 130-run mark in the marquee clash on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-0-0-draw-vs-aston-villa-2612250-2024-10-06",
      "headline": "Beleaguered Manchester United battle to 0-0 draw at Aston VillaManchester United ground out a 0-0 draw at Aston Villa on Sunday in a Premier League game steeped in speculation about the future of the visitors' under-fire manager Erik ten Hag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-1st-t20i-varun-chakravarthy-mayank-yadav-gwalior-2612238-2024-10-06",
      "headline": "IND vs BAN: Varun Chakravarthy bamboozles Bangladesh on India comeback in 1st T20IIndia spinner Varun Chakravarthy made a sensational comeback to international cricket as he picked 3/31 in four overs in the first T20I against Bangladesh in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-scotland-afy-fletcher-hayley-matthews-report-dubai-2612272-2024-10-06",
      "headline": "West Indies recover from South Africa loss to beat ScotlandWomen's T20 World Cup 2024: West Indies made a stupendous comeback after their loss against South Africa. Hayley Matthews' women beat Scotland by 6 wickets on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-1st-t20i-report-gwalior-mayank-varun-arshdeep-2612264-2024-10-06",
      "headline": "Young India blow away Bangladesh in Gwalior for 1-0 series leadIndia vs Bangladesh, 1st T20I: Mayank Yadav, Varun Chakravarthy and Arshdeep Singh starred with the ball to help India beat Bangladesh by seven wickets in Gwalior. India chased down the 128-run target with 49 balls to spare."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-fatima-sana-press-conference-batting-2612266-2024-10-06",
      "headline": "Pakistan were 10 to 15 runs short: Fatima Sana rues poor batting vs IndiaWomen's T20 World Cup 2024: Skipper Fatima Sana said that Pakistan would have made India fight hard had they got a score of around the 130-run mark in the marquee clash on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-0-0-draw-vs-aston-villa-2612250-2024-10-06",
      "headline": "Beleaguered Manchester United battle to 0-0 draw at Aston VillaManchester United ground out a 0-0 draw at Aston Villa on Sunday in a Premier League game steeped in speculation about the future of the visitors' under-fire manager Erik ten Hag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-1st-t20i-varun-chakravarthy-mayank-yadav-gwalior-2612238-2024-10-06",
      "headline": "IND vs BAN: Varun Chakravarthy bamboozles Bangladesh on India comeback in 1st T20IIndia spinner Varun Chakravarthy made a sensational comeback to international cricket as he picked 3/31 in four overs in the first T20I against Bangladesh in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-harmanpreet-kaur-neck-injury-india-vs-pakistan-2612236-2024-10-06",
      "headline": "Smriti Mandhana shares update on Harmanpreet Kaur's neck injuryWomen's T20 World Cup 2024: Smriti Mandhana shared an update on Harmanpreet Kaur's injury after the Indian skipper retired hurt in the match against Pakistan on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-mayank-yadav-maiden-over-debut-fastest-delivery-gwalior-2612230-2024-10-06",
      "headline": "Mayank Yadav clocks 147 kph, bowls maiden over on T20I debutMayank Yadav's stunning India debut against Bangladesh saw him bowl a maiden over in his first spell, quickly securing his first international wicket and clocking 147 km/h, cementing his future as a star Indian pacer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arundhati-reddy-ind-vs-pak-womens-t20-world-cup-2024-2612228-2024-10-06",
      "headline": "IND vs PAK: Arundhati credits constant work after Player of the Match performanceIndia seamer Arundhati Reddy credited her constant hard work after Player of the Match performance against Pakistan in the seventh match of the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-injury-india-vs-pakistan-dubai-2612227-2024-10-06",
      "headline": "Harmanpreet Kaur retires hurt vs Pakistan as India suffer injury scareWomen's T20 World Cup 2024: Indian skipper Harmanpreet Kaur walked off the park, holding her neck in the match against Pakistan on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-t20-world-cup-jasprit-bumrah-attendance-dubai-2612220-2024-10-06",
      "headline": "Bumrah in attendance for India vs Pakistan, Women's T20 World Cup clashJasprit Bumrah was seen supporting India Women's team in their crucial T20 World Cup win over Pakistan, as Harmanpreet Kaur's side secured a 6-wicket victory, keeping their semi-final hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-varun-chakravarthy-makes-india-comeback-after-three-years-2612214-2024-10-06",
      "headline": "1st T20I: Varun Chakravarthy makes India comeback after three yearsIndia vs Bangladesh: KKR spinner Varun Chakravarthy makes her India comeback after three years, thanks to his impressive IPL 2024 performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-fatima-sana-harmanpreet-kaur-report-dubai-2612213-2024-10-06",
      "headline": "T20 World Cup: India fend off resurgent Pakistan to secure hard-fought winWomen's T20 World Cup 2024: Harmanpreet Kaur's India secured their maiden win of the tournament after beating Pakistan by six wickets on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2612211-2024-10-06",
      "headline": "IND vs BAN: Mayank Yadav, Nitish Reddy rewarded with India debut after IPL heroicsTeam India handed debut caps to speedster Mayank Yadav and all-rounder Nitish Kumar Reddy for the first T20I against Bangladesh in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-t20-world-cup-jasprit-bumrah-attendance-dubai-2612220-2024-10-06",
      "headline": "Bumrah in attendance for India vs Pakistan, Women's T20 World Cup clashJasprit Bumrah was seen supporting India Women's team in their crucial T20 World Cup win over Pakistan, as Harmanpreet Kaur's side secured a 6-wicket victory, keeping their semi-final hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-varun-chakravarthy-makes-india-comeback-after-three-years-2612214-2024-10-06",
      "headline": "1st T20I: Varun Chakravarthy makes India comeback after three yearsIndia vs Bangladesh: KKR spinner Varun Chakravarthy makes her India comeback after three years, thanks to his impressive IPL 2024 performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-fatima-sana-harmanpreet-kaur-report-dubai-2612213-2024-10-06",
      "headline": "T20 World Cup: India fend off resurgent Pakistan to secure hard-fought winWomen's T20 World Cup 2024: Harmanpreet Kaur's India secured their maiden win of the tournament after beating Pakistan by six wickets on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2612211-2024-10-06",
      "headline": "IND vs BAN: Mayank Yadav, Nitish Reddy rewarded with India debut after IPL heroicsTeam India handed debut caps to speedster Mayank Yadav and all-rounder Nitish Kumar Reddy for the first T20I against Bangladesh in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-on-jacques-kallis-most-underrated-2612196-2024-10-06",
      "headline": "Ricky Ponting showers massive praise on 'most underrated' Jacques KallisLegendary Australai captain Ricky Ponting called Jacques Kallis the most talented player he's ever seen in his life. Kallis has stellar record both as a bowler and batter across formats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-neck-injury-real-madrid-confirms-brazil-international-break-ruled-out-2612199-2024-10-06",
      "headline": "Vinicius Jr ruled out of Brazil break after Real Madrid confirm neck injuryVinicius Junior has been ruled out of Brazil's upcoming World Cup qualifiers due to a neck injury sustained in Real Madrid's 2-0 win over Villarreal, adding to the club's concerns ahead of the international break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-reveals-snacking-perks-of-being-team-india-head-coach-2612191-2024-10-06",
      "headline": "Gautam Gambhir reveals 'snacking' perks of being Team India head coachGautam Gambhir revealed the 'snacking' perks of being Team India's head coach. Gambhir shared a special Instagram post and captioned, \"You can have snacks anytime when you are not playing!  #GoingToTheDressingRoom.\" "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}