{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-bank-of-india-cut-mclr-what-it-means-for-borrowers-2780837-2025-09-02",
      "headline": "PNB, Bank of India cut MCLR: What it means for borrowersPunjab National Bank has made small reductions across different loan tenures. The overnight rate has come down from 8.15% to 8%. The one-month MCLR has dropped slightly to 8.25%, while the three-month rate has been reduced to 8.45%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-evs-may-get-costlier-as-tax-panel-proposes-steep-gst-hike-report-2780736-2025-09-02",
      "headline": "Luxury EVs may get costlier as tax panel proposes steep GST hike: ReportThe proposal, if approved, would hit global brands such as Tesla, Mercedes-Benz, BMW and BYD the hardest, just as they ramp up their India play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-climate-change-is-driving-up-indias-food-prices-2780716-2025-09-02",
      "headline": "How extreme weather is driving up India's food pricesExperts warn that climate change is making such weather events more frequent, leading to higher volatility in vegetable prices and overall food inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-206-points-nifty-below-24600-dr-reddys-mm-among-top-losers-2780710-2025-09-02",
      "headline": "Sensex, Nifty end in red as financial stocks fall; all eyes on GST Council meetThe S&P BSE Sensex was down 206.61 points to 80,157.88 at the closing bell, while the NSE Nifty50 settled 45.45 points lower at 24,579.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-much-should-you-save-in-an-emergency-fund-here-is-the-answer-2780690-2025-09-02",
      "headline": "How much should you save in an emergency fund? Here's the answerWhen crisis knocks, credit cards and loans only add stress. An emergency fund keeps you afloat without debt. The tricky part is figuring out how much you should save. Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brass-city-in-crisis-us-tariff-threatens-livelihoods-of-over-2-lakh-artisans-in-moradabad-2780605-2025-09-02",
      "headline": "Brass city in crisis: Jobs of over 2 lakh Moradabad artisans at risk from US tariffsUS tariffs have struck Moradabad's export-reliant brass industry, freezing shipments, cutting jobs, and throwing the livelihoods of thousands of artisans and workers into immediate jeopardy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-in-trade-talks-with-us-says-piyush-goyal-day-after-modi-meets-xi-putin-sco-summit-tianjin-china-trump-tariffs-2780601-2025-09-02",
      "headline": "India in trade talks with US: Piyush Goyal after Trump's 'one-sided disaster' jibeCommerce Minister Piyush Goyal on Tuesday said India is holding talks with the United States on a bilateral trade agreement, day after Trump called ties with India \"one-sided diaster\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-take-a-loan-against-mutual-fund-follow-these-steps-2780584-2025-09-02",
      "headline": "How to take a loan against mutual fund? Follow these stepsNeed quick cash but don't want to sell your mutual funds? You can now take a loan against your investments and get instant funds while keeping your portfolio intact. Here's how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-salaried-employees-change-tax-regimes-while-filing-itr-old-and-new-tax-regime-2780547-2025-09-02",
      "headline": "Can salaried employees change tax regimes while filing ITR?As tax season nears, a common question among employees is whether they can switch from the old tax regime to the new one, or vice versa, while filing their ITR. Understanding the rules can help maximise tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earnings-from-online-gaming-here-is-how-to-file-itr-2780517-2025-09-02",
      "headline": "Earnings from online gaming? Here's how to file ITRThe September 15 ITR deadline is around the corner, and if you earned money from online games like fantasy cricket, rummy, or poker in FY25, it's time to report your winnings to the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-issues-new-rules-for-intraday-derivatives-trading-check-details-2780496-2025-09-02",
      "headline": "Sebi sets new intraday limits for equity derivatives from October 1. Details hereThe move comes after Sebi's action against US-based high-frequency trading firm Jane Street for using strategies deemed manipulative and harmful to retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-real-estate-developers-eye-big-sales-as-debt-hits-historic-low-2780470-2025-09-02",
      "headline": "Top real estate developers eye Rs 1.5 lakh crore sales as debt hits historic lowFresh data from ANAROCK Research shows that the top 10 listed players have already achieved nearly 30% (Rs 44,317 crore) of their combined Rs 1.49 lakh crore pre-sales target for FY26 in just the first quarter. \r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-turns-53-eyes-comeback-with-strong-roles-in-films-and-ott-2780828-2025-09-02",
      "headline": "Tridev's Sonam turns 53, eyes comeback with strong roles in films and OTTActor Sonam celebrates her 53rd birthday reflecting on her early Bollywood success and long hiatus. She is now ready to return with meaningful roles in films and OTT platforms, embracing her age and experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/the-weeknd-blinding-lights-becomes-1st-track-to-cross-5-billion-streams-on-spotify-2780836-2025-09-02",
      "headline": "The Weeknd's Blinding Lights becomes 1st track to cross 5 billion streams on SpotifyThe Weeknd's 'Blinding Lights' has made history as the first song to hit five billion streams on Spotify. This milestone comes shortly after topping Billboard's Top Hot R&B/Hip-Hop Songs of the 21st Century chart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/from-omi-to-og-pawan-kalyan-receives-special-birthday-wish-from-emraan-hashmi-2780793-2025-09-02",
      "headline": "From Omi to OG: Pawan Kalyan receives special birthday wish from Emraan HashmiThe makers of 'OG' celebrated Pawan Kalyan's birthday in an unconventional style by releasing a special video featuring Emraan Hashmi's character, Omi. The film will be released globally on September 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kiran-rao-biju-toppo-executive-producers-humans-in-the-loop-ai-adivasi-film-2780739-2025-09-02",
      "headline": "Kiran Rao, Biju Toppo back Humans in the Loop before September releaseKiran Rao and Biju Toppo have joined as executive producers for the indie film Humans in the Loop. The film highlights invisible AI labour through an Adivasi woman's story, raising questions about technology and indigenous knowledge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-issues-strong-warning-after-fan-trespasses-at-home-2780692-2025-09-02",
      "headline": "BTS' Jungkook issues strong warning after fan trespasses at homeBTS member Jungkook has spoken publicly for the first time following a troubling incident with an intruder at his residence, highlighting ongoing privacy concerns faced by K-pop idols.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/baaghi-4-harnaaz-sandhu-yeh-mera-husn-song-deepika-padukone-besharam-rang-2780719-2025-09-02",
      "headline": "Baaghi 4: Harnaaz Sandhu's Yeh Mera Husn being compared to Besharam RangFeaturing debutant Harnaaz Sandhu, the song 'Yeh Mera Husn' from the upcoming film 'Baaghi 4' released on Tuesday. Several social media users have compared the song to Deepika Padukone's song 'Besharam Rang'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-visits-mahakaleshwar-temple-participates-in-shiv-aarti-watch-2780606-2025-09-02",
      "headline": "Nushrratt Bharuccha visits Mahakaleshwar temple ahead of Uff Ye Siyapaa releaseActor Nushrratt Bharuccha recently participated in Shiv aarti at Ujjain's Mahakaleshwar temple. A video of the actor offering prayers has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-addresses-rajinikanth-coolie-box-office-run-audience-hype-2780740-2025-09-02",
      "headline": "Lokesh Kanagaraj addresses Rajinikanth's Coolie box office run, audience hypeDirector Lokesh Kanagaraj addresses the underperformance of his film Coolie, describing the challenges of audience expectations and the film's global reception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pranit-more-veer-pahariya-controversy-not-the-reason-to-do-bigg-boss-2780741-2025-09-02",
      "headline": "Pranit More on Veer Pahariya controversy: Not the reason to do Bigg BossIn an exclusive interaction with India Today, comedian Pranit More addressed his controversy around Veer Pahariya. He stated that the row was not the reason behind his 'Bigg Boss 19' entry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-makers-apology-to-remove-dialogue-demeaning-bengaluru-women-2780733-2025-09-02",
      "headline": "Lokah makers apologise, to remove dialogue demeaning Bengaluru womenDulquer Salmaan's Wayfarer Films issued an apology to the people of Karnataka over a dialogue demeaning Bengaluru women in 'Lokah Chapter 1: Chandra'. They also promised to remove the dialogue and expressed regret."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suris-saiyaara-holds-strong-with-rs-581-crore-collection-amid-big-releases-2780626-2025-09-02",
      "headline": "Mohit Suri's Saiyaara holds strong with Rs 581 crore collection amid big releasesMohit Suri's 'Saiyaara', starring Ahaan Panday and Aneet Padda, has emerged as a box office sensation, grossing Rs 581 crore worldwide in seven weeks. Despite competition from big releases, the romantic musical continues its strong run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-kicks-off-magic-man-2-tour-india-stop-in-talks-2780711-2025-09-02",
      "headline": "Jackson Wang kicks off sold-out Magic Man 2 World Tour, eyes India stop in 2026Singer Jackson Wang is launching his 'Magic Man 2' World Tour starting with sold-out shows in Bangkok. Fans in India await confirmation of his first-ever concert in the country, highlighting growing demand and excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-recalls-meeting-filmmaker-woody-allen-like-a-dream-come-true-2780654-2025-09-02",
      "headline": "Anupam Kher recalls meeting filmmaker Woody Allen: Like a dream come trueAnupam Kher recalled his once-in-a-lifetime experience of working with Woody Allen in the 2010 film 'You Will Meet a Tall Dark Stranger'. The actor shared how he cleverly managed to meet the reclusive filmmaker and their amusing first conversation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nagma-mirajkar-gauahar-khan-advice-bigg-boss-19-2780597-2025-09-02",
      "headline": "Nagma Mirajkar reveals why Gauahar did not give her any advice before Bigg Boss 19Influencer Nagma Mirajkar shared the conversation she had with 'Bigg Boss 7' winner Gauahar Khan before entering the reality show this year. She also shared that participating in the show with her boyfriend, Awez Darbar, was unplanned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-dubai-reel-sparks-dating-rumours-raj-nidimoru-2780660-2025-09-02",
      "headline": "Did Samantha hold Raj Nidimoru's hands in Dubai reel? Fans hint at soft launchSamantha Ruth Prabhu's latest Instagram reel sparked new rounds of speculation of a romantic link with filmmaker Raj Nidimoru. She gave a glimpse of her work day in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-grih-pravesh-puja-new-home-2780524-2025-09-02",
      "headline": "Athiya Shetty and KL Rahul perform Grih Pravesh puja, photo goes viralCelebrity couple Athiya Shetty and KL Rahul marked a new milestone by performing a grih pravesh puja at their new home. They welcomed a baby girl named Evaarah in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-linkedin-profile-delights-fans-worst-barista-bagel-boston-2780643-2025-09-02",
      "headline": "Worst barista to bagel pro: Shraddha Kapoor's LinkedIn profile delights fansShraddha Kapoor's LinkedIn profile, detailing her journey from part-time jobs in Boston to co-founding a jewellery brand, has captured widespread attention online. Her honest and relatable posts have sparked both amusement and admiration from fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-and-bharat-takhtani-divorce-leaves-dharmendra-sad-2780569-2025-09-02",
      "headline": "Dharmendra wanted Esha Deol and Bharat to reconsider divorce: ReportEsha Deol and Bharat Takhtani ended their 11-year marriage in February 2024, calling it a mutual and amicable decision. Reports claimed Dharmendra was saddened by the separation and hoped the couple would reconsider for the sake of their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dances-with-wolves-actor-graham-greene-dies-at-age-73-2780632-2025-09-02",
      "headline": "Dances with Wolves actor Graham Greene dies at 73Canadian actor Graham Greene, who received an Academy Award nomination for his role in the 1990 film 'Dances with Wolves', has died at the age of 73."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-have-won-manoj-jarange-set-to-end-hunger-strike-as-state-agrees-to-key-demands-2780764-2025-09-02",
      "headline": "We won: Manoj Jarange as Maharashtra agrees to key Maratha quota demandMaratha quota activist Manoj Jarange launched an indefinite hunger strike at Mumbai's Azad Maidan on August 29, seeking a 10% quota for the Maratha community in government jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sharjeel-imam-umar-khalid-bail-denied-2020-delhi-riots-7-accused-high-court-2780682-2025-09-02",
      "headline": "No bail for Umar Khalid, Sharjeel Imam, 7 others in 2020 Delhi riots caseImam and Khalid were accused of being part of a larger conspiracy that led to the communal violence in northeast Delhi. The violence left over 50 dead and hundreds injured."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/kcr-daughter-k-kavitha-suspended-from-brs-days-after-comments-against-party-2780653-2025-09-02",
      "headline": "KCR suspends daughter K Kavitha from BRS day after she hit out at cousinsBRS on Tuesday suspended K Kavitha with immediate effect for alleged anti-party activities, a day after she blamed her cousins, ex-irrigation minister T Harish Rao and former MP J Santosh Rao, for investigation against her father KCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-leader-pawan-khera-gets-election-commission-notice-after-bjp-claims-he-has-2-voter-ids-2780776-2025-09-02",
      "headline": "Election Commission notice to Congress's Pawan Khera over 2 voter IDsThe notice comes hours after BJP IT cell chief Amit Malviya accused the Congress leader Pawan Khera of being registered as a voter in two separate Assembly constituencies in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/marathas-quota-manoj-jarange-patil-obc-status-devendra-fadnavis-eknath-shinde-2780769-2025-09-02",
      "headline": "Fadnavis, Jarange's Maratha agitation and Shinde: Who is the mastermind and target?Maratha quota protests in Mumbai enter sixth day, with Manoj Jarange Patil insisting on OBC status. Political undercurrents intensify as Eknath Shinde's silence and Devendra Fadnavis's anguish fuel speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-russian-oil-imports-savings-17-billion-dollars-us-trump-tariffs-trade-war-economy-data-explained-2780603-2025-09-02",
      "headline": "How much did India gain from Russian oil? Numbers beyond the noiseIndia has saved at least $17 billion by purchasing Russian crude since the commencement of the Russia-Ukraine war in February 2022, according to experts. How did the discounts and overall import volume shift in these three years against Trump's tariffs that India faced?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-calls-chicago-most-dangerous-city-in-the-world-after-deadly-labor-day-weekend-glbs-2780832-2025-09-02",
      "headline": "Most dangerous city in the world: Trump after deadly Labor Day weekend in ChicagoUS President Donald Trump called Chicago \"the most dangerous city in the world\" following a Labor Day weekend where 54 people were shot, seven killed, sparking renewed tensions with Illinois officials over crime intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/north-indias-deluge-of-four-decades-how-swollen-himalayan-rivers-brought-death-distress-2780774-2025-09-02",
      "headline": "North India's deluge of four decades: How swollen Himalayan rivers brought death, distressHimachal Pradesh, Punjab and J&K bore the brunt. The cost: over 400 people dead, more than a million displaced, and losses pegged at Rs 30,000 crore\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-gurugram-offices-developed-delhi-chokes-in-rain-gurgaon-floods-monsoon-waterlogging-delhi-ncr-rains-2780761-2025-09-02",
      "headline": "How Gurugram, developed to unchoke Delhi, chokes in rain every yearEvery monsoon, Gurugram, the so-called Millennium City, turns into a waterworld of struggle and an emblem of apathy. From paralysing traffic snarls to rising dengue cases caused by waterlogging and a broken drainage system, Gurugram has become a symbol of urban civic failure. Planned as a satellite city to ease Delhi's burden, it now suffocates under its own mismanagement, leaving residents helpless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/how-rahul-gandhi-bike-yatra-converted-old-bajaj-pulsar-220-cc-into-new-voter-adhikar-yatra-motorcycle-elections-2780783-2025-09-02",
      "headline": "How Rahul Gandhi's bike yatra converted old Pulsar 220 into newDuring Rahul Gandhi's Voter Adhikar Yatra in Bihar's Darbhanga, a dhaba owner's Pulsar 220 went missing after being taken by the leader's security personnel for the bike rally. Days later, the Congress leader gifted him a brand-new Bajaj Pulsar 220 in Patna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/asian-glaciers-losing-22-million-kg-ice-every-year-due-to-climate-change-study-2780846-2025-09-02",
      "headline": "Asian glaciers losing 22 million kg ice every year to climate changeIn the southern part of the Central Himalayas, covering Nepal and Uttarakhand, glaciers accumulate during summer rather than winter. Cold temperatures turn annual monsoon rainfall into intense snowfall, which helps sustain them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/odisha-students-make-70-kg-chocolate-sculpture-of-pm-modi-see-pics-2780831-2025-09-02",
      "headline": "Odisha students make 70-kg chocolate statue of PM Modi before his birthdayAhead of his birthday, a group of students in Bhubaneswar made a 70-kg chocolate sculpture of Prime Minister Narendra Modi over seven days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-outperformed-mohanlal-film-malayalm-superhero-film-2780596-2025-09-02",
      "headline": "How Malayalam's first female superhero film Lokah outperformed Mohanlal's film'Lokah Chapter 1: Chandra' marks a revolutionary moment in Indian cinema as the first female superhero film that outperforms Mohanlal's 'Hridayapoorvam'. Blending Western superhero themes with Indian folklore, it sets a new standard for storytelling in Malayalam cinema."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-strict-foreigners-illegal-migrants-new-rules-home-ministry-empower-immigration-bureau-aliens-fake-visa-passport-2780644-2025-09-02",
      "headline": "India gets strict foreigners rules, Immigration Bureau to deport illegal aliensIndia has enacted the Immigration and Foreigners Act, 2025, which aims to tighten passport and visa rules. The new law has also armed the Bureau of Immigration with enhanced powers to track, detain and deport illegal migrants. Illegal immigration is not just a security risk, but a drain on Indian resources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/karolina-muchova-us-open-ex-boyfriend-tears-reveals-reason-2780454-2025-09-02",
      "headline": "Ex-boyfriend in the crowd: Tennis star reveals why she broke down in tearsUS Open 2025: 11th seed Karolína Muchová has explained why she broke down in tears during her second-round match last week. The Czech star revealed that she had spotted her ex-boyfriend in the stands. Muchova will now face Naomi Osaka on Wednesday for a place in the semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-dances-with-youth-patna-marine-drive-voter-adhikar-yatra-2780633-2025-09-02",
      "headline": "Dance, tea and reels: Tejashwi Yadav's night out with nephew after Bihar marchAfter concluding the Voter Adhikar Yatra, Tejashwi Yadav shared a light moment dancing with youngsters in Patna. This reflects his effort to connect with youth amid a charged political atmosphere in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shanghai-cooperation-organisation-sco-china-boost-trump-tariffs-quad-struggles-relevance-2780614-2025-09-02",
      "headline": "Trump has given SCO a renewed purpose. Quad stands defangedVisuals of leaders of some of the most populous and influential countries posing for photographs and engaging in candid conversations at the SCO summit in Xi Jinping's backyard were bound to rattle the US. Not too long ago, China found itself in a similar situation, fretting over the re-emergence of the Quad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/toppers-skip-the-new-iits-old-iits-rule-2780534-2025-09-02",
      "headline": "9 IITs see no admissions from top 2,000 rankers: Why are toppers skipping themThe Joint Implementation Committee's (JIC) 2025 seat allotment data based on JEE Advanced shows most of the best scorers choose only a handful of older IITs. Nine IITs have no admits inside rank 2,000. Government is expanding seats, but quality and placements decide long-term value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/naveen-patnaik-raises-fertiliser-alarm-why-odisha-farmers-are-in-crisis-2780745-2025-09-02",
      "headline": "Naveen Patnaik raises fertiliser alarm: Why Odisha farmers are in crisisBiju Janata Dal chief Naveen Patnaik says an acute shortage of fertiliser in the ongoing Kharif season threatens the livelihoods of hundreds of thousands of farmers in Odisha\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/olive-oil-sunflower-oil-mustard-oil-coconut-oil-or-ghee-kitchen-icmr-cooking-healthy-2780665-2025-09-02",
      "headline": "Olive, sunflower, mustard or ghee: Which oil should make it to your kitchen?India consumes more cooking oil than recommended. So, the big question remains: between sunflower, olive, mustard, coconut, ghee, and nut oils, which one should really make it to your kitchen shelf?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/the-weeknd-blinding-lights-becomes-1st-track-to-cross-5-billion-streams-on-spotify-2780836-2025-09-02",
      "headline": "The Weeknd's Blinding Lights becomes 1st track to cross 5 billion streams on SpotifyThe Weeknd's 'Blinding Lights' has made history as the first song to hit five billion streams on Spotify. This milestone comes shortly after topping Billboard's Top Hot R&B/Hip-Hop Songs of the 21st Century chart."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-mlas-mps-donate-one-month-salary-punjab-flood-relief-kejriwal-appeals-national-support-2780720-2025-09-02",
      "headline": "AAP MLAs, MPs to donate 1-month salary for Punjab flood relief: Arvind KejriwalArvind Kejriwal, in a video message posted on X, urged all political parties and the central government to provide aid to the people of Punjab who have been affected by the floods in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/do-kids-really-need-play-school-parents-caught-in-hype-safety-concerns-2780752-2025-09-02",
      "headline": "Do kids really need play school, or are parents just caught in the hype?Even though play schools are optional and not a formal requirement, societal pressure often makes parents feel they have no choice but to enrol their child. For many, it has almost become a benchmark of good parenting. But are play schools genuinely worth the hype?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gills-return-wont-put-pressure-on-secure-suryakumar-irfan-pathan-2780853-2025-09-02",
      "headline": "Shubman Gill's return won't put pressure on secure Suryakumar: Irfan PathanFormer India cricketer Irfan Pathan feels the return of Shubman Gill in T20Is won't put any extra pressure on Suryakumar Yadav as he's not an insecure player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-thriller-india-vs-bangladesh-2018-final-2780759-2025-09-02",
      "headline": "Asia Cup: When India clinched final-ball thriller vs BangladeshIndia won the 2018 Asia Cup final against Bangladesh with a dramatic last-ball victory. The thrilling finish highlighted India's resilience and Jadhav's crucial contribution under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-shetty-bwf-world-championships-2780737-2025-09-02",
      "headline": "Special to be in company of Saina and Sindhu: Chirag ShettySatwiksairaj Rankireddy and Chirag Shetty won their second BWF World Championship medal in 2025. Chirag, speaking to PTI relished the fact they were in the elite company of PV Sindhu and Saina Nehwal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bans-dream11-crypto-from-jersey-sponsorship-rights-ad-2780679-2025-09-02",
      "headline": "Crypto, online money gaming firms barred from BCCI sponsorship raceThe Indian Cricket Board (BCCI) floated the advertisement for lead sponsorship rights on Tuesday, September 2. The body explicitly mentioned that all companies were not allowed to apply as the jersey sponsor of the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-reaction-indian-cricket-sunil-gavaskar-criticism-2780668-2025-09-02",
      "headline": "After Gavaskar criticism, Haddin defends his stance on Shreyas's Asia Cup snubFormer Australia wicketkeeper Brad Haddin has responded to Sunil Gavaskar after the former Indian great criticised overseas cricketers for commenting on Indian cricket matters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bcci-advertisement-india-cricekt-lead-sponsor-dream-11-2780667-2025-09-02",
      "headline": "After Dream11 exit, BCCI invites bids for lead sponsor; deadline September 16The BCCI invited bids for Team India's lead sponsorship rights. The Indian cricket banned applications from real-money gaming platforms and crypto companies in the aftermath of the recently-passed online gaming bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-reaction-bayer-leverkusen-shock-exit-two-matches-2780638-2025-09-02",
      "headline": "Erik ten Hag shocked as Leverkusen sack him after two matchesErik ten Hag said Bayer Leverkusen's decision to dismiss him after just two Bundesliga matches in charge came as a complete surprise, adding that the club's hierarchy had not shown him sufficient trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-china-mens-hockey-rise-india-favourites-roelant-oltmans-2780647-2025-09-02",
      "headline": "Chinese revolution: Why China could be India's biggest threat to Asia Cup gloryThe China men's hockey team continues to make heads turn with their gritty and determined performances across the turf. With an all-round attack and rugged defence, are the Chinese side India's biggest threat to Asia Cup glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-china-coach-exclusive-interview-2780618-2025-09-02",
      "headline": "China are improving, but India clear favourites to win Asia Cup: Roelant OltmansFormer India coach and current China assistant coach Roelant Oltmans feels that India are the clear favourites to win the Asia Cup in Rajgir. Oltmans feels that the rise of the Chinese men's team was inevitable and they're building towards LA Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bcci-advertisement-india-cricekt-lead-sponsor-dream-11-2780667-2025-09-02",
      "headline": "After Dream11 exit, BCCI invites bids for lead sponsor; deadline September 16The BCCI invited bids for Team India's lead sponsorship rights. The Indian cricket banned applications from real-money gaming platforms and crypto companies in the aftermath of the recently-passed online gaming bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-reaction-bayer-leverkusen-shock-exit-two-matches-2780638-2025-09-02",
      "headline": "Erik ten Hag shocked as Leverkusen sack him after two matchesErik ten Hag said Bayer Leverkusen's decision to dismiss him after just two Bundesliga matches in charge came as a complete surprise, adding that the club's hierarchy had not shown him sufficient trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-china-mens-hockey-rise-india-favourites-roelant-oltmans-2780647-2025-09-02",
      "headline": "Chinese revolution: Why China could be India's biggest threat to Asia Cup gloryThe China men's hockey team continues to make heads turn with their gritty and determined performances across the turf. With an all-round attack and rugged defence, are the Chinese side India's biggest threat to Asia Cup glory?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-china-coach-exclusive-interview-2780618-2025-09-02",
      "headline": "China are improving, but India clear favourites to win Asia Cup: Roelant OltmansFormer India coach and current China assistant coach Roelant Oltmans feels that India are the clear favourites to win the Asia Cup in Rajgir. Oltmans feels that the rise of the Chinese men's team was inevitable and they're building towards LA Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/paddy-upton-exclusive-hockey-asia-cup-virat-kohli-2780634-2025-09-02",
      "headline": "Only Virat Kohli can last half of hockey team's training session: Paddy UptonHockey Asia Cup 2025: Mental conditioning coach Paddy Upton, speaking to India Today, discussed his latest stint with the senior men's hockey team. Upton, who worked with the Indian cricket team in the past, talked up the fitness levels of the Hamanpreet Singh-led hockey team. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}