{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-key-proposals-for-fds-long-term-savings-capital-markets-mutual-funds-taxation-and-compliance-2659369-2025-01-03",
      "headline": "Budget 2025: Key proposals for FDs, and long-term savingsTax incentives for fixed deposits and boost middle-class savings could redefine savings strategies in Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-goods-and-services-tax-on-vouchers-and-gift-cards-all-you-need-to-know-2659315-2025-01-03",
      "headline": "GST on vouchers and gift cards: All you need to knowGift vouchers are exempt from GST, but commissions and services linked to them remain taxable under GST rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-market-sensex-nifty-fall-nearly-1-percent-as-it-financial-banking-pharma-stocks-tumble-in-volatile-day-2659277-2025-01-03",
      "headline": "Sensex, Nifty fall nearly 1% as IT, banking stocks tumble in volatile day The S&P BSE Sensex plunged 720.60 points to end at 79,223.11, while the NSE Nifty50 lost 199.60 points to end at 23,989.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-taxpayers-5-reforms-that-could-make-new-tax-regime-a-better-deal-for-you-2659264-2025-01-03",
      "headline": "Budget 2025: 5 reforms that could make new tax regime a better deal for youThe government is expected to focus on boosting consumption, given the low GDP for the second quarter, which could lead to tax relief measures aimed at increasing disposable income for salaried taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-date-time-and-what-to-expect-fm-nirmala-sitharaman-to-present-key-policies-and-reforms-income-tax-2659224-2025-01-03",
      "headline": "Budget 2025: Date, time, and what to expectThe countdown to India's Union Budget 2025 has begun, with Nirmala Sitharaman set to present key policies and reforms on February 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-kpi-green-energy-share-price-is-showing-36-decline-on-some-trading-apps-bonus-issue-stmp-2659186-2025-01-03",
      "headline": "Explained: Why KPI Green Energy shares are down 36% on some trading appsKPI Green Energy stock price: The stock declined 4.44% to trade at Rs 547 on the Bombay Stock Exchange (BSE) at Rs 1:40 pm after hitting an intraday low of Rs 548."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-rises-4-percent-should-you-buy-brokerage-review-clsa-nomura-stmp-2659167-2025-01-03",
      "headline": "Tata Motors share price rises 4%. Is it a good time to invest?Tata Motors stock: Over the past five trading sessions, Tata Motors has gained more than 6%. However, the stock has seen a decline of 18.36% in the last six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-five-key-announcements-india-is-waiting-for-income-tax-relief-reduction-in-excise-duty-on-fuel-focus-on-job-creation-2659149-2025-01-03",
      "headline": "Budget 2025: 5 key announcements India is waiting forBudget 2025 holds the potential to bring much-needed relief to the economy, addressing both long-term growth and immediate concerns like inflation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-gains-over-12-percent-hits-all-time-high-know-why-stmp-2659153-2025-01-03",
      "headline": "ITI share price soars over 12%, hits all-time high. Know whyITI stock price: Earlier, some analysts had advised investors to book profits as it was approaching a critical resistance zone. However, it has now surpassed the resistance zone and is likely to continue its upward momentum. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oil-india-ongc-share-price-jump-5-percent-today-what-is-fuelling-the-rally-stmp-2659131-2025-01-03",
      "headline": "Oil India, ONGC shares jump 5% today. What's fuelling the rally?The rally can be attributed to global policy measures aimed at economic revival, which investors believe could boost fuel demand and enhance earnings for upstream oil companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jai-corp-stock-price-52-week-low-today-check-key-details-capital-reduction-proposal-stmp-2659116-2025-01-03",
      "headline": "Explained: Why Jai Corp share price hit 52-week low todayThe steep decline in Jai Corp's share price over two sessions stems from a significant capital reduction proposal involving Urban Infrastructure Holdings Private Limited (UIHPL), where Jai Corp holds a 32% equity stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-tax-saving-tips-for-young-professionals-in-2025-investment-planning-health-insurance-2659101-2025-01-03",
      "headline": "5 tax-saving tips for young professionals in 2025Proactive financial planning helps young professionals save taxes, build wealth, and reach goals with strategies like early planning, goal-based investing, and health insurance, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-600-points-3-reasons-behind-stock-market-volatility-2659096-2025-01-03",
      "headline": "Sensex tumbles 600 points: 3 reasons behind stock market volatilityThe downturn highlights the persistent volatility on Dalal Street, with investors uncertain about the short-term market trajectory. While auto and IT stocks had propelled a rally just a day ago, profit booking amid prevailing uncertainty appears to have weighed heavily on sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/leo-dry-fruits-and-spices-ipo-last-day-check-price-band-gmp-today-stmp-2659089-2025-01-03",
      "headline": "Leo Dry Fruits and Spices IPO: Check price band, GMP today  Leo Dry Fruits and Spices IPO last day: The initial public offering (IPO) of Leo Dry Fruits and Spices will close for bidding on Friday after having opened for subscription on January 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-5-top-expectations-of-senior-citizens-enhanced-savings-better-deductions-for-medical-costs-2659086-2025-01-03",
      "headline": "Budget 2025: 5 top expectations of senior citizens Budget 2025 can ease senior citizens' burdens with higher tax exemptions, simpler processes, and targeted benefits for financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-share-price-avenue-supermarts-stock-jumps-13-percent-in-early-trade-should-you-buy-stmp-2659058-2025-01-03",
      "headline": "DMart share price jumps 14% in early trade: Should you buy?DMart share price: The stock, which closed at Rs 3,617.75 in the previous session, rose to a high of Rs 4,165.00 during intraday trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-drops-over-400-points-nifty-slips-below-24100-in-early-trade-2659048-2025-01-03",
      "headline": "Sensex drops 400 points; Nifty slips below 24,100 in early tradeThe S&P BSE Sensex lost 452.52 points to 79,491.29, while the NSE Nifty50 was down by 93.25 points to 24,095.40 as of 9:42 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kabeer-biswas-founder-dunzo-exit-quick-commerce-startup-reliance-retail-battles-cash-crisis-report-2659043-2025-01-03",
      "headline": " Kabeer Biswas may call it quits as Dunzo battles cash crisis: Report The Bengaluru-based quick commerce platform has faced a challenging period over the last 12–18 months, marked by cash flow issues and difficulties in raising fresh funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-allotment-status-online-step-by-step-guide-latest-gmp-listing-date-2659030-2025-01-03",
      "headline": "Indo Farm Equipment IPO: Check allotment status, GMP and listing dateIndo Farm IPO allotment status:: Investors who wish to check Indo Farm Equipment IPO allotment can do so by visiting the Bombay Stock Exchange (BSE) website and the registrar's online portal, which is Mas Services Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-evasion-can-unregistered-small-businesses-b2c-receive-gst-notices-2658821-2025-01-03",
      "headline": "Can unregistered small businesses receive GST notices?The annual turnover threshold for GST registration is Rs 40 lakh for businesses supplying goods and Rs 20 lakh for service providers. Businesses below these limits are exempt, but exceeding them triggers registration and compliance requirements."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-delhi-assembly-election-first-list-of-candidates-released-parvesh-sharma-kailash-gahlot-2659658-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi: BJP pits Parvesh Verma against Arvind Kejriwal, Kailash Gahlot gets ticketBJP candidate list Delhi polls: BJP veteran Ramesh Bidhuri will contest against Delhi Chief Minister Atishi in Kalkaji as the saffron party released its first list of 29 candidates for the Delhi elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-reporter-expose-on-rs-120-crore-road-project-leads-to-his-death-in-bijapur-2659477-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Journalist's body found in tank in Chhattisgarh days after report on corruptionMukesh Chandrakar, who worked with a local news channel, was found dead on January 3 in Bijapur district. He recently exposed alleged irregularities in a Rs 120-crore road construction project in Bastar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-cm-pinarayi-vijayan-sanatana-dharma-remark-row-social-reformer-narayan-guru-ezhava-explained-2659361-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why South's second Sanatana Dharma row has reformer Narayan Guru at the centreKerala CM Pinarayi Vijayan's comments on Sanatana Dharma have ignited a fresh debate, with social reformer and saint, Narayana Guru, at the centre. Known for his teachings of equality and social harmony, why is the 19th-century reformer at the heart of southern India's second Sanatana Dharma row?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-day-2-match-report-bgt-rishabh-pant-fifty-jasprit-bumrah-back-injury-2659644-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5th Test: Rishabh Pant's Day 2 madness keeps India alive despite Bumrah scareA Rishabh Pant special helped India take a lead of 145 runs on an eventful Day 2 in Sydney. Pant's rapid fifty kept India just ahead of the hosts in a 15-wicket day at the SCG. Earlier, India bowled out Australia for 181 runs, but suffered a potential injury blow to Jasprit Bumrah.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/will-2025-smash-box-office-with-superstars-taking-over-cinemas-trade-analysts-weigh-in-cinematic-saturday-2659602-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With Raja Saabs returning to cinemas, will 2025 be the Sikandar at box office?The Indian film industry is poised for a significant year in 2025 with a star-studded lineup, aiming to draw audiences back to theatres post-pandemic. With major releases across languages, the industry hopes for a pan-India success and increased footfall in cinemas. Trade experts Girish Johar and Ramesh Bala share their insights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prashant-kishor-hunger-strike-luxury-vanity-van-bihar-students-protest-bpsc-exam-jan-suraaj-2659645-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "As Prashant Kishor sits on indefinite fast, his luxury vanity van feeds frenzyAmid Prashant Kishor's fast-unto-death, photos of his luxury vanity van parked at the site of the protest at Patna's Gandhi Maidan have gone viral, sparking buzz on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vande-bharat-train-maximum-speed-with-glass-of-water-sleeper-trial-ashwini-ashwini-waterways-2659581-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vande Bharat train hits 180 kmph during trial, video shows glass of water steadyThe Vande Bharat sleeper train, designed with advanced features for comfort and efficiency, achieved a peak speed of 180 km/h during successful trials. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/babul-supriyo-bjp-mp-abhijit-ganguly-altercation-kolkata-second-hooghly-bridge-2659603-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Showdown on Kolkata bridge as Babul Supriyo confronts BJP MP on erratic drivingThe incident occurred as Babul Supriyo was on his way back to his residence in Howrah, when he became annoyed by persistent honking from the car behind him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/kumbh-mela-origins-of-the-worlds-biggest-oldest-festival-2659448-2025-01-03?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Kumbh Mela: Origins of the world's biggest and oldest festivalDiscover the fascinating origins of Kumbh Mela, the world's largest religious gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nuclear-scientist-r-chidambaram-nuclear-tests-die-pokhran-padma-shri-programme-2659627-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Veteran scientist R Chidambaram, architect of India's nuclear programme, dies at 88Eminent physicist Rajagopala Chidambaram, who was associated with India's nuclear weapons programme, died at Jaslok Hospital in Mumbai at the age of 88 on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-hits-back-at-misinformed-elon-musk-on-child-abuse-grooming-gangs-2659538-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk links Keir Starmer to Pakistani 'rape gangs', UK hits backElon Musk has been severely critical of the UK government's handling of young girls' sexual exploitation across several towns and cities in England more than a decade ago, in many cases involving gangs of Pakistani-origin men."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-returns-to-scg-scan-results-sydney-2659629-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5th Test: Jasprit Bumrah returns to India dressing room, scan results awaitedIn a big relief to the Indian cricket team fans, Jasprit Bumrah has returned to the dressing room on Day 2 of the Sydney Test on Saturday, January 4. Bumrah had left the SCG to get scans done on a back issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-shares-hardest-cultural-adjustment-after-moving-to-india-viral-video-2659587-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US woman shares her 'hardest' cultural adjustment after moving to India in videoIn a now-viral video shared on Instagram, Kristen Fischer revealed what she found to be the hardest cultural adjustment after she moved to India.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-farmers-protest-msp-crops-rural-india-health-water-grameen-bharat-mahotsav-2659634-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid farmers' protest, PM's outreach: Increased MSP on many crops in 10 yearsFarmers have been demanding a law guaranteeing the purchase of all crops at MSPs across the country. PM Modi said that policies to promote agriculture were the priority of his government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-tobacco-trap-why-tobacco-control-missteps-worry-indias-doctors-2659479-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why tobacco control missteps worry India's doctorsDoctors warn that India's tobacco control measures have faltered in addressing cessation. While consumption patterns shift, the absence of robust programs to help users quit has left millions trapped in addiction, turning to unregulated and harmful alternatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-test-rohit-sharma-sydney-test-miss-interview-2659556-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I stood down: Rohit Sharma breaks silence on missing Sydney TestRohit Sharma has revealed that he decided to step down for the Sydney Test to make way for an in-form player to come into the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/hmpv-outbreak-china-is-it-similar-to-covid-19-virus-pandemic-2659415-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "HMPV in China: Is it similar to Covid-19 virus?China is experiencing a surge in respiratory illnesses, particularly Human Metapneumovirus (HMPV). This virus has several similarities to the Covid-19 virus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-441-03-01-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-school-murder-shakarpur-rajkiya-sarvodaya-bal-vidyalaya-ishu-gupta-student-arrest-2659604-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Class 7 student stabbed to death in Delhi after fight with schoolmatesA 14-year-old Class 7 student, Ishu Gupta, was fatally stabbed just outside the school following a dispute with his fellow students. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-weather-north-india-up-haryana-fog-temperature-flight-train-delay-cancel-airport-visibility-2659551-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 dead in accident in Haryana, 360 flights hit in Delhi amid fog in North IndiaA dense fog amid a cold wave disrupted flights, trains, and road traffic across North India, delaying over 360 flights, cancelling 60 at Delhi Airport, and causing widespread inconvenience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/rd-burman-rebel-genius-who-gave-bollywood-a-new-sound-2659418-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RD Burman: The rebel genius who gave Bollywood a new soundRD Burman, son of legendary composer SD Burman, transformed Indian music with his innovative style. From jazz to disco, his fearless experimentation made him an icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/blinkit-ambulance-service-10-minute-piyush-goyal-2659588-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Must follow law of land: Union Minister on Blinkit's 10-minute ambulance serviceAfter Blinkit launched a 10-minute ambulance service in Gurugram, Union Minister Piyush Goyal said the quick commerce company should follow \"the law of the land\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-virudhnagar-explosion-firecrackers-manufacturing-unit-factory-workers-killed-2659626-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6  killed in firecracker unit explosion in Tamil Nadu's VirudhunagarThe blast is suspected to have occurred during the mixing of chemicals, flattening the factory and killing six."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-soldier-suspect-tesla-cybertruck-blast-las-vegas-suicide-note-wakeup-call-2659572-2025-01-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Soldier who blew up Tesla Cybertruck left note: Wake-up call for AmericaA US Army soldier, who died in a Tesla Cybertruck explosion in Las Vegas on January 1, said the blast served as a \"wake-up call\" for America and said that people \"only pay attention to spectacles and violence\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maharaja-chinese-audience-moved-to-tears-by-vijay-sethupathi-nithilan-film-2659678-2025-01-04",
      "headline": "Chinese audience moved to tears by Vijay Sethupathi's Maharaja. WatchA video of Vijay Sethupathi's Maharaja has gone viral in China, showing audiences emotionally engaged. The film's father-daughter narrative resonates deeply, sparking online discussions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-adorable-daughter-watches-him-in-rrr-2659673-2025-01-04",
      "headline": "Video: Ram Charan's adorable daughter watches him in RRRRRR star Ram Charan's daughter, Klin Kaara, recently saw her father in the SS Rajamouli directorial for the first time. The cute video was shared by Charan's wife and entrepreneur, Upasana Konidela. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pic-rediscovered-sholay-scene-unveils-censor-cut-footage-after-49-years-2659657-2025-01-04",
      "headline": "Pic: Rediscovered Sholay scene unveils censor-cut footage after 49 YearsA never-before-seen scene from the legendary Bollywood film Sholay has emerged, reigniting interest and nostalgia. Originally cut by the censor board, this scene reveals more about Gabbar Singh's character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/rd-burman-rebel-genius-who-gave-bollywood-a-new-sound-2659418-2025-01-04",
      "headline": "RD Burman: The rebel genius who gave Bollywood a new soundRD Burman, son of legendary composer SD Burman, transformed Indian music with his innovative style. From jazz to disco, his fearless experimentation made him an icon."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-on-virat-kohlis-struggles-aus-vs-ind-ind-vs-aus-border-gavaskar-trophy-2024-25-2659674-2025-01-04",
      "headline": "Kohli tried everything in his capabilities, now battling with self-doubt: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar feels Virat Kohli tried everything in his abilities to work on his outside-off weakness and is now just fighting with self-doubt.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-jasprit-bumrah-injury-back-spasm-prasidh-krishna-scg-test-2659676-2025-01-04",
      "headline": "Prasidh Krishna confirms Bumrah's injury, SCG Test participation under cloudStand-in captain Jasprit Bumrah might not play on Day 3 of the SCG Test. India pacer Prasidh Krishna revealed at the end of Day 2 that Bumrah had a back spasm and that the team would get to know more once the medical team gets the reports from the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saim-ayub-champions-trophy-ruled-out-for-six-weeks-due-to-ankle-injury-2659671-2025-01-04",
      "headline": "Saim Ayub in doubt for Champions Trophy, ruled out for six weeks due to ankle injuryPakistan's Saim Ayub could miss next month's ICC Champions Trophy after being ruled out of competitive cricket for six weeks because of an ankle injury he sustained during the ongoing second Test against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-rishabh-pant-fifty-sydney-sachin-tendulkar-reaction-2659662-2025-01-04",
      "headline": "Rishabh Pant rattled Australia from 1st ball: Tendulkar in awe of Sydney blitzSachin Tendulkar heaped praise on Rishabh Pant after the Indian wicketkeeper set the stage on fire during Day 2 of the Sydney Test. Pant scored 61 off 32 balls to put Australia on the backfoot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-day-2-match-report-bgt-rishabh-pant-fifty-jasprit-bumrah-back-injury-2659644-2025-01-04",
      "headline": "5th Test: Rishabh Pant's Day 2 madness keeps India alive despite Bumrah scareA Rishabh Pant special helped India take a lead of 145 runs on an eventful Day 2 in Sydney. Pant's rapid fifty kept India just ahead of the hosts in a 15-wicket day at the SCG. Earlier, India bowled out Australia for 181 runs, but suffered a potential injury blow to Jasprit Bumrah.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-returns-to-scg-scan-results-sydney-2659629-2025-01-04",
      "headline": "5th Test: Jasprit Bumrah returns to India dressing room, scan results awaitedIn a big relief to the Indian cricket team fans, Jasprit Bumrah has returned to the dressing room on Day 2 of the Sydney Test on Saturday, January 4. Bumrah had left the SCG to get scans done on a back issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-fast-fifty-sydney-test-2659619-2025-01-04",
      "headline": "Rishabh Pant sets SCG on fire with 29-ball fifty vs AustraliaAustralia vs India: Rishabh Pant hit the second-fastest Test fifty by an Indian during the fifth Test against Australia at the Sydney Cricket Ground on Saturday. Pant's thrilling innings came to an end on 61 runs off just 33 balls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-virat-kohli-out-edged-to-slips-scg-test-2659613-2025-01-04",
      "headline": "Virat Kohli, you're done: Fans furious as Australian horror endsSenior India batter Virat Kohli once again edged the ball back to slips on Saturday, January 4. This was Kohli's 8th dismissal of the same manner in 9 innings in India's tour of Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-5th-test-virat-kohli-angry-outside-off-stump-dismissal-scott-boland-sydney-2659608-2025-01-04",
      "headline": "Watch: Virat Kohli punches himself in frustration after familiar dismissal in SydneyVirat Kohli was left fuming at himself as the star batter was dismissed once again by a delivery outside off-stump on Day 2 of the Sydney Test. Kohli was dismissed by Scott Boland once again in the second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-5th-test-day-two-virat-kohli-captaincy-sydney-fans-reaction-2659600-2025-01-04",
      "headline": "Masterclass: Acting captain Virat Kohli earns praise in Sydney Test after India take leadFans were left in awe of Virat Kohli's captaincy on Day 2 of the Sydney Test as India bowled out Australia for 181 runs. Kohli took over the captaincy as Bumrah left the field after a back issue on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/rohit-sharma-opens-up-about-his-absence-from-sydney-test-2659596-2025-01-04",
      "headline": "Rohit Sharma opens up about his absence from Sydney TestRohit Sharma has addressed his absence from the Sydney Test and stated that he stepped down from the team. Rohit was criticised for his poor form as he scored just 31 runs in 5 innings at an average of 6.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rishabh-pant-fast-fifty-sydney-test-2659619-2025-01-04",
      "headline": "Rishabh Pant sets SCG on fire with 29-ball fifty vs AustraliaAustralia vs India: Rishabh Pant hit the second-fastest Test fifty by an Indian during the fifth Test against Australia at the Sydney Cricket Ground on Saturday. Pant's thrilling innings came to an end on 61 runs off just 33 balls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-virat-kohli-out-edged-to-slips-scg-test-2659613-2025-01-04",
      "headline": "Virat Kohli, you're done: Fans furious as Australian horror endsSenior India batter Virat Kohli once again edged the ball back to slips on Saturday, January 4. This was Kohli's 8th dismissal of the same manner in 9 innings in India's tour of Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-5th-test-virat-kohli-angry-outside-off-stump-dismissal-scott-boland-sydney-2659608-2025-01-04",
      "headline": "Watch: Virat Kohli punches himself in frustration after familiar dismissal in SydneyVirat Kohli was left fuming at himself as the star batter was dismissed once again by a delivery outside off-stump on Day 2 of the Sydney Test. Kohli was dismissed by Scott Boland once again in the second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-5th-test-day-two-virat-kohli-captaincy-sydney-fans-reaction-2659600-2025-01-04",
      "headline": "Masterclass: Acting captain Virat Kohli earns praise in Sydney Test after India take leadFans were left in awe of Virat Kohli's captaincy on Day 2 of the Sydney Test as India bowled out Australia for 181 runs. Kohli took over the captaincy as Bumrah left the field after a back issue on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/rohit-sharma-opens-up-about-his-absence-from-sydney-test-2659596-2025-01-04",
      "headline": "Rohit Sharma opens up about his absence from Sydney TestRohit Sharma has addressed his absence from the Sydney Test and stated that he stepped down from the team. Rohit was criticised for his poor form as he scored just 31 runs in 5 innings at an average of 6.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-jasprit-bumrah-injury-update-back-scans-hospital-bgt-sydney-2659594-2025-01-04",
      "headline": "Jasprit Bumrah injury update: India captain taken for scans due to back issueIndia captain Jasprit Bumrah was seen leaving the field midway through Day 2 of the Sydney Test match. Sources told India Today that Burmrah was taken for back scans at a hospital in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-rohit-sharma-future-india-captain-scg-test-2659586-2025-01-04",
      "headline": "Let them earn it: Rohit Sharma remains coy on future India captainIndia captain Rohit Sharma remained coy on the question of future India captain. Rohit said that India had many talented youngsters but they had to earn the captaincy like MS Dhoni and Virat Kohli did previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-5th-test-day-two-jasprit-bumrah-leaves-scg-scans-injury-concern-2659579-2025-01-04",
      "headline": "5th Test: Jasprit Bumrah leaves SCG on Day 2 in a car, likely taken for scansIn a worrying sight for the Indian cricket team fans, captain Jasprit Bumrah was seen leaving the SCG on Day 2 of the ongoing Sydney Test on Saturday, June 4. Bumrah bowled 8 overs on the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-sam-konstas-feud-rohit-sharma-interview-sydney-2659568-2025-01-04",
      "headline": "Rohit Sharma on Bumrah-Konstas feud: Bol bachchan karna, shobha nahi deteRohit Sharma has commented on the Jasprit Bumrah-Sam Konstas feud and claimed that his players are calm until the opponents keep poking them. Bumrah and Konstas would exchange a few words during the final over of Day 1 of the Sydney Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-interview-star-sports-video-india-vs-australia-bgt-retirement-dressing-room-leaks-2659567-2025-01-04",
      "headline": "Rohit Sharma's full interview: Reacts to retirement talk, dressing room leaksIND vs AUS: India captain Rohit Sharma laid it bare in a candid interview with Star Sports in the New Year's Test. Sharma spoke in detail about the dressing room leaks, him getting dropped from the SCG Test, and his retirement plans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2659561-2025-01-04",
      "headline": "Rohit Sharma earns massive praise from Manjrekar for 'honest take' on his formFormer India cricketer turned commentator Sanjay Manjrekar has praised India captain Rohit Sharma for his honest take on his form as he revealed the reasoning behind him being rested from the fifth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-interview-video-no-retirement-test-cricket-ind-vs-aus-sydney-test-match-2659559-2025-01-04",
      "headline": "Not retiring: Rohit confirms Test future after stepping down from SCG TestIndia captain Rohit Sharma provided clarity on his Test future after stepping down from the Sydney Test match. The India captain confirmed that he was not retiring from Test cricket and only skipped this Test due to poor form."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-test-rohit-sharma-sydney-test-miss-interview-2659556-2025-01-04",
      "headline": "I stood down: Rohit Sharma breaks silence on missing Sydney TestRohit Sharma has revealed that he decided to step down for the Sydney Test to make way for an in-form player to come into the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-interview-star-sports-video-india-vs-australia-bgt-retirement-dressing-room-leaks-2659567-2025-01-04",
      "headline": "Rohit Sharma's full interview: Reacts to retirement talk, dressing room leaksIND vs AUS: India captain Rohit Sharma laid it bare in a candid interview with Star Sports in the New Year's Test. Sharma spoke in detail about the dressing room leaks, him getting dropped from the SCG Test, and his retirement plans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2659561-2025-01-04",
      "headline": "Rohit Sharma earns massive praise from Manjrekar for 'honest take' on his formFormer India cricketer turned commentator Sanjay Manjrekar has praised India captain Rohit Sharma for his honest take on his form as he revealed the reasoning behind him being rested from the fifth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-interview-video-no-retirement-test-cricket-ind-vs-aus-sydney-test-match-2659559-2025-01-04",
      "headline": "Not retiring: Rohit confirms Test future after stepping down from SCG TestIndia captain Rohit Sharma provided clarity on his Test future after stepping down from the Sydney Test match. The India captain confirmed that he was not retiring from Test cricket and only skipped this Test due to poor form."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-test-rohit-sharma-sydney-test-miss-interview-2659556-2025-01-04",
      "headline": "I stood down: Rohit Sharma breaks silence on missing Sydney TestRohit Sharma has revealed that he decided to step down for the Sydney Test to make way for an in-form player to come into the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-chats-with-teammates-during-drinks-break-on-day-2-of-the-sydney-test-2659549-2025-01-04",
      "headline": "Pic: 'Rested' Rohit Sharma walks onto field, chats with bowlers during breakIndia captain Rohit Sharma was seen having a chat with teammates during the drinks break on Day 2 of the fifth Test against Australia at the Sydney Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-dismisses-travis-head-sam-konstas-aus-vs-ind-sydney-test-day-2-border-gavaskar-trophy-2024-25-2659548-2025-01-04",
      "headline": "Watch: Mohammed Siraj gets rid of Travis Head, Sam Konstas in single over on Day 2India fast bowler Mohammed Siraj managed to get the big scalps of Sam Konstas and Travis Head in a single over on Day 2 of the fifth Test against Australia at the Sydney Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-jasprit-bumrah-picks-most-wickets-by-an-indian-bowler-in-a-test-series-in-australia-bishan-singh-bedi-2659547-2025-01-04",
      "headline": "AUS vs IND: Jasprit Bumrah breaks 46-year-old Indian Test record in AustraliaIndia fast bowler Jasprit Bumrah broke the 46-year-old record of legendary India spinner Bishan Singh Bedi as he registered the most wickets by  an Indian bowler in a Test series in Australia. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}