{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-likely-to-begin-first-deliveries-in-india-from-august-report-2754454-2025-07-11",
      "headline": "Elon Musk's Tesla likely to begin first deliveries in India from August: ReportThis move comes at a key moment for Tesla. The carmaker has seen sales dip in other countries and is now turning to India, the world's third-largest car market, to reach new buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-nithin-kamath-hits-back-at-dark-patterns-used-by-financial-apps-2754421-2025-07-11",
      "headline": "Zerodha's Nithin Kamath hits back at 'dark patterns' used by financial appsNithin Kamath says these tricks are designed to push people into taking actions that are not in their best interest, just so companies can make more money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-690-points-lower-nifty-settles-below-25200-tcs-falls-4-percent-hul-shares-gain-2754367-2025-07-11",
      "headline": "Sensex ends 690 points lower, Nifty settles below 25,200; TCS falls 4%The S&P BSE Sensex was down by 689.81 points to end at 82,500.47, while the NSE Nifty50 lost 205.40 points to close at 25,149.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-bank-licence-rbi-government-plan-likely-report-2754342-2025-07-11",
      "headline": "New banks coming soon? India eyes first permits since 2014, says reportThe government and central bank are said to be considering multiple steps to create more, larger and stronger banks that can support India's ambitious economic growth plans over the coming decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-rs-5-lakh-health-insurance-should-you-buy-a-top-up-or-higher-sum-insured-2754300-2025-07-11",
      "headline": "Got Rs 5 lakh health insurance? Should you buy a top-up or higher sum insuredWhen you file a claim, your base policy settles the expenses first. If the bill crosses that limit, the top-up steps in. Normally, your base plan pays up to its maximum, and then the top-up kicks in to handle the rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-700-points-nifty-plunge-stock-market-crash-1-why-it-stocks-down-1-percent-hul-share-price-2754233-2025-07-11",
      "headline": "Sensex plunges 700 points: Why the stock market fell 1% today? The S&P BSE Sensex fell nearly 700 points to 82,509.59, while the NSE Nifty50 declined by nearly 200 points to 25,162.25 as of 12:21 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-and-itr-3-excel-utilities-released-who-can-file-and-what-is-new-2754212-2025-07-11",
      "headline": "ITR-2 and ITR-3 excel utilities released: Who can file and what's new?ITR-2 is meant for individuals or Hindu Undivided Families (HUFs) who are not eligible to file ITR-1 (Sahaj). This form is meant for taxpayers who do not have any income from business or profession and do not earn any income like interest, salary, bonus, commission, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-breaks-117000-mark-reaches-all-time-high-crypto-prices-ethereum-altcoins-rise-dogecoin-gain-2754173-2025-07-11",
      "headline": "Bitcoin breaks $117,000 mark, reaches all-time highAt the time of writing at 11.00 am, the world's largest cryptocurrency is trading at $117,863.18, climbing by 6.13% over the last 24 hours. Crypto experts believe if the supportive policies continue, digital coins could see even more new money coming in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-showroom-experience-center-mumbai-opening-july-15-elon-musk-entry-india-2754155-2025-07-11",
      "headline": "Tesla drives into India: Mumbai to get first experience centre on July 15The space will allow visitors to explore Tesla's electric cars and related technologies, though test drives and deliveries may not be offered at this stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-share-price-fall-it-stocks-down-weak-q1-results-should-you-buy-expert-view-sensex-nifty-2754140-2025-07-11",
      "headline": "TCS falls 2% on Q1 results miss. Should you buy as IT stocks struggle?TCS share price: The IT giant has lost 2.74% over the past five days and declined 4.37% in the past month. Over a six-month period, the stock is down 22.63%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-rise-4-percent-priya-nair-new-ceo-rohit-jawa-replacement-leadership-change-2754108-2025-07-11",
      "headline": "Explained: Why HUL shares rose 4% todayHUL shares were up 3.8%, trading at Rs 2,500 as of 9;25 am, compared to Thursday's closing price of Rs 2,409.05. The stock ended Thursday's session nearly 1% lower but has gained 3.58% in the past five days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-280-points-lower-nifty-below-25300-hul-up-3-percent-2754105-2025-07-11",
      "headline": "Sensex opens 280 points lower, Nifty below 25,300; HUL up 4%The S&P BSE Sensex was down 250.37 points to 82,939.91, while the NSE Nifty50 lost 64.95 points to 25,290.30 as of 9:32 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-shares-paris-pics-fans-wonder-seoul-los-angeles-kim-taehyung-2754489-2025-07-11",
      "headline": "BTS' V shares Paris pics, fans wonder if he's in Seoul or Los AngelesBTS member V's whereabouts spark fan frenzy, with speculation rife over whether he's in Los Angeles, Seoul, or Paris. Here's what we know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-steals-the-show-as-monica-in-rajinikanth-coolie-second-song-2754496-2025-07-11",
      "headline": "Pooja Hegde steals the show as Monica in Rajinikanth's Coolie second songRajinikanth's 'Coolie' latest song 'Monica' featuring Pooja Hegde delivers a vibrant dance performance. The energetic track, backed by Anirudh Ravichander's beats and a star-studded cast, promises a grand release on August 14, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maalik-review-rajkummar-rao-gritty-underworld-drama-lacks-depth-2754475-2025-07-11",
      "headline": "Maalik review: Rajkummar Rao enjoys the gritty role, sadly, audiences don'tRelease Date:Fri Jul 11, 2025Maalik movie review: The film showcases Rajkummar Rao's gritty portrayal of an underworld don in the 80s Prayagraj. Despite strong performances, the film struggles with clichéd storytelling and emotional disconnect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-jurassic-park-prove-fans-pay-for-premium-entertainment-despite-high-ticket-rates-2754461-2025-07-11",
      "headline": "F1, Jurassic Park prove fans pay for premium entertainment despite high ticket ratesThe recent success of Hollywood films like 'Jurassic World' and 'F1' in India shows that audiences are willing to pay higher ticket prices for a premium cinematic experience despite previous concerns about affordability. Industry experts believe that strong content and immersive formats are reviving theatre business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-trailer-reaction-ajay-devgn-trolls-pakistan-fan-reaction-2754426-2025-07-11",
      "headline": "Son of Sardaar 2 trailer reaction: Ajay trolls Pakistan, sparks mixed fan buzzThe trailer of Ajay Devgn and Mrunal Thakur-starrer 'Son of Sardaar 2' was unveiled today. The film also stars Ravi Kishan, Sanjay Mishra, Neeru Bajwa and Chunky Panday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katseye-blackpink-jisoo-jennie-rose-lisa-yoonchae-sophia-lara-manon-daniela-megan-gnarly-gabriela-2754370-2025-07-11",
      "headline": "Is KATSEYE the next BLACKPINK or are we asking the wrong question?K-pop's newest sensation, KATSEYE, is climbing the charts and redefining fashion. This week on K-fix, we ask, is BLACKPINK finally facing real competition?\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-recalls-being-harassed-2754389-2025-07-11",
      "headline": "Fatima Sana Shaikh recalls being harassed, says just being a girl is enoughActor Fatima Sana Shaikh opened up about being physically assaulted after confronting a man who touched her inappropriately, highlighting the fear and caution women are forced to live with. She also recalled facing harassment during the Covid-19 lockdown, stressing how simply being a woman invites such behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/aankhon-ki-gustaakhiyanreview-shanaya-kapoor-promising-debut-predictable-plot-vikrant-massey-film-2754371-2025-07-11",
      "headline": "Aankhon Ki Gustaakhiyan review: Shanaya makes promising debut in predictable plotRelease Date:Fri Jul 11, 2025'Aankhon Ki Gustaakhiyan' movie review: Actor Shanaya Kapoor makes an impressive debut in director Santosh Singh's 80s-themed love story. Despite Kapoor's acting potential and Vikrant Massey's convincing portrayal, the film falters due to cliched storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-health-weight-loss-rumours-dhadak-2-trailer-launch-says-wellness-routine-not-illness-2754380-2025-07-11",
      "headline": "Karan Johar hits back at health and weight-loss rumours: I'm alive, will stay aliveFilmmaker Karan Johar dismissed health concerns at the 'Dhadak 2' trailer launch. He said his weight loss is attributed to a revamped wellness routine, not health issues. Johar said he intends to live healthily for his children and his future projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jump-single-comeback-hardstyle-world-tour-2754365-2025-07-11",
      "headline": "BLACKPINK returns with high-energy single Jump after three yearsBLACKPINK has made a powerful comeback with their new single Jump after a three-year group hiatus. The release coincides with the launch of their ambitious Deadline World Tour across multiple continents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-trailer-siddhant-chaturvedi-triptii-dimri-inter-cast-love-story-cursed-by-society-2754366-2025-07-11",
      "headline": "Dhadak 2 trailer: Siddhant, Triptii battle caste and conflict in important filmSiddhant Chaturvedi and Triptii Dimri starrer 'Dhadak 2' trailer is out. Directed by Shazia Iqbal, the film will release in theatres on August 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-on-the-raja-saab-and-dhurandhar-clash-i-hope-they-dont-2754348-2025-07-11",
      "headline": "Sanjay Dutt on The Raja Saab and Dhurandhar clash: I hope they don'tSanjay Dutt, who is part of both 'The Raja Saab' and 'Dhurandhar', has expressed concern over the films releasing on the same day. While promoting 'KD – The Devil', the actor spoke about his roles, bonding with Prabhas, and his admiration for Telugu cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-on-diljit-dosanjh-criticism-and-trolling-for-sardaar-ji-3-at-son-of-sardaar-2-trailer-launch-viral-video-2754334-2025-07-11",
      "headline": "I am not in his shoes: Ajay says conversation needed between Diljit and his criticsDuring the trailer launch of 'Son of Sardaar 2,' Ajay Devgn reacted to the criticism and trolling that Diljit Dosanjh is facing for his film 'Sardaar Ji 3', which features Pakistani actor Hania Aamir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-had-tough-time-doing-viral-finger-dance-from-son-of-sardaar-2-2754333-2025-07-11",
      "headline": "Ajay Devgn had tough time doing viral finger dance from Son of Sardaar 2At the trailer launch of 'Son of Sardaar 2', Ajay Devgn addressed the viral memes about his quirky dance step with a humble request for gratitude despite the criticism. The film, set in scenic Scotland and marking Mukul Dev's last appearance, releases on July 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/surya-sethupathi-vijay-sethupathi-advice-nepotism-teamwork-tamil-debut-phoenix-2754275-2025-07-11",
      "headline": "Vijay Sethupathi's son Surya shares his father's advice for him before debutVijay Sethupathi's son Surya Sethupathi debuted in Tamil cinema with 'Phoenix'. The young debutant shared two key pieces of advice he got from his father before the release of his film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-controversy-it-all-started-janaki-vs-stat-of-kerala-producer-suresh-kumar-censorship-row-2754289-2025-07-11",
      "headline": "It all started with Empuraan: Malayalam producer on JSK censorship rowAccording to producer Suresh Kumar, the release of Mohanlal's 'L2: Empuraan' has made the Censor Board more vigilant, impacting other films. The latest case involves 'JSK' aka 'Janaki vs State of Kerala' facing title-related censorship issues"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayats-ashok-pathak-on-being-typecast-nobody-really-wants-to-put-in-effort-2754256-2025-07-11",
      "headline": "Panchayat's Ashok Pathak on being typecast: Nobody really wants to put in effortIn an exclusive interaction with IndiaToday.in, 'Panchayat's Ashok Pathak opened up about being typecast in the series. The actor stated that nobody wants to put in the hard work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kuberaa-on-ott-when-and-where-to-watch-dhanush-nagarjunas-gritty-telugu-thriller-2754290-2025-07-11",
      "headline": "Kuberaa on OTT: When and where to watch Dhanush, Nagarjuna's gritty Telugu thrillerSekhar Kammula's 'Kuberaa', starring Dhanush, Nagarjuna Akkineni, and Rashmika Mandanna, is all set to premiere on Prime Video. The film, praised for its gripping tale and strong performances, explores the dark alleys of Mumbai through a story of conspiracy, ambition, and redemption."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/radhika-yadav-autopsy-tennis-player-shot-dead-gurugram-update-fir-2754418-2025-07-11",
      "headline": "4 bullets to chest: Radhika's autopsy contradicts 'father shot from behind' claimAutopsy reports of Radhika Yadav have revealed that four bullets, not three, fired at the tennis player's chest, contradicting the FIR that claimed that his father had shot her from behind.."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shiv-sena-ub-mp-sanjay-raut-shares-shinde-sena-leaders-video-with-cash-pm-amit-shah-take-note-2754386-2025-07-11",
      "headline": "Video shows Sena MLA Sanjay Shirsat with bag full of cash day after tax noticeIn the video, Maharashtra Social Justice Minister Sanjay Shirsat can be seen sitting in his bedroom smoking a cigarette and a bag containing a stash of cash is open beside him. Another suitcase is visible nearby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-semifinals-updates-carlos-alcaraz-novak-djokovic-jannik-sinner-taylor-fritz-2754425-2025-07-11",
      "headline": "Semi-finals live: Taylor Fritz bounces back to win 2nd set vs Carlos AlcarazWimbledon semi-finals Live Updates: Taylor Fritz has made a stunning comeback to win the second set against Carlos Alcaraz on Centre Court. Later in the day, Novak Djokovic will be up against World No.1 Jannik Sinner on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-day-2-live-score-updates-lords-joe-root-stokes-gill-2754292-2025-07-11",
      "headline": "3rd Test, Day 2 Live: Rahul, Nair steady after Archer removes JaiswalIND vs ENG, Lord's Test Day 2 Live Score: KL Rahul and Karun Nair have calmed the nerves in the dressing room with their brief partnership after Jofra Archer struck in his very first over of his comeback Test as he made Yashasvi Jaiswal edge to first slip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-is-the-election-commission-interfering-in-the-election-process-aadhaar-bihar-roll-forms-2754500-2025-07-11",
      "headline": "Why is the Election Commission interfering in the election process?The Election Commission, the guardian of fairness, is stooping to their statutory duty. It's shocking to see a constitutional authority interfering in the democratic process. Next, they'll tell us elections should be won by clean, spotless politicians without spending beyond the statutory limit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-breaks-kapil-devs-record-5-fer-at-lords-2754486-2025-07-11",
      "headline": "Bumrah breaks Kapil Dev's record, registers most away 5-wicket hauls for IndiaFast bowler Jasprit Bumrah broke Kapil Dev's record as he registered the most five-wicket hauls away from home for India, with his marvellous bowling spell on Day 2 of the third Test at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maalik-review-rajkummar-rao-gritty-underworld-drama-lacks-depth-2754475-2025-07-11",
      "headline": "Maalik review: Rajkummar Rao enjoys the gritty role, sadly, audiences don'tRelease Date:Fri Jul 11, 2025Maalik movie review: The film showcases Rajkummar Rao's gritty portrayal of an underworld don in the 80s Prayagraj. Despite strong performances, the film struggles with clichéd storytelling and emotional disconnect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/will-congress-pick-shashi-tharoors-dare-on-emergency-excesses-2753801-2025-07-10",
      "headline": "Will Congress pick Shashi Tharoor's dare on Emergency 'excesses'?His remarks have triggered a new political storm and feed into the BJP's narrative of the Emergency as the darkest chapter in modern Indian history\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/mahatma-gandhi-nobel-peace-prize-trump-assassination-why-he-never-won-1948-debate-posthumous-missing-laureate-2754323-2025-07-11",
      "headline": "Did Godse also kill Gandhi's chance of getting the Nobel Peace Prize?Though nominated five times, Mohandas Karamchand Gandhi never won the Nobel Peace Prize. On the shortlist in 1948, Gandhi was assassinated by Nathuram Godse, just days before the committee's final decision. The Nobel Peace Prize wasn't awarded in 1948 as \"there was no suitable living candidate\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-likely-to-begin-first-deliveries-in-india-from-august-report-2754454-2025-07-11",
      "headline": "Elon Musk's Tesla likely to begin first deliveries in India from August: ReportThis move comes at a key moment for Tesla. The carmaker has seen sales dip in other countries and is now turning to India, the world's third-largest car market, to reach new buyers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/all-crew-muslim-ships-in-red-sea-dodging-houthi-attacks-through-messages-2754502-2025-07-11",
      "headline": "'All Crew Muslim': Ships in Red Sea dodging Houthi attacks through messagesIn recent days, more ships sailing through the southern Red Sea and the narrow Bab al-Mandab strait have added messages to their AIS public tracking profiles that can be seen when clicking on a vessel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/villagers-taunts-radhika-refusal-to-shut-tennis-school-triggered-father-sources-2754414-2025-07-11",
      "headline": "Tennis star's father contemplated taking own life before killing daughter: SourcesBefore the fateful day, Deepak Yadav spoke to his daughter Radhika several times and asked her to shut down her tennis academy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-bitter-truth-about-sugar-free-2753807-2025-07-10",
      "headline": "The bitter truth about sugar-freeSugar substitutes seem like the answer for diabetics. But as this industry booms, many are questioning safety\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-ball-change-stuart-broad-london-2754490-2025-07-11",
      "headline": "Dukes have a problem: Stuart Broad slams ball manufacturers after Lord's Test fiascoFormer England pacer Stuart Broad slammed the quality of the Dukes ball after it had to be changed after just 10.4 overs during the Lord's Test. The Dukes ball has courted controversy during the series as Indian team hasn't been happy with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-under-kash-patel-tests-employee-loyalty-with-polygraph-donald-trump-resignation-purged-2754269-2025-07-11",
      "headline": "FBI using lie detectors to test agents' Trump loyaltySince Kash Patel became FBI director, the bureau has expanded its use of polygraph tests to root out internal critics and leakers, with some employees questioned about speaking negatively of Patel. Former officials call the move politically charged, warning it undermines morale, silences dissent, and prioritises loyalty over competence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/jane-birkin-original-hermes-bag-sold-for-rs-85-crore-2754208-2025-07-11",
      "headline": "10 minutes. 9 bidders. And the OG Birkin sold for Rs 85 croreThe most coveted Hermes Birkin Bag, which was made for the late actress Jane Birkin, has been auctioned as the most valuable handbag sold so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-trailer-siddhant-chaturvedi-triptii-dimri-inter-cast-love-story-cursed-by-society-2754366-2025-07-11",
      "headline": "Dhadak 2 trailer: Siddhant, Triptii battle caste and conflict in important filmSiddhant Chaturvedi and Triptii Dimri starrer 'Dhadak 2' trailer is out. Directed by Shazia Iqbal, the film will release in theatres on August 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/bihars-kosi-curse-how-ai-can-predict-flood-risks-mitigate-losses-2754488-2025-07-11",
      "headline": "Bihar's Kosi curse: How AI can predict flood risks, mitigate lossesMassive flooding triggered by the Kosi river has caused extensive damage in parts of Bihar over the years, affecting lives and livelihoods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-retires-at-45-with-rs-4-7-crore-by-investing-early-in-sip-nephew-shares-story-reddit-mutual-funds-savings-2754508-2025-07-11",
      "headline": "Man retires at 45 with Rs 4.7 crore by investing early in SIP, nephew shares storyOn Reddit's r/IndianStockMarket page, the user shared a post titled \"He retired at 45 with Rs 4.7 crore,\" where he recounted the story of his uncle who managed to build his impressive retirement corpus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/president-donald-trump-picks-alpha-male-influencer-nick-adams-as-us-envoy-to-malaysia-2754478-2025-07-11",
      "headline": "Trump picks 'alpha male' influencer Nick Adams as US envoy to MalaysiaNick Adams, an Australian-born, who became a US citizen in 2021 and is considered one of Donald Trump's favourite figures on the internet, is a former Young Liberal and deputy mayor of Ashfield council in Sydney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aap-jaisa-koi-movie-review-r-madhavan-fatima-sana-shaikh-love-story-dull-rocky-aur-rani-aur-rani-ki-prem-kahani-2754226-2025-07-11",
      "headline": "Aap Jaisa Koi review: Madhavan-Fatima's love story is a dull Rocky Aur Rani...Release Date:Fri Jul 11, 2025Aap Jaisa Koi wants to be bold, progressive, and conversation-starting. But somewhere between intent and execution, this R Madhavan and Fatima Sana Shaikh film loses its spark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/aankhon-ki-gustaakhiyanreview-shanaya-kapoor-promising-debut-predictable-plot-vikrant-massey-film-2754371-2025-07-11",
      "headline": "Aankhon Ki Gustaakhiyan review: Shanaya makes promising debut in predictable plotRelease Date:Fri Jul 11, 2025'Aankhon Ki Gustaakhiyan' movie review: Actor Shanaya Kapoor makes an impressive debut in director Santosh Singh's 80s-themed love story. Despite Kapoor's acting potential and Vikrant Massey's convincing portrayal, the film falters due to cliched storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tennis-player-radhika-yadav-murder-whatsapp-chats-with-tennis-coach-exclusive-2754457-2025-07-11",
      "headline": "Idhar kafi restrictions hai, wanna enjoy life: Radhika's chats with tennis coachIndia Today has accessed Radhika Yadav's WhatsApp chats with her coach where she mentioned 'restrictions' and said she wanted to enjoy life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-diogo-jota-celebration-tribute-eng-vs-ind-2754497-2025-07-11",
      "headline": "Mohammed Siraj's heartfelt tribute to Diogo Jota in Lord's Test: WatchMohammed Siraj honoured Liverpool footballer Diogo Jota with a unique celebration during the Lord's Test. Jota's sudden death in a car crash has deeply affected the sporting community around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-steals-the-show-as-monica-in-rajinikanth-coolie-second-song-2754496-2025-07-11",
      "headline": "Pooja Hegde steals the show as Monica in Rajinikanth's Coolie second songRajinikanth's 'Coolie' latest song 'Monica' featuring Pooja Hegde delivers a vibrant dance performance. The energetic track, backed by Anirudh Ravichander's beats and a star-studded cast, promises a grand release on August 14, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/maalik-review-rajkummar-rao-gritty-underworld-drama-lacks-depth-2754475-2025-07-11",
      "headline": "Maalik review: Rajkummar Rao enjoys the gritty role, sadly, audiences don'tRelease Date:Fri Jul 11, 2025Maalik movie review: The film showcases Rajkummar Rao's gritty portrayal of an underworld don in the 80s Prayagraj. Despite strong performances, the film struggles with clichéd storytelling and emotional disconnect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-jurassic-park-prove-fans-pay-for-premium-entertainment-despite-high-ticket-rates-2754461-2025-07-11",
      "headline": "F1, Jurassic Park prove fans pay for premium entertainment despite high ticket ratesThe recent success of Hollywood films like 'Jurassic World' and 'F1' in India shows that audiences are willing to pay higher ticket prices for a premium cinematic experience despite previous concerns about affordability. Industry experts believe that strong content and immersive formats are reviving theatre business."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injury-training-session-lords-test-2754504-2025-07-11",
      "headline": "Rishabh Pant braves nasty injury, takes part in training at Lord's on Day 2India vice-captain Rishabh Pant fought through the pain to take part in a batting nets session during Day 2 of the ongoing Lord's Test on Friday, July 11. Pant injured his left index finger during Day 1 of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-diogo-jota-celebration-tribute-eng-vs-ind-2754497-2025-07-11",
      "headline": "Mohammed Siraj's heartfelt tribute to Diogo Jota in Lord's Test: WatchMohammed Siraj honoured Liverpool footballer Diogo Jota with a unique celebration during the Lord's Test. Jota's sudden death in a car crash has deeply affected the sporting community around the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-ball-change-stuart-broad-london-2754490-2025-07-11",
      "headline": "Dukes have a problem: Stuart Broad slams ball manufacturers after Lord's Test fiascoFormer England pacer Stuart Broad slammed the quality of the Dukes ball after it had to be changed after just 10.4 overs during the Lord's Test. The Dukes ball has courted controversy during the series as Indian team hasn't been happy with it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-breaks-kapil-devs-record-5-fer-at-lords-2754486-2025-07-11",
      "headline": "Bumrah breaks Kapil Dev's record, registers most away 5-wicket hauls for IndiaFast bowler Jasprit Bumrah broke Kapil Dev's record as he registered the most five-wicket hauls away from home for India, with his marvellous bowling spell on Day 2 of the third Test at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/families-should-support-female-athletes-think-about-country-first-neeraj-chopra-on-tennis-stars-murder-2754456-2025-07-11",
      "headline": "Neeraj reacts to Radhika Yadav murder: Families should support female athletesIndia's Javelin throw star Neeraj Chopra has reacted to the murder of Tennis player Radhika Yadav, who was shot dead by his father as he was enraged by her social media reels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-semifinals-updates-carlos-alcaraz-novak-djokovic-jannik-sinner-taylor-fritz-2754425-2025-07-11",
      "headline": "Semi-finals live: Taylor Fritz bounces back to win 2nd set vs Carlos AlcarazWimbledon semi-finals Live Updates: Carlos Alcaraz has won the opening set against Taylor Fritz on Centre Court. Later in the day, Novak Djokovic will be up against World No.1 Jannik Sinner on Centre Court. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-day-two-shubman-gill-mohammed-siraj-ball-change-2754419-2025-07-11",
      "headline": "Gill, Siraj left fuming at umpires after ball change in Lord's TestShubman Gill and Mohammed Siraj were left fuming at the umpires after the second ball was changed after just 10.4 overs. Gill was unhappy with the replacement ball that was taken by the umpires on day two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-dhruv-jurel-wicketkeeping-dinesh-karthik-lords-2754387-2025-07-11",
      "headline": "Rishabh Pant vs Dhruv Jurel: Karthik explains difference in wicketkeepersENG vs IND: Former Indian cricketer Dinesh Karthik analysed the wicketkeeping of Dhruv Jurel and Rishabh Pant on a similar delivery during Day 1 of the third Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injury-dhruv-jurel-replace-lords-test-day-2-2754368-2025-07-11",
      "headline": "Dhruv Jurel continues as keeper on Day 2, Pant still recoveringIndia vice-captain Rishabh Pant suffered a finger injury on Day 1 of the Lord's Test, prompting Dhruv Jurel to take over wicketkeeping duties on Day 2 against England, as confirmed by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/red-for-ruth-campaign-lords-lung-cancer-research-england-india-third-test-2754360-2025-07-11",
      "headline": "Lord's turns red on Day 2 to support Strauss Foundation and raise fundsLord's - the Home of Cricket - once again turned red for the Ruth Strauss Foundation's annual #RedforRuth day, held on the second day of the third Test between India and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-37th-hundred-rahul-dravid-lords-2753987-2025-07-11",
      "headline": "Lord's Test: With 37th century, Joe Root goes past Rahul Dravid and breaks into top 5Joe Root cracked into the top 5 list for the most Test hundreds with his 37th century against India on Day two of the match in Lord's. Root played 192 balls to get to his hundred. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-day-two-shubman-gill-mohammed-siraj-ball-change-2754419-2025-07-11",
      "headline": "Gill, Siraj left fuming at umpires after ball change in Lord's TestShubman Gill and Mohammed Siraj were left fuming at the umpires after the second ball was changed after just 10.4 overs. Gill was unhappy with the replacement ball that was taken by the umpires on day two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-dhruv-jurel-wicketkeeping-dinesh-karthik-lords-2754387-2025-07-11",
      "headline": "Rishabh Pant vs Dhruv Jurel: Karthik explains difference in wicketkeepersENG vs IND: Former Indian cricketer Dinesh Karthik analysed the wicketkeeping of Dhruv Jurel and Rishabh Pant on a similar delivery during Day 1 of the third Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injury-dhruv-jurel-replace-lords-test-day-2-2754368-2025-07-11",
      "headline": "Dhruv Jurel continues as keeper on Day 2, Pant still recoveringIndia vice-captain Rishabh Pant suffered a finger injury on Day 1 of the Lord's Test, prompting Dhruv Jurel to take over wicketkeeping duties on Day 2 against England, as confirmed by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/red-for-ruth-campaign-lords-lung-cancer-research-england-india-third-test-2754360-2025-07-11",
      "headline": "Lord's turns red on Day 2 to support Strauss Foundation and raise fundsLord's - the Home of Cricket - once again turned red for the Ruth Strauss Foundation's annual #RedforRuth day, held on the second day of the third Test between India and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-37th-hundred-rahul-dravid-lords-2753987-2025-07-11",
      "headline": "Lord's Test: With 37th century, Joe Root goes past Rahul Dravid and breaks into top 5Joe Root cracked into the top 5 list for the most Test hundreds with his 37th century against India on Day two of the match in Lord's. Root played 192 balls to get to his hundred. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}