{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-activity-in-march-expands-at-fastest-pace-in-8-months-2702741-2025-04-02",
      "headline": "Manufacturing activity in March expands at fastest pace in 8 monthsThe HSBC India Manufacturing Purchasing Managers' Index (PMI), compiled by S&P Global, bounced to 58.1 in March from 56.3 in February, higher than a preliminary estimate of 57.6 and firmly above 50.0 which separates growth from contraction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-400-points-nifty-rise-reasons-why-trump-tariff-liberation-day-failed-to-spook-dalal-street-investors-2702732-2025-04-02",
      "headline": "Sensex jumps 500 points: Why stock market is rising despite tariff concernsStock market today: The main indices on Dalal Street opened on a positive note on Wednesday despite concerns over Donald Trump's 'Liberation Day' tariff announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/white-house-confirms-new-reciprocal-tariffs-set-to-begin-soon-ytvd-2702722-2025-04-02",
      "headline": "White House confirms new reciprocal tariffs set to begin soonThe White House has confirmed that new reciprocal tariffs are set to begin in the next few hours. Donald Trump stated that India is likely to reduce its tariffs. The President's economic vision aims to improve American competitiveness, reduce trade deficits, and protect economic and national security. India is taking a wait-and-watch approach to assess the impact of these tariffs before considering any retaliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-liberation-day-donald-trump-announcements-impact-india-global-trade-explained-2702697-2025-04-02",
      "headline": "Countdown begins for Trump's 'Liberation Day' tariffs: What's at stake?Uncertainty grows as the world braces for Donald Trump's 'Liberation Day' tariffs. Global stock markets are volatile, major economies face tough choices, and fears of a trade war threaten to disrupt global commerce."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-are-dirty-15-nations-list-donald-trump-tariff-liberation-day-april-2-2702686-2025-04-02",
      "headline": "'Dirty 15' list: Which countries will suffer most from Trump's tariffs?The Trump administration has claimed that existing trade rules favour other countries at the expense of the US, and the new tariffs are seen as a response to these concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-over-200-points-nifty-above-23200-as-dalal-street-braces-for-liberation-day-tariffs-2702685-2025-04-02",
      "headline": "Sensex gains 400 points, Nifty climbs as tariff impact fails to rattle D-StreetThe S&P BSE Sensex gained 436.11 points to 76,460.62, while NSE Nifty50 added 106.30 points to 23,272.00 as of 9:34 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-april-2-what-to-expect-from-sensex-nifty-today-donald-trump-tariff-2702655-2025-04-02",
      "headline": "Sensex, Nifty opening today: What to expect from D-Street on Trump tariff day?Nifty and Sensex fell 1.5% and 1.8%, respectively, in the last session, marking their biggest single-day percentage fall in a month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-2-shares-in-focus-trump-tariff-dalal-street-sensex-nifty-2702642-2025-04-02",
      "headline": "Stocks to watch on April 2: Shares in focus; Tata Motors, Swiggy, Coal IndiaShares of companies such as Maruti Suzuki, Tata Motors, Tata Steel, Tata Consumer, Swiggy, Godavari Power, and Indian Bank will be in focus due to key developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-rules-know-all-the-rates-slabs-deductions-zero-tax-on-incomes-up-to-rs-12-lakh-and-more-2702350-2025-04-02",
      "headline": "New Income Tax rules: Know all rates, slabs, deductions and moreThe government has amended the income tax slabs under the new tax regime for FY 2025-26. According to the new structure, those earning up to Rs 4 lakh will pay no taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-crash-vix-volatility-fear-index-rise-10-percent-what-should-investors-know-expert-view-2702281-2025-04-01",
      "headline": "Stock market crash: Why should investors watch out for rising volatility?The stock market fear index surged 10% on Tuesday as investors braced for the impact of US reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-impact-on-india-stock-market-crash-sensex-nifty-correction-explained-2702178-2025-04-01",
      "headline": "Sensex down over 1,400 points: US tariff panic or other factors at play?Is the surrounding uncertainty reciprocal tariffs the only factor behind today's stock market bloodbath, or are other underlying issues driving the sharp correction? Read on to find out what's spooking Dalal Street investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-epfo-raise-claim-withdrawal-limit-from-rs-1-lakh-to-rs-5-lakh-in-april-2025-check-here-2702170-2025-04-01",
      "headline": "Will EPFO raise claim withdrawal limit to Rs 5 lakh in April 2025? Check hereEPFO is planning to allow Provident Fund (PF) withdrawals via UPI and ATMs soon. This move will make it easier for members to withdraw their PF money without delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-what-is-no-contest-clause-meaning-rs-3800-crore-wealth-distribution-2702173-2025-04-01",
      "headline": "Ratan Tata's will includes a 'no-contest' clause: What does it mean?Ratan Tata dedicated most of his fortune, including his Tata Sons shares, to charity. However, he also ensured that his family, close friends, employees, and even his cherished pets were taken care of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/10-major-financial-rule-changes-from-april-1-new-tax-rules-upi-updates-pan-aadhaar-updates-tds-gst-rules-2702124-2025-04-01",
      "headline": "10 major financial rule changes from April 1: Tax, UPI updates and moreFrom April 1, you won't have to pay income tax if your annual income is up to Rs 12 lakh. Also, with a standard deduction of Rs 75,000, income up to Rs 12.75 lakh is tax-free under the new tax system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-rs-3800-crore-who-gets-what-family-trust-pet-dog-2702120-2025-04-01",
      "headline": "Ratan Tata's Rs 3,800 crore will: Who gets what?Ratan Tata will: The industrialist, who died on October 9, 2024, left most of his wealth, including shares in Tata Sons, to charitable causes. At the same time, he did not forget his family, close friends, staff, and even his beloved pets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-slashed-by-rs-41-from-today-2702099-2025-04-01",
      "headline": "Commercial LPG cylinder prices slashed by Rs 41 from todayWhile the price of commercial LPG cylinders has been reduced, the price of domestic cylinders used by households has not changed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-rise-10-percent-reason-government-stake-increase-2702091-2025-04-01",
      "headline": "Explained: Why Vodafone Idea shares hit 10% upper circuit todayVodafone Idea share price: The stock has gained 4.47% in the past five days and 0.27% over the past month. However, it remains 26.45% lower over the past six months and has dropped 46.57% in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-hcltech-stock-price-why-are-it-shares-falling-today-key-reasons-explained-2702090-2025-04-01",
      "headline": "Infosys, TCS, HCLTech: Why are IT stocks down today?Shares of IT companies such as Tata Consultancy Services (TCS), Infosys and HCLTech took a big hit during intraday trade. Infosys was down over 2.3%, while HCLTech and TCS fell as much as 1.7% at around 10:10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-stock-price-rising-today-reasons-march-vehicle-registrations-update-2702080-2025-04-01",
      "headline": "Ola Electric shares gain 2% after update on March vehicle registrationsOla Electric shares were trading 2.15% higher at Rs 54.11 on the Bombay Stock Exchange (BSE) at around 9:55 am. The jump in its share price came after the company said there had been an improvement in vehicles registered in March. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-today-sensex-nifty-decline-us-donald-trump-reciprocal-tariff-impact-2702063-2025-04-01",
      "headline": "Sensex crashes 1,400 points. What's behind the stock market bloodbath?Stock market crash: The Sensex and Nifty fell sharply as investors on Dalal Street are worried about the impact of US reciprocal tariffs, which will take effect on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-400-points-nifty-slips-below-23500-as-tariff-jitters-hit-dalal-street-2702058-2025-04-01",
      "headline": "Sensex falls 400 points, Nifty slips below 23,500 as tariff jitters hit Dalal StreetThe S&P BSE Sensex was down 253.38 points to 77,161.54, while the NSE Nifty50 fell 46.80 points to 23,472.55 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-1-key-levels-to-watch-dalal-street-trump-tariff-2702027-2025-04-01",
      "headline": "Stock market opening on April 1: What to expect from Sensex, Nifty todayStock market today: Market experts believe that the early days of April 2025 will be important for investors due to several key events lined up this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-1-sensex-nifty-today-stock-market-news-ola-electric-indigo-hcltech-adani-energy-2702020-2025-04-01",
      "headline": "Stocks to watch on April 1: Shares in news; IndiGo, Ola, HCLTech, Vodafone IdeaAs markets resume trading, several stocks such as Adani Energy Solutions, IndiGo, Ola Electric, Vodafone Idea, HCLTech among others, are expected to be in focus due to company-specific updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-announces-small-savings-schemes-interest-rates-check-latest-ppf-ssy-and-others-2701779-2025-04-01",
      "headline": "Small savings interest rates: Check latest PPF, SSY and othersThe government examines and fixes interest rates on such schemes quarterly, depending on the economic scenario and market situation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-nasdaq-fall-to-lowest-levels-in-over-six-months-amid-tariff-worries-glbs-2701933-2025-03-31",
      "headline": "S&P 500, Nasdaq fall to lowest levels in over six months amid tariff worriesUS stocks tumbled to their lowest levels in over six months as worries over new tariffs weighed on investor sentiment. With fears of a global slowdown and rising inflation, the S&P 500 and Nasdaq saw sharp declines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-drops-in-what-causing-indians-to-spend-less-2701752-2025-03-31",
      "headline": "Credit card spending drops. What's causing Indians to spend less?Big credit card issuers like HDFC Bank, SBI Cards, and ICICI Bank witnessed fewer new customers in February. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-could-lead-to-another-round-of-stock-market-correction-key-things-to-know-2701667-2025-03-31",
      "headline": "US reciprocal tariffs: Will Dalal Street face more turbulence from April 2?US reciprocal tariffs have put Dalal Street on edge as investors brace for potential market swings. With FPIs cautious and auto stocks under pressure, domestic markets could face more turbulence in the near term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-stock-market-impact-9-stocks-to-watch-buy-sell-hold-investor-advice-expert-view-2701644-2025-03-31",
      "headline": "Trump tariffs could hit these 9 stocks. Should you sell?The IT sector is under pressure due to concerns over Trump's trade policies and potential increases in H-1B visa costs. Indian IT firms earn over 50% of their revenue from the US, making them vulnerable to higher hiring costs and reduced outsourcing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-primark-boss-paul-marchant-resigns-after-error-of-judgement-2701626-2025-03-31",
      "headline": "UK's Primark boss resigns after 'error of judgement' in social settingThe group said on Monday that Paul Marchant had cooperated with an investigation led by external lawyers, acknowledged his \"error of judgement\" and accepted that his actions fell below the standards expected by AB Foods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/claiming-hra-but-not-paying-tds-beware-of-tax-notices-and-penalties-2701582-2025-03-31",
      "headline": "Claiming HRA but not paying TDS? Beware of tax notices and penaltiesThe landlord's PAN must be mentioned in the TDS challan. However, if the PAN is missing or inactive, the TDS is levied at 20% under Section 206AA. On the other hand, for Non-Resident Indian (NRI) landlords, the rate of TDS is 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-fy26-slow-start-4-listings-sme-platform-desco-infratech-shri-ahimsa-naturals-atc-energies-2701574-2025-03-31",
      "headline": "IPO market off to a slow start in FY26, but these 4 firms to debut soonThe IPO pipeline for FY26 could be worth nearly Rs 2 lakh crore. Some major companies, including Zepto, Reliance Jio, and LG Electronics, are reportedly in the process of finalising their listing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldiram-stake-sale-temasek-pwc-expansion-snacks-packaged-foods-market-2701531-2025-03-31",
      "headline": "Haldiram's to sell stake to Singapore's Temasek, says PwCThis stake sale is expected to help Haldiram expand both in India and internationally, strengthening its position in the highly competitive snacks and packaged foods market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-eid-2025-is-nse-bse-closed-for-trading-monday-dalal-street-sensex-nifty-2701479-2025-03-31",
      "headline": "Is stock market closed today for Eid?The stock market follows a five-day workweek, operating from Monday to Friday. Regular trading hours are from 9:15 am to 3:30 pm. Markets remain closed on weekends and designated public holidays as per the official schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-dance-kajra-re-wedding-pics-from-festivities-go-viral-2702748-2025-04-02",
      "headline": "Aishwarya-Abhishek's Kajra Re performance lights up family wedding. WatchAbhishek Bachchan and Aishwarya Rai's videos and pictures from a wedding have gone viral. One of the clips featured the couple, along with their daughter, dancing to Kajra Re. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/laapataa-ladies-plagiarism-allegations-resembling-arabic-film-burqa-city-2702702-2025-04-02",
      "headline": "Laapataa Ladies faces plagiarism claims over similarities with Arabic filmKiran Rao's Laapataa Ladies recently faced plagiarism claims after a viral video showed its resemblance to the 2019 Arabic film Burqa City. The Kiran Rao directorial was released in theatres on March 1, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/val-kilmer-batman-jim-morrison-dies-pneumonia-throat-cancer-2702703-2025-04-02",
      "headline": "Val Kilmer, actor who played Batman and Jim Morrison, dies of pneumonia at 65American actor Val Kilmer died at the age of 65. His daughter, Mercedes Kilmer, said that the cause of death was pneumonia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/would-a-show-like-adolescence-be-approved-in-india-sudhir-mishra-weighs-in-2702695-2025-04-02",
      "headline": "Would a show like Adolescence be approved in India? Sudhir Mishra weighs inFilm director Sudhir Mishra questioned Adolescence's Netflix India success, calling it \"the best news in years.\" He said India must produce stories of such quality instead of dumbing down content for audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-slams-studio-ghibli-trend-ai-plagiarisation-2702675-2025-04-02",
      "headline": "Singer Vishal Dadlani slams Studio Ghibli trendSinger-composer Vishal Dadalni recently criticised the Studio Ghibli trend on social media. He called it 'AI Plagiarisation.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-collection-day-6-mohanlal-prithviraj-sukumaran-rs-100-crore-nett-in-india-2702670-2025-04-02",
      "headline": "Empuraan box office Day 6: Mohanlal's film sees drop, eyes Rs 100 crore in IndiaMohanlal's L2: Empuraan, directed by Prithviraj Sukumaran, saw a slight drop in numbers on Tuesday. The film is marching towards Rs 100 crore nett at the domestic box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-struggles-at-box-office-after-eid-boost-earns-rs-195-crore-on-day-3-2702661-2025-04-02",
      "headline": "Salman Khan's Sikandar sees drop after decent start, earns Rs 19.5 crore on Day 3Sikandar box office collection Day 3: Salman Khan's film collected Rs 19.5 crore on Tuesday, bringing its total to Rs 74.5 crore in India. The film faces competition from Mohanlal's L2: Empuraan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/keanu-reeves-to-return-as-hitman-in-john-wick-chapter-5-chad-stahelski-2702658-2025-04-02",
      "headline": "Keanu Reeves to return as hitman in John Wick Chapter 5Actor Keanu Reeves and director Chad Stahelski are set to reunite for John Wick: Chapter 5. The upcoming installment was announced at CinemaCon in Las Vegas.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apporva-mukhija-deletes-instagram-photos-ranveer-allahbadia-samay-raina-india-got-latent-row-2702654-2025-04-02",
      "headline": "Apoorva Mukhija deletes all Instagram pics months after India's Got Latent rowInfluencer and actor Apoorva Mukhija deleted her Instagram posts months after India's Got Latent controversy. Popularly known as The Rebel kid, she faced charges over her vulgar and offensive comments on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-revised-re-edited-version-releases-after-24-volutary-cuts-2702634-2025-04-02",
      "headline": "Mohanlal-starrer Empuraan's re-edited version out in theatres after 24 cutsThe re-edited version of actor Mohanlal and director Prithviraj Sukumaran's L2: Empuraan was screened in theatres on Tuesday. The makers voluntarily went for re-censoring and the censor board suggested 24 cuts, including deletion of two minutes of footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-splits-from-fiance-jonathan-davino-heres-why-glbs-2702597-2025-04-01",
      "headline": "Sydney Sweeney splits from fiancé Jonathan Davino: Here's whySydney Sweeney has ended her engagement to Jonathan Davino, prioritising her career over wedding plans. The Madame Webb star is focused on upcoming projects, including Euphoria and The Housemaid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-justin-baldoni-legal-battle-docuseries-on-discovery-2702577-2025-04-01",
      "headline": "Docuseries on Justin Baldoni, Blake Lively's legal feud in worksA docuseries on the legal battle between actors Blake Lively and Justin Baldoni's will be available on Discovery, promising an intriguing look into the complexities of legal disputes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lawrence-welcomes-baby-no-2-with-husband-cooke-maroney-glbs-2702587-2025-04-01",
      "headline": "Jennifer Lawrence welcomes second child with husband Cooke MaroneyActor Jennifer Lawrence welcomed her second child with her husband Cooke Maroney. The got married in October 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-saldana-joins-kendrick-lamar-and-gracie-abrams-in-webby-nominations-glbs-2702567-2025-04-01",
      "headline": "Zoe Saldaña joins Kendrick Lamar and Gracie Abrams in Webby nominationsWith nearly 13,000 entries from over 70 countries, the competition includes viral music videos, top podcasts, and unexpected social media sensations. Voting for the Webby People's Voice Award is open until April 17, with winners announced on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jason-momoa-confirms-he-is-returning-to-the-dune-universe-2702481-2025-04-01",
      "headline": "Jason Momoa confirms he is returning to the Dune universeHollywood star Jason Momoa will be returning to the science-fiction world of Dune, the actor confirmed in a recent interview. He played Duncan Idaho in the first part. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/barkha-bisht-karan-singh-grover-relationship-got-attracted-to-his-kindness-2702505-2025-04-01",
      "headline": "Barkha Bisht recalls relationship with Karan Singh GroverIn a candid interview, Barkha Bisht discussed her past relationships, revealing the reasons behind her breakup with Karan Singh Grover. She shared that she was attracted to his kindness, and grew apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-on-sardar-2-the-sequel-will-feature-a-much-bigger-war-2702468-2025-04-01",
      "headline": "Karthi on Sardar 2: The sequel will feature a much bigger warThe teaser for the highly anticipated sequel, Sardar 2, showcases Karthi reprising his dual roles as Indian spy Sardar and his son Vijay, gearing up for a much larger war."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-to-be-tabled-in-lok-sabha-today-amid-nda-india-bloc-showdown-2702636-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition backing bill in private: Minister as Parliament braces for Waqf showdownThe Waqf (Amendment) Bill, 2024, is set to be introduced in the Lok Sabha today. The Bill seeks to amend the 1995 Waqf Act to address issues in managing Waqf properties, but the opposition plans to vote against it after a full discussion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-budget-session-live-updates-waqf-bill-opposition-bjp-congress-lok-sabha-rajya-sabha-2702630-2025-04-02#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live: Top Muslim body calls Waqf JPC a sham ahead of parliament fireworksWaqf Amendment Bill Live Updates: The Lok Sabha is set to debate and vote on the contentious Waqf (Amendment) Bill today, with the government resolute in pushing it forward while the Opposition stands united in denouncing it as unconstitutional. The bill is expected to reach the Rajya Sabha on Thursday, with both Houses allotted eight hours each for deliberations. Key NDA allies — Telugu Desam Party (TDP), Janata Dal (United), Shiv Sena (Eknath Shinde), and LJP (Ram Vilas) — have issued whips directing their MPs to back the government's position. Meanwhile, the opposition INDIA bloc showcased a united front on Wednesday, strategising its collective resistance to the bill in a meeting held at Parliament House. Follow indiatoday.in for more updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-ceasefire-agreement-loc-poonch-jammu-kashmir-indian-army-retaliates-2702528-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak army attempts to cross LoC, 4-5 infiltrators killed in Indian firing: SourcesThe Indian Army successfully thwarted an infiltration attempt by the Pakistan Army in the Krishna Ghati area of Poonch district."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-are-dirty-15-nations-list-donald-trump-tariff-liberation-day-april-2-2702686-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Dirty 15' list: Which countries will suffer most from Trump's tariffs?The Trump administration has claimed that existing trade rules favour other countries at the expense of the US, and the new tariffs are seen as a response to these concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-owner-sanjiv-goenka-in-intense-discussion-with-rishabh-pant-2702720-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Deja vu? Sanjiv Goenka confronts Rishabh Pant, shades of KL Rahul momentLucknow Super Giants (LSG) owner Sanjiv Goenka was seen having an intense chat with captain Rishabh Pant following their eight-wicket loss against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/khalistani-terrorist-gurpatwant-pannun-summons-ajit-doval-pm-modi-us-visit-secret-service-2702723-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pannun claims he served summons on Ajit Doval during PM's US visit, court deniesKhalistani terrorist Gurpatwant Pannun has filed a lawsuit against Ajit Doval and another Indian national over an alleged foiled plot to kill him in the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-in-parliament-whos-for-whos-against-and-can-bjp-push-it-through-2702726-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Bill battle: Who's for, who's against, and can BJP push it through?Union Minister Kiren Rijiju will reintroduce the contentious Waqf (Amendment) Bill, 2024, in the Lok Sabha today, as the opposition gears up to block its passage.\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ayodhya-style-ram-temple-west-bengal-nandigram-mamata-banerjee-political-nursery-digha-jagannath-temple-2702443-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ayodhya-style Ram temple in Mamata's political nursery NandigramBengal BJP leader Suvendu Adhikari will be laying the foundation of an Ayodhya-style Ram temple in Nandigram, the epicentre of Mamata Banerjee's movement that saw her rise to power. BJP members' chanting of \"Jai Shri Ram\" has often evoked strong reactions from the Trinamool Congress chief. This is the politics behind the temple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-dance-kajra-re-wedding-pics-from-festivities-go-viral-2702748-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aishwarya-Abhishek's Kajra Re performance lights up family wedding. WatchAbhishek Bachchan and Aishwarya Rai's videos and pictures from a wedding have gone viral. One of the clips featured the couple, along with their daughter, dancing to Kajra Re. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/laapataa-ladies-plagiarism-allegations-resembling-arabic-film-burqa-city-2702702-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Laapataa Ladies faces plagiarism claims over similarities with Arabic filmKiran Rao's Laapataa Ladies recently faced plagiarism claims after a viral video showed its resemblance to the 2019 Arabic film Burqa City. The Kiran Rao directorial was released in theatres on March 1, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-up-400-points-nifty-rise-reasons-why-trump-tariff-liberation-day-failed-to-spook-dalal-street-investors-2702732-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex jumps 500 points: Why stock market is rising despite tariff concernsStock market today: The main indices on Dalal Street opened on a positive note on Wednesday despite concerns over Donald Trump's 'Liberation Day' tariff announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/what-makes-benny-blanco-the-green-forest-selena-gomez-and-every-girl-truly-deserves-2702506-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What makes Blanco the 'green flag' Selena Gomez (and every girl) truly deservesBenny Blanco isn't just another celebrity boyfriend - he stands out in a world where emotional availability in men often feels like a rare commodity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/val-kilmer-batman-jim-morrison-dies-pneumonia-throat-cancer-2702703-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Val Kilmer, actor who played Batman and Jim Morrison, dies of pneumonia at 65American actor Val Kilmer died at the age of 65. His daughter, Mercedes Kilmer, said that the cause of death was pneumonia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-assembly-row-bjp-mlas-accuse-own-government-of-dodging-queries-in-assembly-2702704-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Madhya Pradesh BJP MLAs accuse own government of dodging queries in assemblyThe MLAs were left dissatisfied when the Revenue Department stated that the answers to their queries lie in the assembly library annexures. To their disappointment, the MLAs found out that there was no such information available, as was claimed by the department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-updates-israel-expands-military-operation-in-gaza-plans-to-seize-large-areas-2702761-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel expands military operation in Gaza, plans to seize large areasIn a statement, Defence Minister Israel Katz said there would be large-scale evacuation of population from areas where there is fighting, and urged Gazans to eliminate Hamas and return Israeli hostages as the only way to end the war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-revised-re-edited-version-releases-after-24-volutary-cuts-2702634-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohanlal-starrer Empuraan's re-edited version out in theatres after 24 cutsThe re-edited version of actor Mohanlal and director Prithviraj Sukumaran's L2: Empuraan was screened in theatres on Tuesday. The makers voluntarily went for re-censoring and the censor board suggested 24 cuts, including deletion of two minutes of footage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/keralas-low-even-10-year-olds-high-on-drugs-finds-govt-survey-2702409-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala's low: Even 10-year-olds high on drugs, finds govt surveyThe Pinarayi Vijayan government is planning a massive awareness campaign as rampant drug abuse threatens an entire generation and spurs violent crimes"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/18-year-old-multimillionaire-ceo-shares-college-admission-essay-after-harvard-yale-stanford-rejections-2702724-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18-year-old millionaire CEO shares admission essay after Harvard, Yale rejectionsIn a post on X that went viral with 10 million views, Zach Yadegari, co-founder and CEO of nutrition tracking app Cal AI, shared the names of several colleges that had rejected him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-liberation-day-donald-trump-announcements-impact-india-global-trade-explained-2702697-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Countdown begins for Trump's 'Liberation Day' tariffs: What's at stake?Uncertainty grows as the world braces for Donald Trump's 'Liberation Day' tariffs. Global stock markets are volatile, major economies face tough choices, and fears of a trade war threaten to disrupt global commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/world-autism-day-risk-reduced-pregnancy-maternal-health-genetics-2702735-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can autism risk be reduced during pregnancy?While the precise causes of autism remain an area of ongoing research, evidence suggests that both genetic and environmental factors during pregnancy can influence its occurrence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-judge-blocks-trump-administration-mass-firing-probationary-federal-employees-orders-asks-to-follow-required-procedures-2702633-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US judge blocks Trump administration from sacking federal workers on probationA federal judge said that the Trump administration cannot fire thousands of probationary federal workers without following the required procedure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-astronaut-sunita-williamss-heartwarming-reunion-with-her-dogs-one-brings-her-a-stick-2702646-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Sunita Williams's heartwarming reunion with her dogs after returning homeNearly two weeks after her return to Earth, Sunita Williams has now shared a heartwarming video of her long-awaited reunion with her dogs. In the video, she is seen stepping out of her house, only to be greeted excitedly by her two Labrador retrievers -- Gunner and Gorby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-cm-mk-stalin-to-bring-resolution-on-permanent-retrieval-of-katchatheevu-island-2702716-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin to introduce resolution in Tamil Nadu assembly to get Katchatheevu backTamil Nadu Chief Minister MK Stalin will bring in a resolution in Assembly to retrieve Katchatheevu island as a permanent solution to the issue of fishermen being arrested by Sri Lankan Navy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-nikola-jokic-scores-career-high-61-points-but-falls-short-as-timberwolves-edge-nuggets-in-2ot-thriller-glbs-2702750-2025-04-02",
      "headline": "NBA: Nikola Jokić scores career-high 61 points but falls short as Timberwolves edge Nuggets in 2OT thrillerNikola Jokic scored a career-high 61 points; however, the Denver Nuggets still fell short in a double-overtime thriller against the Minnesota Timberwolves in a regular NBA game on Tuesday, April 1, at Ball Arena, losing 140-139."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-pbks-zaheer-khan-on-rishabh-pants-form-2702740-2025-04-02",
      "headline": "Rishabh Pant will soon come good as a batter: LSG mentor Zaheer KhanLucknow Super Giants (LSG) mentor Zaheer Khan has backed captain Rishabh Pant to soon come good as a batter in the Indian Premier League 2025 (IPL 2025). Pant has scored just 17 runs to his name from three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-pbks-nehal-wadhera-full-press-conference-2702731-2025-04-02",
      "headline": "My plan was to make sure pressure didn't get to Shreyas Iyer: Nehal WadheraPunjab Kings (PBKS) batter Nehal Wadhera opened up about his game plan after his match-winning innings against Lucknow Super Giants (LSG) at the Ekana Stadium. Wadhera scored an unbeaten 43* (25) with the help of three fours and four sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-shreyas-iyer-punjab-kings-captaincy-2702612-2025-04-02",
      "headline": "Shreyas Iyer's fight for deserved recognition at Punjab Kings takes flightIPL 2025: At the Kolkata Knight Riders, Shreyas Iyer struggled to get enough recognition, but at the Punjab Kings, he has a chance to make a name for himself and grab the limelight with his incredible leadership qualities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-owner-sanjiv-goenka-in-intense-discussion-with-rishabh-pant-2702720-2025-04-02",
      "headline": "Deja vu? Sanjiv Goenka confronts Rishabh Pant, shades of KL Rahul momentLucknow Super Giants (LSG) owner Sanjiv Goenka was seen having an intense chat with captain Rishabh Pant following their eight-wicket loss against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-nehal-wadhera-on-ricky-ponting-lsg-vs-pbks-2702694-2025-04-02",
      "headline": "Nehal Wadhera reveals how Ricky Ponting left him surprised with his selectionPunjab Kings (PBKS) batter Nehal Wadhera revealed how head coach Ricky Ponting left him surprised with his selection in the team during the game against Lucknow Super Giants (LSG). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-prasidh-krishna-full-press-conference-ahead-of-rcb-vs-gt-clash-2702674-2025-04-02",
      "headline": "Familiar with conditions at Chinnaswamy, will need to execute well: GT's KrishnaGujarat Titans (GT) bowler Prasidh Krishna said that he and Mohammed Siraj are well aware of the conditions at the M. Chinnaswamy Stadium in Bengaluru ahead of their Indian Premier League 2025 (IPL 2025) clash against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-director-of-cricket-mo-bobat-full-press-conference-rcb-vs-gt-2702659-2025-04-02",
      "headline": "Atmosphere at the Chinnaswamy will be intimidating for opposition: RCB DirectorRoyal Challengers Bengaluru (RCB) director of Cricket Mo Bobat has said that the fans at the M. Chinnaswamy Stadium will create an intimidating atmosphere for the opposition ahead of their first home game of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans (GT)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-weather-forecast-pitch-report-bengaluru-2702403-2025-04-02",
      "headline": "RCB vs GT pitch report, weather prediction IPL 2025: Will rain play spoilsport?RCB are set for an electrifying homecoming at Chinnaswamy Stadium, facing Gujarat Titans in their first IPL 2025 home fixture. With both teams coming off strong performances, fans can expect a high-scoring thriller under the Bengaluru lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-predicted-xi-fantasy-picks-2702643-2025-04-02",
      "headline": "IPL 2025, RCB vs GT predicted XI, fantasy picks: Players who can fetch you most pointsRoyal Challengers Bengaluru (RCB) and Gujarat Titans (GT) will lock horns in Match 14 of the Indian Premier League 2025 (IPL 2025). Both teams are full of several match-winners having the ability to turn the game in their team's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-rcb-vs-gt-preview-team-news-stats-prediction-2702635-2025-04-02",
      "headline": "RCB vs GT preview: After flying start, RCB look to conquer home disadvantageIPL 2025, RCB vs GT: After having made a solid start to their new season, RCB and new captain Rajat Patidar face a big test at home as they take on Gujarat Titans at M Chinnaswamy Stadium on Wednesday. With a revamped bowling attack and momentum on their side, they aim to overcome past woes at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-prasidh-krishna-full-press-conference-ahead-of-rcb-vs-gt-clash-2702674-2025-04-02",
      "headline": "Familiar with conditions at Chinnaswamy, will need to execute well: GT's KrishnaGujarat Titans (GT) bowler Prasidh Krishna said that he and Mohammed Siraj are well aware of the conditions at the M. Chinnaswamy Stadium in Bengaluru ahead of their Indian Premier League 2025 (IPL 2025) clash against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-director-of-cricket-mo-bobat-full-press-conference-rcb-vs-gt-2702659-2025-04-02",
      "headline": "Atmosphere at the Chinnaswamy will be intimidating for opposition: RCB DirectorRoyal Challengers Bengaluru (RCB) director of Cricket Mo Bobat has said that the fans at the M. Chinnaswamy Stadium will create an intimidating atmosphere for the opposition ahead of their first home game of the Indian Premier League 2025 (IPL 2025) against Gujarat Titans (GT)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-weather-forecast-pitch-report-bengaluru-2702403-2025-04-02",
      "headline": "RCB vs GT pitch report, weather prediction IPL 2025: Will rain play spoilsport?RCB are set for an electrifying homecoming at Chinnaswamy Stadium, facing Gujarat Titans in their first IPL 2025 home fixture. With both teams coming off strong performances, fans can expect a high-scoring thriller under the Bengaluru lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-predicted-xi-fantasy-picks-2702643-2025-04-02",
      "headline": "IPL 2025, RCB vs GT predicted XI, fantasy picks: Players who can fetch you most pointsRoyal Challengers Bengaluru (RCB) and Gujarat Titans (GT) will lock horns in Match 14 of the Indian Premier League 2025 (IPL 2025). Both teams are full of several match-winners having the ability to turn the game in their team's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-rcb-vs-gt-preview-team-news-stats-prediction-2702635-2025-04-02",
      "headline": "RCB vs GT preview: After flying start, RCB look to conquer home disadvantageIPL 2025, RCB vs GT: After having made a solid start to their new season, RCB and new captain Rajat Patidar face a big test at home as they take on Gujarat Titans at M Chinnaswamy Stadium on Wednesday. With a revamped bowling attack and momentum on their side, they aim to overcome past woes at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-2011-world-cup-final-ms-dhoni-gautam-gambhir-anniversary-14-2702615-2025-04-02",
      "headline": "India's 2011 World Cup winning squad: Where are they now on 14th anniversary?14 years ago on this very day, MS Dhoni's India won the ODI World Cup after beating Sri Lanka by six wickets in front of a packed house at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-zaheer-khan-lsg-vs-pbks-press-conference-2702618-2025-04-02",
      "headline": "Zaheer Khan takes a dig at LSG curator: Didn't seem like a home gameIPL 2025, LSG vs PBKS: Mentor Zaheer Khan said that the Lucknow Super Giants didn't get the home advantage they would have expected in their clash against the Punjab Kings on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-lsg-vs-pbks-second-spot-lucknow-2702617-2025-04-02",
      "headline": "IPL 2025 Points Table, April 1: PBKS jump to 2nd after thrashing LSGPunjab Kings jumped to second in IPL 2025 points table after thrashing Lucknow Super Giants, as skipper Shreyas Iyer and Prabhsimran Singh star in a dominant chase at the Ekana Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-hyderabad-cricket-association-complimentary-passes-agreement-2702616-2025-04-02",
      "headline": "IPL 2025: SRH, Hyderabad board bury the hatchet over free ticket rowSunrisers Hyderabad and the Hyderabad Cricket Association reached a resolution over complimentary ticket distribution, safeguarding home IPL 2025 matches at the Rajiv Gandhi International Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-auction-tension-comment-2702600-2025-04-01",
      "headline": "Punjab Kings troll Rishabh Pant for auction tension joke after hammering LucknowIPL 2025, LSG vs PBKS: Punjab Kings took a cheeky dig at Rishabh Pant for his viral 'tension' comment earlier this year after hammering Lucknow Super Giants by 8 wickets on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-hyderabad-cricket-association-complimentary-passes-agreement-2702616-2025-04-02",
      "headline": "IPL 2025: SRH, Hyderabad board bury the hatchet over free ticket rowSunrisers Hyderabad and the Hyderabad Cricket Association reached a resolution over complimentary ticket distribution, safeguarding home IPL 2025 matches at the Rajiv Gandhi International Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-auction-tension-comment-2702600-2025-04-01",
      "headline": "Punjab Kings troll Rishabh Pant for auction tension joke after hammering LucknowIPL 2025, LSG vs PBKS: Punjab Kings took a cheeky dig at Rishabh Pant for his viral 'tension' comment earlier this year after hammering Lucknow Super Giants by 8 wickets on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-isaiah-stewart-and-four-others-face-suspension-as-scuffle-broke-out-during-pistons-vs-timberwolves-glbs-2702582-2025-04-01",
      "headline": "NBA: Isaiah Stewart and four others face suspension as scuffle broke out during Pistons vs TimberwolvesDuring the NBA regular game between the Detroit Pistons and Minnesota Timberwolves on Sunday, March 30, at Target Center, five players faced a one-game suspension due to an on-court altercation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mo-bobat-rajat-patidar-2702568-2025-04-01",
      "headline": "Rajat Patidar been everything we expected: RCB director Mo BobatIPL 2025: RCB Director of Cricket Mo Bobat praised Rajat Patidar for his captaincy as the Royal Challengers Bengaluru are sitting on top of the table in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-shubman-gill-approachable-prasidh-krishna-2702558-2025-04-01",
      "headline": "Shubman Gill is very easy to approach: Prasidh Krishna praises GT captainPrasidh Krishna praised Shubman Gill's captaincy for Gujarat Titans, calling him approachable and supportive. Gujarat Titans aim to build momentum against in-form Royal Challengers Bangalore in their crucial IPL 2025 clash at Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-digvesh-rathi-notebook-celebration-priyansh-arya-virat-kohli-2702557-2025-04-01",
      "headline": "LSG's Digvesh Rathi does iconic notebook celebration, gets umpire warningIPL 2025, LSG vs PBKS: Lucknow spinner Digvesh Rathi pulled off the iconic notebook celebration to tease Punjab Kings batter Priyansh Arya after dismissing him. The celebration gained popularity during a banter between Virat Kohli and West Indies fast bowler Kesrick Williams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-punjab-kings-auction-joke-2702534-2025-04-01",
      "headline": "Rishabh Pant's Punjab Kings auction joke comes back to haunt him in LucknowIPL 2025, LSG vs PBKS: Several fans on social media trolled Rishabh Pant for his joke about Punjab Kings after the wicketkeeper-batter failed with the bat against PBKS on Tuesday, April 1. Pant has endured a dreadful start to the new season with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abdul-samad-arshdeep-singh-scoop-lsg-vs-pbks-2702529-2025-04-01",
      "headline": "Watch: Abdul Samad hits Arshdeep Singh for outrageous reverse scoopIPL 2025, LSG vs PBKS: Abdul Samad scored a brisk 12-ball 27 and also played an outrageous scoop for a boundary off Arshdeep Singh in the 18th over of Lucknow's innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-2nd-odi-live-streaming-hamilton-2702504-2025-04-01",
      "headline": "New Zealand vs Pakistan, 2nd ODI Live Streaming: When and where to watchPAK vs NZ, 2nd ODI: After winning the first ODI by 73 runs at McLean Park in Napier, New Zealand would be looking to claim the series in the second game at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-rishabh-pant-hattrick-failure-lucknow-super-giants-vs-punjab-kings-2702497-2025-04-01",
      "headline": "Rs 27 crore for what? Rishabh Pant slammed after hat-trick of failures for LSGRishabh Pant's dismal start to IPL 2025 continues as fans criticise the Lucknow Super Giants skipper for failing to justify his Rs 27 crore price tag. With just 17 runs in three matches, Pant's performance has left supporters frustrated and questioning his value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mohammed-siraj-virat-kohli-bromance-video-2702494-2025-04-01",
      "headline": "Watch: Mohammed Siraj hugs Virat Kohli ahead of first game vs RCB in 8 yearsIPL 2025, RCB vs GT: Mohammed Siraj reunited with his former teammates Virat Kohli, Rajat Patidar and Yash Dayal on the eve of the first game of the season in Bengaluru. Siraj will lead Gujarat's bowling attack against RCB on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-men-rob-walter-head-coach-2702484-2025-04-01",
      "headline": "Rob Walter steps down as South Africa men's head coachAfter signing a four-year deal with the Proteas, Rob Walter has put down his papers as the head coach of the South Africa men's white-ball teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-best-scouting-award-ashwani-kumar-mumbai-indians-shreevats-goswami-2702479-2025-04-01",
      "headline": "IPL should introduce Best Scouting Award: Ex-RCB starFormer India and RCB cricketer Shreevats Goswami has called for the introduction of a special award in the Indian Premier League to recognise the best scouting team each season, believing it would motivate franchises to take scouting more seriously and continue discovering fresh cricketing talent."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}