{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-auto-stocks-shine-tata-motors-bajaj-2656032-2024-12-27",
      "headline": "Sensex, Nifty open higher as auto stocks fuel early rally; Tata Motors up 2%The S&P BSE Sensex was up 323.12 points to 78,795.60, while the NSE Nifty50 gained 101.95 points to 23,852.15 as of 9:44 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-mamata-machinery-concord-transrail-sanathan-textiles-gmp-5-ipos-market-debut-today-2656022-2024-12-27",
      "headline": "Dam Capital to Mamata Machinery: GMPs of 5 IPOs ahead of D-Street debut todayThese initial public offerings (IPOs), which opened for subscription on December 19 and closed on December 23, collectively raised over Rs 2,900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-death-3-key-economic-reforms-liberalisation-licence-raj-mnrega-shaped-modern-india-2656013-2024-12-27",
      "headline": "Manmohan Singh's key reforms that shaped Indian economyDr Manmohan Singh's tenure as Finance Minister in the early 1990s and later as Prime Minister from 2004 to 2014 introduced policies that continue to influence India's growth. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-on-work-life-balance-spend-four-hours-with-family-2655881-2024-12-26",
      "headline": "Gautam Adani on work-life balance: Spend at least 4 hours with familyChairperson of Adani Group, Gautam Adani, shared his take on work-life balance and said one must try to spend at least four hours with their families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-relief-consideration-government-sources-2655736-2024-12-26",
      "headline": "Government may consider tax relief for income of up to Rs 10.50 lakh: ReportThe move, likely to be announced in the upcoming Budget 2025 on February 1, aims to boost consumption and address concerns over rising living costs amid a slowing economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/banks-can-charge-over-30-percent-interest-on-credit-card-dues-says-supreme-court-what-it-means-for-you-2655722-2024-12-26",
      "headline": "Banks can charge over 30% interest on credit card dues. What it means for youThe Supreme Court has ruled that banks charging high credit card interest rates is lawful, placing responsibility on consumers to manage dues efficiently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-on-used-cars-5-faqs-you-should-know-2655687-2024-12-26",
      "headline": "GST on used cars: 5 FAQs you should knowGST on used cars rises to 18%, impacting dealer margins and platform sales, but personal sales remain unaffected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-close-flat-fmcg-stocks-drag-markets-adani-ports-gain-5-percent-2655649-2024-12-26",
      "headline": "Sensex, Nifty end flat as early gains wiped out by decline in FMCG stocks The S&P BSE Sensex added 18.18 points to close at 78,491.05, while the NSE Nifty50 was up 22.55 points to end the day at 23,750.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-day-3-latest-subscription-gmp-why-are-brokers-bullish-on-it-2655642-2024-12-26",
      "headline": "Unimech Aerospace IPO: Why are brokers bullish on it? Check latest GMPUnimech Aerospace IPO: Unimech Aerospace aims to raise Rs 500 crore through the IPO, which includes a fresh issue of Rs 250 crore and an offer for sale (OFS) of Rs 250 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/newgen-software-share-price-surges-8-percent-why-multibagger-it-stock-gained-today-2655636-2024-12-26",
      "headline": "Newgen Software share price surges 8%. Why multibagger IT stock gained today?Newgen Software stock price: The stock surged 7.67% to touch a day's high of Rs 1,725.15 on the Bombay Stock Exchange, up from its previous close of Rs 1,602.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-for-uan-and-aadhaar-linking-under-the-employment-linked-incentive-eli-scheme-all-you-need-to-know-2655614-2024-12-26",
      "headline": "EPFO extends deadline for UAN and Aadhaar linking: All you need to knowThe EPFO's deadline extension to January 15, 2025, allows employees extra time to activate UAN and link Aadhaar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-soar-earn-up-to-74-percent-with-dcb-indusind-yes-bank-of-baroda-axis-bank-karur-vysya-bank-hdfc-bank-and-icici-bank-2655583-2024-12-26",
      "headline": "FD rates soar: Earn up to 7.4% with DCB, IndusInd, YES, Axis and other top banksWith appealing FD rates of up to 7.4%, investors can enjoy guaranteed returns and financial security, making FDs a preferred option for low-risk investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-share-price-surges-15-hits-record-high-whats-should-investors-do-2655585-2024-12-26",
      "headline": "Mobikwik share price surges 15%, hits record high: Shoud investors book profit? At around 1:38 pm, shares of the company were trading 11% higher at Rs 675.90. The stock has delivered stellar returns, surging over 150% from its issue price of Rs 279, marking it as a multibagger for investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sips-analysis-34-mutual-funds-lost-money-in-2024-quant-psu-fund-aditya-birla-sl-psu-equity-fund-2655577-2024-12-26",
      "headline": "SIPs in red: Mutual funds that lost money for investors in 2024SIPs (systematic investment plans) have been the go-to strategy for people looking to dodge market volatility while building a financial cushion, but over 34 mutual funds lost money for investors in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anya-polytech-and-fertilizers-ipo-check-latest-gmp-price-band-lot-size-stmp-2655561-2024-12-26",
      "headline": "Anya Polytech & Fertilizers IPO: Check latest GMP, price band, lot sizeAnya Polytech and Fertilizers IPO: Investors opting for a single lot will require Rs 1,40,000 at the upper price band. Non-retail investors must apply for at least two lots, amounting to Rs 2,80,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-stock-price-rises-nearly-5-in-early-trade-should-you-buy-2655539-2024-12-26",
      "headline": "Mazagon Dock share price rises nearly 5% in early trade. Should you buy?Mazagon Dock stock price: The company's shares gained nearly 5% in early trade, but pared some gains as the session progressed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-apples-steve-jobs-advice-fueled-the-creation-of-salesforces-appexchange-marc-benioff-2655538-2024-12-26",
      "headline": "How Steve Jobs' advice fuelled the creation of Salesforce's AppExchangeSalesforce's Marc Benioff credits Steve Jobs' visionary advice for inspiring the creation of the transformative AppExchange platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/international-gemmological-institute-share-price-jumped-10-percent-today-2655527-2024-12-26",
      "headline": "Explained: Why International Gemmological Institute share price jumped 10% todayInternational Gemmological Institute stock price: In a stock exchange filing, IGI confirmed that it had acquired a 100% stake in IGI Netherlands B.V. and International Gemmological Institute BV for $88.44 million and $69.76 million, respectively."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-falls-sharply-today-explained-2655519-2024-12-26",
      "headline": "NTPC Green Energy share price falls sharply today. Here's whyNTPC Green Energy Stock: The company debuted on the Indian stock exchanges on November 29, listing at Rs 111.50 on the NSE, just 3.2% above its issue price of Rs 108 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sumitomo-mitsui-financial-group-smfg-infuses-rs-3000-crore-into-smfg-india-credit-via-rights-2655515-2024-12-26",
      "headline": "Sumitomo Mitsui strengthens Indian subsidiary with Rs 3,000 crore fundingWith this, SMFG India Credit has seen its highest-ever annual fund infusion of Rs 4,300 crore in the 2024 financial year, following an earlier investment of Rs 1,300 crore in April 2024."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-death-seven-day-national-mourning-former-prime-minister-conrgess-2655939-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7-day national mourning to be declared in tribute to former PM Manmohan SinghManmohan Singh death: Former Prime Minister Manmohan Singh, the architect of India's economic liberalisation, died on Tursday at 92 in Delhi after a prolonged illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singhs-last-words-before-2014-lok-sabha-polls-history-will-be-kinder-to-me-2655940-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Manmohan Singh said 'history will be kinder to me'Manmohan Singh defended his leadership as Prime Minister in 2014, asserting it was not weak. He believed history would judge him more kindly than the media. He died at 92. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-condoles-manmohan-singh-death-distinguished-leader-wisdom-humility-2655918-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I was Chief Minister when he...: PM Modi remembers Manmohan SinghPrime Minister Narendra Modi fondly recalled his regular interactions with Manmohan Singh during their respective tenures as Gujarat Chief Minister and Prime Minister, praising Singh's wisdom and humility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-2-live-scores-reactions-melbourne-updates-boxing-day-2655932-2024-12-27?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 2 Live Updates: India lose KL Rahul, Rohit, Australia in control at TeaAustralia (AUS) vs India (IND) 4th Test, Day 2 Live Updates, Reactions: India captain Rohit Sharma fails on his return to the opening spot. Rohit gets dismissed for just 3 runs by Pat Cummins. KL Rahul and Yashasvi Jaiswal have kept India steady after that. Earlier, Australia were bowled out for 474 runs after batting for one and a half days in the Boxing Day Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/photo/manmohan-singh-life-in-pictures-former-pm-death-congress-sonia-gandhi-obama-george-bush-2655941-2024-12-26?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Quiet leader: Manmohan Singh's life in picturesFormer PM Manmohan Singh died at the age of 92 after battling age-related health issues. Here are some pictures that capture his life as a politician and a two-time Prime Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-prime-minister-manmohan-singhs-dies-top-quotes-demonetisation-are-getting-deeper-2655976-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Scars of demonetisation are getting deeper: Top quotes of Manmohan SinghFormer PM Manmohan Singh, architect of India's economic reforms and a visionary leader, died aged 92. His legacy includes economic liberalisation, global cooperation, and inclusive growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-ravi-shastri-virat-kohli-clown-aussie-newspaper-sam-konstas-2656002-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli depicted as clown in Australian newspaper, Ravi Shastri reactsAustralia vs India, 4th Test: Ravi Shastri said he was not surprised by the over-the-top reaction of the Australian media to Virat Kohli's on-field bust-up with Sam Konstas in Melbourne. On Friday, a newspaper depicted Kohli as a clown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gay-serial-killer-from-punjab-who-killed-11-men-wore-makeup-as-kid-was-hurt-by-comments-on-sexuality-2656009-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gay serial killer from Punjab wore makeup as kid, was hurt by comments on sexualityThe 33-year-old man, who operated primarily on highways in Punjab, confessed that he couldn't accept slurs about his body and identity, and his last murder was directly linked to such remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/renting-wedding-lehenga-is-practical-but-why-indian-brides-still-not-up-for-it-2655776-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Renting wedding lehenga is practical, but why are Indian brides still not up for itPractical, sustainable, and hassle-free, renting a wedding lehenga seems perfect in theory. Yet, it remains far from becoming a mainstream choice among Indian brides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-passes-away-rahul-gandhi-gulam-nabi-azad-congress-leaders-pay-tributes-2655929-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lost mentor: Rahul Gandhi, other Congress leaders pay tributes to Manmohan SinghFormer Prime Minister and veteran Congress leader Manmohan Singh, widely regarded as the architect of India's economic reforms, died on Thursday after he was admitted to New Delhi's All India Institute of Medical Sciences (AIIMS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-passes-away-death-role-indian-economy-stance-nuclear-civil-deal-us-2655894-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manmohan Singh: A reformer who unfettered economy, stood firm on US nuclear dealFormer Prime Minister Manmohan Singh is known for helping liberalise India's economy and usher in economic growth. However, it was with Singh at the helm that UPA II was hit by policy paralysis. What is less discussed is how Singh stood his ground during the negotiations for the 2008 US-India Civil Nuclear Agreement despite severe political opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-global-media-reported-manmohan-singh-death-2656023-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mild-mannered, reluctant king: How global media reported Manmohan Singh's deathFormer Prime Minister Manmohan Singh's death prompted reflections worldwide, with global media highlighting his contributions, controversies, and legacy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-rohit-sharma-3-fails-return-as-opener-2656016-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Clueless Rohit Sharma out for 3, fails on return as openerBorder Gavaskar Trophy: India captain Rohit Sharma failed with the bat on his return as opener on Day 2 of the Boxing Day Test at the MCG. Pat Cummins removed Rohit for 3 in the post-lunch session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-death-aiims-congress-bjp-former-pm-leaders-condolences-tributes-2655910-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Gentle man in rough world of politics': Tributes pour in for Manmohan SinghPolitical leaders reflected upon two-time Prime Minister Manmohan Singh's legacy and said his contributions to the country will always be remembered."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-on-its-missile-being-linked-to-azerbaijan-plane-crash-do-not-hypothesise-2655848-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Do not hypothesise: Russia on its missile being linked to Azerbaijan plane crashThe Russian government has cautioned against speculating on the cause of the deadly plane crash in Kazakhstan, which killed 38 people on Wednesday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/chatgpt-faces-second-major-outage-in-december-2656015-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ChatGPT faces second major outage in one month, Microsoft reveals causeOpenAI's ChatGPT suffered another blow this month when you were asleep. The company confirmed that its AI models, including its video model, Sora and ChatGPT, were down for several hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/salman-khan-59-birthday-arbaaz-khan-sshura-iulia-vantur-sangeeta-bijlani-bobby-deol-arpita-khan-home-2655990-2024-12-27?utm_source=Photo_hp&utm_medium=Photo&utm_campaign=home_Photo",
      "headline": "Salman Khan's 59th birthday: Arbaaz-Sshura, Iulia Vantur and others attend bashSalman Khan is celebrating his 59th birthday on December 27. He arrived at his sister Arpita Khan's house to celebrate the night with his loved ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-rushdie-satanic-verses-controversy-protests-book-review-1988-interview-fatwa-2655656-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The book review that Rushdie says lit the Satanic Verses fireSalman Rushdie's The Satanic Verses arrived at a bookstore in India 37 years after it was published. An import ban by the Rajiv Gandhi government kept it away from Rushdie's native country for almost four decades. Rushdie alleged that a book review in India Today Magazine in 1988 \"lit the fire\". Here's how the review through a proof copy of the novel was written."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-teaser-postponed-manmohan-singh-death-new-date-out-2656025-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's Sikandar teaser delayed after Manmohan Singh's deathSalman Khan's Sikandar teaser has been rescheduled for December 28. It was earlier slated to release on December 27, on the actor's 59th birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-college-universities-students-winter-break-india-donald-trump-inaugration-january-2025-cornell-california-2655852-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Return ASAP: US universities rush students, including from India, amid Trump scareUS universities are asking international students, including those from India, to cut short their winter breaks and return as soon as possible. Top American universities have issued circulars, urging students to be back on campuses before President-elect Donald Trump's January 20 inauguration. Students' status is at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/babur-invade-india-letters-from-rana-sanga-of-mewar-what-historians-say-2655676-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Babur invade India after a letter from Rana Sanga? Here's what historians sayIt is often portrayed in mediaeval history that Babur's invasion of India occurred only after an invitation from Rana Sanga, the ruler of Mewar and the grandfather of Maharana Pratap. Historians have diverse opinions on this matter that warrant attention. What truly transpired, and who actually sent letters to Babur? Here's a detailed exploration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-india-players-black-armbands-tribute-former-pm-manmohan-singh-2655979-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India players wear black armbands in tribute to former PM Manmohan SinghIndian players sported black armbands on Friday, Day 2 of the Boxing Day Test against Australia in Melbourne, in honour of former Prime Minister Manmohan Singh, who passed away on Thursday.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/weather-on-new-year-delhi-haryana-jammu-and-kashmir-himachal-rain-snowfall-2656008-2024-12-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Himachal may get snow on new year amid cold wave, rain to continue in DelhiAccording to the IMD, a western disturbance is likely to interact with lower-level easterly winds, resulting in scattered to fairly widespread rainfall and snowfall over the western Himalayan region and intense cold waves in northern states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-relief-consideration-government-sources-2655736-2024-12-26?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government may consider tax relief for income of up to Rs 10.50 lakh: ReportThe move, likely to be announced in the upcoming Budget 2025 on February 1, aims to boost consumption and address concerns over rising living costs amid a slowing economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/max-box-office-collection-day-2-detailed-report-kichcha-sudeep-drop-in-numbers-2656024-2024-12-27",
      "headline": "Max box office Day 2: Kichcha Sudeep witnesses decline, eyes strong weekendKichcha Sudeep's Max released in Karnataka theatres on December 25. The film will release in other states today, December 27, and is likely to have a strong weekend in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-teaser-postponed-manmohan-singh-death-new-date-out-2656025-2024-12-27",
      "headline": "Salman Khan's Sikandar teaser delayed after Manmohan Singh's deathSalman Khan's Sikandar teaser has been rescheduled for December 28. It was earlier slated to release on December 27, on the actor's 59th birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/former-pm-manmohan-singh-dies-kamal-haasan-chiranjeevi-and-vijay-pay-tribute-2656026-2024-12-27",
      "headline": "Former PM Manmohan Singh dies: Kamal Haasan, Chiranjeevi and Vijay pay tributeFormer Prime Minister Dr Manmohan Singh died shortly after being admitted to AIIMS, Delhi on Thursday. Celebrities including Kamal Haasan, Chiranjeevi, Vir Das and Thalapathy Vijay, among others expressed their condolences. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baby-john-box-office-day-2-varun-dhawan-film-sees-drop-after-strong-opening-2656003-2024-12-27",
      "headline": "Baby John box office Day 2: Varun Dhawan's film sees drop after strong openingVarun Dhawan's latest film, Baby John, witnessed a sharp decline in its second-day collections, earning around Rs 4.5 crore. The figures highlight an urgent need for increased audience engagement."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-rohit-sharma-retirement-fans-disappointed-mcg-2656021-2024-12-27",
      "headline": "Rohit Sharma, please retire: Fans hurt after India captain fails in MCG TestBorder-Gavaskar Trophy: Rohit Sharma continued to fail with the bat in the Test series in Australia. The India captain has managed just 22 runs across five innings in the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-4th-test-rohit-sharma-3-fails-return-as-opener-2656016-2024-12-27",
      "headline": "Clueless Rohit Sharma out for 3, fails on return as openerBorder Gavaskar Trophy: India captain Rohit Sharma failed with the bat on his return as opener on Day 2 of the Boxing Day Test at the MCG. Pat Cummins removed Rohit for 3 in the post-lunch session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-ravi-shastri-virat-kohli-clown-aussie-newspaper-sam-konstas-2656002-2024-12-27",
      "headline": "Virat Kohli depicted as clown in Australian newspaper, Ravi Shastri reactsAustralia vs India, 4th Test: Ravi Shastri said he was not surprised by the over-the-top reaction of the Australian media to Virat Kohli's on-field bust-up with Sam Konstas in Melbourne. On Friday, a newspaper depicted Kohli as a clown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohli-special-gesture-towards-centurion-steve-smith-2655998-2024-12-27",
      "headline": "Respect beyond rivalry: Virat Kohli wins hearts with special Steve Smith gestureBorder-Gavaskar Trophy: Star Indian batter Virat Kohli won hearts with his special gesture towards Steve Smith after the Australian great hit his 34th Test hundred on Day 2 of the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-ceo-on-virat-kohli-sam-konstas-spat-boxing-day-test-2655987-2024-12-27",
      "headline": "Sam was gracious to brush it off: Cricket Australia CEO on Virat Kohli spatCricket Australia CEO Nick Hockley said teenage debutant Sam Konstas showed maturity beyond his age and was gracious to brush aside his physical altercation with India superstar Virat Kohli in the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pitch-invader-tries-to-hug-virat-kohli-mcg-crowd-boos-star-2655982-2024-12-27",
      "headline": "Pitch invader tries to hug Virat Kohli after MCG crowd boos India starBorder-Gavaskar Trophy: An intruder ran towards the Melbourne pitch area and tried to hug Virat Kohli after the MCG crowd booed the Indian batting star on Day 2 of the Boxing Day Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-steve-smith-11th-test-hundred-vs-india-2655984-2024-12-27",
      "headline": "Steve Smith hits 11th Test hundred vs India, most by any batterStar Australia batter Steve Smith hit his 34th Test hundred on Day 2 of the fourth Test against India at the Melbourne Cricket Ground on Friday. This was Smith's 11th Test hundred against India, most by any batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-india-players-black-armbands-tribute-former-pm-manmohan-singh-2655979-2024-12-27",
      "headline": "India players wear black armbands in tribute to former PM Manmohan SinghIndian players sported black armbands on Friday, Day 2 of the Boxing Day Test against Australia in Melbourne, in honour of former Prime Minister Manmohan Singh, who passed away on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-2-live-scores-reactions-melbourne-updates-boxing-day-2655932-2024-12-27",
      "headline": "Day 2 Live Updates: India lose KL Rahul, Rohit, Australia in control at TeaAustralia (AUS) vs India (IND) 4th Test, Day 2 Live Updates, Reactions: India captain Rohit Sharma fails on his return to the opening spot. Rohit gets dismissed for just 3 runs by Pat Cummins. KL Rahul and Yashasvi Jaiswal have kept India steady after that. Earlier, Australia were bowled out for 474 runs after batting for one and a half days in the Boxing Day Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manmohan-singh-dies-at-92-yuvraj-vinesh-phogat-lead-tribute-to-former-pm-2655923-2024-12-26",
      "headline": "Manmohan Singh dies at 92: Yuvraj, Vinesh Phogat lead tributes to former PMIndia mourns the loss of former Prime Minister Dr. Manmohan Singh, a visionary economist and leader. Sporting legends like Yuvraj Singh and Virender Sehwag lead heartfelt tributes, honouring his contributions that inspired progress across the nation, including sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-steve-smith-11th-test-hundred-vs-india-2655984-2024-12-27",
      "headline": "Steve Smith hits 11th Test hundred vs India, most by any batterStar Australia batter Steve Smith hit his 34th Test hundred on Day 2 of the fourth Test against India at the Melbourne Cricket Ground on Friday. This was Smith's 11th Test hundred against India, most by any batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-india-players-black-armbands-tribute-former-pm-manmohan-singh-2655979-2024-12-27",
      "headline": "India players wear black armbands in tribute to former PM Manmohan SinghIndian players sported black armbands on Friday, Day 2 of the Boxing Day Test against Australia in Melbourne, in honour of former Prime Minister Manmohan Singh, who passed away on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-live-score-day-2-live-scores-reactions-melbourne-updates-boxing-day-2655932-2024-12-27",
      "headline": "Day 2 Live Updates: India lose KL Rahul, Rohit, Australia in control at TeaAustralia (AUS) vs India (IND) 4th Test, Day 2 Live Updates, Reactions: India captain Rohit Sharma fails on his return to the opening spot. Rohit gets dismissed for just 3 runs by Pat Cummins. KL Rahul and Yashasvi Jaiswal have kept India steady after that. Earlier, Australia were bowled out for 474 runs after batting for one and a half days in the Boxing Day Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manmohan-singh-dies-at-92-yuvraj-vinesh-phogat-lead-tribute-to-former-pm-2655923-2024-12-26",
      "headline": "Manmohan Singh dies at 92: Yuvraj, Vinesh Phogat lead tributes to former PMIndia mourns the loss of former Prime Minister Dr. Manmohan Singh, a visionary economist and leader. Sporting legends like Yuvraj Singh and Virender Sehwag lead heartfelt tributes, honouring his contributions that inspired progress across the nation, including sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sean-williams-scores-5th-test-ton-as-zimbabwe-dominate-day-1-vs-afghanistan-2655916-2024-12-26",
      "headline": "Sean Williams scores 5th Test ton as Zimbabwe dominate Day 1 vs AfghanistanSean Williams' unbeaten 145 and Ben Curran's debut fifty powered Zimbabwe to 363/4 on Day 1 against Afghanistan. Williams' partnerships with Ervine, Kaitano, and Myers showcased Zimbabwe's dominance, leaving the visitors struggling with erratic bowling and sloppy fielding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-in-charge-after-day-1-as-dane-paterson-picks-5-wickets-vs-pakistan-2655884-2024-12-26",
      "headline": "Dane Paterson, Corbin Bosch put South Africa on top after Day 1 vs PakistanDane Paterson's fiery five-wicket haul put South Africa on top as Pakistan crumbled for 211 on Day 1. Aiden Markram's unbeaten 47 steadied the hosts, who trailed by 129 runs with seven wickets in hand heading into Day 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/marnus-look-at-that-sirajs-bail-switch-does-the-trick-for-bumrah-at-mcg-2655861-2024-12-26",
      "headline": "Marnus look at that: Siraj's bail switch does the trick for Bumrah at  MCGSiraj's playful bail-switching act against Labuschagne added humor to a tense Boxing Day Test, coinciding with Bumrah's crucial breakthroughs. The cheeky tactic sparked laughter and boosted India's momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-konstas-tore-mcc-coaching-manual-to-shreds-ravi-shastri-praises-debutant-2655846-2024-12-26",
      "headline": "Sam Konstas tore MCC coaching manual to shreds: Ravi Shastri praises debutantSam Konstas' audacious debut innings left a lasting impression, with Ravi Shastri and Justin Langer praising his fearless approach. The young Australian batter's bold shots against Bumrah have many predicting a bright future for him in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-sunil-gavaskar-exclusive-boxing-day-test-australia-vs-india-2655821-2024-12-26",
      "headline": "Make use of new ball, stop Australia before 350: Gavaskar on MCG TestAUS vs IND, Boxing Day Test: Sunil Gavaskar said that India need to make proper use of the new ball and restrict Australia to around 350-360 to give themselves a good chance of making a comeback in the match at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-konstas-batting-is-future-of-opening-in-tests-gavaskar-hails-mcg-knock-2655813-2024-12-26",
      "headline": "Sam Konstas' batting is future of opening in Tests: Gavaskar hails MCG knockSunil Gavaskar lauds 19-year-old Sam Konstas for redefining Test opening batting with fearless, unorthodox shots. Comparing it to limited-overs tactics, Gavaskar highlights how the young batter's bold approach disrupted Bumrah's rhythm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sunil-gavaskar-sam-konstas-boxing-day-test-exclusive-2655809-2024-12-26",
      "headline": "Be competitive, not physical: Gavaskar advises Kohli after Konstas sagaAUS vs IND, Boxing Day Test: In an exclusive interview with India Today, Sunil Gavaskar said that Virat Kohli needs to build a strong legacy for himself as one of the greats rather than getting involved in unwanted controversies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kamran-ghulam-abuses-kagiso-rabada-later-bowler-takes-catch-in-1st-test-2655794-2024-12-26",
      "headline": "Watch: Kamran Ghulam abuses Kagiso Rabada, later bowler takes catch in 1st TestTensions flared on Day 1 of the 1st Test between Pakistan and South Africa, with Kamran Ghulam allegedly abusing Kagiso Rabada and clashing with Kyle Verreynne. Later, Rabada had the last laugh by dismissing him with a catch.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-sunil-gavaskar-exclusive-boxing-day-test-australia-vs-india-2655821-2024-12-26",
      "headline": "Make use of new ball, stop Australia before 350: Gavaskar on MCG TestAUS vs IND, Boxing Day Test: Sunil Gavaskar said that India need to make proper use of the new ball and restrict Australia to around 350-360 to give themselves a good chance of making a comeback in the match at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-konstas-batting-is-future-of-opening-in-tests-gavaskar-hails-mcg-knock-2655813-2024-12-26",
      "headline": "Sam Konstas' batting is future of opening in Tests: Gavaskar hails MCG knockSunil Gavaskar lauds 19-year-old Sam Konstas for redefining Test opening batting with fearless, unorthodox shots. Comparing it to limited-overs tactics, Gavaskar highlights how the young batter's bold approach disrupted Bumrah's rhythm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sunil-gavaskar-sam-konstas-boxing-day-test-exclusive-2655809-2024-12-26",
      "headline": "Be competitive, not physical: Gavaskar advises Kohli after Konstas sagaAUS vs IND, Boxing Day Test: In an exclusive interview with India Today, Sunil Gavaskar said that Virat Kohli needs to build a strong legacy for himself as one of the greats rather than getting involved in unwanted controversies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kamran-ghulam-abuses-kagiso-rabada-later-bowler-takes-catch-in-1st-test-2655794-2024-12-26",
      "headline": "Watch: Kamran Ghulam abuses Kagiso Rabada, later bowler takes catch in 1st TestTensions flared on Day 1 of the 1st Test between Pakistan and South Africa, with Kamran Ghulam allegedly abusing Kagiso Rabada and clashing with Kyle Verreynne. Later, Rabada had the last laugh by dismissing him with a catch.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-boxing-day-test-2655750-2024-12-26",
      "headline": "What are India's chances of winning Boxing Day Test after Day 1? AUS vs IND, Boxing Day Test: With Australia at 311 for six at Stumps on Day 1, are India still in with a good enough chance to come up trumps at the Melbourne Cricket Ground (MCG)? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/usman-khawaja-offers-ringside-view-of-virat-kohli-vs-sam-konstas-at-mcg-2655759-2024-12-26",
      "headline": "Usman Khawaja offers ringside view of Virat Kohli vs Sam Konstas at MCGUsman Khawaja revealed the fiery exchange between Virat Kohli and debutant Sam Konstas, shedding light on the collision controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/how-mcg-star-sam-konstas-father-helped-him-prepare-vs-fast-bowlers-2655733-2024-12-26",
      "headline": "How MCG star Sam Konstas' father helped him prepare against fast bowlersA childhood training error turned into a masterstroke for Sam Konstas, who fearlessly faced Jasprit Bumrah on his Test debut. His father's bowling machine mishap at 90 mph helped shape the star's confidence against fast bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-virat-kohli-shoulder-sam-konstas-opinion-regret-sanction-2655716-2024-12-26",
      "headline": "Why Virat Kohli may not be proud of his altercation with fanboy Sam KonstasBorder-Gavaskar Trophy: Virat Kohli shouldered 19-year-old Sam Konstas, who was making his debut for Australia on Boxing Day in Melbourne. Kohli's act was unbecoming of a player of his stature and inappropriate for the occasion."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}