{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-dip-check-indusind-dcb-bank-city-union-and-other-top-banks-2685370-2025-02-25",
      "headline": "FD rates dip: Check IndusInd, DCB, City Union and other top banksWith a drop in FD interest rates, depositors might witness a marginal decline in their earnings on fixed deposits.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jubilant-foodworks-issues-clarification-on-fir-against-chairman-2685338-2025-02-25",
      "headline": "Chairman says allegations are false: Jubilant FoodWorks after reports of FIRIn a stock exchange filing, Jubilant FoodWorks said its Chairman Shyam Sundar Bhartia has denied all allegations against him, calling them \"baseless, false and disparaging, and made with clear malafide intent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-markets-stay-range-bound-as-cautious-sentiment-prevails-sensex-gains-nifty-loses-2685279-2025-02-25",
      "headline": "Sensex gains, Nifty loses: Markets stay range-bound as cautious sentiment prevailsThe S&P BSE Sensex gained 147.71 points to close at 74,602.12, while the NSE Nifty50 lost 5.80 points to end at 22,547.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-withdrawal-relief-for-new-india-cooperative-bank-depositors-check-details-here-2685236-2025-02-25",
      "headline": "RBI withdrawal relief for New India Co-op Bank depositors. Check details hereThis announcement comes just over a week after the central bank prohibited the bank from issuing new loans, dissolved its board and took control owing to 'supervisory concerns.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sell-india-buy-china-why-foreign-investors-are-shifting-bets-2685237-2025-02-25",
      "headline": "Sell India, Buy China: Why FIIs are falling out of love with Dalal StreetDalal Street has witnessed correction over the past six months, with the Nifty50 plummeting from 25,200 levels to around 22,500 levels by the end of February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bets-big-on-assam-to-invest-rs-50000-crore-in-next-5-years-summit-pm-modi-2685213-2025-02-25",
      "headline": "Reliance bets big on Assam, to invest Rs 50,000 crore in next 5 yearsManaging Director Mukesh Ambani announced an investment of Rs 50,000 crore in Assam. A major part of Reliance's investment will be directed towards making Assam a leader in technology and artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hungary-announces-tax-exemption-for-mothers-with-2-or-more-children-2685199-2025-02-25",
      "headline": "Hungary announces tax exemption for mothers with 2 or more children The said announcement comes ahead of the 2026 elections and is a part of Orban's efforts to boost the country's birth rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dbs-set-to-cut-4000-jobs-over-3-years-due-to-ai-says-ceo-2685206-2025-02-25",
      "headline": "DBS set to cut 4,000 jobs over 3 years due to AI, says CEODBS CEO Piyush Gupta said the bank will shrink its workforce by 10% in the next three years due to artificial intelligence replacing human roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hein-schumacher-to-step-down-as-unilever-ceo-in-march-2685192-2025-02-25",
      "headline": "Hein Schumacher to step down as Unilever CEO in MarchThe departure comes just weeks after Unilever announced underwhelming full-year earnings and chose Amsterdam over London and New York as the primary listing for its ice cream business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-10-percent-today-ipo-news-group-company-details-2685184-2025-02-25",
      "headline": "Explained: Why Tata Investment share price jumped 10% todayAt around 12:56 pm, shares of the non-banking financial company were up 7.65% to Rs 6,195.85 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-universal-pension-scheme-here-all-you-need-to-know-2685156-2025-02-25",
      "headline": "What is Universal Pension Scheme? Here's all you need to know With India's senior citizen population aged 60 years and above expected to touch 227 million by 2036, a comprehensive social security or pension scheme is necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-commits-to-invest-rs-50000-crore-in-assam-details-here-2685154-2025-02-25",
      "headline": "Adani Group commits to invest Rs 50,000 crore in Assam. Details hereThe investment will focus on infrastructure projects aimed at transforming Assam into a major economic hub. Funds will be allocated to sectors such as airports, aero cities, city gas distribution, transmission networks, cement production, and road projects, with the goal of enhancing connectivity and industrial capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-tax-regime-save-more-itr-nps-benefit-key-details-explained-2685103-2025-02-25",
      "headline": "New Tax Regime: Income up to Rs 13.7 lakh can be tax-free. Here's howFollowing the Union Budget 2025, annual income up to Rs 12 lakh became tax-free. But there's a way to push it even further to Rs 13.7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-tighter-rules-for-index-derivatives-heres-what-it-means-2685106-2025-02-25",
      "headline": "Sebi proposes tighter rules for index derivatives. Here's what it meansIn a consultation paper released late Monday, Sebi said it wants to link stock derivative position limits to the cash market. The idea is to cap the market-wide position limit at the lower of 15% of a stock's free-float market cap or 60 times its average daily delivery value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-open-or-close-on-maha-shivratri-2025-dalal-street-trading-sensex-nifty-nse-bse-2685083-2025-02-25",
      "headline": "Dalal Street holiday: Is the stock market open or close on Maha Shivratri 2025?Stock markets usually operate from Monday to Friday, except on declared holidays. They remain closed on Saturdays and Sundays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-capital-clears-ipo-plan-to-issue-230-million-new-shares-2685061-2025-02-25",
      "headline": "Tata Capital IPO to soon make Dalal Street debut as board clears listing plansTata Capital will be the first company from the Tata Group to launch an IPO since Tata Technologies went public in November 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-higher-snap-losing-streak-but-fii-selling-remains-a-concern-2685058-2025-02-25",
      "headline": "Sensex, Nifty snap losing streak to open higher, but FII selling remains concernThe S&P BSE Sensex was up 81.16 points to 74,535.57, while the NSE Nifty50 gained 11.40 points to 22,564.75 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stock-market-tech-stocks-fall-donald-trump-latest-order-triggers-sharp-sell-off-ali-baba-2685049-2025-02-25",
      "headline": "Donald Trump's latest order triggers sharp sell-off in China tech stocksThe Hang Seng Tech Index dropped by as much as 4.4% on Tuesday, marking its biggest fall since November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-play-airtel-digital-tv-near-merger-as-dth-fights-streaming-ott-wave-report-2685034-2025-02-25",
      "headline": "Tata Play, Airtel Digital TV near merger as DTH fights streaming wave: Report The merger is expected to be done through a share swap, allowing Airtel to increase its non-mobile revenue by offering a combination of telecom, broadband, and DTH services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-india-co-operative-bank-depositors-relief-rbi-allows-rs-25000-withdrawal-2684967-2025-02-24",
      "headline": "New India Co-op Bank depositors get relief as RBI allows Rs 25,000 withdrawal Withdrawals can be made through branches or ATMs, but the total amount a depositor can withdraw will be capped at Rs 25,000 or the balance available in their account, whichever is lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-eliminate-loan-foreclosure-charges-and-prepayment-penalties-2684812-2025-02-24",
      "headline": "RBI plans to eliminate loan foreclosure charges and prepayment penalties The central bank has invited feedback from the public and stakeholders on a draft circular directing banks not to levy foreclosure charges and pre-payment penalties on loans by March 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-banks-slash-loan-interest-rates-after-rbi-repo-rate-cut-bom-sbi-pnb-2684760-2025-02-24",
      "headline": "These 3 banks slash loan interest rates after RBI's repo rate cut The RBI, after a gap of five years, announced a reduction in the repo rate by 25 bps to 6.25%. A dip in the repo rate can lead to lower interest rates on loans, thereby making loans cheaper, and vice versa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-india-impact-explained-2684743-2025-02-24",
      "headline": "Will Donald Trump's tariffs hurt India? Here's what S&P saysIn its latest report, titled 'Asia-Pacific Economies Likely To Be Hit By US Trade Tariffs', S&P pointed out that countries like Vietnam, Taiwan, Thailand, and South Korea have stronger trade ties with the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-dalal-street-ends-in-red-sensex-loses-over-850-points-it-stocks-crash-wipro-infosys-2684708-2025-02-24",
      "headline": "Dalal Street ends in red: Sensex loses over 850 points, IT stocks crashThe S&P BSE Sensex lost 856.55 points to close at 74,454.41, while the NSE Nifty50 shed 242.55 points to end at 22,553.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-planning-2025-3-easy-ways-to-maximise-tax-savings-before-march-31-2684662-2025-02-24",
      "headline": "Tax planning 2025: 3 easy ways to maximise tax savings before March 31One can invest in Equity Linked Saving Schemes (ELSS), Public Provident Fund (PPF), life insurance premiums, National Savings Certificate (NSC) and tax-saving fixed deposits, to claim deductions of up to Rs 1,50,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-set-for-its-longest-losing-streak-in-28-years-should-you-be-worried-2684694-2025-02-24",
      "headline": "Nifty set for longest losing run in 28 years. Should you be worried?The Nifty losing for five months straight is a rare sight. Last time this happened was in 1996, and before that in 1994-95, when it fell 31.4% over eight months. Right now, the index has fallen over 11% since October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-icici-bank-chief-chanda-kochhar-launches-podcast-journey-unscripted-youtube-2684681-2025-02-24",
      "headline": "Former ICICI Bank chief Chanda Kochhar launches podcast Chanda Kochhar, 63, joined ICICI Bank in 1984 and worked her way up to become its Managing Director (MD) and Chief Executive Officer (CEO) in 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-expectations-reduce-lending-rates-again-in-april-policy-meeting-governor-sanjay-malhotra-2684655-2025-02-24",
      "headline": "Will RBI reduce lending rates again in April policy meeting?The recent MPC meeting, held from February 5-7, saw all members agreeing that a rate cut was needed to support slowing economic growth, as inflation was no longer a major concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-investment-options-nps-ppf-or-mutual-funds-which-is-best-for-you-2684617-2025-02-24",
      "headline": "NPS, PPF, or mutual funds: Which SIP investment should you opt for? Are you looking to invest in SIP but unsure where to put your money? Read to know whether you should opt for PPF, NPS, or mutual funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-bill-what-is-clubbing-of-income-under-family-taxation-2684606-2025-02-24",
      "headline": "Income Tax Bill: What is clubbing of income under family taxation In certain cases, income earned by an individual can be included in another taxpayer's income. In such cases, the latter is eligible to pay taxes not only on his income but also on the income of the other person as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-5-things-to-know-about-sensex-nifty-crash-2684586-2025-02-24",
      "headline": "Sensex, Nifty in red. 5 things to know about stock market bloodbathSeveral factors are behind the bloodbath on Dalal Street, especially the exodus of foreign institutional investors (FIIs) who have sold stocks over Rs 2 lakh crore since October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/earning-up-to-rs-1275-lakh-why-you-should-opt-for-new-income-tax-regime-2684562-2025-02-24",
      "headline": "Earning up to Rs 12.75 lakh? Why you should opt for new income tax regimeEarlier, taxpayers earning up to Rs 7 lakh paid nil taxes under the new regime. Now that limit has been raised to Rs 12 lakh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-800-points-nifty-down-3-reasons-why-stock-market-is-falling-today-nse-bse-fiis-it-stocks-2684495-2025-02-24",
      "headline": "Sensex tanks 800 points: 3 reasons why stock market is falling todayThe S&P BSE Sensex lost 676.83 points to 74,634.23, while the NSE Nifty50 fell 203.05 points to 22,592.85 as of 10 AM. IT stocks were the worst hit, with HCLTech falling nearly 3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-red-sensex-down-700-points-hcltech-falls-3-percent-2684485-2025-02-24",
      "headline": "Stock market opens in red: Sensex down 700 points. HCLTech falls 3%The S&P BSE Sensex lost 672.83 points to 74,638.23, while the NSE Nifty50 shed 216.80 points to 22,579.10 as of 9:40 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-fii-selling-dampens-investor-sentiment-dalal-street-when-will-it-stop-sensex-nifty-2684477-2025-02-24",
      "headline": "FII selling dampens investor sentiment on Dalal Street: When will it stop? Foreign institutional investors (FII) have been on a selling spree which has hampered investor sentiment on Dalal Street, affecting Sensex and Nifty as they are moving funds to other markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-listing-market-debut-dalal-street-check-latest-gmp-2684459-2025-02-24",
      "headline": "Quality Power IPO listing: Will it make a strong market debut? Check latest GMPQuality Power IPO opened for subscription on February 14, 2025, aiming to raise Rs 858.70 crore. The public issue consisted of a fresh issue of 53 lakh shares worth Rs 225 crore and an offer for sale (OFS) of 1.49 crore shares worth Rs 633.70 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-rewards-executives-with-200-percent-bonus-despite-ongoing-job-cuts-3600-layoff-2684450-2025-02-24",
      "headline": "Meta rewards executives with 200% bonuses despite ongoing job cutsThe bonus for top executives was increased to 200% from 75% and the decision was approved by Meta's Compensation, Nominating, and Governance Committee (CNGC) after recent layoff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-4-tips-to-reduce-premiums-for-senior-citizens-2683576-2025-02-21",
      "headline": "Health insurance: 4 tips to reduce premiums for senior citizens Purchasing a health insurance policy at a younger age can help in securing reduced premium rates. Generally, lower insurance premiums are offered to younger people as they are considered low risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/index-funds-vs-etfs-5-key-things-every-investor-should-know-2683517-2025-02-21",
      "headline": "Index Funds vs. ETFs: 5 key things every investor should know Exchange-Traded Funds are traded like shares on the stock market and can be sold or purchased at existing market prices during the day, while Index Funds are traded only once at the closure of the share market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icmai-seeks-cost-accountant-inclusion-as-accountant-in-income-tax-bill-2683530-2025-02-21",
      "headline": "ICMAI demands 'accountant' status for cost accountants in new Income Tax BillIn its memorandum, ICMAI highlighted the extensive training of Cost and Management Accountants (CMAs), which includes expertise in taxation, finance, auditing, corporate laws, and strategic risk management."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-honey-singh-kicks-off-millionaire-tour-with-a-grand-mumbai-show-2684048-2025-02-22",
      "headline": "Watch: Honey Singh kicks off Millionaire tour with a grand Mumbai showRapper Honey Singh launched his Millionaire Tour with a spectacular concert in Mumbai. The show featured dramatic entrances and a lineup of energetic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-x-review-fans-give-thumbs-up-to-seo-kang-joons-k-drama-2683974-2025-02-22",
      "headline": "Undercover High School X review: Fans give thumbs up to Seo Kang-joon's K-dramaUndercover High School, featuring Seo Kang-joon and Jin Ki-joo, has premiered on MBC TV. The series, praised for its engaging storyline, follows an undercover NIS agent as a high school student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. Ricco had once defended Osama bin Laden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/robin-tunney-10-years-the-mentalist-finale-simon-baker-2683326-2025-02-21",
      "headline": "Robin Tunney marks 10 years since The Mentalist finale, thanks fan for their loveActor Robin Tunney celebrated the 10th anniversary of The Mentalist finale, expressing gratitude to fans for their unwavering support. She also reflected on the show's impact on her life and career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-surprise-street-performance-london-leaves-fans-in-disbelief-2683349-2025-02-21",
      "headline": "Atif Aslam's surprise street performance in London leaves fans in disbelief. WatchSinger Atif Aslam's video of him performing on a London street has emerged online. This surprise clip has left many fans in disbelief. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-millionaire-tour-what-makes-it-special-2683339-2025-02-21",
      "headline": "Honey Singh Millionaire tour: Reasons why it's unlike any otherYo Yo Honey Singh is set to electrify Mumbai with his high-energy performance as part of the Stage Tak Millionaire tour, promising an unforgettable night of music and nostalgia. Here are a few reasons why one should not miss it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-season-2-on-netflix-what-is-leighton-meester-playing-in-husband-adam-brody-show-2683330-2025-02-21",
      "headline": "Nobody Wants This 2: What is Leighton Meester playing in husband Adam Brody's show?Netflix renewed 'Nobody Wants This' for season 2 last year, and now actor Leighton Meester, known for playing Blair Waldorf in 'Gossip Girl', has joined the show. Her husband, actor Adam Brody, plays the lead character, Noah, in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21",
      "headline": "Comic Varun Grover's sharp take on Ranveer Allahbadia, censorship and BeerBicepsComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-18-alice-kaushik-tajinder-bagga-and-others-reunite-at-arfeen-saras-goa-bash-2683249-2025-02-21",
      "headline": "BB 18's Alice Kaushik, Tajinder Bagga, others reunite at Arfeen-Sara's Goa bashBigg Boss 18 contestants, including Alice Kaushik, Tajinder Bagga, and Nyrraa Banerjii reunited to celebrate Sara and Arfeen Khan's anniversary in Goa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-cryptic-post-amid-divorce-rumours-with-yuzvendra-chahal-stressed-to-blessed-2683241-2025-02-21",
      "headline": "Dhanashree Verma's cryptic post amid divorce rumours: From stressed to blessedDhanashree Verma recently shared a cryptic message on social media, suggesting a shift from 'stressed to blessed'. This comes amid swirling rumours of a possible divorce with cricketer Yuzvendra Chahal."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cag-audit-report-aap-delhi-liquor-policy-led-to-rs-2000-crore-revenue-loss-assembly-session-atishi-arvind-kejriwal-lg-vk-saxena-2685169-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's Delhi liquor policy led to Rs 2,002 crore revenue loss: CAG reportThe Comptroller and Auditor General of India report on the now-scrapped Delhi liquor policy scam was tabled in the Assembly today by Chief Minister Rekha Gupta."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ex-congress-mp-sajjan-kumar-sentenced-to-life-imprisonment-in-1984-anti-sikh-riots-case-2685210-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sajjan Kumar, ex-Congress MP, sentenced to life in jail in anti-Sikh riots caseFormer Congress MP Sajjan Kumar has been sentenced to life imprisonment for his involvement in the killing of two Sikhs in the 1984 riots. This is his second life sentence, as he is already serving time for his role in the Delhi Cantonment riots case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-statement-after-new-india-cooperative-bank-writes-off-18-crore-loan-2685099-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Preity Zinta, Kerala Congress clash on X over Rs 18-crore loan write-off chargePreity Zinita called reports of New India Cooperative Bank writing off her Rs 18-crore loan false. She blasted Congress for promoting fake news by linking her with Bharatiya Janata Party (BJP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-politics-space-kerala-state-assembly-election-rahul-gandhi-leadership-2685179-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress has no heart or house for Mr TharoorDespite his intellect, eloquence, and four consecutive wins from Thiruvananthapuram, Congress MP Shashi Tharoor remains an outsider in his own party. The Congress has no heart or house for Tharoor as it finds him too independent for national politics and too unconventional for Kerala's faction-ridden political affairs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/indias-first-hyperloop-test-track-delhi-to-jaipur-in-30-mins-2685155-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's first hyperloop test track. Delhi to Jaipur in 30 minutes?Delhi is not far away from Jaipur now. The 422-meter facility at IIT Madras marks a significant milestone in revolutionising transportation between major Indian cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-abandoned-group-b-qualification-scenario-2685431-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: AUS vs SA called off, what does this mean for Group B?The match between Australia and South Africa in Rawalpindi was called off and this has left Group B wide open.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chief-minister-mk-stalin-declares-tamil-nadu-ready-for-another-language-war-over-hindi-policy-2685311-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DMK vs BJP: Stalin says Tamil Nadu ready for 'language war', Annamalai fires backTamil Nadu Chief Minister MK Stalin reiterated his stance on the language debate, asserting that the state is \"ready for another language war\" amid renewed tensions over the Centre's alleged Hindi imposition.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-vs-sachin-tendulkar-odi-runs-ricky-ponting-reaction-2685264-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Virat Kohli overtake Sachin Tendulkar's ODI runs tally? Ricky Ponting reactsRicky Ponting has said that he will not write off Virat Kohli when it comes to overtaking Sachin Tendulkar's ODI runs tally. Kohli scored his 51st ODI hundred against Pakistan in Dubai on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/engineering-admissions-what-colleges-want-other-than-jee-scores-2684787-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JEE scores matter, but so do board marks, Olympiads. Here's what colleges wantLooking for an engineering admission? Not all colleges are looking at your JEE scores; some are increasingly taking up holistic admission processes. Apart from direct entry, there are lateral routes, private exams, admissions based on extracurricular activities or Olympiad scores, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-dunks-phone-into-ganga-for-husband-virtual-maha-kumbh-dip-viral-video-2685323-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman dunks phone into Ganga for husband's 'virtual' Maha Kumbh dip. Video goes viralIn a now-viral video, a woman is seen dunking her phone into the sacred Sangam waters while on a video call with her husband. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-assembly-session-atishi-aap-mlas-suspended-marshalled-out-uproar-cag-report-rekha-gupta-bjp-2685095-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi, 20 AAP MLAs suspended after chaos over CAG report in Delhi AssemblyAs the Delhi Assembly session commenced for the day, Lt Governor VK Saxena's address to the House was disrupted by AAP legislators as they resorted to loud sloganeering against the BJP government. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/egg-border-smuggling-us-border-bird-flu-price-rise-dozen-american-control-immigration-2685330-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eggmergency in US driving up smuggling of eggs from MexicoThe surge in egg prices has sparked a rise in egg smuggling into the US. Between October 2024 and February 2025, there was a 29% increase in the seizure of shell eggs at US ports of entry compared to the same period the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/enduring-daaku-maharaaj-netflix-urvashi-rautela-bobby-deol-2685193-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Enduring Daaku Maharaaj: 2.5 hours of second-hand embarrassmentSouth star Nandamuri Balakrishna might have impressed his fans with Daaku Maharaaj, but is it really worth all the hype? Read on to find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-rift-praises-government-selfie-piyush-goyal-buzz-2685174-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor's praise for Centre, selfie with Piyush Goyal amid rift buzzThe latest development has once again brought to focus Shashi Tharoor's souring of ties with the Congress and fuelled a buzz over his future with the party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chief-minister-mk-stalin-calls-all-party-meeting-on-delimitation-warns-tamil-nadu-could-lose-8-mps-2685217-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin warns Tamil Nadu could lose 8 MPs in delimitation, calls all-party meetTamil Nadu Chief Minister MK Stalin called for an all-party meeting on March 5, warning that the state could lose 8 MPs due to delimitation based on population control policies.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/zara-closes-iconic-five-storey-mumbai-flagship-store-after-8-years-2685310-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zara closes iconic five-storey Mumbai flagship store after 8 yearsZara has closed its five-storey flagship store at Hutatma Chowk in Mumbai after eight years, signaling a strategic realignment in its Indian retail presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/sample-papers/story/cbse-class-10-social-science-board-exam-2025-full-question-paper-2685245-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE Class 10 Social Science Question Paper 2025: Check full exam paper hereCheck out the CBSE Class 10 Social Science question paper 2025 in full here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/makhana-is-a-super-food-but-its-also-super-expensive-heres-why-2684778-2025-02-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Makhana is a superfood, but it's also super expensive. Here's whyMakhana is a superfood with a super price tag. The real story behind makhana's high cost lies not just in its nutritional value but in the intricate process of harvesting and processing these delicate seeds. As demand continues to rise, understanding the challenges faced by farmers and producers can help them appreciate the true worth of this superfood."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/aap-mla-amanatullah-khan-accused-of-helping-suspect-flee-cops-gets-pre-arrest-bail-delhi-court-2685324-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's Amanatullah Khan, accused of aiding suspect's escape, gets pre-arrest bailThe case involves allegations that Amanatullah Khan helped a suspect evade arrest and obstructed a police investigation in connection with a murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/earth-sets-and-rises-behind-moon-in-breathtaking-blue-ghost-video-2685375-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Earth sets and rises behind Moon in breathtaking Blue Ghost videoBlue Ghost performed a precise 16-second burn using its Reaction Control System (RCS) thrusters to transition into a near-circular low lunar orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/migratory-birds-leaving-odisha-bhitarkanika-park-early-summer-heatwave-siberia-2685283-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Migratory birds are leaving Odisha's Bhitarkanika Park early. Here's whyMigratory birds are leaving Odisha's Bhitarkanika National Park early due to a sudden temperature rise and early summer, marking an unusual migration pattern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/drdo-scientist-five-kidneys-rare-third-transplant-amrita-hospital-2685397-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DRDO scientist now lives with five kidneys after rare third transplantDevendra Barlewar, a 45-year-old scientist at the Defence Research and Development Organisation (DRDO), underwent a four-hour complex surgery and now has five kidneys in his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-media-black-magic-theory-on-india-win-champions-trophy-viral-video-2685114-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan media's bizarre claim on India's win is viral: 22 pandits did black magicA video from a Pakistani news channel featuring a panel discussing how their country lost to India due to 'black magic' has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mad-square-teaser-sequel-to-hit-campus-comedy-promises-more-madness-2685435-2025-02-25",
      "headline": "MAD Square teaser: Sequel to hit campus comedy promises more madness The teaser for the highly awaited sequel to MAD, titled MAD Square, has been released, offering a fresh glimpse into its fun, friendships, and chaotic adventures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/himesh-reshammiya-talks-similarities-between-his-character-in-badass-ravi-kumar-and-ranbir-kapoors-animal-2685367-2025-02-25",
      "headline": "Himesh Reshammiya opens up about similarities between Badass Ravi Kumar and AnimalIn an exclusive chat, Himesh Reshammiya addresses the comparisons between his character in Badass Ravi Kumar and Ranbir Kapoor's role in Animal. He explains the retro look and similarities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-is-done-being-away-from-filming-stmp-2685430-2025-02-25",
      "headline": "Samantha is done 'being away from filming': It's my first loveActor Samantha Ruth Prabhu is excited about her upcoming projects. She also opened up about filming a Raj and DK series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/kannappas-vishnu-manchu-visits-tirupati-with-actor-siva-balaji-2685398-2025-02-25",
      "headline": "Kannappa's Vishnu Manchu visits Tirupati with actor Siva BalajiKannapa actor Vishnu Manchu visited the Tirumala Tirupati temple with Telugu actor Siva Balaji. Videos and pictures of their spiritual outing were shared on social media. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-axar-patel-to-dinner-after-dropping-hat-trick-catch-2685437-2025-02-25",
      "headline": "Did Rohit take Axar Patel to dinner after dropping hat-trick catch? spinner revealsIndia all-rounder Axar Patel said that captain Rohit Sharma is yet to take him out for dinner after dropping his hat-trick catch against Bangladesh in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-early-exit-pcb-mohsin-naqvi-aaqib-javed-2685436-2025-02-25",
      "headline": "PCB 'angry' after Pakistan's Champions Trophy exit, new coach before WTC 25 cycleThe Pakistan Cricket Board has been left angry and disappointed with the team's poor performance in the Champions Trophy, but they will not take any action until the tournament is over. Pakistan will appoint a new head coach ahead of the new World Test Championship cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-abandoned-group-b-qualification-scenario-2685431-2025-02-25",
      "headline": "Champions Trophy: AUS vs SA called off, what does this mean for Group B?The match between Australia and South Africa in Rawalpindi was called off and this has left Group B wide open.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afghanistan-england-world-cup-heroics-2685406-2025-02-25",
      "headline": "Shahidi confident Afghanistan can replicate World Cup heroics vs EnglandChampions Trophy 2025: Hashmatullah Shahidi said that Afghanistan will try and put their A-game forward against England on Wednesday and replicate their performance against the Three Lions from the ODI World Cup in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-odi-world-no1-hashim-amla-indian-cricket-team-2685395-2025-02-25",
      "headline": "Shubman Gill will be the 'next big thing' in international cricket: Hashim AmlaHashim Amla has claimed that Shubman Gill is the 'next big thing' in international cricket after his fine performances in ODIs. Gill has been in top form for India during the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammad-kaif-alleges-mismanagement-of-icc-funds-by-pakistan-after-rain-in-rawalpindi-2685387-2025-02-25",
      "headline": "Mohammad Kaif alleges mismanagement of ICC funds by Pakistan after rain in RawalpindiFormer India cricketer turned commentator Mohammad Kaif has alleged mismanagement of funds by the Pakistan Cricket Board (PCB) during the ongoing ICC Champions Trophy 2025 after the ground staff didn't cover the complete ground during rain in Rawalpindi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-afg-vs-eng-shahidi-england-press-conference-2685379-2025-02-25",
      "headline": "Hashmatullah Shahidi backs Afghanistan batters to 'come back stronger' Champions Trophy 2025: In the pre-match press conference, Hashmatullah Shahidi said that Afghanistan will try and put in a better effort with the bat against England after failing against South Africa where they lost by 107 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-captaincy-venkatesh-iyer-eden-gardens-2685349-2025-02-25",
      "headline": "IPL 2025: Ready to lead KKR if captaincy comes my way, says Venkatesh IyerKKR all-rounder Venkatesh Iyer has said he is ready to take up the captaincy of the team if it is offered to him. Venkatesh was bought by KKR for big money and is one of the contenders for the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-batting-runs-greatest-odi-player-2685316-2025-02-25",
      "headline": "Virat Kohli ahead of Sachin: Hussain ranks ODI's greatest ever battersFormer England captain Nasser Hussain has ranked Virat Kohli as the greatest ODI batter of all time. Nasser feels that Kohli is ahead of even Sachin Tendulkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-delhi-capitals-coach-matthew-mott-2685315-2025-02-25",
      "headline": "Delhi Capitals appoint World Cup-winning coach in support staff for IPL 2025IPL 2025: Matthew Mott, who has won four World Cup titles as coach in men's and women's cricket, has joined the Delhi Capitals (DC) as their assistant coach and will work alongside head coach Hemang Badani.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ms-dhoni-rizwan-pakistan-sana-mir-2685280-2025-02-25",
      "headline": "Even Dhoni couldn't have helped Rizwan's team: Ex-Pakistan captain  Champions Trophy 2025: Pakistan women's skipper Sana Mir said that veterans like Younis Khan and MS Dhoni couldn't have helped the men's team from getting knocked out of the tournament on home soil. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-afg-vs-eng-shahidi-england-press-conference-2685379-2025-02-25",
      "headline": "Hashmatullah Shahidi backs Afghanistan batters to 'come back stronger' Champions Trophy 2025: In the pre-match press conference, Hashmatullah Shahidi said that Afghanistan will try and put in a better effort with the bat against England after failing against South Africa where they lost by 107 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-captaincy-venkatesh-iyer-eden-gardens-2685349-2025-02-25",
      "headline": "IPL 2025: Ready to lead KKR if captaincy comes my way, says Venkatesh IyerKKR all-rounder Venkatesh Iyer has said he is ready to take up the captaincy of the team if it is offered to him. Venkatesh was bought by KKR for big money and is one of the contenders for the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-batting-runs-greatest-odi-player-2685316-2025-02-25",
      "headline": "Virat Kohli ahead of Sachin: Hussain ranks ODI's greatest ever battersFormer England captain Nasser Hussain has ranked Virat Kohli as the greatest ODI batter of all time. Nasser feels that Kohli is ahead of even Sachin Tendulkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-delhi-capitals-coach-matthew-mott-2685315-2025-02-25",
      "headline": "Delhi Capitals appoint World Cup-winning coach in support staff for IPL 2025IPL 2025: Matthew Mott, who has won four World Cup titles as coach in men's and women's cricket, has joined the Delhi Capitals (DC) as their assistant coach and will work alongside head coach Hemang Badani.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ms-dhoni-rizwan-pakistan-sana-mir-2685280-2025-02-25",
      "headline": "Even Dhoni couldn't have helped Rizwan's team: Ex-Pakistan captain  Champions Trophy 2025: Pakistan women's skipper Sana Mir said that veterans like Younis Khan and MS Dhoni couldn't have helped the men's team from getting knocked out of the tournament on home soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-r-ashwin-on-shubman-gills-technique-shaheen-afridi-india-vs-pakistan-2685270-2025-02-25",
      "headline": "R Ashwin in awe of Shubman Gill's technique to take down Shaheen AfridiFormer India all-rounder Ravichandran Ashwin said that he was in awe of Shubman Gill's technique after he took down Shaheen Afridi during India's clash against Pakistan in the Champions Trophy 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-vs-sachin-tendulkar-odi-runs-ricky-ponting-reaction-2685264-2025-02-25",
      "headline": "Will Virat Kohli overtake Sachin Tendulkar's ODI runs tally? Ricky Ponting reactsRicky Ponting has said that he will not write off Virat Kohli when it comes to overtaking Sachin Tendulkar's ODI runs tally. Kohli scored his 51st ODI hundred against Pakistan in Dubai on February 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/lakshya-sen-age-fraud-karnataka-high-court-plea-rejected-2685229-2025-02-25",
      "headline": "Court rejects Lakshya Sen's plea in birth certificate forgery caseLakshya Sen's legal troubles deepen as the Karnataka High Court dismisses his plea, allowing investigations into alleged birth certificate forgery. The case, which involves his family and coach, raises serious concerns over age fraud in Indian sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pat-cummins-india-advantage-controversy-twitter-2685211-2025-02-25",
      "headline": "Pat Cummins slams Australian paper for fabricating quote on IndiaPat Cummins has called out an Australian newspaper for quoting him incorrectly about India in the Champions Trophy. Cummins hit out at the publication, stating that he never said that India had an unfair advantage in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-live-cricket-score-today-match-updates-rawalpindi-2685195-2025-02-25",
      "headline": "AUS vs SA Highlights: Match abandoned without a ball bowled, teams share pointsAustralia (AUS) vs South Africa (SA) Live Score, Champions Trophy: The match between Australia and South Africa at the Rawalpindi Cricket Stadium has been washed off due to rain. South Africa stayed at the top of the table with three points followed by Australia, England and Afghanistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-advantage-pat-cummins-honest-take-2685182-2025-02-25",
      "headline": "India getting huge advantage by playing at same venue: Pat CumminsInjured Australia captain Pat Cummins has said that India have a huge advantage in the Champions Trophy. Cummuns said that playing at the same venue throughout the tournament gives India a better chance of success.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-knocked-out-cannot-win-tournaments-parthiv-patel-2685105-2025-02-25",
      "headline": "Outdated Pakistan do not have a team that can win tournamentsPakistan's early Champions Trophy exit, despite hosting the tournament, has raised concerns over their cricketing structure. Parthiv Patel and Dinesh Karthik pointed out flaws in the team's approach, coaching setup, and inability to perform in high-pressure ICC events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-virat-kohli-india-vs-pakistan-immortal-class-century-2685115-2025-02-25",
      "headline": "Clash of Champions: Virat Kohli's immortal class proves critics wrong againVirat Kohli has consistently silenced his doubters, proving his class once again with a match-winning century against Pakistan in the Champions Trophy. His redemption should remind fans to stand by their heroes, especially when they face challenging phases in their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-live-cricket-score-today-match-updates-rawalpindi-2685195-2025-02-25",
      "headline": "AUS vs SA Highlights: Match abandoned without a ball bowled, teams share pointsAustralia (AUS) vs South Africa (SA) Live Score, Champions Trophy: The match between Australia and South Africa at the Rawalpindi Cricket Stadium has been washed off due to rain. South Africa stayed at the top of the table with three points followed by Australia, England and Afghanistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-advantage-pat-cummins-honest-take-2685182-2025-02-25",
      "headline": "India getting huge advantage by playing at same venue: Pat CumminsInjured Australia captain Pat Cummins has said that India have a huge advantage in the Champions Trophy. Cummuns said that playing at the same venue throughout the tournament gives India a better chance of success.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-knocked-out-cannot-win-tournaments-parthiv-patel-2685105-2025-02-25",
      "headline": "Outdated Pakistan do not have a team that can win tournamentsPakistan's early Champions Trophy exit, despite hosting the tournament, has raised concerns over their cricketing structure. Parthiv Patel and Dinesh Karthik pointed out flaws in the team's approach, coaching setup, and inability to perform in high-pressure ICC events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-virat-kohli-india-vs-pakistan-immortal-class-century-2685115-2025-02-25",
      "headline": "Clash of Champions: Virat Kohli's immortal class proves critics wrong againVirat Kohli has consistently silenced his doubters, proving his class once again with a match-winning century against Pakistan in the Champions Trophy. His redemption should remind fans to stand by their heroes, especially when they face challenging phases in their careers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rcb-vs-upw-wpl-richa-ghosh-run-out-ms-dhoni-2685098-2025-02-25",
      "headline": "Watch: Richa Ghosh pulls off MS Dhoni-like run-out in RCB vs UPW gameRoyal Challengers Bengaluru wicketkeeper Richa Ghosh affected a MS Dhoni-like last-ball run out in the team's WPL game against UP Warriorz. Richa forced the game into WPL's first ever Super Over with some quick thinking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-new-bat-weight-less-ipl-2025-csk-2685077-2025-02-25",
      "headline": "MS Dhoni set to use new bats for IPL 2025, says reportLegendary MS Dhoni might be using new bats for the upcoming edition of the Indian Premier League. A report suggests that Dhoni might reduce the weight of his bat for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-najmul-shanto-batting-feilding-improvement-2685064-2025-02-25",
      "headline": "Shanto urges batting, fielding improvement after Bangladesh's crash outBangladesh captain Najmul Shanto defended his team's bowling efforts in the Champions Trophy despite their early exit but admitted the need for major improvements in batting and fielding. Expressing disappointment, he lamented yet another embarrassing ICC tournament failure for his side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-simple-batting-century-2685053-2025-02-25",
      "headline": "NZ's Rachin Ravindra reveals reason behind 'simple' batting vs BangladeshNew Zealand's Rachin Ravindra credited his ability to adapt to conditions in Rawalpindi for making his century against Bangladesh look effortless. In his comeback match from injury, Ravindra found the perfect balance between timing and aggression against a strong Bangladesh bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-brydon-carse-ruled-out-injury-england-vs-aghanistan-rehand-ahmed-replacement-2685042-2025-02-25",
      "headline": "England's Brydon Carse out of Champions Trophy, Rehan Ahmed to join squadEngland suffered a major blow as Brydon Carse was ruled out of the Champions Trophy due to a toe injury. Rehan Ahmed replaces him, but he won't arrive in time for England's must-win clash against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-unwanted-record-knocked-out-new-zealand-vs-bangladesh-2685028-2025-02-25",
      "headline": "Champions Trophy exit in 6 days: Pakistan end 16-year tournament streak6 days after the start of the tournament, Pakistan were unceremoniously dumped out of the Champions Trophy 2025. Pakistan lost their matches against New Zealand and India in embarrassing fashion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bagladesh-rachin-ravindra-freak-injury-comeback-century-2685021-2025-02-25",
      "headline": "From face injury to Champions Trophy 100: NZ's Ravindra reflects on comebackRachin Ravindra credited New Zealand's coaches, doctors, and family for his successful return from injury, marking his comeback with a stunning century against Bangladesh that sealed the Black Caps' Champions Trophy semi-final spot in a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-preview-pitch-report-rawalpindi-2684853-2025-02-25",
      "headline": "AUS vs SA: Run-fest on cards as Australia, South Africa aim to boost semis hopesAustralia and South Africa are all set to lock horns in what promises to be a run-fest in Rawalpindi on February 25. Both teams will be looking to boost their semi-final hopes with a win and go to the top of Group B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-up-warriorz-perry-ecclestone-2684968-2025-02-24",
      "headline": "Sophie Ecclestone heroics helps Warriorz beat RCB in historic Super Over WPL 2025: Deepti Sharma's UP Warriorz beat Smriti Mandhana's Royal Challengers Bengaluru (RCB) in a thrilling Super Over on Monday, February 24 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-pakistan-exits-tournament-mohammad-rizwan-pcb-2684949-2025-02-24",
      "headline": "Champions Trophy: What's gone wrong with Pakistan as they exit tournamentIn a discussion with India Today Consulting Sports Editor, Nikhil Naz and Pakistani journalist Fareshteh Gati Aslam, Consulting Editor Mr. Rajdeep Sardesai discusses the reasons behind Pakistan cricket's downfall as they crash out of the Champions Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-shoaib-akhtar-pakistan-2684947-2025-02-24",
      "headline": "Babar Azam is a 'fraud', fans have picked 'wrong heroes': Shoaib AkhtarChampions Trophy: Shoaib Akhtar lashed out at Babar Azam and the Pakistan team after their lacklustre performance in the ongoing tournament where they have failed to win a single game thus far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-bangladesh-rachin-ravindra-michael-bracewell-rawalpindi-2684940-2025-02-24",
      "headline": "NZ vs BAN: Who said what as Rachin, Bracewell guide New Zealand into semisMichael Bracewell and Rachin Ravindra were the stars of the show as New Zealand defeated Bangladesh to reach the semi-finals of the Champions Trophy. Bracewell picked up 4 wickets while Rachin scored a fine 112. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}