{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/gurugram-surpasses-mumbai-in-rs-10-crore-plus-home-sales-in-2025-2872890-2026-02-23",
      "headline": "Big housing boost for Gurugram, overtakes Mumbai in 2025 luxury salesGurugram appears to be at the centre of India's ultra-luxury housing story, and the momentum suggests that demand for high-value homes is far from slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-india-supreme-court-criticism-homebuyer-protection-enforcement-gap-real-estate-regulatory-body-2872866-2026-02-23",
      "headline": "Has RERA lost its bite? What homebuyers need to knowThe Supreme Court has come down hard on real estate regulatory authorities (RERA), saying they should be abolished as they appear to favour builders and have failed to protect homebuyers, which is their intended purpose."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-fake-itr-refund-message-led-to-a-rs-15-lakh-loss-2872863-2026-02-23",
      "headline": "How a fake ITR refund message led to a Rs 1.5 lakh lossIt started with a simple message about a pending tax refund. Within minutes, a taxpayer had lost Rs 1.5 lakh. The case reveals how scammers are exploiting refund anxiety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-in-india-idea-corpus-inflation-omniscience-capital-study-2872864-2026-02-23",
      "headline": "Are you saving enough for retirement? Why the Rs 1 crore target is outdatedMany Indians underestimate how fast expenses rise after 60 and how long their savings must last. A new study analyses how inflation, longevity and market risks reshape the real retirement corpus you need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/selling-your-gold-or-silver-mutual-fund-read-this-before-you-pay-tax-2872817-2026-02-23",
      "headline": "Selling your gold or silver mutual fund? Read this before you pay taxThinking of selling your gold or silver fund after the recent price rise? Before you click that sell button, have a closer look at the tax rules. Even a small timing mistake can change your tax bill significantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-moratorium-period-5-years-irdai-non-disclosure-claims-rule-2872800-2026-02-23",
      "headline": "Completed 60 months of continuous cover? Your insurer may not deny your claimThe Insurance Regulatory Authority and Development Authority of India (IRDAI) has passed a historic reform cutting the moratorium period from eight years to five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-rs-590-crore-fraud-haryana-government-accounts-inside-details-2872780-2026-02-23",
      "headline": "How a routine account request revealed a Rs 590-crore fraud at IDFC First BankWhat began as a simple balance check has now expanded into a Rs 590-crore reconciliation exercise, a regulatory disclosure, multiple internal meetings at the highest levels of the bank, and a sharp selloff in the lender's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/idfc-first-bank-share-price-crash-frausd-disclosure-check-key-details-2872751-2026-02-23",
      "headline": "IDFC First Bank shares crash nearly 20% after Rs 590 crore fraudIDFC Bank share price hit a lower circuit shortly after the opening bell, a clear sign of the anxiety that swept through the market. Read on to find out more about the suspected fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/upl-share-price-crash-today-why-is-the-stock-falling-explained-2872734-2026-02-23",
      "headline": "UPL share price tumbles 12%: Why is the stock falling today?The stock was down around 12%, sliding toward mid-Rs 600 levels on the Bombay Stock Exchange after the market opened, underscoring fresh concerns on Dalal Street about the path ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-nifty-up-nse-bse-rally-reason-us-tariff-cancel-2872724-2026-02-23",
      "headline": "Sensex jumps 500 points: Why is stock market rising today?The S&P BSE Sensex was up 630.25 points to 83,444.96, while the NSE Nifty50 gained 190.55 points to 25,761.80 as of 9:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-400-points-nifty-above-25650-axis-bank-gains-2-perecnt-trump-tariff-down-2872707-2026-02-23",
      "headline": "Sensex, Nifty cheers as US Supreme Court turns down Trump tariffsThe S&P BSE Sensex was up 630.25 points to 83,444.96, while the NSE Nifty50 gained 190.55 points to 25,761.80 as of 9:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/clean-max-enviro-energy-vs-shree-ram-twistex-ipo-where-to-invest-gmp-comparison-2872706-2026-02-23",
      "headline": "Clean Max Enviro Energy vs Shree Ram Twistex IPO: Where to invest? Check GMPFor investors looking at listing gains, the grey market premium trend offers an early signal. But the two IPOs are very different in size, structure and current sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-us-trump-tariff-higher-rally-fii-oil-rupee-nse-bse-trading-setup-2872705-2026-02-23",
      "headline": "Sensex, Nifty today: Why stock market is likely to open higher and rallyGift Nifty futures were trading at 25,744.5 at 7:51 am. This points to the benchmark Nifty50 opening above Friday's close of 25,571.25. The Sensex had also ended last week with modest gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-reschedule-chief-negotiations-meeting-on-interim-trade-deal-2872501-2026-02-22",
      "headline": "India, US reschedule chief negotiators meeting on interim trade deal: ReportThe Indian team was earlier scheduled to start the three-day meeting on February 23 in the US. Joint Secretary in the Commerce Ministry, Darpan Jain, is the chief negotiator of India for this agreement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/jpmorgan-concedes-it-closed-donald-trump-accounts-after-january-6-attack-2872283-2026-02-22",
      "headline": "JPMorgan concedes it closed Trump's accounts after January 6 attackUntil now, JPMorgan had never admitted that it closed Donald Trump's accounts in writing after January 6. The bank would only speak hypothetically about when the bank closes accounts and its reasons for closing accounts, citing bank privacy laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-hikes-tariff-from-10-to-15-after-supreme-court-verdict-says-us-was-ripped-off-for-decades-2872234-2026-02-21",
      "headline": "Trump hikes tariffs to 15% after court ruling, says US ripped off for decadesDonald Trump said the 150-day hike is legally permitted and that new \"legally permissible\" tariffs will be introduced during this period.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-income-tax-regime-benefits-proposed-hra-meal-vouchers-is-it-better-now-salaried-individuals-2871962-2026-02-21",
      "headline": "Old tax regime gets a boost. Does it work better for you than the new one?Handcrafted ByOur Editors If you've moved to the new income tax regime, the proposed updates to the old one might be worth a second look. Here's what the latest draft changes could mean for your tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-is-catching-up-fast-with-us-china-in-ai-race-indiaai-ceo-abhishek-singh-2871846-2026-02-20",
      "headline": "India is catching up fast with US, China in AI race: IndiaAI CEO Abhishek SinghIn an exclusive interview following the Grand AI India Impact Summit, Abhishek Singh, CEO of India's Mission AI, discusses the nation's emerging role in the global artificial intelligence landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brazil-president-lula-exclusive-india-brazil-trade-own-currency-need-not-rely-on-us-dollar-2871794-2026-02-20",
      "headline": "Brazilian President Lula says India and Brazil can trade without relying on US dollarAs Brazil looks to deepen ties with India, Brazilian President Luiz Inácio Lula da Silva signals a future where the two economies trade more, rely less on the US dollar, and build a partnership driven by growth, technology and trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-debates-within-brics-to-create-new-currency-brazils-lula-to-india-today-2871784-2026-02-20",
      "headline": "No debates within BRICS to create new currency: Brazil's Lula to India TodayIn an exclusive interview with India Today TV, Brazilian President Luiz Inacio Lula da Silva clarified there is no BRICS currency plan, but said India and Brazil can still rethink dollar-based trade and slowly build alternatives."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-as-bade-sahab-in-dhurandhar-2-viral-letterboxd-page-make-fans-curious-2872885-2026-02-23",
      "headline": "Emraan Hashmi as Bade Sahab in Dhurandhar 2? Letterboxd page makes fans curious A Letterboxd page of Dhurandhar: The Revenge has sparked buzz after listing Emraan Hashmi among the cast, triggering speculation about his possible role as the mysterious 'Bade Sahab'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-invites-pawan-kalyan-and-naga-babu-for-his-march-6-wedding-see-pics-2872865-2026-02-23",
      "headline": "Allu Sirish invites Pawan Kalyan and Naga Babu for his March 6 wedding. See pics Allu Sirish personally invited Pawan Kalyan, Naga Babu, and their families for his upcoming wedding to Nayanika Reddy, scheduled for March 6. The invitation and family reactions were shared by Sirish through social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bafta-2026-alia-bhatt-spoke-in-hindi-on-stage-samantha-loved-it-2872825-2026-02-23",
      "headline": "BAFTA 2026: Alia Bhatt spoke in Hindi on stage, Samantha loved it Alia Bhatt made her debut as an award presenter at the 79th British Academy Film Awards, delivering part of her speech in Hindi and receiving a positive response from Samantha Ruth Prabhu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-celebrates-22nd-birthday-family-stranger-things-cast-new-york-2872799-2026-02-23",
      "headline": "Millie Bobby Brown birthday: David Harbour attends party after bullying reports Millie Bobby Brown celebrated her 22nd birthday at a New York City restaurant, with her Stranger Things co-star David Harbour in attendance. His presence comes months after reports alleged that Brown had filed a bullying and harassment complaint against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/didnt-expect-sinners-ryan-coogler-becomes-first-writer-of-colour-to-win-a-bafta-2872810-2026-02-23",
      "headline": "Didn't expect: Sinners' Ryan Coogler becomes first writer of colour to win a BAFTA Ryan Coogler broke the BAFTA record as first writer of colour to win an award in the Best Original Screenplay category for Sinners. He expressed surprise over his win and called the experience \"nerve-wracking.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rj-balaji-explains-why-he-picked-sai-abhyankkar-for-karuppu-after-ar-rahmans-exit-2872826-2026-02-23",
      "headline": "RJ Balaji explains why he picked Sai Abhyankkar for Karuppu after AR Rahman's exit Actor-director RJ Balaji shared how he selected Sai Abhyankkar as music composer for Karuppu after AR Rahman exited the project. He expressed confidence in Sai's abilities even as others had reservations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hussain-dalal-creative-freedom-collaboration-ai-film-2872821-2026-02-23",
      "headline": "Actor Hussain Dalal says he doesn't fear being typecast as best friend Actor Hussain Dalal opens up about being labelled the hero's best friend and why he isn't losing sleep over it. His candid take may surprise you.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/manipuri-film-boong-wins-bafta-best-childrens-film-all-about-the-film-lakshmipirya-devi-2872797-2026-02-23",
      "headline": "What's Boong? All about the Manipuri film that bagged a BAFTA Manipuri film Boong made history by winning the BAFTA for Best Children's and Family Film. This victory highlights the rise of regional Indian cinema on the global stage. Here's all you need to know about the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/katherine-heigl-bids-farewell-to-gold-eric-dane-with-moving-robert-frost-poem-2872792-2026-02-23",
      "headline": "Katherine Heigl bids farewell to 'gold' Eric Dane with moving Robert Frost poem Actor Katherine Heigl shared an emotional tribute to her Grey's Anatomy co-star Eric Dane, who died last week after battling ALS. Remembering him through a poem close to her heart, Heigl honoured Dane not only for his iconic role as Dr Mark Sloan but also for his warmth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divided-by-language-united-by-cinema-alia-bhatt-on-representing-india-at-bafta-2872814-2026-02-23",
      "headline": "Divided by language, united by cinema: Alia Bhatt on representing India at BAFTA Alia Bhatt represented India at BAFTA 2026, speaking about diversity, global representation and the unifying power of cinema beyond language. Here's what she said on the red carpet and during her moment on stage as a presenter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ginny-weds-sunny-2-release-date-avinash-tiwary-medha-shankr-chemistry-2872784-2026-02-23",
      "headline": "Are Avinash Tiwary and Medha Shankr dating? Ginny Weds Sunny 2 pair sparks buzz Avinash Tiwary and Medha Shankr spark dating rumours after a recent public appearance just days before Ginny Weds Sunny 2 hits cinemas. Coincidence, or something more?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-faces-cyst-surgery-after-liver-cancer-treatment-2872766-2026-02-23",
      "headline": "Dipika Kakar faces new health setback, to undergo cyst surgery amid cancer battle Actor Dipika Kakar will soon be hospitalised for surgery after developing a cyst in her stomach, marking another health challenge following her recent liver cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/stop-saying-movies-are-bad-one-battle-after-another-director-paul-thomas-anderson-after-bafta-2026-win-2872760-2026-02-23",
      "headline": "Stop saying movies are bad: One Battle After Another director after BAFTA 2026 win Paul Thomas Anderson's action thriller One Battle After Another secured multiple awards at the BAFTA ceremony, with the director making pointed remarks about the state of modern cinema and sharing his hopes for fearless creativity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prakash-raj-jibes-at-the-kerala-story-2-shares-pics-of-beef-pork-fish-dishes-2872749-2026-02-23",
      "headline": "Prakash Raj jabs at The Kerala Story 2, shares pics of beef, pork, fish dishes Amid debates surrounding the upcoming film The Kerala Story 2, actor Prakash Raj commented on social media by posting photos of beef and pork dishes, referencing harmony in Kerala's food culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bafta-2026-honours-dharmendra-in-emotional-in-memoriam-moment-2872739-2026-02-23",
      "headline": "BAFTA 2026 honours Dharmendra in emotional In Memoriam moment Indian cinema had an emotional moment on the global stage at the 79th British Academy Film Awards, where legendary actor Dharmendra was remembered in the In Memoriam segment. The awards took place at London's Royal Festive Hall. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-deewane-seher-mein-box-office-collection-day-3-detailed-report-mrunal-thakur-film-stays-ahead-of-assi-2872744-2026-02-23",
      "headline": "Do Deewane Seher Mein box office Day 3: Mrunal Thakur's film stays ahead of Assi Do Deewane Seher Mein completes its opening weekend with a modest run at the box office, staying slightly ahead of Assi. Here's a look at its day-wise trend, competition from O' Romeo, and what lies ahead for Mrunal Thakur and Siddhant Chaturvedi's romantic drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hull-lad-who-toppled-hollywood-robert-aramayo-historic-night-bafta-2872725-2026-02-23",
      "headline": "Neither Leonardo DiCaprio nor Timothee, it was Robert Aramayo's night at BAFTA Robert Aramayo stunned Hollywood by winning BAFTA Best Actor for I Swear, beating Leonardo DiCaprio and Timothee Chalamet in a historic upset.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-pre-wedding-party-hyderabad-wildlife-theme-allu-arjun-sneha-reddy-2872709-2026-02-23",
      "headline": "Viral video: Ram Charan hugs Allu Arjun at Allu Sirish's pre-wedding bash Allu Sirish and Nayanika's pre-wedding celebration in Hyderabad, hosted by Allu Arjun and Sneha Reddy, brought together family and friends, including Ram Charan and Upasana Konidela, ahead of the couple's March 6 wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/o-romeo-box-office-collection-day-10-detailed-report-shahid-kapoor-film-behind-tbmauj-after-2nd-weekend-2872710-2026-02-23",
      "headline": "O' Romeo box office Day 10: Shahid Kapoor's film behind TBMAUJ after 2nd weekend Shahid Kapoor's O' Romeo completed 10 days at the box office with a steady second weekend but trails behind his previous hit, Teri Baaton Mein Aisa Uljha Jiya. Here's a detailed look at its growth trend, comparison, and how it performed amid new releases."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-reiterates-advisory-asking-citizens-to-leave-iran-shares-helplines-amid-rising-middle-east-tensions-2872883-2026-02-23",
      "headline": "India issues fresh 'leave Iran' advisory amid fears of possible US strikeIndia has advised its nationals in Iran to leave the country using available transport, including commercial flights, as tensions escalate and fears grow of a possible US military strike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-rs-590-crore-fraud-haryana-government-accounts-inside-details-2872780-2026-02-23",
      "headline": "How a routine account request revealed a Rs 590-crore fraud at IDFC First BankWhat began as a simple balance check has now expanded into a Rs 590-crore reconciliation exercise, a regulatory disclosure, multiple internal meetings at the highest levels of the bank, and a sharp selloff in the lender's stock. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/teen-gang-raped-after-being-drugged-private-party-bengaluru-posh-villa-instagram-men-arrested-2872860-2026-02-23",
      "headline": "Drugged, gang-raped at Bengaluru villa party: Teen accuses Instagram friendThe complaint was filed after the survivor said continued trauma compelled her to seek medical help and inform her family. Police have since booked the two men named in her statement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-president-mohammed-shahabuddin-reveals-ouster-plot-bnp-tarique-rahman-2872840-2026-02-23",
      "headline": "Yunus's actions totally illegal: Bangladesh President, now free, exposes dark plotsBangladesh President Mohammed Shahabuddin has revealed how Muhammad Yunus, the chief adviser to the interim administration, plotted to remove him, didn't allow him to travel abroad and kept him in the dark on the US trade deal. The President said he surprisingly got support from the BNP top leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-cupcake-ad-deleted-india-vs-south-africa-next-ad-prediction-2872895-2026-02-23",
      "headline": "Cupcake ad deleted, ego eaten: What is Star Sports serving next?T20 World Cup 2026: When the Cupcake promo disappeared after India's humbling defeat to South Africa in Ahmedabad, it symbolised more than embarrassment. The 'cupcake gate' has exposed how arrogance, hype, and disrespect have overtaken thoughtful storytelling in cricket broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-to-stop-collecting-trump-tariffs-deemed-illegal-by-supreme-court-from-february-24-2872796-2026-02-23",
      "headline": "Starting tomorrow, US to stop collecting Trump tariffs after Supreme Court rulingIn a statement, the US Customs and Border Protection said tariff collections under the International Emergency Economic Powers Act (IEEPA) will cease at 12.01 am local US time (10.30 am IST) Tuesday, instructing importers that all related tariff codes will be deactivated in its cargo systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-cm-mamata-banerjee-banga-vibhushan-bjp-mp-ananta-maharaj-west-bengal-elections-rajbanshi-2872787-2026-02-23",
      "headline": "Why Mamata awarded Bengal's top honour to a BJP MPMonths before the West Bengal Assembly elections, the Trinamool Congress government led by Mamata Banerjee conferred the Banga Vibhushan on BJP MP Nagen Roy, also known as Ananta Maharaj. Roy, a Rajya Sabha MP nominated by the BJP in 2023, is a prominent leader of the Rajbanshi community in North Bengal, where the Trinamool has struggled in recent polls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arunachal-woman-harassed-malviya-nagar-ac-dispute-given-racial-twist-2872748-2026-02-23",
      "headline": "AC dispute given racial twist: Accused's lawyer after Arunachal woman harassedThe lawyer for the accused, Harsh and Ruby Jain, dismissed the allegations and told India Today that although his client made certain remarks in anger, which were wrong and regrettable, the issue was not one of racial discrimination but rather a dispute between two neighbours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/rashmika-mandanna-vijay-deverakonda-arrive-udaipur-family-february-26-wedding-2872777-2026-02-23",
      "headline": "Rashmika-Vijay arrive in Udaipur with family ahead of February 26 wedding. PicsRashmika Mandanna and Vijay Deverakonda arrived at the Udaipur airport on February 23. Their family members accompanied them as they are prepared for their grand wedding later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-today-daily-why-does-people-on-earth-dont-notice-the-rotation-planet-gravity-motion-observe-pendulum-show-2871581-2026-02-23",
      "headline": "Earth rotates at 1,670 km per hour, so why don't we feel it?We examine why the Earth's constant spin goes completely unnoticed by the people living on it. We think about it and then forget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sees-major-military-reshuffle-defence-advisor-in-india-md-hafizur-rahman-called-back-2872844-2026-02-23",
      "headline": "Major military reshuffle in Bangladesh, defence advisor in India recalledUnder orders issued by the Bangladesh Army headquarters on Sunday, Brigadier General Md Hafizur Rahman, the country's incumbent defence advisor in India, has been promoted to major general and directed to return to assume command of the 55th Infantry Division as General Officer Commanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ahmedabad-t20-world-cup-loss-2872676-2026-02-23",
      "headline": "How South Africa plotted India's downfall right under their nose in AhmedabadIndia vs South Africa, T20 World Cup: The 100,000 fans in Ahmedabad fell silent again as India were defeated by South Africa in the Super 8s of the T20 World Cup. Ironically, the Proteas planned India's downfall right under their nose, and the Men in Blue did not even see it coming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/dharavi-redevelopment-project-gautam-adani-gutter-but-of-gold-why-mumbai-slums-charge-rs-5-lakh-rent-shanties-2872188-2026-02-22",
      "headline": "Gutter, but of gold. Why Dharavi slums charge Rs 5 lakh rent a monthThe towers of Mumbai have seen kilometres of expanse of Dharavi's asbestos and tin roofs for decades. Most pity the slums as a place that is deprived of the basics, while others romanticise them. As Asia's largest shanty town stands at the cusp of a major overhaul, it's humming with enterprise. Beyond the filth, Dharavi runs businesses that generate a billion dollars a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/5-bullets-in-iit-bombay-hostel-security-breach-raises-campus-safety-concerns-at-premier-institutions-2872745-2026-02-23",
      "headline": "5 bullets in IIT hostel, one big question: Are India's top institutes truly safe?A major security breach at IIT Bombay's Powai campus has raised fresh concerns after a 23-year-old man was arrested for storing live 7.65 mm cartridges inside a hostel room. The incident highlights serious lapses in identity verification, campus access control, and surveillance systems at one of India's premier educational institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/gurugram-surpasses-mumbai-in-rs-10-crore-plus-home-sales-in-2025-2872890-2026-02-23",
      "headline": "Big housing boost for Gurugram, overtakes Mumbai in 2025 luxury salesGurugram appears to be at the centre of India's ultra-luxury housing story, and the momentum suggests that demand for high-value homes is far from slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/unsafe-no-footfall-delhis-og-mall-ansal-plaza-is-now-a-ghost-town-2871780-2026-02-22",
      "headline": "Delhi's OG mall Ansal Plaza is now a ghost townHandcrafted ByOur Editors Not every generation might be able to relate to Ansal Plaza or its existence. But that doesn't change the fact that it was Delhi's OG mall. But today, its condition is as good as a ghost town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-election-2026-gyanendra-shah-king-video-kp-sharma-oli-balen-shah-gen-z-protests-monarchy-2872186-2026-02-23",
      "headline": "A twist by former Hindu King just ahead of Nepal electionNepal's election on March 5 comes after Gen Z protests ousted the government of PM KP Sharma Oli in September 2025. Loved by the Gen Zs, rapper-turned-Kathmandu mayor Balen Shah is challenging Oli on his turf in Jhapa. Amid this, Nepal's former king, Gyanendra, has re-entered the equation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mexico-drung-leader-el-mencho-jalisco-cjng-cartel-leader-organised-crime-nemesio-ruben-oseguera-cervantes-2872671-2026-02-23",
      "headline": "From police officer to Mexico's top drug lord: The rise and fall of El MenchoNotorious Mexican drug lord El Mencho, the USD 15-million-bounty cartel boss who built one of the world's most violent criminal empires, has been killed. Here is his criminal legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-ahmedabad-chase-virat-kohli-miss-2872755-2026-02-23",
      "headline": "Missed Virat Kohli? When India went searching for 300 in a 188-run chaseIND vs SA, T20 World Cup Super 8: This wasn't about Virat Kohli's absence. It was about India's absence of game awareness, as poor decisions, rigid tactics, and reckless batting turned a manageable chase into humiliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-man-claims-he-faced-third-world-treatment-at-5-star-mauritius-hotel-alleges-racism-2872839-2026-02-23",
      "headline": "Indian man says he faced 'third world' treatment at Mauritius hotel, alleges racismAn Indian man described his experience of alleged racial bias at a 5-star resort in Mauritius after influencer Sachin Awasthi's harrowing detention in South Korea went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-2026-super-8s-india-humbled-cupcake-ad-south-africa-win-2872661-2026-02-23",
      "headline": "India served humble pie as South Africa smash the cupcake right back at usA playful dig is one thing. But when the broadcaster mocked South Africa's history of painful exits, they handed the opposition a motivation that no dressing room team talk ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/justin-trudeau-winter-olympics-gold-us-canada-ice-hockey-white-house-post-victory-2872845-2026-02-23",
      "headline": "Trudeau's Winter Olympic gold boast melts as US has last laughThe White House mocked former Canadian Prime Minister Justin Trudeau, who had bragged about Canada striking gold at the 2026 Winter Olympics, by defeating the US in ice hockey. It shared a post: A bald eagle looming over a Canadian goose, sparking online buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/telugu-man-dies-in-us-h1b-visa-cardiac-arrest-attempts-stress-fundraiser-gofundme-indians-in-usa-2872836-2026-02-23",
      "headline": "Did H-1B visa stress kill Telugu man in US?An Indian man, Sasikanth Reddy Donthireddy died in the US after suffering a cardiac arrest. The fundraising campaign, launched to help repatriate his mortal remains to India, stated that he was stressed due to uncertainty surrounding his H-1B visa status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/el-mencho-killing-cities-burn-airport-stormed-in-mexico-videos-viral-social-media-2872736-2026-02-23",
      "headline": "Videos: Cities burn, airport stormed in Mexico after drug boss El Mencho killedAccording to Mexican security officials, cartel operatives set up more than 250 burning roadblocks across at least 20 states on Sunday, paralysing transport corridors and forcing residents indoors as smoke plumes rose over multiple cities in the aftermath of El Mencho's killing. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-suryakumar-yadav-problems-analysis-2872893-2026-02-23",
      "headline": "South Africa expose India's real problem: Accelerators without Kohli-type engine T20 World Cup: Surya Kumar Yadav smiled at a presser. South Africa had the last laugh. India's World Cup campaign is exposing a structural flaw no amount of aggression can hide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-cupcake-ad-deleted-india-vs-south-africa-next-ad-prediction-2872895-2026-02-23",
      "headline": "Cupcake ad deleted, ego eaten: What is Star Sports serving next? T20 World Cup 2026: When the Cupcake promo disappeared after India's humbling defeat to South Africa in Ahmedabad, it symbolised more than embarrassment. The 'cupcake gate' has exposed how arrogance, hype, and disrespect have overtaken thoughtful storytelling in cricket broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-west-indies-super-8-preview-t20-world-cup-mumbai-2872882-2026-02-23",
      "headline": "ZIM vs WI, Super 8 preview: India watch closely as confident sides clash in Mumbai T20 World Cup 2026, West Indies vs Zimbabwe Super 8 preview: Two-time champions West Indies will look to continue their resurgent run when they face an inspired Zimbabwe side that stunned Sri Lanka and Australia last week. India, who suffered a 76-run defeat to South Africa on Sunday, will also keep a close eye on this contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-captain-sikandar-raza-confident-icc-t20-world-cup-super-eights-2872869-2026-02-23",
      "headline": "Zimbabwe not worried about lack of experience in India: Raza sends Super 8 warning Zimbabwe captain Sikandar Raza dismissed concerns about his team's limited recent T20I experience in India, expressing confidence that they possess the belief and capability to produce a \"top performance\" in the Super Eights of the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-daren-sammy-praises-zimbabwe-motivation-super-8s-performance-2872843-2026-02-23",
      "headline": "Who said Zimbabwe was not supposed to be here? Sammy reacts to Super 8 pre-seeding West Indies head coach Daren Sammy on Sunday said Zimbabwe may have drawn extra motivation from being clubbed with higher-seeded sides Sri Lanka and Australia in Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-pakistan-players-shadow-ban-the-hundred-indian-franchises-warning-2872842-2026-02-23",
      "headline": "ECB warns Indian-owned The Hundred teams over shadow-ban on Pakistan players England Cricket Board has issued a reminder to The Hundred franchises of their obligations under anti-discrimination regulations, while reports keep emerging of Indian-owned franchises ignoring Pakistan players in the upcoming auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-t20-world-cup-david-miller-varun-chakravarthy-plans-super-8-press-conference-ahmedabad-2872834-2026-02-23",
      "headline": "South Africa were prepared for India's Varun Chakravarthy threat: David Miller T20 World Cup: South Africa batter David Miller explained how the Proteas did their homework about facing India's spin threat Varun Chakravarthy in the Super 8 clash in Ahmedabad, which ended up paying big dividends for the side in their dominant win om Sunday. Miller voiced pride on South Africa's overall brilliance shown against the defending champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-africa-t20-world-cup-axar-patel-snub-super-8-ryan-ten-doeschate-coach-clarifies-press-conference-2872808-2026-02-23",
      "headline": "India coach clarifies controversial Axar Patel snub after losing to South Africa T20 World Cup: India assistant coach Ryan ten Doeschate said the Axar Patel snub was a tactical call based on match-ups and the need for extra batting depth. He insisted the decision was not a reflection of Axar's value or leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-super-8-mohammad-amir-abhishek-sharma-slogger-t20-world-cup-2872791-2026-02-23",
      "headline": "Mohammad Amir clarifies slogger remark, sends message to Abhishek Sharma T20 World Cup 2026: Pakistan fast bowler Mohammad Amir acknowledged that many were upset when he called Abhishek Sharma a slogger. The left-arm pacer also sent a public message to the out-of-form India opener, who struggled during India's defeat to South Africa in a Super 8 match on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-axar-patel-snub-ashwin-slams-super-8-loss-ahmedabad-2872790-2026-02-23",
      "headline": "How can you forget what Axar has done? Ashwin slams vice-captain's snub after SA loss T20 World Cup: Ravichandran Ashwin criticised India's decision to bench Axar Patel in the Super 8 defeat to South Africa. The former spinner said stability, not overthinking match-ups, wins ICC tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-ahmedabad-chase-virat-kohli-miss-2872755-2026-02-23",
      "headline": "Missed Virat Kohli? When India went searching for 300 in a 188-run chase IND vs SA, T20 World Cup Super 8: This wasn't about Virat Kohli's absence. It was about India's absence of game awareness, as poor decisions, rigid tactics, and reckless batting turned a manageable chase into humiliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-cupcake-ad-taken-off-ahmedabad-loss-super-8-2872733-2026-02-23",
      "headline": "T20 World Cup: Cringe cupcake ad taken off after India lose to South AfricaT20 World Cup: A pre-match cupcake ad mocking South Africa resurfaced after India's 76-run loss in Ahmedabad. The defeat not only dented pride but also left India's semi-final hopes hanging by Net Run Rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-tilak-varma-disappointed-sunil-gavaskar-batting-approach-ahmedabad-2872702-2026-02-23",
      "headline": "Tilak Varma disappointed me: Sunil Gavaskar slams batter's approach in SA lossT20 World Cup: Sunil Gavaskar questioned Tilak Varma's shot selection after India's heavy Super 8 defeat to South Africa. The former captain felt the chase required patience, not early risk-taking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-david-miller-t20-world-cup-they-are-beatable-post-match-press-confernece-ahmedabad-loss-2872683-2026-02-23",
      "headline": "Showed that India is beatable: David Miller proud of South Africa's Super 8 winT20 World Cup: David Miller said South Africa proved India are beatable after their 76-run Super 8 win in Ahmedabad. The Proteas veteran credited discipline, experience and sticking to simple plans for the statement victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ahmedabad-t20-world-cup-loss-2872676-2026-02-23",
      "headline": "How South Africa plotted India's downfall right under their nose in AhmedabadIndia vs South Africa, T20 World Cup: The 100,000 fans in Ahmedabad fell silent again as India were defeated by South Africa in the Super 8s of the T20 World Cup. Ironically, the Proteas planned India's downfall right under their nose, and the Men in Blue did not even see it coming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-2026-super-8s-india-humbled-cupcake-ad-south-africa-win-2872661-2026-02-23",
      "headline": "India served humble pie as South Africa smash the cupcake right back at usA playful dig is one thing. But when the broadcaster mocked South Africa's history of painful exits, they handed the opposition a motivation that no dressing room team talk ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ryan-ten-doeschate-hints-at-sanju-samson-comeback-ind-vs-sa-2872659-2026-02-23",
      "headline": "Sanju Samson back? Coach hints at changes after Abhishek, Tilak flop vs SAIndia suffered a heavy defeat against South Africa in their T20 World Cup Super 8 fixture. Following their loss, the team is considering recalling Sanju Samson to address persistent opening batting failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-shaun-pollock-on-india-batting-failure-t20-world-cup-loss-south-africa-2872654-2026-02-23",
      "headline": "Gavaskar, Pollock slam India's one-dimensional batting: Threw bat at everythingFormer cricketers Gavaskar and Pollock criticised India's batting approach after a heavy defeat to South Africa in the T20 World Cup. The loss ended India's 12-match winning streak and raised questions over their adaptability and strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-t20-world-cup-sunil-gavaskar-india-batters-six-hitters-south-africa-defeat-2872649-2026-02-23",
      "headline": "Sunil Gavaskar calls for India's batters to be more than six-hitters after SA defeatFormer India cricketer, Sunil Gavaskar, in an exclusive interaction with Nikhil Naz on India Today, opened up on the batting unit of the Indian T20I side after the crushing 76-run defeat to South Africa in the Super 8 stages of the T20 World Cup. The batting legend called for the side led by Suryakumar Yadav to be more than just six-hitters and ones who can also play based on the conditions and the situation as well, when the conditions get tough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-sunil-gavaskar-sundar-pichai-meeting-ahmedabad-2872648-2026-02-23",
      "headline": "Sundar Pichai says Gavaskar his idol. Batting great lifts lid on T20WC meetingIndian batting great Sunil Gavaskar shared details of his meeting with Google and Alphabet CEO Sundar Pichai during the Super Eights clash between India and South Africa in Ahmedabad on Sunday, after the tech leader described him as his childhood idol and recalled growing up with his posters on the wall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-suryakumar-blames-poor-batting-for-south-africa-loss-aggressive-style-2872640-2026-02-22",
      "headline": "Suryakumar blames poor batting for SA loss, refuses to abandon aggressive styleIndia suffered a heavy defeat against South Africa in the Super 8 fixture of the T20 World Cup 2026. India captain Suryakumar Yadav blamed team's poor batting show for the crushing loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-semi-final-chances-76-run-loss-to-south-africa-super-8-2872641-2026-02-22",
      "headline": "T20 World Cup: Why India's semifinal chances look bleak after 76-run defeat to SASouth Africa handed India a crushing 76-run defeat at the Narendra Modi Stadium in the T20 World Cup 2026, pushing the Men in Blue into a tricky position with their semi-final spot now under serious threat. Here's a look at how they can still progress to the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-miller-jansen-south-africa-beat-india-ahmedabad-2872626-2026-02-22",
      "headline": "Ahmedabad heartbreak 2.0: SA bring India back to earth, hand massive Super 8 lossIndia vs South Africa, T20 World Cup: Ahmedabad continues to haunt India's unbeaten runs. On November 19, 2023, Australia ended their perfect ODI World Cup campaign at the final hurdle. On Sunday, South Africa repeated the script, snapping India's 12-match winning streak in the T20 World Cup, inflicting a crushing 76-run defeat on the hosts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-poor-performance-ind-vs-sa-t20-world-cup-gautam-gambhir-criticism-2872617-2026-02-22",
      "headline": "Gambhir slammed as India's Washington Sundar experiment fails vs South AfricaIndia head coach Gautam Gambhir faced criticism after Washington Sundar's underwhelming performance against South Africa in the T20 World Cup. The tactical choice to include Sundar over Axar Patel sparked debate over team selection and strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-super-8-jasprit-bumrah-masterclass-ahmedabad-2872612-2026-02-22",
      "headline": "Jasprit Bumrah stands out in Ahmedabad: 3 for 15 and a new T20 World Cup recordT20 World Cup 2026, IND vs SA Super 8: Jasprit Bumrah delivered a masterclass in control and craft, claiming three crucial wickets and conceding just 15 runs in his quota of four overs, but South Africa's late surge denied India complete dominance in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-unlikely-to-play-all-matches-of-ipl-2026-csk-2872578-2026-02-22",
      "headline": "MS Dhoni unlikely to play all matches of IPL 2026: ReportMS Dhoni has confirmed his availability for the IPL 2026 season with Chennai Super Kings. However, his participation in all matches remains uncertain due to fitness and team strategy considerations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-super-8s-playing-xi-toss-2872564-2026-02-22",
      "headline": "IND vs SA Super 8: India continue to bench vice-captain Axar PatelIND vs SA, T20 World Cup: India once again left out vice-captain Axar Patel as the defending champions named an unchanged playing XI for their Super 8 clash against South Africa in Ahmedabad on Sunday, February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-england-vs-sri-lanka-super-8-score-will-jacks-pallekele-2872563-2026-02-22",
      "headline": "Sri Lanka hand Harry Brook a birthday gift as England begin Super 8 with winT20 World Cup, SL vs ENG Super 8: Sri Lanka were bundled out for 95 in 16.4 overs as England's spinners ran riot, successfully defending a par total of 146. Will Jacks starred with his part-time off-spin, claiming three crucial wickets in Pallekele on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sialkot-stallionz-sold-again-ownership-dispute-psl-11-2872554-2026-02-22",
      "headline": "Pakistan Super League: Sialkot Stallionz sold again ahead of new seasonThe Sialkot Stallionz franchise in the Pakistan Super League has been sold again following disputes over ownership and financial background. The controversy raises questions about the PCB's vetting process ahead of the PSL 11 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-women-defend-acc-womens-asia-cup-rising-stars-title-46-run-victory-bangladesh-a-2872531-2026-02-22",
      "headline": "India retain Women's Asia Cup Rising Stars title, beat Bangladesh again in finalIndia A women's cricket team retained their ACC Women's Asia Cup Rising Stars crown after defeating Bangladesh A by 46 runs in the final held at the Terdthai Cricket Ground. The defending champions overcame early setbacks and relied on strong batting and disciplined bowling to secure victory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}