{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-it-pharma-stocks-drag-markets-2682149-2025-02-19",
      "headline": "Sensex, Nifty open lower as IT, pharma stocks drag marketsThe S&P BSE Sensex shed 291.20 points to 75,676.19, while the NSE Nifty50 lost 88.65 points to 22,856.65 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-allotment-status-online-guide-latest-gmp-listing-date-allotment-date-2682131-2025-02-19",
      "headline": "Quality Power IPO: Check allotment status, latest GMP and listing date Quality Power IPO allotment status: Investors who applied for the Quality Power IPO can check their allotment status through the BSE website or the registrar's website (Link Intime India Private Ltd)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-hunts-for-land-in-india-manufacturing-plant-maharashtra-leads-report-2682119-2025-02-19",
      "headline": "Elon Musk's Tesla hunts for land in India, Maharashtra leads: ReportWhile Maharashtra is leading the race, other states are also vying for the project. Tesla's plans could change depending on the incentives offered by different states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-to-roll-out-from-april-1-check-eligibility-and-benefits-2681864-2025-02-18",
      "headline": "Unified Pension Scheme to roll out from April 1. Check eligibility and benefitsUnder the new pension scheme, government employees will contribute 10% of their basic salary along with DA, while the government's contribution will rise from the previous 14% to 18.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elss-explained-check-tax-benefits-under-section-80c-and-other-key-details-2681815-2025-02-18",
      "headline": "ELSS explained: Check tax benefits under Section 80C and other key details ELSS offers market-linked returns and has the potential to generate higher long-term returns as compared to other Section 80C options, including PPF, ULIPS, and NPS, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-tariffs-could-hurt-indian-exports-which-sectors-are-at-risk-2681818-2025-02-18",
      "headline": "Trump's reciprocal tariffs could hurt Indian exports. Which sectors are at risk?While officials are still waiting for details on how these tariffs will be calculated, they are already preparing countermeasures and working on a trade deal proposal to reduce tariffs and boost two-way trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsSugar price hike: A drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gajraj-rao-renuka-shahane-dupahiya-prime-video-teaser-2681147-2025-02-17",
      "headline": "Gajraj Rao, Renuka Shahane's Dupahiya to bring laughter and chaos to Prime VideoPrime Video's Dupahiya is set in a crime-free village where the first-ever theft of a motorbike creates chaos and drama. Starring Gajraj Rao and Renuka Shahane, the comedy series starts streaming on March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": "No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-on-usd-21-million-fund-cut-for-voter-turnout-in-india-theyve-lot-of-money-2682095-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I've lot of respect for PM, but why are we giving $21 million to India? TrumpEarlier this week, the Elon Musk-led Department of Government Efficiency announced that it had slashed $723 million in foreign aid funding, including a $21 million grant for India aimed at increasing \"voter turnout\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-market-regulator-sec-india-help-gautam-adani-bribery-case-court-filing-2682101-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US regulator seeks India's help in Adani bribery case, shows court filing: ReportGautam Adani bribery case: The US Securities and Exchange Commission has requested the Indian government's assistance in its probe of industrialist Gautam Adani and his nephew in connection with a  USD 265 million bribery case, according to a court filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1b-visa-cost-varies-for-indians-factors-might-push-up-price-lottery-green-card-us-jobs-explained-2681339-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "H-1B visa cost varies for Indians. These factors might push up priceFor Indian professionals dreaming of working in the US, the H-1B visa is the favourite of visas. The H-1B visa involves a lottery system and can cost up to Rs 6.1 lakh. Here's a breakdown of the expense and how much an H-1B visa might cost for an employer and applicant."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-video-cuffs-shackles-treatment-illegal-immigrants-indians-video-donald-trump-crackdown-2682139-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US advertises 'cuffs and shackles' treatment for illegal immigrants in videoThe US posted a video showing illegal immigrants in shackles as they prepare them to board a deportation flight in America. The deportation of illegal immigrants comes as part of a sweeping crackdown by President Donald Trump on illegal immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/women-health-risks-with-age-signs-and-symptoms-to-be-not-ignored-heart-health-cervical-cancer-brain-stroke-2682126-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Listen up, ladies. Doctors don't want you to ignore these health signs, symptomsDoctors say women tend to ignore a lot of signs and symptoms indicating serious health risks. Here is a comprehensive guide to recognising them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-relevance-t20-dominance-pakistan-2682156-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is the Champions Trophy still relevant in the age of T20 cricket dominance?The Champions Trophy returns to the cricket calendar after an eight-year hiatus. Despite the dominance of T20 cricket, ODI cricket still holds significance through marquee tournaments like the Champions Trophy and World Cup. Multi-nation events could be key to reviving its relevance in a crowded cricketing calendar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gyanesh-kumar-new-chief-election-commissioner-rajiv-kumar-ec-head-2682145-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gyanesh Kumar takes charge as new poll body chief, replaces Rajiv KumarFormer bureaucrat Gyanesh Kumar replaced Rajiv Kumar and took charge as India's 26th Chief Election Commissioner and said the first step towards nation building is voting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttarakhand/story/uttarakhand-man-posing-as-icc-chief-jay-shah-demands-rs-5-lakh-haridwar-bjp-mla-adesh-chauhan-arrested-2682134-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand man posing as Amit Shah's son demads Rs 5 lakh from MLA, arrestedThe 19-year-old accused, Priyanshu Pant was arrested in Delhi on Monday night. A second accomplice was taken into custody in Uttarakhand, while a search operation is on for the third accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-chhaava-prep-sword-traiing-horse-riding-and-daily-scars-watch-2682129-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Vicky Kaushal became Chhaava: Sword training, horse riding and daily scarsVicky Kaushal trained for six months for Chhaava, enduring 6–8 hours of daily prep, including sword fighting and horse riding. The historical drama has crossed Rs 165 crore in five days at the box office. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bengaluru-man-sues-wins-case-against-pvr-inox-for-wasting-time-with-long-ads-in-theatre-2682135-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru man wins case against PVR-INOX for wasting time with 25-min adsA consumer court in Bengaluru ruled in favour of a man who sued PVR Cinemas and INOX for wasting his time with long commercial advertisements. The court also directed the multiplex chain to specify actual movie start times on tickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/rocky-rihanna-celebrate-not-guilty-verdict-assault-trial-2682107-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: US rapper hugs Rihanna after 'not guilty' verdict in assault caseAfter a three-week trial, the jury deliberated for just three hours to reach the verdict that spared Rocky, whose legal name is Rakim Mayers, a prison sentence that could have run more than two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/andhra-pradesh-issues-ramzan-order-for-muslims-after-bjp-uproar-over-similar-order-by-telangana-government-2682078-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Andhra Pradesh's early leave for Muslims during Ramzan came before TelanganaThe Andhra Pradesh government issued a government order allowing Muslim employees to leave work an hour early during Ramzan, similar to the one issued in Telangana. However, while the BJP in Telangana slammed the ruling Congress for \"appeasement politics\", in Andhra Pradesh, the alliance party kept quiet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-diya-kumaris-lunch-became-a-talking-point-on-rajasthan-budget-2681936-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Diya Kumari's lunch became a talking point on Rajasthan Budget'Green' and 'clean' buzzed as the deputy CM cum finance minister offered broad indicators about her first full-fledged Budget, to be presented on February 19"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/eknath-shinde-dismisses-claims-of-rift-in-mahayuti-shiv-sena-ncp-bjp-devendra-fadnavis-maharashtra-2682042-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No cold war: Eknath Shinde rejects reports of rift with Devendra FadnavisMaharashtra Deputy Chief Minister Eknath Shinde said there was \"absolutely no cold war\" between him and Chief Minister Devendra Fadnavis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-hunts-for-land-in-india-manufacturing-plant-maharashtra-leads-report-2682119-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's Tesla hunts for land in India, Maharashtra leads: ReportWhile Maharashtra is leading the race, other states are also vying for the project. Tesla's plans could change depending on the incentives offered by different states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-rajkot-maternity-hospital-private-videos-women-patients-sold-online-youtube-telegram-2682044-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Videos of women patients at Gujarat maternity hospital leaked, sold on TelegramVideos of women patients at Payal Maternity Hospital were uploaded to a YouTube channel, with access offered via a Telegram link for a fee ranging from Rs 999 to Rs 1,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bharat-jodo-yatra-inspired-wedding-invite-takes-unity-in-diversity-to-next-level-2681960-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bharat Jodo Yatra inspired wedding invite takes unity in diversity to next levelA wedding invitation titled 'Bharat Jodo Vivah' celebrating the nuptials of a Jammu-based girl and a Kerala-based boy has warmed the hearts of many social media users. Inspired by Congress's Bharat Jodo Yatra, the card highlights the couple's cultural backgrounds, with personal invitations to Rahul and Priyanka Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-hearing-pleas-appointment-process-election-commissioners-appointment-2682099-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court hearing of pleas on appointment of election commissioners todayThe Supreme Court hearing comes two days after Election Commissioner Gyanesh Kumar was elevated as the Chief Election Commissioner. His term will run till January 26, 2029, days before the poll body is expected to announce the next Lok Sabha polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-where-to-watch-live-streaming-full-squads-schedule-2681833-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy Live Streaming: When and where to watch matches, full squadsThe Champions Trophy 2025 returns to the cricket calendar after a hiatus of nearly 8 years. Here's everything you need to know about the matches, venues, timings and the squads in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhatrapati-sambhaji-maharaj-objectionable-comments-wikipedia-maharashtra-devendra-fadnavis-chhaava-2682002-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wikipedia gets police notice over 'objectionable' content on Sambhaji MaharajObjectionable comments about Chhatrapati Sambhaji Maharaj appeared on Wikipedia days after the release of Chhaava, a Bollywood film starring Vicky Kaushal, based on the life of the second Chhatrapati of the Maratha Empire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/guillain-barre-syndrome-can-be-life-impairing-how-to-detect-fight-the-disease-2681376-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Guillain-Barré Syndrome can be life-impairing: How to detect, fight the diseaseKey facts about the autoimmune nerve condition that, in severe cases, can even cause paralysis\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-qatar-open-exit-matteo-berrettini-loss-hamstring-injury-2682112-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fully fit Novak Djokovic handed shock Qatar Open exit by Matteo BerrettiniNovak Djokovic's struggles in 2025 continued as he suffered a shocking Round of 32 defeat to Matteo Berrettini at the Qatar Open. The Italian dominated after a tiebreak first set to claim a 7-6 (4), 6-2 win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/rahul-gandhi-permanent-exception-court-appearance-pune-veer-savarkar-defamation-case-bail-2682116-2025-02-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After bail, Rahul Gandhi exempted from court presence in Savarkar defamation caseCongress MP Rahul Gandhi was permanently exempted from appearing in a Pune court in a defamation case against him over his alleged remarks on Hindutva ideologue Veer Savarkar. He got bail last month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-stampede-conflicting-accounts-railways-rpf-police-expose-critical-communication-gaps-2682000-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi stampede: Conflicting accounts expose critical communication gapsThe starkly conflicting versions from the Railways, Railway Protection Force (RPF), and Delhi Police about what happened on the night of Delhi stampede not only raise serious questions about the chain of command, but also highlight a significant communication gap among the agencies responsible for managing the station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-kulhari-recalls-himesh-reshmmaiya-comment-dont-mess-with-what-we-have-2680544-2025-02-19",
      "headline": "Kriti Kulhari recalls Himesh Reshmmaiya comment: 'Don't mess with the dialogues'Actor Kirti Kulhari opened up about her role in the recent hit Badass Ravi Kumar. In an interview, the Pink actor revealed that Himesh Reshammiya was not open to her input on the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-5-rs-165-crore-strong-weekday-hold-vicky-kaushal-2682153-2025-02-19",
      "headline": "Chhaava box office collection: Rs 165 crore in 5 days, strong weekday holdChhaava box office: Chhaava is unstoppable at the box office, crossing Rs 150-crore mark in five days. With strong weekday occupancy, it has earned Rs 165 crore in India, showing solid growth in Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-keith-urbans-los-angeles-home-burglarised-2682122-2025-02-19",
      "headline": "Nicole Kidman-Keith Urban's Los Angeles home burglarised: ReportActor Nicole Kidman and her husband Keith Urban's Beverly Hills mansion was reportedly broken into over the weekend. The couple was not home, and it remains unclear if anything was stolen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rashmika-mandanna-bad-fit-to-play-maharani-yesubai-in-vicky-kaushal-chhaava-2681837-2025-02-19",
      "headline": "Why Rashmika Mandanna was a bad fit to play Yesubai in Vicky Kaushal's ChhaavaRashmika Mandanna's performance as Maharani Yesubai Bhonsale in the recent period drama Chhaava, has been receiving a lot of criticism after its theatrical release on February 14, 2025. In this piece, we discuss why her performance was underwhelming.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-arshdeep-singh-over-harshit-rana-jasprit-bumrah-replacement-ricky-ponting-2682158-2025-02-19",
      "headline": "Arshdeep Singh over Harshit Rana to replace Jasprit Bumrah: Ricky PontingRicky Ponting backed Arshdeep Singh over Harshit Rana as India's best replacement for injured Jasprit Bumrah in the Champions Trophy, citing Arshdeep's control and experience in white-ball cricket as key factors for India's bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-relevance-t20-dominance-pakistan-2682156-2025-02-19",
      "headline": "Is the Champions Trophy still relevant in the age of T20 cricket dominance?The Champions Trophy returns to the cricket calendar after an eight-year hiatus. Despite the dominance of T20 cricket, ODI cricket still holds significance through marquee tournaments like the Champions Trophy and World Cup. Multi-nation events could be key to reviving its relevance in a crowded cricketing calendar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-squad-depth-injuries-shane-bond-pakistan-2682128-2025-02-19",
      "headline": "New Zealand has squad depth for Champions Trophy despite injuries: BondDespite injury setbacks, Shane Bond believes New Zealand's squad depth remains strong, emphasising their all-rounders' impact and confidence from recent triumphs ahead of the Champions Trophy opener against Pakistan in Karachi on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-qatar-open-exit-matteo-berrettini-loss-hamstring-injury-2682112-2025-02-19",
      "headline": "Fully fit Novak Djokovic handed shock Qatar Open exit by Matteo BerrettiniNovak Djokovic's struggles in 2025 continued as he suffered a shocking Round of 32 defeat to Matteo Berrettini at the Qatar Open. The Italian dominated after a tiebreak first set to claim a 7-6 (4), 6-2 win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-ct-2025-faqs-complete-guide-teams-venues-format-schedule-2682109-2025-02-19",
      "headline": "Champions Trophy FAQs: Your complete guide to the returning mini World Cup Champions Trophy 2025 FAQs: In these 13 FAQs, we have covered everything you need to know about the ICC Champions Trophy 2025, from the schedule and venues to team line-ups and live streaming details. This comprehensive guide ensures you stay informed about all key aspects of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-new-zealand-babar-azam-rizwan-2681994-2025-02-19",
      "headline": "Defending champions Pakistan face big test vs in-form New Zealand todayChampions Trophy: Pakistan recently lost the tri-series final to New Zealand, but will be looking to make amends when the two teams face each other on February 19 at National Stadium in Karachi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-awais-ahmad-rohit-sharma-virat-kohli-2682077-2025-02-19",
      "headline": "Pakistani net bowler, viral after toe-crushers to Rohit Sharma, lives his dreamChampions Trophy 2025: In an interview with Sports Today, fast bowler Awais Ahmad talked about living his dream while bowling to Virat Kohli and Rohit Sharma during the Indian net session. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-live-streaming-karachi-pitch-report-playing-11-prediction-2682009-2025-02-19",
      "headline": "Pakistan vs New Zealand live streaming: Champions Trophy opener complete guide Champions Trophy 2025, Pakistan vs New Zealand: Defending champions Pakistan face familiar foes New Zealand on Wednesday in the first match of the tournament, which returns after 8 years. It's a crucial match for the hosts ahead of their big game against India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/tom-latham-braces-for-cracking-champions-trophy-opener-vs-pakistan-2682081-2025-02-19",
      "headline": "Tom Latham braces for 'cracking' Champions Trophy opener vs Pakistan Champions Trophy: Tom Latham said that he is expecting for a cracker of a game when New Zealand lock horns with Pakistan on February 19 at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-preview-team-ratings-podcast-india-pakistan-favourites-2682027-2025-02-18",
      "headline": "Champions Trophy preview and team ratings: Are India the favourites?The Champions Trophy returns to the cricket calendar after eight years, marking a significant moment for Pakistan, which hosts a major ICC event for the first time in 29 years. Eight teams will compete for the prestigious title, once famously dubbed the mini-World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-awais-ahmad-rohit-sharma-virat-kohli-2682077-2025-02-19",
      "headline": "Pakistani net bowler, viral after toe-crushers to Rohit Sharma, lives his dreamChampions Trophy 2025: In an interview with Sports Today, fast bowler Awais Ahmad talked about living his dream while bowling to Virat Kohli and Rohit Sharma during the Indian net session. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-live-streaming-karachi-pitch-report-playing-11-prediction-2682009-2025-02-19",
      "headline": "Pakistan vs New Zealand live streaming: Champions Trophy opener complete guide Champions Trophy 2025, Pakistan vs New Zealand: Defending champions Pakistan face familiar foes New Zealand on Wednesday in the first match of the tournament, which returns after 8 years. It's a crucial match for the hosts ahead of their big game against India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/tom-latham-braces-for-cracking-champions-trophy-opener-vs-pakistan-2682081-2025-02-19",
      "headline": "Tom Latham braces for 'cracking' Champions Trophy opener vs Pakistan Champions Trophy: Tom Latham said that he is expecting for a cracker of a game when New Zealand lock horns with Pakistan on February 19 at the National Stadium in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nat-sciver-brunt-gujarat-giants-mumbai-indians-2682041-2025-02-18",
      "headline": "All-round Nat Sciver Brunt powers MI to crushing win over Gujarat GiantsWPL 2025: Nat Sciver Brunt put in an all-rounder performance as the Mumbai Indians (MI) beat the Gujarat Giants (GG) by five wickets on Tuesday at the Kotambi Stadium in Vadodara. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-preview-team-ratings-podcast-india-pakistan-favourites-2682027-2025-02-18",
      "headline": "Champions Trophy preview and team ratings: Are India the favourites?The Champions Trophy returns to the cricket calendar after eight years, marking a significant moment for Pakistan, which hosts a major ICC event for the first time in 29 years. Eight teams will compete for the prestigious title, once famously dubbed the mini-World Cup."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}