{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-cements-share-price-surged-11-percent-today-why-reason-ultratech-cement-accquisition-2653974-2024-12-23",
      "headline": "Explained: Why India Cements share price surged 11% today Shares of India Cements rose after UltraTech Cement received a crucial approval from the Competition Commission of India (CCI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/direct-tax-vivad-se-vishwas-scheme-2024-what-is-it-how-to-avail-it-eligibility-application-process-why-to-choose-it-2653945-2024-12-23",
      "headline": "Vivad Se Vishwas Scheme 2024: What is it and how to avail it?Settle tax disputes easily under the Vivad Se Vishwas Scheme 2024 by paying the disputed tax and avoiding penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-jumps-800-points-key-factors-behind-bull-run-2653942-2024-12-23",
      "headline": "Sensex jumps 800 points: 3 factors behind today's stock market rallyThe S&P BSE Sensex climbed 802.66 points to 78,844.25 by 11:06 am, while the NSE Nifty50 advanced 243 points to trade at 23,828.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/concord-enviro-ipo-closes-for-bidding-check-latest-subscription-gmp-stmp-2653936-2024-12-23",
      "headline": "Concord Enviro IPO closes for bidding: Check latest subscription, GMP The Concord Enviro IPO is a book-built issue worth Rs 500.33 crore. It consists of a fresh issue of 25 lakh shares, which will raise Rs 175 crore, and an offer for sale (OFS) of 46 lakh shares valued at Rs 325.33 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-zomato-ril-tcs-vedanta-ntpc-green-ultratech-cement-bse-nse-sensex-nifty-2653866-2024-12-23",
      "headline": " Stocks to watch today: Zomato, RIL, TCS, Vedanta, NTPC Green, Ultratech CementBoth the BSE Sensex and NSE Nifty50 witnessed massive losses last week, with the Sensex dropping over 4,000 points across five consecutive sessions and the Nifty falling by nearly 1,200 points, marking a 5% weekly loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-details-check-opening-date-gmp-price-band-lot-size-allotment-stmp-2653911-2024-12-23",
      "headline": "Unimech Aerospace IPO opens: Check opening date, gmp, price band, lot size Unimech Aerospace IPO: The price band for the IPO has been set at Rs 745 to Rs 785 per share. The minimum lot size for investors is 19 shares, which requires a minimum investment of Rs 14,915."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-check-latest-gmp-subscription-last-day-for-bidding-allotment-date-listing-2653892-2024-12-23",
      "headline": "Dam Capital Advisors IPO: Check GMP as listing enters last day for bidding Dam Capital Advisors IPO is a book-built issue worth Rs 840.25 crore. The entire issue is an Offer for Sale (OFS) of 2.97 crore shares by the selling shareholders, meaning the company will not receive any funds from this offering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-snap-losing-streak-with-it-metal-stocks-surge-ril-shares-up-over-1-percent-2653884-2024-12-23",
      "headline": "Sensex, Nifty snap losing streak with IT, metal surge; RIL shares up over 1%The S&P BSE Sensex was up 577.72 points to 78,619.31, while the NSE Nifty50 gained 185.80 points to 23,773.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-in-focus-entry-bse-sensex-replaces-jsw-steel-stocks-to-watch-2653878-2024-12-23",
      "headline": "Zomato shares to be in focus today. Here's why Zomato's stock has surged nearly 43% over the last six months and approximately 126% over the past year, far outpacing the Sensex's one-year return of 10.7%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rohan-mirchandani-death-yogurt-brand-epigamia-co-founder-dies-at-42-due-to-cardiac-arrest-2653723-2024-12-22",
      "headline": "Epigamia co-founder Rohan Mirchandani dies at 42 due to cardiac arrestRohan Mirchandani, co-founder of Epigamia, died due to cardiac arrest. Known for transforming India's food market, he led Epigamia's growth to over 20,000 retail outlets in 30 cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-key-decisions-what-cheaper-what-costlier-and-all-other-details-2653637-2024-12-22",
      "headline": "GST Council's key decisions: What's cheaper, what's costlier, and all other detailsGST Council brings key tax changes impacting everyday essentials like popcorn, used cars, fortified rice, corporate sponsorships, and penalties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goods-and-services-tax-eighteen-per-cent-used-ev-car-sale-business-jet-fuel-gst-2653536-2024-12-21",
      "headline": "GST at 18% on used EV car sale by business, jet fuel stays out of its ambitThe GST Council in its 55th meeting also decided to clarify on taxability of popcorn, saying caramelised popcorn will continue to attract tax at the rate of 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-lowering-tax-for-health-life-insurance-premiums-2653343-2024-12-21",
      "headline": "GST Council delays decision on lowering tax for health, life insurance premiumsGST Council Meeting: During the 55th meeting held on Saturday, technical considerations led to the deferral, with the Group of Ministers (GoM) tasked to conduct further deliberations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-2653320-2024-12-21",
      "headline": "GST Council Meeting: Will tax rates on health and life insurance premiums drop today? GST Council Meeting begins: One of the key items on the agenda is the proposal to reduce the Goods and Services Tax (GST) on insurance premiums, a move that could bring relief to policyholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/55th-gst-council-meeting-what-to-expect-costlier-cheaper-food-delivery-luxury-items-insurance-premiums-2653307-2024-12-21",
      "headline": "55th GST Council Meeting begins: What could become costlier or cheaper todayGST Council Meeting: From essential services to luxury items, a wide range of proposals are under discussion, some of which could significantly impact consumers and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-4000-points-nifty50-decline-5-trading-sessions-this-week-explained-2652984-2024-12-20",
      "headline": "Explained: Why Sensex fell 4,000 points in 5 trading sessionsThe BSE Sensex plummeted over 4,000 points across five consecutive sessions, while the NSE Nifty50 fell approximately 1,200 points, representing a nearly 5% loss within the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/direct-tax-vivad-se-vishwas-scheme-2024-dtvsv-faqs-for-settling-tax-disputes-easily-2652961-2024-12-20",
      "headline": "Vivad Se Vishwas Scheme: FAQs for settling tax disputes easily Taxpayers can resolve pending income tax disputes under the Direct Tax Vivad Se Vishwas Scheme 2024 by settling the disputed tax amount and avoiding additional interest and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nita-ambani-to-headline-india-conference-at-harvard-2652947-2024-12-20",
      "headline": "Nita Ambani to headline India Conference at HarvardThe India Conference at Harvard, one of the largest student-led India-focused events in the US, is hosted by students across Harvard's graduate and undergraduate schools."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-nosedives-1100-points-nifty-below-23600-it-stocks-tumble-2652911-2024-12-20",
      "headline": "Sensex nosedives 1,100 points, Nifty falls below 23,600; IT stocks tumbleStock market crash: The S&P BSE Sensex ended 1,176.46 points lower at 78,041.59, while the NSE Nifty50 settled 364.20 points lower at 23,587.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-money-launches-pay-later-margin-trading-facility-mtf-3-things-to-know-2652885-2024-12-20",
      "headline": "Paytm Money launches 'Pay Later' Margin Trading. 3 things to knowPaytm Money launches 'Pay Later' MTF, democratising stock trading with seamless activation, innovative tools, and affordable rates."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/allu-arjun-house-attack-hyderabad-court-bail-brs-leader-claim-revanth-reddy-link-2653901-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Accused in Allu Arjun house attack get bail, Revanth Reddy link emergesBRS leader Krishank has claimed that one of the six accused, who got bail in actor Allu Arjun's house attack case, was an \"aide\" of Telangana Chief Minister Revanth Reddy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-manu-bhaker-khel-ratna-award-nominees-2653963-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manu Bhaker, double Olympic medalist, not in Khel Ratna nominees list: SourcesManu Bhaker, who won two bronze medals in the Paris Olympics earlier this year, won't be getting the Khel Ratna award. Her father Ramkrishna Bhasker was disappointed after the committee did not recommend her name."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/khalistan-commando-force-terrorists-killed-encounter-punjab-gurdaspur-attack-police-up-pilibhit-2653869-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "3 Khalistani terrorists, who attacked Punjab Police post, killed in UP encounterThree terrorists belonging to Khalistan Commando Force were killed in an encounter in Uttar Pradesh. The police also seized two AK-47 rifles and two pistols from their custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-greenland-buy-control-panama-canal-retake-demand-us-president-elect-2653949-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Panama Canal, Trump now wants US to buy Greenland: 'Absolute necessity'Donald Trump's renewed interest in Greenland is not new as the US President-elect had made his desire known to control the territory during his first term from 2017 to 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/sharia-court-uk-western-capital-islamic-council-rulings-divorce-marriage-national-secular-society-objection-2652954-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With 85 Sharia courts, UK becomes western capital for Islamic rulingsBritain is now home to 85 sharia courts that rule on family matters of marriage and divorce. With Muslims from North America and Europe coming to appeal to these Islamic councils, Britain is emerging as the \"western capital\" for sharia courts. Organisations are expressing concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kumar-vishwas-kumar-vishwas-on-sonakshi-sinha-kumar-vishwas-video-shatrugnan-sinha-sonakshi-sinhs-sonakshi-sinha-wife-2653863-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumar Vishwas invokes Ramayana in veiled dig at Shatrughan Sinha, stokes rowPoet Kumar Vishwas faced backlash for a veiled jibe at Shatrughan Sinha and Sonakshi Sinha over her interfaith marriage.  with Congress leaders condemning his remarks as \"cheap\" and \"lewd.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bashar-al-assad-wife-divorce-moscow-asylum-london-move-syrian-president-ousted-rebels-2653883-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bashar al-Assad's wife files for divorce, unhappy with life in Moscow: ReportDeposed Syrian President Bashar al-Assad's wife Asma al-Assad has expressed her dissatisfaction with her life in Moscow following her husband's ouster from power by rebels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sunny-leone-johnny-sins-mahatari-vandan-scheme-married-woman-chhattisgarh-fraud-case-2653907-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man registers Sunny Leone's name for Chhattisgarh scheme, gets Rs 1,000 monthlyA man fraudulently registered actor Sunny Leone as a beneficiary under a government scheme providing Rs 1,000 per month to economically weaker married women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gst-council-18-gst-caramelised-popcorn-tax-sparks-meme-fest-online-2653970-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18% GST on caramelised popcorn sparks meme fest online. Best ones hereSocial media memes flooded the internet after the GST Council confirmed that caramelised popcorn would attract an 18% tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-express-gujarat-to-thailand-flight-sees-high-demand-for-alcohol-2653917-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Flyers say booze ran out on debut Air India Surat-Bangkok flight, officials denyAir India's inaugural Surat-Bangkok flight saw good sales of liquor onboard, but some passengers claimed the stock ran out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-man-dies-accident-wife-preserve-sperm-plea-stumps-doctors-2653950-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Madhya Pradesh man dies in accident, wife's 'preserve sperm' plea stumps doctorsA grieving woman in Madhya Pradesh's Rewa requested her late husband's sperm preservation to conceive his child, but doctors denied it as over 24 hours had passed since his death. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-jumps-800-points-key-factors-behind-bull-run-2653942-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex jumps 800 points: 3 factors behind today's stock market rallyThe S&P BSE Sensex climbed 802.66 points to 78,844.25 by 11:06 am, while the NSE Nifty50 advanced 243 points to trade at 23,828.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/dune-prophecy-showrunner-tabu-emily-watson-2653935-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dune Prophecy's showrunner says Tabu was always on radar: I adore herShowrunner Alison Schapker of Dune: Prophecy said that Tabu was always on her radar. Actor Emily Watson discussed her inspiration for acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-4th-test-practice-pitches-melbourne-cricket-ground-controversy-2653908-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tired pitches for India, fresher ones for Australia: MCG practice row explainedAustralia vs India, 4th Test: After India trained on used pitches at the Melbourne Cricket Ground over the weekend, the home team got a spicier one during their first training session on Monday. Here's why the two teams were given pitches with different nature in the lead-up to the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/r-donald-trump-sriram-krishnan-indian-american-entrepreneur-senior-white-house-policy-advisor-artificial-intelligence-2653867-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian American entrepreneur is Trump's pick for senior policy advisor for AISriram Krishnan, an Indian-American entrepreneur who has held key roles in major tech giants, has been nominated by Donald Trump as the Senior White House Policy Advisor for Artificial Intelligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-elon-musk-us-president-rumours-doge-department-republican-2653861-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Elon Musk become US President? Trump says it's not happening, explains whyUS President-elect Donald Trump has recently tapped South African-born Elon Musk to lead the Department of Government Efficiency, aimed at slashing government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/car-ratings-are-crucial-but-always-follow-these-6-rules-to-be-safe-on-road-2653932-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Car ratings are crucial, but always follow these 6 rules to be safe on roadA high safety rating in a crash test does not make a car indestructible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-tania-sachdev-delhi-government-recognition-olympiad-2653941-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chess star Tania Sachdev calls out Delhi government for lack of support to sport Tania Sachdev claimed she has not been recognised by the Delhi government for her role in India's historic win in Budapest earlier this year. Tania was also part of the bronze medal-winning women's team at the 2022 Olympiad in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-police-malda-rescues-kidnapped-minor-girl-after-45-hour-operation-2653888-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Bengal Police rescued kidnapped girl, 7, in less than 5 hoursThe Bengal Police rescued a minor girl, who was kidnapped from outside her home in Malda after a four-and-a-half-hour operation. Two accused have been arrested in connection with the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/illuminati-dance-crew-performs-at-iit-bombay-tech-fest-viral-video-2653916-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video of Illuminati Dance Crew's performance at IIT Bombay's tech fest goes viralA video of a mesmerising dance performance by the Illuminati Dance Crew at IIT Bombay's 2024 tech fest has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-is-launching-a-robotic-arm-with-pslv-c60-spadex-in-space-heres-what-it-will-do-2653938-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro is launching a robotic arm with Spadex in spaceThe SpaDEX mission consists of two satellites, Chaser and Target, each weighing around 220 kg. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/monali-thakur-walks-out-of-concert-due-to-mismanagement-everything-was-a-mess-2653890-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Monali Thakur walks out of concert due to mismanagement: Everything was a messSinger Monali Thakur abruptly ended her concert in Varanasi on Sunday due to mismanagement. Apologising to her fans, she criticised the event organisers for failing to provide adequate facilities.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/avalanches-icy-explosions-shooting-geysers-new-year-begins-on-mars-2653972-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Year begins on Mars, but it's not as festive as EarthThe beginning of a new year is marked by the onset of spring in the northern hemisphere of the Red Planet, leading to an active and explosive thaw. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-mla-harish-shakya-case-gangrape-fraud-up-badaun-political-conspiracy-2653923-2024-12-23?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gangrape, fraud case against BJP MLA, 15 others, legislator calls it 'conspiracy'The case against BJP MLA Harish Shakya, his brother Satendra Shakya and nephew, and several business persons was filed on charges of gangrape, fraud worth crores of rupees and implicating a man in a false case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-shares-cute-glimpses-of-christmas-festivities-with-saif-and-kids-2653958-2024-12-23",
      "headline": "Kareena shares cute glimpses of Christmas festivities with Saif and sonsKareena Kapoor Khan is preparing for Christmas with her family and sharing delightful moments on Instagram. From glimpses of Saif taking a stroll to Taimur's fascination with the Christmas tree, Kapoor Khan's festive spirit is evident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/paatal-lok-season-2-jaideep-ahlawat-hathi-ram-january-2025-prime-video-2653973-2024-12-23",
      "headline": "Paatal Lok Season 2: Jaideep Ahlawat to return as Hathi Ram in January 2025The release date for Paatal Lok Season 2 is finally out. The Jaideep Ahlawat-starrer series will premiere on Prime Video on January 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/dune-prophecy-showrunner-tabu-emily-watson-2653935-2024-12-23",
      "headline": "Dune Prophecy's showrunner says Tabu was always on radar: I adore herShowrunner Alison Schapker of Dune: Prophecy said that Tabu was always on her radar. Actor Emily Watson discussed her inspiration for acting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/ap-dhillons-bold-statement-at-karan-aujlas-mumbai-concert-amid-feud-with-diljit-dosanjh-2653902-2024-12-23",
      "headline": "AP Dhillon joins Karan Aujla at his Mumbai show, says 'social media is corrupt' At Karan Aujla's Mumbai concert, AP Dhillon made headlines with a surprise appearance. He also drew attention by saying \"music isn't a sport,\" a statement made amid an ongoing online disagreement with Diljit Dosanjh."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pv-sindhu-wedding-photo-venkatta-datta-sai-udaipur-gajendra-singh-shekhawat-2653980-2024-12-23",
      "headline": "Photo: PV Sindhu ties the knot with fiance Venkatta Datta Sai in UdaipurBadminton icon PV Sindhu married Venkata Datta Sai in a grand Telugu ceremony in Udaipur, surrounded by loved ones. The couple tied the knot following traditional rituals, ahead of their Hyderabad reception on December 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-beau-webster-wants-to-counter-punch-india-2653975-2024-12-23",
      "headline": "6ft 5in tall Beau Webster wants to counter-punch India if given a chance in MCG6ft 5in tall Beau Webster wants to counter-attack India if he is given a debut in the Boxing Day Test match vs India. Webster, who is an able middle-order batter, wants to follow the path taken by Travis Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shooting-manu-bhaker-khel-ratna-award-nominees-2653963-2024-12-23",
      "headline": "Manu Bhaker, double Olympic medalist, not in Khel Ratna nominees list: SourcesManu Bhaker, who won two bronze medals in the Paris Olympics earlier this year, won't be getting the Khel Ratna award. Her father Ramkrishna Bhasker was disappointed after the committee did not recommend her name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-tania-sachdev-delhi-government-recognition-olympiad-2653941-2024-12-23",
      "headline": "Chess star Tania Sachdev calls out Delhi government for lack of support to sport Tania Sachdev claimed she has not been recognised by the Delhi government for her role in India's historic win in Budapest earlier this year. Tania was also part of the bronze medal-winning women's team at the 2022 Olympiad in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-jasprit-bumrah-sam-konstas-comment-mcg-test-2653929-2024-12-23",
      "headline": "Jasprit Bumrah best in the world, but I have my plans: Sam KonstasAustralia youngster Sam Konstas is set for his Test debut at the Boxing Day game. Konstas was asked about facing Jasprit Bumrah with the new ball, to which the batter replied that he had his own plans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-4th-test-practice-pitches-melbourne-cricket-ground-controversy-2653908-2024-12-23",
      "headline": "Tired pitches for India, fresher ones for Australia: MCG practice row explainedAustralia vs India, 4th Test: After India trained on used pitches at the Melbourne Cricket Ground over the weekend, the home team got a spicier one during their first training session on Monday. Here's why the two teams were given pitches with different nature in the lead-up to the Boxing Day Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-shubman-gill-major-technical-flaw-dinesh-karthik-bgt-2653898-2024-12-23",
      "headline": "Dinesh Karthik raises concern about Shubman Gill's major technical flawFormer India batter Dinesh Karthik believes that Shubman Gill has a major flaw in his technique. Gill has had a lean series so far, failing to register any fifties in his three innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-bgt-virat-kohli-ravindra-jadeja-media-controversy-mind-games-simon-katich-2653876-2024-12-23",
      "headline": "Kohli, Jadeja's media controversies are mind games: Simon KatichFormer Australia cricketer Simon Katich has termed Virat Kohli and Ravindra Jadeja's recent confrontations with journalists as mind games. Katich has claimed that India are trying to get an edge ahead of the MCG Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pak-vs-sa-pakistan-series-witewash-vs-south-africa-2653864-2024-12-23",
      "headline": "Historic Pakistan become 1st team to whitewash South Africa at homeSensational Saim Ayub helped Pakistan become the first team to whitewash South Africa at their own backyard in ODI bilaterals. Having won the first two matches of the series, Pakistan condemned South Africa to their third straight defeat at home on Sunday, December 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nathan-mcsweeney-marnus-labuschagne-aus-vs-ind-border-gavaskar-trophy-big-bash-league-2653839-2024-12-23",
      "headline": "Nathan McSweeney shares Labuschagne's motivational words after Melbourne Test snubYoung Australia batter Nathan McSweeney shared his teammate Marnus Labuschagne's comforting words after being dropped from the Test side for the last two games against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/romantic-proposal-and-baby-birth-at-wanderers-during-3rd-odi-between-sa-and-pak-2653837-2024-12-22",
      "headline": "Romantic proposal and baby birth at Wanderers during 3rd ODI between SA and PAKFrom a romantic proposal to the birth of a baby boy, the Wanderers Stadium witnessed it all during the 3rd ODI between South Africa and Pakistan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-shubman-gill-major-technical-flaw-dinesh-karthik-bgt-2653898-2024-12-23",
      "headline": "Dinesh Karthik raises concern about Shubman Gill's major technical flawFormer India batter Dinesh Karthik believes that Shubman Gill has a major flaw in his technique. Gill has had a lean series so far, failing to register any fifties in his three innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-4th-test-bgt-virat-kohli-ravindra-jadeja-media-controversy-mind-games-simon-katich-2653876-2024-12-23",
      "headline": "Kohli, Jadeja's media controversies are mind games: Simon KatichFormer Australia cricketer Simon Katich has termed Virat Kohli and Ravindra Jadeja's recent confrontations with journalists as mind games. Katich has claimed that India are trying to get an edge ahead of the MCG Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pak-vs-sa-pakistan-series-witewash-vs-south-africa-2653864-2024-12-23",
      "headline": "Historic Pakistan become 1st team to whitewash South Africa at homeSensational Saim Ayub helped Pakistan become the first team to whitewash South Africa at their own backyard in ODI bilaterals. Having won the first two matches of the series, Pakistan condemned South Africa to their third straight defeat at home on Sunday, December 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nathan-mcsweeney-marnus-labuschagne-aus-vs-ind-border-gavaskar-trophy-big-bash-league-2653839-2024-12-23",
      "headline": "Nathan McSweeney shares Labuschagne's motivational words after Melbourne Test snubYoung Australia batter Nathan McSweeney shared his teammate Marnus Labuschagne's comforting words after being dropped from the Test side for the last two games against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/romantic-proposal-and-baby-birth-at-wanderers-during-3rd-odi-between-sa-and-pak-2653837-2024-12-22",
      "headline": "Romantic proposal and baby birth at Wanderers during 3rd ODI between SA and PAKFrom a romantic proposal to the birth of a baby boy, the Wanderers Stadium witnessed it all during the 3rd ODI between South Africa and Pakistan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/parthiv-patel-on-indias-batting-collapses-aus-vs-ind-border-gavaskar-trophy-2024-25-2653835-2024-12-22",
      "headline": "Parthiv Patel offers solution to end India's frequent batting collapsesFormer India cricketer turned commentator Parthiv Patel has offered a solution to end India's frequent batting collapses in Test cricket in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chandrababu-naidus-grandson-devaansh-nara-bags-world-record-in-chess-2653829-2024-12-22",
      "headline": "Chandrababu Naidu's grandson Devaansh Nara bags world record in chess Nine-year-old Devaansh Nara, grandson of Chandrababu Naidu, set a world record for solving 175 chess puzzles the fastest. Recognized by the World Book of Records, London, his feat highlights India's rising talent in global chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-2025-dubai-neutral-venue-india-vs-pakistan-pcb-bcci-2653827-2024-12-22",
      "headline": "Champions Trophy 2025: Dubai to serve as neutral venue for India matchesIndia are set to play their matches in Dubai in the Champions Trophy 2025, a reliable source in the PCB (Pakistan Cricket Board) has confirmed the development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-pak-saim-ayub-joins-virat-kohli-in-elite-list-with-2nd-hundred-in-odi-series-2653822-2024-12-22",
      "headline": "Saim Ayub joins Virat Kohli in elite list with 2nd hundred in ODI seriesSaim Ayub scored his second hundred of the 3-match ODI series between South Africa and Pakistan. His 101-run knock powered Pakistan to 308/9 in 47 overs vs the Proteas in the 3rd ODI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-konstas-jasprit-bumrah-aus-vs-ind-boxing-day-test-border-gavaskar-trophy-2024-25-2653817-2024-12-22",
      "headline": "Excited to challenge myself and face Jasprit Bumrah: Sam KonstasYoung Australia batter Sam Konstas expressed his excitement on the prospect of facing young India speedster Jasprit Bumrah in the upcoming fourth Test against India in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohlis-intense-batting-practice-yashasvi-jaiswal-takes-guidance-ahead-of-boxing-day-test-2653803-2024-12-22",
      "headline": "Kohli's intense batting practice, Jaiswal takes guidance before Boxing Day Test Let us have a sneak-peak into India's training session ahead of the much-anticipated Boxing Day Test on December 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-and-babar-azam-comparisons-make-me-laugh-says-mohammad-amir-2653802-2024-12-22",
      "headline": "Virat Kohli and Babar Azam comparisons make me laugh: Mohammad AmirFormer Pakistan fast bowler Mohammad Amir has said that Virat Kohli's comparisons with Babar Azam or any other cricketer from the current generation makes him laugh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-renuka-singh-india-women-vs-west-indies-women-1st-odi-vadodra-smriti-mandhana-2653792-2024-12-22",
      "headline": "Renuka joins Jhulan Goswami in elite list with five wicket haul vs West IndiesIndia's right-arm seamer Renuka Singh became the fourth woman from the country to take a five-wicket haul in ODI cricket during the first match vs West Indies in Vadodra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sam-konstas-jasprit-bumrah-aus-vs-ind-boxing-day-test-border-gavaskar-trophy-2024-25-2653817-2024-12-22",
      "headline": "Excited to challenge myself and face Jasprit Bumrah: Sam KonstasYoung Australia batter Sam Konstas expressed his excitement on the prospect of facing young India speedster Jasprit Bumrah in the upcoming fourth Test against India in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohlis-intense-batting-practice-yashasvi-jaiswal-takes-guidance-ahead-of-boxing-day-test-2653803-2024-12-22",
      "headline": "Kohli's intense batting practice, Jaiswal takes guidance before Boxing Day Test Let us have a sneak-peak into India's training session ahead of the much-anticipated Boxing Day Test on December 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-and-babar-azam-comparisons-make-me-laugh-says-mohammad-amir-2653802-2024-12-22",
      "headline": "Virat Kohli and Babar Azam comparisons make me laugh: Mohammad AmirFormer Pakistan fast bowler Mohammad Amir has said that Virat Kohli's comparisons with Babar Azam or any other cricketer from the current generation makes him laugh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-renuka-singh-india-women-vs-west-indies-women-1st-odi-vadodra-smriti-mandhana-2653792-2024-12-22",
      "headline": "Renuka joins Jhulan Goswami in elite list with five wicket haul vs West IndiesIndia's right-arm seamer Renuka Singh became the fourth woman from the country to take a five-wicket haul in ODI cricket during the first match vs West Indies in Vadodra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/indw-vs-wiw-smriti-mandhana-renuka-power-india-to-biggest-odi-win-at-home-2653794-2024-12-22",
      "headline": "INDW vs WIW: Smriti Mandhana, Renuka power India to biggest ODI win at homeThe Indian team registered a record-shattering 211-run victory over the West Indies in the 1st women's ODI contest in Vadodra. The Indian women's team registered their overall 2nd biggest win in the 50-over format contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/are-we-in-delhi-or-mcg-usman-khawaja-on-massive-support-for-india-on-boxing-day-2653788-2024-12-22",
      "headline": "Are we in Delhi or MCG? Usman Khawaja on massive support for India on Boxing DayThe MCG is set for an electrifying Boxing Day Test, but with Indian fans expected to dominate the stands, Usman Khawaja's humorous question lingers: 'Are we in Delhi or MCG?' The stage is set for cricketing fireworks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-women-vs-west-indies-women-pratika-rawal-debut-world-cup-2653783-2024-12-22",
      "headline": "2 months, 6 ODI debuts: India continue experimenting with eyes on World CupINDW vs WIW: India have gone into an experimentation mode since crashing out of the Women's T20 World Cup back in October. Seven players have made debuts for them in international cricket, six of them are in ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/flying-harmanpreet-kaur-takes-stunning-one-handed-catch-in-1st-odi-ind-w-vs-wi-w-2653781-2024-12-22",
      "headline": "Watch: Flying Harmanpreet Kaur takes stunning one-handed catch in 1st ODIHarmanpreet Kaur picked a stunning one-handed catch in the 1st ODI between India and West Indies women. Her screamer of a catch left the crowd and her team in awe of the captain. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}