{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salaries-may-not-last-forever-zoho-ceo-sridhar-vembu-warns-software-engineers-2726990-2025-05-19",
      "headline": "'High salaries may not last forever': Zoho's Sridhar Vembu warns software engineersSridhar Vembu explained that the upcoming changes in software development, especially with large language models (LLMs) and new tools powered by artificial intelligence (AI), might lead to many software jobs being lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-fall-drop-10-percent-why-reason-supreme-court-hearing-agr-dues-plea-rejected-2726952-2025-05-19",
      "headline": "Vodafone Idea shares drop 10%. Here's whyVodafone Idea share price: Over the last month, Vodafone Idea's stock has gone down by 16.73%. In the last year, it has fallen over 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-dismisses-vodafone-idea-airtel-plea-on-agr-interest-dues-2726933-2025-05-19",
      "headline": "Supreme Court dismisses Vodafone Idea, Airtel plea on AGR interest duesThe court dismissed the writ petitions filed by the telecom operators, calling the move \"shocking\" and stating that the petitions were \"misconceived.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/brent-crude-oil-price-usd-65-stocks-that-may-benefit-investors-share-market-2726911-2025-05-19",
      "headline": "Brent crude slips below $65: These stocks may benefit investorsBrent futures for July delivery were trading at $64.98 a barrel, down 0.66%. This is a steep fall from January, when prices were above $80 a barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/once-earning-rs-128-crore-metaverse-engineer-now-sidelined-by-ai-and-delivering-food-2726903-2025-05-19",
      "headline": "Once earning Rs 1.28 crore, metaverse engineer now sidelined by AI and delivering foodShawn Kay has worked in tech for 20 years. He was involved in virtual reality, web development and artificial intelligence. But after being laid off in April last year, things took a turn for the worse. The metaverse boom faded and jobs in that space dried up, especially with the sudden rise of AI tools like ChatGPT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dreaming-of-a-job-abroad-these-are-the-easiest-countries-to-get-a-work-visa-2726861-2025-05-19",
      "headline": "Dreaming of a job abroad? These are the easiest countries to get a work visaLatvia is the easiest country to get a skilled worker visa. It scored 7.64 out of 10 for ease of entry. The visa itself costs around 83 pounds and typically gets approved in ten working days, according to a study conducted by Remitly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-crash-protean-egov-technologies-why-reason-income-tax-department-tech-revamp-project-2726833-2025-05-19",
      "headline": "Explained: Why did Protean shares crash 20% todayProtean eGov Technologies, earlier known as NSDL e-Governance Infrastructure, provides technology solutions for various citizen-focused services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-turkey-relation-celebi-loss-usd-200-million-airport-operation-hit-market-cap-job-loss-2726820-2025-05-19",
      "headline": "India ousts Turkey's Celebi: $200 million lost in market-cap, jobs on the lineThe company, listed on the Istanbul Stock Exchange, saw its shares drop 20% in just two trading sessions. On 16 May, the stock fell 222 points to close at 2,002 lira. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-50-points-lower-nifty-above-25000-it-stocks-down-in-early-trade-2726798-2025-05-19",
      "headline": "Sensex opens 50 points lower, Nifty above 25,000; IT stocks down in early tradeThe S&P BSE Sensex was up 36.40 points to 82,366.99, while the NSE Nifty50 lost 5.65 points to 25,014.15 as of 9:26 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kunal-kohli-calls-mission-impossible-8-yawn-fest-messed-up-greatest-franchises-ever-2726936-2025-05-19",
      "headline": "Mission Impossible 8 is yawn fest, messes up great franchise: Kunal KohliFilmmaker Kunal Kohli recently reviewed Tom Cruise's Mission Impossible:8. While expressing his disappointment with the new sequel, he called it a 'yawn fest'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/masterchef-australia-depinder-raj-kachori-indian-street-food-impresses-judges-2726960-2025-05-19",
      "headline": "Indian-origin contestant's Raj Kachori impresses MasterChef Australia judgesChef Depinder Chhibber impressed MasterChef Australia judges with her Raj Kachori dish. The dish evoked strong emotions and highlighted rich Indian street food culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/how-actor-sumanth-from-akkineni-family-carved-his-niche-in-telugu-films-2726910-2025-05-19",
      "headline": "How actor Sumanth from Akkineni family carved his niche in Telugu filmsWhile most actors from legacy families chase mass appeal, Sumanth, who belongs to the Akkineni clan, has quietly carved a niche for himself with grounded performances and understated classics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-46-begins-with-director-venky-atluri-actor-mamitha-baiju-pics-2726926-2025-05-19",
      "headline": "Suriya 46 begins with director Venky Atluri, actor Mamitha Baiju. PicsActor Suriya's next film, 'Suriya 46' with Venky Atluri has officially been launched with a puja ceremony. Telugu director Trivikram was present as a guest at the ceremony along with Suriya, Venky, Mamitha Baiju, Naga Vamsi and GV Prakash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-skips-guns-n-roses-shares-jam-session-with-saif-and-taimur-2726948-2025-05-19",
      "headline": "Kareena Kapoor skips Guns N' Roses concert, jams with Saif and Taimur insteadKareena Kapoor Khan skipped the much-anticipated Guns N' Roses concert in Mumbai to enjoy a heartwarming guitar jam session at home with husband Saif Ali Khan and son Taimur. Sharing the moment on Instagram, she proudly called them her \"own band.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-and-the-weeknd-at-mission-impossible-the-final-reckoning-premiere-at-new-york-share-hug-2726826-2025-05-19",
      "headline": "Tom Cruise hugs singer The Weeknd at MI: 8 premiere, fans call it unreal crossoverHollywood actor Tom Cruise and Canadian singer and songwriter, The Weeknd hugged at the Mission: Impossible – Final Reckoning premiere in New York. Fans recalled Tom Cruise's iconic lip-sync battle from 'The Tonight Show', performing The Weeknd's 'Can't Feel My Face'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-no-muscle-flexing-approach-that-worked-shivam-nair-2726883-2025-05-19",
      "headline": "John Abraham's The Diplomat, and the 'no muscle-flexing' approach that workedJohn Abraham's 'The Diplomat' is anchored in realism and driven by restraint. The movie brings to life the remarkable true story of Uzma Ahmed and the quiet, calculated world of diplomacy that ultimately saved her. Read to know how the espionage drama delves into the behind-the-scenes operations of international diplomacy, where power moves quietly. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-challenges-kumbh-shoot-for-hollywood-debut-lost-and-found-in-kumbh-exclusive-2726881-2025-05-19",
      "headline": "Exclusive: Rahul Bhat on challenges of shooting at Kumbh for his Hollywood debutRahul Bhat unveiled the first look of his Hollywood debut film 'Lost and Found in Kumbh' at Cannes Film Festival 2025. In an exclusive interview, Bhat spoke about the light-hearted comedy is set against the backdrop of the Kumbh Mela and promises a unique blend of Indian culture and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-eyes-top-gun-3-days-of-thunder-2-thinking-many-different-stories-2726877-2025-05-19",
      "headline": "Tom Cruise eyes Top Gun, Days of Thunder sequels: Thinking many different storiesActor Tom Cruise hinted at potential sequels to 'Top Gun: Maverick' and 'Days of Thunder' sequels. In an interview for the film, he said he is currently discussing 'many different stories'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-set-mumbai-ablaze-with-a-nostalgic-no-holds-barred-rock-spectacle-2726898-2025-05-19",
      "headline": "Guns N' Roses set Mumbai ablaze with a nostalgic, no-holds-barred rock spectacleAfter a 13-year hiatus, Guns N' Roses delivered a powerful and memorable concert in Mumbai, winning hearts with their classic hits. The band's energetic performance and crowd interaction made it a night to remember for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-americans-have-no-idea-about-kashmir-india-pakistan-conflict-2726884-2025-05-19",
      "headline": "Americans have no idea about Kashmir, India-Pakistan conflict: Vivek AgnihotriFilmmaker Vivek Agnihotri, in an exclusive interview with India Today, spoke about the West's perception of the India-Pakistan conflict, and the Kashmir issue. He said we need to make more films about the Valley the way the US made on the Holocaust. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-makes-it-to-forbes-30-list-rumoured-partner-walker-blanco-reacts-2726867-2025-05-19",
      "headline": "Ananya Panday makes it to Forbes 30 list, rumoured partner Walker Blanco reactsAnanya Panday has been named in the Forbes' 30 Under 30 Asia list for 2025. Her rumoured partner, Walker Blanco, celebrated the achievement with a supportive note on Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-daughter-nurvi-amitabh-bachchan-fan-arts-passion-2726864-2025-05-19",
      "headline": "Neil Nitin Mukesh on daughter Nurvi's love for arts and Big B's filmsActor Neil Nitin Mukesh reveals his six-year-old daughter Nurvi's growing passion for the arts and admiration for Amitabh Bachchan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-vedan-kerala-concert-crowd-mismanagement-no-major-injuries-2726851-2025-05-19",
      "headline": "Rapper Vedan's Kerala concert ends early due to crowd mismanagementKerala rapper Vedan's concert in Palakkad faced chaos due to overwhelming crowd turnout. Police intervened with lathi charge but confirmed no major injuries at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhay-deol-turns-dj-at-gurugram-nightclub-fans-call-him-ord-dj-bobby-student-2726845-2025-05-19",
      "headline": "Abhay Deol turns DJ at Gurugram nightclub, fans call him 'lord Bobby's student'Actor Abhay Deol took over the DJ console at a nightclub in Gurugram. A video of his set has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ravi-kishan-warning-to-pakistan-against-terrorist-activity-will-get-a-befitting-reply-2726832-2025-05-19",
      "headline": "Will get fitting reply: Ravi Kishan's warning to Pak against 'terrorist activity'Actor and BJP MP Ravi Kishan talked about India's Operation Sindoor against Pakistan-backed terrorism, and highlighted that we will give a 'fitting reply' to our neighbour if they 'provoke' us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-recreates-mother-raveena-tandon-iconic-tip-tip-barsa-paani-steps-watch-award-show-2726819-2025-05-19",
      "headline": "Rasha Thadani recreates mother Raveena's iconic Tip Tip Barsa Paani at event. WatchActor Rasha Thadani stole attention after she recreated her mother Raveena Tandon's iconic hit 'Tip Tip Barsa' from 'Mohra' at an award show. The video of her performance has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keneeshaa-cryptic-post-ravi-mohan-aarti-divorce-2726816-2025-05-19",
      "headline": "New beginnings: Singer Keneeshaa's cryptic post amid actor Ravi Mohan's divorceSinger Keneeshaa shared a poetry about 'noise' and 'new beginnings' on her Instagram page. This post comes days after actor Ravi Mohan called her companion in four-page note against his ex-wife Aarti amid divorce battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-fame-achint-kaur-asks-for-work-says-actor-life-has-peaks-and-pauses-2726815-2025-05-19",
      "headline": "Kyunki... fame Achint Kaur asks for work, says actor's life has peaks and pausesAchint Kaur, known for playing Mandira in 'Kyunki Saas Bhi Kabhi Bahu Thi', posted a video asking for suitable work opportunities as an actor and voice-artiste. She also mentioned that her profession has its highs and lows. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sindoor-ka-saudagar-congress-steps-up-attack-on-s-jaishankar-despite-fact-check-operation-sindoor-2726967-2025-05-19",
      "headline": "Sindoor ka saudagar: Congress steps up attack on S Jaishankar despite fact-checkRahul Gandhi once again reiterated his claims that India maintained silence over the loss of assets during Operation Sindoor, calling it a 'crime' to have informed Pakistan beforehand, while citing remarks made by S Jaishankar. Following his tweet, Congress leader Pawan Khera called BJP 'Sindoor ka saudagar' while playing Jaishankar's video byte."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/crocodile-tears-top-court-orders-special-probe-into-minister-vijay-shahs-remarks-against-col-sofiya-qureshi-2726922-2025-05-19",
      "headline": "Top court rejects Minister's apology for Col Sofiya Qureshi remarks, orders probeThe Supreme Court on Monday constituted a Special Investigation Team of three IPS officers to investigate the FIR filed against Madhya Pradesh Minister Vijay Shah for his communal and offensive remarks against Army officer Colonel Sofiya Qureshi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-operation-sindoor-attack-jammu-border-pahalgam-terrorist-post-2726795-2025-05-19",
      "headline": "A Bajrang Bali war cry and payback: How Rajput Regiment soldiers destroyed Pak postsIndia Today spoke to the Indian Army bravehearts stationed along the International Border in Jammu, who swiftly and resolutely countered Pakistan's attacks, inflicting heavy casualties and destroying enemy posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/joe-biden-advanced-prostate-cancer-diagnosis-expert-debate-rapid-progression-screening-2726857-2025-05-19",
      "headline": "After Biden's prostate cancer diagnosis, questions about timeline, transparencyFormer US President Joe Biden has been diagnosed with advanced prostate cancer that has spread to his bones. Experts and doctors are debating how quickly the cancer could have progressed without earlier detection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-assembly-election-2025-prashant-kishor-jan-suraaj-merge-rcp-singh-asap-bihar-cm-nitish-kumar-cold-sweat-2726925-2025-05-19",
      "headline": "PK joins hands with former rival, gives Nitish Kumar jittersTwo of Bihar CM Nitish Kumar's former aides -- Prashant Kishor and RCP Singh -- who had turned rivals, have now joined hands and are turning up the heat in the JD(U)'s backyard. With Singh merging his Aap Sabki Awaaz Party with PK's Jan Suraaj, they could shake up Kumar's core vote base and pile up pressure on Nitish's turf, Nalanda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-spy-network-busted-in-haryanas-nuh-second-arrest-in-2-days-2726880-2025-05-19",
      "headline": "Pakistani 'spy' network busted in Haryana's Nuh, second arrest in 2 daysA Haryana man was arrested as the police busted a Pakistani spy network, marking the second arrest in two days in Haryana's Nuh, amid a spate of recent anti-espionage operations.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allahabad-high-court-upholds-sambhal-survey-order-rejects-mosque-committees-plea-2726980-2025-05-19",
      "headline": "Allahabad High Court upholds Sambhal survey order, rejects mosque panel's pleaThe Allahabad High Court upheld the survey order of the Shahi Jama Masjid in Sambhal, dismissing the Mosque Committee's plea, paving the way for the case to proceed in the district court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-targeted-amritsar-on-may-8-how-indias-air-defence-saved-golden-temple-2726817-2025-05-19",
      "headline": "Pakistan targeted Amritsar on May 8. How India's air defence saved Golden TemplePakistan engaged in an air assault with aerial weapons, including drones and long-range missiles, targeting the Golden Temple, which was \"thwarted\" by the army personnel, who remained prepared for such situations and attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-professor-in-uk-loses-oci-status-anti-india-activities-nitasha-kaul-university-of-westminster-2726943-2025-05-19",
      "headline": "Indian-origin professor in UK loses OCI status over anti-India activitiesThe OCI status of UK-based Indian-origin academician Nitasha Kaul has been cancelled over \"anti-India activities\", driven by \"malice and complete disregard for facts or history\". The government notice was shared by Kaul, who was deported from Bengaluru airport last year within hours of her landing in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/was-on-leave-ola-on-bengaluru-techies-suicide-due-to-alleged-work-pressure-2726889-2025-05-19",
      "headline": "Was on leave: Ola Krutrim on Bengaluru techie's 'suicide' due to work pressureKrutrim, an artificial intelligence unit of Ola, came under fire after a social media post claimed that its employee died by suicide due to toxic work culture and pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/masterchef-australia-depinder-raj-kachori-indian-street-food-impresses-judges-2726960-2025-05-19",
      "headline": "Indian-origin contestant's Raj Kachori impresses MasterChef Australia judgesChef Depinder Chhibber impressed MasterChef Australia judges with her Raj Kachori dish. The dish evoked strong emotions and highlighted rich Indian street food culture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/puducherry/story/us-based-eye-doctor-stopped-from-boarding-at-puducherry-airport-for-carrying-satellite-phone-2726912-2025-05-19",
      "headline": "US doctor stopped from boarding at Puducherry airport for carrying satellite phoneA 32-year-old US-based ophthalmologist was stopped from boarding at the Puducherry airport for carrying a satellite phone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/rohit-joy-texas-republican-party-us-termination-call-for-h-1b-visas-donald-trump-clamp-down-immigration-2726892-2025-05-19",
      "headline": "Scrap H-1B visas, deport holders, says Indian-origin politician, faces backlashRohit Joy, an Indian-origin Republican from Texas, sought the termination of the H-1B visa programme and deportation of its holders. Joy's remarks, which clashed with fellow Republican Rich McCormick's push for the domestic renewal of H-1b visas, earned him massive blowback. People were quick to remind him of his immigrant background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-world-is-full-of-idiots-grok-is-this-true-2726872-2025-05-19",
      "headline": "The world is full of idiots, @grok is this true?What does a world where people have outsourced their thinking to AI look like? It looks like the one where everyone is groking all the time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/hyundai-i20-gets-new-magna-executive-variant-priced-at-rs-750900-2726974-2025-05-19",
      "headline": "Hyundai i20 gets new Magna Executive variant, priced at Rs 7,50,900The Hyundai i20 rivals the likes of the Maruti Suzuki Baleno, Tata Altroz and Toyota Glanza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-reacts-after-his-mother-shares-results-of-his-1989-computer-aptitude-test-2726850-2025-05-19",
      "headline": "Elon Musk reacts after his mother shares results of his 1989 computer aptitude testThe document, dated May 17, 1989, was issued by the University of Pretoria, where Elon Musk studied for a short period before moving to Canada at the age of 17."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-arrests-former-uco-bank-chairman-subodh-goel-in-connection-with-fraud-case-2726866-2025-05-19",
      "headline": "ED arrests UCO Bank ex-chairman Subodh Goel in Rs 6,210 crore fraud caseThe ED arrested former UCO Bank chairman Subodh Kumar Goel in a Rs 6,210 crore bank fraud case linked to Concast Steel and Power Limited.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-takes-up-ashoka-university-professors-plea-against-arrest-for-op-sindoor-post-hearing-tomorrow-2726846-2025-05-19",
      "headline": "Top court to hear plea of professor arrested over Op Sindoor post tomorrowAppearing on behalf of Ashoka University professor, Ali Khan Mahmudabad, senior advocate Kapil Sibal said that the professor was arrested for an 'entirely patriotic statement on Operation Sindoor.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-no-muscle-flexing-approach-that-worked-shivam-nair-2726883-2025-05-19",
      "headline": "John Abraham's The Diplomat, and the 'no muscle-flexing' approach that workedJohn Abraham's 'The Diplomat' is anchored in realism and driven by restraint. The movie brings to life the remarkable true story of Uzma Ahmed and the quiet, calculated world of diplomacy that ultimately saved her. Read to know how the espionage drama delves into the behind-the-scenes operations of international diplomacy, where power moves quietly. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arrested-youtuber-jyoti-malhotras-instagram-account-suspended-over-alleged-pak-link-2726865-2025-05-19",
      "headline": "Arrested YouTuber Jyoti Malhotra's Instagram suspended over alleged Pak linkTwo days after Haryana-based travel vlogger Jyoti Malhotra was arrested for allegedly sharing critical intel with Pakistani operatives and spying for them, her Instagram account has been blocked today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bcci-withdraws-asia-cup-2025-tensions-pakistan-sources-2726836-2025-05-19",
      "headline": "India won't play or host Asia Cup 2025 amid Pakistan tensions: SourcesIndia has decided not to play or host the Asia Cup this year amidst tensions with Pakistan, sources told India Today on Monday, May 19. The Women's Emerging Teams Asia Cup, which was slated to be held in June, has reportedly been cancelled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-outreach-foreign-tour-yusuf-pathan-trinamool-congress-all-party-delegation-2726812-2025-05-19",
      "headline": "Trinamool's Yusuf Pathan snubs government's Op Sindoor delegation inviteTrinamool Congress MP Yusuf Pathan has declined to join the Operation Sindoor foreign outreach delegation, after the government named him allegedly without consulting his party."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-tom-moody-collective-performance-playoffs-hopes-2727004-2025-05-19",
      "headline": "LSG require collective performance to keep playoff hopes alive: Tom MoodyTom Moody believes Lucknow Super Giants had to deliver as a unit in their crucial game against Sunrisers Hyderabad. With playoff hopes fading, he stressed that only a strong collective effort could keep them alive in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-will-do-wonders-for-england-cricket-adil-rashid-2726993-2025-05-19",
      "headline": "Harry Brook will do wonders for England cricket: Rashid backs young English captainEngland spinner, Adil Rashid, has expressed his support for new captain Harry Brook ahead of his first series in charge against the West Indies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-angry-aakash-chopra-2726981-2025-05-19",
      "headline": "Frustrated Rishabh Pant isn't the captain that LSG will want: Aakash ChopraAakash Chopra said that a frustrated and angry Rishabh Pant isn't something that LSG wants as they enter a crucial period in the play-off race. LSG need to win all their remaining matches to stand a chance of making it to the play-offs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-parents-pok-india-vs-pakistan-operation-sindoor-2726951-2025-05-19",
      "headline": "Moeen Ali reveals his parents were in PoK during India-Pakistan conflictFormer England all-rounder Moeen Ali has revealed that his parents were stranded in Pakistan-Occupied Kashmir (PoK) while he was in India earlier this month during a period of rising military tensions with Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-daniel-vettori-no-break-excuse-2726935-2025-05-19",
      "headline": "SRH won't use break as excuse ahead of LSG clash: Coach Daniel VettoriSunrisers Hyderabad head coach Daniel Vettori made it clear that the team won't use their extended break as an excuse ahead of their clash against Lucknow Super Giants on May 19. While both teams return after the break, SRH will play for pride, and LSG will fight to keep their fading playoff hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/javelin-neeraj-chopra-90-metre-barrier-gagan-narang-2726934-2025-05-19",
      "headline": "Neeraj Chopra is free to push his limits after breaching 90m mark: Gagan NarangGagan Narang feels that Neeraj Chopra is now free to push his limits after breaking the 90-metre barrier during the Doha Diamond League on May 16. Neeraj finished second at the Diamond League in Doha but was finally able to get the monkey off his back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-lungi-ngidi-replacement-blessing-muzurabani-playoffs-2726908-2025-05-19",
      "headline": "IPL 2025: RCB replace Lungi Ngidi with Zimbabwe pacer ahead of playoffsRCB have replaced Lungi Ngidi with Zimbabwe pacer Blessing Muzurabani ahead of the IPL 2025 play-offs on Monday, May 19. The replacement will come into effect on May 26 when Ngidi will leave to join the South Africa squad for the WTC final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-quits-alcohol-injury-rehabilitation-fitness-india-test-series-ashes-2726901-2025-05-19",
      "headline": "Ben Stokes quits alcohol during injury rehab to stay fit for India seriesBen Stokes revealed he quit alcohol in January to speed up his recovery from a hamstring injury. With major series against India and Australia looming, the England captain made fitness his top priority during rehabilitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-preview-team-news-lucknow-pitch-weather-rishabh-pant-pat-cummins-2726887-2025-05-19",
      "headline": "LSG vs SRH: Lucknow look to keep faint playoff hopes alive against HyderabadLucknow Super Giants aim to keep their faint play-off hopes alive against Sunrisers Hyderabad, who look to avoid the wooden spoon in IPL 2025. Both teams will miss a few key players in the contest at the Ekana stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-focussed-to-win-last-3-games-says-william-orourke-2726719-2025-05-19",
      "headline": "LSG focussed to win last 3 games and somehow sneak into playoffs: William O'RourkeLucknow Super Giants (LSG) are focussing on winning their last three league fixtures and qualifying for the play-offs of the Indian Premier League 2025 (IPL 2025), revealed fast bowler William O'Rourke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-ms-dhoni-reference-aashis-kapoor-assistant-coach-2726855-2025-05-19",
      "headline": "GT assistant coach backs Shubman Gill's captaincy with MS Dhoni referenceGT assistant coach Aashish Kapoor backed Shubman Gill's calm, strategic leadership during IPL 2025, drawing parallels with MS Dhoni as speculation grows around Gill becoming India's next Test captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-lungi-ngidi-replacement-blessing-muzurabani-playoffs-2726908-2025-05-19",
      "headline": "IPL 2025: RCB replace Lungi Ngidi with Zimbabwe pacer ahead of playoffsRCB have replaced Lungi Ngidi with Zimbabwe pacer Blessing Muzurabani ahead of the IPL 2025 play-offs on Monday, May 19. The replacement will come into effect on May 26 when Ngidi will leave to join the South Africa squad for the WTC final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-quits-alcohol-injury-rehabilitation-fitness-india-test-series-ashes-2726901-2025-05-19",
      "headline": "Ben Stokes quits alcohol during injury rehab to stay fit for India seriesBen Stokes revealed he quit alcohol in January to speed up his recovery from a hamstring injury. With major series against India and Australia looming, the England captain made fitness his top priority during rehabilitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-preview-team-news-lucknow-pitch-weather-rishabh-pant-pat-cummins-2726887-2025-05-19",
      "headline": "LSG vs SRH: Lucknow look to keep faint playoff hopes alive against HyderabadLucknow Super Giants aim to keep their faint play-off hopes alive against Sunrisers Hyderabad, who look to avoid the wooden spoon in IPL 2025. Both teams will miss a few key players in the contest at the Ekana stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-focussed-to-win-last-3-games-says-william-orourke-2726719-2025-05-19",
      "headline": "LSG focussed to win last 3 games and somehow sneak into playoffs: William O'RourkeLucknow Super Giants (LSG) are focussing on winning their last three league fixtures and qualifying for the play-offs of the Indian Premier League 2025 (IPL 2025), revealed fast bowler William O'Rourke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-captaincy-ms-dhoni-reference-aashis-kapoor-assistant-coach-2726855-2025-05-19",
      "headline": "GT assistant coach backs Shubman Gill's captaincy with MS Dhoni referenceGT assistant coach Aashish Kapoor backed Shubman Gill's calm, strategic leadership during IPL 2025, drawing parallels with MS Dhoni as speculation grows around Gill becoming India's next Test captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-abishek-porel-playoff-qualification-press-conference-delhi-2726849-2025-05-19",
      "headline": "IPL 2025: DC's Abishek Porel upbeat about playoff qualification despite GT lossDC's Abishek Porel is upbeat about the play-off qualification despite their loss to GT on Sunday. Delhi need to win their remaining two games to stand a chance of making it to the play-offs this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bcci-withdraws-asia-cup-2025-tensions-pakistan-sources-2726836-2025-05-19",
      "headline": "India won't play or host Asia Cup 2025 amid Pakistan tensions: SourcesIndia has decided not to play or host the Asia Cup this year amidst tensions with Pakistan, sources told India Today on Monday, May 19. The Women's Emerging Teams Asia Cup, which was slated to be held in June, has reportedly been cancelled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-true-leader-sai-sudharsan-shine-sunil-gavaskar-dc-vs-gt-2726800-2025-05-19",
      "headline": "Shubman Gill a true leader, he's happy to let Sai Sudharsan shine: Sunil GavaskarIPL 2025, DC vs GT: Batting great Sunil Gavaskar lauded the hugely-successful partnership between Shubman Gill and Sai Sudharsan. The duo added 205 runs for the opening partnership as Gujarat hammered Delhi by 10 wickets on Sunday to secure their spot in the playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-max-vertsappen-emilia-romagna-grand-prix-win-unexpected-2726785-2025-05-19",
      "headline": "Max Verstappen admits his Imola win surprised him: Didn't think I'd winFormula 1: Max Verstappen turned a weekend of doubt into triumph at Imola, securing Red Bull's milestone 400th race victory and tightening the title race with a win he hadn't expected to even compete for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-brother-formula-1-joke-misses-italian-open-final-vs-carlos-alcaraz-2726765-2025-05-19",
      "headline": "Sinner jokes brother chose Formula 1 over watching his final vs AlcarazDespite losing the Italian Open final, Jannik Sinner kept spirits high with a cheeky remark about his brother missing the match for Formula 1, while Carlos Alcaraz claimed his first Rome title and continued his clay dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-pbks-rahul-dravid-defends-dhruv-jurel-clode-defeat-2726763-2025-05-19",
      "headline": "Rahul Dravid defends Dhruv Jurel after yet another close defeat in IPL 2025Rajasthan Royals' head coach Rahul Dravid came to the defence of young players like Dhruv Jurel after another failed run chase dented their IPL 2025 campaign. Dravid blamed both finishing issues and bowling lapses, while urging patience with the team's young Indian core."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-sai-sudharsan-ipl-partnership-gujarat-playoffs-2726745-2025-05-19",
      "headline": "How Gill and Sudharsan built one of IPL's most prolific partnershipsShubman Gill and Sai Sudharsan have formed one of IPL's most prolific opening partnerships. Their trust and low-risk style have propelled Gujarat to the IPL playoffs and set new partnership records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-qualification-race-explained-mi-lsg-dc-2726743-2025-05-19",
      "headline": "One spot, three teams: Battle for IPL playoffs explainedPL 2025: Three teams - Gujarat, Punjab and Bengaluru - confirmed their spots in the playoffs on Sunday. With just one place up for grabs, three teams - Mumbai, Lucknow and Delhi - remain in the race"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-brother-formula-1-joke-misses-italian-open-final-vs-carlos-alcaraz-2726765-2025-05-19",
      "headline": "Sinner jokes brother chose Formula 1 over watching his final vs AlcarazDespite losing the Italian Open final, Jannik Sinner kept spirits high with a cheeky remark about his brother missing the match for Formula 1, while Carlos Alcaraz claimed his first Rome title and continued his clay dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-pbks-rahul-dravid-defends-dhruv-jurel-clode-defeat-2726763-2025-05-19",
      "headline": "Rahul Dravid defends Dhruv Jurel after yet another close defeat in IPL 2025Rajasthan Royals' head coach Rahul Dravid came to the defence of young players like Dhruv Jurel after another failed run chase dented their IPL 2025 campaign. Dravid blamed both finishing issues and bowling lapses, while urging patience with the team's young Indian core."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-sai-sudharsan-ipl-partnership-gujarat-playoffs-2726745-2025-05-19",
      "headline": "How Gill and Sudharsan built one of IPL's most prolific partnershipsShubman Gill and Sai Sudharsan have formed one of IPL's most prolific opening partnerships. Their trust and low-risk style have propelled Gujarat to the IPL playoffs and set new partnership records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-qualification-race-explained-mi-lsg-dc-2726743-2025-05-19",
      "headline": "One spot, three teams: Battle for IPL playoffs explainedPL 2025: Three teams - Gujarat, Punjab and Bengaluru - confirmed their spots in the playoffs on Sunday. With just one place up for grabs, three teams - Mumbai, Lucknow and Delhi - remain in the race"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/captain-shubman-gill-delighted-to-evolve-as-gujarat-titans-storm-into-playoffs-2726739-2025-05-19",
      "headline": "Captain Shubman Gill delighted to evolve as Gujarat Titans storm into playoffsShubman Gill said that he's delighted to evolve from his learning curve as captain, as Gujarat Titans qualified for the playoffs of the Indian Premier League 2025 (IPL 2025), following a comprehensive 10-wicket win over Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/italian-open-carlos-alcaraz-vs-jannik-sinner-final-roland-garros-2726736-2025-05-18",
      "headline": "Carlos Alcaraz spoils Sinner's Rome party, asserts Roland Garros favourite statusItalian Open 2025: Carlos Alcaraz reaffirmed his status as the favourite to defend his French Open crown by hammering World No. 1 Jannik Sinner in straight sets in the final in Rome on Sunday. The defeat ended Sinner's unbeaten run in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-ipl-playoffs-qualify-3-different-teams-2726733-2025-05-18",
      "headline": "Shreyas Iyer becomes 1st captain to lead 3 different teams to IPL playoffsPunjab Kings have qualified for the IPL 2025 playoffs for the first time since 2014. Shreyas Iyer became the first captain to lead three different franchises into the IPL playoffs, marking a unique achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-qualify-playoffs-sudharsan-shubman-gill-kl-rahul-2726730-2025-05-18",
      "headline": "Sai Sudharsan 108 trumps KL Rahul's 112 as GT storm into playoffsGujarat Titans secured a spot in the IPL 2025 playoffs after a commanding 10-wicket win against Delhi Capitals. Their strategic batting and top performances from Sudharsan and Shubman Gill highlighted the team's strong title ambitions this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-kuldeep-yadav-umpire-argument-penalty-2726731-2025-05-18",
      "headline": "DC vs GT: Kuldeep Yadav risks sanction after snapping at umpire over LBW callIPL 2025, DC vs GT: Kuldeep Yadav lost his cool after his LBW appeal against Sai Sudharsan was overturned. Gujarat Titans dominated the Capitals in a high-stakes match on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-take-rcb-and-pbks-into-playoffs-2726729-2025-05-18",
      "headline": "1 Game, 3 Winners: Gujarat, Punjab, and Bengaluru qualify for IPL 2025 playoffsGujarat Titans took RCB and PBKS into playoffs of the Indian Premier League 2025 (IPL 2025) with a comprehensive 10-wicket win over Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-borrows-mohammad-rizwans-iconic-win-learn-line-after-expensive-spell-2726724-2025-05-18",
      "headline": "Arshdeep borrows Mohammad Rizwan's iconic 'win, learn' line after expensive spellPunjab Kings' seamer Arshdeep Singh recalled Pakistan's Mohammed Rizwan's iconic line following his expensive spell against Rajasthan Royals (RR) in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-wins-imola-grand-prix-bold-overtake-oscar-piastri-2726723-2025-05-18",
      "headline": "Daring Max Verstappen beats McLarens to win Imola Grand PrixMax Verstappen secured a commanding victory at the Imola Grand Prix with a daring first lap overtake on Oscar Piastri. His win intensifies the Formula 1 title battle against the McLaren drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-srh-william-o-rourke-full-press-conference-2726721-2025-05-18",
      "headline": "Will take any opportunity with both hands: LSG's William O' RourkeWilliam O' Rourke is excited for any opportunity that may come his way in the remaining three matches of the Lucknow Super Giants (LSG) in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-kl-rahul-fifth-century-all-time-list-delhi-2726720-2025-05-18",
      "headline": "KL Rahul hits 5th IPL hundred, goes past Shubman Gill in all-time listIPL 2025, DC vs GT: KL Rahul hit a 60-ball hundred for Delhi Capitals in their must-win game at home against Gujarat Titans. It was Rahul's fifth IPL hundred and his first since the 2022 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-pbks-harpreet-brar-player-of-match-award-wife-marriage-2726715-2025-05-18",
      "headline": "Harpreet Brar wins Player of Match award weeks after marriage, dedicates it to wifeIPL 2025, RR vs PBKS: Harpreet Brar dedicated his Player of the Match award to his wife, weeks after their marriage. The left-arm spinner took three wickets in Punjab's successful defence of 219 runs in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-punjab-kings-ipl-win-rajasthan-royals-highlights-2726709-2025-05-18",
      "headline": "Injury scare for Shreyas Iyer? Punjab Kings captain gives updatePunjab Kings captain Shreyas Iyer missed the second innings of their match vs Rajasthan Royals due to a finger injury sustained in practice. Iyer said that he did not know the nature of the injury and needed to get it checked."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}