{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-500-points-nifty-falls-3-things-you-need-to-know-2679965-2025-02-14",
      "headline": "Sensex tanks over 600 points: Why is the stock market down today?The Sensex and Nifty fell sharply after rising in early trade. Here are three things you need to know about today's stock market weakness."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/flights-carrying-deported-indians-from-us-spark-political-row-why-only-punjab-2680160-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Punjab, not Delhi? Bhagwant Mann on US deportation flights landing in AmritsarPunjab Chief Minister Bhagwant Mann slammed the Centre for choosing Amritsar as the landing site for deportation flights from the US. With two more flights set to arrive on February 15 and 16, he questioned if this was a deliberate attempt to defame Punjab. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-continue-65-per-cent-favour-rahul-gandhi-to-lead-opposition-alliance-motn-survey-2680257-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "65% want INDIA bloc to continue, Rahul Gandhi favourite to lead it: MOTN pollDespite internal rifts and electoral setbacks, 65% respondents in the Mood of the Nation survey backed the INDIA bloc's continuation, while Rahul Gandhi led as the preferred leader to lead the opposition bloc with 24% support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranveer-allahbadia-obscene-jokes-case-mumbai-police-unable-to-contact-2680149-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Phone off, residence locked: Cops fail to get in touch with Ranveer AllahbadiaThe police further said that Ranveer Allahbadia's phone was unreachable. The police also said that they couldn't reach Allahbadia's lawyer either."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/f-35-fighter-jets-stryker-vehicles-engine-deal-defence-ties-pm-modi-donald-trump-meet-2679966-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "F-35 jets, Stryker vehicles, engine deal: Defence ties take off at PM-Trump meetThe meeting between PM Modi and US President Donald Trump saw the two sides agreeing to ramp up defence ties for more efficient arms transfer and procurement, and laying the framework for a stronger, technology-driven partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-valentines-day-makes-some-indians-cringe-2680114-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Valentine's Day makes some Indians 'cringe'A recent survey shows that couples are opting to continue the day like any other, with some of them claiming they don't believe in the concept of Valentine's Day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-players-grandmaster-im-title-cash-prize-sports-ministry-scrap-explained-2680220-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why the Indian chess community is upset over scrapped cash prizesThe Indian chess community is upset after the Sports Ministry scrapped cash prizes for players achieving Grandmaster and International Master titles, a move critics say could discourage young talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-high-court-allows-those-affected-by-uniform-civil-code-to-challenge-action-by-authorities-2680075-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand High Court relief to people facing action under UCC: Can approach usThe Uttarakhand High Court said that individuals facing penal action under the Uniform Civil Code can approach the court and will be granted a hearing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-to-send-back-more-fugitives-wanted-by-india-tahawwur-rana-extradition-who-are-on-list-2679976-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who all might lose sleep after Tahawwur Rana's extraditionUS President Donald Trump confirmed the immediate extradition of the 2008 Mumbai terror attacks accused Tahawwur Rana to India and said more would follow. The question is who is next in line. Before PM Modi's US visit, India handed over a list of 10 fugitives, including gangsters Goldy Brar and Anmol Bishnoi, to Washington DC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-does-it-again-with-evs-now-be-6-xev-9e-get-30179-bookings-worth-rs-8472-crore-2680234-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BE 6, XEV 9e get 30,179 bookings worth Rs 8,472 crore on day 1The split between the BE 6 and the XEV 9e was 44% and 56%, respectively, with the majority of the bookings being for the top-end Pack Three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-to-return-to-earth-on-march-19-full-details-inside-2680081-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams to return to Earth on March 19. Full details insideThe return of two astronauts, Butch Wilmore and Suni Williams, who flew to the International Space Station on Boeing's faulty Starliner capsule last summer, has hinged on the arrival of the Crew-10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-israeli-hostages-release-palestinian-prisoners-swap-gaza-ceasefire-deal-2680139-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas to release Israeli-American man, 2 other hostages as part of Gaza dealAmid ongoing uncertainty over the Gaza ceasefire deal, Hamas has announced it will release three more hostages on Saturday, including Israeli-American citizen Sagui Dekel-Chen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/fresh-kerala-ragging-case-in-school-plus-one-students-hand-broken-by-senior-over-respect-2680066-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Kerala ragging case: School student's hand broken for 'not respecting seniors'Days after a horrifying ragging case emerged from a Kerala nursing college, another ragging case was reported from the state. A Plus One student in Kannur school complained his hand was broken by his seniors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/is-f-35-lightning-the-right-choice-for-india-opinion-2680224-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is F-35 Lightning the right choice for India?The single-engine F-35, from an Indian perspective, has to penetrate contested airspaces of our adversaries in a standalone mode, and cannot be part of any integrated offensive mission package of IAF's mainstay platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musks-gift-to-pm-modi-starships-heatshield-tile-that-flew-to-space-2679921-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's gift to PM Modi: Starship's heatshield tile that flew to spaceStarship's heatshield tiles are hexagonal ceramic tiles designed to protect SpaceX's Starship during atmospheric re-entry, when the spacecraft faces extreme temperatures as it returns to Earth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-trump-bilateral-meeting-bangladesh-crisis-hindus-attack-yunus-2679915-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will leave Bangladesh to PM Modi: Trump junks 'deep state' meddling rumoursModi-Trump meet: The unrest in Bangladesh and the subsequent attacks on minority Hindus were among the topics discussed by Prime Minister Narendra Modi during his bilateral with Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/want-to-be-safe-while-riding-on-indian-roads-follow-these-steps-2680194-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Want to be safe while riding on Indian roads? Follow these stepsIndian roads are full of reckless riders. These steps will ensure that you are safe while riding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/humpback-whale-swallows-kayaker-before-letting-him-go-terrifying-video-2679908-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Terrifying moment Humpback whale swallows kayaker before letting him goAdrian Simancas was kayaking with his father, Dell, in Bahia El Aguila, near the Strait of Magellan, when the massive whale surfaced beneath him, swallowing both him and his bright yellow kayak for a few brief seconds.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-got-latent-row-samay-raina-shines-as-ranveer-allahbadia-faces-heat-2679639-2025-02-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's Got Latent row impact: Samay Raina's stocks grow, Ranveer Allahbadia hitA controversy erupted after Ranveer Allahbadia, during an episode of 'India's Got Latent', asked a question to a participant that included \"parents\" and \"sex\" among other obscene references. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-pm-modi-trump-meet-encouraging-concerns-addressed-illegal-indian-immigrants-mistreatment-tariffs-f35-2680032-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor's praise for PM after Trump meet: Encouraging, concerns addressedOn illegal immigration, Congress leader Shashi Tharoor backed PM Modi's stance but asserted that the treatment of undocumented Indian migrants deported from the US should have been addressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-donald-trump-meeting-tariffs-trade-deal-f35-jets-immigration-2679813-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "26/11 plotter extradition, F-35 jets, trade deal: Takeaways from Modi-Trump meetModi-Trump meet: The key takeaways from the Modi-Trump meeting were the extradition of 26/11 Mumbai terror attack accused Tahawwur Rana to India and the F-35 jet deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/chhaava-movie-review-vicky-kaushal-rashmika-mandanna-laxman-utekar-2679812-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava review: Vicky Kaushal's film growls, but doesn't roarReleased-Fri Feb 14, 2025Chhaava movie review: Director Laxman Utekar's Chhaava, starring Vicky Kaushal and Rashmika Mandanna, is based on the life of Maratha King Chhatrapati Sambhaji Maharaj. Brilliant Vicky Kaushal uplifts this strenuous film, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-majore-challenges-delhi-manifesto-promises-clean-yamuna-landfill-freebies-money-women-ayushman-bharat-2678981-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's 10 major challenges in Delhi after historic winAfter a historic win in Delhi, BJP faces the challenge of fulfilling promises like cleaning the Yamuna, offering freebies, and improving infrastructure while balancing a tight budget. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-donald-trump-meeting-bonhomie-hug-handshake-optics-tariffs-for-india-2679853-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi gets lot of tareef, India gets loads of tariffs from Trump on key US visitModi-Trump meet: A warm hug was followed by a firm handshake as PM Modi entered the White House, but the chill was palpable following the US President's announcement of sweeping reciprocal tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/newlyweds-prateik-babbar-priya-banerjee-first-appearance-after-marriage-2680273-2025-02-14",
      "headline": "Watch: Newlyweds Prateik Babbar-Priya Banerjee's first appearance after marriageNewlyweds Prateik Babbar and Priya Banerjee, who got married today, made their first appearance as husband and wife. Walking hand-in-hand, they were all smiles as they posed for the paparazzi waiting outside their wedding venue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/story/queen-of-tears-actor-kim-ji-won-might-feature-in-medical-drama-2680252-2025-02-14",
      "headline": "Queen of Tears star Kim Ji-won might feature in medical drama: ReportSouth Korean star Kim Ji-won will reportedly be next seen in the medical drama, Doctor X: Age of the White Mafia, where she will be playing a genius doctor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sahil-khan-marries-milena-aleksandra-in-burj-khalifa-dubai-2680245-2025-02-14",
      "headline": "Style actor Sahil Khan, 48, marries 22-year-old Milena in Dubai's Burj KhalifaActor Sahil Khan married Milena Aleksandra at a grand wedding reception in Dubai, celebrating with family and friends at the iconic Burj Khalifa. The celebrations took place on February 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/stranger-things-star-millie-bobby-brown-reveals-why-she-married-young-2680208-2025-02-14",
      "headline": "Stranger Things star Millie Bobby Brown reveals why she married youngActor Millie Bobby Brown and Jake Bongiovi got married in May last year. The Stranger Things star was only 20 at the time. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-final-karachi-black-cat-interrupts-play-shaheen-afridi-2680259-2025-02-14",
      "headline": "Watch: Black cat halts play in ODI tri-series final in Karachi's National StadiumPakistan vs New Zealand, ODI tri-series final: Pakistan and New Zealand players were forced to take a break during the tense contest when a black cat ran onto the field, seemingly enjoying the spotlight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-shreyanka-patil-rcb-injury-ruled-out-2680236-2025-02-14",
      "headline": "RCB spinner Shreyanka Patil ruled out due to injury: Sources WPL 2025: Shreyanka Patil has been ruled out of the Women's Premier League after she failed to recover in time. Sneh Rana, who went unsold in the auction last year, has joined the RCB camp. Earlier, Sophie Molineux, Asha Sobhana, Kate Cross and Sophie Devine also missed out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-players-grandmaster-im-title-cash-prize-sports-ministry-scrap-explained-2680220-2025-02-14",
      "headline": "Explained: Why the Indian chess community is upset over scrapped cash prizesThe Indian chess community is upset after the Sports Ministry scrapped cash prizes for players achieving Grandmaster and International Master titles, a move critics say could discourage young talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-opener-fails-pakistan-vs-new-zealand-odi-tri-series-final-champions-trophy-2680184-2025-02-14",
      "headline": "After Babar fails in final, ex-captain calls for new opener in Champions TrophyPakistan vs New Zealand, ODI tri-series final: Babar Azam failed to get going in all three matches of the tri-series, including the final against New Zealand on Friday. Former captain Mohammad Hafeez said Babar should return to batting at No. 3 in the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ayushmann-khurana-ayushmann-khurana-wpl-2025-rcb-vs-gg-2680159-2025-02-14",
      "headline": "Ayushmann Khurana, Madhubanti Bagchi to light up opening dayWPL 2025: Madhubanti Bagchi and Ayushmann Khurana will perform at the Kotambi Stadium in Vadodara during the mid-innings break of the match on Friday between Gujarat Giants and Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lalit-modi-love-relationship-romantic-valentines-day-2680092-2025-02-14",
      "headline": "Lalit Modi finds love again as friendship turns romantic on Valentine's Day Indian businessman Lalit Modi, former IPL chairman, revealed his new relationship on social media on Valentine's Day, but did not disclose his partner's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-australia-2nd-odi-score-record-defeat-champions-trophy-lowest-asia-2680084-2025-02-14",
      "headline": "SL v AUS: Australia all out for lowest total in Asia before Champions TrophySri Lanka vs Australia, 2nd ODI: Australia were bowled out for 107 in less than 25 overs as they suffered a 174-run defeat to Sri Lanka and lost the series 0-2. Australia are looking shaky ahead of Champions Trophy, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealands-injury-crisis-ben-sears-ruled-out-2680083-2025-02-14",
      "headline": "Key New Zealand pacer ruled out of Champions Trophy due to injuryNew Zealand's injury crisis deepend as fast bowler Ben Sears was ruled out of the Champions Trophy 2025. New Zealand already have injury concerns with other players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-class-different-from-the-rest-shardul-thakur-england-century-2680082-2025-02-14",
      "headline": "Rohit Sharma's class is different from the rest: Shardul ThakurShardul Thakur backed Rohit Sharma, dismissing concerns over his form, highlighting his class and recent century against England as proof of his resilience ahead of India's Champions Trophy campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rcb-wpl-2025-smriti-mandhana-2680068-2025-02-14",
      "headline": "Go out there and express yourself: Virat Kohli wishes RCB for WPL 2025WPL 2025: Virat Kohli sent his wishes for defending champions Royal Challengers Bengaluru (RCB), who will start their campaign on February 14 against Gujarat Giants (GG) at the Kotambi Stadium in Vadodara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lalit-modi-love-relationship-romantic-valentines-day-2680092-2025-02-14",
      "headline": "Lalit Modi finds love again as friendship turns romantic on Valentine's Day Indian businessman Lalit Modi, former IPL chairman, revealed his new relationship on social media on Valentine's Day, but did not disclose his partner's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-australia-2nd-odi-score-record-defeat-champions-trophy-lowest-asia-2680084-2025-02-14",
      "headline": "SL v AUS: Australia all out for lowest total in Asia before Champions TrophySri Lanka vs Australia, 2nd ODI: Australia were bowled out for 107 in less than 25 overs as they suffered a 174-run defeat to Sri Lanka and lost the series 0-2. Australia are looking shaky ahead of Champions Trophy, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-vs-new-zealands-injury-crisis-ben-sears-ruled-out-2680083-2025-02-14",
      "headline": "Key New Zealand pacer ruled out of Champions Trophy due to injuryNew Zealand's injury crisis deepend as fast bowler Ben Sears was ruled out of the Champions Trophy 2025. New Zealand already have injury concerns with other players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-class-different-from-the-rest-shardul-thakur-england-century-2680082-2025-02-14",
      "headline": "Rohit Sharma's class is different from the rest: Shardul ThakurShardul Thakur backed Rohit Sharma, dismissing concerns over his form, highlighting his class and recent century against England as proof of his resilience ahead of India's Champions Trophy campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rcb-wpl-2025-smriti-mandhana-2680068-2025-02-14",
      "headline": "Go out there and express yourself: Virat Kohli wishes RCB for WPL 2025WPL 2025: Virat Kohli sent his wishes for defending champions Royal Challengers Bengaluru (RCB), who will start their campaign on February 14 against Gujarat Giants (GG) at the Kotambi Stadium in Vadodara. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}