{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/struggling-to-find-your-old-mutual-fund-investments-sebis-mitra-help-track-unclaimed-mfs-2688839-2025-03-04",
      "headline": "Struggling to find your old mutual fund investments? Let Sebi's Mitra help With over 7.5 million inactive folios across different asset management companies (AMCs), Mitra is designed to help investors recover their forgotten investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-marriage-impact-your-credit-score-all-you-need-to-know-2688797-2025-03-04",
      "headline": "Does marriage impact your credit score? All you need to know While regular payments can improve both scores, any late or default on payments can considerably impact both the scores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-under-pressure-as-us-and-eu-tighten-trade-policies-2688761-2025-03-04",
      "headline": "India's exports under pressure as US and EU tighten trade policiesUS President Donald Trump's plan to impose reciprocal tariffs from April is a major concern for Indian exporters, particularly in sectors like automobiles, agriculture, and manufacturing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nifty-falls-for-10th-straight-session-longest-daily-losing-streak-since-1996-2688757-2025-03-04",
      "headline": "Nifty falls for 10th straight day, longest daily losing streak since 1996 launchNifty has registered a 10-day losing streak amid multiple triggers, including relentless selling by foreign investors and fears of an escalating trade war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-as-trade-war-fears-keep-investors-on-edge-2688744-2025-03-04",
      "headline": "Sensex, Nifty end lower as trade war fears keep investors on edgeThe S&P BSE Sensex ended 96.01 points lower at 72,989.93 at the closing bell, while the NSE Nifty50 fell 36.65 points to 22,082.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-how-to-pick-quality-stocks-mutual-fund-investment-2688732-2025-03-04",
      "headline": "Stock market correction: Here's how to pick quality stocksDuring a market downturn, investors must be careful about stock selection. Choosing the right stocks can help minimise losses and create long-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-ceo-bhavish-aggarwal-wants-weekly-updates-from-staff-kya-chal-raha-hai-report-2688701-2025-03-04",
      "headline": "Ola CEO Bhavish Aggarwal wants weekly updates from staff: ReportUnder the new policy, employees must send a short email every week highlighting 3-5 key tasks they have completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-cryptos-like-bitcoin-ethereum-xrp-cardano-solana-are-crashing-suddenly-2688685-2025-03-04",
      "headline": "Explained: Why popular cryptocurrencies are crashing suddenlyOver the last 24 hours, Bitcoin, the world's largest cryptocurrency, has lost 8.83%, currently trading at $83,461.02."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-in-hibernation-mode-why-have-public-listings-dried-off-dalal-street-slump-2688676-2025-03-04",
      "headline": "IPOs in hibernation mode: Why have public listings dried up?The last mainboard IPO to open for subscription was Quality Power on February 14, 2025. Since then, there has been no fresh activity in the public listing space."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/microchip-to-cut-2000-jobs-impacting-9-of-global-workforce-2688618-2025-03-04",
      "headline": "Microchip to cut 2,000 jobs, impacting 9% of global workforceMicrochip has reported five straight quarters of declining sales, with fourth-quarter revenue and profits falling below expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mixue-chinas-bubble-tea-giant-ipo-listing-share-jumps-over-47-percent-2688653-2025-03-04",
      "headline": "Mixue, China's bubble tea giant, makes a strong IPO debut with 47% stock jumpMixue, popular for its low-cost drinks and Snow King mascot, generated $444 million by offering 17 million shares at HK$202.5 each. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-has-never-fallen-for-6-straight-months-will-march-offer-relief-2688652-2025-03-04",
      "headline": "Nifty stares at worst monthly losing streak. Can March turn the tide?If the situation does not improve in March, Nifty could fall for the sixth straight month, something that has never happened before. This could have a drastic impact on investor sentiments and make the situation worse."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-nude-again-controversial-grammy-outing-2689048-2025-03-05",
      "headline": "Kanye West's wife Bianca goes nude again after controversial Grammy outingKanye West's wife Bianca Censori went nude for a photoshoot. This comes a month after her controversial 'nude' outfit at the Grammys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-separate-7-years-of-marriage-couple-reacts-2688743-2025-03-04",
      "headline": "Actor Shoaib Ibrahim reacts to divorce rumours: Dipika ne diya mujhe dhokhaTelevision couple, Dipika Kakar and Shoaib Ibrahim have found themselves at the center of the separation rumours. The two addressed the same in their new vlog on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shonali-bose-on-delhi-university-miranda-house-objection-to-ziddi-girls-heartbreaking-2688656-2025-03-04",
      "headline": "Shonali Bose on DU, Miranda House's objection to Ziddi Girls: It was heartbreakingPrime Video's Ziddi Girls faced backlash from sections of Delhi University and Miranda House students over perceived negative portrayal, but director Shonali Bose clarifies the trailer was misunderstood and most students ultimately enjoyed the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anora-ott-release-when-and-where-to-watch-the-oscar-winning-best-film-2688627-2025-03-04",
      "headline": "Anora OTT release: When and where to watch the Oscar-winning Best FilmThe Oscar-winning film 'Anora' is set to stream on JioHotstar from March 17. Directed by Sean Baker and starring Mikey Madison, who won Best Actress, the movie offers a thought-provoking narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-dolly-partons-husband-carl-dean-dies-at-82-2688521-2025-03-04",
      "headline": "Singer Dolly Parton's husband Carl Dean dies at 82Carl Dean, husband of Dolly Parton and inspiration for her hit song, Jolene, has died at the age of 82. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpinks-lisa-on-her-new-album-alter-ego-want-people-to-feel-empowered-2688361-2025-03-03",
      "headline": "Blackpink's Lisa on her new album Alter Ego: Want people to feel empoweredLisa of Blackpink recently spoke about her new solo album, Alter Ego. In a virtual panel discussion, the singer shared her desire to make listeners feel empowered with her new album. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-turns-showstopper-milan-fashion-week-2688348-2025-03-03",
      "headline": "Taarak Mehta actor Deepti Sadhwani turns showstopper at Milan Fashion WeekTaarak Mehta Ka Ooltah Chashmah actor Deepti Sadhwani turned showstopper at Milan Fashion Week. The actor shared stunning photos from her rampwalk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-emotional-1st-video-india-got-latent-row-ranveer-allahbadia-samay-raina-2688255-2025-03-03",
      "headline": "Kaam Idhar Udhar Hogaya: YouTuber Ashish Chanchlani on India's Got Latent rowYouTuber Ashish Chanchlani got emotional in his first video after his appearance on comedian Samay Raina's India's Got Latent show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maharani-4-teaser-huma-qureshi-returns-rani-bharti-safeguard-bihar-2688207-2025-03-03",
      "headline": "Maharani 4 teaser: Huma Qureshi returns as Rani Bharti to safeguard BiharActor Huma Qureshi is set to return as Rani Bharti in Maharani Season 4. The makers announced the news with the teaser of the upcoming gripping series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tenali-rama-fire-disrupts-shoot-no-casualties-reported-2688145-2025-03-03",
      "headline": "TV show Tenali Rama set catches fire, shoot haltedA fire broke out on the set of TV show Tenali Rama due to a generator malfunction, halting production. There were no casualties, but the set suffered damage and repairs are underway.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-trailer-abhishek-bachchan-reunites-with-ludo-co-actor-inayat-verma-in-feel-good-film-2688128-2025-03-03",
      "headline": "Be Happy: Abhishek Bachchan reunites with Ludo co-actor Inayat in feel-good filmThe trailer of Abhishek Bachchan and Inayat Verma's upcoming dance-drama Be Happy was released today. Directed by Remo D'Souza, the heartfelt film will premiere on Prime Video on March 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-seoul-concert-new-song-fan-proposal-and-special-appearance-by-jin-2688072-2025-03-03",
      "headline": "BTS' J-hope's Seoul concert: New song, fan proposal and special appearance by JinBTS member and rapper J-hope recently held a concert in Seoul which was attended by his close friend and singer Kim Seokjin (Jin). The concert was one big event for the fans as it consisted of many other surprises besides the central performance by the artiste. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-release-date-announced-2688039-2025-03-03",
      "headline": "Khakee The Bengal Chapter: Jeet and Prosenjit announce release date with fun clipThe next installment of Netflix's critically acclaimed thriller series Khakee, Khakee: The Bengal Chapter will premiere on Netflix in March. The makers of the show announced its release date with a fun video. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupamaa-actor-sudhanshu-pandey-breaks-silence-on-rumoured-feud-with-rupali-ganguly-2687828-2025-03-02",
      "headline": "Anupamaa actor Sudhanshu Pandey breaks silence on rumoured feud with Rupali GangulyActor Sudhanshu Pandey has addressed the ongoing rumours about a feud with his Anupamaa co-star Rupali Ganguly. In an interview, he clarified the situation and dismissed the speculations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-twitter-x-account-hacked-warns-fans-2687489-2025-03-01",
      "headline": "Shreya Ghoshal's X account hacked: Tried every thing in my capacityRenowned singer Shreya Ghoshal has disclosed that her X account has been compromised since February 13. Despite efforts, she remains unable to access or delete the account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rushali-yadav-harsh-arora-splitsvilla-15-contestants-are-engaged-2687457-2025-03-01",
      "headline": "Splitsvilla 15's Rushali Yadav-Harsh Arora engaged: Just perfectly usSplitsvilla 15 contestants Rushali Yadav and Harsh Arora are now engaged. The couple fell in love on the show. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-trailer-ibrahim-ali-khan-khushi-kapoor-romance-netflix-2687443-2025-03-01",
      "headline": "Nadaaniyan trailer: Ibrahim, Khushi's romance comes with a priceIbrahim Ali Khan is all set to making his acting debut in Nadaaniyan, a love story with a secret deal. Also starring Khushi Kapoor, the film explores romance, ambition, and chaos. It will start streaming on Netflix from March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-returns-to-delhi-for-sold-out-millionaire-concert-2687376-2025-03-01",
      "headline": "Honey Singh returns to Delhi for sold-out Millionaire concert: What to expectYo Yo Honey Singh's Millionaire India Tour hits Delhi with a sold-out show, 20,000 fans, top celebs, and a surprise setlist. His parents will attend the concert, making this emotional homecoming extra special. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-wishes-to-team-up-with-diljit-dosanjh-urges-fans-to-make-it-happen-2687276-2025-02-28",
      "headline": "Honey Singh wishes to team up with Diljit Dosanjh, urges fans to make it happenSinger Honey Singh, currently touring India for his Millionaire India Tour, expressed his desire to collaborate with Diljit Dosanjh again during his recent concert in Lucknow. He urged fans to tag the Peaches singer, hoping to reunite for a new project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-reacts-to-comparisons-between-dabba-cartel-and-saas-bahu-aur-flamingo-2687163-2025-02-28",
      "headline": "Shabana Azmi reacts to comparisons between Dabba Cartel and Saas, Bahu Aur FlamingoShabana Azmi addressed concerns over comparisons between her Netflix show Dabba Cartel and Dimple Kapadia's Saas, Bahu Aur Flamingo, emphasising the unique elements of each series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palash-sen-diljit-dosanjh-concert-culture-remark-euphoria-20-remixes-2687019-2025-02-28",
      "headline": "Singer Palash Sen on Diljit's concert culture remark, Euphoria 2.0 and remixesEuphoria's lead vocalist Palash Sen opened up about Diljit Dosanjh's controversial concert culture remark, the rebranding of the band and more in an exclusive interaction with India Today Digital. Sen recently collaborated with Bollywood star Akshay Kumar on the song, Mahakal Chalo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lisa-blackpink-album-alter-ego-review-confident-versatile-powerful-2686930-2025-02-28",
      "headline": "Alter Ego review: Blackpink's Lisa's album is versatile and powerfulLisa of Blackpink releases her solo album Alter Ego. With a total of 15 songs and several collaborations, the album has a lot to take away from, but Lisa shines the brightest in her solo elements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-badnaam-aashram-3-part-2-review-bobby-deol-aaditi-pohankar-prakash-jha-chandan-roy-sanyal-2686921-2025-02-28",
      "headline": "Ek Badnaam Aashram 3 part 2 review: Baba Nirala's journey meets a dramatic endReleased-Thu Feb 27, 2025Prakash Jha's most anticipated series, Aashram Season 3 Part 2, is currently streaming on MX Player. The series focusses on Baba Nirala's fate and how his entire kingdom crashes down because of Pammi's quest for revenge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-review-shabana-azmi-and-gang-will-make-your-jaws-drop-with-boredom-2686950-2025-02-28",
      "headline": "Dabba Cartel review: Shabana Azmi is a silent lioness in a challenging storyReleased-Fri Feb 28, 2025'Dabba Cartel' is supposed to be a powerful story of five women who team up to run a cartel in Mumbai. But, the Netflix series ends up becoming a mushy pie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/g-dragon-ubermensch-album-is-out-a-long-overdue-masterpiece-2686904-2025-02-28",
      "headline": "G-Dragon's Übermensch album is out: A long-overdue masterpieceK-pop King G-Dragon is back with a new album after over a decade. Titled Übermensch, the album is a long-overdue masterpiece the fans deserved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/japanese-woman-summoned-for-kissing-bts-jin-without-consent-2686884-2025-02-28",
      "headline": "Japanese woman summoned for kissing BTS' Jin without consentA Japanese woman has been summoned by the South Korean police after she kissed BTS member Jin without his consent during a fan event held last summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-2-review-pushkar-gayathri-crime-drama-is-trapped-in-the-vortex-of-cliches-aishwarya-rajesh-kathir-2686874-2025-02-28",
      "headline": "Suzhal The Vortex 2 review: This crime-drama is trapped in the vortex of clichesReleased-Fri Feb 28, 2025Suzhal - The Vortex 2 review: Created by Pushkar and Gayatri, Suzhal - The Vortex 2 is a crime drama that suffers from overstuffed ideas. The show has interesting ideas, but it gets lost in the overstretched screenplay.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-discusses-food-music-and-korea-in-new-glimpse-of-with-love-meghan-2686840-2025-02-28",
      "headline": "Meghan Markle discusses food, music and Korea in new glimpse of 'With Love, Meghan'Meghan Markle and chef Roy Choi bond over food and the culture of South Korea as they discuss Karoake bars and music in the new promo for her Netflix show, 'With Love, Meghan'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/composer-pritam-thanks-mumbai-police-for-arresting-studio-theft-culprit-2686604-2025-02-27",
      "headline": "Composer Pritam thanks Mumbai Police for arresting studio theft culpritMusic composer Pritam expressed gratitude towards the Mumbai Police for capturing the suspect involved in a Rs 40 lakh theft from his studio. He praised their efforts in a heartfelt Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-boys-5-supernatural-actors-jensen-ackles-jared-padalecki-misha-collins-to-reunite-2686488-2025-02-27",
      "headline": "The Boys 5: Supernatural actors Jensen Ackles, Jared Padalecki to reuniteThe Boys Season 5 will be an exciting reunion as Soldier Boy Jensen Ackles will be joined by his Supernatural co-stars Jared Padalecki and Misha Collins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-review-sass-swag-and-secrets-in-a-soggy-spin-off-2686399-2025-02-27",
      "headline": "Suits LA review: Sass, swag and secrets in a soggy spin-offReleased-Mon Feb 24, 2025'Suits LA' has the flavour of the original 'Suits', but Teddy Black is no Harvey Spector, and you will be reminded of it, despite all the pizazz in the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/oscar-nominated-savan-kotecha-to-find-indias-first-global-boy-band-2686383-2025-02-27",
      "headline": "Oscar-nominated Savan Kotecha to find India's first global boy bandSavan Kotecha is launching a nationwide hunt for India's first global boy band. Partnering with Universal Music, he aims to build a teen pop economy and create Indian stars for the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-review-korean-main-hoon-na-with-more-thrills-2686314-2025-02-27",
      "headline": "Undercover High School review: Korean 'Main Hoon Na' with more thrillsReleased-Fri Feb 21, 2025Undercover High School review: It is a thrilling Korean series blending action and comedy, reminiscent of 'Main Hoon Na', where a disgraced spy navigates high school challenges while on a mission to find missing gold."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-address-us-congress-speech-trade-war-ukraine-war-tensions-zelenskyy-mineral-deals-russia-2689021-2025-03-05#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live: Reciprocal tariffs against India, China to kick in on April 2, says TrumpDonald Trump to address joint session of Congress live: US President Donald Trump is addressing a joint session of Congress in the House of Representatives chamber. This is his first speech since being inaugurated on January 20. Trump's address comes at a time when he imposed sweeping tariffs on Mexico, Canada and China and withdrew US military aid to war-torn Ukraine, marking a dramatic shift in US policy, and his shouting match with Ukrainian President Voldodymyr Zelenskyy at the Oval Office last week. Follow indiatoday.in for live updates on Trump's address to Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-first-joint-session-of-congress-address-immigration-ukraine-executive-orders-tariffs-republicans-biden-obama-2689037-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "America will be woke no longer: Donald Trump in first Congress joint addressDonald Trump hailed sweeping policy shifts in a defiant address to a joint Congress session, touting aggressive foreign moves, trade disputes, and a crackdown on diversity programs as hallmarks of his administration's rapid transformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-score-virat-kohli-chase-final-dubai-2688941-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chase master Virat Kohli fires India into final, sends Australia home Champions Trophy 2025, India vs Australia semifinal: Virat Kohli came up with a solid batting display as India registered a record chase to beat Australia. The Men in Blue qualified for the final of the Champions Trophy for the third successive time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/first-lady-melania-arrives-to-applause-as-trump-delivers-1st-speech-to-congress-2689040-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Standing ovation for Melania as Trump thanks First Lady in CongressFirst Lady Melania Trump received a standing ovation as she entered the US Capitol for President Donald Trump's first joint session of Congress of his second term. Trump later acknowledged her in his speech, prompting another round of applause as she rose to acknowledge the gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-to-choose-the-perfect-cheese-mozzarella-cheddar-parmesan-for-a-health-conscious-weight-loss-diet-2688911-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to choose the perfect cheese for a health-conscious dietLove cheese but unsure if it should be part of your diet? Let experts help you decide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-shama-mohamed-rohit-sharma-fat-shaming-row-india-australia-champions-trophy-2689019-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid fat-shaming row, Congress leader's climbdown after India defeat AustraliaCongress leader Shama Mohamed, who courted a massive controversy by fat-shaming Rohit Sharma, congratulated Team India for defeating Australia in the semi-final of the Champions Trophy in Dubai under his captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/democrat-congressman-al-green-disrupts-donald-trump-congress-joint-address-2689043-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Texas Democrat disrupts Trump address to Congress, says you have no mandateAs Donald Trump started his joint address to Congress, Democrat lawmakers held up small black signs printed with \"False\" in white lettering. They held up the signs everytime Trump boasted of his accomplishments. One even shouted, \"lie after lie after lie\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-tariff-war-mexico-canada-relief-us-commerce-secretary-howard-lutnick-2689028-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump could give Canada, Mexico tariff relief by today: US Commerce SecretaryDonald Trump's new 25 per cent tariffs on Canadian and Mexican imports took effect on Tuesday, along with a doubling of duties on Chinese goods to 20 per cent. As a result, the three countries have announced retaliatory measures against the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-steals-democrats-hold-black-placards-to-protest-donald-trumps-speech-2689051-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Musk steals: Democrats hold black placards to protest Trump's speechDemocrats protested as Donald Trump delivered a fiery first speech to Congress on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-future-gautam-gambhir-judge-critics-2689030-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You judge Rohit Sharma by stats, we judge by impact: Gautam GambhirChampions Trophy 2025: Head coach Gautam Gambhir was unimpressed when he was asked about Rohit Sharma's future, moments after India beat Australia in the semi-final in Dubai on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/toru-dutt-indias-first-woman-poet-took-ramayana-global-before-dying-at-21-2688902-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Toru Dutt, India's first woman poet, took Ramayana global before dying at 21Toru Dutt, India's first-ever published woman poet, who wrote in English and French, mastered multiple languages and wrote groundbreaking works before dying at 21. Decades before Sarojini Naidu, she introduced the Ramayana and the Mahabharata to the West, and left a legacy that still influences literature today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-dhananjay-munde-resigned-from-devendra-fadnavis-cabinet-2688687-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Dhananjay Munde resigned from Devendra Fadnavis cabinetThe torture and murder of a sarpanch and an extortion case in the NCP leader's Beed district had become a major embarrassment for the Mahayuti government\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-anushka-sharma-india-vs-australia-2689033-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Virat Kohli fist pumps in joy as Anushka Sharma cheers for himChampions Trophy 2025: Virat Kohli celebrated wholeheartedly as his wife Anushka Sharma cheered for him from the stands after India beat Australia in the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-vijay-varma-part-ways-breakup-after-dating-for-2-years-source-2688818-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamannaah Bhatia, Vijay Varma part ways after dating for 2 years: SourceActors Tamannaah Bhatia and Vijay Varma have parted ways after dating for two years. The duo had made their relationship public in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/random-country-jd-vance-mocks-uks-ukraine-peacekeeping-plan-sparks-fury-2689031-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Random country: JD Vance mocks UK's Ukraine peacekeeping plan, sparks furyUS Vice President JD Vance has denied targeting Britain or France with his remarks on a European peacekeeping force in Ukraine after facing sharp criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/five-reasons-why-south-india-is-resisting-the-north-push-2688795-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Five reasons why South India is resisting the 'North' pushThe divisions are seen to have only deepened under BJP-led central rule, prompting a fierce confrontation and counter from Opposition-ruled southern states\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-nude-again-controversial-grammy-outing-2689048-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kanye West's wife Bianca goes nude again after controversial Grammy outingKanye West's wife Bianca Censori went nude for a photoshoot. This comes a month after her controversial 'nude' outfit at the Grammys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/playback-singer-kalpana-raghavendar-attempts-suicide-hospitalised-for-treatment-2688949-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Playback singer Kalpana Raghavendar attempts suicide, hospitalised in HyderabadPlayback singer Kalpana Raghavendar attempted suicide at her residence in Nizampet, Hyderabad on Tuesday. She is currently in the hospital receiving treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-gautam-gambhir-comments-2688995-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Some are perpetual cribbers: Gambhir slams critics in fiery presserIndia head coach Gautam Gambhir hit out at critics after India reached the final of the Champions Trophy on Tuesday, March 4. Gambhir slammed the people who have taken a veiled dig at India for playing the tournament at the same venue.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/hyderabad-techie-dies-by-suicide-in-telanganas-raidurgam-over-dowry-harassment-by-husband-2688857-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Techie, 25, dies by suicide in Telangana over alleged dowry harassmentA 25-year-old woman from Telangana, died by suicide allegedly due to dowry harassment by her husband. Her mother filed a complaint, leading to a police case being filed. The authorities have sent the woman's body for a post-mortem to determine further details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/when-cola-war-got-indians-a-cold-drink-for-just-rs-5-pepsi-coca-cola-champions-trophy-match-india-obesity-day-2688751-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Cola War got Indians a cold drink for just Rs 5With its latest advertisement and pricing, Pepsi has launched the latest Cola War against rival Coca-Cola. Timed with the Champions Trophy semi-final match between India and Australia, it coincided with World Obesity Day. Here's all about the Cola War of the '90s that made cold drink affordable to a much larger section of the population.       "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-joint-session-congress-speech-not-state-of-the-union-house-chamber-2688476-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Trump's speech to US Congress is not the State of the Union addressDonald Trump's address to a joint session of Congress on Tuesday night, his first since returning to the White House in January, will not be the State of the Union address as the US President was inaugurated over a month ago."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-governor-trudeau-jibe-canada-announces-retaliatory-tariff-2689000-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's 'Governor Trudeau' jibe after Canada announces retaliatory tariffUS President Donald Trump threatened Canada that it would further impose tariffs on Canadian imports after Ottawa announced a retaliatory levy on American goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-ravindra-jadeja-tape-semifinal-umpire-argument-2688770-2025-03-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why Ravindra Jadeja was asked to remove tape on handChampions Trophy 2025: Ravindra Jadeja was asked to remove a tape on his bowling hand during the Australian innings in Dubai on Tuesday. The all-rounder shone with two wickets in the middle overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-agrees-son-abhishek-bachchan-victim-nepotism-negativity-2689065-2025-03-05",
      "headline": "Amitabh Bachchan reacts to post on son Abhishek facing nepotism negativityAmitabh Bachchan defends Abhishek Bachchan against nepotism negativity. He agrees his son has been a victim of nepotism criticism despite his impressive filmography."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/playback-singer-kalpana-raghavendar-attempts-suicide-hospitalised-for-treatment-2688949-2025-03-05",
      "headline": "Playback singer Kalpana Raghavendar attempts suicide, hospitalised in HyderabadPlayback singer Kalpana Raghavendar attempted suicide at her residence in Nizampet, Hyderabad on Tuesday. She is currently in the hospital receiving treatment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/shiori-ito-oscar-nominated-documentary-black-box-diaries-not-release-in-japan-noriyuki-yamaguchi-metoo-allegations-2688925-2025-03-04",
      "headline": " Japan's Oscar-nominated documentary Black Box Diaries won't release in the countryFilmmaker Shiori Ito's Oscar-nominated documentary Black Box Diaries has yet to be aired in her home country, Japan. This comes after Ito's rape allegations against a prominent journalist, Noriyuki Yamaguchi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-rejects-lady-superstar-title-her-name-is-closest-to-her-heart-2688934-2025-03-04",
      "headline": "Nayanthara rejects 'Lady Superstar' title, says her name is closest to her heartActor Nayanthara has denounced the title of 'Lady Superstar' and requested fans to call her by name. The actor said how her name is something that she holds closest to her heart."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-steve-smith-india-vs-australia-dubai-2689050-2025-03-05",
      "headline": "Not buying into it: Steve Smith on India's Dubai advantage theoryChampions Trophy 2025: Skipper Steve Smith accepted defeat gracefully, saying that India outplayed Australia in the semi-final on Tuesday at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-anushka-sharma-india-vs-australia-2689033-2025-03-05",
      "headline": "Watch: Virat Kohli fist pumps in joy as Anushka Sharma cheers for himChampions Trophy 2025: Virat Kohli celebrated wholeheartedly as his wife Anushka Sharma cheered for him from the stands after India beat Australia in the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-future-gautam-gambhir-judge-critics-2689030-2025-03-05",
      "headline": "You judge Rohit Sharma by stats, we judge by impact: Gautam GambhirChampions Trophy 2025: Head coach Gautam Gambhir was unimpressed when he was asked about Rohit Sharma's future, moments after India beat Australia in the semi-final in Dubai on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-dominate-ct-2025-australia-semifinal-whodunit-in-reverse-2689027-2025-03-05",
      "headline": "Champions Trophy: A whodunnit in reverse, starring invincible India The Champions Trophy feels like a whodunnit in reverse -- its ending obvious from the start, with India crushing Australia in a lopsided semi-final. Every time Australia dared to dream, India punched them in the face, and didn't let the game stray from its inevitable ending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-kl-rahul-batting-six-india-vs-australia-2689016-2025-03-05",
      "headline": "What more can I do? KL Rahul hits back at trolls after knock vs AustraliaIndia batter KL Rahul hit back at trolls for constantly questioning his position in the ODI team. KL Rahul's comments came after the batter took India over the line in the semi-final against Australia.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semifinal-emotions-virat-kohli-rohit-sharma-hug-2689025-2025-03-05",
      "headline": "Watch: Virat and Rohit share a hug in India's emotional celebrationIndia vs Australia, Champions Trophy 2025: The Indian dressing room was on an emotional high after KL Rahul hit the winning runs in their 265-run chase in Dubai on Tuesday. Virat Kohli and Rohit Sharma were seen sharing a warm hug before Kohli soaked in the applause from the crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-gautam-gambhir-comments-2688995-2025-03-04",
      "headline": "Some are perpetual cribbers: Gambhir slams critics in fiery presserIndia head coach Gautam Gambhir hit out at critics after India reached the final of the Champions Trophy on Tuesday, March 4. Gambhir slammed the people who have taken a veiled dig at India for playing the tournament at the same venue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-gautam-gambhir-lashes-out-at-virat-kohli-criticism-against-leg-spin-2688990-2025-03-04",
      "headline": "Gautam Gambhir lashes out at criticism of Virat Kohli against leg spinIndia head coach Gautam Gambhir lashed out at criticism of Virat Kohli against leg spin following his match-winning knock against Australia in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-sunil-gavsakar-on-india-beating-australia-semifinal-virat-kohli-2688978-2025-03-04",
      "headline": "Don't talk revenge, just enjoy the sport: Gavaskar on India beating AustraliaChampions Trophy 2025: Speaking to India Today, legendary Sunil Gavaskar said India were the better team against a hamstrung Australian side in the semi-final on Sunday. The former captain lauded Virat Kohli's responsible 84, calling him one of the greatest chasers in ODI history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-india-captain-rohit-sharma-poor-toss-record-2688973-2025-03-04",
      "headline": "Winning tosses or matches? Rohit Sharma has a favouriteRohit Sharma's luck at the toss continues to falter as he lost his 11th consecutive toss in India's Champions Trophy semi-final against Australia. With an unwanted record looming, does it really impact India's chances?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-kapil-dev-exclusive-virat-kohli-india-vs-australia-semifinal-2688970-2025-03-04",
      "headline": "Virat Kohli the greatest among greats in ODI run chases: Kapil Dev Champions Trophy 2025: Speaking to India Today, legendary Kapil Dev said Virat Kohli is a cut above the rest when it comes to ODI run-chases. Kohli hit a well-paced 84 as India knocked Australia out of the tournament in Dubai on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-gautam-gambhir-comments-2688995-2025-03-04",
      "headline": "Some are perpetual cribbers: Gambhir slams critics in fiery presserIndia head coach Gautam Gambhir hit out at critics after India reached the final of the Champions Trophy on Tuesday, March 4. Gambhir slammed the people who have taken a veiled dig at India for playing the tournament at the same venue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-gautam-gambhir-lashes-out-at-virat-kohli-criticism-against-leg-spin-2688990-2025-03-04",
      "headline": "Gautam Gambhir lashes out at criticism of Virat Kohli against leg spinIndia head coach Gautam Gambhir lashed out at criticism of Virat Kohli against leg spin following his match-winning knock against Australia in the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-sunil-gavsakar-on-india-beating-australia-semifinal-virat-kohli-2688978-2025-03-04",
      "headline": "Don't talk revenge, just enjoy the sport: Gavaskar on India beating AustraliaChampions Trophy 2025: Speaking to India Today, legendary Sunil Gavaskar said India were the better team against a hamstrung Australian side in the semi-final on Sunday. The former captain lauded Virat Kohli's responsible 84, calling him one of the greatest chasers in ODI history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-india-captain-rohit-sharma-poor-toss-record-2688973-2025-03-04",
      "headline": "Winning tosses or matches? Rohit Sharma has a favouriteRohit Sharma's luck at the toss continues to falter as he lost his 11th consecutive toss in India's Champions Trophy semi-final against Australia. With an unwanted record looming, does it really impact India's chances?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-kapil-dev-exclusive-virat-kohli-india-vs-australia-semifinal-2688970-2025-03-04",
      "headline": "Virat Kohli the greatest among greats in ODI run chases: Kapil Dev Champions Trophy 2025: Speaking to India Today, legendary Kapil Dev said Virat Kohli is a cut above the rest when it comes to ODI run-chases. Kohli hit a well-paced 84 as India knocked Australia out of the tournament in Dubai on Tuesday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}