{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-steel-share-price-gains-five-session-expert-views-buy-hold-or-sell-2606867-2024-09-26",
      "headline": "Tata Steel shares gain for 5th straight session. What should investors do?In the past year, Tata Steel has rallied 28%, with an 18% gain so far in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-shares-surge-to-record-high-on-citis-buy-call-check-details-2606794-2024-09-26",
      "headline": "Trent shares surge to record high on Citi's 'buy' call. Check detailsCiti set a target price of Rs 9,250 for the stock, signaling a 21% upside from the previous closing price, and added it to its Pan-Asia high-conviction focus list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-conclave-puneet-chhatwal-eyes-top-3-spot-for-taj-hotels-in-global-hospitality-2606774-2024-09-26",
      "headline": "Puneet Chhatwal eyes top 3 spot for Taj Hotels in global hospitalityHe envisions the brand securing its place among the top three global hospitality companies in the next five years, a goal driven by Taj's ethos of service, adaptability to changing luxury trends, and a commitment to sustainable growth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/case-against-karnataka-chief-minister-siddaramaiah-mysuru-lokayukta-muda-land-scam-2607449-2024-09-27",
      "headline": "Lokayukta registers case against Siddaramaiah in Mysore land scamIn a major legal challenge for Karnataka Chief Minister Siddaramaiah, the Mysuru Lokayukta on Friday registered a case against him in connection with the alleged MUDA land scam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagan-mohan-reddy-andhra-pradesh-cancel-tirupati-temple-animal-fat-laddu-laddoo-row-2607403-2024-09-27",
      "headline": "Jagan Reddy cancels visit to Tirupati temple amid 'animal fat' in laddu rowYSR Congress Party (YSRCP) Chief and former Andhra Pradesh Chief Minister YS Jagan Mohan Reddy has cancelled his planned visit to Tirumala amid the controversy over allegations that animal fat was used in the preparation of the temple's prasadam laddus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-lebanon-attack-ground-operation-netanyahu-hamas-gaza-war-2607491-2024-09-27",
      "headline": "Israel deploys tanks near Lebanon in preparation for ground offensiveOver 700 people have been killed in Israel's offensive in Lebanon this week, with 25 casualties reported on Friday alone. As Israel ramps up its attacks against Hezbollah, a potential ground invasion looms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/class-2-student-killed-school-hostel-hathras-up-to-bring-glory-fame-2607216-2024-09-27",
      "headline": "'Human sacrifice' in UP, Class 2 boy strangled to bring 'glory to school'The alleged motive behind the murder was to ensure the prosperity of the school, which had been under financial strain. The accused believed that offering a human sacrifice would lead to the school's success.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/what-doctors-say-about-rapamycin-the-magic-pill-that-can-extend-your-life-2607307-2024-09-27",
      "headline": "What doctors say about Rapamycin, the magic pill that can 'extend your life'Rapamycin has gained significant attention from 'longevity experts' as the key to a longer, healthier life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/jd-vances-2020-messages-resurface-donald-trump-thoroughly-failed-to-deliver-2607504-2024-09-27",
      "headline": "JD Vance's 2020 messages resurface: Donald Trump 'thoroughly failed to deliver'The messages were sent by JD Vance during Trump's last year in the White House. Vance messaged his acquaintance on the social media platform, which was then known as 'Twitter', criticising Trump's failure to fulfil his economic agenda as well as his methods of governance.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-deputy-cm-son-driving-jeep-police-protection-prem-chand-bairwa-son-ashu-2607465-2024-09-27",
      "headline": "Video: Rajasthan Deputy Chief Minister's son's reel shoot with police escortRajasthan Deputy Chief Minister and BJP leader Prem Chand Bairwa issued a clarification after a video featuring his son driving a car, escorted by police vehicles, went viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/canada-mp-chandra-arya-kanishka-air-india-flight-bombing-khalistan-fresh-probe-2607443-2024-09-27",
      "headline": "Canada MP slams 'Khalistan extremists' over fresh Kanishka bombing probe pleaIn an address to the Canadian Parliament, Chandra Arya said two public inquiries had already found Khalistan extremists responsible for the bombing of Air India 'Kanishka' flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/devara-part-1-review-jr-ntr-saif-ali-khan-shoulder-koratala-siva-predictable-action-drama-2607353-2024-09-27",
      "headline": "Devara Part 1 review: Jr NTR, Saif Ali Khan shoulder predictable action dramaReleased-Fri Sep 27, 2024Devara Part 1 movie review: Director Koratala Siva's Devara Part 1, starring Jr NTR and Saif Ali Khan, is an action drama with elaborate characterisations. The film features strong performances from Jr NTR and Saif Ali Khan, but the story remains predictable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/kerala-thrissur-sbi-atm-robbery-tamil-nadu-namakkal-container-encounter-2607476-2024-09-27",
      "headline": "Tamil Nadu: ATM robbers who used gas cutters to break into machines nabbedA gang of robbers was nabbed in Tamil Nadu after they robbed three SBI ATMs in neighbouring Kerala's Thrissur using gas cutters early on Friday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kangana-ranaut-emergency-bhindranwale-dialogue-firing-scene-among-13-cuts-by-censor-board-2607457-2024-09-27",
      "headline": "Emergency: Bhindranwale dialogue, firing scene among 13 cuts by censor boardThe censor board has recommended final cuts and changes to Kangana Ranaut's Emergency. This includes removal of a few violent scenes and reference to Bhindranwale as a 'saint'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-prime-minister-keir-starmer-backs-india-bid-for-permanent-seat-united-nations-security-council-unsc-after-us-france-2607193-2024-09-27",
      "headline": "India's bid for permanent UN Security Council seat gets major push UK Prime Minister Keir Starmer on Thursday backed India for a permanent member of the United Nations Security Council (UNSC) during his address at the United Nations General Assembly's 79th session in New York."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/flipkart-apologises-aalsi-bewakoof-kambakkht-pati-video-backlash-big-billion-days-sale-2607239-2024-09-27",
      "headline": "Flipkart apologises for video calling husbands 'aalsi, bewakoof' after backlashThe video, promoting Flipkart's 'Big Billion Days Sale,' has since been removed from their social media platforms after the backlash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-raps-delhi-air-quality-panel-air-pollution-stubble-burning-2607351-2024-09-27",
      "headline": "Silent spectators: Supreme Court blasts air quality panel over Delhi pollutionPulling up the Commission for Air Quality Management (CAQM), the Supreme Court said not a single committee was formed to tackle the stubble burning issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-porn-actor-riya-aarohi-barde-arrest-maharashtra-fake-passport-2607478-2024-09-27",
      "headline": "Bangladeshi adult film actor arrested for staying illegally in IndiaThe incident came to light after Riya Barde's friend came to know that she was staying illegally in the country and alerted the police in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-to-prakash-raj-over-tirupati-laddu-row-pawan-kalyan-2607335-2024-09-27",
      "headline": "Vishnu Manchu to Prakash Raj over Tirupati laddu row: Not everything is your fightActor Vishnu Manchu addressed his social media exchange with Prakash Raj over the Tirupati laddu adulteration controversy, defending Pawan Kalyan's call for an investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqt-bill-ammendment-bjp-muslim-responses-controversy-mp-nishikant-dubey-alleges-foreign-role-aimplb-2607168-2024-09-27",
      "headline": "Who flooded Waqf Bill JPC's mailbox?The huge number of suggestions that the Joint Parliamentary Committee (JPC) on the Waqf (Amendment) Bill received has sparked a controversy. Panel member and BJP MP Nishikant Dubey sought a probe into the role of China or Pakistan's ISI over the 1.25 crore submissions. The All India Muslim Personal Law Board said Muslims had sent 5 crore feedback to the JPC against the bill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-virender-sehwag-exclusive-interview-2607063-2024-09-27",
      "headline": "With shades of Sehwag, Shafali learns to blend maturity with aggressionShafali Verma spoke to India Today in an exclusive interview where she talked about her double hundred against South Africa and the way she has improved her game since her debut for India back in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/last-mughal-emperor-bahadur-shah-zafar-british-pension-sepoy-mutiny-1857-revolt-delhi-meerut-rangoon-2606778-2024-09-27",
      "headline": "For British pension, Bahadur Shah Zafar plotted against sepoys in 1857Indian sepoys who had raised the flag of revolt in 1857 reached Red Fort and urged Bahadur Shah Zafar to be the symbolic head of their fight. The last Mughal emperor, living off a pension from the British, wrote letters to the British conspiring against the Indian sepoys. A look at the pension worries of Bahadur Shah Zafar amid 21st century India's pension conundrum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/turkey-president-turkiye-recep-tayyip-erdogan-skipped-kashmir-in-united-nations-speech-rattled-pakistan-shahbaz-sharif-2607222-2024-09-27",
      "headline": "Why Turkey's Erdogan skipped Kashmir in speech, rattled Pakistan | ExplainedTurkey's President Erdogan omits Kashmir in his UNGA speech. What could signal a potential shift in Turkey's stance, is seen as a blow to Pakistan, and it's futile 'activism' for Kashmir. The move could be linked to Turkey's aspirations to join the BRICS group, and strengthening ties with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-moment-dart-spacecraft-crashed-into-asteroid-intentionally-2607415-2024-09-27",
      "headline": "Video: Moment Dart spacecraft crashed into asteroid intentionallyThe target of DART's impact was Dimorphos, a small moonlet orbiting the larger asteroid Didymos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sunil-jakhar-punjab-bjp-president-congress-leadership-crisis-sikh-politician-2607425-2024-09-27",
      "headline": "Why Sunil Jakhar isn't keen on continuing as Punjab BJP chiefSunil Jakhar has offered to resign as Punjab BJP chief twice, citing dissatisfaction with the party's internal leadership, factionalism, and interference in his authority."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-mahalaxmi-fridge-murder-accused-confessed-mother-2607354-2024-09-27",
      "headline": "Loved her, she wanted to trap me: Bengaluru murder accused confessed to motherPolice sources said after killing Mahalakshmi, the accused went to his home in Odisha, after almost three years, and confessed to the crime before his mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-kamindu-mendis-1000-runs-don-bradman-tests-stat-2607502-2024-09-27",
      "headline": "Sri Lanka's Kamindu scores 1000 Test runs as quickly as Don Bradman: StatsSri Lanka vs New Zealand, 2nd Test: Kamindu Mendis became the fastest Asian batter to complete 1000 runs in Test cricket. He equalled Don Bradman on the list of batters with fewest innings to achieve the landmark in the traditional format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dame-maggie-smith-dies-at-89-harry-potter-star-and-oscar-winning-actor-2607544-2024-09-27",
      "headline": "Harry Potter star and Oscar winning actor Dame Maggie Smith dies at 89Harry Potter star and Oscar winning actor Dame Maggie Smith dies at 89"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/amaran-sai-pallavi-first-look-teaser-sivakarthikeyan-2607536-2024-09-27",
      "headline": "Amaran: Sai Pallavi's first look from Mukund Varadarajan's biopic unveiledSai Pallavi's first look from the upcoming Tamil film Amaran was released today, September 27. Also starring Sivakarthikeyan, the film is a biopic of late Major Mukund Varadharajan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/the-tribe-trailer-alanna-panday-leads-reality-show-about-content-creators-prime-video-2607511-2024-09-27",
      "headline": "The Tribe trailer: Alanna Panday leads reality show about content creatorsPrime Video has launched the trailer for its upcoming reality series The Tribe' featuring five young influencers and digital evangelist Hardik Zaveri, set to premiere on October 4, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-palak-sidhwani-alleges-taarak-mehta-makers-threatened-to-ruin-her-career-2607509-2024-09-27",
      "headline": "Actor Palak Sindhwani alleges Taarak Mehta makers threatened to ruin her careerActor Palak Sindhwani, who plays Sonu Bhide in Taarak Mehta Ka Ooltah Chashmah, released an official statement to India Today, alleging that the makers have been torturing and threatening her. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-kamindu-mendis-1000-runs-don-bradman-tests-stat-2607502-2024-09-27",
      "headline": "Sri Lanka's Kamindu scores 1000 Test runs as quickly as Don Bradman: StatsSri Lanka vs New Zealand, 2nd Test: Kamindu Mendis became the fastest Asian batter to complete 1000 runs in Test cricket. He equalled Don Bradman on the list of batters with fewest innings to achieve the landmark in the traditional format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-fan-cycles-58-km-to-watch-ind-vs-ban-2nd-test-in-kanpur-green-park-2607469-2024-09-27",
      "headline": "Virat Kohli's 15-year-old fan travels 58 km on cycle to watch his star in KanpurA young fan of the star India batter Virat Kohli travelled 58 km on cycle to watch his favourite player in action during the second Test against Bangladesh at Green Park in Kanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-umpire-aleem-dar-retire-2024-25-domestic-season-2607454-2024-09-27",
      "headline": "Aleem Dar to retire from umpiring after ongoing domestic season Aleem Dar will retire from professional umpiring after the ongoing domestic season in Pakistan. He served as an umpire for nearly 25 years after making his debut in the 1998-99 Quaid-e-Azam Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-bayern-munich-looking-forward-to-facing-champions-leverkusen-vincent-kompany-2607447-2024-09-27",
      "headline": "Bayern Munich looking forward to facing champions Leverkusen: Vincent KompanyBayern Munich boss Vincent Kompany has claimed that his team is ready for the challenge of going up against the Bundesliga champions Bayer Leverkusen. Bayern have made a strong start to the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ravindra-jadeja-glenn-maxwell-border-gavaskar-trophy-jasprit-bumrah-2607424-2024-09-27",
      "headline": "Ashwin and Jadeja will dictate the outcomes of Tests during BGT: Glenn MaxwellAustralia all-rounder Glenn Maxwell has said that the Indian spin duo of Ravichandran and Ravindra Jadeja will determine the result of the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-kanpur-test-police-tiger-robi-hospitalised-dehydration-2607417-2024-09-27",
      "headline": "Watch: Kanpur police escort Bangladesh fan 'Tiger Robi' to hospital Tiger Robi,' the passionate Bangladesh cricket fan, was carried off the stands by security officials on Day 1 of the second Test between India and Bangladesh. According to police sources, Tiger Robi's health deteriorated on Friday morning, requiring immediate hospital admission due to dehydration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-virender-sehwag-exclusive-interview-2607063-2024-09-27",
      "headline": "With shades of Sehwag, Shafali learns to blend maturity with aggressionShafali Verma spoke to India Today in an exclusive interview where she talked about her double hundred against South Africa and the way she has improved her game since her debut for India back in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-day-one-report-akash-deep-mominul-haque-kanpur-2607405-2024-09-27",
      "headline": "2nd Test: Akash Deep stars as rain halts India charge, Bangladesh resistanceAkash Deep was the star of the show on Day 1 of the Kanpur Test as India's charge was halted by rain and a fine fightback from Bangladesh, led by Mominul Haque on September 27, Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-return-training-paris-olympics-glory-2607404-2024-09-27",
      "headline": "Manu Bhaker to return to training in November after Olympics glory  Manu Bhaker shared an update on her return to the shooting ranges after winning multiple medals for India in the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-breaks-anil-kumble-indian-for-most-test-wickets-in-asia-2607352-2024-09-27",
      "headline": "Ashwin breaks Anil Kumble's Indian record for most Test wickets in AsiaIndia vs Bangladesh:  Ravichandran Ashwin has surpassed Anil Kumble to become India's most successful bowler in Test cricket in Asia during the second Test against Bangladesh. Ashwin now has 420 wickets in the Asian continent, second only to Muttiah Muralitharan's 612."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-kanpur-test-police-tiger-robi-hospitalised-dehydration-2607417-2024-09-27",
      "headline": "Watch: Kanpur police escort Bangladesh fan 'Tiger Robi' to hospital Tiger Robi,' the passionate Bangladesh cricket fan, was carried off the stands by security officials on Day 1 of the second Test between India and Bangladesh. According to police sources, Tiger Robi's health deteriorated on Friday morning, requiring immediate hospital admission due to dehydration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-virender-sehwag-exclusive-interview-2607063-2024-09-27",
      "headline": "With shades of Sehwag, Shafali learns to blend maturity with aggressionShafali Verma spoke to India Today in an exclusive interview where she talked about her double hundred against South Africa and the way she has improved her game since her debut for India back in 2019. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-second-test-day-one-report-akash-deep-mominul-haque-kanpur-2607405-2024-09-27",
      "headline": "2nd Test: Akash Deep stars as rain halts India charge, Bangladesh resistanceAkash Deep was the star of the show on Day 1 of the Kanpur Test as India's charge was halted by rain and a fine fightback from Bangladesh, led by Mominul Haque on September 27, Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-return-training-paris-olympics-glory-2607404-2024-09-27",
      "headline": "Manu Bhaker to return to training in November after Olympics glory  Manu Bhaker shared an update on her return to the shooting ranges after winning multiple medals for India in the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-breaks-anil-kumble-indian-for-most-test-wickets-in-asia-2607352-2024-09-27",
      "headline": "Ashwin breaks Anil Kumble's Indian record for most Test wickets in AsiaIndia vs Bangladesh:  Ravichandran Ashwin has surpassed Anil Kumble to become India's most successful bowler in Test cricket in Asia during the second Test against Bangladesh. Ashwin now has 420 wickets in the Asian continent, second only to Muttiah Muralitharan's 612."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-fan-riger-robi-hospitalised-2607350-2024-09-27",
      "headline": "Bangladesh fan 'Tiger Robi' rushed to hospital after dehydration in Kanpur TestIndia vs Bangladesh, 2nd Test: A Bangladesh cricket fan, Tiger Robi, was admitted to a hospital in Kanpur after his health deteriorated at the stands on Day 1 of the encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/neeraj-chopra-india-return-home-haryana-grand-welcome-diamond-league-injury-2607345-2024-09-27",
      "headline": "Watch: Neeraj Chopra receives roaring welcome on returning home India's javelin star Neeraj Chopra received a grand welcome in Haryana after his second-place finish at the Brussels Diamond League, despite injury. The Sports University of Haryana in Sonipat celebrated his remarkable achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-fitness-world-championships-2025-injury-update-2607336-2024-09-27",
      "headline": "Neeraj Chopra targets return to peak fitness, World Championship glory in 2025 Neeraj Chopra said he is confident of returning to 100 percent fitness at the start of the next season. The double Olympic medalist was battling with a groin injury throughout the 2024 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-ole-gunnar-solksjaer-open-to-manchester-united-managerial-return-2607323-2024-09-27",
      "headline": "Ole Gunnar Solskjaer open to Manchester United managerial return: Would say yesOle Gunnar Solskjaer has claimed that he would be open to making a return as the manager of Manchester United. Solksjaer left the United 3 years ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-fans-unhappy-after-dwayne-bravo-joins-kkr-2607322-2024-09-27",
      "headline": "Disappointing start to season: CSK fans unhappy after Dwayne Bravo joins KKRChennai Super Kings fans were left stunned as Dwayne Bravo, a key figure in their IPL success, joined Kolkata Knight Riders as a mentor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-kamindu-mendis-5th-hundred-galle-2607303-2024-09-27",
      "headline": "SL vs NZ: Kamindu Mendis continues golden Test run, scores 5th Test hundredKamindu Mendis continued his golden run in Test cricket as he scored his 5th hundred on Day 2 of the Galle Test on Friday, September 27. Kamindu got to his hundred in 147 balls against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-ravi-shastri-raghuvendra-diwedi-special-post-2607290-2024-09-27",
      "headline": "Ravi Shastri shares special post with 'Raghu Bhaiya' ahead Kanpur TestFormer India coach Ravi Shastri praised the team's throwdown specialist, Raghuvendra Diwedi, known as \"Raghu Bhaiya,\" ahead of the second Test against Bangladesh. Shastri highlighted Raghu's crucial role in preparing India's top batters to face high-speed bowling challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-trolls-social-media-medals-viral-photo-hotel-room-2607285-2024-09-27",
      "headline": "Manu Bhaker doubles down on trolls, flaunts room full of medals in heartwarming postDouble Olympic medalist Manu Bhaker continued to hit out at her trolls. The celebrated shooter flaunted a room of medals, which included the two bronze medals she won at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-fans-unhappy-after-dwayne-bravo-joins-kkr-2607322-2024-09-27",
      "headline": "Disappointing start to season: CSK fans unhappy after Dwayne Bravo joins KKRChennai Super Kings fans were left stunned as Dwayne Bravo, a key figure in their IPL success, joined Kolkata Knight Riders as a mentor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-second-test-kamindu-mendis-5th-hundred-galle-2607303-2024-09-27",
      "headline": "SL vs NZ: Kamindu Mendis continues golden Test run, scores 5th Test hundredKamindu Mendis continued his golden run in Test cricket as he scored his 5th hundred on Day 2 of the Galle Test on Friday, September 27. Kamindu got to his hundred in 147 balls against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-ravi-shastri-raghuvendra-diwedi-special-post-2607290-2024-09-27",
      "headline": "Ravi Shastri shares special post with 'Raghu Bhaiya' ahead Kanpur TestFormer India coach Ravi Shastri praised the team's throwdown specialist, Raghuvendra Diwedi, known as \"Raghu Bhaiya,\" ahead of the second Test against Bangladesh. Shastri highlighted Raghu's crucial role in preparing India's top batters to face high-speed bowling challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhaker-trolls-social-media-medals-viral-photo-hotel-room-2607285-2024-09-27",
      "headline": "Manu Bhaker doubles down on trolls, flaunts room full of medals in heartwarming postDouble Olympic medalist Manu Bhaker continued to hit out at her trolls. The celebrated shooter flaunted a room of medals, which included the two bronze medals she won at the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ravindra-jadeja-imitate-jasprit-bumrah-bowling-action-2607264-2024-09-27",
      "headline": "Watch: Virat Kohli and Ravindra Jadeja imitate Jasprit Bumrah's bowling actionIndia vs Bangladesh, 2nd Test: Virat Kohli and Ravindra Jadeja were seen copying Jasprit Bumrah's bowling action and his routine of returning to the mark after delivering the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-shah-rukh-khan-message-kkr-mentor-chennai-super-kings-2607236-2024-09-27",
      "headline": "Dwayne Bravo recalls Shah Rukh Khan's party message after joining KKR as mentorIPL 2025: Former West Indies all-rounder recalled Shah Rukh Khan's message after he was appointed the mentor of the Knight Riders. Bravo also thanked the Chennai Super Kings for 'blessing' him for the next chapter of his cricketing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-contrasting-reactions-to-drs-decisions-in-kanpur-test-go-viral-2607227-2024-09-27",
      "headline": "Rohit Sharma's contrasting reactions to DRS decisions in Kanpur Test go viral India vs Bangladesh: Indian captain Rohit Sharma's animated reactions to two crucial DRS calls on Day 1 of the second Test against Bangladesh in Kanpur have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-boss-erik-ten-hag-backs-bruno-fernandes-to-regain-form-2607229-2024-09-27",
      "headline": "Manchester United boss Erik ten Hag backs Bruno Fernandes to regain formManchester United boss Erik ten Hag has backed captain Bruno Fernandes to bounce back after his sluggish start to the new campaign. Fernandes is yet to score a goal this season for United. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}