{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-250-points-nifty-above-24500-infosys-gains-over-15-2779822-2025-09-01",
      "headline": "Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 1.5%Sensex jumps 250 points, Nifty above 24,500; Infosys gains over 1.5%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-september-15-tax-deadline-get-an-extension-2779540-2025-08-31",
      "headline": "Will September 15 tax deadline get an extension?As taxpayers rush to meet the September 15 ITR deadline, mounting portal issues and filing delays have raised the question – will the cut-off date be extended once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-rate-cut-tax-slabs-rationalisation-consumption-drive-product-categorisation-council-meet-september-2779183-2025-08-30",
      "headline": "GST rate cuts to benefit you, but categorisation will decide how muchThe GST Council, which will meet for its 56th session in New Delhi on 3–4 September, is expected to discuss widening the nil-rate slab, merging rates, and reducing GST on selected items currently taxed at 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-back-in-mumbai-atlee-film-grandmother-allu-kanakaratnam-death-2779815-2025-09-01",
      "headline": "Allu Arjun in Mumbai to join Atlee film shoot days after grandmother's deathAllu Arjun returned to Mumbai a day after completing his late grandmother Allu Kanakaratnam's rituals. The 'Pushpa' actor thanked everyone who offered condolences to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-box-office-sidharth-malhotra-jahnvi-kapoor-film-records-bumper-sunday-2779806-2025-09-01",
      "headline": "Param Sundari box office Day 3: Sidharth, Jahnvi film records bumper SundaySidharth Malhotra and Janhvi Kapoor's 'Param Sundari' earned Rs 10.25 crore on its third day. The film's overall numbers stand at Rs 26.75 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-aaradhya-ganeshotsav-mumbai-traditional-attire-2779776-2025-09-01",
      "headline": "Aishwarya Rai, daughter Aaradhya visit Ganpati pandal to seek blessings. VideoActor Aishwarya Rai and daughter Aaradhya Bachchan visited a Ganpati pandal in Mumbai on Sunday. The duo posed for selfies with fans during their visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-family-ganpati-visarjan-celebration-sisters-ayat-amid-rain-2779773-2025-09-01",
      "headline": "Salman Khan dances with niece Ayat and family at Ganpati Visarjan. Viral videoSalman Khan, on August 31, shared a video of the Ganpati Visarjan celebrations with his family. He was seen dancing with his sister Alvira and niece Ayat amid Mumbai rains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-karnataka-chief-minister-siddaramaiah-mysore-during-peddi-film-shoot-2779680-2025-08-31",
      "headline": "Ram Charan meets Siddaramaiah in Mysore during Peddi shootActor Ram Charan met Karnataka Chief Minister Siddaramaiah in Mysore on Sunday. The photos of their meeting were shared by Siddaramaiah on X. The actor is currently shooting for his upcoming film 'Peddi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/adil-hussain-meets-james-bond-actor-mads-mikkelson-venice-film-festival-praises-humility-2779648-2025-08-31",
      "headline": "Adil Hussain meets James Bond actor Mads Mikkelson in Venice, praises his humilityActor Adil Hussain met Hollywood star Mads Mikkelson at the Venice International Film Festival. The encounter highlights growing global connections in cinema and actor camaraderie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-jitendra-kumar-team-up-upcoming-project-viral-video-2779652-2025-08-31",
      "headline": "Ranbir Kapoor and Jitendra Kumar team up for upcoming project. Video goes viralActors Ranbir Kapoor and Jitendra Kumar are collaborating on an upcoming project. On Sunday, a behind-the-scenes video of the sets surfaced on social media. The video shows both actors dressed in ethnic outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-nargis-fakhri-tony-beig-wedding-viral-video-mumbai-event-2779630-2025-08-31",
      "headline": "Did Farah Khan confirm Nargis Fakhri and Tony Beig's wedding in viral video?Actor Nargis Fakhri made her first appearance with her husband Tony Beig on Sunday. At the event, director Farah Khan referred to Nargis as Tony's wife. The video from the event is now going viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/prem-sagar-ramananad-sagars-son-dies-at-84-arun-govil-sunil-lahiri-mourn-loss-2779619-2025-08-31",
      "headline": "Prem Sagar, Ramananad Sagar's son, dies at 84. Arun Govil, Sunil Lahiri mourn lossIndian film producer and 'Ramayan' director Ramanand Sagar's son Prem Sagar died at the age of 84. Actors Arun Govil and Sunil Lahiri paid their heartfelt tributes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/param-sundari-box-office-collection-sidharth-malhotra-janhvi-kapoor-2779519-2025-08-31",
      "headline": "Param Sundari box office Day 2: Sidharth-Janhvi film sees growth, earns Rs 16 crore'Param Sundari', featuring actors Sidharth Malhotra and Janhvi Kapoor, witnessed decent growth on its second day after a modest box office opening. The film was released on August 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sona-mohapatra-slams-people-defending-lollapalooza-over-lack-of-indian-artistes-2779571-2025-08-31",
      "headline": "Sona Mohapatra slams people defending Lollapalooza over lack of Indian artistesIndian singer Sona Mohapatra responded to criticism over her comments on the Lollapalooza India 2026 line-up. She called for more representation of local artistes and slammed the notion that only international acts can draw large crowds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-visits-allu-arjun-home-offers-condolences-on-grandmother-death-2779542-2025-08-31",
      "headline": "Pawan Kalyan visits Allu Arjun's home to offer condolences on grandmother's deathActor-politician Pawan Kalyan recently visited Allu Aravind, Allu Arjun's residence to offer condolences on Allu Kanakaratnam's death. The 94-year-old was Allu Aravind's mother and Allu Arjun's grandmother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-fourth-film-vishal-bharadwaj-tripti-dimri-nana-patekar-avinash-tiwary-disha-patani-farida-jalal-2779551-2025-08-31",
      "headline": "Shahid Kapoor wraps 4th film with Vishal Bhardwaj: This one's super specialActor Shahid Kapoor will next be seen in Vishal Bharadwaj's untitled film. He recently announced the wrap up of the film's shooting on Sunday on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ganesha-chaturthi-celebration-family-watch-video-2779523-2025-08-31",
      "headline": "Kapil Sharma bids goodbye to Ganesha in festive fervour with family. WatchComedian-actor Kapil Sharma shared a video capturing his family's Ganesh Chaturthi celebrations. The video highlighted his family offering prayers to Lord Ganesha, him dancing on the dhol, and the immersion of the deity's idol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhojpuri-actor-pawan-singh-apologises-to-anjali-raghav-for-touching-her-inappropriately-2779493-2025-08-31",
      "headline": "Actor Pawan Singh apologises to Anjali Raghav for touching her inappropriatelyBhojpuri actor Pawan Singh has apologised to his co-star Anjali Raghav after she accused him of inappropriately touching her without consent. Singh's reaction came after Raghav shared her decision to quit the Bhojpuri industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-salman-schools-contestants-tanya-mittal-in-tears-2779491-2025-08-31",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman schools contestants, Tanya Mittal in tearsActor Salman Khan warned Tanya Mittal about being a soft target of Pranit More on the 'Weekend Ka Vaar' episode of 'Bigg Boss 19' on Saturday. This led Tanya to break down in tears. The episode also featured romantic moments between Mridul Tiwari and Natalia Janoszek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/mahesh-babu-takes-trip-down-memory-lane-on-son-gautam-19th-birthday-2779485-2025-08-31",
      "headline": "Mahesh Babu takes trip down memory lane on son Gautam's 19th birthday. See picActor Mahesh Babu shared an adorable throwback photo on the occasion of his son Gautam's 19th birthday. He also expressed his regret at missing his birthday this year, saying it was the only one he has ever missed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pavitra-rishta-actor-priya-marathe-dies-at-38-after-battling-cancer-2779460-2025-08-31",
      "headline": "Pavitra Rishta actor Priya Marathe dies at 38 after battling cancerActor Priya Marathe, known for her work in 'Pavitra Rishta', died in Mumbai on August 31, 2025, after her prolonged battle with cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fulfils-late-mother-in-law-kanakaratnam-wish-of-donating-her-eyes-2779382-2025-08-31",
      "headline": "Chiranjeevi fulfils late mother-in-law Kanakaratnam's wish of donating her eyesActor Chiranjeevi fulfilled his late mother-in-law Allu Kanararatnam's last wish by donating her eyes following her death on Saturday. Allu Kanararatnam was legendary Telugu actor, Padma Shri Allu Ramalingaiah's wife and Allu Arjun, Ram Charan's grandmother. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-pm-modi-putin-xi-jinping-camaraderie-at-sco-summit-tianjin-shehbaz-sharif-left-on-sidelines-2779789-2025-09-01",
      "headline": "Video: PM, Putin, Xi camaraderie at SCO summit; Shehbaz Sharif left on sidelinesPrime Minister Narendra Modi, Russian President Vladimir Putin and Chinese President Xi Jinping arrived together at the Shanghai Cooperation Organisation summit in Tianjin, where they were seen shaking hands and sharing a light conversation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-live-updates-sco-summit-putin-india-china-visit-russia-tianjin-trump-tariffs-2779769-2025-09-01",
      "headline": "Live: PM Modi addresses SCO leaders' meet on Day 2 of summit in ChinaOn Day 2 of his visit, Prime Minister Narendra Modi will hold a bilateral meeting with Russian President Vladimir Putin following the Shanghai Cooperation Organisation (SCO) leaders' meeting in China's Tianjin. The two-day summit, which has drawn over 20 foreign leaders and representatives from 10 international organisations, is focused on tackling security challenges, strengthening financial frameworks, and amplifying the collective voice of Global South nations. PM Modi is also expected to engage with other world leaders on the sidelines of the meet. Stay tuned to IndiaToday.in as we bring you the latest updates on PM Modi's visit to China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-peter-navarros-another-bizarre-take-on-india-russia-oil-ties-brahmins-profiteering-2779779-2025-09-01",
      "headline": "Brahmins profiteering: Trump aide's another bizarre take on India-Russia oil tiesPeter Navarro sharpened his attack on India, accusing New Delhi of laundering Russian oil, profiteering through Brahmin elites, and destabilising global order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/xi-jinping-slams-hegemonism-bullying-trump-tariff-offensive-multilateralism-sco-summit-modi-russia-india-2779812-2025-09-01",
      "headline": "Oppose hegemonism: Xi to SCO leaders amid Trump's tariff power playChinese President Xi Jinping delivered a pointed rebuke of what he called \"bullying\" behavior in the international system at the opening of the Shanghai Cooperation Organisation (SCO) Summit amid US President Donald Trump's tariff offensive."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/modi-putin-hug-sco-summit-china-visit-trump-tariffs-xi-jinping-india-russia-oil-deal-2779805-2025-09-01",
      "headline": "Always a delight: PM Modi, Putin share a hug at SCO meet; send message to TrumpThe hug comes just hours before their scheduled bilateral meeting on the sidelines of the summit. Officials said the talks would focus on energy ties, defence cooperation, and the evolving global order. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-molested-robbed-inside-pg-in-suddaguntepalya-accused-masked-man-caught-on-cctv-2779808-2025-09-01",
      "headline": "Bengaluru woman molested, robbed of cash inside PG; CCTV shows accused fleeingA woman staying in a paying guest accommodation in Bengaluru was allegedly molested and robbed by an intruder, with CCTV footage showing him fleeing after being chased out by the woman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shanghai-cooperation-organisation-summit-day-2-tianjin-joint-declaration-pm-modi-putin-meet-cross-border-terrorism-2779775-2025-09-01",
      "headline": "Spotlight turns to Modi-Putin meet, US tariffs, terror at SCO summit Day 2The most closely watched moment today is expected to be PM Modi's meeting with Russian President Vladimir Putin, set against the backdrop of his recent phone call with Ukrainian President Volodymyr Zelenskyy and Trump's decision to target Delhi with additional tariffs over its purchase of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/lollipop-linguistic-terror-how-mamata-is-upping-the-rhetoric-against-bjp-ec-2779164-2025-08-30",
      "headline": "'Lollipop, linguistic terror': How Mamata is upping the rhetoric against BJP, ECThe escalating face-off between the Trinamool Congress and BJP indicates how the 2026 Bengal polls could become a referendum not only on governance but identity and federal authority"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/silent-standoff-pm-modi-shehbaz-sharif-keep-their-distance-at-china-summit-2779777-2025-09-01",
      "headline": "Silent standoff: PM Modi, Shehbaz Sharif keep their distance at China summitPrime Minister Narendra Modi and Pakistan's Shehbaz Sharif kept their distance at the Shanghai Cooperation Organisation summit in Tianjin, with a banquet photo showing them facing away from each other and a family photo placing them far apart. The distancing came against the backdrop of India's Operation Sindoor after April 22 Pahalgam terror attack, underscoring tense ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-8-updates-carlos-alcaraz-novak-djokovic-aryna-sabalenka-2779691-2025-08-31",
      "headline": "Day 8 Highlights: Djokovic and Sabalenka into quarters, Rybakina knocked outUS Open 2025 Day 8 Live Updates: Novak Djokovic and Aryna Sabalenka have moved to the quarterfinals of the US Open after comfortable fourth-round victories. Earlier in the day, Taylor Fritz won. Jessica Pegula beat Ann Li to qualify for the quarterfinals. Barbora Krejcikova through to the quarter-finals. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mahua-moitra-lashes-out-against-bjp-over-remark-against-home-minister-amit-shah-says-idiots-dont-understand-idioms-2779736-2025-08-31",
      "headline": "Idiots don't understand idioms: Mahua Moitra slams BJP over Amit Shah remark rowMahua Moitra, while reacting to an FIR lodged against her by Chhattisgarh police, lashed out at the BJP and said that she was using an idiom while making the remark that Home Minister Amit Shah's \"head should be cut off and put on the table.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-china-sco-meet-pm-modi-meets-turkey-president-recep-tayyip-erdogan-in-china-2779739-2025-08-31",
      "headline": "Handshake and a pat: PM meets Turkey's Erdogan amid strained ties after Op SindoorThe cordial exchange stands out amid simmering tensions between India and Turkey, especially in the aftermath of Operation Sindoor, during which Turkey reportedly aligned itself with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-family-ganpati-visarjan-celebration-sisters-ayat-amid-rain-2779773-2025-09-01",
      "headline": "Salman Khan dances with niece Ayat and family at Ganpati Visarjan. Viral videoSalman Khan, on August 31, shared a video of the Ganpati Visarjan celebrations with his family. He was seen dancing with his sister Alvira and niece Ayat amid Mumbai rains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-china-reset-and-the-promise-of-connectivity-2779437-2025-08-31",
      "headline": "India-China reset and the promise of connectivityIndia's rich trade history is shaping its future ties with China and Asia. Strengthening land connectivity and business investments could transform regional relations and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/meet-xiao-he-robot-at-seo-summit-answers-questions-on-india-china-ties-2779708-2025-08-31",
      "headline": "Meet Xiao He: Robot at SCO Summit answers questions on India-China tiesIndia Today's Gaurav Sawant, who is in China for the Shanghai Cooperation Organisation (SCO) summit in Tianjin, interacted with Chinese robots on display. The robots were answering questions and performing tasks through the use of Artificial Intelligence and Robotic technology. The robots were asked questions about the ongoing SCO summit to which they answered questions flawlessly, displaying immense technological advancement. Robots on the display were also seen performing several tasks at the summit venue.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-trick-shot-2779772-2025-09-01",
      "headline": "Carlos Alcaraz 'playing to the crowd' with outrageous trick shot in US OpenCarlos Alcaraz had the US Open crowd on its feet with a stunning behind-the-back trick shot. After the game, Alcaraz reacted to the viral moment, admitting that he practices those ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-noivak-djokovic-big-serves-quarterfinal-record-2779796-2025-09-01",
      "headline": "Serve and surge: Novak Djokovic storms into record US Open quarterfinalsNovak Djokovic advanced to the US Open quarter-finals with a dominant straight-sets win over Jan-Lennard Struff. Despite carrying niggles, his serving prowess propelled him into the last eight for the 14th time in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/strong-62-magnitude-quake-hits-southeastern-afghanistan-region-glbs-2779752-2025-09-01",
      "headline": "9 killed as 6.0 magnitude earthquake jolts Afghanistan, tremors felt in DelhiThe quake was felt across Afghanistan, Pakistan and northern India -- including Delhi-NCR -- where residents reported strong tremors. Buildings shook, prompting people to rush outside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/panchsheel-principles-of-peaceful-coexistence-must-be-cherished-promoted-jinping-2779722-2025-08-31",
      "headline": "Panchsheel must be cherished: Xi invokes India-China peace doctrine after meeting PMThe Agreement on Trade and Intercourse with the Tibet Region introduced the Five Principles of Peaceful Coexistence that would have formulated a framework for both countries to take their relationship forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-professor-muqabala-dance-video-goes-viral-wrong-profession-says-internet-2779469-2025-08-31",
      "headline": "Bengaluru professor's Muqabala dance video goes viral. Wrong profession, says InternetIn the video, Professor Pushpa Raj grooves to Prabhu Deva's hit track, 'Muqabala', leaving students cheering him on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/urgent-action-bold-innovation-the-race-to-rescue-indias-disappearing-glaciers-2778902-2025-08-31",
      "headline": "The race to rescue India's disappearing glaciersGlaciers across the world are witnessing unprecedented change as the planet becomes warmer and temperatures continue to climb under the influence of human-induced climate change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-march-against-immigration-indians-targeted-more-indians-in-5-years-than-greeksand-italians-in-100-2779585-2025-08-31",
      "headline": "More Indians in 5 years...: Thousands in Australia march against immigrationA pre-event Facebook post carrying the promotional material also singled out Indians, whose numbers doubled from 2013 to 2023 to reach about 845,800, according to census data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-completely-destroyed-without-tariffs-trump-blasts-courts-ruling-glbs-2779763-2025-09-01",
      "headline": "US would be completely destroyed without tariffs: Trump blasts court's rulingWhile the court ruled against the broad application of tariffs, it did not immediately invalidate them. The administration has until mid-October to appeal the decision to the Supreme Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-ban-by-government-hits-industry-with-mpl-to-sack-employees-in-india-with-revenue-stopped-2779698-2025-08-31",
      "headline": "MPL to layoff 60% India staff after money-based gaming ban: ReportPrime Minister Narendra Modi's government this month banned online paid games, citing financial and addiction risks, especially among youth, leading to a shutdown of many gaming apps offering paid fantasy cricket, rummy and poker games."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-taylor-townsend-son-2779819-2025-09-01",
      "headline": "Watch: Fiery Taylor Townsend signs off US Open with cutest story about son AJTaylor Townsend capped off her US Open journey with a loss to Barbora Krejcikova in the 4th round of the US Open. After the game, Townsend shared a heartwarming story about her son AJ.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-noivak-djokovic-big-serves-quarterfinal-record-2779796-2025-09-01",
      "headline": "Serve and surge: Novak Djokovic storms into record US Open quarterfinalsNovak Djokovic advanced to the US Open quarter-finals with a dominant straight-sets win over Jan-Lennard Struff. Despite carrying niggles, his serving prowess propelled him into the last eight for the 14th time in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carloz-alcaraz-jannik-sinner-rivalry-2779786-2025-09-01",
      "headline": "Sincaraz rivalry: Spaniard says they are fighting for great things in tennisAfter securing his place in the quarterfinals of the US Open, Carlos Alcaraz opened up on his rivalry with Jannik Sinner. He says that it is important to have high-stakes matches to keep the morale of the sport high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-2025-india-craig-fulton-olympic-gold-world-cup-ambitions-2779766-2025-09-01",
      "headline": "In Craig Fulton we trust: India coach lays out Olympic gold, World Cup ambitionsIndia coach Craig Fulton has seen an overhaul of the system since his appointment in 2023. Despite the recent noise about his position, Fulton has laid out big goals with the Indian team, which include Olympic success and a World Cup win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-trick-shot-2779772-2025-09-01",
      "headline": "Carlos Alcaraz 'playing to the crowd' with outrageous trick shot in US OpenCarlos Alcaraz had the US Open crowd on its feet with a stunning behind-the-back trick shot. After the game, Alcaraz reacted to the viral moment, admitting that he practices those ahead of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-final-2025-match-report-nitish-rana-2779767-2025-09-01",
      "headline": "Captain Nitish Rana powers West Delhi to DPL 2025 titleDPL 2025: West Delhi Lions secured the Delhi Premier League 2025 title by defeating Central Delhi Kings by six wickets. Nitish Rana's unbeaten 79 proved decisive in the final"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-taylor-townsend-heartbreak-barbora-krejcikova-fourth-round-2779759-2025-09-01",
      "headline": "Barbora Krejcikova ends Taylor Townsend's fairytale run to reach US Open quartersBarbora Krejcikova staged a remarkable comeback to defeat Taylor Townsend at the US Open. Her resilience under pressure kept her alive in a thrilling three-set encounter that captivated fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/india-move-closer-to-super-four-with-3-2-win-over-japan-in-asia-cup-2779757-2025-09-01",
      "headline": "India move closer to Super Four with 3-2 win over Japan in Asia CupIndia finds itself on the brink of qualifying for the Super Fours following their win over Japan. China also had a dominant display against Kazakhstan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jiri-lehecka-us-open-quarterfinals-2023-2779755-2025-09-01",
      "headline": "Carlos Alcaraz eases past Rinderknech, Jiri Lehecka into maiden quartersCarlos Alcaraz advanced to the US Open quarterfinals with a commanding win over Arthur Rinderknech. Jiri Lehecka also booked his maiden quarterfinal spot, setting up an exciting clash in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-us-open-behind-the-back-shot-stuns-fans-2779753-2025-09-01",
      "headline": "Watch: Carlos Alcaraz stuns US Open crowd with outrageous behind-the-back trick shotCarlos Alcaraz executed a stunning behind-the-back shot during his US Open fourth-round match against Arthur Rinderknech. The incredible shot electrified the crowd and highlighted Alcaraz's flair as he chases a record Grand Slam quarterfinal achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u17-womens-saff-championship-bangladesh-loss-crying-unbeaten-run-ends-2779749-2025-09-01",
      "headline": "India U17 Women win SAFF Championship title but tears flow after loss to BangladeshIndia U17 Women crowned SAFF champions despite 4-3 loss to Bangladesh, ending unbeaten run. Anushka Kumari shines as top scorer, Julan leads captaincy, and team now shifts focus to AFC U17 Women's Asian Cup qualifiers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-taylor-townsend-heartbreak-barbora-krejcikova-fourth-round-2779759-2025-09-01",
      "headline": "Barbora Krejcikova ends Taylor Townsend's fairytale run to reach US Open quartersBarbora Krejcikova staged a remarkable comeback to defeat Taylor Townsend at the US Open. Her resilience under pressure kept her alive in a thrilling three-set encounter that captivated fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/india-move-closer-to-super-four-with-3-2-win-over-japan-in-asia-cup-2779757-2025-09-01",
      "headline": "India move closer to Super Four with 3-2 win over Japan in Asia CupIndia finds itself on the brink of qualifying for the Super Fours following their win over Japan. China also had a dominant display against Kazakhstan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jiri-lehecka-us-open-quarterfinals-2023-2779755-2025-09-01",
      "headline": "Carlos Alcaraz eases past Rinderknech, Jiri Lehecka into maiden quartersCarlos Alcaraz advanced to the US Open quarterfinals with a commanding win over Arthur Rinderknech. Jiri Lehecka also booked his maiden quarterfinal spot, setting up an exciting clash in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-us-open-behind-the-back-shot-stuns-fans-2779753-2025-09-01",
      "headline": "Watch: Carlos Alcaraz stuns US Open crowd with outrageous behind-the-back trick shotCarlos Alcaraz executed a stunning behind-the-back shot during his US Open fourth-round match against Arthur Rinderknech. The incredible shot electrified the crowd and highlighted Alcaraz's flair as he chases a record Grand Slam quarterfinal achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u17-womens-saff-championship-bangladesh-loss-crying-unbeaten-run-ends-2779749-2025-09-01",
      "headline": "India U17 Women win SAFF Championship title but tears flow after loss to BangladeshIndia U17 Women crowned SAFF champions despite 4-3 loss to Bangladesh, ending unbeaten run. Anushka Kumari shines as top scorer, Julan leads captaincy, and team now shifts focus to AFC U17 Women's Asian Cup qualifiers."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}