{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-donald-trump-trade-talk-dalal-street-2768343-2025-08-08",
      "headline": "Sensex cracks below 80,000 as tariff fears rattle stock marketsThe S&P BSE Sensex fell 765.47 points to close below the psychological 80,000 mark, while the NSE Nifty50 dropped 232.85 points to settle at 24,363.30. Midcap and smallcap stocks witnessed deeper cuts, reflecting growing investor unease over the evolving global trade scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-not-a-dead-economy-set-to-become-3rd-largest-in-world-amitabh-kant-2768334-2025-08-08",
      "headline": "India not a dead economy, poised to become 3rd-largest in world: Amitabh KantAfter Donald Trump's 'dead economy' jibe, Amitabh Kant calls India a resilient, reform-driven powerhouse on track to become the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-surge-could-stall-indias-manufacturing-momentum-warns-moodys-2768326-2025-08-08",
      "headline": "US tariff surge could stall India's manufacturing momentum, warns Moody'sOn Thursday, US President Donald Trump signed an Executive Order that adds a 25% tariff on Indian goods. This move comes in response to India's continued import of oil from Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "India's fuel bill may rise $12 billion by FY27 if Russian oil imports stop: SBIRussia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-high-of-rs-102-lakh-is-it-the-right-time-to-buy-bullion-rates-2768222-2025-08-08",
      "headline": "Gold hits record high of Rs 1.02 lakh. Is it the right time to buy?The rally in gold comes amid growing concerns over new tariffs announced by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arvind-panagariya-bets-on-these-states-to-leads-indias-growth-by-2047-2768268-2025-08-08",
      "headline": "Arvind Panagariya bets on these states to leads India's growth by 2047Arvind Panagariya explained that India doesn't need to push growth artificially. He believes market forces are already at work, shaping the country's growth naturally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/nitin-gadkari-dismisses-concerns-over-ethanol-blended-petrol-as-misinformation-2768238-2025-08-08",
      "headline": "Nitin Gadkari dismisses concerns over ethanol-blended petrol as misinformationUnion Minister Nitin Gadkari firmly defended the government's ethanol-blended petrol initiative, stating that no complaints have surfaced about vehicle issues. Speaking at the India@100 Summit, he challenged critics to cite a single case of malfunction and accused them of spreading baseless misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Nitin Gadkari's dare on E20 petrol row: Show a single instance of cars facing issueSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-are-on-a-dream-run-after-listing-should-you-buy-now-2768195-2025-08-08",
      "headline": "NSDL shares are on a dream run after listing. Should you buy now?The NSDL stock, which made its market debut on August 6, has now risen for three straight sessions—prompting IPO investors to ask: is it time to book profits or hold on?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-save-tax-by-claiming-hra-for-rent-paid-to-parents-read-this-first-2768173-2025-08-08",
      "headline": "Want to save tax by claiming HRA for rent paid to parents? Read this firstAccording to tax rules, salaried individuals can claim HRA even if they're living in their parents' home. But the rent must be real, paid regularly, and documented properly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-may-approve-rs-30000-crore-support-to-maintain-lpg-price-stability-2768148-2025-08-08",
      "headline": "Government may approve Rs 30,000 crore support to maintain LPG price stabilityThis move is aimed at helping oil marketing companies recover losses they have been facing on domestic LPG sales due to high international prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-down-500-points-key-factors-donald-trump-us-trade-talk-threat-tariffs-2768131-2025-08-08",
      "headline": "Sensex tumbles 500 points: Why is the stock market down today?At 10:07 am, the Sensex was down 496.21 points at 80,127.05, while the Nifty stood at 24,444.55, lower by 151.60 points."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andhera-trailer-surveen-chawla-prakajta-karanvir-malhotra-face-sinister-evil-2768327-2025-08-08",
      "headline": "Andhera trailer: Surveen Chawla, Prakajta and Karanvir Malhotra face sinister evilThe trailer of 'Andhera' featuring Surveen Chawla, Prajakta Koli, and Karanvir Malhotra is out. The eight-episode series will premiere on Prime Video on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-one-thousand-miles-song-music-video-11-years-after-launch-2768301-2025-08-08",
      "headline": "Honey Singh releases One Thousand Miles music video 11 years after its launchRapper-singer Honey Singh finally released the video for his song 'One Thousand Miles' on Friday. The audio, which was a part of Singh's 'Desi Kalaakar' album, was released in 2014. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jatadhara-teaser-sudheer-babu-selflessness-clashes-with-sonakshi-sinha-greed-2768278-2025-08-08",
      "headline": "Jatadhara teaser: Sudheer Babu's selflessness clashes with Sonakshi Sinha's greedThe teaser of Sonakshi Sinha and Sudheer Babu's 'Jatadhara' released today. The mythical supernatural thriller is directed by Venkat Kalyan and Abhishek Jaiswal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chhoriyan-chali-gaon-indian-reality-tv-show-rannvijay-singha-anita-hassanandani-sumukhi-suresh-2768134-2025-08-08",
      "headline": "How Chhoriyan Chali Gaon is changing the way we look at Indian reality TV'Chhoriyan Chali Gaon', a new show on Zee5, is bringing a refreshing twist to Indian reality TV. It features 11 celebrities from city life adapting to a rural village in Madhya Pradesh. Some of the contestants include actor Anita Hassanandani, comedian Sumukhi Suresh and influencer duo Chinki-Minki.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-shoots-with-janhvi-kapoor-sidharth-malhotra-amid-lawrence-bishnoi-gang-threats-2768323-2025-08-08",
      "headline": "Kapil Sharma shoots with Janhvi Kapoor-Sidharth Malhotra amid Bishnoi gang threatsIt was business as usual for comedian Kapil Sharma as he began shooting with Janhvi Kapoor and Sidharth Malhotra for his show a day after gunshots were fired at his restaurant in Canada by the members of the Bishnoi gang. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/isha-talwar-criticises-casting-director-shanoo-sharma-over-unusual-audition-demand-2768178-2025-08-08",
      "headline": "Isha Talwar criticises casting director Shanoo Sharma's weird audition demandActor Isha Talwar shared a decade-old experience where casting director Shanoo Sharma asked her to perform a crying scene in a busy restaurant, which deeply affected her confidence. She advises newcomers to stand firm against unreasonable demands during auditions and emphasises the need for respectful casting environments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janhvi-kapoor-sidharth-malhotra-steamy-chemistry-wins-over-rain-param-sundari-song-bheegi-saree-watch-2768285-2025-08-08",
      "headline": "Janhvi-Sidharth's steamy chemistry wins over rain in Bheegi Saree. WatchSidharth Malhotra and Janhvi Kapoor star in the newly released monsoon song 'Bheegi Saree', marking a return for Adnan Sami alongside Shreya Ghoshal's vocals in 'Param Sundari'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-rajinikanth-50-year-tribute-video-new-runtime-2768286-2025-08-08",
      "headline": "Rajinikanth's Coolie to get 50-year tribute video, new runtime revealedSuperstar Rajinikanth's 'Coolie' will hit theatres on August 14. While the film was certified with an A certificate, the team decided to make a few additions to the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-introduces-family-faces-fantastic-four-collection-arbaaz-khan-sohail-khan-2768199-2025-08-08",
      "headline": "Salman Khan introduces family as faces of Fantastic Four collectionActor Salman Khan's clothing label has partnered with Marvel India to launch an exciting new collection inspired by the 'Fantastic Four' film. The actor shared a post online with his family members. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nishaanchi-teaser-anurag-kashyap-aaishvary-thackeray-debut-with-double-role-desi-entertainer-2768249-2025-08-08",
      "headline": "Nishaanchi teaser: Anurag Kashyap introduces Aaishvary in desi action entertainerThe teaser for 'Nishaanchi', starring debutant Aaishvary Thackeray, was released on Friday, promising action and drama. Directed by Anurag Kashyap, the action-drama is slated for a theatrical release on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-season-2-episode-10-written-update-big-drama-unfolds-before-pari-engagement-2768270-2025-08-08",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Ep 10: Big drama unfolds before Pari's engagementAt Shanti Niketan, the air is thick with excitement as Pari's engagement preparations begin. But while the family bonds over bhajiyas and dance, a deleted sketch and a secret threaten to change everything."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-meet-premanand-maharaj-shares-pics-from-mathura-visit-2768255-2025-08-08",
      "headline": "Gurmeet-Debina meet Premanand Maharaj, shares pics from Mathura visitTelevision couple Gurmeet Choudhary and Debina Bonnerjee recently met spiritual guru Premananda Maharaj in Vrindavan. The couple shared pictures and videos from their trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-rocks-nose-pins-and-braids-as-jadal-his-boldest-look-in-the-paradise-2768237-2025-08-08",
      "headline": "Nani rocks nose pins and braids as Jadal, his boldest look in The ParadiseNani's first look from 'The Paradise' reveals a fierce new character as Jadal. Directed by Srikanth Odela, the film promises high visual impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-warns-us-tariffs-impact-india-economy-art-pharma-textiles-2768190-2025-08-08",
      "headline": "It's going to affect each one of us: John Abraham reacts to Trump tariffsBollywood actor John Abraham discusses the effects of US tariffs on India, emphasising their impact on the art sector and the potential economic challenges ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mrunal-thakur-vibes-dhanush-song-follows-actor-sisters-on-instagram-amid-dating-rumours-2768213-2025-08-08",
      "headline": "Mrunal Thakur vibes to Dhanush's song, follows his sisters on InstagramIn a throwback video, Mrunal Thakur can be seen vibing to Dhanush's song from 'Idli Kadai'. Amid dating rumours, the 'Sita Ramam' actor followed Dhanush's sisters on Instagram."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-17-year-old-son-hridaan-chased-by-paparazzi-internet-calls-them-creeps-2768211-2025-08-08",
      "headline": "Hrithik's 17-year-old son Hridaan chased by paps, internet slams creepy behaviourHrithik Roshan's son Hridaan steps out of a building but, startled by photographers calling out to him, quickly runs away. The video of the incident has gone viral. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/together-review-allison-brie-dave-francos-creepy-cult-horror-gets-under-your-skin-2768179-2025-08-08",
      "headline": "Together review: Allison Brie, Dave Franco's creepy cult horror gets under your skinRelease Date:Wed Jul 30, 2025'Together' is a unique horror film that explores the complexities of a troubled relationship through a disturbing body horror metaphor, blending dark comedy with emotional depth. With strong performances and striking visuals, it offers a memorable but unsettling cinematic experience that stays with you long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-anushka-sharma-ate-snake-gourd-dish-on-their-anniversary-all-about-it-2768183-2025-08-08",
      "headline": "Virat Kohli-Anushka Sharma ate snake gourd dish on their anniversary - all about itVirat Kohli and Anushka Sharma's private chef revealed their dietary habits and how he tweaks ingredients in foreign dishes to fit their likes and dislikes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-exudes-royalty-as-kanakavathi-in-kantara-chapter-1-poster-out-2768135-2025-08-08",
      "headline": "Rukmini Vasanth exudes royalty as Kanakavathi in Kantara Chapter 1. Poster outActor Rukmini Vasanth joined Rishab Shetty's much-awaited film 'Kantara Chapter 1' on Friday. Her first-look poster, which exuded royalty, was shared by Shetty on social media. 'Kantara: Chapter 1' will release in cinemas on October 2. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/rahul-gandhi-ev-vote-fraud-bengaluru-mahadevapura-congress-india-today-muni-reddy-garden-votes-2768207-2025-08-08",
      "headline": "80 voters in 10 sq ft house: India Today ground check on Rahul Gandhi's claimAfter Rahul Gandhi's explosive vote fraud claims, India Today's ground check in Bengaluru Central found 80 voters registered at a 10-15 sq ft house in Muni Reddy Garden. The current occupant denied links to them. The property's owner admitted many former tenants still return to vote."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Nitin Gadkari's dare on E20 petrol row: Show a single instance of cars facing issueSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-withdraws-income-tax-bill-2025-new-bill-to-introduced-in-lok-sabha-on-august-11-sources-2768336-2025-08-08",
      "headline": "Government withdraws Income Tax Bill 2025, new bill to be tabled on August 11A new version of the Income Tax Bill, incorporating most of the recommendations made by the Select Committee chaired by Baijayant Panda, will be introduced on Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "India's fuel bill may rise $12 billion by FY27 if Russian oil imports stop: SBIRussia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/regang-la-battle-india-china-war-1962-ladakh-major-shaitan-singh-120-bahadur-army-soldiers-pla-farhan-akhtar-movie-2768180-2025-08-08",
      "headline": "Frozen bodies holding guns: When 120 bahadur took on 5,000 Chinese soldiersJust 120 Indian soldiers, led by Major Shaitan Singh Bhati, beat back 5,000 Chinese troopers at Rezang La in 1962, preventing China's takeover of Ladakh. A search party found frozen bodies of Indian soldiers still holding guns, showing the last stand in which 110 of the 120 Indians were killed. Revisiting the legendary battle of the 1962 Indo-China war, which is the subject of Farhan Akhtar's 120 Bahadur.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/10-killed-33-missing-in-flash-floods-in-northwestern-china-president-xi-calls-for-all-out-rescue-ops-report-2768338-2025-08-08",
      "headline": "10 killed, 33 missing after flash floods in China, Xi orders all-out rescue ops10 killed, 33 missing in flash floods in northwestern China; President Xi calls for all-out rescue ops: Report"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariffs-india-russia-putin-india-visit-modi-china-sco-summit-tighten-ties-push-allies-away-2767834-2025-08-08",
      "headline": "India-Russia bear hug is another Trump self-goalThough India and Russia had strong ties, New Delhi was trying to balance that as relations with the US were on the upswing. However, Donald Trump's tariff bazooka might see India's Russia hug get tighter. Russian President Putin is set to visit New Delhi later this year. Trump has, ironically, driven India towards Russia like the US did with its arms embargo in the mid-60s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-sets-aside-own-order-barring-high-court-judge-from-hearing-criminal-cases-2768154-2025-08-08",
      "headline": "Didn't want to cause embarrassment: Top court recalls order against Allahabad judgeAfter the order came under criticism, the Chief Justice of India BR Gavai, wrote to Justice Pardiwala's bench requesting the reconsideration of the strictures against the High Court Judge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/how-uniforms-and-stationery-are-quietly-draining-parents-wallets-2768314-2025-08-08",
      "headline": "How uniforms and stationery are quietly draining parents' walletsParents across India are struggling with steep hikes in prices of mandatory school uniforms and stationery, despite official directives to curb overcharging."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-additional-trump-tariffs-will-be-a-big-pain-point-for-india-2767760-2025-08-07",
      "headline": "Why additional Trump tariffs will be a big pain point for IndiaThe extra 25 per cent 'ad valorem' duty on Indian imports—seen as a new negotiating tactic by the Trump administration—will have a sizeable impact on India's growth in the short term"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-state-education-policy-rejects-neps-three-language-formula-and-entrance-exams-ssa-funds-2768168-2025-08-08",
      "headline": "Tamil Nadu unveils State Education Policy, counters NEP with two-language systemTamil Nadu Chief Minister MK Stalin has released the State Education Policy, drafted by a 14-member panel led by Justice Murugesan. The policy rejects key NEP provisions, retains the two-language policy, and prioritises science, AI, and English."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/rahul-gandhi-bengaluru-congress-karnataka-ec-vote-theft-fraud-lok-sabha-mahadevpura-2768271-2025-08-08",
      "headline": "Time lagega, magar pakdenge: Rahul Gandhi vows to expose poll theft by BJP, ECRahul Gandhi in Bengaluru alleged that the BJP, with EC's help, stole the 2024 Lok Sabha polls in Karnataka through large-scale voter list manipulation, and accused the EC of hiding evidence by denying electronic data and polling videos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-woman-films-instagram-reel-on-roof-of-moving-mahindra-thar-video-viral-case-registered-2768231-2025-08-08",
      "headline": "Woman films reel on roof of moving Thar in Gurugram, case registeredThe incident, which took place on Gurugram's National Highway-48, has sparked widespread outrage, highlighting the growing trend of traffic violations in the name of online fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/at-gpt-5-launch-sam-altman-says-incredible-india-may-surpass-us-as-openais-top-market-2768252-2025-08-08",
      "headline": "At GPT-5 launch, Sam Altman says incredible India may surpass US as OpenAI's top marketOpenAI has launched its latest artificial intelligence model, GPT-5, and at the event, CEO Sam Altman made a striking observation about India's growing role in the AI space. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/murder-of-actor-huma-qureshis-brother-on-cctv-wife-seen-trying-to-intervene-2768122-2025-08-08",
      "headline": "Caught on CCTV: Huma Qureshi's cousin thrashed, killed as wife tried to interveneActor Huma Qureshi's cousin Asif was stabbed over a parking spot dispute in Delhi. He was then taken to the nearest hospital in a critical condition, where the doctors declared him dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cbi-probe-kolkata-trainee-doctor-murder-withdrawal-protests-2768315-2025-08-08",
      "headline": "Unacceptable: RG Kar victim's parents claim CBI threatened to withdraw from probeParents of the trainee doctor accused the CBI of failing to deliver justice one year after her rape and murder. They demanded the probe agency be disbanded amid allegations of corruption and political pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-at-50-making-of-gabbar-singh-bollywood-greatest-villain-amjad-khan-290-07-08-2025",
      "headline": "Sholay@50: The Making of Gabbar, Bollywood's Greatest VillainWhat made Gabbar Singh the greatest villain in Bollywood history? It wasn't just Amjad's performance, though his raw intensity was undeniable. It was the magic of Salim-Javed's writing, Sippy's vision, and Amjad's ability to transcend the archetype of the Bollywood villain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/failed-neet-thrice-iit-madras-student-data-scientist-success-story-sanjay-b-2768260-2025-08-08",
      "headline": "No JEE, no CS, failed NEET thrice: IIT Madras student now data scientistAfter three failed NEET attempts, Sanjay B is now a data scientist at Syngenta, thanks to the IIT Madras BS in Data Science and Applications online degree that doesn't need you to crack JEE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/signed-sealed-and-delivered-no-more-india-says-goodbye-to-registered-post-2768264-2025-08-08",
      "headline": "Signed, sealed and delivered- No More: India says goodbye to 'Registered Post'Farewell to a service that carried love, trust, and legal weight for half a century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/paneer-adulteration-punjab-quality-test-homemade-dairy-advised-2768277-2025-08-08",
      "headline": "Paneer and ghee most adulterated foods: Is homemade the safer option?Punjab's paneer samples fail large-scale quality tests, raising health concerns. Authorities urge consumers to prefer homemade or certified dairy to avoid adulterants and misleading products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-vs-jasprit-bumrah-2768137-2025-08-08",
      "headline": "Cheer for Mohammed Siraj, but don't jeer Jasprit Bumrah England vs India: Mohammed Siraj's brilliance at The Oval deserves every decibel of praise. But that celebration need not come at the cost of Jasprit Bumrah, the architect of several Indian triumphs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/uttarkashi-tragedy-flash-floods-kedarnath-disaster-lessons-landslide-warning-2767838-2025-08-08",
      "headline": "Uttarkashi: Did we not learn anything from the 2013 Kedarnath disaster?Despite rescue operations, remote communities remain vulnerable due to inadequate alert systems and unscientific infrastructure activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/intel-ceo-rejects-donald-trumps-resignation-demand-defends-record-and-commitment-to-us-security-2768239-2025-08-08",
      "headline": "Intel CEO rejects Donald Trump's resignation demandIntel CEO Lip-Bu Tan has pushed back against calls from US President Donald Trump to step down, saying he remains committed to the company and to protecting US national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/dining-solo-might-be-the-best-thing-you-do-this-week-2767696-2025-08-08",
      "headline": "Dining solo might be the best thing you do this weekNext time you feel awkward about going on a solo date, know that eating alone can be really refreshing. It helps you slow down, enjoy your food, and connect with yourself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jatadhara-teaser-sudheer-babu-selflessness-clashes-with-sonakshi-sinha-greed-2768278-2025-08-08",
      "headline": "Jatadhara teaser: Sudheer Babu's selflessness clashes with Sonakshi Sinha's greedThe teaser of Sonakshi Sinha and Sudheer Babu's 'Jatadhara' released today. The mythical supernatural thriller is directed by Venkat Kalyan and Abhishek Jaiswal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/rajinikanth-fans-push-each-other-run-to-get-coolie-tickets-at-kerala-theatre-2768311-2025-08-08",
      "headline": "Rajinikanth's fans run and push each other to get Coolie tickets at Kerala theatreRajinikanth's fans ran pushing each other to grab tickets for 'Coolie' at a Kerala theatre. The advance bookings for the film opened in Kerala today, August 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/isha-talwar-criticises-casting-director-shanoo-sharma-over-unusual-audition-demand-2768178-2025-08-08",
      "headline": "Isha Talwar criticises casting director Shanoo Sharma's weird audition demandActor Isha Talwar shared a decade-old experience where casting director Shanoo Sharma asked her to perform a crying scene in a busy restaurant, which deeply affected her confidence. She advises newcomers to stand firm against unreasonable demands during auditions and emphasises the need for respectful casting environments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janhvi-kapoor-sidharth-malhotra-steamy-chemistry-wins-over-rain-param-sundari-song-bheegi-saree-watch-2768285-2025-08-08",
      "headline": "Janhvi-Sidharth's steamy chemistry wins over rain in Bheegi Saree. WatchSidharth Malhotra and Janhvi Kapoor star in the newly released monsoon song 'Bheegi Saree', marking a return for Adnan Sami alongside Shreya Ghoshal's vocals in 'Param Sundari'. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/harry-kane-praises-heung-min-son-partnership-wishes-james-maddison-well-2768304-2025-08-08",
      "headline": "Harry Kane praises special Heung-min Son following ex-team-mate's Spurs exitBayern Munich striker Harry Kane paid tribute to his former team-mate Heung-min Son following his departure from Tottenham Hotspur. Son joined Los Angeles FC on Wednesday in a record-breaking Major League Soccer transfer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-pitch-rating-anderson-tendulkar-trophy-leeds-good-2768297-2025-08-08",
      "headline": "ICC pitch ratings for England vs India revealed: Only Leeds gets good ratingThree pitches used in the Anderson–Tendulkar Trophy failed to get the highest ICC rating. The Leeds pitch at Headingley stood out as the only one rated very good. India and England shared the trophy after a drawn series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bob-carter-new-zealand-cricket-coach-steps-down-after-21-years-2768287-2025-08-08",
      "headline": "Bob Carter steps down as New Zealand Cricket high-performance coach after 21 yearsFormer New Zealand Women's head coach Bob Carter is stepping away from his role as New Zealand Cricket's (NZC) high-performance coach after 21 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-moeen-ali-joe-root-david-warner-comments-2768254-2025-08-08",
      "headline": "He's a bit of a clown: Moeen Ali says Warner's mind games won't work on Joe RootFormer England cricketer Moeen Ali dismissed David Warner's take on Joe Root's chances of scoring big in the Ashes in Australia later this year. Root is yet to score a hundred Down Under."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ben-shelton-wins-national-bank-open-youngest-american-masters-champion-2768226-2025-08-08",
      "headline": "Ben Shelton wins biggest crown of career, elated with steely show ahead of US OpenBen Shelton claimed his first ATP 1000 title by winning the National Bank Open in Toronto. This victory makes him the youngest American Masters 1000 champion since 2004 and positions him as a strong contender ahead of the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-rajasthan-royals-vaibhav-suryavanshi-kkr-aakash-chopra-2768208-2025-08-08",
      "headline": "Sanju Samson to leave RR due to Vaibhav Suryavanshi's rise? Ex-opener explainsFormer India opener Aakash Chopra believes that Vaibhav Suryavanshi's rise might've played a role in Sanju Samson's reported departure from Rajasthan Royals (RR). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-london-latest-photo-grey-beard-fans-speculation-2768200-2025-08-08",
      "headline": "Virat Kohli spotted in London with greying beard, sparking speculation among fansFormer India captain Virat Kohli was spotted in London sporting a salt-and-pepper look. A section of fans took note of his greying beard, linking it to a remark he made earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-pak-matthew-forde-ruled-out-of-odi-series-johann-layne-2768181-2025-08-08",
      "headline": "WI vs PAK: Matthew Forde ruled out of ODI series due to shoulder injuryWest Indies fast bowler Matthew Forde has been ruled out of the ODI series against Pakistan after dislocating his shoulder practice session. He has been replaced by Johann Layne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-vs-jasprit-bumrah-2768137-2025-08-08",
      "headline": "Cheer for Mohammed Siraj, but don't jeer Jasprit Bumrah England vs India: Mohammed Siraj's brilliance at The Oval deserves every decibel of praise. But that celebration need not come at the cost of Jasprit Bumrah, the architect of several Indian triumphs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/victoria-mboko-beats-naomi-osaka-to-win-canadian-open-2768128-2025-08-08",
      "headline": "18-year-old Victoria Mboko stuns Naomi Osaka to win Canadian OpenVictoria Mboko staged a stunning comeback after losing the first set to beat Naomi Osaka 2-6, 6-4, 6-1 in the final. The 18-year-old became the first Canadian to defeat three former Grand Slam champions in a single WTA event in the Open Era"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwarans-father-ranganathan-gautam-gambhir-eng-vs-ind-2768112-2025-08-08",
      "headline": "Gambhir assured my son that he will get chances: Abhimanyu Easwaran's fatherAbhimanyu Easwaran's father, Ranganathan Easwaran, has revealed that India head coach Gautam Gambhir has assured his son of getting chances in the playing XI. Abhimanyu couldn't find a place in the playing XI in the five-match Test series against England."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-london-latest-photo-grey-beard-fans-speculation-2768200-2025-08-08",
      "headline": "Virat Kohli spotted in London with greying beard, sparking speculation among fansFormer India captain Virat Kohli was spotted in London sporting a salt-and-pepper look. A section of fans took note of his greying beard, linking it to a remark he made earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-pak-matthew-forde-ruled-out-of-odi-series-johann-layne-2768181-2025-08-08",
      "headline": "WI vs PAK: Matthew Forde ruled out of ODI series due to shoulder injuryWest Indies fast bowler Matthew Forde has been ruled out of the ODI series against Pakistan after dislocating his shoulder practice session. He has been replaced by Johann Layne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-siraj-vs-jasprit-bumrah-2768137-2025-08-08",
      "headline": "Cheer for Mohammed Siraj, but don't jeer Jasprit Bumrah England vs India: Mohammed Siraj's brilliance at The Oval deserves every decibel of praise. But that celebration need not come at the cost of Jasprit Bumrah, the architect of several Indian triumphs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/victoria-mboko-beats-naomi-osaka-to-win-canadian-open-2768128-2025-08-08",
      "headline": "18-year-old Victoria Mboko stuns Naomi Osaka to win Canadian OpenVictoria Mboko staged a stunning comeback after losing the first set to beat Naomi Osaka 2-6, 6-4, 6-1 in the final. The 18-year-old became the first Canadian to defeat three former Grand Slam champions in a single WTA event in the Open Era"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwarans-father-ranganathan-gautam-gambhir-eng-vs-ind-2768112-2025-08-08",
      "headline": "Gambhir assured my son that he will get chances: Abhimanyu Easwaran's fatherAbhimanyu Easwaran's father, Ranganathan Easwaran, has revealed that India head coach Gautam Gambhir has assured his son of getting chances in the playing XI. Abhimanyu couldn't find a place in the playing XI in the five-match Test series against England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}