{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-100-percent-chip-tariff-plan-has-shaken-the-global-semiconductor-industry-2767632-2025-08-07",
      "headline": "How Trump's 100% chip tariff plan has shaken the global semiconductor industrySpeaking from the Oval Office, Trump said the move is aimed at boosting local manufacturing and reducing reliance on foreign-made chips. He added that companies like Apple, which recently committed an extra $100 billion investment in the US, would not be charged the new tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariffs-50-percent-impact-on-india-key-sectors-what-nex-2767626-2025-08-07",
      "headline": "Trump hits India with 50% tariffs: What's at stake and what next?A sweeping 50% tariff could significantly impact India's export economy, threatening jobs and trade ties. As Donald Trump ramps up pressure, all eyes are now on New Delhi's next move.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-impact-india-economy-sectors-hardest-hit-gem-jewellery-auto-labour-textile-seafood-export-2767607-2025-08-07",
      "headline": "Trump's 50% tariff: How will it impact India's economy, different sectorsThe tariff hike, set to take effect from August 27, follows a warning issued by Trump earlier over India's continued oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/skipped-your-itr-for-years-here-is-how-it-can-impact-you-legally-and-financially-itr-filing-2767583-2025-08-07",
      "headline": "Skipped your ITR for years? Here's how it can impact you legally and financiallyIt might feel harmless to skip filing your Income Tax Return once or twice, but if you've been ignoring it for years, you could be heading for serious trouble. From steep penalties to even jail time, here's what you need to know before it's too late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-opens-for-subscription-should-you-apply-or-skip-2767578-2025-08-07",
      "headline": "JSW Cement IPO opens for subscription. Should you apply or skip?Brokerages are mostly positive about JSW Cement IPO, though some advise caution due to the stretched valuation and inconsistent profitability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-volatile-trade-what-should-investors-do-donald-trump-additional-us-tariffs-2767553-2025-08-07",
      "headline": "Sensex tanks 500 points on 50% Trump's tariff blow: Should Investors worry?The Sensex slipped over 250 points at the open before paring some losses. The Nifty50 was also trading lower, reflecting broad-based caution and expectations of a volatile trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-above-24500-bajaj-auto-down-nearly-2-2767538-2025-08-07",
      "headline": "Sensex, Nifty fall as Trump announces additional tariffs; experts advise cautionWhile Sensex opened 250 points lower, it was trading just 131.05 points lower at 80,412.94 at 9:22 am, indicating that the session could see wild swings and high volatility. Nifty50 was also down 67.25 points to 24,506.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-russia-oil-import-anand-mahindra-tweet-india-strategic-advantage-msme-tax-free-ease-of-business-2767463-2025-08-07",
      "headline": "How India can turn Trump's tariffs into a strategic advantageThe new tariff of an additional 25%, announced on Wednesday, will come into effect 21 days from August 7. This sharp increase in duties comes at a time when trade talks between the two countries have reached a dead end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pms-economic-advisory-council-members-on-trumps-tariff-war-indias-growth-strategy-2767416-2025-08-06",
      "headline": "PM's Economic Advisory Council members on Trump's tariff war, India's growth strategyPrime Minister Narendra Modi's Economic Advisory Council members, Dr Sajjid Chinoy and Neelkanth Mishra, share their perspectives on the additional 25 per cent tariffs imposed by Donald Trump on Indian imports to the US over buying Russian oil and India's growth strategy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-hdfc-union-bank-and-others-offer-attractive-3-year-fd-rates-should-you-invest-now-2767346-2025-08-06",
      "headline": "ICICI, HDFC, Union Bank and others offer attractive 3-year FD rates. Should you invest now?FDs remain one of the safest investment options for those looking for steady returns without risk. However, with repo rates possibly heading downward in the future, locking in higher FD rates now could be a smart financial move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/highway-infrastructure-ipo-opening-date-august-7-gmp-trend-50-percent-listing-gain-details-review-2767294-2025-08-06",
      "headline": "Should you subscribe to this IPO with over 50% listing gains? Check detailsThe public issue is worth Rs 130 crore, made up of a fresh issue of 1.39 crore shares amounting to Rs 97.52 crore, and an offer for sale of 46 lakh shares worth Rs 32.48 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-25-percent-import-duty-imports-phdcci-report-impact-india-economy-minimal-trump-2767228-2025-08-06",
      "headline": "US tariffs won't shake India's economy, says reportThe PHD Chamber of Commerce and Industry (PHDCCI) white paper finds only 1.87% impact on exports and 0.19% on GDP from the new US trade barrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-usd-64-billion-us-trade-at-risk-as-tensions-with-washington-escalate-after-trump-tariff-threat-2767209-2025-08-06",
      "headline": "India's $64 billion US trade at risk as tensions with Washington escalateIndia faces its most serious diplomatic crisis with the US in years after Trump imposed the highest tariffs among Asian peers on goods imported from India, even before any penalty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-rbi-rate-cut-it-stocks-us-tariff-concern-2767203-2025-08-06",
      "headline": "Sensex, Nifty end lower as US trade tension; RBI rate pause hit sentimentThe S&P BSE Sensex ended 166.26 points lower to end at 80,543.99, while the NSE Nifty50 lost 75.35 points to end at 24,574.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-radhika-gupta-on-why-large-cap-is-the-new-debt-2767168-2025-08-06",
      "headline": "Edelweiss' Radhika Gupta on why large cap is the new debtTraditionally, people invested in debt, like fixed deposits or bonds, when they wanted safety. They turned to equity, like stocks, when they were willing to take more risk for higher returns. But that line is getting blurry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-gen-z-is-trusting-instagram-influencers-over-financial-advisors-for-investment-advice-2767166-2025-08-06",
      "headline": "Is social media ruining investing for Gen Z?Social media is reshaping how young Indians invest. With financial influencer or 'finfluencer' on the rise, traditional financial literacy is being replaced by reels and short YouTube videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-stock-market-debut-hold-or-book-profit-2766980-2025-08-06",
      "headline": "Should you hold or sell NSDL shares after stock market listing? Details hereWhile NSDL may not offer sharp near-term upside post listing, many analysts see it as a core holding in India's market infrastructure play, particularly as digital finance expands and retail participation deepens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-debut-with-10-percent-premium-over-ipo-issue-price-2766972-2025-08-06",
      "headline": "NSDL shares debut with 10% premium over IPO issue priceNSDL's Rs 4,012 crore initial public offering was entirely an offer for sale (OFS) involving 5.01 crore equity shares. The issue saw robust demand from all investor segments, with an overall subscription of 41.02 times. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rate-steady-at-55-amid-global-trade-uncertainty-2766969-2025-08-06",
      "headline": "RBI keeps key lending rate steady at 5.5% amid global trade uncertaintyThe RBI MPC sighted the global tensions and trade uncertainty in keeping key lending rates unchanged. The MPC also decided to continue with a neutral stance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-off-to-shaky-start-amid-trump-tariff-threat-rbi-rate-decision-2766965-2025-08-06",
      "headline": "Sensex, Nifty off to shaky start amid Trump tariff threat, RBI rate decisionThe S&P BSE Sensex was down 65.70 points to 80.644.34 at 9:40 am, while the NSE Nifty50 fell 28.40 points to trade at 24,620."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-today-august-6-home-loan-emi-cheaper-rate-cut-us-tariff-affordable-housing-real-estate-2766959-2025-08-06",
      "headline": "RBI MPC announcement today: Will your home loan get cheaper?With interest rates already lowered three times in 2025, homebuyers and borrowers across the country are waiting to see if there is any further relief coming their way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-august-2025-what-to-expect-from-the-august-6-mpc-meet-2766749-2025-08-06",
      "headline": "RBI MPC rate decision on August 6: Time, expectations, and key updatesRBI Governor Sanjay Malhotra will present the monetary policy statement today. Check time, expectations, and key updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/anil-ambani-likely-to-be-summoned-again-by-ed-for-questioning-sources-2766726-2025-08-05",
      "headline": "Anil Ambani likely to be summoned again by ED for questioning: SourcesAnil Ambani faced questioning by the Enforcement Directorate in connection with an alleged Rs 17,000 crore loan fraud case. The questioning lasted for several hours, with sources indicating that he is likely to be summoned again within seven to ten days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-seeks-10-from-ed-days-to-provide-documents-in-fraud-cases-sources-2766708-2025-08-05",
      "headline": "Anil Ambani seeks 10 days from ED to provide documents in fraud cases: SourcesThe 66-year-old industrialist was summoned to the ED headquarters in New Delhi, where his statement was recorded under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-higher-fd-returns-compare-these-1-year-rates-before-investing-indusind-bank-icici-bank-2766623-2025-08-05",
      "headline": "Want higher FD returns? Compare these 1-year rates before investingAmong the different time periods you can choose, a one-year FD is especially attractive. It gives you decent interest without locking up your money for too long. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-indian-tech-founders-can-register-a-global-company-online-in-4-hours-and-enjoy-0-percent-tax-on-reinvested-profits-2765929-2025-08-05",
      "headline": "Why Estonia is the new favourite for Indian startupsAccording to an investment banker, top business leaders have already adopted Estonia's unique e-residency, allowing them to do business across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-308-points-lower-nifty-below-24700-titan-up-2-2766579-2025-08-05",
      "headline": "Sensex ends over 308 points lower, Nifty below 24,700; Titan up 2%The S&P BSE Sensex ended the session 308.47 points lower at 80,710.25, while the NSE Nifty50 fell 73.20 points to settle at 24,649.55. All the broader market indices ended the trading session in negative territory after Trump said he would impose more tariffs on India over Russian oil imports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-property-seller-nearly-paid-rs-187-lakh-more-in-tax-due-to-a-common-capital-gains-error-2766498-2025-08-05",
      "headline": "How one tax mistake could have cost a real estate seller Rs 1.87 lakhReal estate sellers often ignore deductions that can help reduce capital gains tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blended-petrol-india-government-push-reason-explained-2766519-2025-08-05",
      "headline": "Why the government wants to blend more ethanol with petrolBy March 2025, the government hit its E20 blending target—20% ethanol in petrol—five years ahead of schedule. Average blending levels stood at 17.98% in February 2025, up from 14.6% the year before, according to official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-do-this-before-anything-else-2766485-2025-08-05",
      "headline": "Filing ITR for the first time? Do this before anything elseThe last date to file your ITR for the financial year 2024–25 is September 15, 2025, so it's best to begin early and avoid the last-minute rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pan-20-to-go-live-in-18-months-what-it-means-and-how-it-affects-you-2766433-2025-08-05",
      "headline": "PAN 2.0 to go live in 18 months: What it means and how it affects youThe Rs 1,435 crore project will focus on simplifying taxpayer registration services and improving the overall experience through a new, unified online platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-p-b-balaji-jaguar-land-rover-new-ceo-2766412-2025-08-05",
      "headline": "Who is P B Balaji, Jaguar Land Rover's new CEO?The decision was confirmed in a stock exchange filing on August 4, 2025. Balaji's appointment marks a major shift, as he moves from a financial leadership role to the driver's seat of one of the world's most recognised car brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-investors-worried-trump-tariff-threat-sensex-nifty-fall-today-2766386-2025-08-05",
      "headline": "Sensex tumbles 400 points: Why is the stock market falling today?The S&P BSE Sensex was down 394.03 points to 80,614.50 at around 9:59 am, while the NSE Nifty50 fell 121.90 points to 24,600.85. Broader markets also mirrored the nervousness on Dalal Street, with mid- and small-cap indices under pressure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-regulator-irdai-fines-policybazaar-multiple-violations-key-details-2766375-2025-08-05",
      "headline": "Why insurance regulator fined Policybazaar Rs 5 crore? All you need to knowThe IRDAI noted that various insurance products were promoted as \"top\" or \"best\" in a manner that appeared biased and lacked substantiation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shweta-menon-case-acting-obscene-vulgar-films-amma-elections-2767635-2025-08-07",
      "headline": "Case against Malayalam actor Shweta Menon for allegedly acting in vulgar filmsErnakulam Central Police have registered a case against Malayalam actor Shweta Menon for alleged obscene and vulgar content in films and ads. The case comes as she is contesting for the AMMA president post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janaabe-aali-teaser-hrithik-roshan-jr-ntr-song-epic-war-on-dance-floor-kiara-advani-2767625-2025-08-07",
      "headline": "Janaabe Aali teaser: Hrithik Roshan, Jr NTR's song is an epic war on dance floorHrithik Roshan and Jr NTR's latest song 'Janaabe Aali' teaser from 'War 2' is out. The video gives a stunning glimpse of the dance face-off between the two actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mayasabha-the-rise-of-the-titans-review-aadhi-pinisetty-chaitanya-rao-telugu-poltical-thriller-fiery-plays-long-game-2767570-2025-08-07",
      "headline": "Mayasabha review: Friendship, betrayal and power in this gutsy political dramaRelease Date:Thu Aug 07, 2025'Mayasabha: The Rise of the Titans' Review: The Telugu political thriller, streaming on SonyLIV, offers a bold, intense narrative with strong performances, making it a compelling watch for fans of high-stakes drama with a regional flavour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-episode-9-detailed-update-mihir-rejects-misogyny-in-powerful-episode-2767592-2025-08-07",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Ep 9: Mihir rejects misogyny in powerful episodeWhen a marriage proposal to Pari turns into a test of her freedom, it's Mihir who delivers the final word. A progressive episode of 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot puts gender roles, kitchen politics, and regressive in-laws in their place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-hosts-lunch-for-salman-khan-sisters-alvira-khan-agnihotri-arpita-khan-sharma-2767560-2025-08-07",
      "headline": "Malaika Arora hosts lunch for Salman Khan's sisters Alvira, Arpita. VideoMalaika Arora hosted a special lunch for Salman Khan's sisters, Alvira and Arpita, and their children at her new restaurant in Mumbai. Even after her divorce from Arbaaz Khan, she shares a close and friendly bond with the Khan family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-touches-elderly-fan-feet-kisses-her-hand-2767579-2025-08-07",
      "headline": "Ranveer Singh touches elderly fan's feet, kisses her hand, video goes viralRanveer Singh won hearts with a sweet gesture as he touched an elderly fan's feet and kissed her hand outside a Mumbai studio. The video was widely shared on multiple platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-backs-diljit-dosanjh-amid-sardaar-ji-3-release-row-2767552-2025-08-07",
      "headline": "Vaani Kapoor backs Diljit Dosanjh amid Sardaar Ji 3 release row: He's a global starVaani Kapoor has defended Diljit Dosanjh's decision to release 'Sardaar Ji 3' overseas amid calls for a ban, stating the film was shot before the Pahalgam terror attack and no laws were broken. Despite criticism, the film became the highest-grossing Punjabi movie of the year with an international-only release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/weapons-review-zach-cregger-horror-gets-weird-wild-and-wickedly-smart-2767545-2025-08-07",
      "headline": "Weapons review: Zach Cregger's horror gets weird, wild and wickedly smartRelease Date:Fri Aug 08, 2025'Weapons' review: Zach Cregger's latest film 'Weapons' is a bold and unsettling horror mystery that combines dread, gore and dark humour. Set to release on August 8, 2025, the film explores themes of trauma and paranoia through a gripping and unpredictable narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-sends-naatu-naatu-billboard-to-jr-ntr-in-playful-war-2-face-off-2767522-2025-08-07",
      "headline": "Hrithik Roshan sends Naatu Naatu billboard to Jr NTR in playful War 2 face-offThe playful banter between Hrithik Roshan and Jr NTR through themed billboard trucks has sparked excitement ahead of their much-awaited film 'War 2'. On Thursday, Roshan sent NTR a 'Naatu Naatu' billboard. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-pickup-review-eddie-murphy-versatility-overshadowed-by-soulless-storytelling-2767493-2025-08-07",
      "headline": "The Pickup review: Poor American version of Dhoom 3 with Eddie Murphy's brillianceRelease Date:Wed Aug 06, 2025The Pickup review: 'The Pickup' has actor Eddie Murphy in the lead role. Despite a talented cast, the movie lacks emotional depth and soulful narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-calls-out-lip-syncing-in-music-industry-says-cant-get-away-with-it-2767525-2025-08-07",
      "headline": "Ed Sheeran calls out lip-syncing in music industry, says can't get away with itEd Sheeran addressed the common yet seldom admitted practice of lip-syncing in the music industry. During an interview, he emphasised his commitment to genuine live performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/su-from-so-how-raj-b-shetty-low-budget-kannada-film-gained-nationwide-attention-2767316-2025-08-07",
      "headline": "Su From So: How a low-budget Kannada film gained nationwide attention'Su From So' is a Kannada comedy film written and directed by JP Thuminad. The film released in theatres on July 25, and soon spread across the nation like wildfire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-midair-flight-with-daughter-aishwarya-obliges-fans-requests-2767519-2025-08-07",
      "headline": "Rajinikanth obliges man's request, gets up to greet fans inside aircraft. WatchSuperstar Rajinikanth flew economy with his daughter, Aishwarya, on Wednesday. A video from inside the aircraft has emerged where Thalaivar was seen greeting his fans and waving at them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-new-guest-stars-release-dates-and-episode-titles-glbs-2767492-2025-08-07",
      "headline": "Wednesday Season 2: New guest stars, release dates and episode titlesWednesday Season 2 returns with more mystery, humour, and gothic drama. Streaming on Netflix in two parts, it features new faces, guest stars, and supernatural twists.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/who-was-jane-etta-pitt-brad-pitts-mother-dies-at-84-glbs-2767468-2025-08-07",
      "headline": "Jane Etta Pitt, Brad Pitt's mother, dies at 84Brad Pitt's mother, Jane Etta Pitt, died at 84. A loving mother and school counsellor, she was remembered warmly by her family in heartfelt tributes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-dwarf-role-criticised-lilliput-not-even-dirt-on-kamal-haasan-feet-appu-raja-2767387-2025-08-06",
      "headline": "Lilliput compares SRK's acting in Zero to Kamal Haasan: Not even the dust on his feetActor Lilliput criticised actor Shah Rukh Khan's portrayal of a dwarf in director Anand L Rai's 'Zero', comparing it to Kamal Haasan's performance in 'Appu Raja'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/war-2-song-rakesh-roshan-performs-aavan-jaavan-hookstep-days-after-surgery-hrithik-kiara-2767338-2025-08-06",
      "headline": "Rakesh Roshan surprises Hrithik with Aavan Jaavan hookstep days after surgeryFillmmaker Rakesh Roshan performed the 'Aavan Jaavan' hookstep from Ayan Mukerji's 'War 2'. His actor son Hrithik Roshan praised the veteran's dancing skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-moved-by-army-learning-korean-shares-why-he-avoids-hand-contact-2767365-2025-08-06",
      "headline": "BTS Jin moved by ARMY learning Korean, shares why he avoids hand contact at showsCurrently on his 'Run Seokjin Ep Tour', Jin is nearing the conclusion of the tour, with the final concert scheduled to take place on August 10 in Amsterdam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ghaati-trailer-anushka-shetty-and-krish-returns-in-a-gritty-mountain-saga-2767348-2025-08-06",
      "headline": "Ghaati trailer : Anushka Shetty roars jn gritty saga of revenge ans resistanceAfter multiple delays, the trailer of 'Ghaati' finally sets the stage for Anushka Shetty's return in a rugged, survival drama. Directed by Krish Jagarlamudi, the film is slated for a September 5 release."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ready-to-pay-heavy-price-shielding-farmers-pm-modi-us-india-trade-deal-agriculture-dairy-deadlock-trump-tariffs-russian-oil-2767558-2025-08-07",
      "headline": "PM Modi's stern message to Trump: We will pay any price to protect our farmersPrime Minister Narendra Modi's remarks were seen as a direct response to US President Donald Trump, who slapped a 50 per cent tariff on India for its continued purchases of Russian oil. Read the full story below and join the conversation: Should India hold its ground as the US ratchets up its tariff war?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-former-hassan-mp-prajwal-revanna-sentenced-to-life-for-rape-as-hidden-saree-with-dna-evidence-proves-crucial-2767587-2025-08-07",
      "headline": "How a saree hidden in Prajwal Revanna's farmhouse sealed his fate in rape caseA hidden saree helped convict former MP Prajwal Revanna for raping a 47-year-old domestic worker. The forensic evidence on it proved crucial to the case. He was sentenced to life imprisonment and fined Rs 11 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-justice-yashwant-varma-plea-challenging-in-house-cash-row-probe-report-2767573-2025-08-07",
      "headline": "Supreme Court rejects Justice Varma's plea in cash row, clears decks for removalJustice Yashwant Varma had challenged the in-house inquiry report that recommended his removal after a large cash stash was found in his residence earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-crpf-jawans-killed-many-injured-as-bus-carrying-23-personnel-plunges-into-deep-gorge-in-udhampur-2767606-2025-08-07",
      "headline": "2 CRPF jawans killed, many injured as bus with 23 plunges into gorge in J&KTwo CRPF personnel died and 16 were injured after a bunker vehicle overturned in Jammu and Kashmir's Udhampur. The vehicle was carrying 23 jawans. Rescue efforts were launched immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kartavya-bhavan-common-central-secretariat-central-vistas-no-cabin-no-cry-cabin-office-bureaucrats-new-delhi-2767218-2025-08-07",
      "headline": "Open office, closed minds? Why babus feel exposed in Kartavya BhavanPrime Minister Narendra Modi inaugurated the Kartavya Bhavan-3, which will house several ministries of the Central government. However, top Central government officers have written to the PMO over the lack of private cabins in the building. They say the open-seating arrangement compromises confidentiality, affects efficiency and is ."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-how-tired-pacers-2767557-2025-08-07",
      "headline": "How tired is Mohammed Siraj?Mohammed Siraj's tireless bowling across formats has made him India's most dependable pacer, but his staggering workload raises red flags about long-term sustainability. Is India over-relying on Siraj at the cost of his fitness?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariffs-50-percent-impact-on-india-key-sectors-what-nex-2767626-2025-08-07",
      "headline": "Trump hits India with 50% tariffs: What's at stake and what next?A sweeping 50% tariff could significantly impact India's export economy, threatening jobs and trade ties. As Donald Trump ramps up pressure, all eyes are now on New Delhi's next move.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-pakistan-military-integration-intelligence-gathering-centaic-pak-air-force-concern-india-explained-2763996-2025-08-07",
      "headline": "China-Pak military integration: What is CENTAIC and should India be concerned?CENTAIC, a China-backed AI and computing centre in Pakistan, aims to transform the Pakistan Air Force (PAF) into a network-centric force integrated with China's military systems. Congress MP Rahul Gandhi mentioned CENTAIC in his Op Sindoor speech. Here's more about CENTAIC and if it should be a concern for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chandrayaan-2-captures-crashed-athena-lander-on-the-moon-reveals-new-insight-2767611-2025-08-07",
      "headline": "Chandrayaan-2 finds Athena's crash site, sends never-before-seen picsThe Athena mission, the Houston-based company Intuitive Machines' second attempt to deliver Nasa science instruments near the lunar south pole touched down on March 6, 2025, in the rugged and shadowy terrain of Mons Mouton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dharavi-revamp-can-gautam-adani-transform-asias-largest-slum-2767186-2025-08-06",
      "headline": "Dharavi revamp: Can Gautam Adani transform Asia's largest slum?How the Adani Group's Rs 2.5 lakh crore redevelopment and rehabilitation plan promises to play out for Dharavi's 1.2 million residents\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariffs-spark-worst-crisis-in-us-india-ties-says-michael-kugelman-glbs-2767500-2025-08-07",
      "headline": "Trump targeting India for not letting him take ceasefire credit? What analyst saidThe White House announcement marks an escalation in tensions, especially as India has remained firm on continuing energy imports from Moscow despite US pressure. The Trump administration has increasingly tied economic penalties to foreign policy grievances -- and India appears to be next in line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-always-on-lifestyle-is-damaging-our-heart-health-cardiac-surgeon-dr-shriram-nene-2767323-2025-08-07",
      "headline": "'Always on' lifestyle is damaging our hearts: Dr Shriram NeneThere's a growing heart disease crisis in India and inactive habits and digital overload are mostly to blame. Renowned cardiac surgeon Dr Shriram Nene warns how young professionals are especially vulnerable to the dangers of the \"always on\" culture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurugram-man-masturbates-in-front-of-model-rajiv-chowk-viral-video-2767528-2025-08-07",
      "headline": "Kept staring, masturbated near me: Model narrates harrowing ordeal in GurugramThe model said she had come to Gurugram from Jaipur and was waiting for a cab at Rajiv Chowk, a key and busy intersection, when the incident occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-grok-adds-nsfw-spicy-mode-for-premium-x-users-all-you-need-to-know-2767586-2025-08-07",
      "headline": "Elon Musk's Grok adds NSFW Spicy Mode for premium X users: All you need to knowAfter launching a gothic-styled AI companion, xAI's Grok released a new NSFW Spicy Mode. Since, Elon Musk's approach to AI has consistently leaned towards uncensored experiences, and Grok Imagine appears no different. Here is what this mode can do. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-above-24500-bajaj-auto-down-nearly-2-2767538-2025-08-07",
      "headline": "Sensex, Nifty fall as Trump announces additional tariffs; experts advise cautionWhile Sensex opened 250 points lower, it was trading just 131.05 points lower at 80,412.94 at 9:22 am, indicating that the session could see wild swings and high volatility. Nifty50 was also down 67.25 points to 24,506.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mayasabha-the-rise-of-the-titans-review-aadhi-pinisetty-chaitanya-rao-telugu-poltical-thriller-fiery-plays-long-game-2767570-2025-08-07",
      "headline": "Mayasabha review: Friendship, betrayal and power in this gutsy political dramaRelease Date:Thu Aug 07, 2025'Mayasabha: The Rise of the Titans' Review: The Telugu political thriller, streaming on SonyLIV, offers a bold, intense narrative with strong performances, making it a compelling watch for fans of high-stakes drama with a regional flavour."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/six-year-old-indian-origin-girl-brutally-assaulted-racist-attack-ireland-go-back-to-india-immigration-2767324-2025-08-06",
      "headline": "Go back to India: 6‑year‑old Indian‑origin girl hit in private parts in IrelandA six‑year‑old Indian‑origin girl in Waterford, Ireland, was assaulted by a group of boys who punched her, hit her private parts with a bicycle, and hurled racist abuse, telling her to \"go back to India\". Her mother, a nurse, who recently became an Irish citizen, said the child is now terrified to play outside and the family feels unsafe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-united-states-second-visit-two-months-2767506-2025-08-07",
      "headline": "Pak army chief Asim Munir to visit US again, his second trip in 2 monthsThe Pakistani Army chief will attend the farewell of US Central Command Commander General Michael Kurilla, who had called Pakistan a 'phenomenal partner' in counter-terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarkashi-to-dharali-road-blocked-due-to-water-surge-landslide-bridge-collapses-at-gangwani-2767488-2025-08-07",
      "headline": "Bridge collapse snaps Uttarkashi-Dharali route, rescue teams, relief reach by airIndia Today reached the nearest accessible point at Gangwani for an exclusive ground report, capturing the scale of destruction up close. The area around Ground Zero bears the deep footprints of the calamity — debris, broken concrete and mangled supports are all that remain of the bridge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/lifafas-laddoos-and-love-a-nostalgic-walk-through-rakhi-celebrations-2767559-2025-08-07",
      "headline": "Lifafas, laddoos and love: A nostalgic walk through rakhi celebrationsRakhi is more than just a thread; it's a symbol of memories, traditions, and emotions. This nostalgic piece reflects how we celebrated Raksha Bandhan in the '90s and how it still continues in 2025 in new ways, with the same love.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/meetings-with-stalin-show-sidelined-panneerselvam-aint-bowing-out-his-game-plan-2767034-2025-08-06",
      "headline": "Meetings with Stalin show sidelined Panneerselvam ain't bowing out: His game planA potential third front with Vijay's TVK and Anbumani Ramadoss's PMK could help OPS mount a fightback and mar the BJP-AIADMK's prospects in the Tamil Nadu polls in 2026"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-airlines-flights-grounded-across-us-due-to-system-outage-2767508-2025-08-07",
      "headline": "All flights of US-based United Airlines grounded, thousands affectedUnited Airlines flights: Passengers took to social media to vent their frustrations as operations came to a standstill in Chicago, Denver, Newark, Houston and San Francisco."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-chennai-super-kings-bond-always-be-together-2767535-2025-08-07",
      "headline": "Dhoni reiterates love for CSK amidst retirement buzz: Will always be togetherAmid swirling retirement rumours, MS Dhoni reaffirmed his unbreakable bond with Chennai Super Kings at a Chennai event, promising to support the franchise beyond his playing days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shweta-menon-case-acting-obscene-vulgar-films-amma-elections-2767635-2025-08-07",
      "headline": "Case against Malayalam actor Shweta Menon for allegedly acting in vulgar filmsErnakulam Central Police have registered a case against Malayalam actor Shweta Menon for alleged obscene and vulgar content in films and ads. The case comes as she is contesting for the AMMA president post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janaabe-aali-teaser-hrithik-roshan-jr-ntr-song-epic-war-on-dance-floor-kiara-advani-2767625-2025-08-07",
      "headline": "Janaabe Aali teaser: Hrithik Roshan, Jr NTR's song is an epic war on dance floorHrithik Roshan and Jr NTR's latest song 'Janaabe Aali' teaser from 'War 2' is out. The video gives a stunning glimpse of the dance face-off between the two actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-hosts-lunch-for-salman-khan-sisters-alvira-khan-agnihotri-arpita-khan-sharma-2767560-2025-08-07",
      "headline": "Malaika Arora hosts lunch for Salman Khan's sisters Alvira, Arpita. VideoMalaika Arora hosted a special lunch for Salman Khan's sisters, Alvira and Arpita, and their children at her new restaurant in Mumbai. Even after her divorce from Arbaaz Khan, she shares a close and friendly bond with the Khan family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-touches-elderly-fan-feet-kisses-her-hand-2767579-2025-08-07",
      "headline": "Ranveer Singh touches elderly fan's feet, kisses her hand, video goes viralRanveer Singh won hearts with a sweet gesture as he touched an elderly fan's feet and kissed her hand outside a Mumbai studio. The video was widely shared on multiple platforms."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-chris-woakes-injury-rishabh-pant-message-oval-test-2767610-2025-08-07",
      "headline": "Pant's voice note, Gill's message: When Oval Test warrior Woakes felt India's loveIndia vs England: Chris Woakes bravely batted with a dislocated shoulder on the dramatic final day of the Oval Test against India. His courage earned respect from Indian players and fans despite England's narrow loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/montreal-open-2025-khachanov-beats-zverev-shelton-defeats-fritz-to-reach-final-2767593-2025-08-07",
      "headline": "Montreal Open 2025: Khachanov stuns Zverev, Shelton dominates Fritz to reach finalKaren Kachanov and Ben Shelton are set to clash in the final of the Montreal Open 2025 after defeating Alexander Zverev and Taylor Fritz respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-candidates-chess-2026-rejuvinated-exclusive-2767591-2025-08-07",
      "headline": "Rejuvenated Arjun Erigaisi sets sights on spot in Candidates 2026Arjun Erigaisi reflected on a mixed 2025 season, shared honest views on freestyle chess, praised Divya Deshmukh's World Cup win, and set his sights firmly on a Candidates spot through the Grand Swiss or World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gary-kirsten-praises-gautam-gambhir-oval-test-win-2767562-2025-08-07",
      "headline": "Delighted for what Gautam Gambhir has achieved with Test team in England: Gary KirstenFormer South Africa cricketer and India head coach Gary Kirsten praised Gautam Gambhir after India managed to draw the five-match Test series 2-2 against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-how-tired-pacers-2767557-2025-08-07",
      "headline": "How tired is Mohammed Siraj?Mohammed Siraj's tireless bowling across formats has made him India's most dependable pacer, but his staggering workload raises red flags about long-term sustainability. Is India over-relying on Siraj at the cost of his fitness?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-chennai-super-kings-bond-always-be-together-2767535-2025-08-07",
      "headline": "Dhoni reiterates love for CSK amidst retirement buzz: Will always be togetherAmid swirling retirement rumours, MS Dhoni reaffirmed his unbreakable bond with Chennai Super Kings at a Chennai event, promising to support the franchise beyond his playing days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-2nd-test-tom-latham-ruled-out-will-orourke-2767521-2025-08-07",
      "headline": "ZIM vs NZ: Latham ruled out for 2nd Test with Santer to continue as skipperNew Zealand will miss Tom Latham again in the second Test against Zimbabwe, while fresh injuries to Will O'Rourke and Nathan Smith force key changes as Mitchell Santner leads the side in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-debabrata-das-prabir-chakraborty-financial-misconduct-2767509-2025-08-07",
      "headline": "Bengal cricket board issues show cause to top official over financial misconductBengal cricket has been rocked by financial misconduct allegations against CAB officials Debabrata Das and Prabir Chakraborty, as the Apex Council takes serious action to ensure accountability and restore trust in the cricketing body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-prize-money-record-2767462-2025-08-06",
      "headline": "US Open announces record 90 million dollar prize money for 2025 editionFor its 2025 edition, the US Open has announced a historic 90 million dollars prize pool—marking the highest ever in tennis and a 20 percent jump from the 75 million dollars distributed in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-muller-joins-vancouver-whitecaps-mls-title-chances-2767457-2025-08-06",
      "headline": "Thomas Muller joins MLS side Vancouver Whitecaps after Bayern Munich exitFormer Bayern Munich and Germany forward Thomas Muller has signed with Major League Soccer side Vancouver Whitecaps, bringing an end to one of the most iconic one-club careers in football history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/annu-rani-wins-javelin-gold-with-season-best-6259m-throw-in-poland-2767447-2025-08-06",
      "headline": "Annu Rani wins javelin gold with season-best 62.59m throw in PolandAnnu Rani registered her first 60m-plus javelin throw in over a year to win gold in Poland. This strong performance raises hopes of her qualification to the World Championships through world rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-2nd-test-tom-latham-ruled-out-will-orourke-2767521-2025-08-07",
      "headline": "ZIM vs NZ: Latham ruled out for 2nd Test with Santer to continue as skipperNew Zealand will miss Tom Latham again in the second Test against Zimbabwe, while fresh injuries to Will O'Rourke and Nathan Smith force key changes as Mitchell Santner leads the side in Bulawayo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-association-of-bengal-debabrata-das-prabir-chakraborty-financial-misconduct-2767509-2025-08-07",
      "headline": "Bengal cricket board issues show cause to top official over financial misconductBengal cricket has been rocked by financial misconduct allegations against CAB officials Debabrata Das and Prabir Chakraborty, as the Apex Council takes serious action to ensure accountability and restore trust in the cricketing body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-prize-money-record-2767462-2025-08-06",
      "headline": "US Open announces record 90 million dollar prize money for 2025 editionFor its 2025 edition, the US Open has announced a historic 90 million dollars prize pool—marking the highest ever in tennis and a 20 percent jump from the 75 million dollars distributed in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-muller-joins-vancouver-whitecaps-mls-title-chances-2767457-2025-08-06",
      "headline": "Thomas Muller joins MLS side Vancouver Whitecaps after Bayern Munich exitFormer Bayern Munich and Germany forward Thomas Muller has signed with Major League Soccer side Vancouver Whitecaps, bringing an end to one of the most iconic one-club careers in football history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/annu-rani-wins-javelin-gold-with-season-best-6259m-throw-in-poland-2767447-2025-08-06",
      "headline": "Annu Rani wins javelin gold with season-best 62.59m throw in PolandAnnu Rani registered her first 60m-plus javelin throw in over a year to win gold in Poland. This strong performance raises hopes of her qualification to the World Championships through world rankings."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}