{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-otps-kyc-to-e-sign-how-everyday-slips-are-fuelling-a-new-wave-of-digital-fraud-online-fraud-digital-scam-2828262-2025-11-30",
      "headline": "From OTPs, KYC to e-Sign: How everyday slips are fuelling a new wave of digital fraudFraudsters no longer hack systems, they hack human behaviour, using lookalike pages, cloned voices and urgent prompts. Even routine steps like OTPs, KYC and e-Sign are becoming easy entry points. Are consumers prepared for this new kind of digital deception?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-unilever-ltds-nitin-paranjape-shares-dramatic-account-of-companys-5-lakh-store-leap-2828035-2025-11-29",
      "headline": "HUL's Nitin Paranjape shares dramatic account of company's 5-lakh store leapNitin Paranjpe recalled proposing the addition of five lakh outlets, a number he admitted sounded unrealistic at first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-zerodha-founder-and-ceo-nithin-kamath-warning-investors-against-pre-ipo-hype-2827686-2025-11-28",
      "headline": "Why is Zerodha's Nithin Kamath warning investors against pre-IPO hype?With IPO buzz at its peak, Nithin Kamath has stepped in to warn investors about the increasing speculation in the unlisted market, where many buyers are chasing inflated pre-IPO valuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-do-you-recover-money-after-credit-card-fraud-steps-you-must-know-2827637-2025-11-28",
      "headline": "How do you recover money after credit card fraud? Steps you must knowRecovering money after credit card fraud can feel stressful, but the process is simpler if you act quickly. Knowing the right steps — and your rights, can greatly improve your chances of getting your money back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-82-in-q2fy26-beats-estimates-2827593-2025-11-28",
      "headline": "India's GDP rises by 8.2% in Q2 despite Trump tariffs, highest in six quartersIndia's 8.2% Q2 GDP print has beaten forecasts despite pressure from US tariffs, with manufacturing and services driving momentum and reaffirming the nation's place as the fastest-growing major economy heading into FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-flat-as-dalal-street-takes-breather-after-hitting-all-time-highs-2827579-2025-11-28",
      "headline": "Sensex, Nifty end flat as Dalal Street takes breather after hitting all-time highsThe S&P BSE Sensex slipped 13.71 points to close at 85,706.67, while the NSE Nifty50 ended 12.60 points lower at 26,202.95. The broader market also remained subdued, with most major sectoral indices finishing in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-millennials-relying-too-heavily-on-mutual-fund-sips-drawbacks-explained-2827567-2025-11-28",
      "headline": "Are millennials relying too heavily on SIPs for wealth building?Millennials swear by SIPs for long term investing, but are they mistaking convenience for safety? As market cycles turn unpredictable, is it time to rethink what \"safe investing\" really means?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-tax-deadlines-to-lpg-prices-pensions-ups-atf-prices-5-major-financial-changes-starting-december-1-2827505-2025-11-28",
      "headline": "From tax deadlines to LPG, pensions: 5 major financial changes starting December 1Before December begins, it's worth noting that several new financial rules will kick in, affecting your bills, savings and even travel plans. Whether it's cooking gas, pension rules or tax filings, here's what to expect as the calendar turns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-shares-rise-nearly-29-percent-over-ipo-price-what-should-investors-do-2827446-2025-11-28",
      "headline": "Sudeep Pharma shares rise nearly 29% over IPO price. What should investors do?Sudeep Pharma's strong debut has impressed investors, but with valuations now stretched, is this the right moment to book profits or should investors stay put and ride the long-term story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-price-band-gmp-company-details-all-you-need-to-know-2827438-2025-11-28",
      "headline": "From GMP to price band: 5 things to know about Meesho IPOThe SoftBank-backed e-commerce platform has set a price band of Rs 105 to Rs 111 per share, valuing the company at nearly Rs 50,100 crore at the upper end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pension-stop-after-november-30-check-now-2827427-2025-11-28",
      "headline": "Will your pension stop after November 30? Check nowThe deadline to submit the annual Life Certificate is almost here, and missing it could put your pension on hold. Pensioners must complete the process by 30 November to avoid any interruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-benefits-challenges-payroll-impact-take-home-pay-2827422-2025-11-28",
      "headline": "New labour codes bring major employee benefits, but what are the big challenges?The new labour codes promise stronger protection and wider benefits for workers, but the real test begins now as businesses brace for higher costs, major restructuring and a challenging transition across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-tax-department-sending-sms-alerts-to-25000-taxpayers-about-foreign-assets-2827404-2025-11-28",
      "headline": "Why is tax department sending SMS alerts to 25,000 taxpayers about foreign assets?Tax officials examined data received from foreign jurisdictions through the Automatic Exchange of Information (AEOI) system. This international framework allows countries to share details of financial accounts held abroad by their residents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-opening-december-3-price-band-gmp-listing-expectations-2827389-2025-11-28",
      "headline": "Meesho IPO opening on December 3: What investors need to knowMeesho IPO is all set to open for subscription, backed by strong GMP cues and rising investor interest, but can the value-commerce giant turn pre-listing hype into sustained market performance? Here is all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-lying-unclaimed-here-is-how-delhis-new-campaign-help-you-recover-it-2827382-2025-11-28",
      "headline": "Is your money lying unclaimed? Here's how Delhi's new campaign help you recover itThe move is part of the Centre's ongoing 'Apki Punji, Apka Adhikar' campaign, which focuses on returning such funds to their rightful owners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-share-price-strong-ipo-listing-hold-sell-book-profit-2827376-2025-11-28",
      "headline": "Sudeep Pharma makes strong market debut. Hold or book profit now?A blockbuster debut has rewarded Sudeep Pharma IPO investors. Should you cash out while sentiment is high or hold on for the company's expansion and export growth story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sudeep-pharma-ipo-listing-23-percent-premium-in-strong-stock-market-debut-2827332-2025-11-28",
      "headline": "Sudeep Pharma shares list at 23% premium in strong market debutThe Rs 895-crore issue, which was subscribed an extraordinary 93.71 times between November 21 and 25, opened at Rs 730 on the NSE and Rs 725 on the BSE, against the upper-end IPO price of Rs 593. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gail-share-price-today-pipeline-tariff-hike-impact-psu-stock-falls-2827323-2025-11-28",
      "headline": "GAIL share price tumbles 6%. Here's why the PSU stock is falling todayThe slump in GAIL's share price reflects investor disappointment over a tariff hike that landed far below expectations. With a full review pushed to 2028, the market is recalibrating its outlook on earnings support for the PSU major."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-pause-record-highs-2827304-2025-11-28",
      "headline": "Sensex, Nifty take breather after hitting record highsThe S&P BSE Sensex was up 65.92 points at 85,786.30 around 9:22 am, while the NSE Nifty50 slipped 16.65 points to 26,232.20."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-flaunts-grey-hair-look-fans-call-her-true-beauty-2828302-2025-11-30",
      "headline": "Manisha Koirala flaunts grey-hair look, fans call her true beauty Manisha Koirala impressed fans with her natural, no-makeup, greying-hair look during a recent airport appearance, drawing praise for her confidence and authenticity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/5-times-ariana-and-cynthia-broke-the-net-with-bizarre-cringe-and-confusing-antics-2828267-2025-11-30",
      "headline": "5 times Ariana and Cynthia broke the net with bizarre, cringe and confusing antics Ariana Grande and Cynthia Erivo delivered tons of unforgettable, meme-worthy moments during the Wicked: For Good press tour, from emotional interviews to bizarre red-carpet antics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-highlights-vijay-sethupathi-roasts-and-warns-fj-2828282-2025-11-30",
      "headline": "Bigg Boss Tamil 9 Highlights: Vijay Sethupathi roasts and warns FJ Vijay Sethupathi confronted FJ on Bigg Boss Tamil 9 for faking an injury, neglecting his captaincy duties, and manipulating Parvathi, leaving the contestant in tears. The host also slammed the housemates for misunderstanding the school task and pushed them to reflect through an anonymous-letter challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-faces-backlash-for-mimicking-kantara-chamundi-scene-at-iffi-2828242-2025-11-30",
      "headline": "Ranveer Singh faces backlash for mimicking Kantara's Chaundi scene at IFFI. Watch Ranveer Singh sparked controversy after mimicking a scene from Kantara Chapter 1 and referring to Chaundi as a \"female ghost\" during his stage act at IFFI 2024. His impression, which left Rishab Shetty laughing, has triggered a wave of criticism online for being \"disrespectful\" and insensitive to Daiva traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-thanksgiving-note-says-she-is-back-home-for-a-quick-minute-2828230-2025-11-30",
      "headline": "Priyanka Chopra shares Thanksgiving note, says she's back home for a quick minute Priyanka Chopra returned home briefly to celebrate Thanksgiving and shared a heartfelt note about gratitude, family, and simple joys, accompanied by intimate photos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-gets-sweet-birthday-wishes-from-her-twin-sons-best-amma-in-the-world-2828225-2025-11-30",
      "headline": "Nayanthara gets sweet birthday wishes from her twin sons: Best amma in the world Nayanthara celebrated her birthday by sharing unseen photos with her twin sons, Ulag and Uyir, who gifted her a handmade card calling her the \"best amma in the world.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-says-naseeruddin-shah-apologised-for-their-heated-2020-rift-2828221-2025-11-30",
      "headline": "Sorry yaar: Anupam Kher says Naseeruddin Shah apologised for their heated 2020 rift Anupam Kher has shared that Naseeruddin Shah recently apologised to him, signalling a thaw in their long-standing and highly publicised feud. Despite past clashes and sharp public remarks, the actors appear to be moving toward a more cordial equation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tere-ishk-mein-box-office-collection-day-2-dhanush-kriti-sanon-film-crosses-rs-33-crore-mark-2828211-2025-11-30",
      "headline": "Tere Ishk Mein box office Day 2: Dhanush-Kriti's film crosses Rs 33 crore mark Tere Ishk Mein continues its steady run at the box office, collecting  Rs 17 crore on Day 2 and taking its total to Rs 33 crore in India. Despite mixed reviews, the Dhanush–Kriti Sanon starrer maintains strong occupancy across major cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sayani-gupta-delhi-crime-3-improvisation-ai-fears-streaming-industry-challenges-2826825-2025-11-30",
      "headline": "Meet Kusum: Sayani Gupta on playing Delhi Crime 3's unpredictable chameleon Sayani Gupta shares her experience of playing the complex and unpredictable Kusum in Delhi Crime Season 3, highlighting the creative freedom and improvisation that shaped her role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cynthia-erivo-ariana-grande-in-non-demi-curious-semi-binary-relationship-see-here-2828165-2025-11-29",
      "headline": "Cynthia Erivo, Ariana Grande in 'non-demi-curious-semi-binary' relationship? Viral posts alleging a unique relationship between Hollywood actors Cynthia Erivo and Ariana Grande have surfaced on social media. Here's everything you need to know about their 'non-demi-curious semi-binary relationship' label."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-written-update-salman-khan-evicts-ashnoor-kaur-for-hitting-tanya-mittal-2828145-2025-11-29",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman Khan evicts Ashnoor for hitting Tanya Ashnoor Kaur was evicted by 'Bigg Boss 19' host Salman Khan, a week before the grand finale. Her eviction comes after a physical altercation with co-contestant Tanya Mittal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-on-ott-when-and-where-to-stream-ranveer-singh-film-reports-2828131-2025-11-29",
      "headline": "Dhurandhar on OTT: When and where to stream Ranveer Singh's film, as per reports Details have emerged surrounding the OTT release of Ranveer Singh's film 'Dhurandhar'. The much-awaited film is slated for a theatrical release on December 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-film-chaudhary-aslam-widow-naureen-threatens-legal-action-film-portrayal-ranveer-singh-sanjay-dutt-2828114-2025-11-29",
      "headline": "Dhurandhar: Chaudhary Aslam's widow threatens legal action over film portrayal Naureen Aslam, the widow of Karachi police officer Chaudhary Aslam, has voiced her concern over his portrayal in the upcoming film 'Dhurandhar'. She threatened to take legal action if Chaudhary Aslam is misrepresented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-meets-sunny-bobby-deol-pays-tribute-to-dharmendra-throwback-pics-2828111-2025-11-29",
      "headline": "Shatrughan Sinha meets Deols, pays tribute to Dharmendra with throwback pics Veteran actor Shatrughan Sinha on Saturday reflected on his emotional visit to the home of late actor Dharmendra to meet his family. He remembered Dharmendra for the many lives he influenced and expressed deep admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urmila-matondkar-open-to-rangeela-remake-cinema-never-belonged-to-anybody-2828097-2025-11-29",
      "headline": "Urmila Matondkar open to Rangeela remake: Cinema never belonged to anybody Actor Urmila Matondkar is open to a remake of the film 'Rangeela', a project many fans consider untouchable. In a recent interview, she emphasised that cinema ultimately belongs to its audience and not any individual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-emotional-note-kaun-banega-crorepati-team-dinner-father-harivansh-rai-bachchan-birth-anniversary-2828082-2025-11-29",
      "headline": "Big B shares emotional note after KBC team dinner on his father's birth anniversary Amitabh Bachchan admitted feeling emotional after a 'Kaun Banega Crorepati' team dinner unknowingly coincided with his father's birth anniversary. His late father, renowned poet Harivansh Rai Bachchan, was born on November 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fan-emotional-journey-to-meet-rajinikanth-goes-viral-watch-2828054-2025-11-29",
      "headline": "Rajinikanth fan's emotional journey to meet the superstar goes viral. Watch A video of a Rajinikanth fan detailing his experience meeting the superstar and obtaining his autograph has gained widespread attention on social media. The fan's story comes as Rajinikanth was recently honoured for 50 years in cinema at the 56th International Film Festival of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-varma-shares-surreal-moment-after-receiving-gulzar-saab-signed-note-2828055-2025-11-29",
      "headline": "Vijay Varma shares surreal moment after receiving Gulzar Saab's signed note Vijay Varma called it a \"surreal\" moment after receiving autographs and heartfelt encouragement from the legendary Gulzar Saab, a gesture he took days to process before sharing publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-sister-anisha-reportedly-to-wed-rohan-acharya-related-to-deols-bimal-roy-2828034-2025-11-29",
      "headline": "Deepika's sister Anisha reportedly to wed Rohan Acharya, related to Deols, Bimal Roy Deepika Padukone's sister Anisha Padukone is reportedly preparing to marry Rohan Acharya. Here's how the wedding will connect the Padukone family to the Deols and the lineage of renowned filmmaker Bimal Roy."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/voter-roll-revision-extended-by-7-days-for-all-12-states-draft-list-to-be-released-on-december-16-2828286-2025-11-30",
      "headline": "SIR extended by 7 days in all states, draft electoral list to be out on December 16The Election Commission of India has extended the Special Intensive Revision schedule by a week in 12 States and Union Territories to ensure voters can verify their names in the electoral rolls. This move aims to enhance the accuracy and inclusiveness of voter lists ahead of upcoming elections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-all-party-meeting-winter-session-parliament-key-bills-opposition-concerns-sir-delhi-blast-congress-2828269-2025-11-30",
      "headline": "Centre holds all-party meet ahead of Parliament Winter Session, 14 bills on cardsThe government on Sunday met floor leaders of parties ahead of Parliament's Winter session, which is set to commence on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-odi-live-score-rohit-sharma-virat-kohli-ranchi-2828244-2025-11-30",
      "headline": "Rohit, Kohli at the crease after Jaiswal falls in 4th overIndia vs South Africa 1st ODI Live Score and Updates: Yashasvi Jaiswal falls after a quickfire start. Nandre Burger gets the first breakthrough for South Africa in the 4th over. Jaiswal's wicket has meant that Virat Kohli has joined Rohit Sharma at the crease as India hunt a big total in Ranchi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-discusses-his-letter-x-obsession-on-nikhil-kamaths-podcast-watch-trailer-2828266-2025-11-30",
      "headline": "Musk discusses his letter 'X' obsession on Nikhil Kamath's podcast. Watch trailerNikhil Kamath has released the trailer of his 'People by WTF' podcast with Elon Musk, which left social media users excited and looking forward to the official release date reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/colourful-india-going-colourless-pastels-monochromes-basic-shades-fashion-shirts-art-dyeing-colonial-mindsent-2828219-2025-11-30",
      "headline": "Beige Bharat? Why a colourful India is going colourlessAncient India was among the first to experiment with colours and dyed fabric was part of its prime exports. However, the west's fear of colours, India's colonial history and mindset, and the class bias associated with bright palettes are making India go colourless. Indians are taking to pastels, monochromes and neutral colours, for clothes, cars and buildings. Will Indians embrace their very own colours and make the dull world colourful?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-fortifies-siliguri-corridor-with-new-military-bases-2828065-2025-11-29",
      "headline": "India fortifies Siliguri corridor with new military basesAs Bangladesh's political landscape shifts towards China and Pakistan, New Delhi builds three forward bases to secure its most vulnerable strategic chokepoint and protect the northeast. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-ditwah-heavy-rain-tamil-nadu-puducherry-andhra-disaster-response-cuddalore-nagapattinam-chennai-red-alert-2828182-2025-11-30",
      "headline": "Cyclone Ditwah intensifies near Tamil Nadu coast, rain batters southern India Live UpdatesExtremely heavy rain continues across many parts of Tamil Nadu as cyclonic storm Ditwah, which earlier devastated Sri Lanka, is getting closer to Tamil Nadu-Puducherry coast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-ipl-retirement-kkr-power-coach-2828294-2025-11-30",
      "headline": "IPL 2026: Released by KKR, Andre Russell retires from IPL, flaunts loyaltyWest Indies all-rounder Andre Russell has announced that he has retired from IPL after 14 seasons. Russell will join KKR's backroom staff as their new power coach for the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/india-has-become-the-worlds-accountant-yet-the-world-pays-us-like-interns-finance-and-accounting-uk-us-europe-2827565-2025-11-28",
      "headline": "India has become the world's accountant. Yet we are still paid like internsA massive shift in global finance is underway and India is powering it. The question is whether Indian professionals will seize the rewards"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/4-dead-10-wounded-in-shooting-during-family-gathering-at-california-banquet-hall-2828245-2025-11-30",
      "headline": "4 dead, 10 wounded in shooting during family gathering at California banquet hallA tragic shooting at a family gathering in Stockton, Northern California, has left four dead and ten injured, with authorities suspecting a targeted attack. The investigation is ongoing as officials work to uncover the motive and identify the assailants.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-tensions-jaishankar-supply-diversification-self-reliance-2828171-2025-11-29",
      "headline": "Politics trumps economics: S Jaishankar's veiled dig at US amid trade tensionsS Jaishankar's comments come against the backdrop of recent trade disputes and steep US tariffs, including a 50 per cent rate on Indian imports levied by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-party-paradise-worlds-tallest-lord-ram-statue-why-history-partagali-math-unveiling-pm-modi-explained-2828059-2025-11-30",
      "headline": "Why Lord Ram's tallest statue has come up in party-paradise GoaIn Goa, where the magnet is sun, sand, and nightlife, a 77-foot bronze statue of Lord Ram was unveiled by PM Narendra Modi. It might seem unusual to many, but Lord Ram's statue in Goa is rooted in centuries of Dvaita Vaishnavism and the 550-year legacy of the Partagali Math. The statue is a symbol of faith and cultural resilience, as underlined by the PM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-playing-xi-ruturaj-gaikwad-returns-bavuma-rested-ranchi-match-2828307-2025-11-30",
      "headline": "IND vs SA: India opt for Ruturaj instead of Pant, Bavuma misses Ranchi ODIIndia have handed a return for Ruturaj Gaikwad into the ODI team ahead of Rishabh Pant in the match in Ranchi against South Africa on Sunday, November 30. The Proteas will be without the services of Temba Bavuma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/politics-of-harassment-congress-slams-centre-after-new-fir-on-rahul-sonia-gandhi-2828274-2025-11-30",
      "headline": "Politics of harassment: Congress slams Centre after new FIR on Rahul, Sonia GandhiThe Congress has strongly reacted to the fresh FIR filed against Sonia Gandhi, Rahul Gandhi and others in the National Herald case, terming it as an example of the Centre's vendetta politics. The opposition alleges misuse of investigative agencies ahead of crucial elections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/no-whatsapp-without-active-sim-india-mulls-6-hour-logouts-to-curb-misuse-new-changes-explained-2828264-2025-11-30",
      "headline": "No WhatsApp without active SIM: India mulls 6-hour logouts to curb misuseThe Indian government mandates WhatsApp accounts to remain linked to active SIM cards to enhance cybersecurity. This move aims to reduce online fraud but faces criticism over its effectiveness and user convenience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/5-times-ariana-and-cynthia-broke-the-net-with-bizarre-cringe-and-confusing-antics-2828267-2025-11-30",
      "headline": "5 times Ariana and Cynthia broke the net with bizarre, cringe and confusing anticsAriana Grande and Cynthia Erivo delivered tons of unforgettable, meme-worthy moments during the Wicked: For Good press tour, from emotional interviews to bizarre red-carpet antics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-547-28-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahmood-madani-oppression-jihad-remark-judiciary-minority-rights-2828057-2025-11-29",
      "headline": "There will be jihad if oppression happens: Jamiat chief's shocking remarkJamiat Ulema-e-Hind chief Mahmood Madani triggered a political storm by saying \"if there is oppression, there will be jihad,\" while accusing the judiciary and government of undermining minority rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sorry-sorry-52-times-in-4-minutes-madhya-pradesh-boy-before-suicide-attempt-2828253-2025-11-30",
      "headline": "'Sorry… sorry…' 52 times in 4 minutes: Madhya Pradesh boy before suicide attemptA 14-year-old national-level skater from Ratlam attempted suicide by jumping from his school building after a distressing incident involving viral social media content. The boy is currently in critical condition, and investigations are underway to uncover the reasons behind his drastic action.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-rise-of-instagram-parenting-and-should-you-unfollow-it-2827416-2025-11-30",
      "headline": "The rise of Instagram parenting, and should you unfollow it?If you're a new parent turning to social media for every little decision about your baby, you may already be caught in the bubble of Instagram parenting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rare-earth-elements-india-china-monopoly-neodymium-magnets-ev-wind-turbine-missiles-production-incentive-scheme-2025-2828179-2025-11-30",
      "headline": "Why rare Earth elements are the new strategic fuel for IndiaSeventeen metals power everything from silent EVs to roaring missiles. India is turning its beach sand into strategic gold before it's too late.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cat-2025-slot-1-analysis-difficulty-good-attempts-expected-cutoff-2828275-2025-11-30",
      "headline": "CAT 2025 Slot 1 tougher than last year? Expert analysis insideCAT 2025, conducted by IIM Kozhikode, began today with Slot 1 ending at 10:30 am. Early student feedback shows a slightly tougher paper than CAT 2024. Here's the full section-wise analysis of VARC, DILR, QA, difficulty levels, good attempts, and expected cutoffs. Live updates for all slots continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/coffee-cocoa-wine-grapes-agriculture-climate-change-saving-at-risk-threat-global-warming-2827540-2025-11-30",
      "headline": "Coffee, cocoa, wine may be beyond saving, thanks to climate changeSigns of distress are already clear. Global wine production has dropped to its lowest level in 60 years, cocoa stocks are at their weakest in a decade, and coffee prices have soared to record highs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-flaunts-grey-hair-look-fans-call-her-true-beauty-2828302-2025-11-30",
      "headline": "Manisha Koirala flaunts grey-hair look, fans call her true beautyManisha Koirala impressed fans with her natural, no-makeup, greying-hair look during a recent airport appearance, drawing praise for her confidence and authenticity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/5-times-ariana-and-cynthia-broke-the-net-with-bizarre-cringe-and-confusing-antics-2828267-2025-11-30",
      "headline": "5 times Ariana and Cynthia broke the net with bizarre, cringe and confusing anticsAriana Grande and Cynthia Erivo delivered tons of unforgettable, meme-worthy moments during the Wicked: For Good press tour, from emotional interviews to bizarre red-carpet antics. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/south-africa-elects-to-bowl-in-ranchi-odi-kl-rahul-leads-india-as-rohit-kohli-return-ytvd-2828316-2025-11-30",
      "headline": "South Africa Elects to Bowl in Ranchi ODI; KL Rahul Leads India as Rohit, Kohli Return In this sports update, India Today's Aishwarya Paliwal and Sports Editor Nikhil Naz discuss the 1st ODI between India and South Africa in Ranchi. South Africa has won the toss and elected to bowl first, a decision Nikhil attributes to the 'dew' factor expected later in the evening. Nikhil notes that it is 'time now to get done with tosses in India' given the team's poor record with the coin. The match highlights the return of stalwarts Rohit Sharma and Virat Kohli, who are 'determined to be playing' the 2027 World Cup. With KL Rahul leading the side, the focus remains on the veteran duo's form as they prepare for the future. Nikhil adds that despite losing the toss, fans will enjoy seeing 'Both Rohit and Virat come out to bat' soon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-playing-xi-ruturaj-gaikwad-returns-bavuma-rested-ranchi-match-2828307-2025-11-30",
      "headline": "IND vs SA: India opt for Ruturaj instead of Pant, Bavuma misses Ranchi ODI India have handed a return for Ruturaj Gaikwad into the ODI team ahead of Rishabh Pant in the match in Ranchi against South Africa on Sunday, November 30. The Proteas will be without the services of Temba Bavuma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-ipl-retirement-kkr-power-coach-2828294-2025-11-30",
      "headline": "IPL 2026: Released by KKR, Andre Russell retires from IPL, flaunts loyalty West Indies all-rounder Andre Russell has announced that he has retired from IPL after 14 seasons. Russell will join KKR's backroom staff as their new power coach for the upcoming season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikha-pandey-wpl-2026-reaction-delhi-capitals-exit-up-warriorz-auction-2828268-2025-11-30",
      "headline": "Wanted DC return in WPL 2026: Shikha Pandey after record 2.4 crore UPW move India pacer Shikha Pandey admitted that she was hoping to be repurchased by the Delhi Capitals during the WPL 2026 auction. Shikha played three seasons for DC before being not retained by the franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-ruturaj-gaikwad-sanju-samson-opening-csk-ipl-2026-2828235-2025-11-30",
      "headline": "Is Ruturaj, Sanju opening pair viable for CSK? R Ashwin gives his take Former India all-rounder Ravichandran Ashwin shared his views on Ruturaj Gaikwad and Sanju Samson opening combination for CSK in IPL 2026. He mentioned that Ayush Mhatre and Urvil Patel are also making a strong case for themselves to be in the opening slot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rohit-sharma-virat-kohli-odi-mindset-roko-mentality-2828247-2025-11-30",
      "headline": "Ro-Ko mentality: Rohit Sharma, Virat Kohli reveal newfound zeal for ODIs Rohit Sharma and Virat Kohli revealed their newfound zeal for ODIs as both men get ready for the series against South Africa. Rohit and Kohli only play ODIs for India and are aiming to keep themselves in contention for the World Cup in 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-odi-live-score-rohit-sharma-virat-kohli-ranchi-2828244-2025-11-30",
      "headline": "Rohit, Kohli at the crease after Jaiswal falls in 4th over India vs South Africa 1st ODI Live Score and Updates: Yashasvi Jaiswal falls after a quickfire start. Nandre Burger gets the first breakthrough for South Africa in the 4th over. Jaiswal's wicket has meant that Virat Kohli has joined Rohit Sharma at the crease as India hunt a big total in Ranchi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-12-ball-fifty-for-punjab-in-smat-emulates-yuvraj-singh-2828238-2025-11-30",
      "headline": "Abhishek Sharma smashes 12-ball fifty in SMAT, emulates mentor Yuvraj Singh India's opening batter Abhishek Sharma entered the record books with a 12-ball half century for Punjab in the Syed Mushtaq Ali Trophy 2025-26. He went on to score a 32-ball century and got involved in a massive partnership with Prabhsimran Singh for the first wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-rohit-sharma-virat-kohli-contrasting-styles-greatness-2828228-2025-11-30",
      "headline": "2 roads, 1 destination: Rohit Sharma, Virat Kohli and the art of ODI dominance One bat carves up powerplays, the other sculpts chases. One speaks in sixes, the other in singles. In ODI cricket's evolving landscape, Rohit Sharma and Virat Kohli prove that greatness can arrive by different paths but land at the same destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-bust-up-inter-miami-vs-new-york-city-fc-mls-cup-final-2828193-2025-11-30",
      "headline": "Watch: Lionel Messi involved in ugly spat during Inter Miami's East final win Lionel Messi was involved in an ugly spat during Inter Miami's dominant win over New York City FC during the Eastern Conference Final of the MLS on Saturday, November 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-rohit-sharma-virat-kohli-odi-mindset-roko-mentality-2828247-2025-11-30",
      "headline": "Ro-Ko mentality: Rohit Sharma, Virat Kohli reveal newfound zeal for ODIs Rohit Sharma and Virat Kohli revealed their newfound zeal for ODIs as both men get ready for the series against South Africa. Rohit and Kohli only play ODIs for India and are aiming to keep themselves in contention for the World Cup in 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-odi-live-score-rohit-sharma-virat-kohli-ranchi-2828244-2025-11-30",
      "headline": "Rohit, Kohli at the crease after Jaiswal falls in 4th over India vs South Africa 1st ODI Live Score and Updates: Yashasvi Jaiswal falls after a quickfire start. Nandre Burger gets the first breakthrough for South Africa in the 4th over. Jaiswal's wicket has meant that Virat Kohli has joined Rohit Sharma at the crease as India hunt a big total in Ranchi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-12-ball-fifty-for-punjab-in-smat-emulates-yuvraj-singh-2828238-2025-11-30",
      "headline": "Abhishek Sharma smashes 12-ball fifty in SMAT, emulates mentor Yuvraj Singh India's opening batter Abhishek Sharma entered the record books with a 12-ball half century for Punjab in the Syed Mushtaq Ali Trophy 2025-26. He went on to score a 32-ball century and got involved in a massive partnership with Prabhsimran Singh for the first wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-rohit-sharma-virat-kohli-contrasting-styles-greatness-2828228-2025-11-30",
      "headline": "2 roads, 1 destination: Rohit Sharma, Virat Kohli and the art of ODI dominance One bat carves up powerplays, the other sculpts chases. One speaks in sixes, the other in singles. In ODI cricket's evolving landscape, Rohit Sharma and Virat Kohli prove that greatness can arrive by different paths but land at the same destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-bust-up-inter-miami-vs-new-york-city-fc-mls-cup-final-2828193-2025-11-30",
      "headline": "Watch: Lionel Messi involved in ugly spat during Inter Miami's East final win Lionel Messi was involved in an ugly spat during Inter Miami's dominant win over New York City FC during the Eastern Conference Final of the MLS on Saturday, November 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-paddy-upton-insecurity-guwahati-press-conference-analysis-ind-vs-sa-2828218-2025-11-30",
      "headline": "When Paddy Upton revealed a surprising insecure side of Gautam GambhirGautam Gambhir's unsettled Guwahati press conference brought Paddy Upton's old observations about his insecurities back into focus. At a time when India is searching for direction, those inner battles reveal a leader shaped by intensity, not fragility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-ranchi-weather-report-rohit-kohli-return-2025-2828203-2025-11-30",
      "headline": "IND vs SA 1st ODI, Ranchi Weather report: Will rain play spoilsport in Ro-Ko return?With Rohit Sharma nd Virat Kohli returning to the fold, India will be looking for a quick start to the ODI series against South Africa on Sunday, November 30. Will rain play spoilsport in Ranchi?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-fast-bowling-future-harshit-rana-vs-arshdeep-singh-analysis-2828191-2025-11-30",
      "headline": "Harshit Rana vs Arshdeep Singh: Battle brews to find India's next fast-bowling leaderIndia's ODI series against South Africa offers a rare glimpse into the future of the pace attack, where Harshit Rana's ruthless aggression meets Arshdeep Singh's cool, composed precision. This is the perfect stage to see who can carry India's fast-bowling legacy forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-ranchi-preview-india-redemption-2025-2828183-2025-11-30",
      "headline": "IND vs SA: What happened the last time India played an ODI in RanchiIndia return to Ranchi hoping to reset their fortunes in the first ODI against South Africa, revisiting a venue where Shreyas Iyer and Ishan Kishan scripted a memorable chase the last time the teams met in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-prediction-rohit-sharma-virat-kohli-ranchi-pitch-team-news-2828130-2025-11-30",
      "headline": "Rohit, Virat still on trial as India look to test backups in RanchiIndia (IND) vs South Africa (SA), 1st ODI preview: Rohit Sharma and Virat Kohli return to the spotlight as India look to get back to winning ways against South Africa. With KL Rahul leading a side missing several big names, India also have an opportunity to test their bench strength."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-beat-oman-junior-hockey-world-cup-goal-fest-arshdeep-singh-manmeet-singh-chennai-2828170-2025-11-29",
      "headline": "India hammer Oman 17-0 to secure back-to-back Junior Hockey World Cup winsIndia stormed to their second straight Junior Hockey World Cup victory with a 17-0 demolition of Oman, powered by three hat-tricks and relentless attacking play in rain-hit Madurai as they moved closer to topping Pool B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-blind-women-world-cup-champions-president-draupadi-murmu-signed-bat-2828169-2025-11-29",
      "headline": "President Murmu meets Blind Women's T20 World Cup champions, receives signed team batIndia's Blind Women's T20 World Cup champions met President Droupadi Murmu at Rashtrapati Bhavan, gifting her an autographed bat as she honoured their historic unbeaten title run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/niki-poonacha-australian-open-2026-doubles-wildcard-kslta-reward-2828158-2025-11-29",
      "headline": "Niki Poonacha earns Australian Open doubles wildcard after Asia-Pacific playoff winNiki Kaliyanda Poonacha sealed a main-draw berth for the 2026 Australian Open men's doubles after winning the Asia-Pacific Wildcard Playoff with Thai partner Pruchya Isaro. The KSLTA announced a ₹1 lakh reward to celebrate the Indian's Grand Slam breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-odi-prediction-rohit-sharma-virat-kohli-ranchi-pitch-team-news-2828130-2025-11-30",
      "headline": "Rohit, Virat still on trial as India look to test backups in RanchiIndia (IND) vs South Africa (SA), 1st ODI preview: Rohit Sharma and Virat Kohli return to the spotlight as India look to get back to winning ways against South Africa. With KL Rahul leading a side missing several big names, India also have an opportunity to test their bench strength."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-beat-oman-junior-hockey-world-cup-goal-fest-arshdeep-singh-manmeet-singh-chennai-2828170-2025-11-29",
      "headline": "India hammer Oman 17-0 to secure back-to-back Junior Hockey World Cup winsIndia stormed to their second straight Junior Hockey World Cup victory with a 17-0 demolition of Oman, powered by three hat-tricks and relentless attacking play in rain-hit Madurai as they moved closer to topping Pool B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-blind-women-world-cup-champions-president-draupadi-murmu-signed-bat-2828169-2025-11-29",
      "headline": "President Murmu meets Blind Women's T20 World Cup champions, receives signed team batIndia's Blind Women's T20 World Cup champions met President Droupadi Murmu at Rashtrapati Bhavan, gifting her an autographed bat as she honoured their historic unbeaten title run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/niki-poonacha-australian-open-2026-doubles-wildcard-kslta-reward-2828158-2025-11-29",
      "headline": "Niki Poonacha earns Australian Open doubles wildcard after Asia-Pacific playoff winNiki Kaliyanda Poonacha sealed a main-draw berth for the 2026 Australian Open men's doubles after winning the Asia-Pacific Wildcard Playoff with Thai partner Pruchya Isaro. The KSLTA announced a ₹1 lakh reward to celebrate the Indian's Grand Slam breakthrough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-sa-kl-rahul-hails-return-of-rohit-kohli-eyes-fresh-start-after-test-whitewash-ytvd-2828156-2025-11-29",
      "headline": "IND vs SA ODI Series: KL Rahul Hails Return of Rohit, Kohli, Eyes Fresh Start After Test WhitewashIn this special report, stand-in captain KL Rahul addresses the media ahead of India's three-match ODI series against South Africa in Ranchi. Following a disappointing 0-2 Test series whitewash, Rahul emphasises the need to 'forget what happened a week ago' and focus on winning. He welcomes the return of senior stalwarts Rohit Sharma and Virat Kohli, stating, 'Their importance at any point is huge. To have senior players in the team obviously makes the dressing room feel a lot more confident.' The report also details Shubman Gill's absence due to a neck injury and the likely inclusion of Yashasvi Jaiswal and Ruturaj Gaikwad in the playing XI. Rahul highlights the value of a settled team as India looks to bounce back on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-sri-lanka-tri-series-final-shaheen-nawaz-babar-azams-chase-2828147-2025-11-29",
      "headline": "Shaheen, Nawaz and Babar star as Pakistan hammer Sri Lanka to win tri-series finalShaheen Afridi and Mohammad Nawaz picked up three wickets each before Babar Azam guided Pakistan's chase to a commanding six-wicket win over Sri Lanka in the tri-series final in Rawalpindi on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-criticises-india-pitches-no-real-off-spinner-after-ravichandran-ashwin-2828144-2025-11-29",
      "headline": "Harbhajan Singh criticises India's pitches, says no real off-spinner after AshwinHarbhajan Singh criticised India's continued use of rank turners, saying such pitches limit the growth of both batters and bowlers. He also warned that India currently lack a specialist off-spinner after R. Ashwin's retirement, calling for more workload for Washington Sundar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-series-livestreaming-fixtures-schedule-squad-2828143-2025-11-29",
      "headline": "IND vs SA, ODI series live-streaming, when and where to watch: All you need to knowIND vs SA: India look to reset after a stinging 2–0 Test defeat as Rohit Sharma and Virat Kohli return for the ODI series against South Africa. With KL Rahul leading and de Kock in top form, the contest promises intensity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sl-tri-series-final-fakhar-zaman-argues-umpire-diving-catch-ruled-not-out-2828118-2025-11-29",
      "headline": "Fakhar Zaman argues with umpire after diving catch gets not-outFakhar Zaman was left fuming at the on-field umpire after his stunning diving catch was ruled not out. The players even took a cheeky dig at the umpire in the very next delivery by appealing for a dismissal that was clean bowled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-quinton-de-kock-rohit-sharma-virat-kohli-effect-odi-series-ashwell-prince-2828106-2025-11-29",
      "headline": "Quinton de Kock brings the Ro-Ko effect to SA dressing room: Ashwell PrinceIND vs SA: South Africa batting coach Ashwell Prince says Quinton de Kock gives his team the same stabilising presence Rohit Sharma and Virat Kohli provide India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/syed-modi-badminton-kidambi-srikanth-tanvi-sharma-gayatri-gopichand-treesa-2828105-2025-11-29",
      "headline": "Syed Modi: Kidambi Srikanth storms into final, Tanvi's dream run ends in semisSyed Modi International 2025: Former champion Kidambi Srikanth outclassed compatriot Mithun Manjunath to storm into the final. Young guns Tanvi Sharma and Unati Hooda lost in the women's singles semifinal in Lucknow on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-ipl-2026-auction-pakistan-super-league-statement-2828099-2025-11-29",
      "headline": "Faf du Plessis pulls out of IPL 2026 auction, commits to playing in Pakistan Super LeagueFaf du Plessis has pulled out of the IPL 2026 auction as he eyes a fresh new challenge in the Pakistan Super League."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}