{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-331-points-lower-nifty-below-26000-bel-down-3-percent-2825127-2025-11-24",
      "headline": "Sensex closes 331 points lower, Nifty below 26,000; BEL down 3%The S&P BSE Sensex was down 331.21 points to close at 84,900.71, while the NSE Nifty50 lost 108.65 points to end at 25,959.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gst-20-rising-consumption-economic-boost-impact-on-dalal-street-sensex-and-nifty-explained-2825085-2025-11-24",
      "headline": "GST 2.0 is lifting consumption. Can it lift Sensex and Nifty too?GST 2.0 has pushed prices down and demand up, but whether that momentum can lift Sensex and Nifty will depend on earnings, capex and global stability in the months ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hal-statement-tejas-fighter-jet-crash-dubai-show-isolated-incident-share-price-down-2825083-2025-11-24",
      "headline": "Tejas crash at Dubai Airshow isolated occurrence: Read HAL's full statementAn Indian Air Force Tejas fighter jet crashed in the United Arab Emirates on Friday while taking part in the Dubai Airshow 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-rama-raju-mantena-udaipur-wedding-star-studded-jennifer-lopez-trump-ranveer-singh-2825072-2025-11-24",
      "headline": "Who is Rama Raju Mantena, pharma king behind Udaipur's star-studded wedding?Rama Raju Mantena is a well-known name in the US pharmaceutical industry. Originally from Vijayawada in Andhra Pradesh, Mantena moved to the United States in the 1980s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-share-price-falls-4-percent-after-tejas-fighter-jet-crash-at-dubai-airshow-2824967-2025-11-24",
      "headline": "HAL share price falls 4% after Tejas fighter jet crash at Dubai AirshowThe HAL stock slipped to around Rs 4,430, down roughly 3.6% at 10:44 am. Earlier in the day, the stock had tumbled over 8%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-allotment-out-check-your-status-expected-share-price-listing-details-gmp-2824935-2025-11-24",
      "headline": "Excelsoft Technologies IPO allotment out: Did you get shares? Check listing detailsExcelsoft Technologies IPO allotment: Applicants who subscribed to the IPO can check their status through the BSE website or the registrar, MUFG Intime India Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-start-week-on-a-positive-note-as-it-stocks-lead-the-charge-2824920-2025-11-24",
      "headline": "Sensex, Nifty start week on a positive note as IT stocks lead the chargeBroader market indices were also in the green, mirroring the positive start. The tone was set by IT heavyweights: Tech Mahindra and Infosys jumped over 2% each, followed closely by gains in HCLTech and Wipro. Eicher Motors also featured among the early winners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-legal-setback-us-court-fine-penalty-usd-194-million-vs-csc-dxc-technology-2824905-2025-11-24",
      "headline": "TCS suffers legal setback in US with $194 million penalty upheldThe matter has now been sent back to the Northern District of Texas, Dallas Division, which has been asked to review the injunction as per the directions of the Appeals Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lakshmi-mittal-leaving-uk-why-tax-changes-net-worth-moving-to-dubai-inheritance-capital-gains-arcelormittal-2824891-2025-11-24",
      "headline": "Why billionaire Lakshmi Mittal is saying goodbye to the UKAs per the Forbes rich list, Mittal has a net worth of $21.4 billion. He is the 12th richest Indian and the 104th richest person in the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-10-key-changes-every-employee-should-know-2824640-2025-11-23",
      "headline": "New labour codes: 10 key changes every employee should knowWhether someone works full-time, on a contract, or in sector-specific roles like media, plantations or factories, the new framework affects nearly everyone. Here are the key updates workers should be aware of, along with several other important changes that haven't received enough attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-challenge-unfair-will-cheating-inheritance-property-transfer-mental-state-doubt-witness-testimony-2824524-2025-11-23",
      "headline": "Feel cheated by your family will? Know your legal rightsWhether it is a sudden change in beneficiaries, unequal division of property, or doubts about the person's mental state when the will was written, such situations often create confusion, anger, and emotional stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/clear-home-loan-early-simple-steps-to-pay-it-quickly-emis-high-interest-refinancing-higher-down-payment-2824523-2025-11-23",
      "headline": "Want to clear your home loan early? Simple ways to pay it off quicklyPay low EMIs and your tenure stretches, increasing your interest costs. Pay higher EMIs, and you could save years and lakhs on the total interest you pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-code-explained-pay-structure-in-hand-salary-rise-fall-impact-basic-pf-deduction-2824336-2025-11-22",
      "headline": "New labour codes are here: Will your in-hand salary rise or fall?With the new labour codes now implemented, many employees are trying to understand what it means for their salary structure, especially basic salary, PF deductions and take-home pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-changes-paid-leaves-working-hours-health-coverage-old-vs-new-laws-2824290-2025-11-22",
      "headline": "New labour codes: What changes for paid leave, work hours and health benefitsThe new labour codes apply across sectors and are designed to improve safety, reduce fatigue and make workplaces more predictable for millions of workers in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gratuity-new-labour-codes-law-fixed-term-employees-explained-2824241-2025-11-22",
      "headline": "Gratuity in a year? Only if you're a fixed-term employee. Here's what it meansOnly employees hired on fixed-term contracts qualify for the new one-year gratuity rule. Permanent staff remain under the five-year norm, making this benefit exclusive to India's expanding fixed-term workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-codes-laws-explained-from-gratuity-to-gig-worker-insurance-2824221-2025-11-22",
      "headline": "From gratuity to gig worker insurance: What new labour laws mean for employeesFrom gratuity to insurance and safer workplaces, the new rules expand what employees can expect from their jobs. Staying informed will help workers make the most of these changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/employees-to-get-gratuity-after-1-year-of-service-as-per-new-labour-law-overhaul-2824132-2025-11-21",
      "headline": "Fixed-term employees to get gratuity after 1 year of service under new labour lawsAccording to the Union Labour Ministry, the restructuring is aimed at ensuring better wages, wider social security coverage and improved health-related protections for workers across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-400-points-nifty-ends-above-26000-amid-volatile-trade-2823801-2025-11-21",
      "headline": "Sensex tumbles 400 points, Nifty ends above 26,000 amid volatile tradeThe S&P BSE Sensex fell more than 400 points to close at 85,231, while the NSE Nifty50 managed to stay above the 26,000 mark despite broad-based weakness across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-implements-four-labour-codes-replacing-29-old-laws-check-details-2823795-2025-11-21",
      "headline": "Government implements four labour codes, replacing 29 old laws. Check detailsThe move brings together decades-old labour rules that were scattered across multiple legislations into a consolidated framework. Many of these older laws date back to the pre-Independence and early post-Independence era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-to-record-low-of-rs-8945-amid-us-india-trade-uncertainty-2823785-2025-11-21",
      "headline": "Rupee slides to record low of Rs 89.45 amid US-India trade uncertaintyThe outlook for the rupee remains uncertain as global risk sentiment stays fragile and investors wait for clearer signals from both the Fed and ongoing trade negotiations between Washington and New Delhi."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-palak-muchhal-appeals-for-privacy-as-brother-palashs-wedding-gets-postponed-2825319-2025-11-24",
      "headline": "Singer Palak Muchhal seeks privacy as brother Palash's wedding is postponed Smriti Mandhana and Palash Muchhal's wedding has been indefinitely postponed after the cricketer's father and Palash both fell ill ahead of the ceremony. Palak Muchhal urged fans and the media to respect the families' privacy as they focus on recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-recalls-dharmendra-warmth-timeless-charm-says-he-was-loved-like-no-one-else-2825290-2025-11-24",
      "headline": "Loved like no one else: Javed Akhtar recalls Dharmendra's warmth, timeless charm Poet and lyricist Javed Akhtar remembered Dharmendra with rare warmth, reflecting on his innocence, charm among women, iconic range and the golden era of Hindi cinema he defined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-mohanlal-to-jr-ntr-tributes-for-dharmendra-pour-in-from-south-stars-2825261-2025-11-24",
      "headline": "Chiranjeevi, Mohanlal to Jr NTR: Tributes for Dharmendra pour in from South stars South Indian stars including Chiranjeevi, Allu Arjun, Jr NTR, Mahesh Babu and Venkatesh Daggubati paid tributes to actor Dharmendra, who died at 89. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-remembers-dharmendra-golden-heart-in-tribute-farewell-my-friend-2825234-2025-11-24",
      "headline": "Farewell, my friend: Rajinikanth remembers Dharmendra's golden heart in tribute Rajinikanth pays an emotional tribute to Dharmendra, remembering his \"golden heart\" and their decades-long friendship after the legendary actor died at 89 in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-recalls-her-first-signing-amount-came-from-dharmendra-banner-2825225-2025-11-24",
      "headline": "Priyanka Chopra recalls her first signing amount came from Dharmendra's banner Priyanka Chopra, in a heartfelt tribute to Dharmendra, reflected on the beginning of her career and shared that his family provided \"warmth and grace\" to a complete newcomer. She concluded that the \"true blue Hindi film Hero\" leaves behind an indelible legacy for cinema and for those, like her, he inspired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-revisits-mujhse-shaadi-karogi-look-jokes-about-her-thin-eyebrows-2825195-2025-11-24",
      "headline": "Priyanka Chopra revisits Mujhse Shaadi Karogi look, jokes about her thin eyebrows Priyanka Chopra amused fans by sharing a throwback still from 'Mujhse Shaadi Karogi', joking about her ultra-thin 2004 eyebrows. The light-hearted post sparked nostalgia as the actor gears up for her return to Indian cinema with SS Rajamouli's 'Varanasi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakul-preet-singh-alerts-fans-about-whatsapp-impersonator-speaking-on-her-behalf-2825210-2025-11-24",
      "headline": "Rakul Preet Singh alerts fans about WhatsApp impersonator speaking on her behalf Actor Rakul Preet Singh issued a strong warning to her followers, clarifying that someone is impersonating her on WhatsApp using a different number. She urged fans not to engage in the random conversations and advised them to kindly block the fraudulent account immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/celina-jaitly-fresh-appeal-to-government-for-brother-return-from-uae-detention-2825168-2025-11-24",
      "headline": "Celina Jaitly's fresh appeal to government for brother's return from UAE detention Fearing what her brother has endured over 444 days in detention, Celina Jaitly stressed that targeting Indian soldiers abroad is a national security concern, pleading with the government to safely bring their veteran back home to the country he fought for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-faces-backlash-after-viral-video-contradicts-sattvic-lifestyle-claims-2825175-2025-11-24",
      "headline": "Ranbir Kapoor faces backlash after viral video contradicts sattvic lifestyle claims A viral video from 'Dining With The Kapoors' has sparked controversy for Ranbir Kapoor, contradicting earlier reports that he had adopted a sattvic lifestyle for his role in Ramayana. The clip has triggered debate online, with many accusing the actor's PR team of making exaggerated claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-he-man-defied-conventional-morality-machismo-2825167-2025-11-24",
      "headline": "Dharmendra: The He-Man who defied conventional morality and machismo Dharmendra's superstardom is about intensity, comedy and abundant emotions. Above all, however, he will always be remembered as the original machoman to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/dharmendra-news-today-when-actor-told-underworld-dons-mumbai-entire-punjab-come-to-fight-if-they-threatened-him-ikkis-2825118-2025-11-24",
      "headline": "When Dharmendra dared the underworld: Truck bharke log Punjab se ladne aa jayenge In an era when Bollywood bowed to the underworld, Dharmendra challenged the dons when he was threatened. He warned the gangsters that he had an army in Punjab that would come to fight them. He was called the He-Man for this raw courage and rugged charm in an industry that was seen too quick to cave in. Dharmendra passed away on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/end-of-an-era-tracing-cinematic-journey-of-bollywoods-he-man-dharmendra-2817504-2025-11-24",
      "headline": "End of an era: Tracing cinematic journey of Bollywood's He-Man Dharmendra Dharmendra's death marks the end of an era in Bollywood. His versatile roles across the genres of romance, action and comedy have left a lasting legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-in-last-social-media-post-to-fans-may-you-be-blessed-with-long-life-2816796-2025-11-24",
      "headline": "Dharmendra in last social media post to fans: May you be blessed with long life Legendary actor Dharmendra died at 89 in Mumbai after battling respiratory issues. His final Instagram post, a heartfelt Dussehra message, now feels like a farewell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-second-film-good-bad-ugly-director-adhik-ravichandran-shooting-february-2825117-2025-11-24",
      "headline": "Good Bad Ugly director confirms second film with Ajith, shooting in February Director Adhik Ravichandran confirmed his second film with Ajith Kumar, with shooting likely to start in February. The pre-production work is almost complete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-cremated-in-mumbai-akshay-kumar-sharmila-tagore-pay-emotional-tribute-2825112-2025-11-24",
      "headline": "Dharmendra cremated in Mumbai: Akshay Kumar, Sharmila Tagore pay emotional tribute Dharmendra died at the age of 89 years on Monday, November 24, 2025. Akshay Kumar, Farhan Akhtar, Sharmila Tagore, Jr NTR and others, paid their tributes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-remembers-dharmendra-with-deep-grief-wanted-him-to-celebrate-his-birthday-2825113-2025-11-24",
      "headline": "Dharmendra, through Sharmila Tagore's lens: We were safe if we were with Dharam Sharmila Tagore remembered Dharmendra with deep grief, recalling his generosity, warmth, and the protection he offered throughout their decades-long bond. She gave a heartfelt tribute to the legendary actor who died at 89."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhi-na-jao-chhodkar-karan-johars-tearful-goodbye-to-dharmendra-2825100-2025-11-24",
      "headline": "Abhi na jao chhodkar…: Karan Johar's tearful goodbye to Dharmendra Karan Johar penned an emotional tribute to Dharmendra. Remembered as a \"bonafide legend\" and Bollywood's He-Man, the veteran star leaves behind an irreplaceable legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-vs-mastii-4-box-office-farhan-akhtar-film-surges-ahead-of-comedy-2825074-2025-11-24",
      "headline": "120 Bahadur vs Mastii 4 box office: Farhan Akhtar's film surges ahead of sex comedy Two distinct Hindi films, 120 Bahadur and Mastii 4, opened on November 21, 2025. Their box office battle intensifies as new romantic dramas – 'Tere Ishk Mein' and 'Gustaakh Ishq' release next week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dharmendra-dies-at-89-ians-tributes-hema-malini-family-2825089-2025-11-24",
      "headline": "Dharmendra, Bollywood's beloved He-Man, dies at 89 Dharmendra, the legendary He-Man of Bollywood, died at 89 in Mumbai. With a six-decade career, countless iconic films, and an enduring legacy, he leaves behind a void that Indian cinema can never fill."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chinas-actions-needless-hurdles-to-normalcy-govt-sources-after-arunachal-woman-called-chinese-at-airport-2825304-2025-11-24",
      "headline": "China's actions hurdles to normalcy: Govt sources on woman's Shanghai ordealThe woman, Prema Wangjom Thongdok, alleged an 18-hour ordeal marked by harassment, mocking by officials, and pressure to buy a new ticket, before the Indian Consulate intervened to secure her exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dharmendra-dies-at-89-ians-tributes-hema-malini-family-2825089-2025-11-24",
      "headline": "Dharmendra, Bollywood's beloved He-Man, dies at 89Dharmendra, the legendary He-Man of Bollywood, died at 89 in Mumbai. With a six-decade career, countless iconic films, and an enduring legacy, he leaves behind a void that Indian cinema can never fill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-government-asks-offices-to-enforce-50-work-from-home-amid-severe-air-pollution-2825294-2025-11-24",
      "headline": "Delhi offices to work at 50% strength, rest WFH as capital chokes under toxic hazeEssential services, hospitals, utilities and pollution-control teams are exempt, while district authorities have been directed to ensure strict compliance, with penalties applicable for violations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-kamasutra-of-chaos-guwahati-test-position-lost-2825298-2025-11-24",
      "headline": "Gautam Gambhir and the Kamasutra of chaos: When Indian team lost its positionIND vs SA: Gautam Gambhir's obsession with constant change has turned Indian cricket into his personal Kamasutra of experimental positions, endless adjustments, and zero satisfaction. The result? Confusion disguised as innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ethiopia-hayli-gubbi-volcano-erupts-for-first-time-10000-years-sends-massive-ash-plume-across-red-sea-2825249-2025-11-24",
      "headline": "Ethiopia's Hayli Gubbi volcano erupts after 10,000 years, spews massive ash cloudThe eruption, detected through satellite imagery over the remote Danakil Depression, pushed ash across the Red Sea toward Yemen and Oman, prompting aviation alerts and air-quality advisories in parts of the Arabian Peninsula."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-family-net-worth-falls-over-1-billion-amid-cryptocurrency-slump-crypto-crash-eric-trump-memecoin-tmtg-2825302-2025-11-24",
      "headline": "Trump's family wealth falls by over $1 billion after crypto shockDonald Trump's family's wealth has dropped by over $1 billion, largely due to losses in high-risk cryptocurrency ventures, including Trump-branded memocoin and Eric Trump's Bitcoin investments. However, Eric Trump remained unfazed and urged investors to double down on their investments in the crypto market, calling it a great buying opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-pollution-protest-demonstrators-sent-to-jail-maoist-poster-allege-police-assault-2825272-2025-11-24",
      "headline": "Men beaten, women groped: Delhi pollution protesters allege custodial assaultSeveral demonstrators told the court on Monday that they were beaten after being detained following a protest at India Gate over Delhi's toxic air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-water-resources-department-government-adolf-hitler-benito-mussolini-post-x-official-account-twitter-fascist-viral-post-2825275-2025-11-24",
      "headline": "Bihar Water Dept hailed Hitler, Mussolini for 9 months, deleted after post went viralA verified Bihar government account praised Hitler and Mussolini, and the post stayed online for nine months. The post from the apparently hacked account was deleted on Monday, but not before it went viral and sparked a memefest. What people found most intriguing is that a post from a hacked account stayed live for nine months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-wedding-social-media-posts-removed-father-health-scare-2825318-2025-11-24",
      "headline": "Smriti Mandhana removes wedding posts as plans put on hold after father's health scareSmriti Mandhana's wedding celebrations were halted after a sudden health scare involving her father. As the family focuses on recovery, the Indian star has removed all related posts from her social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kannur-abu-dhabi-indigo-flight-diverted-to-ahmedabad-due-to-volcanic-activity-in-ethiopia-2825219-2025-11-24",
      "headline": "UAE-bound IndiGo flight diverted as Ethiopia volcano erupts after 10,000 yearsA major volcanic eruption in Ethiopia has disrupted flight operations, leading to the diversion of an IndiGo flight to Ahmedabad. Aviation authorities across India are closely monitoring the situation to ensure passenger safety amid ash plume threats.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-labels-venezuelas-cartel-de-los-soles-as-terrorist-organisation-2825320-2025-11-24",
      "headline": "US labels Venezuela's Cartel de los Soles as terrorist organisationThe United States has officially labelled Cartel de los Soles as a foreign terrorist organisation, intensifying sanctions linked to Venezuela's top officials. Venezuela has strongly rejected the move, calling it a baseless attempt to justify intervention.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-kabaddi-team-wins-second-consecutive-world-cup-dhaka-pm-modi-2825299-2025-11-24",
      "headline": "India women win 2nd successive Kabaddi World Cup title, PM Modi sends wishesIndian women's kabaddi team won their second successive World Cup title in Dhaka. PM Modi said the victory will inspire future generations to take up the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/sindhs-separation-from-india-and-potential-return-2825138-2025-11-24",
      "headline": "Sindh's separation from India, and potential returnDefence Minister Rajnath Singh's remark on Sindh's potential return to India underscores a deep historical and cultural paradox, contrasting Sindh's ancient ties to India with its complex political identity in Pakistan today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/from-serenity-to-celebration-gujarat-in-all-its-shades-2823221-2025-11-20",
      "headline": "From Serenity to Celebration - Gujarat in All Its ShadesAnother destination that has stood the test of time and modernisation is Vadnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/xi-reasserts-taiwan-claim-in-call-with-trump-amid-thaw-in-china-us-ties-2825323-2025-11-24",
      "headline": "Xi reasserts Taiwan claim in call with Trump amid thaw in China-US tiesChina regards Taiwan as part of its territory and has not ruled out the use of force to take control of it, though the island's government rejects Beijing's claim and says only Taiwan's people can decide their future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/woman-doctor-died-by-suicide-in-hyderabad-over-us-visa-rejection-2824902-2025-11-24",
      "headline": "Depressed over US visa rejection, woman doctor dies by suicide in HyderabadAlthough the exact cause of death is yet unknown, the preliminary report suggests that the deceased either had an overdose of sleeping pills or injected herself on Friday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-he-man-defied-conventional-morality-machismo-2825167-2025-11-24",
      "headline": "Dharmendra: The He-Man who defied conventional morality and machismoDharmendra's superstardom is about intensity, comedy and abundant emotions. Above all, however, he will always be remembered as the original machoman to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/dharmendra-news-today-when-actor-told-underworld-dons-mumbai-entire-punjab-come-to-fight-if-they-threatened-him-ikkis-2825118-2025-11-24",
      "headline": "When Dharmendra dared the underworld: Truck bharke log Punjab se ladne aa jayengeIn an era when Bollywood bowed to the underworld, Dharmendra challenged the dons when he was threatened. He warned the gangsters that he had an army in Punjab that would come to fight them. He was called the He-Man for this raw courage and rugged charm in an industry that was seen too quick to cave in. Dharmendra passed away on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-day-3-report-jansen-yashasvi-2825149-2025-11-24",
      "headline": "India on brink of another home whitewash after batting implodesIndia found themselves sinking deeper into crisis on Day 3 in Guwahati, staring at the grim possibility of another home series sweep after a fresh batting collapse handed South Africa full control of the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-remembers-dharmendra-with-deep-grief-wanted-him-to-celebrate-his-birthday-2825113-2025-11-24",
      "headline": "Dharmendra, through Sharmila Tagore's lens: We were safe if we were with DharamSharmila Tagore remembered Dharmendra with deep grief, recalling his generosity, warmth, and the protection he offered throughout their decades-long bond. She gave a heartfelt tribute to the legendary actor who died at 89."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-a-win-asia-cup-rising-stars-title-third-time-super-over-final-2824832-2025-11-24",
      "headline": "India denied, but Mohsin Naqvi hands Pakistan Asia Cup trophyMohsin Naqvi handed the trophy to Pakistan A after they won the Rising Stars Asia Cup title after beating Bangladesh A in the thrilling final that went into the Super Over in Doha on Sunday. Naqvi, who is the Asian Cricket Council chief, famously denied India the Asia Cup after they beat Pakistan in the final earlier this year.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/dhs-proposes-new-rule-to-overhaul-opt-program-will-affect-indian-students-stem-h1b-f1-visa-american-workers-2825165-2025-11-24",
      "headline": "How DHS' overhaul of OPT programme will affect Indian students in USThe Optional Practical Training (OPT) programme in the US might get suspended or heavily restricted, a move that could significantly impact Indian students who rely on it to gain work experience and transition to H-1B visas. The Department of Homeland Security (DHS) has proposed a new OPT rule to curb fraud, protect US workers, and improve oversight of the Student and Exchange visitor programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-funeral-live-updates-bollywood-beloved-he-man-dies-days-before-his-90th-birthday-2825094-2025-11-24",
      "headline": "Updates: Dharmendra's fans bid emotional goodbye outside his Mumbai houseActor Dharmendra, Bollywood's beloved 'He-Man', died on November 24. The actor's last rites were at the Pawan Hans crematorium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-revise-laws-for-citizenship-by-descent-indian-origin-families-bill-c3-ircc-ottawa-rules-requirements-2825052-2025-11-24",
      "headline": "Canada brings big changes to citizenship rules; India-born people to benefitCanada has taken a landmark step in modernising its citizenship laws that will benefit thousands of India-born Canadians. Bill C-3, which has received royal assent, allows naturalised citizens to pass on citizenship rights to foreign-born or adopted children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/sharmila-tagore-recalls-dharmendras-kindness-and-quiet-strength-2825297-2025-11-24",
      "headline": "Sharmila Tagore recalls Dharmendra's kindness and quiet strengthSharmila Tagore paid an emotional tribute to Dharmendra, remembering him as a gentle, protective co-star whose goodness touched everyone around him. She recalled how his warmth, dignity and quiet strength made her feel safe throughout their long association."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/when-dharmendra-recalled-receiving-love-from-fans-especially-women-way-too-much-2825216-2025-11-24",
      "headline": "When Dharmendra recalled receiving love from fans, especially women, way too muchIn a 2017 interview with senior journalist and news anchor Rajdeep Sardesai for India Today, Dharmendra humorously noted that women loved him \"way too much.\" He also mentioned that while he appreciated realistic films, he felt today's actors prioritised money and that people were sadly \"forgetting their roots.\"\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-wedding-social-media-posts-removed-father-health-scare-2825318-2025-11-24",
      "headline": "Smriti Mandhana removes wedding posts as plans put on hold after father's health scare Smriti Mandhana's wedding celebrations were halted after a sudden health scare involving her father. As the family focuses on recovery, the Indian star has removed all related posts from her social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-kabaddi-team-wins-second-consecutive-world-cup-dhaka-pm-modi-2825299-2025-11-24",
      "headline": "India women win 2nd successive Kabaddi World Cup title, PM Modi sends wishes Indian women's kabaddi team won their second successive World Cup title in Dhaka. PM Modi said the victory will inspire future generations to take up the sport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-kamasutra-of-chaos-guwahati-test-position-lost-2825298-2025-11-24",
      "headline": "Gautam Gambhir and the Kamasutra of chaos: When Indian team lost its position IND vs SA: Gautam Gambhir's obsession with constant change has turned Indian cricket into his personal Kamasutra of experimental positions, endless adjustments, and zero satisfaction. The result? Confusion disguised as innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohan-bopanna-danill-medvedev-sumit-nagal-gael-monfils-team-world-tennis-league-2825291-2025-11-24",
      "headline": "Medvedev-Bopanna and Nagal-Monfils team up for World Tennis League in December The World Tennis League returns in December with a fresh venue and a star-studded line-up. With Medvedev, Bopanna, Kyrgios, Monfils and Nagal in action, four days of high-quality tennis await."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-reaction-joe-root-dismissal-ashes-2025-australia-england-test-2825270-2025-11-24",
      "headline": "Broad on viral reaction after Root's dismissal: Every England fan felt like that Former England bowler Stuart Broad opened up on his viral reaction to Joe Root's dismissal in the Ashes Test. Broad's reaction went viral on social media as he was in utter disbelief watching England collapse on Day 2 in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-criticism-reckless-shot-india-struggle-south-africa-guwahati-test-2825215-2025-11-24",
      "headline": "IND vs SA: Dale Steyn tears into Rishabh Pant for 'brainfade' shot in Guwahati Rishabh Pant faced heavy criticism for his reckless shot during Day 3 of the second Test against South Africa. Dale Steyn and Anil Kumble said that Pant needs to show more responsibility to help India recover in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-washington-sundar-stay-positive-guwahati-test-struggle-press-conference-2825227-2025-11-24",
      "headline": "Washington Sundar urges faith as India struggle in Guwahati Test: Gotta stay positive IND vs SA: Washington Sundar asked the team and fans to stay positive despite India's struggles in Guwahati. Backing intent over outcomes, he stressed that belief in plans and players remains crucial in difficult moments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-washington-sundar-defends-rishabh-pant-dhruv-jurel-dismissal-guwahati-test-presser-2825223-2025-11-24",
      "headline": "Washington Sundar defends Pant, Jurel after India's batting implosion in Guwahati IND vs SA: Washington Sundar defended Rishabh Pant and Dhruv Jurel after India's collapse in Guwahati. While execution failed, he insisted the intent was right as South Africa tightened their grip on the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-pickleball-league-draft-quang-duong-aditya-ruhela-mumbai-lucknow-2825207-2025-11-24",
      "headline": "Mumbai Smashers land Quang Duong; Lucknow Leopards take India's Aditya Ruhela World No. 3 Quang Duong and India No.1 Aditya Ruhela headlined the inaugural Indian Pickleball League Draft, as all six teams assembled squads for the country's first MYAS-recognised professional pickleball league."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/psb-overturns-life-ban-salman-butt-arshad-nadeem-coach-2825198-2025-11-24",
      "headline": "Pakistan overturns life ban on Arshad Nadeem's coach after due-process violations Pakistan Sports Board adjudicator Pervez Rashid has overturned the life ban on Arshad Nadeem's coach Salman Butt, calling the PAAF's action unconstitutional and lacking due process, clearing him to continue guiding the Olympic champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-marco-jansen-shaun-pollock-inspiration-all-rounder-guwahati-test-2825194-2025-11-24",
      "headline": "Marco Jansen does a Shaun Pollock in Guwahati Test: All-rounder reveals inspiration IND vs SA: Marco Jansen produced a match-defining all-round performance in Guwahati and revealed that Shaun Pollock is his biggest inspiration. The young South African is steadily carving a path to become a complete all-rounder for his country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-washington-sundar-stay-positive-guwahati-test-struggle-press-conference-2825227-2025-11-24",
      "headline": "Washington Sundar urges faith as India struggle in Guwahati Test: Gotta stay positive IND vs SA: Washington Sundar asked the team and fans to stay positive despite India's struggles in Guwahati. Backing intent over outcomes, he stressed that belief in plans and players remains crucial in difficult moments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-washington-sundar-defends-rishabh-pant-dhruv-jurel-dismissal-guwahati-test-presser-2825223-2025-11-24",
      "headline": "Washington Sundar defends Pant, Jurel after India's batting implosion in Guwahati IND vs SA: Washington Sundar defended Rishabh Pant and Dhruv Jurel after India's collapse in Guwahati. While execution failed, he insisted the intent was right as South Africa tightened their grip on the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-pickleball-league-draft-quang-duong-aditya-ruhela-mumbai-lucknow-2825207-2025-11-24",
      "headline": "Mumbai Smashers land Quang Duong; Lucknow Leopards take India's Aditya Ruhela World No. 3 Quang Duong and India No.1 Aditya Ruhela headlined the inaugural Indian Pickleball League Draft, as all six teams assembled squads for the country's first MYAS-recognised professional pickleball league."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/psb-overturns-life-ban-salman-butt-arshad-nadeem-coach-2825198-2025-11-24",
      "headline": "Pakistan overturns life ban on Arshad Nadeem's coach after due-process violations Pakistan Sports Board adjudicator Pervez Rashid has overturned the life ban on Arshad Nadeem's coach Salman Butt, calling the PAAF's action unconstitutional and lacking due process, clearing him to continue guiding the Olympic champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-marco-jansen-shaun-pollock-inspiration-all-rounder-guwahati-test-2825194-2025-11-24",
      "headline": "Marco Jansen does a Shaun Pollock in Guwahati Test: All-rounder reveals inspiration IND vs SA: Marco Jansen produced a match-defining all-round performance in Guwahati and revealed that Shaun Pollock is his biggest inspiration. The young South African is steadily carving a path to become a complete all-rounder for his country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nikhil-chaudhary-first-indian-this-century-australia-domestic-ton-tasmania-2825193-2025-11-24",
      "headline": "Delhi-born Chaudhary becomes first Indian in 21st century to domestic ton Down UnderDelhi-born Nikhil Chaudhary smashed a maiden first-class ton for Tasmania, becoming the first Indian this century to hit a Sheffield Shield hundred as his 163 powered the Tigers to a commanding position against NSW."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-greg-chapppell-gautam-gambhir-faces-fans-wrath-ind-vs-sa-2825179-2025-11-24",
      "headline": "Indian Greg Chapppell: Gambhir faces fans' wrath as India crumble in GuwahatiIndia suffered a heavy batting collapse on Day 3 against South Africa in Guwahati. Fans have sharply criticised head coach Gautam Gambhir's team selection and strategy amid growing concerns for India's Test future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-day-3-report-jansen-yashasvi-2825149-2025-11-24",
      "headline": "India on brink of another home whitewash after batting implodesIndia found themselves sinking deeper into crisis on Day 3 in Guwahati, staring at the grim possibility of another home series sweep after a fresh batting collapse handed South Africa full control of the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-marco-jansen-record-6-wicket-haul-fifty-plus-score-guwahati-test-2825147-2025-11-24",
      "headline": "IND vs SA: Marco Jansen scripts history with 6-wicket haul in Guwahati TestIND vs SA: Marco Jansen delivered one of the finest all-round performances by a visiting cricketer in India. His historic six-wicket haul and rapid 93 left India reeling and South Africa firmly in control in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-criticises-indian-batting-collapse-vs-south-africa-guwahati-test-2825098-2025-11-24",
      "headline": "Very ordinary batting: Ravi Shastri slams India batters after Guwahati collapseFormer India coach Ravi Shastri criticised the team's \"very ordinary\" batting after a dramatic collapse on Day 3 of the Guwahati Test against South Africa, calling the performance a worrying reflection of India's muddled decision-making and unreliable Test batting strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-tests-karun-nair-frustrations-cryptic-post-social-media-india-batting-collapse-2825091-2025-11-24",
      "headline": "Karun Nair hints at frustration with cryptic post, amidst India's batting collapseAs India's middle-order struggles against South Africa's bowling unit in the Guwahati Test, out-of-favour India batter, Karun Nair has shared a post on social media expressing his frustrations of not being out there with the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markram-flying-catch-marco-jansen-india-collapse-guwahati-test-2825038-2025-11-24",
      "headline": "IND vs SA: Aiden Markram's superhuman flying catch leaves India in deep troubleAiden Markram produced a breathtaking display of athleticism that left teammates in disbelief and sent social media into overdrive on the third day of the second Test at the Barsapara Cricket Stadium in Guwahati on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-praises-india-blind-women-team-historic-t20-world-cup-win-2825025-2025-11-24",
      "headline": "PM Modi praises India's blind women's team for historic T20 World Cup winPrime Minister Narendra Modi on Monday praised the Indian blind women's cricket team for scripting history with their title triumph at the inaugural Blind Women's T20 World Cup, calling the victory a testament to collective grit, discipline and the unwavering belief of a team that remained unbeaten throughout the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-criticises-indian-batting-collapse-vs-south-africa-guwahati-test-2825098-2025-11-24",
      "headline": "Very ordinary batting: Ravi Shastri slams India batters after Guwahati collapseFormer India coach Ravi Shastri criticised the team's \"very ordinary\" batting after a dramatic collapse on Day 3 of the Guwahati Test against South Africa, calling the performance a worrying reflection of India's muddled decision-making and unreliable Test batting strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-tests-karun-nair-frustrations-cryptic-post-social-media-india-batting-collapse-2825091-2025-11-24",
      "headline": "Karun Nair hints at frustration with cryptic post, amidst India's batting collapseAs India's middle-order struggles against South Africa's bowling unit in the Guwahati Test, out-of-favour India batter, Karun Nair has shared a post on social media expressing his frustrations of not being out there with the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markram-flying-catch-marco-jansen-india-collapse-guwahati-test-2825038-2025-11-24",
      "headline": "IND vs SA: Aiden Markram's superhuman flying catch leaves India in deep troubleAiden Markram produced a breathtaking display of athleticism that left teammates in disbelief and sent social media into overdrive on the third day of the second Test at the Barsapara Cricket Stadium in Guwahati on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-praises-india-blind-women-team-historic-t20-world-cup-win-2825025-2025-11-24",
      "headline": "PM Modi praises India's blind women's team for historic T20 World Cup winPrime Minister Narendra Modi on Monday praised the Indian blind women's cricket team for scripting history with their title triumph at the inaugural Blind Women's T20 World Cup, calling the victory a testament to collective grit, discipline and the unwavering belief of a team that remained unbeaten throughout the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-rishabh-pant-captain-reckless-shot-social-media-reaction-2825026-2025-11-24",
      "headline": "Can Rishabh Pant show responsibility? Stand-in captain blasted for his reckless shotRishabh Pant faced heavy criticism after a reckless charge and edge led to his dismissal in the Guwahati Test. With India already under pressure, his shot selection and wasted review sparked an outpouring of anger on social media, raising fresh questions over his leadership and responsibility in the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/zohran-mamdani-arsenal-fan-receives-special-video-message-ian-wright-2825005-2025-11-24",
      "headline": "Watch: Zohran Mamdani thrilled after special message from Arsenal great Ian WrightNew York City Mayor-elect Zohran Mamdani was left overjoyed after receiving a surprise video message from Arsenal legend Ian Wright on Adam Friedland's show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-sai-sudharsan-dhruv-jurel-slammed-social-media-2825003-2025-11-24",
      "headline": "Sudharsan, Jurel slammed for Guwahati failures: Fans doubt if they are ready for TestsIndia's young batters Sai Sudharsan and Dhruv Jurel came under heavy criticism after poor first-innings dismissals in the Guwahati Test, with fans on social media arguing they are not yet ready for the demands of international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-perth-defeat-brendon-mccullum-faith-bazball-2824934-2025-11-24",
      "headline": "England coach Brendon McCullum urges fans to keep faith after Perth horrorCoach Brendon McCullum appealed to England fans to \"keep the faith\", reaffirming that there would be no shift in strategy despite the team's humiliating defeat in the first Ashes Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odi-squad-sanju-samson-deserved-chance-anil-kumble-2824930-2025-11-24",
      "headline": "IND vs SA: Anil Kumble explains why Sanju Samson deserved chance in India's ODI squadAnil Kumble believes Sanju Samson deserved a place in India's ODI squad for the South Africa series and warned that selectors may have mixed up T20 and ODI form when evaluating the wicketkeeper batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-overhead-kick-al-nassr-ninth-consecutive-win-2824890-2025-11-24",
      "headline": "Watch: 40-year-old Cristiano Ronaldo scores stunning bicycle kick for Al NassrCristiano Ronaldo rolled back the years as he produced a stunning overhead kick to power Al Nassr to a commanding win over Al Khaleej. Al Nassr continued their fine run of form with another big win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-why-a-draw-is-likely-in-guwahati-test-2824894-2025-11-24",
      "headline": "South Africa 1-0 India? Why a draw is likely in Guwahati TestSenuran Muthusamy and Marco Jansen have not just saved South Africa - they have slowed time in Guwahati. Their defiant stand has blunted India's attack, drained overs from the day, and kept the pitch looking flatter than ever. With the clock slipping away and neither side able to force a breakthrough, this Test now appears to be drifting toward an inevitable draw."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}