{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-321-points-higher-nifty-above-24800-indusind-bank-up-over-2-2732495-2025-05-29",
      "headline": "Sensex ends 321 points higher, Nifty above 24,800; IndusInd Bank up over 2%The BSE Sensex ended 320.70 points higher at 81,633.02, while the NSE Nifty50 settled 81.15 points higher at 24,833.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/key-financial-changes-in-june-2025-free-aadhaar-update-epfo-3-0-launch-financial-rule-changes-saving-credit-fd-rates-india-2732474-2025-05-29",
      "headline": "From PF access to free Aadhaar update: 5 key financial changes in June 2025The deadline to update your Aadhaar details online for free is June 14, 2025. Those who fail to update their identity and address proof documents by this date will incur a fee of Rs 25 for updates through the online portal or Rs 50 at physical Aadhaar centres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-1-vs-itr-2-eligibility-for-income-tax-filing-2025-26-budget-changes-which-tax-form-should-salaried-individuals-choose-2732371-2025-05-29",
      "headline": "ITR-1 or ITR-2: Know which form suits your 2025-26 tax filingAn informative guide on choosing between ITR-1 and ITR-2 for salaried individuals, highlighting the eligibility criteria and recent updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wraps-up-dubbing-for-hari-hara-veera-mallu-2732482-2025-05-29",
      "headline": "Pawan Kalyan wraps up dubbing for Hari Hara Veera MalluTelugu superstar Pawan Kalyan, who is also the Deputy Chief Minister of Andhra Pradesh, wrapped up dubbing for his highly anticipated film 'Hari Hara Veera Mallu', slated to release theatrically on June 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjan-bajwa-recalls-bonding-with-priyanka-chopra-while-filming-fashion-2732435-2025-05-29",
      "headline": "Actor Arjan Bajwa recalls bonding with Priyanka Chopra while filming FashionActor Arjan Bajwa shared that he and Priyanka Chopra connected over personal struggles while shooting for 'Fashion'. He praised her strength, saying she stayed strong even after finding out about her father's cancer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rowoon-to-begin-mandatory-military-service-in-july-agency-confirms-2732403-2025-05-29",
      "headline": "Destined with You star Rowoon to begin mandatory military service in JulySouth Korean actor and former SF9 member Rowoon will begin his mandatory military service on July 21, 2025. According to his agency, FNC Entertainment, he will enter a training camp on that day and serve as an active-duty soldier in the Army. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-screenshot-of-tovino-thomass-chat-shuts-down-rift-rumours-2732461-2025-05-29",
      "headline": "Actor Unni Mukundan shares screenshot of Tovino's chat, shuts down rift rumoursActor Unni Mukundan shared a screenshot of his chat with colleague Tovino Thomas to shut down rumours of rift. This came after the 'Marco' actor's alleged ex-manager accused him of physically assaulting him for praising Tovino's recently released film 'Narivetta'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-hugh-jackmans-ex-wife-deborra-lee-furness-hints-at-betrayal-amid-divorce-2732376-2025-05-29",
      "headline": "Actor Hugh Jackman's ex-wife Deborra-Lee Furness hints at betrayal amid divorceAmid her divorce proceedings with Wolverine star Hugh Jackman, Australian actor Deborra-Lee Furness has expressed compassion for those who have suffered betrayal in a relationship. Deborra said she has now been focussing on personal growth amid separation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/maa-trailer-kajol-transforms-into-kaali-to-end-a-demonic-curse-2732437-2025-05-29",
      "headline": "Maa trailer out: Kajol transforms into Kaali to end a demonic curseThe trailer of 'Maa' starring Kajol is out. The film shows the actor transforming into Goddess Kaali to end a demonic curse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-cannes-bts-video-cannes-abhishek-bachchan-tere-bina-song-2732392-2025-05-29",
      "headline": "Aishwarya Rai shares BTS video from Cannes with Abhishek Bachchan's Tere BinaAishwarya Rai Bachchan shared a behind-the-scenes video of her Cannes 2025 red carpet look, featuring a stunning Manish Malhotra saree and special moments with her daughter, Aaradhya. The video was set to the romantic song 'Tere Bina' from 'Guru'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-sooraj-pancholi-recalls-terrible-jail-term-in-kasabs-cell-sleeping-on-newspaper-2732344-2025-05-29",
      "headline": "Sooraj Pancholi recalls terrible jail term in Kasab's cell, sleeping on newspaperActor Sooraj Pancholi recently recalled his terrible time in Mumbai's Arthur Road Jail where he slept on newspapers. He revealed that he was kept in the same cell where Ajmal Kasab was confined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/emraan-hashmi-diagnosed-with-dengue-puts-pawan-kalyan-og-shoots-on-hold-2732358-2025-05-29",
      "headline": "Actor Emraan Hashmi diagnosed with dengue, puts Pawan Kalyan's OG shoots on holdBollywood actor Emraan Hashmi has been diagnosed with dengue, due to which shooting for the Pawan Kalyan-starrer 'They Call Him OG' has been temporarily halted. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kamal-haasan-regrets-not-approaching-satyajit-ray-score-music-pushpak-vimana-2732418-2025-05-29",
      "headline": "Kamal Haasan regrets not getting Satyajit Ray to score Pushpak musicIn an exclusive interview with India Today, Kamal Haasan opened up about a significant missed opportunity to involve legendary filmmaker Satyajit Ray in his silent classic 'Pushpaka Vimana'. He reflects on how it could have elevated the film to new heights and the regrets surrounding this lost chance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-dating-veer-pahariya-after-breakup-with-aadar-jain-alekha-advani-2732414-2025-05-29",
      "headline": "Tara Sutaria is dating Veer Pahariya after breakup with Aadar Jain: ReportActors Tara Sutaria and Veer Pahariya are reportedly dating. Sources close to the two shared that they are 'taking it slow'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pankaj-tripathi-criminal-justice-season-4-madhav-mishra-lawyer-role-bank-balance-2732338-2025-05-29",
      "headline": "Pankaj Tripathi: Criminal Justice 4 has definitely improved my bank balancePankaj Tripathi returns as lawyer Madhav Mishra in Criminal Justice Season 4. The show's fresh writing and evolving characters promise renewed excitement and engagement for fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/yash-shoots-massive-action-sequence-with-mad-max-stunt-director-for-ramayana-2732335-2025-05-29",
      "headline": "Yash shoots massive action sequence with Mad Max stunt director for Ramayana'KGF' actor Yash has collaborated with 'Mad Max' stunt director Guy Norris for massive action sequences for the upcoming magnum opus 'Ramayana', directed by Nitesh Tiwari. The film also stars Ranbir Kapoor and Sai Pallavi in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-defends-kamal-haasan-against-critics-amid-kannada-language-row-asks-what-have-you-done-for-kannada-cinema-2732360-2025-05-29",
      "headline": "Shiva Rajkumar to Kamal Haasan's critics: What have you done for Kannada cinema?Kannada actor Shiva Rajkumar defended Kamal Haasan amid the Kannada language row. The former made a statement at an event, appreciating Haasan's contribution to cinema and his command over the audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cha-eun-woo-military-service-army-military-band-enlistment-july-28-2732333-2025-05-29",
      "headline": "Cha Eun-woo to begin military service with Army Military BandCha Eun-woo has been accepted into the Army Military Band and will start his mandatory military service on July 28. Fans are asked to respect privacy as enlistment details remain confidential to ensure safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-son-abhishek-bachchan-housefull-5-trailer-2732334-2025-05-29",
      "headline": "Big B sends best wishes to son Abhishek as Housefull 5 trailer releasesAmitabh Bachchan sent best wishes to son Abhishek Bachchan after the 'Housefull 5' trailer released. He called it a proud moment and wished luck to the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-ananya-panday-shoot-for-tu-meri-main-tera-main-tera-tu-meri-video-from-sets-goes-viral-2732332-2025-05-29",
      "headline": "Kartik Aaryan, Ananya Panday shoot for Tu Meri Main…, video from sets goes viralKartik Aaryan and Ananya Panday are currently shooting for their upcoming film 'Tu Meri Main Tera Main Tera Tu Meri'. A video from the sets has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rajesh-dies-at-75-rajinikanth-close-friend-condolences-2732324-2025-05-29",
      "headline": "Rajinikanth deeply saddened as his close friend and actor Rajesh dies at 75Veteran actor Rajesh died at the age of 75 on Thursday. His close friend and actor Rajinikanth expressed his sadness over his sudden death.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gaddar-film-awards-2025-nag-ashwin-allu-arjun-shreya-ghoshal-win-big-2732321-2025-05-29",
      "headline": "Gaddar Film Awards 2025: Nag Ashwin, Allu Arjun, Shreya Ghoshal win big'Kalki 2898 AD' director Nag Ashwin, along with actors Allu Arjun, Nivetha Thomas and singer Shreya Ghoshal, won the top honours at the Gaddar Film Awards 2025, organised by the Telangana government. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/murshidabad-violence-an-example-of-tmc-governments-nirmamta-pm-attacks-mamata-banerjee-in-bengal-2732457-2025-05-29",
      "headline": "PM Modi's 'nirmamta' swipe at Mamata Banerjee over Murshidabad violencePM Modi said Bengal is currently facing multiple crises, with widespread violence and lawlessness tearing at the state's social fabric. He claimed that the people have lost faith in the Trinamool Congress government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-chief-amar-preet-singh-slams-hal-defence-industry-project-timeline-tejas-delay-2732488-2025-05-29",
      "headline": "IAF chief's shocker on projects: We sign contracts despite being aware of delaysSpeaking at a public event, Air Force Chief Amar Preet Singh admitted that 'timeline is a big issue.' His remarks came nearly three months after he publicly expressed displeasure over the delay in the delivery of Tejas Mk1A fighter jets by Hindustan Aeronautics Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-slams-shashi-tharoor-over-pm-modi-surgical-strike-congress-takes-veiled-dig-2732423-2025-05-29",
      "headline": "I agree...: After Shashi Tharoor's zealots jab, Pawan Khera's 2018 book reminderThe war of words between Shashi Tharoor and his party has intensified, as senior Congress leader Pawan Khera shared an excerpt from the Lok Sabha MP's book The Paradoxical Prime Minister, in which he called the Modi government 'shameless' for publicising the 2016 surgical strikes for electoral gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-economy-investment-muhammad-yunus-grameen-bank-tax-exemption-conflict-of-interest-2731970-2025-05-29",
      "headline": "As Yunus fiddles, Bangladesh slides, his Grameen family soarsBangladesh hasn't just seen a rise of Muhammad Yunus, it has seen businesses associated with him switch to top gears. The interim government gave nod to the setting up of Grameen University, allowed Grameen Telecom to operate a mobile wallet, approved manpower export licence for Grameen Employment and reinstated tax-exemption status for Grameen Bank. Though none of the deals are illegal, they have raised a stink."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/elon-musk-chainsaw-exit-another-donald-trump-buddy-bites-the-dust-2732366-2025-05-29",
      "headline": "Musk's chainsaw exit: Another Trump buddy bites the dustElon Musk joined Trump admin as a so-called special government employee, bringing with him big plans to shred wasteful and fraudulent spending. After 130 days at the helm of DoGE, Musk announced his resignation. His exit from the Trump administration was as predictable as it was dramatic, no surprise there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/let-commander-saifullah-kasuri-pahalgam-attack-mastermind-pakistan-rally-talha-saeed-2732353-2025-05-29",
      "headline": "LeT commander behind Pahalgam attack resurfaces at anti-India rally in PakistanLeT commander Saifullah Kasuri, accused of masterminding the Pahalgam terror attack, resurfaced at a rally in Pakistan alongside political leaders and wanted terrorists like Hafiz Saeed's son Talha Saeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-bhopal-love-jihad-gangs-rape-blackmail-hindu-women-convert-islam-2732489-2025-05-29",
      "headline": "Befriend, rape, blackmail: The modus operandi of 'love jihad' gangs in BhopalThe modus operandi of the 'love jihad gangs' involve befriending unsuspecting Hindu girls, sexually exploiting them and then blackmailing them with obscene videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/moderate-rain-gusty-winds-likely-in-delhi-ncr-over-next-2-hours-orange-alert-issued-2732498-2025-05-29",
      "headline": "Rain, gusty winds likely in Delhi-NCR over next 2 hours, orange alert issuedModerate rain, gusty winds likely in Delhi-NCR over next 2 hours, orange alert issued"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/dmk-casts-kamal-haasan-in-a-rajya-sabha-mp-role-aim-to-undercut-vijay-political-debut-2732439-2025-05-29",
      "headline": "DMK casts Kamal Haasan in a Rajya Sabha MP role. Aim to undercut Vijay's political debut?The fact is, Kamal Haasan is an ambitious actor and filmmaker known for venturing into unexplored creative zones. But in his role as a politician, he has proved to be a more practical persona, reconciling with what he can and what he cannot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-could-have-done-much-more-rajnath-singhs-stern-warning-to-pak-2732434-2025-05-29",
      "headline": "Could've done much more: Rajnath Singh's stern warning to Pak after Op SindoorDefence Minister Rajnath Singh asserted that after Operation Sindoor, Pakistan has \"realised the heavy cost of running the business of terrorism.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/video/shubhanshu-shukla-axiom-4-launch-isro-nasa-spacex-explained-2732445-2025-05-29",
      "headline": "What will India's Shubhanshu Shukla do in space? Explained"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/six-hours-that-defied-history-and-death-on-mount-everest-edmund-hillary-tenzing-norgay-2732065-2025-05-29",
      "headline": "Six hours that defied history and death on Mount EverestOn May 29, 1953, Edmund Hillary and Tenzing Norgay created history by summiting Mt Everest, the world's highest peak. On its anniversary, here is an account of the final six hours of humanity's quest for the top of the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-elon-musk-left-donald-trump-administration-2732406-2025-05-29",
      "headline": "What led to 'first buddy' Elon Musk's big exit from Trump CabinetIn recent weeks, there have been tell-tale signs that the personal bond between Donald Trump and Elon Musk has frayed, culminating in the cost-cutting czar's exit from the administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-minister-demands-kamal-haasan-apology-over-kannada-language-row-or-face-film-ban-2732427-2025-05-29",
      "headline": "Must apologise or face ban: Karnataka Minister on Kamal Haasan's Kannada remarksKarnataka's Culture Minister has warned actor Kamal Haasan to apologise for allegedly insulting the Kannada language, or face a ban on his films being released in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-called-trump-taco-which-pissed-him-off-tariff-war-china-us-trade-trump-always-chicken-out-2732393-2025-05-29",
      "headline": "Who called Trump Taco and why she's a hero nowDuring a White House press conference, US President Donald Trump was asked about a new Wall Street acronym, Taco – Trump Always Chickens Out – which referred to his repeated tariff threats followed by retreats. This made Trump furious. This is all about the journalist who asked the Taco question and the person who coined the term. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-qualfier-1-difference-2016-squad-big-name-dependence-vs-pbks-2732438-2025-05-29",
      "headline": "2016 vs 2025: How RCB stand different from their last shot at Qualifier 1RCB return to Qualifier 1 with a transformed squad, sharper strategy, and renewed hunger. Gone are the days of big-name dependence — this team is built on balance, belief, and execution. Will 2025 finally end their trophy drought?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-nepal-mount-kangchenjunga-expidition-sikkim-prem-singh-tamang-amit-shah-letter-ban-on-summit-2732346-2025-05-29",
      "headline": "Why summiting of Himalayan peak from Nepal stirred up a storm in SikkimThe scaling of Mount Kanchenjunga, the world's third-highest peak on the India-Nepal border, by a group of mountaineers from the Nepal side has sparked outrage in Sikkim. The Chief Minister of Sikkim, Prem Singh Tamang, has written a letter to the Centre, urging that the matter be taken up with Nepal. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/3-indians-missing-in-iran-embassy-says-probe-on-warns-against-illegal-travel-agents-2732370-2025-05-29",
      "headline": "Don't be deceived: Iran says probing case of 3 missing Indians, shares advisoryThe families of the missing men allege they were abducted and held for ransom. Iran's Consular Affairs Department of the Ministry of Foreign Affairs is actively pursuing the case, the Iranian embassy said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-man-clings-speeding-car-bonnet-save-life-driver-arrested-viral-video-2732436-2025-05-29",
      "headline": "Hit by driver, dragged: Video shows Mumbai man clinging to bonnet as car speeds offA video from Mumbai shows a man clinging to a speeding car's bonnet after a road rage incident. The driver has been arrested and is under police interrogation.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-cannes-bts-video-cannes-abhishek-bachchan-tere-bina-song-2732392-2025-05-29",
      "headline": "Aishwarya Rai shares BTS video from Cannes with Abhishek Bachchan's Tere BinaAishwarya Rai Bachchan shared a behind-the-scenes video of her Cannes 2025 red carpet look, featuring a stunning Manish Malhotra saree and special moments with her daughter, Aaradhya. The video was set to the romantic song 'Tere Bina' from 'Guru'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/exposes-uss-lies-of-freedom-china-on-marco-rubios-remarks-about-revoking-visas-for-chinese-students-2732451-2025-05-29",
      "headline": "Exposes US's lies of freedom: China on Marco Rubio's Chinese student visa threatChina has condemned the US for revoking Chinese student visas, calling it a discriminatory, politically driven move. Beijing warned it undermines bilateral ties and violates US values of freedom and openness.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-aide-of-congress-leader-arrested-in-rajasthan-for-allegedly-spying-for-isi-visited-pakistan-6-7-times-2732282-2025-05-29",
      "headline": "Ex-aide of Congress leader held in Rajasthan for 'spying', visited Pak 6–7 timesA Rajasthan government employee, Sakur Khan, was detained for allegedly spying for Pakistan's ISI after intelligence found suspicious links, including visits to Pakistan. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/covid-19-cases-rise-in-india-with-new-variants-vaccine-stockpile-ample-and-ready-2732339-2025-05-29",
      "headline": "Covid-19 cases rising: What is the status of India's vaccine stockpile?Covid-19 cases are rising again in India with new variants spreading across multiple states. Despite halted vaccine production, officials confirm a sufficient stockpile to meet current and future needs."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-andreeva-sinner-gauff-de-minaur-djokovic-2732496-2025-05-29",
      "headline": "Day 5 Live Updates: Mirra Andreeva, Alex de Minaur in commandFrench Open 2025 Day 5 Live Updates: Alexander Bublik and Mirra Andreeva are on the cusp of victories in their second round matches. Later in the day, Jannik Sinner, Novak Djokovic and Coco Gauff will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-josh-hazelwood-nuwan-thusara-playing-xi-vs-pbks-qualifier-1-2732486-2025-05-29",
      "headline": "Josh Hazlewood or Nuwan Thusara? Tom Moody on RCB dilemma before Qualifier 1Royal Challengers Bengaluru face a selection dilemma ahead of their Qualifier 1 clash with Punjab Kings, as Tom Moody urges the side to consider fielding both Josh Hazlewood and Nuwan Thusara in a high-stakes battle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-and-south-africa-players-engage-in-brutal-physical-fight-mid-pitch-2732480-2025-05-29",
      "headline": "Bangladesh and South Africa players engage in brutal physical fight mid-pitchRipon Mondol and Tshepo Ntuli engaged in a physical fight during a four-day game between Bangladesh Emerging Team and South Africa Emerging Team in Dhaka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-india-vs-australia-women-womens-odi-series-schedule-2732446-2025-05-29",
      "headline": "BCCI announces schedule for India Women's home ODIs vs AustraliaIndia and Australia will face off in three Women's ODIs from September 14 to 20 at the MA Chidambaram Stadium in Chennai. The series will serve as a preparation for both teams before the Women's ODI World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-qualfier-1-difference-2016-squad-big-name-dependence-vs-pbks-2732438-2025-05-29",
      "headline": "2016 vs 2025: How RCB stand different from their last shot at Qualifier 1RCB return to Qualifier 1 with a transformed squad, sharper strategy, and renewed hunger. Gone are the days of big-name dependence — this team is built on balance, belief, and execution. Will 2025 finally end their trophy drought?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-received-surprise-text-from-harbhajans-daughter-after-test-retirement-2732431-2025-05-29",
      "headline": "Kohli received surprise text from my daughter after Test retirement: HarbhajanStar India batter Virat Kohli received a surprise text from Harbhajan Singh's daughter Hinaya following his retirement from Tests, the former off spinner has revealed in an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-mens-relay-team-enters-final-of-asian-athletics-championships-2732387-2025-05-29",
      "headline": "India men's relay team enters final of Asian Athletics ChampionshipsIndia's 4x400m men's relay team qualified for the final of the 26th Asian Athletics Championships with its best ever effort. The team, consisting of Rince Joseph, Dharmveer Choudhary, Manu Thekkinalil Saji, and Mohit Kumar outpaced China and Korea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/singapore-open-hs-prannoy-satwiksairaj-rankireddy-chirag-shetty-2732383-2025-05-29",
      "headline": "Satwik-Chirag through to quarterfinal, HS Prannoy bows outSingapore Open: Satwiksairaj Rankireddy and Chirag Shetty made their way through to the quarterfinal while HS Prannoy crashed out after losing in straight games to Christo Popov."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-d-gukesh-beats-hikaru-nakamura-comeback-birthday-2732388-2025-05-29",
      "headline": "Gukesh beats Nakamura to get Norway campaign back on track on birthdayOn his 19th birthday, world champion D Gukesh bounced back in style, defeating world No.2 Hikaru Nakamura in Norway Chess 2025, showcasing improved time management and nerves of steel under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-director-mo-bobat-on-qualifier-1-fixture-against-punjab-kings-2732349-2025-05-29",
      "headline": "Earlier win over Punjab Kings, a confidence booster ahead of qualifier 1: RCB DirectorRoyal Challengers Bengaluru (RCB) director of cricket Mo Bobat has said that the team will take confidence from their earlier win against Punjab Kings (PBKS) as they head into Qualifier 1 of the Indian Premier League 2025 (IPL 2025) against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-playoffs-feature-2732319-2025-05-29",
      "headline": "Can RCB leave the past behind and show consistency in the playoffs? IPL 2025: Royal Challengers Bengaluru have stormed into the playoffs and secured a top-two finish. However, the real test now lies ahead - as the playoffs have always been the stage where their temperament comes under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-mens-relay-team-enters-final-of-asian-athletics-championships-2732387-2025-05-29",
      "headline": "India men's relay team enters final of Asian Athletics ChampionshipsIndia's 4x400m men's relay team qualified for the final of the 26th Asian Athletics Championships with its best ever effort. The team, consisting of Rince Joseph, Dharmveer Choudhary, Manu Thekkinalil Saji, and Mohit Kumar outpaced China and Korea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/singapore-open-hs-prannoy-satwiksairaj-rankireddy-chirag-shetty-2732383-2025-05-29",
      "headline": "Satwik-Chirag through to quarterfinal, HS Prannoy bows outSingapore Open: Satwiksairaj Rankireddy and Chirag Shetty made their way through to the quarterfinal while HS Prannoy crashed out after losing in straight games to Christo Popov."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-d-gukesh-beats-hikaru-nakamura-comeback-birthday-2732388-2025-05-29",
      "headline": "Gukesh beats Nakamura to get Norway campaign back on track on birthdayOn his 19th birthday, world champion D Gukesh bounced back in style, defeating world No.2 Hikaru Nakamura in Norway Chess 2025, showcasing improved time management and nerves of steel under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-director-mo-bobat-on-qualifier-1-fixture-against-punjab-kings-2732349-2025-05-29",
      "headline": "Earlier win over Punjab Kings, a confidence booster ahead of qualifier 1: RCB DirectorRoyal Challengers Bengaluru (RCB) director of cricket Mo Bobat has said that the team will take confidence from their earlier win against Punjab Kings (PBKS) as they head into Qualifier 1 of the Indian Premier League 2025 (IPL 2025) against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-playoffs-feature-2732319-2025-05-29",
      "headline": "Can RCB leave the past behind and show consistency in the playoffs? IPL 2025: Royal Challengers Bengaluru have stormed into the playoffs and secured a top-two finish. However, the real test now lies ahead - as the playoffs have always been the stage where their temperament comes under scrutiny."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}