{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/israel-iran-conflict-will-irans-threat-to-close-the-hormuz-strait-affect-india-2745114-2025-06-23",
      "headline": "Israel-Iran conflict: Will Iran's threat to close the Hormuz Strait affect India?This episode of the Super 6 programme discusses the potential impact on India if Iran closes the Strait of Hormuz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-rs-1-crore-to-rs-25-lakh-in-20-years-how-inflation-quietly-shrinks-your-wealth-2745051-2025-06-23",
      "headline": "From Rs 1 crore to Rs 25 lakh: How inflation quietly shrinks your wealthUnderstanding the impact of inflation on wealth and the necessity of strategic investing to preserve financial security over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-lose-in-indian-real-estate-expert-explains-what-the-top-1-percent-do-instead-2745007-2025-06-23",
      "headline": "90% lose in real estate, expert explains what the top 1% do insteadA real estate advisor explains why the majority of buyers in India are not profiting from real estate, while a select few succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-511-points-lower-nifty-below-25000-it-stocks-down-hcl-infosys-2744997-2025-06-23",
      "headline": "Sensex ends 511 points lower, Nifty settles below 25,000; HCLTech down 2%The S&P BSE Sensex fell by 511.38 points to close at 81,896.79, while the NSE Nifty50 lost 140.50 points to end at 24,971.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-earning-275-percent-in-your-savings-account-here-is-a-smarter-option-invest-in-liquid-funds-2744937-2025-06-23",
      "headline": "Still earning 2.75% in your savings account? Here's a smarter optionLiquid funds serve as the middle ground between a savings account and fixed deposits, but with more flexibility and usually better returns. Over the past one and three years, liquid funds have delivered average annualised returns of 7.3% and 7%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/3-ipos-upcoming-june-24-open-tuesday-check-details-price-band-allotment-gmp-kalpataru-ellenbarrie-globe-civil-2744984-2025-06-23",
      "headline": "3 IPOs to open tomorrow: Check details of Kalpataru, Ellenbarrie, Globe CivilThe combined size of these IPOs stands at over Rs 2,500 crore, and all three are expected to list on the stock exchanges on July 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-why-millions-of-poor-indian-households-still-rely-on-moneylenders-2744922-2025-06-23",
      "headline": "Explained: Why many low-income Indian households still rely on moneylendersDespite rising financial access, millions of Indian households still rely on informal loans. Gaps in formal credit, especially for low-income and self-employed borrowers, keep moneylenders relevant and often unavoidable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-6-lakh-in-taxes-on-a-rs-13-lakh-car-ca-reveals-the-hidden-cost-2744873-2025-06-23",
      "headline": "Rs 6 lakh in taxes on a Rs 13 lakh car? CA reveals the hidden costUpgrading or buying a new car used to be a moment of joy for many middle-class families, but today, it's overshadowed by the heavy financial pressure it brings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-closure-iran-parliament-israel-us-attack-crude-oil-impact-price-rise-india-world-impact-2744885-2025-06-23",
      "headline": "Will Iran close Hormuz Strait? What it means for oil prices in India and worldThe Strait of Hormuz is a narrow waterway connecting the Persian Gulf with the Arabian Sea. It is one of the most important oil transport routes in the world. Nearly 20% of all global crude oil passes through this strait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/debt-disguised-as-achievement-financial-analyst-on-growing-emi-trap-2744876-2025-06-23",
      "headline": "Debt disguised as achievement: Financial expert on India's deepening EMI trapA rising income shouldn't come at the cost of peace of mind. Financial freedom means having choices, not just things. And that starts with avoiding EMIs that quietly chip away at your future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-5-common-errors-in-pre-filled-forms-and-how-to-fix-it-2744833-2025-06-23",
      "headline": "Filing ITR? 5 common errors in pre-filled forms and how to fix itA pre-filled Income Tax Return (ITR) form is a partially completed form provided by the Income Tax Department to make filing easier for taxpayers. These forms are automatically filled with details taken from trusted sources such as your PAN, Aadhaar, Form 16, and bank data from Form 26AS and the AIS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/explained-how-to-vacation-without-the-financial-hangover-2744803-2025-06-23",
      "headline": "Explained: How to vacation without the financial hangoverA dream vacation should leave you with great memories, not months of financial stress. With a little planning, you can enjoy the trip and return home without breaking your budget."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-gives-12-inches-of-hair-to-charity-thanks-her-dad-anil-kapoor-for-genes-2745133-2025-06-23",
      "headline": "Sonam Kapoor donates 12 inches of hair to charity, thanks her father for good genesActor Sonam Kapoor underwent a hair makeover on Monday as she decided to chop off 12 inches of her hair and give it to charity. She also thanked her father Anil Kapoor for good genes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-sister-mandhira-didnt-speak-for-last-four-years-due-to-ego-2745003-2025-06-23",
      "headline": "Sunjay Kapur's sister shares emotional post: We didn't speak for 4 years due to egoLate businessman Sunjay Kapur's sister Mandhira shared an emotional note on Instagram on Sunday. She said that they hadn't spoken to each other for the last four years, and that she regretted not mending their relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-in-talks-to-play-meena-kumari-in-upcoming-biopic-2745130-2025-06-23",
      "headline": "Kiara Advani in talks to play Meena Kumari in upcoming biopic: ReportActor Kiara Advani has been approached to play Meena Kumari in an upcoming biopic backed by Sidharth P Malhotra, Saregama, and the Amrohi family. If she signs on, it could be her first film post-pregnancy and one of the most emotionally intense roles of her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-praises-nagarjuna-for-picking-bold-roles-like-in-kuberaa-2745128-2025-06-23",
      "headline": "Chiranjeevi praises Nagarjuna for taking on bold roles like KuberaaAt the grand success meet of 'Kuberaa', Chiranjeevi praised Nagarjuna's career choices, calling him an inspiration for embracing bold and character-driven roles in an era dominated by star-centric films.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-and-zaheer-iqbal-celebrate-1st-wedding-anniversary-see-pics-2745105-2025-06-23",
      "headline": "Sonakshi Sinha and Zaheer Iqbal celebrate 1st wedding anniversary. See picsActor Sonakshi Sinha shared photos from her first wedding anniversary celebrations with actor-husband Zaheer Iqbal on Monday. She shared the photos on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-cheers-nick-jonas-with-a-sweet-note-as-he-takes-final-bow-2745100-2025-06-23",
      "headline": "Priyanka Chopra gives a shoutout to Nick Jonas after closing show of his Broadway playPriyanka Chopra cheered for husband Nick Jonas during his final Broadway performance of 'The Last Five Years'. Despite a packed schedule promoting 'Heads of State', she made time to support him and shared a heartfelt message on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-team-faces-plagiarism-charges-as-madras-high-court-issues-legal-notice-2744892-2025-06-23",
      "headline": "Nani's HIT 3 team faces plagiarism charges as Madras High court issues legal noticeAfter a successful theatrical run, 'HIT: The third case' lands in legal trouble as writer Vimalavelan files a plagiarism case, prompting the Madras High Court to issue a notice to the film's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-how-john-cena-idris-elba-pranked-her-during-heads-of-state-2745044-2025-06-23",
      "headline": "Priyanka Chopra shares how John Cena, Idris Elba pranked her during Heads of StatePriyanka Chopra Jonas shared a funny incident where John Cena and Idris Elba pulled a prank on her during her first day on the 'Heads of State' set. The moment helped break the ice between the stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-reacts-to-cybercrime-caller-tune-complaints-ask-government-not-me-2745046-2025-06-23",
      "headline": "Ask government, not me: Amitabh Bachchan reacts to cybercrime caller tune complaintsActor Amitabh Bachchan responded to online trolls for mocking his cyber-crime awareness caller tune. He replied to some of the comments on X, where his awareness campaign over digital fraud was targeted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/beyonce-dazzles-black-manish-malhotra-outfit-during-paris-concert-watch-viral-video-2745092-2025-06-23",
      "headline": "Beyonce dazzles in black Manish Malhotra outfit during concert in Paris. WatchGlobal pop star Beyonce stunned the stage in a custom Manish Malhotra outfit at her Paris Cowboy Carter tour. The singer dazzled with thousands of crystals embroidered on her outfit. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-suga-donates-5-billion-won-autism-project-military-discharge-2745063-2025-06-23",
      "headline": "BTS SUGA donates 5 billion won to autism project after military dischargeK-pop band BTS member SUGA, also known as Min Yoongi, pledged five billion Korean won to build a new centre focused on treating children and teenagers with autism spectrum disorders. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-leads-indian-army-cadets-50-push-ups-challenge-border-2-2744949-2025-06-23",
      "headline": "Varun Dhawan joins Indian Army cadets for 50 push-ups challenge on Border 2 setsActor Varun Dhawan joined army cadets for a 50 push-ups challenge during the 'Border 2' shoot at National Defence Academy (NDA), Pune. He features in the upcoming action-drama, which is a sequel to Sunny Deol's 1997 war film 'Border'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-silent-treatment-teenagers-proud-parenting-independent-thinking-2745027-2025-06-23",
      "headline": "Kajol on challenges of parenting teens: No one prepares you for silent treatmentKajol opens up about the silent treatment she faces as a mother of teenagers. She expresses pride in her kids' independent thinking despite communication challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-purchase-7000-acre-land-in-new-zealand-telugu-actor-brahmaji-clarifies-2744983-2025-06-23",
      "headline": "Did Vishnu Manchu purchase 7,000 acre land in New Zealand? Telugu actor clarifiesAs the buzz around 'Kannappa' grows, a light-hearted video of actor Mohan Babu joking about buying 7,000 acres in New Zealand goes viral. This prompted actor Brahmaji to clarify that the comments were made in jest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-interview-bollywood-south-indian-films-culture-globalisation-2744977-2025-06-23",
      "headline": "Pawan Kalyan: Bollywood chose commerce over culture, lost Indian rootsTelugu actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan recently spoke candidly about the differences between Bollywood and South Indian films in terms of how they represent culture, during a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/srikanth-actor-arrested-in-drug-abuse-case-2745009-2025-06-23",
      "headline": "Tamil actor Srikanth arrested in drug abuse caseTamil actor Srikanth has been arrested on Monday in a drug abuse case. He is currently being questioned by the police for his alleged links with former AIADMK functionary, Prasad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/director-jeethu-joseph-confirms-drishyam-3-to-release-in-3-languages-with-same-plot-2744930-2025-06-23",
      "headline": "Director Jeethu Joseph confirms Drishyam 3 to release in 3 languages with same plotDirector Jeethu Joseph has confirmed that 'Drishyam 3', starring Mohanlal, will begin shooting in October and will have the same story across Malayalam, Hindi, and Telugu versions. The makers are also exploring the possibility of a simultaneous release in all three languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-academic-honour-toronto-metropolitan-university-of-canada-2744940-2025-06-23",
      "headline": "From stage to syllabus: Canadian university introduces course on Diljit DosanjhToronto Metropolitan University of Canada is set to introduce a course on Punjabi singer Diljit Dosanjh. The course is expected to start in the fall of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-on-alleged-fake-box-office-collections-2744956-2025-06-23",
      "headline": "People enjoying lies: Sunny Deol on alleged fake box office collectionsSunny Deol criticised the film industry for promoting alleged fake box office numbers and bulk bookings to create false hype. He urged young actors to focus on real talent and storytelling instead of relying on manipulated figures for success."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-retaliation-against-us-strikes-could-come-in-next-48-hours-report-2745144-2025-06-23",
      "headline": "Iran's retaliation against US strikes could come in next 48 hours: ReportIran could launch retaliatory attacks against American forces in the Middle East as soon as the next day or two, US officials told Reuters citing the latest intelligence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-will-go-to-war-bilawal-bhutto-threatens-india-over-indus-waters-treaty-fatf-2745132-2025-06-23",
      "headline": "Share water fairly or...: Bilawal Bhutto threatens India over Indus Waters TreatyBilawal Bhutto warned of war if India denies Pakistan its water share under the Indus Waters Treaty, calling the suspension illegal. He also accused India of using terrorism and FATF pressure for political gains, while stressing the need for dialogue.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Iran's air defence systems activated against hostile targets, says state mediIran's media have claimed that the nuclear sites destroyed in Sunday's US bombings are presently being rebuilt by Iran's Atomic Energy Agency. Meanwhile, the US State Department has issued a Worldwide Caution alert, warning American citizens to exercise increased vigilance while travelling abroad. \r\n\r\nThe Israeli Defence Forces also stated that around 20 Israeli Air Force fighter jets carried out intelligence-based strikes using over 30 munitions across several locations in Iran, including Kermanshah, Hamedan, and Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-4-leeds-updates-2744934-2025-06-23",
      "headline": "Day 4 Live: India's lead goes past 350 with Jadeja, Prasidh at creaseEngland (ENG) vs India (IND), 1st Test Day Live Score and Updates: India's lead has gone beyond 350 with Shardul Thakur and Ravindra Jadeja at the crease. India don't look like declaring their innings anytime soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-punjab-bypoll-aam-aadmi-party-aap-return-of-arvind-kejriwal-rajya-sabha-seat-2744994-2025-06-23",
      "headline": "Will Kejriwal make a big-bang return through Rajya Sabha?After months in political hibernation following the AAP's Delhi drubbing, its national convenor, Arvind Kejriwal, seems poised for a mega-comeback after the bypoll victories in Punjab and Gujarat. AAP leaders have declared his return to national politics, but Kejriwal quashed the buzz that he would make a Rajya Sabha entry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-ali-khamenei-supreme-leader-iran-top-secret-force-moves-bunker-revolutionary-guard-israel-us-war-2744988-2025-06-23",
      "headline": "Khamenei being guarded by elite unit no one knew existedA top-secret elite unit is now guarding Iran's Supreme Leader Ayatollah Khamenei with even senior officials of his Revolutionary Guards unaware of its existence. The 86-year-old leader has suspended all electronic communication. Here's what we know about Khamenei's hiding place and his elite unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-becomes-2nd-wicketkeeper-to-score-twin-centuries-in-a-test-2745134-2025-06-23",
      "headline": "Rishabh Pant becomes 2nd wicketkeeper to score twin centuries in a TestIndia's Rishabh Pant etched his name in the record books as he became just the second wicketkeeper to score twin centuries in a Test match during Day 4 of the first Test against England in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/b2-bombers-us-strike-iran-bed-microwave-fridge-toilet-rest-space-trump-israel-war-911-special-heres-why-2745101-2025-06-23",
      "headline": "B-2 stealth bombers used to attack Iran have beds, toilets, microwavesOn a 37-hour mission from Missouri in the US to strike Iranian nuclear sites, six B-2 bombers refuelled multiple times midair. The B-2 stealth bombers, meant for long-distance missions, come with rare comforts: a microwave, mini-fridge, toilet, and space to rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradeshs-dangeti-jahnavi-to-travel-to-space-in-2029-becomes-first-indian-to-complete-nasas-international-air-and-space-program-2745117-2025-06-23",
      "headline": "Andhra woman becomes first Indian to complete Nasa program, to go to space in 2029Dangeti Jahnavi from Andhra Pradesh, will travel to space in 2029. She is the first Indian to complete Nasa's International Air and Space Program. Jahnavi is a STEM advocate and asteroid discoverer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-molested-by-group-of-drunk-men-in-bengaluru-neighbours-also-attacked-accused-files-counter-complaint-2745067-2025-06-23",
      "headline": "Drunk men molest woman in Bengaluru, locals who tried to help also attackedA young woman was molested and assaulted in broad daylight by a group of men near Anekal, Bengaluru. The attack was caught on CCTV. The woman registered a police complaint. The accused later filed a counter-complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jsk-suresh-gopi-starrer-malayalam-film-janaki-vs-state-of-kerala-no-censor-certificate-of-goddess-sita-character-name-2745097-2025-06-23",
      "headline": "Janaki vs censorship: Are all names synonymous to Sita too holy for hardship?The censor board has halted the release of a Malayalam film as the protagonist is named Janaki — apparently goddesses' names are too sacred for assault survivors, even fictional ones. If this is the prevalent logic, what happens to art reflecting life? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/show-cause-notice-bjp-mla-rajeev-singh-parichha-vande-bharat-passenger-assault-video-viral-2745127-2025-06-23",
      "headline": "Show cause notice to BJP MLA after Vande Bharat assault video goes viralThe now viral video shows Babina MLA Rajeev Singh Parichha standing to the side while a group of men, allegedly his supporters, thrash a passenger, leaving him visibly injured and bleeding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-kl-rahul-century-headingley-test-sunil-gavaskar-rahul-dravid-behind-2745122-2025-06-23",
      "headline": "KL Rahul leaves Dravid, Gavaskar behind with 4th Test 100 vs EnglandENG vs IND: KL Rahul delivered a masterclass at Headingley, scoring a composed century that not only steadied India's innings but also made him the Indian opener with the most Test hundreds on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-launches-fresh-missile-attack-on-israel-after-will-end-war-warning-to-trump-blasts-heard-in-jerusalem-2744924-2025-06-23",
      "headline": "Israel hits Iran's N-site, Evin Prison, after Tehran launches ballistic missilesA day after US strikes on Iran's nuclear sites, Tehran launched 15 ballistic missiles at Israel, triggering sirens across cities and marking a sharp escalation in the Middle East conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assembly-bypoll-result-2025-live-updates-bjp-aap-congress-bengal-gujarat-punjab-kerala-2744715-2025-06-23",
      "headline": "AAP wins big in Gujarat's Visavadar and Ludhiana, Trinamool retains KaliganjAssembly Bypoll Result 2025 Live Updates: The bypoll results gain significance ahead of the crucial West Bengal and Kerala assembly elections in 2026. The BJP, despite fielding candidates in all five bypolls, managed to only bag Gujarat's Kadi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-bombs-iran-notorious-evin-prison-detain-dissidents-foreigners-hostage-diplomacy-2745089-2025-06-23",
      "headline": "Israel bombs Iran's notorious Evin Prison, used for hostage diplomacyIsrael's precision strikes damaged the heavily fortified main gate and nearby administrative buildings at Evin prison in Tehran. Videos circulating online showed the smouldering wreckage of the prison gate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-reacts-to-cybercrime-caller-tune-complaints-ask-government-not-me-2745046-2025-06-23",
      "headline": "Ask government, not me: Amitabh Bachchan reacts to cybercrime caller tune complaintsActor Amitabh Bachchan responded to online trolls for mocking his cyber-crime awareness caller tune. He replied to some of the comments on X, where his awareness campaign over digital fraud was targeted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/tech-layoffs-cross-76000-in-2025-intel-microsoft-meta-lead-massive-job-cuts-2745047-2025-06-23",
      "headline": "Over 1 lakh jobs gone in 2025: Why tech, non-tech companies are slashing workforceIn 2025, tech companies have slashed over 76,000 jobs, as companies restructure for AI, cut costs, and shift priorities amid economic uncertainty and competitive pressure. Here's a breakdown of the massive layoffs across tech and non-tech sectors, amounting to a total of over 1 lakh job cuts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/let-down-by-russia-khamenei-writes-to-putin-for-backing-against-us-report-2745017-2025-06-23",
      "headline": "Let down by Russia, Khamenei writes to Putin for more support against US: ReportIran has not been impressed with Russia's support so far in the conflict with Israel and US. Iranian Foreign Minister Abbas Araghchi will deliver a letter from Khamenei to Putin, seeking more support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/monsoon-likely-to-hit-delhi-on-tuesday-imd-issues-yellow-alert-2745021-2025-06-23",
      "headline": "Monsoon likely to hit Delhi on Tuesday, IMD issues yellow alertThe IMD has forecast a generally cloudy sky over the next few days, with light to moderate rain, thunderstorms and lightning expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/the-feminist-soul-of-sitaare-zameen-par-can-a-mother-still-be-a-woman-2744979-2025-06-23",
      "headline": "The feminist soul of Sitaare Zameen Par: Can a mother still be a woman?In a world that reveres mothers but forgets the woman behind them, 'Sitaare Zameen Par' dares to ask uncomfortable questions. Skip reading if you are afraid of spoilers, but carry on if you want to read something worth reflecting on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/united-states-iran-bombing-nuclear-sites-israel-gaza-congress-slams-pm-modi-2745059-2025-06-23",
      "headline": "Show moral courage: Congress slams PM's 'silence' over US strikes on IranCongress called for immediate diplomacy and dialogue with Iran as the US attack on key Iranian nuclear facilities sparked fears of a broader regional conflict. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-film-body-to-send-directive-to-ban-diljit-dosanjh-sardaar-ji-3-producers-for-casting-pak-actor-2744926-2025-06-23",
      "headline": "Film body to ban Diljit Dosanjh for casting Pak actor Hania Amir in Sardaar Ji 3Diljit Dosanjh and Hania Aamir's film has landed in controversy. The film body is set to send a directive to ban the film's producers and Diljit himself for releasing a film featuring a Pakistani actor in the aftermath of the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/10-year-old-child-killed-as-crude-bomb-explodes-during-counting-of-votes-in-bengals-kaliganj-2744991-2025-06-23",
      "headline": "Child, 10, killed in crude bomb explosion during vote count in Bengal's KaliganjA 10-year-old child was killed after a crude bomb exploded while counting of votes was underway for bypolls in Bengal's Kaliganj on Monday."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-hundred-athiya-shetty-message-leeds-2745159-2025-06-23",
      "headline": "Athiya Shetty shares special message for KL Rahul after Leeds hundredAthiya Shetty had a special message for her husband and Indian opener KL Rahul after his brilliant hundred against England on Day 4 of the first Test. Rahul's knock put India on top of proceedings in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-rishabh-pant-summersault-celebration-twin-centuries-2745141-2025-06-23",
      "headline": "Sunil Gavaskar urges twin centurion Rishabh Pant for somersault celebrationENG vs IND: Rishabh Pant made history at Headingley with twin centuries against England, prompting Sunil Gavaskar to ask for his trademark celebratory flip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-becomes-2nd-wicketkeeper-to-score-twin-centuries-in-a-test-2745134-2025-06-23",
      "headline": "Rishabh Pant becomes 2nd wicketkeeper to score twin centuries in a TestIndia's Rishabh Pant etched his name in the record books as he became just the second wicketkeeper to score twin centuries in a Test match during Day 4 of the first Test against England in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-kl-rahul-century-headingley-test-sunil-gavaskar-rahul-dravid-behind-2745122-2025-06-23",
      "headline": "KL Rahul leaves Dravid, Gavaskar behind with 4th Test 100 vs EnglandENG vs IND: KL Rahul delivered a masterclass at Headingley, scoring a composed century that not only steadied India's innings but also made him the Indian opener with the most Test hundreds on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-can-also-bat-like-cheteshwar-pujara-sanjay-manjrekar-2745118-2025-06-23",
      "headline": "Rishabh Pant can also bat like Cheteshwar Pujara: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar is impressed with Rishabh Pant's defensive technique in the ongoing first Test against England, saying that he can even bat like Cheteshwar Pujara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-critics-sanjana-ganesan-only-on-the-field-2745108-2025-06-23",
      "headline": "They only know Bumrah on the field: Sanjana Ganesan shuts down criticsWhile Jasprit Bumrah roared back with a five-wicket haul in the Headingley Test, his wife Sanjana Ganesan shared a graceful response to critics, reminding fans that there's more to athletes than what meets the eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-was-reluctant-to-become-test-captain-after-virat-kohli-sourav-ganguly-2745080-2025-06-23",
      "headline": "Rohit Sharma was reluctant to become Test captain after Virat Kohli: Sourav GangulyFormer India captain and BCCI President Sourav Ganguly has revealed that Rohit Sharma was reluctant to become the Test captain after Virat Kohli and had to be convinced by the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-reason-mumbai-cricket-association-noc-2745043-2025-06-23",
      "headline": "Prithvi Shaw reveals reason why he decided to leave Mumbai and ask for releasePrithvi Shaw has revealed the reason why he decided to leave Mumbai and asked for the No Objection Certificate from the Mumbai Cricket Association. Shaw was dropped from Mumbai's squad for the Ranji Trophy last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-praises-sai-sudharsan-potential-india-batting-targets-370-runs-england-test-2745030-2025-06-23",
      "headline": "Promising Sai Sudharsan will not have leg stump weakness for long: ManjrekarFormer cricketer Sanjay Manjrekar praises Sai Sudharsan's promising potential despite an ordinary Test debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-scolds-himself-after-playing-rash-shots-on-day-4-in-leeds-2745035-2025-06-23",
      "headline": "Rishabh Pant berates himself after playing rash shots on Day 4 in LeedsIndia wicketkeeper batter Rishabh Pant was seen scolding himself after playing a few rash shots on Day 4 of the first Test against England at Headingley, Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-was-reluctant-to-become-test-captain-after-virat-kohli-sourav-ganguly-2745080-2025-06-23",
      "headline": "Rohit Sharma was reluctant to become Test captain after Virat Kohli: Sourav GangulyFormer India captain and BCCI President Sourav Ganguly has revealed that Rohit Sharma was reluctant to become the Test captain after Virat Kohli and had to be convinced by the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-reason-mumbai-cricket-association-noc-2745043-2025-06-23",
      "headline": "Prithvi Shaw reveals reason why he decided to leave Mumbai and ask for releasePrithvi Shaw has revealed the reason why he decided to leave Mumbai and asked for the No Objection Certificate from the Mumbai Cricket Association. Shaw was dropped from Mumbai's squad for the Ranji Trophy last season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-praises-sai-sudharsan-potential-india-batting-targets-370-runs-england-test-2745030-2025-06-23",
      "headline": "Promising Sai Sudharsan will not have leg stump weakness for long: ManjrekarFormer cricketer Sanjay Manjrekar praises Sai Sudharsan's promising potential despite an ordinary Test debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-scolds-himself-after-playing-rash-shots-on-day-4-in-leeds-2745035-2025-06-23",
      "headline": "Rishabh Pant berates himself after playing rash shots on Day 4 in LeedsIndia wicketkeeper batter Rishabh Pant was seen scolding himself after playing a few rash shots on Day 4 of the first Test against England at Headingley, Leeds. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}