{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-alert-first-instalment-due-by-june-15-find-out-if-you-are-liable-2740396-2025-06-13",
      "headline": "Advance tax alert: First instalment due by June 15, find out if you are liableAdvance tax simply means paying your income tax in parts throughout the year, instead of waiting till the end. If your total tax due for the year is more than Rs 10,000, then you must pay it in advance in four instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-573-points-lower-nifty-below-24800-adani-ports-falls-3-percent-iran-israel-war-2740342-2025-06-13",
      "headline": "Sensex settles 573 points lower, Nifty below 24,800; Adani Ports falls 3%The S&P BSE Sensex was down by 573.38 points to end at 81,118.60, while the NSE Nifty50 lost 169.60 points to close at 24,718.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-surge-india-israel-iran-conflict-geopolitical-tensions-2740330-2025-06-13",
      "headline": "Gold prices rise sharply amid Israel-Iran tensions in IndiaThe rise in gold prices is being linked to worries over a possible wider conflict in the Middle East, which has made investors turn to gold as a safe place to park money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-subscription-june-13-to-17-rs-1387-crore-issue-strong-brokerage-ratings-2740309-2025-06-13",
      "headline": "Oswal Pumps opens Rs 1,387 crore IPO with strong brokerage backingOswal Pumps targets Rs 1,387.34 crore from IPO. Experts recommend subscribing due to strong fundamentals. IPO open until June 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-trailer-lee-jung-jae-faces-his-toughest-opponents-in-epic-finale-2740693-2025-06-14",
      "headline": "Squid Game 3 trailer: Lee Jung-jae faces his toughest opponents in epic finaleThe new trailer for 'Squid Game Season 3' was released on June 14. The show featuring actor Lee Jung-jae is all set for its finale and will premiere on June 27 on Netflix. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-heated-clash-with-paparazzi-viral-video-2740715-2025-06-14",
      "headline": "Who's paying you to provoke me? Justin Bieber in heated clash with paparazziSinger Justin Bieber got into a heated clash with the paparazzi outside the Soho House in Malibu. Bieber was protecting himself from the flashing cameras before delivering a firm and expletive-filled message to the photographers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-day-9-kamal-haasan-film-crawls-towards-rs-50-crore-2740678-2025-06-14",
      "headline": "Thug Life box office Day 9: Kamal Haasan's film crawls towards Rs 50 croreActor Kamal Haasan and filmmaker Mani Ratnam's 'Thug Life' saw a massive decline in the box office collection on day nine. The film is still far behind the Rs 50 crore-mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushant-singh-rajput-sister-shweta-singh-kirti-emotional-video-death-anniversary-2740676-2025-06-14",
      "headline": "Bhai is still with us: Sushant Singh Rajput's sister shares emotional videoSushant Singh Rajput's sister, Shweta, remembered her brother on his fifth death anniversary today, June 14. In an emotional video, she discussed missing her late actor-brother while also explaining what he stood for. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-festa-2025-blood-sweat-and-tears-the-7-are-back-and-so-is-the-magic-2740668-2025-06-14",
      "headline": "BTS FESTA 2025: Blood, Sweat, and Tears- The 7 are back and so is the magicBTS FESTA 2025 saw an emotional reunion of all seven members during J-hope's concert, thrilling fans across the globe. The event was a perfect blend of nostalgia, joy, and promise of a bright future for the band and ARMY alike."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-makers-slam-karnataka-government-over-threats-fir-was-registered-2740660-2025-06-14",
      "headline": "Thug Life makers slam Karnataka government over threats: No FIR was registeredThug Life makers slammed the Karnataka government for not protecting them against threats following Kamal Haasan's 'Kannada born out of Tamil' remark. They claimed that no FIR was registered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-entertainer-eyes-rs-150-crore-mark-2740625-2025-06-14",
      "headline": "Housefull 5 box office Day 8: Akshay Kumar's entertainer eyes Rs 150 crore-markAkshay Kumar's 'Housefull 5' is witnessing a dip in box office numbers. On its eighth day, the film collected Rs 6 crore, bringing its total India earnings to over Rs 133 crore. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/are-we-living-in-spoiler-verse-is-pre-release-content-killing-the-hype-for-films-2739881-2025-06-14",
      "headline": "Are we living in spoiler-verse? Is pre-release content killing the hype for films?Is the film industry today grappling with overexposure, where trailers and promos reveal too much? Experts and filmmakers urge a balanced marketing approach to preserve the magic of discovery and keep viewers emotionally connected to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-slams-trolls-postpartum-weight-gain-husband-karan-singh-grover-shows-support-2740613-2025-06-14",
      "headline": "Bipasha Basu slams trolls over postpartum weight gain, husband Karan shows supportActor Bipasha Basu addressed the online buzz about her weight gain post-motherhood in a recent Instagram post. She slammed trolls and wrote how they don't define her identity or self-worth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-discharged-hospital-surgery-free-from-tumour-cancer-shaoib-ibrahim-2740598-2025-06-14",
      "headline": "Dipika Kakar discharged from hospital after surgery: Free from the tumourActor Dipika Kakar has been discharged from Kokilaben Hospital. In her health update, Kakar said that the tumour has been successfully removed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-season-4-begins-filming-with-alan-cumming-and-star-cast-glbs-2740571-2025-06-14",
      "headline": "The Traitors Season 4 begins filming with Alan Cumming and star castPeacock's The Traitors returns for Season 4 with Alan Cumming and a star-studded cast from Survivor, Big Brother, Drag Race, and more. Filming is underway in the Scottish Highlands.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/country-star-lauren-alaina-gives-birth-to-baby-girl-beni-doll-arnold-glbs-2740559-2025-06-14",
      "headline": "Country star Lauren Alaina gives birth to baby girl Beni Doll ArnoldCountry star Lauren Alaina and husband Cam Arnold welcomed their daughter, Beni Doll Arnold, on June 11. Alaina released a tribute song, \"Heaven Sent,\" honoring her late father and newborn.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/air-india-crash-ahmedabad-boeing-back-in-the-dock-heres-a-list-of-docus-on-the-aviation-giant-2740471-2025-06-13",
      "headline": "Air India crash reignites Boeing concerns: Here's what global documentaries revealThe recent Air India crash in Ahmedabad has once again cast a spotlight on Boeing. As questions mount about potential technical failures, here is a list of documentaries on Boeing's troubled history. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-expresses-grief-over-air-india-crash-sends-prayers-2740459-2025-06-13",
      "headline": "Amitabh Bachchan expresses grief over Air India crash, sends prayersMegastar Amitabh Bachchan sent prayers for the victims and families of those affected by the Air India flight crash in Ahmedabad. Several celebrities from the Indian film industry have shared their condolences on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sabrina-carpenter-defends-racy-artwork-and-lyrics-of-her-songs-you-are-sharing-them-2740424-2025-06-13",
      "headline": "You're sharing them: Sabrina Carpenter defends racy artwork and lyrics of her songsIn a recent interview, singer-songwriter Sabrina Carpenter clapped back at the critics, addressing the backlash she received for her recent cover artwork for her upcoming album 'Man's Best Friend'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-recalls-growing-up-near-air-india-crash-site-ahmedabad-spent-24-years-2740422-2025-06-13",
      "headline": "Actor Unni Mukundan recalls growing up near Air India crash site: Spent 24 yearsMalayalam actor Unni Mukundan spent his childhood and adolescence in Ahmedabad and stayed in proximity to the Air India flight crash site until he turned 24. He expressed deep shock over the tragic crash that claimed 265 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-basil-joseph-to-collaborate-on-a-superhero-film-report-2740394-2025-06-13",
      "headline": "Allu Arjun, Basil Joseph to collaborate on a superhero film: ReportAfter locking 'AA22' with Atlee, superstar Allu Arjun is now eyeing a fresh collaboration with Malayalam director Basil Joseph for what's rumoured to be a superhero film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-reunion-what-it-means-for-the-fandom-and-indian-army-2740219-2025-06-13",
      "headline": "BTS reunion: What it means for the fandom and Indian ARMYBTS's six members have completed their military service, promising a long-awaited reunion with fans globally, especially the passionate Indian ARMY. Their comeback marks not just a musical event but a cultural and economic milestone poised to energise India's live music scene."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/toll-in-air-india-plane-crash-rises-to-270-as-those-injured-at-medical-college-hostel-succumb-2740737-2025-06-14",
      "headline": "Air India crash toll rises to 270, those injured at medical college hostel succumbThe death toll in Thursday's tragic Air India plane crash in Ahmedabad rose to 270, doctors said, as eight people from the medical hostel, where the London-bound flight crashed minutes after takeoff, were confirmed dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/black-box-data-being-decoded-aviation-minister-ram-mohan-naidu-in-1st-briefing-after-air-india-crash-2740743-2025-06-14",
      "headline": "Black box data being decoded: Aviation Minister in 1st briefing after Air India crashCivil Aviation Minister Ram Mohan Naidu said the black box has been recovered and is being decoded as multiple agencies conduct an extensive investigation to determine the cause of the tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-tensions-conflict-benjamin-netanyahu-nuclear-sites-hit-2740505-2025-06-13",
      "headline": "2 more top generals killed, nuclear site damaged as Israel hits Iran hardIran and Israel targeted each other with airstrikes early on Saturday after Israel launched its biggest-ever offensive against its longtime foe in a bid to prevent it from developing a nuclear weapon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mcc-cricket-boundary-catch-rule-update-ban-airborne-touches-2025-2740694-2025-06-14",
      "headline": "No more bunny hop boundary catches: Cricket's new rule change explainedThe Marylebone Cricket Club, the custodians of the laws of the game, has announced a major update to cricket's boundary fielding law to ban multiple airborne touches. This change aims to make catches along the boundary rope fairer. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/seat-11a-miracle-escape-ruangsak-loychusak-thai-airways-air-india-plane-crash-survivor-2740655-2025-06-14",
      "headline": "The 11A mystery: Two plane crashes, two lives spared, one seatRuangsak Loychusak was left shaken when he discovered that the sole survivor of the Air India crash was in seat 11A -- the same seat he had occupied when his Thai Airways flight went down in 1998."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-airstrikes-iran-operation-rising-lion-retaliation-nuclear-programme-khamenei-netanyahu-middle-east-tensions-conflict-2740080-2025-06-13",
      "headline": "Live: Iran warns US, UK, France against helping stop Tehran's strikes on IsraelIsrael Iran War News Live: Iran and Israel exchanged airstrikes early Saturday, marking a dangerous escalation after Israel launched its largest-ever offensive against its longtime rival in an effort to prevent it from developing nuclear weapons. Iranian missiles and rockets struck Tel Aviv and Jerusalem, Israel's two largest cities, before dawn, leaving multiple people injured. Israel had initiated the first wave of attacks on Iran on Friday, followed by several more rounds, including a fresh wave on Saturday morning.At least 80 people have been reported killed, with dozens more injured in the ongoing strikes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-air-india-medical-hostel-teenage-boy-tea-stall-dies-2740690-2025-06-14",
      "headline": "Gujarat mother escapes Air India plane crash, son sleeping inside tea stall diesAkash Patni, 14, was sleeping inside his family's roadside tea stall in Ahmedabad, when a cruel twist of fate occurred as an Air India plane, bound for London, crashed into a nearby medical hostel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-military-apologises-for-showing-jk-as-part-of-pak-in-missile-range-map-2740632-2025-06-14",
      "headline": "Israel army apologises for map showing J&K as part of Pak, Northeast as NepalIsrael apologised after a missile range map it released amid escalating tensions with Iran showed Jammu and Kashmir as part of Pakistan and the northeastern states as Nepal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/ankita-bhandari-murder-case-what-one-uttarakhand-case-taught-the-system-2740619-2025-06-14",
      "headline": "Justice for Ankita: What one Uttarakhand case taught the systemThe Ankita Bhandari case exposed deep flaws in the system, but also showed how public pressure, due process, and determined policing can align to deliver justice, even when the odds seem stacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-live-score-world-test-championship-final-day-4-london-reactions-2740729-2025-06-14",
      "headline": "WTC final live score, SA vs AUS Day 4: History beckons South Africa at Lord'sWTC final live score SA vs AUS Day 4: South Africa and Australia are set to take on each other on Day 4 as the Proteas stand on the cusp of a historic win at the home of cricket. Temba Bavuma and Aiden Markram will resume their massive stand as South Africa require just 69 more runs to end their 27-year long wait for an ICC title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/watch-how-israel-used-covert-mossad-ops-to-strike-deep-into-irans-heartland-glbs-2740586-2025-06-14",
      "headline": "Israel's Mossad posts rare footage of covert ops in Iran ahead of strikesIsrael's Mossad shared rare footage of covert drone strikes inside Iran, targeting military and nuclear sites. The strikes reportedly killed top Iranian generals and scientists, significantly escalating regional tensions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/498a-tea-cafe-protest-dowry-case-rajasthan-man-serves-tea-wearing-handcuff-2740645-2025-06-14",
      "headline": "Frustrated over wife's dowry charge, man serves tea wearing handcuffs at stallA man in Rajasthan, Krishna Kumar Dhakad, opened a tea stall named '498A T Café' in Rajasthan's Anta to protest alleged dowry harassment and legal injustice. Wearing handcuffs while serving tea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/are-we-living-in-spoiler-verse-is-pre-release-content-killing-the-hype-for-films-2739881-2025-06-14",
      "headline": "Are we living in spoiler-verse? Is pre-release content killing the hype for films?Is the film industry today grappling with overexposure, where trailers and promos reveal too much? Experts and filmmakers urge a balanced marketing approach to preserve the magic of discovery and keep viewers emotionally connected to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/neet-ug-2025-result-declared-direct-link-2740714-2025-06-14",
      "headline": "NEET UG 2025 result declared: Rajasthan boy tops, direct link to scorecards Live UpdatesNEET UG 2025 result announced, check scorecards and ranks. Rajasthan boy tops the NEET UG 2025. Direct link here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indias-shubhanshu-shuklas-ax-4-mission-to-launch-on-june-19-2740666-2025-06-14",
      "headline": "India's Shubhanshu Shukla's Ax-4 mission to launch on June 19ISRO has confirmed June 19, 2025, as the new launch date for Indian astronaut Shubhanshu Shukla's Ax-04 mission aboard SpaceX's Falcon 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-to-travel-to-3-countries-including-canada-for-g7-summit-from-june-15-to-19-2740689-2025-06-14",
      "headline": "PM to visit 3 countries, including Canada, in 1st foreign trip after Op SindoorPrime Minister Narendra Modi will embark on a three-nation tour starting Sunday, visiting Cyprus, Croatia, and Canada, where he will attend the G7 Summit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-trailer-lee-jung-jae-faces-his-toughest-opponents-in-epic-finale-2740693-2025-06-14",
      "headline": "Squid Game 3 trailer: Lee Jung-jae faces his toughest opponents in epic finaleThe new trailer for 'Squid Game Season 3' was released on June 14. The show featuring actor Lee Jung-jae is all set for its finale and will premiere on June 27 on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-496-13-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/paramilitary-jawan-killed-in-ied-blast-in-odisha-west-singhbhum-2740721-2025-06-14",
      "headline": "Paramilitary jawan killed in IED blast in Odisha's RourkelaA paramilitary jawan was martyred in an IED blast during an anti-Naxal operation in West Singhbhum's Saranda forest. The attack occurred near the Jharkhand-Odisha border during a joint security operation.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/israel-iran-war-viral-video-dog-rescued-from-ruined-tel-aviv-building-as-missiles-strike-2740633-2025-06-14",
      "headline": "Video of dog rescued from ruined Tel Aviv building amid missile strikes goes viralA video of Israel's rescue team pulling a terrified dog from a building in Tel Aviv, as missile strikes rattled the city amid escalating tensions with Iran, has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/lego-for-burnout-deloittes-new-wellness-perk-sparks-debate-2740290-2025-06-14",
      "headline": "LEGO for burnout? Deloitte's new wellness perk sparks debateDeloitte US recently expanded its well-being subsidy, allowing eligible employees to get reimbursed up to $1,000 for LEGO sets and puzzles. However, not everyone is on board with the idea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-active-covid-cases-tally-deaths-reported-spike-karnataka-gujarat-kerala-2740664-2025-06-14",
      "headline": "India's active Covid tally at 7,400, 9 deaths in 24 hours; big spike in KarnatakaIndia's active Covid tally reached 7,400 after Karnataka (132) recorded the highest one-day spike in cases, followed by Gujarat (79) and Kerala (54). Nine deaths were reported, with the majority of them in Maharashtra (4) and Kerala (3)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/air-india-crash-aviation-expert-captain-steve-explains-what-may-have-caused-the-crash-2740537-2025-06-13",
      "headline": "Air India crash: Aviation expert Captain Steve explains what may have caused the crashAviation expert Captain Steve discusses the theories behind the Air India crash that killed all except one on board, focusing on a potential wing flap issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/west-bengal/story/tied-up-humiliated-bengal-civic-volunteer-accuses-trinamool-workers-of-assault-2740700-2025-06-14",
      "headline": "Tied up, humiliated: Bengal civic volunteer accuses Trinamool workers of assaultA video that has been widely circulated shows civic volunteer Sridhar Chakraborty with his hands and feet bound by ropes, being coerced by a group of men."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-live-score-world-test-championship-final-day-4-london-reactions-2740729-2025-06-14",
      "headline": "WTC final live score, SA vs AUS Day 4: History beckons South Africa at Lord'sWTC final live score SA vs AUS Day 4: South Africa and Australia are set to take on each other on Day 4 as the Proteas stand on the cusp of a historic win at the home of cricket. Temba Bavuma and Aiden Markram will resume their massive stand as South Africa require just 69 more runs to end their 27-year long wait for an ICC title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mlc-2025-trent-boult-run-out-viral-video-kieron-pollard-2740718-2025-06-14",
      "headline": "Trent Boult's bizarre run-out in MLC goes viral, Stuart Broad can't stop watchingMLC 2025: Three MI New York batters were run out within the space of two overs during their three-run defeat to Texas Super Kings on Friday. Trent Boult's dismissal went viral on social media, with former England fast bowler Stuart Broad admitting he watched it on loop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mcc-cricket-boundary-catch-rule-update-ban-airborne-touches-2025-2740694-2025-06-14",
      "headline": "No more bunny hop boundary catches: Cricket's new rule change explainedThe Marylebone Cricket Club, the custodians of the laws of the game, has announced a major update to cricket's boundary fielding law to ban multiple airborne touches. This change aims to make catches along the boundary rope fairer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-to-host-world-test-championship-finals-till-2031-icc-approval-2740663-2025-06-14",
      "headline": "World Test Championship finals to stay in England at least until 2031: ReportThe England and Wales Cricket Board is all set to host the next three World Test Championship finals through 2031. The ICC is likely to give the nod at its annual conference in July, according to English media reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-ab-de-villiers-cheers-aiden-markrams-historic-century-from-stands-2740665-2025-06-14",
      "headline": "WTC Final: AB de Villiers cheers Aiden Markram's historic century from standsLegendary South Africa batter AB de Villiers was spotted cheering for Aiden Markram's magnificent century from the stands on Day 3 of the World Test Championship (WTC) final 2025 at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-7-year-old-post-for-aiden-markram-goes-viral-after-wtc-final-century-2740643-2025-06-14",
      "headline": "Virat Kohli's 7-year-old post for Markram goes viral after his WTC final centuryStar India batter Virat Kohli's seven-year-old post for Australia batter Virat Kohli has been going viral on social media following the latter's magnificent century in the World Test Championship (WTC) final 2025 against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-3-daniel-vettori-full-press-conference-2740622-2025-06-14",
      "headline": "Big challenge awaits us on Day 4, need conditions to go our way: Daniel VettoriAustralia's spin bowling coach Daniel Vettori admitted that they face a challenging situation on Day 4 as South Africa require 69 runs to win the World Test Championship (WTC) final 2025 with eight wickets in hand. However, he didn't rule out the possibility of their bowlers triggering South Africa's collapse if they find conducive conditions to bowl in. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-sa-vs-aus-day-3-ashwell-prince-full-press-conference-2740618-2025-06-14",
      "headline": "We understand the magnitude of the situation, but we must stay calm: Ashwell PrinceSouth Africa batting coach Ashwell Prince revealed that they understand the magnitude of the situation they've brought themselves into, but it's also crucial to remain in the moment and stay calm. South Africa are just 69 runs away from wining WTC Final 2025 against Australia and still have eight wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-kl-rahul-and-shardul-thakur-shine-on-day-1-of-indias-intra-squad-game-2740614-2025-06-14",
      "headline": "Gill, KL Rahul and Shardul Thakur shine on Day 1 of India's intra-squad gameIndia captain Shubman Gill and star batter KL Rahul scored half-centuries on Day 1 of their match simulation practice against India A in Beckenham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-wtc-final-day-4-rain-stands-between-south-africa-and-icc-glory-2740599-2025-06-14",
      "headline": "SA vs AUS, WTC Final Day 4: Rain stands between South Africa and ICC glorySouth Africa's hopes of sealing a historic WTC Final win over Australia may now rest as much on the skies as their bats. With rain on the forecast, Day 4 could bring tense delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markrams-technical-adjustment-helped-him-in-wtc-final-batting-coach-reveals-2740597-2025-06-14",
      "headline": "Aiden Markram bore fruit of technical rework in WTC final, batting coach revealsSouth Africa batting coach Ashwell Prince revealed how Aiden Markram fine-tuned his technique ahead of his marvellous century in the World Test Championship (WTC) final 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-3-daniel-vettori-full-press-conference-2740622-2025-06-14",
      "headline": "Big challenge awaits us on Day 4, need conditions to go our way: Daniel VettoriAustralia's spin bowling coach Daniel Vettori admitted that they face a challenging situation on Day 4 as South Africa require 69 runs to win the World Test Championship (WTC) final 2025 with eight wickets in hand. However, he didn't rule out the possibility of their bowlers triggering South Africa's collapse if they find conducive conditions to bowl in. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-sa-vs-aus-day-3-ashwell-prince-full-press-conference-2740618-2025-06-14",
      "headline": "We understand the magnitude of the situation, but we must stay calm: Ashwell PrinceSouth Africa batting coach Ashwell Prince revealed that they understand the magnitude of the situation they've brought themselves into, but it's also crucial to remain in the moment and stay calm. South Africa are just 69 runs away from wining WTC Final 2025 against Australia and still have eight wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-kl-rahul-and-shardul-thakur-shine-on-day-1-of-indias-intra-squad-game-2740614-2025-06-14",
      "headline": "Gill, KL Rahul and Shardul Thakur shine on Day 1 of India's intra-squad gameIndia captain Shubman Gill and star batter KL Rahul scored half-centuries on Day 1 of their match simulation practice against India A in Beckenham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-aus-wtc-final-day-4-rain-stands-between-south-africa-and-icc-glory-2740599-2025-06-14",
      "headline": "SA vs AUS, WTC Final Day 4: Rain stands between South Africa and ICC glorySouth Africa's hopes of sealing a historic WTC Final win over Australia may now rest as much on the skies as their bats. With rain on the forecast, Day 4 could bring tense delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markrams-technical-adjustment-helped-him-in-wtc-final-batting-coach-reveals-2740597-2025-06-14",
      "headline": "Aiden Markram bore fruit of technical rework in WTC final, batting coach revealsSouth Africa batting coach Ashwell Prince revealed how Aiden Markram fine-tuned his technique ahead of his marvellous century in the World Test Championship (WTC) final 2025. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}