{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-123-points-higher-nifty-above-25100-hcltech-gains-3-percent-2739147-2025-06-11",
      "headline": "Sensex closes 123 points higher, Nifty above 25,100; HCLTech gains 3%Sensex closes 123 points higher, Nifty above 25,100; HCLTech gains 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bharat-rising-why-tier-2-cities-drive-job-growth-explains-hireveda-co-founder-saurabh-agarwal-2739099-2025-06-11",
      "headline": "Bharat rising: Why Tier-2 cities drive job growth, explains HireVeda co-founderWhile the metros still lead in the number of jobs, the speed of growth in smaller cities is hard to ignore, noted co-founder of HireVeda and ExecEdge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ultra-rich-india-hnwi-us-china-japan-usd-10-million-report-knight-frank-2739078-2025-06-11",
      "headline": "India now home to over 85,000 millionaires, ranks 4th globally: ReportIndia now trails only the United States, China, and Japan in terms of the number of wealthy individuals, accounting for 3.7% of the global HNWI population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-form-16-step-by-step-guide-to-download-and-use-it-for-easy-itr-filing-income-tax-return-2739064-2025-06-11",
      "headline": "Digital Form 16: Step-by-step guide to download and use it for easy ITR filingWith the advent of digital platforms, accessing and using Form 16 has become more straightforward, making it a vital document for accurate and hassle-free income tax return (ITR) filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/chasing-rs-10-discounts-ca-explains-why-tracking-every-rupee-is-not-making-you-rich-2739016-2025-06-11",
      "headline": "Chasing Rs 10 discounts? CA explains why tracking every rupee isn't making you richIt's a common belief that managing every rupee wisely equals financial discipline. People cut back on little indulgences and chase discounts, feeling financially in control, yet, their money may be slipping away in unnoticed ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharat-forge-chairman-baba-kalyani-defence-artillery-guns-india-procurement-2738946-2025-06-11",
      "headline": "'Make in India' gave us breakthrough in defence, says Bharat Forge's Baba Kalyani\"A lot of army guys walked by, some laughed at it,\" Chairman Baba Kalyani said during an episode of the New India Junction podcast  \"Not a single guy stopped to even see what the hell it was.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paramount-to-cut-35-percent-of-us-jobs-as-cable-tv-declines-says-report-2738976-2025-06-11",
      "headline": "Paramount to cut 3.5% of US jobs as cable TV declines: ReportThis is not the first round of job losses at Paramount. Back in August last year, the company had already cut 15% of its workforce, indicating ongoing adjustments in response to market changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/law-tribunal-nclt-clears-merger-inox-wind-energy-limited-with-inox-wind-new-shares-investors-2738958-2025-06-11",
      "headline": "Law tribunal clears merger of Inox Wind Energy Limited with Inox WindThe merger is expected to reduce liabilities by around Rs 2,050 crore. The company also expects to save costs by improving how resources are used and by simplifying various processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-86-points-higher-nifty-above-25100-ril-gains-1-percent-maruti-suzuki-falls-2738927-2025-06-11",
      "headline": "Sensex opens 86 points higher, Nifty above 25,100; RIL gains 1%The S&P BSE Sensex gained 104.24 points to 82,495.96, while the NSE Nifty50 added 36.70 points to 25,140.95 as of 9:31 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-opens-june-13-rs-1387-crore-target-solar-pump-growth-2738921-2025-06-11",
      "headline": "Oswal Pumps IPO to open soon with Rs 1,387 crore target. Check detailsOswal Pumps is launching an IPO aiming to raise Rs 1,387.34 crore. Here are essential details potential investors need to consider before subscribing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-eyeing-interim-trade-deal-by-june-end-inside-the-closed-door-talks-tariffs-2738918-2025-06-11",
      "headline": "Tariff cuts, easing digital barriers: India, US make headway in trade talksBoth nations are aiming for an interim trade pact by the end of June, before the pause on Trump's proposed tariffs expires. India is advocating for full exemption from a 26% reciprocal tariff on domestic goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-sensex-nifty-today-trading-setup-june-11-us-trade-talk-nse-bse-2738914-2025-06-11",
      "headline": "Stock market opening: Will Sensex, Nifty open higher today? Check key levelsSensex and Nifty closed flat on Tuesday, ending a four-day winning streak. The flat close was largely due to profit booking, especially in financial stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-11-nse-bse-trading-market-wipro-reliance-infra-indigo-maruti-suzuki-iifl-finance-2738901-2025-06-11",
      "headline": "Stocks to watch on June 11: Wipro, Reliance Infra, IndiGo, Maruti SuzukiExperts suggest that the positive sentiment is likely to persist on Dalal Street with the key support level of Nifty at 24,850. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-slashes-global-growth-forecast-cites-higher-tariffs-uncertainty-2738753-2025-06-10",
      "headline": "World Bank slashes global growth forecast, cites higher tariffs and uncertaintyIn its twice-yearly Global Economic Prospects report, the bank lowered its forecasts for nearly 70 per cent of all economies as well as six emerging market regions, from the levels it projected just six months ago before US President Donald Trump took office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/applying-for-a-personal-loan-how-many-years-of-itrs-do-you-need-2738641-2025-06-10",
      "headline": "Applying for a personal loan? How many years of ITRs do you needBanks need to be sure you can pay back the money you borrow. For salaried individuals, a regular pay cheque and Form 16 usually provide enough assurance. However, for self-employed individuals, ITRs over several years give a more consistent and reliable picture of earnings and financial health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/raymond-realty-likely-to-list-in-early-july-says-chairman-gautam-singhania-2738575-2025-06-10",
      "headline": "Raymond Realty likely to list in early July, says chairman Gautam SinghaniaEach shareholder will receive one share of Raymond Realty for every share held in Raymond, the group said previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-ends-50-points-lower-nifty-settles-above-25100-tech-mahindra-gains-2-market-flat-2738549-2025-06-10",
      "headline": "Sensex, Nifty end flat as profit booking halts rally; IT gains capped by banksThe S&P BSE Sensex was down by 53.49 points to end at 82,391.72, while the NSE Nifty50 ended flat with a gain of 1 point to 25,104.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-may-equity-mutual-fund-data-investors-choose-sip-stocks-expert-view-market-trading-2738535-2025-06-10",
      "headline": "Mutual fund inflows fall: Should beginners still trust SIPs or go for stocks?Data from the Association of Mutual Funds in India (AMFI) shows that net inflows into equity schemes dropped 22% month-on-month to Rs 19,013 crore in May, marking the fifth straight month of decline and the weakest level since April 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-emerges-as-apple-new-bet-but-china-and-trump-raise-red-flags-report-2738521-2025-06-10",
      "headline": "India emerges as Apple's new bet, but China and Trump raise red flags: ReportLast week, Foxconn announced a fresh $1.5 billion investment in its Indian operations, offering some reassurance to officials in New Delhi. This move may ease tensions in New Delhi that began when Donald Trump publicly stated he told Tim Cook not to expand Apple's manufacturing in India, casting doubt on hopes that most iPhones for the US would be made in India by 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-under-old-tax-regime-new-itr-rules-you-should-know-in-2025-2738486-2025-06-10",
      "headline": "Filing under old tax regime? New ITR rules you should know in 2025Key changes in the Income Tax Return (ITR) filing process for those opting for the old tax regime in the Assessment Year 2025–26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-currency-rupee-under-pressure-asia-currencies-ahead-weak-dollar-2738483-2025-06-10",
      "headline": "Rupee stuck in neutral as Asia's currencies race ahead on weak dollarWhile the Singapore dollar, Korean won, and Taiwanese dollar have jumped between 6% and 9.5% so far this year, the rupee has barely moved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-sips-continue-strong-run-touch-rs-26688-crore-in-may-latest-amfi-data-2738454-2025-06-10",
      "headline": "Mutual fund SIPs continue strong run, touch Rs 26,688 crore in May: AMFIMutual fund SIPs reached a fresh high of Rs 26,688 crore in May, inching up from Rs 26,632 crore the previous month, as per AMFI data released on June 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rcb-new-owner-stake-sale-diageo-ipl-cricket-team-virat-kohli-rajat-patidar-report-2738430-2025-06-10",
      "headline": "RCB to get new owner? Diageo looking for stake sale, says reportDiageo Plc, the British company that owns RCB through its Indian arm United Spirits Ltd., is exploring options to sell a part or all of its stake in the franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-pay-zero-tax-by-setting-up-in-dubai-coinswitch-co-founder-ashish-singhal-calls-it-a-trap-2738408-2025-06-10",
      "headline": "Planning to pay 0 tax by setting up in Dubai? Coinswitch co-founder calls it a trapStarting a company in Dubai sounds appealing with no income tax and easy formalities. But if you operate from India, authorities might still consider it an Indian firm. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lilavati-trust-hits-back-at-hdfc-bank-rejects-outstanding-dues-2738409-2025-06-10",
      "headline": "Lilavati Trust hits back at HDFC Bank, rejects outstanding duesIn a sharply worded statement issued Monday, the Trust asserted that neither it nor its permanent trustee Prashant Kishor Mehta has ever borrowed from HDFC Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-share-price-today-stock-plit-record-date-announcement-2738378-2025-06-10",
      "headline": "Paras Defence shares in focus today, rise over 1% in early trade. Here's whyAlongside the 1:2 stock split, Paras Defence also declared its first-ever dividend of Rs 0.50 per share during its Q4 FY25 earnings on April 30. The announcement came on the back of a strong financial performance for the quarter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bengaluru-paying-guest-crisis-explained-2738365-2025-06-10",
      "headline": "Bengaluru's PG crisis: What's behind the mass shutdowns?Once the lifeline for Bengaluru's migrant workforce, why are PGs now vanishing from the city's tech hubs at an alarming pace? Read on know why hundreds of PG accommodations have shut down in the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-higher-nifty-above-25100-ntpc-gains-1-percent-2738360-2025-06-10",
      "headline": "Sensex, Nifty extend gains at open but lose steam as profit booking sets inThe S&P BSE Sensex added 68.34 points to 82,513.55, while the NSE Nifty50 gained 19.40 points to 25,128.05 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hiring-news-india-jobs-it-real-estate-september-quarter-q2-fy26-uae-china-asia-report-2738359-2025-06-10",
      "headline": "Hiring plans steady in India Inc for Q3 FY25: ReportIndia ranked second globally, behind the UAE, which reported the strongest hiring sentiment. India reported a Net Employment Outlook (NEO) of 42%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-trading-setup-nse-bse-sensex-nifty-open-higher-global-rbi-policy-2738347-2025-06-10",
      "headline": "Stock market opening today: Sensex, Nifty likely to open higher. Here's whyThe Sensex and Nifty are likely to extend their gains, helped by improving hopes around global trade discussions and the Reserve Bank of India's (RBI) policy measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-10-nse-bse-trading-wipro-tech-mahindra-motilal-oswal-premier-energies-2738334-2025-06-10",
      "headline": "Stocks to watch on June 10: Wipro, Tech Mahindra, Motilal Oswal, Premier EnergiesSensex and Nifty rose nearly half a percent in the last session, driven by favourable trends in both domestic and global markets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-starlinks-india-entry-plan-rs-33000-per-device-rs-3000-monthly-post-trial-2738230-2025-06-09",
      "headline": "Rs 33,000 per device, Rs 3,000 monthly post-trial: Starlink's India entry planStarlink customers will need to purchase a satellite dish-essential hardware for accessing the service-at an estimated cost of Rs 33,000. The monthly unlimited data plan will be offered at Rs 3,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-bros-discovery-splits-in-two-as-streaming-takes-the-lead-ceo-david-zaslav-will-lead-the-new-company-that-focuses-on-streaming-and-film-studios-2738089-2025-06-09",
      "headline": "Warner Bros Discovery to become two separate companies: ReportThe decision comes as more people stop watching traditional TV and move to streaming platforms. This shift has forced many media companies to rethink how they work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/currency-devaluation-wealth-erosion-property-value-drop-investment-timing-your-rs-1-crore-flat-is-now-rs-90-lakh-investor-explains-why-value-is-shrinking-2738044-2025-06-09",
      "headline": "Your Rs 1 crore flat is now Rs 90 lakh: Investor explains why value is shrinkingA financial influencer warns that unchecked money printing and currency devaluation could be reducing the real value of properties and other assets, urging investments in inflation-resistant assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-set-to-grow-27-percent-in-fy25-says-report-2738039-2025-06-09",
      "headline": "Pakistan's economy set to grow 2.7% in FY25: ReportPakistan's central bank, in a bid to encourage growth, cut its policy rate by more than 1,000 basis points in the current fiscal year. Its latest cut last month brought the key rate to 11%, resuming an easing cycle that had brought rates down from 22% after a brief pause in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-over-200-points-nifty-above-25100-kotak-bank-gains-3-percent-2738004-2025-06-09",
      "headline": "Sensex settles over 200 points; Nifty above 25,100; Kotak Bank gains 3%The S&P BSE Sensex was up 256.22 points to close at 82,445.21, while the NSE Nifty50 added 100.20 points to end at 25,103.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sashidhar-jagdishan-hdfc-bank-ceo-fir-mehta-family-lilavati-trust-hospital-2737948-2025-06-09",
      "headline": "Who is Sashidhar Jagdishan? HDFC Bank CEO under financial fraud lensSashidhar Jagdishan has been a part of HDFC Bank since 1996. He joined as a manager in the finance division and quickly rose through the ranks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shein-reliance-aim-to-sell-india-made-clothes-globally-within-a-year-2737928-2025-06-09",
      "headline": "Shein, Reliance aim to sell India-made clothes globally within a year: ReportThe aim is to make Shein-branded clothes in India not just for local sales but also for international markets, starting with the US and UK, within the next 6 to 12 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-salary-fy25-rs-1041-crore-who-earned-more-corporate-networth-2737922-2025-06-09",
      "headline": "Gautam Adani earned Rs 10.41 crore in FY25: Who earned more than him?Gautam Adani earned Rs 10.41 crore in the financial year 2024–25, which is much less than several leading business heads in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bumper-rate-cut-leaves-rupee-exposed-to-fresh-depreciation-2737907-2025-06-09",
      "headline": "RBI's bumper rate cut leaves rupee exposed to fresh depreciation riskThe rupee has already lagged behind its Asian peers in 2025, weighed down by tepid capital inflows. Now, with the RBI easing faster than the US Federal Reserve, the narrowing interest rate differential is expected to keep the rupee on the back foot."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-2-to-premiere-on-july-3-jeetendra-to-make-a-cameo-reports-2739138-2025-06-11",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi 2 to premiere on July 3: Reports'Kyunki Saas Bhi Kabhi Bahu Thi 2' will reportedly premiere on July 3. The show's first episode aired on the same day 25 years ago. Ekta Kapoor's father Jeetendra is also likely to make an appearance in the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rahul-vaidya-virat-kohli-brother-vikas-kohli-instagram-avneet-kaur-controversy-2739094-2025-06-11",
      "headline": "Rahul Vaidya says Virat Kohli's brother called him after Instagram controversySinger Rahul Vaidya shared that Virat Kohli's brother, Vikas Kohli, contacted him after his controversial remarks involving the cricketer. Vikas advised Rahul to focus on his singing instead of seeking publicity through Virat's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-ye-updates-name-in-legal-filings-2739003-2025-06-11",
      "headline": "Rapper Kanye West renames himself from Ye to Ye Ye: ReportRapper Kanye West, popularly known as Ye, has updated his legal name. He will now be referred to as 'Ye Ye', as per his name in the new California business filings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-raj-kundra-shamita-shetty-croatia-viral-video-truth-2739061-2025-06-11",
      "headline": "Did Shilpa Shetty scream at a tourist in Croatia? Raj Kundra reacts to viral videoActor Shilpa Shetty and her family were involved in an argument at a restaurant in Croatia after their reserved table was given to someone else. The video has since gone viral. Her husband, Raj Kundra, explained that the incident spoiled Shilpa's birthday celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/let-her-go-singer-passenger-announces-3-city-india-tour-details-2739071-2025-06-11",
      "headline": "Let Her Go singer Passenger announces 3-city India tour. DetailsEnglish singer-songwriter Passenger is making his much-awaited India debut this year. The 'Let Her Go' hitmaker announced a three-city tour in November. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-joins-trivikrams-mythological-fantasy-film-producer-shares-cryptic-post-2739063-2025-06-11",
      "headline": "Jr NTR joins Trivikram's mythological fantasy film, producer shares cryptic postAfter much anticipation around Allu Arjun's reunion with director Trivikram Srinivas, reports now suggest a major shift. Jr NTR is reportedly set to play the lead in the long-discussed socio-mythological epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/celebration-begins-suriya-and-director-venky-atluri-film-goes-on-floors-2739057-2025-06-11",
      "headline": "Celebration begins: Suriya and director Venky Atluri film goes on floorsDirected by Venky Atluri, the shooting of Tamil actor Suriya's upcoming film, tentatively titled 'Suriya 46', has begun. The film also stars 'Premalu' fame Mamitha Baiju. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-confirms-wife-sshura-pregnancy-with-nervousness-and-excitement-2739008-2025-06-11",
      "headline": "Arbaaz Khan confirms wife Sshura's pregnancy with nervousness and excitementActor and producer Arbaaz Khan confirmed that he and his wife, Sshura Khan, are expecting a baby. He said his priority now is to be a present and be a supportive parent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-enjoys-foosball-match-with-aamir-khans-son-azad-watch-video-2738984-2025-06-11",
      "headline": "Ranbir Kapoor enjoys foosball match with Aamir Khan's son, Azad. WatchActor Ranbir Kapoor can be seen enjoying a match of foosball with Aamir Khan's son Azad in a viral video on social media. The actor recently attended a special screening of 'Sitaare Zameen Par' at Aamir's residence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chum-darang-backs-northeastern-states-against-hate-after-raja-raghuvanshi-murder-meghalaya-murder-case-2739015-2025-06-11",
      "headline": "Actor Chum Darang condemns hate against Northeast after Raja Raghuvanshi murderActor Chum Darang, in a social media post, addressed the uproar over Raja Raghuvanshi's murder and defended crimes in Northeast India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-criticises-bollywood-herd-mentality-we-need-unique-ideas-2738978-2025-06-11",
      "headline": "Karan Johar criticises Bollywood's herd mentality: We need unique ideasFilmmaker Karan Johar recently spoke about the herd mentality in Bollywood where everyone attempts to mimic successful films like 'Pushpa', 'Stree' and 'Chhaava'. He also reflected on the new trend of cinematic universes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-4-trailer-manju-devi-vs-kranti-devi-brings-fun-and-frustration-to-phulera-2739023-2025-06-11",
      "headline": "Panchayat 4 trailer: Manju Devi vs Kranti Devi brings fun and frustration to PhuleraIn 'Panchayat Season 4', a lot seems to be at stake with the election battle underway. As Manju Devi and Kranti Devi indulge in a tough fight, Sachiv ji once again finds himself in the middle of the village chaos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/premalu-2-starring-naslen-and-mamitha-baiju-delayed-heres-why-2738988-2025-06-11",
      "headline": "Malayalam film Premalu 2, starring Naslen and Mamitha Baiju, delayed. Here's whyThe sequel to the 2024 blockbuster Malayalam film starring Naslen and Mamitha Baiju, 'Premalu 2', has been delayed. Producer Dileesh Pothan confirmed the same during a recent interview. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wonder-woman-3-confirmed-director-james-gunn-says-slow-but-moving-2739012-2025-06-11",
      "headline": "Wonder Woman 3 confirmed: Director James Gunn says slow but movingGood news DC fans! James Gunn has officially confirmed a new Wonder Woman film. In an interview, he said that the film is currently in work. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/puja-banerjee-kunal-verma-duped-by-close-friend-2738989-2025-06-11",
      "headline": "TV actors Puja Banerjee-Kunal Verma duped by close friend: We are back to zeroTV couple Puja Banerjee and Kunal Verma recently revealed that they were robbed of their entire savings by a close friend. They shared how the two are forced to start from zero now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soundarya-sharma-deepika-padukone-sandeep-reddy-vanga-eight-hour-shift-debate-2739004-2025-06-11",
      "headline": "Actor Soundarya Sharma weighs in on Deepika Padukone-Vanga's 8-hour shift debateActor Soundarya Sharma opened up about the ongoing debate about working hours in the Indian film industry, which made headlines after Deepika Padukone's alleged request for an 8-hour workday. She emphasised mutual understanding between artists and filmmakers for better work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shireen-mirza-husband-hasan-sartaj-welcome-baby-boy-2738992-2025-06-11",
      "headline": "Yeh Hai Mohabbatein actor Shireen Mirza, husband Hasan Sartaj welcome baby boyTV actor Shireen Mirza and her husband Hasan Sartaj welcomed their first child, a baby boy. The couple announced the news with a heartwarming post on June 11. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-new-release-date-preponed-fan-voting-campaign-2738973-2025-06-11",
      "headline": "Panchayat 4 to arrive sooner than expected. Here's the new release date'Panchayat season 4' release has been preponed following a fan voting campaign. The new season focusses on the village Pradhan election and a blossoming romance amid political drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-collection-day-5-detailed-report-akshay-kumar-film-maintains-fabulous-1st-week-2738969-2025-06-11",
      "headline": "Housefull 5 box office Day 5: Akshay Kumar's film maintains fabulous 1st weekEverything is going well at the box office for Akshay Kumar's 'Housefull 5'. The film began on a strong note, and continues its momentum even as it enters its first week. Check out the first Tuesday business of the film here. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-undated-photo-of-sonam-lover-raj-surfaces-as-more-details-emerge-in-meghalaya-honeymoon-murder-2739102-2025-06-11",
      "headline": "100% sure she did it: Sonam's brother blames her for murder, says all ties severedSonam Raghuvanshi's brother said he is sure she has committed the crime, adding that he has severed all ties with her.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/operation-sindoor-strikes-pakistan-cover-up-air-bases-hidden-by-tarpaulin-2739066-2025-06-11",
      "headline": "Parde mein rehne do: Pakistan's cover-up operation after Sindoor strikesFresh high-resolution satellite images analysed by India Today show Pakistan is now using tarpaulins to cover at least three military sites hit during India's Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-donald-trump-path-up-social-media-posts-los-angeles-riots-2739080-2025-06-11",
      "headline": "Bros again? Elon Musk's posts spark buzz of 'big, beautiful' patch up with TrumpElon Musk just hit the brakes on his Trump feud, saying he regrets his online attacks and suddenly, he's re-following allies, deleting dirt, and backing the former president's stance on LA riots. Is a Musk–Trump reunion brewing, or just the calm before the next tweetstorm?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-stampede-an-accident-mallikarjun-kharge-mentions-kumbh-covid-2739077-2025-06-11",
      "headline": "Bengaluru stampede an accident: Mallikarjun Kharge hits at BJP over Kumbh, CovidCalling the June 4 Bengaluru stampede an accident, Congress president Mallikarjun Kharge said action will be taken if there were any intentional missteps found. Kharge's comment comes amidst the demand for resignations of Karnataka Chief Minister Siddaramaiah, Deputy Chief Minister DK Shivakumar and Home Minister G Parameshwara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-cant-broker-peace-between-his-ego-and-reality-forget-about-india-pak-ceasefire-2738998-2025-06-11",
      "headline": "Trump can't broker peace between his ego and reality, forget about India-Pak ceasefireFrom his trade war dud against China to burning his fingers in the Ukraine-Russia war to his fake claims of brokering India-Pak ceasefire to stoking fire in Los Angeles, it's a global Donald Trump clown show in the White House. And we are running out of patience and popcorn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/falcon-9s-liquid-oxygen-leak-plagues-indian-astronauts-space-launch-what-is-it-2738981-2025-06-11",
      "headline": "Liquid oxygen leak hits Indian astronaut's launch: What went wrong?SpaceX announced on Wednesday, hours before the planned launch, that the teams require more time to repair the LOx (Liquid-oxygen) leak identified during post-static fire booster inspections. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-raj-kushwaha-mother-raja-raghuvanshi-sonam-2739065-2025-06-11",
      "headline": "Video: Have mercy, mother appeals to another on live TV in honeymoon murder caseAs the Meghalaya honeymoon murder probe deepens, an emotional face-off unfolded on India Today between the mothers of the accused and the victim, laying personal grief, blame, and a demand for justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cutting-sugar-30-days-benefits-weight-loss-skin-health-mental-clarity-2739074-2025-06-11",
      "headline": "What happens when you cut sugar from your diet for 30 daysCan a 30-day sugar break improve physical and mental health? Here's what experts say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-4-trailer-manju-devi-vs-kranti-devi-brings-fun-and-frustration-to-phulera-2739023-2025-06-11",
      "headline": "Panchayat 4 trailer: Manju Devi vs Kranti Devi brings fun and frustration to PhuleraIn 'Panchayat Season 4', a lot seems to be at stake with the election battle underway. As Manju Devi and Kranti Devi indulge in a tough fight, Sachiv ji once again finds himself in the middle of the village chaos. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-sonam-killed-raja-raghuvanshi-raj-kushwaha-indore-2738928-2025-06-11",
      "headline": "Sonam had Plan B. Fresh details emerge in Meghalaya honeymoon murder caseAfter returning to her maternal home in Indore just four days after her wedding, Sonam Raghuvanshi allegedly began plotting her husband's murder and coordinating the plan with her lover over calls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/newsmo/video/why-india-is-spending-rs500-cr-on-axiom-4-2739010-2025-06-11",
      "headline": "Why India is spending ₹500 cr on Axiom-4India's ₹500 crore investment in the Axiom-4 mission covers not just one, but two astronauts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/invited-whole-world-karnataka-blames-bcci-rcb-for-bengaluru-stampede-says-no-permission-sought-for-event-2739034-2025-06-11",
      "headline": "Invited whole world: Karnataka blames BCCI, RCB in court for Bengaluru stampedeAs the Karnataka High Court hears bail pleas in the Bengaluru stampede case, the state blames RCB and BCCI, alleging unauthorised planning, misinformation, and gross mismanagement that led to 11 deaths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/misal-chole-bhature-make-india-proud-desi-breakfasts-crack-tasteatlas-top-50-2738972-2025-06-11",
      "headline": "Misal, Chole Bhature make India proud. Desi breakfasts crack TasteAtlas' Top 50In its latest edition of the 50 Best Breakfasts in the World, food guide TasteAtlas has named three Indian staples among the top contenders: Misal, Chole Bhature, and Paratha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-pawar-sharad-pawar-factions-celebrate-ncp-26th-foundation-day-amid-merger-talks-2738893-2025-06-11",
      "headline": "We're not saints: Ajit Pawar defends BJP tie-up as NCP merger buzz growsNCP's 26th foundation day saw separate events by Ajit Pawar and Supriya Sule, both focusing on development amid rising merger talks between the two factions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/young-advocate-dies-in-suddenly-in-sarojini-nagar-tehsil-in-lucknow-incident-caught-on-cctv-2739028-2025-06-11",
      "headline": "Caught on CCTV: Advocate collapses while talking in Lucknow, dies seconds laterSeveral lawyers accompanying him reported that he had suddenly collapsed while working in the office. The entire incident was recorded by the CCTV cameras installed in the tehsil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/letting-children-go-so-far-mohan-yadav-lesson-from-sonam-raja-raghuvanshi-murder-case-2739009-2025-06-11",
      "headline": "Letting children go so far...: Mohan Yadav's takeaway from Sonam Raghuvanshi caseMadhya Pradesh Chief Minister Mohan Yadav weighed in on the murder of Raja Raghuvanshi, calling the case a \"lesson to society\" and urging parents to reconsider allowing their children to travel far from home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chances-of-city-killer-asteroid-crashing-on-the-moon-just-went-up-2739006-2025-06-11",
      "headline": "Chances of city-killer asteroid crashing on the Moon just went upAstronomers have also constructed a 3D model of asteroid 2024 YR4 using observations conducted by the Gemini South telescope in Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/indo-canadians-nabbed-48-million-dollar-cocaine-seized-biggest-drug-bust-peel-region-police-toronto-ontario-2739020-2025-06-11",
      "headline": "Indo-Canadians nabbed for smuggling Rs 300 crore cocaine into CanadaNine people, including several Indo-Canadians, have been arrested as the Peel Regional Police seized 479 kg of cocaine worth CAD 47.9 million (Rs 299.4 crore). Under its Project Pelican, the agency targeted the smuggling of cocaine through commercial trucks crossing from the US into Canada's Greater Toronto Area. Two semi-automatic loaded firearms were also recovered from the smugglers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ac-temperature-limits-government-energy-saving-health-benefits-northern-india-heatwave-2738996-2025-06-11",
      "headline": "AC at 22°C best for your health, say expertsThe government is set to introduce a standardised AC temperature range to curb energy use. We decode why this is great news for public health. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/trapped-by-tradition-who-killed-raja-raghuvanshi-sonam-or-2738889-2025-06-11",
      "headline": "Trapped by tradition: Who killed Raja Raghuvanshi? Sonam or...?The tragic case of Raja Raghuvanshi, allegedly murdered by his wife Sonam in collusion with her lover, exposes the dark underbelly of India's marital system. This story isn't just about betrayal; it's a stark reminder of how India's obsession with family pride, caste, and tradition can eclipse individual choice, leading to devastating consequences"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-confirms-wife-sshura-pregnancy-with-nervousness-and-excitement-2739008-2025-06-11",
      "headline": "Arbaaz Khan confirms wife Sshura's pregnancy with nervousness and excitementActor and producer Arbaaz Khan confirmed that he and his wife, Sshura Khan, are expecting a baby. He said his priority now is to be a present and be a supportive parent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iisc-students-bag-top-6-rank-at-world-physics-challenge-indias-highest-yet-2739129-2025-06-11",
      "headline": "Indian students make history at global physics event, bag India's highest rank yetIISc Bengaluru undergrads have secured the sixth rank at PLANCKS 2025, a prestigious international theoretical physics competition, the highest by any Indian team yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rt-pcr-test-mandatory-for-ministers-before-meeting-pm-modi-india-covid-cases-2738951-2025-06-11",
      "headline": "RT-PCR test mandatory for ministers before meeting PM amid Covid surgeAround 70 BJP functionaries from Delhi -- including the Delhi Chief Minister, all seven MPs, and MLAs -- who are scheduled to meet Prime Minister Modi at his residence this evening, will undergo an RT-PCR test, sources revealed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-mayor-announces-partial-curfew-in-city-amid-violent-protests-over-immigration-raids-looting-2738888-2025-06-11",
      "headline": "Local emergency in LA: Curfew declared to stop looting, vandalism amid protestsAnnouncing the partial curfew, Mayor Karen Bass stated that the Los Angeles Police Department needed additional help -- but not from the Trump administration. She said the real solution to addressing the deteriorating law and order situation is for the Trump administration to 'stop the raids.'"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-aura-and-chirping-will-be-a-big-miss-for-india-at-slips-ollie-pope-2739096-2025-06-11",
      "headline": "Virat Kohli's aura and chirping will be a big miss for India at slips : Ollie PopeStar England batter Ollie Pope feels India will miss the presence of Virat Kohli in the slips during the all-important five-match Test series against England beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-pat-cummins-temba-bavuma-lords-2739113-2025-06-11",
      "headline": "WTC Final: Pat Cummins feels no extra pressure ahead of clash vs South AfricaPat Cummins says Australia feels no extra pressure ahead of the WTC final versus South Africa. Both teams are confident and ready to compete in a thrilling contest at Lord's with South Africa opting to field first after winning the toss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-retirement-west-indies-rishabh-pant-tribute-ipl-2025-2739076-2025-06-11",
      "headline": "Rishabh Pant sends special message to Nicholas Pooran after retirement callRishabh Pant paid a glowing tribute to Nicholas Pooran after the West Indies star announced his shock retirement from international cricket on June 10. Pant and Pooran played together at LSG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-1-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2739036-2025-06-11",
      "headline": "AUS vs SA WTC Final 2025 Day 1: Rabada puts Australia in troubleAustralia vs South Africa Live Score, World Test Championship Final 2025 Updates: Kagiso Rabada strikes early to give South Africa the upper hand as the pacer dismisses Usman Khawaja and Cameron Green in the same over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-unhappy-with-shreyas-iyers-absence-from-tests-2739027-2025-06-11",
      "headline": "Ganguly unhappy with Shreyas Iyer's absence from Tests: He can play short ballFormer India captain Sourav Ganguly is unhappy with Shreyas Iyer's absence from the Indian Test team despite his remarkable performances in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-leadership-australia-wtc-final-harbhajan-singh-2739014-2025-06-11",
      "headline": "What makes Cummins a special captain? Harbhajan explains ahead of WTC FinalHarbhajan Singh praised Pat Cummins and explained what makes the pacer a special captain ahead of the World Test Championship Final against South Africa, which will begin on June 11. Cummins is chasing his second WTC title as skipper of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-how-much-money-will-india-earn-for-finishing-third-2738994-2025-06-11",
      "headline": "WTC Final 2025: How much money will India get for finishing third in the cycle?South Africa and Australia are set to lock horns in the World Test Championship (WTC) final 2025 at Lord's in London. Despite not being in the final for the first time in WTC, India will be taking home hefty prize money for finishing third on the points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/major-league-cricket-nicholas-pooran-skipper-mi-new-york-2738987-2025-06-11",
      "headline": "After international retirement, Nicholas Pooran named captain of MI New YorkJust a day after his international cricket retirement, Nicholas Pooran has been named as the captain of MI New York ahead of the MLC 2025 season. Pooran retired from all formats for West Indies on June 10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-temba-bavuma-pre-match-press-conference-2738961-2025-06-11",
      "headline": "It's going to be tough against Australia but we've got to believe in us: Temba BavumaSouth Africa captain Temba Bavuma has acknowledged that it's going to be tough for their team to face Australia in the World Test Championship (WTC) final 2025. However, the Proteas captain has faith in his team's strength to come out on top of in the all-important clash beginning from June 20 at the Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-test-squad-shai-hope-returns-brandon-king-debut-australia-series-2024-2738952-2025-06-11",
      "headline": "Hope returns, King gets 1st call-up as West Indies announce squad for AUS TestsShai Hope returns to the West Indies Test squad while Brandon King earns his maiden call-up for the upcoming series against Australia. The team aims to bridge the gap with fresh talent and strategic leadership under new captain Roston Chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-leadership-australia-wtc-final-harbhajan-singh-2739014-2025-06-11",
      "headline": "What makes Cummins a special captain? Harbhajan explains ahead of WTC FinalHarbhajan Singh praised Pat Cummins and explained what makes the pacer a special captain ahead of the World Test Championship Final against South Africa, which will begin on June 11. Cummins is chasing his second WTC title as skipper of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-how-much-money-will-india-earn-for-finishing-third-2738994-2025-06-11",
      "headline": "WTC Final 2025: How much money will India get for finishing third in the cycle?South Africa and Australia are set to lock horns in the World Test Championship (WTC) final 2025 at Lord's in London. Despite not being in the final for the first time in WTC, India will be taking home hefty prize money for finishing third on the points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/major-league-cricket-nicholas-pooran-skipper-mi-new-york-2738987-2025-06-11",
      "headline": "After international retirement, Nicholas Pooran named captain of MI New YorkJust a day after his international cricket retirement, Nicholas Pooran has been named as the captain of MI New York ahead of the MLC 2025 season. Pooran retired from all formats for West Indies on June 10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-temba-bavuma-pre-match-press-conference-2738961-2025-06-11",
      "headline": "It's going to be tough against Australia but we've got to believe in us: Temba BavumaSouth Africa captain Temba Bavuma has acknowledged that it's going to be tough for their team to face Australia in the World Test Championship (WTC) final 2025. However, the Proteas captain has faith in his team's strength to come out on top of in the all-important clash beginning from June 20 at the Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-test-squad-shai-hope-returns-brandon-king-debut-australia-series-2024-2738952-2025-06-11",
      "headline": "Hope returns, King gets 1st call-up as West Indies announce squad for AUS TestsShai Hope returns to the West Indies Test squad while Brandon King earns his maiden call-up for the upcoming series against Australia. The team aims to bridge the gap with fresh talent and strategic leadership under new captain Roston Chase."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}