{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/loan-fraud-case-ed-issues-lookout-notice-against-anil-ambani-2764968-2025-08-01",
      "headline": "Loan fraud case: ED issues lookout notice against Anil AmbaniA lookout circular has been issued against Anil Ambani at the request of the Enforcement Directorate (ED), preventing him from travelling abroad without court permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-holiday-director-nancy-meyers-surprised-by-reports-of-limited-series-news-to-me-2765195-2025-08-02",
      "headline": "The Holiday director Nancy Meyers surprised by reports of limited series: News to me'The Holiday' director Nancy Meyers expressed surprise at reports of the romantic movie being reimagined for a limited series on Apple TV+. She said the development is news to her as well. The original film stars actors Cameron Diaz, Kate Winslet, Jude Law and Jack Black in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadujeevitham-the-real-kerala-story-got-snubbed-at-the-national-awards-2765157-2025-08-02",
      "headline": "Aadujeevitham: How the real Kerala story got snubbed at the National AwardsPrithviraj Sukumaran and director Blessy's 'Aadujeevitham' aka 'The Goat Life' got snubbed at the National Film Awards, which were announced on August 1 in New Delhi. Many fans pointed out that it was a gross misjudgement by the jury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atlee-kamal-haasan-and-mohanlal-congratulate-shah-rukh-khan-and-other-national-award-winners-2765178-2025-08-02",
      "headline": "Atlee, Kamal Haasan, and Mohanlal congratulate SRK and other National Award winnersSouth Indian celebrities, including Atlee, Kamal Haasan, and Mohanlal, shared congratulatory messages to national award winners. Atlee, who directed Shah Rukh Khan's award-winning performance in 'Jawan', thanked the actor for giving him the opportunity to direct him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-the-voice-of-melody-and-money-2765207-2025-08-02",
      "headline": "Kishore Kumar: The Voice of Melody and MoneyFrom serving as the nation's payday anthem to his eccentric financial dealings, Kishore Kumar's relationship with money was as legendary as his melodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-recalls-losing-national-award-for-swades-in-old-video-watch-video-2765152-2025-08-02",
      "headline": "Shah Rukh Khan recalls losing national award for Swades in old video. Watch videoAn old video of actor Shah Rukh Khan expressing that he should have won a national award for 'Swades' has surfaced online. Actor Saif Ali Khan won the award instead in 2004 for his performance in 'Hum Tum'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-is-in-raanjhanaa-new-ai-altered-climax-viral-video-from-theatre-2765175-2025-08-02",
      "headline": "What is in Raanjhanaa's new AI-altered climax? Viral video from theatreMore than a decade after its release, 'Raanjhanaa' returns to theatres - this time with a twist of fate and a second chance at love. But while fans cheer the AI-altered ending, its original creators call it a betrayal of art. Here's all about it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-the-odyssey-return-of-the-epic-soul-to-world-cinema-2763289-2025-08-02",
      "headline": "Ramayana, The Odyssey, and the return of the epic soul to world cinema'Ramayana-Part 1' and 'The Odyssey', helmed by directors Nitesh Tiwari and Christopher Nolan, respectively, are scheduled for a 2026 theatrical release. Both the movies hint at the resurrection of a bygone cinematic era. Can Tiwari and Nolan recreate mystical epics like 'Lanka Dahan', 'The Ten Commandments', and 'Ben-Hur'? On Cinematic Saturday, we reflect on how the visual storytelling of ancient tales bridges cultural heritage with modern spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-box-office-collection-day-2-detailed-report-major-drop-for-vijay-deverakonda-spy-film-on-friday-2765114-2025-08-02",
      "headline": "Kingdom box office Day 2: Major drop for Vijay Deverakonda's spy film on FridayVijay Deverakonda's 'Kingdom' saw a big drop in its collection on the second day at the box office. The film is expected to pick up the pace on Saturday and Sunday, after already emerging as the biggest opener of the actor's career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-15-detailed-report-ahaan-panday-film-remains-unbothered-by-new-releases-son-of-sardaar-2-and-dhadak-2-2765113-2025-08-02",
      "headline": "Saiyaara box office Day 15: Ahaan Panday's film remains unbothered by new releases'Saiyaara' didn't seem to be affected by 'Son of Sardaar 2' and 'Dhadak 2' at the box office. The film will be entering the Rs 300 crore club by the end of its third weekend in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-vs-dhadak-2-box-office-collection-day-1-detailed-report-ajay-devgn-film-earns-twice-2765105-2025-08-02",
      "headline": "Son of Sardaar 2 vs Dhadak 2 box office Day 1: Ajay Devgn's film earns twiceBoth 'Son of Sardaar 2' and 'Dhadak 2' have received mixed reviews from the audience and critics. The films also faced 'Saiyaara', opening to a single-digit figure at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-kalabhavan-nawas-found-dead-at-kochi-hotel-2765102-2025-08-02",
      "headline": "Malayalam actor Kalabhavan Nawas found dead at Kochi hotelActor Kalabhavan Nawas had reportedly gone to his hotel room to bring his luggage while checking out. However, the hotel staff found him dead in the room when they went up to check on him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/flaco-jimenez-accordion-king-who-made-tejano-global-dies-at-86-glbs-2765069-2025-08-02",
      "headline": "Flaco Jimenez, accordion king who made Tejano global, dies at 86Flaco Jimenez, Grammy-winning accordionist, brought global recognition to Tejano and conjunto music through his genre-blending style and iconic  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-returns-as-spider-man-in-brand-new-day-first-look-at-new-suit-glbs-2765060-2025-08-02",
      "headline": "Spider-Man: Brand New Day teaser released as Tom Holland swings back into actionTom Holland returns in Spider-Man: Brand New Day. Sony teases a new suit, real-world filming in Glasgow, and direction by Shang-Chi's Destin Daniel Cretton.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-reacts-to-winning-first-national-award-for-jawan-2764923-2025-08-01",
      "headline": "Overwhelmed SRK calls National Award responsibility to show truth, not finishing lineActor Shah Rukh Khan wrote a heartfelt note on winning the Best Actor in a Leading Role Award for 'Jawan' at the 71st National Film Awards. He shared the award with actor Vikrant Massey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-kardashian-reacts-to-anthony-hopkins-hanibal-spoof-of-her-face-wrap-brand-2764942-2025-08-01",
      "headline": "Kim Kardashian reacts to Anthony Hopkins Hanibal spoof of her face wrap brandActor Anthony Hopkins humorously wore a SKIMS face wrap resembling his Hannibal Lecter mask. He joked about feeling younger in the viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-rao-thanks-shah-rukh-khan-anirudh-national-award-win-chaleya-best-playback-singer-2764973-2025-08-01",
      "headline": "Shilpa Rao thanks Shah Rukh Khan, Anirudh as she wins National Award for ChaleyaSinger Shilpa Rao thanked actor Shah Rukh Khan after winning the Best Playback Singer Award at the 71st National Award. She won the award for the romantic track - 'Chaleya' from 'Jawan'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/janki-bodiwala-dedicates-national-award-to-team-vash-calls-director-her-god-2764984-2025-08-01",
      "headline": "Janki Bodiwala dedicates National Award to team Vash, calls director her godJanki Bodiwala won the Best Supporting Actor award at the 71st National Film Awards for her impactful role in the Gujarati film 'Vash', marking a major milestone in her career. She shared the honour with Malayalam actor Urvashi and hopes this win will inspire more female-led stories in regional cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-dedicates-national-award-win-to-marginalised-privileged-sharing-it-with-shah-rukh-khan-2764959-2025-08-01",
      "headline": "Vikrant Massey dedicates National Award to marginalised, lucky sharing it with SRKVikrant Massey has won his first National Award for his powerful role in the film '12th Fail'. He expressed heartfelt gratitude and dedicated the honour to marginalised people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sudipto-sen-best-director-the-kerala-story-national-film-awards-2023-2764957-2025-08-01",
      "headline": "The Kerala Story's Sudipto Sen reacts to Best Director win at National AwardsSudipto Sen won the Best Director for 'The Kerala Story' at the 71st National Film Awards. The film's portrayal of ISIS recruitment sparked debate but gained widespread public support."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-on-way-to-become-3rd-biggest-economy-pm-modi-in-varanasi-day-after-trumps-dead-economy-remark-2765198-2025-08-02",
      "headline": "India on way to 3rd biggest economy: PM Modi after Trump's 'dead economy' remarkPrime Minister Narendra Modi on Friday made a strong pitch for 'swadeshi' products and reaffirmed the resilience of the Indian economy amid global economic turbulence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-claims-his-name-missing-from-bihar-survey-list-election-commission-2765223-2025-08-02",
      "headline": "Tejashwi Yadav claims his name missing from Bihar survey list, poll body countersRJD leader Tejashwi Yadav on Saturday alleged his name was missing from Bihar's revised draft voters' list, a claim the Election Commission promptly denied by sharing his electoral details."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/have-no-reports-of-indian-oil-firms-halting-russian-buys-government-sources-after-trumps-good-step-remark-2765120-2025-08-02",
      "headline": "Have no reports of Indian oil firms halting Russian imports: Government sourcesGovernment sources dismissed the reports of Indian firms stopping Russian oil imports, asserting that India's energy decisions are based on market dynamics and national interest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadujeevitham-the-real-kerala-story-got-snubbed-at-the-national-awards-2765157-2025-08-02",
      "headline": "Aadujeevitham: How the real Kerala story got snubbed at the National AwardsPrithviraj Sukumaran and director Blessy's 'Aadujeevitham' aka 'The Goat Life' got snubbed at the National Film Awards, which were announced on August 1 in New Delhi. Many fans pointed out that it was a gross misjudgement by the jury.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gunfight-underway-with-3-lashkar-terrorists-in-jks-kulgam-2764971-2025-08-01",
      "headline": "3 terrorists killed in gunfight with security forces in J&K in Operation AkhalThree TRF terrorists were killed, and one more is trapped in an ongoing gunfight with security forces in Jammu and Kashmir's Kulgam district. The encounter is part of Operation Akhal following inputs about terrorists linked to the Pahalgam attack.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-dog-bite-stray-problem-reality-supreme-court-ncr-number-girl-died-hospitals-data-animal-welfare-2763559-2025-08-02",
      "headline": "What's Delhi's dog-bite reality that has alarmed the Supreme Court tooThe Supreme Court took suo motu cognisance of the surge in dog-bite cases and rabies deaths in Delhi, calling them \"deeply disturbing\". The top court was compelled to act after the death of a six-year-old. Data also revealed that dog-bite cases have more than tripled since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/is-raj-thackerays-stagecraft-with-mva-another-prep-for-maharashtras-political-reset-2764220-2025-07-31",
      "headline": "Is Raj Thackeray's stagecraft with MVA another prep for Maharashtra's political reset?After the show of strength with Uddhav Thackeray, the MNS chief is set to join forces with key leaders of the Opposition bloc at the PWP's foundation day rally on August 2\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-the-voice-of-melody-and-money-2765207-2025-08-02",
      "headline": "Kishore Kumar: The Voice of Melody and MoneyFrom serving as the nation's payday anthem to his eccentric financial dealings, Kishore Kumar's relationship with money was as legendary as his melodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/37-year-old-man-milind-kulkarni-collapses-during-workout-at-pune-gym-dies-at-hospital-2765158-2025-08-02",
      "headline": "Video: 37-year-old man collapses during workout at Pune gym, dies at hospitalMilind Kulkarni was in the middle of his workout when he took a short break. He drank some water and suddenly felt dizzy. He then collapsed and died at the hospital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jeff-bezos-blue-origin-to-launch-agra-born-real-estate-investor-to-edge-of-space-2765211-2025-08-02",
      "headline": "Meet Arvi Singh: Agra-born investor set to go to edge of spaceHe holds both a private pilot's license and helicopter training, and his latest journey with Blue Origin is the culmination of a lifetime devoted to exploration and adventure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-the-odyssey-return-of-the-epic-soul-to-world-cinema-2763289-2025-08-02",
      "headline": "Ramayana, The Odyssey, and the return of the epic soul to world cinema'Ramayana-Part 1' and 'The Odyssey', helmed by directors Nitesh Tiwari and Christopher Nolan, respectively, are scheduled for a 2026 theatrical release. Both the movies hint at the resurrection of a bygone cinematic era. Can Tiwari and Nolan recreate mystical epics like 'Lanka Dahan', 'The Ten Commandments', and 'Ben-Hur'? On Cinematic Saturday, we reflect on how the visual storytelling of ancient tales bridges cultural heritage with modern spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-engineer-ashok-kumar-panda-vigilance-raid-raja-kishore-jena-cash-gold-luxury-properties-2765057-2025-08-02",
      "headline": "Engineer hides with family during raid at house, throws bag of cash. Then a twistA raid on a Bhubaneswar engineer led to the discovery of two four-storey buildings, seven flats, four commercial properties and nine high-value plots in and around the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/supper-clubs-are-having-a-moment-and-its-not-just-about-the-food-2764790-2025-08-02",
      "headline": "Supper clubs are having a moment, and it's not just about the foodSupper clubs, a rising trend in the food scene, are all about turning strangers into dinner companions over delicious food and laid-back conversations. There's something special about sharing a table, discovering new flavours, and chatting without pressure; it brings people together in the most effortless way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nia-court-grants-bail-to-kerala-nuns-who-were-arrested-on-human-trafficking-and-conversion-charges-2765203-2025-08-02",
      "headline": "Kerala nuns arrested on human trafficking, conversion charges granted bailThe three acsused will have to furnish a bond of Rs 50,000 each and will also have to surrender their passports to the court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-records-herself-dancing-inside-us-subway-coach-viral-video-sparks-backlash-2765226-2025-08-02",
      "headline": "Indian woman records herself dancing inside US subway coach. Video sparks backlashA video of an Indian woman dancing inside a US subway coach, allegedly blocking fellow passengers, has left social media users irritated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-511-01-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/healthy-baby-born-from-30-year-frozen-embryo-us-fertility-breakthrough-2764844-2025-08-02",
      "headline": "How a 30-year-old frozen embryo became the world's oldest babyA healthy baby boy was born in the US from an embryo frozen for over 30 years. This medical achievement raises new possibilities and hope for fertility treatments worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-v-england-oval-test-mohammed-siraj-jasprit-bumrah-absence-2765081-2025-08-02",
      "headline": "No Jassi bhai, no problem: Workhorse Siraj steps up for India againENG vs IND, 5th Test: India looked adrift on a gloomy day at The Oval. No Bumrah, no early breakthroughs, no rhythm. Ben Duckett and Zak Crawley were tearing into an attack that seemed toothless. But then, Mohammed Siraj stepped in. The man who's quietly carried India's pace load this series stepped up and swung the momentum in India's favour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/global-student-prize-2025-5-indian-students-shortlisted-in-top-50-2765206-2025-08-02",
      "headline": "Meet the 5 Indian students shortlisted for Global Student Prize 2025 top 50From Bihar to Bangalore, these five Indian students have made it to the top 50 shortlist of the Global Student Prize 2025. Their work spans prison reform, climate action, rural entrepreneurship, gender economics, and elder care – each proving that young changemakers can lead global transformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-opt-out-of-governor-race-former-vice-president-tells-stephen-colbert-cbs-interview-2765110-2025-08-02",
      "headline": "Why did Kamala Harris opt out of Governor race? Ex-Veep tells Stephen ColbertFormer US Vice President Kamala Harris, in her first interview after losing the presidential election to Donald Trump, said she is stepping away from political office for now, calling the system 'broken'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lok-sabha-polls-were-rigged-weve-documents-rahul-gandhis-big-charge-at-congress-event-2765156-2025-08-02",
      "headline": "Lok Sabha poll rigged, we've proof: Rahul Gandhi's big charge at Congress eventRahul Gandhi alleged the 2024 Lok Sabha elections were rigged, claiming the Congress has data proving 1.5 lakh fake voters in one constituency. He also declared the Election Commission is no longer functioning independently.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-submarines-already-under-watch-no-response-needed-russian-lawmaker-glbs-2765082-2025-08-02",
      "headline": "Enough nuke submarines to control two: Russian lawmaker after Trump's moveRussia dismisses Trump's submarine move, claiming US subs are already tracked. Moscow urges calm as tensions rise amid fears of direct conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-holiday-director-nancy-meyers-surprised-by-reports-of-limited-series-news-to-me-2765195-2025-08-02",
      "headline": "The Holiday director Nancy Meyers surprised by reports of limited series: News to me'The Holiday' director Nancy Meyers expressed surprise at reports of the romantic movie being reimagined for a limited series on Apple TV+. She said the development is news to her as well. The original film stars actors Cameron Diaz, Kate Winslet, Jude Law and Jack Black in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadujeevitham-the-real-kerala-story-got-snubbed-at-the-national-awards-2765157-2025-08-02",
      "headline": "Aadujeevitham: How the real Kerala story got snubbed at the National AwardsPrithviraj Sukumaran and director Blessy's 'Aadujeevitham' aka 'The Goat Life' got snubbed at the National Film Awards, which were announced on August 1 in New Delhi. Many fans pointed out that it was a gross misjudgement by the jury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atlee-kamal-haasan-and-mohanlal-congratulate-shah-rukh-khan-and-other-national-award-winners-2765178-2025-08-02",
      "headline": "Atlee, Kamal Haasan, and Mohanlal congratulate SRK and other National Award winnersSouth Indian celebrities, including Atlee, Kamal Haasan, and Mohanlal, shared congratulatory messages to national award winners. Atlee, who directed Shah Rukh Khan's award-winning performance in 'Jawan', thanked the actor for giving him the opportunity to direct him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-the-voice-of-melody-and-money-2765207-2025-08-02",
      "headline": "Kishore Kumar: The Voice of Melody and MoneyFrom serving as the nation's payday anthem to his eccentric financial dealings, Kishore Kumar's relationship with money was as legendary as his melodies."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-3-live-score-updates-oval-yashasvi-jaiswal-shubman-gill-2765232-2025-08-02",
      "headline": "ENG vs IND, 5th Test Day 3 Live: Can Jaiswal give India a flying start?ENG vs IND, 5th Test Day 3 Live Score and Updates: Opener Yashasvi Jaiswal will aim to give India a solid start as they push for a defining lead on Day 3 of the Oval Test. England bowlers seek early breakthroughs, with weather a potential factor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/summerslam-2025-venue-date-time-match-card-streaming-details-2765228-2025-08-02",
      "headline": "WWE SummerSlam 2025: Full match card, streaming details and all you need to knowWWE SummerSlam is all set to take place on August 2 and 3 as the biggest party of the summer will be held for the first time across two days. All the main titles are set to be defended with John Cena vs Cody Rhodes and CM Punk vs Gunther expected to be the main events of the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-ishan-kishan-east-zone-captain-mohammed-shami-back-2765210-2025-08-02",
      "headline": "Ishan Kishan to lead East Zone: Shami back, Suryavanshi on standbyIndia wicketkeeper-batter Ishan Kishan was named East Zone captain for the Duleep Trophy. Pacer Mohammed Shami returned to first-class cricket, while 14-year-old Vaibhav Suryavanshi was included among the standby players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-mohammed-siraj-jasprit-bumrah-conversation-2765177-2025-08-02",
      "headline": "Just take 5 wickets: Mohammed Siraj on heartwarming Jasprit Bumrah conversationMohammed Siraj revealed the heartwarming conversation he had with Jasprit Bumrah ahead of his spell in the Oval Test. Siraj picked up four wickets and helped India bundle out England for 247 runs in the first innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-jasprit-bumrah-prasidh-krishna-press-conference-2765154-2025-08-02",
      "headline": "Plans remain the same even if Jasprit Bumrah is playing or not: Prasidh KrishnaPrasidh Krishna has said that the plans remain the same for the bowlers, irrespective of Jasprit Bumrah being present in the team or not. Prasidh made a return to the lineup and picked up four wickets at the Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-marcus-trescothick-frustrated-dropped-catches-oval-test-2765149-2025-08-02",
      "headline": "England frustrated with dropped catches vs India in Oval Test: TrescothickENG vs IND: India opener Yashasvi Jaiswal was handed two lives on his way to a rapid fifty, as England's sloppy fielding frustrated the hosts. Assistant coach Marcus Trescothick admitted the dropped chances proved costly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-batting-key-oval-test-varun-aaron-2765140-2025-08-02",
      "headline": "Shubman Gill's batting will be key for India in Oval Test: Varun AaronENG vs IND: With India looking to level the series at The Oval, Varun Aaron believes skipper Shubman Gill holds the key. The pacer expects Gill to anchor the innings and steer India to a strong lead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-jacob-bethell-selection-michael-vaughan-2765139-2025-08-02",
      "headline": "Did England make a mistake with Bethell's Oval Test selection? Vaughan reactsMichael Vaughan criticised England's decision to include Jacob Bethell in the Oval Test despite minimal first-class cricket experience during the summer. Bethell has had minimal effect with bat and ball so far in the Oval Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-conceding-lead-win-history-says-2765126-2025-08-02",
      "headline": "Can India win Oval Test after conceding lead? Here's what history saysENG vs IND, 5th Test: India have won two Test matches at the Kennington Oval and have a chance to add to that tally in the ongoing series, where they are aiming to save the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-three-london-weather-report-2765123-2025-08-02",
      "headline": "ENG vs IND, Oval Test Day 3 weather report: Will rain halt India's momentum?The Oval Test is in the balance at the moment after an exciting two days of play which did have its fair share of issues with rain interruptions. Will the weather affect the day's play on Saturday, August 2 to halt India's momentum?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-prasidh-krishna-reaction-joe-root-spat-2765109-2025-08-02",
      "headline": "Didn't expect that reaction: Prasidh on fiery moment with good mate RootPrasidh Krishna said that he wasn't expecting a big reaction from Joe Root after their verbal spat on Day 2 of the Oval Test on Friday, August 1. Prasidh and Root had a war of words as the umpires had to intervene to solve the matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-batting-key-oval-test-varun-aaron-2765140-2025-08-02",
      "headline": "Shubman Gill's batting will be key for India in Oval Test: Varun AaronENG vs IND: With India looking to level the series at The Oval, Varun Aaron believes skipper Shubman Gill holds the key. The pacer expects Gill to anchor the innings and steer India to a strong lead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-jacob-bethell-selection-michael-vaughan-2765139-2025-08-02",
      "headline": "Did England make a mistake with Bethell's Oval Test selection? Vaughan reactsMichael Vaughan criticised England's decision to include Jacob Bethell in the Oval Test despite minimal first-class cricket experience during the summer. Bethell has had minimal effect with bat and ball so far in the Oval Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-conceding-lead-win-history-says-2765126-2025-08-02",
      "headline": "Can India win Oval Test after conceding lead? Here's what history saysENG vs IND, 5th Test: India have won two Test matches at the Kennington Oval and have a chance to add to that tally in the ongoing series, where they are aiming to save the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-day-three-london-weather-report-2765123-2025-08-02",
      "headline": "ENG vs IND, Oval Test Day 3 weather report: Will rain halt India's momentum?The Oval Test is in the balance at the moment after an exciting two days of play which did have its fair share of issues with rain interruptions. Will the weather affect the day's play on Saturday, August 2 to halt India's momentum?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-prasidh-krishna-reaction-joe-root-spat-2765109-2025-08-02",
      "headline": "Didn't expect that reaction: Prasidh on fiery moment with good mate RootPrasidh Krishna said that he wasn't expecting a big reaction from Joe Root after their verbal spat on Day 2 of the Oval Test on Friday, August 1. Prasidh and Root had a war of words as the umpires had to intervene to solve the matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-son-heung-min-leaves-tottenham-hotpsur-thomas-frank-2765095-2025-08-02",
      "headline": "Son Heung-Min announces decision to leave Tottenham: Need a new environmentSon Heung-Min has announced his decision to leave Tottenham Hotspur this summer ahead of the start of the new Premier League campaign. Son is a legend at the club, having joined them in 2015. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-joe-root-spat-prasidh-krishna-marcus-trescothick-2765086-2025-08-02",
      "headline": "Root vs Krishna: England batting coach plays down heated exchangeENG vs IND: England batting coach Marcus Trescothick opened up on the verbal volleys between Joe Root and Prasidh Krishna on Day 2 of the fifth Test at the Kennington Oval in London. Trescothick also commented on the interesting send-off that Akash Deep gave to Ben Duckett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-prasidh-krishna-on-indias-bowling-plan-in-2nd-session-at-oval-2765056-2025-08-02",
      "headline": "How clumsy India fought back after poor start with ball? Prasidh Krishna revealsIndia fast bowler Prasidh Krishna revealed how they scripted a comeback in the second session on Day 2 of the fifth Test against England at the Oval after an aggressive opening stand between Ben Duckett and Zak Crawley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-v-england-oval-test-mohammed-siraj-jasprit-bumrah-absence-2765081-2025-08-02",
      "headline": "No Jassi bhai, no problem: Workhorse Siraj steps up for India againENG vs IND, 5th Test: India looked adrift on a gloomy day at The Oval. No Bumrah, no early breakthroughs, no rhythm. Ben Duckett and Zak Crawley were tearing into an attack that seemed toothless. But then, Mohammed Siraj stepped in. The man who's quietly carried India's pace load this series stepped up and swung the momentum in India's favour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-mohammed-siraj-day-2-yashasvi-jaiswal-2765042-2025-08-02",
      "headline": "Lion-hearted Siraj, brave Jaiswal inspire Indian fightback in spicy Oval TestIndia vs England, 5th Test: Mohammed Siraj and Prasidh Krishna's efforts with the ball and Yashasvi Jaiswal's brisk second-innings fifty helped India overcome a poor morning session and edge ahead in a thrilling Test at Oval in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-kl-rahul-umpire-prasidh-root-sledging-2765023-2025-08-01",
      "headline": "Want us to keep quiet? Watch KL Rahul argue with umpire to back Prasidh vs RootIndia vs England: Day 2 of the final Anderson-Tendulkar Trophy Test saw intense sledging between Indian fast bowlers and England players. KL Rahul argued with umpire Kumar Dharmasena, who was seen warning Prasidh Krishna for a verbal duel with Joe Root. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-afghanistan-uae-asia-cup-schedule-tri-series-2764998-2025-08-01",
      "headline": "Pakistan, Afghanistan, UAE to play T20I tri-series to prepare for Asia CupPakistan, Afghanistan, and the UAE will play a T20I tri-series in Sharjah from August 29 to September 7, 2025. Each team plays the others twice in a double round-robin, with the top two meeting in the final on September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-mohammed-siraj-heart-oval-2764991-2025-08-01",
      "headline": "Siraj earns praise for fiery Oval spell: His heart is bigger than anyone else'sEngland vs India, 5th Test: Mohammed Siraj delivered a fiery bowling spell to lead India's comeback in the final Test at The Oval. Siraj bowled eight overs in a gritty post-lunch session on Day 2 in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-mohammed-siraj-day-2-yashasvi-jaiswal-2765042-2025-08-02",
      "headline": "Lion-hearted Siraj, brave Jaiswal inspire Indian fightback in spicy Oval TestIndia vs England, 5th Test: Mohammed Siraj and Prasidh Krishna's efforts with the ball and Yashasvi Jaiswal's brisk second-innings fifty helped India overcome a poor morning session and edge ahead in a thrilling Test at Oval in London. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-oval-test-kl-rahul-umpire-prasidh-root-sledging-2765023-2025-08-01",
      "headline": "Want us to keep quiet? Watch KL Rahul argue with umpire to back Prasidh vs RootIndia vs England: Day 2 of the final Anderson-Tendulkar Trophy Test saw intense sledging between Indian fast bowlers and England players. KL Rahul argued with umpire Kumar Dharmasena, who was seen warning Prasidh Krishna for a verbal duel with Joe Root. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-afghanistan-uae-asia-cup-schedule-tri-series-2764998-2025-08-01",
      "headline": "Pakistan, Afghanistan, UAE to play T20I tri-series to prepare for Asia CupPakistan, Afghanistan, and the UAE will play a T20I tri-series in Sharjah from August 29 to September 7, 2025. Each team plays the others twice in a double round-robin, with the top two meeting in the final on September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-mohammed-siraj-heart-oval-2764991-2025-08-01",
      "headline": "Siraj earns praise for fiery Oval spell: His heart is bigger than anyone else'sEngland vs India, 5th Test: Mohammed Siraj delivered a fiery bowling spell to lead India's comeback in the final Test at The Oval. Siraj bowled eight overs in a gritty post-lunch session on Day 2 in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-asia-cup-oval-test-england-vs-india-2764975-2025-08-01",
      "headline": "Did India rest Jasprit Bumrah from Oval Test with Asia Cup as bigger priority?ENG vs IND: India has released Jasprit Bumrah from the squad ahead of the fifth and final Test at The Kennington Oval in London. According to a BCCI source, the decision was made with an eye on managing his workload, as Bumrah is expected to feature in the upcoming Asia Cup.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-matt-henry-mitchell-santner-2764947-2025-08-01",
      "headline": "New Zealand wipe out Zimbabwe in 1st Test, take 1-0 series leadZIM vs NZ: New Zealand secured a 1-0 lead in the series after beating Zimbabwe by nine wickets in the opening game at the  Queens Sports Club in Bulawayo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-prasidh-krishna-joe-root-video-fight-2764934-2025-08-01",
      "headline": "Oval Test: Nice guy Joe Root loses his cool after verbal volley with Prasidh KrishnaEngland vs India, 5th Test: Joe Root lost his cool after fast bowler Prasidh Krishna sledged him during the second session on Day 2. The Indian bowlers were fired up after being taken to the cleaners in the first session on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-aakash-deep-faces-flak-for-send-off-to-ben-duckett-in-oval-test-2764890-2025-08-01",
      "headline": "Unnecessary? Aakash Deep faces flak for send-off to Ben Duckett in Oval TestIndia fast bowler Akash Deep is facing flak for making unnecessary physical contact with England batter Ben Duckett after dismissing him on Day 2 of the fifth Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-224-batting-collapse-atkinson-5-wickets-day-2-oval-test-2764810-2025-08-01",
      "headline": "34 balls, 6 runs, 4 wickets: India's lower-order blown away on Day 2 morningEngland needed just 34 balls to dismantle the remaining four Indian wickets on a lively second morning at The Oval, bundling the visitors out for a modest 224 — the lowest first-innings total of the series so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-rahane-dropped-west-zone-duleep-trophy-bcci-zonal-format-2764789-2025-08-01",
      "headline": "End of the road for Pujara, Rahane: Legends left out of Duleep Trophy squadVeteran Indian cricketers Cheteshwar Pujara and Ajinkya Rahane have been left out of the West Zone Duleep Trophy squad. This decision could turn out to be a big hit on their Test careers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2  Highlights: Jaiswal fifty extends India's lead to 52 at StumpsIndia (IND) vs England (ENG), 5th Test, Day 2  Highlights: Yashasvi Jaiswal scored a 44-ball half-century as India extended their lead to 52 at Stumps on the second day. Gus Atkinson and Josh Tongue picked up a wicket apiece. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}