{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-550-points-lower-nifty-dips-as-it-stocks-slide-2626082-2024-10-31",
      "headline": "Sensex ends over 550 points lower, Nifty dips as IT stocks slideThe S&P BSE Sensex dropped by 553.12 points to close at 79,389.06, while the NSE Nifty50 fell 135.50 points, settling at 24,205.35. Broader market indices also declined as volatility weighed on investor sentiment across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-share-price-gain-10-percent-today-usfda-approval-goa-facility-stock-benefit-explained-2625958-2024-10-31",
      "headline": "Explained: Why Cipla share price surged up to 10% todayCipla share price: The stock rose by 9.88% to reach a day high of Rs 1,557.45 on the Bombay Stock Exchange (BSE).  At 10:41 am, shares of Cipla were up 8.24% at Rs 1,534.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-nbfc-hdfc-bank-arm-files-for-rs-12500-crore-ipo-check-details-2625953-2024-10-31",
      "headline": "HDFC Bank's HDB Financial files Rs 12,500 crore IPO. Check detailsHDFC Bank, holding a 94.6% stake in HDB Financial, will sell shares worth up to Rs 10,000 crore, while HDB Financial plans to issue fresh shares totalling Rs 2,500 crore, as outlined in the filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-openig-dalal-street-sensex-nifty-fall-fii-outflow-weak-q2-results-overvaluation-2625947-2024-10-31",
      "headline": "Diwali fireworks missing from Dalal Street as Sensex, Nifty fall The S&P BSE Sensex was down 199.13 points to 79,743.05 at 10:07 am, while the NSE Nifty50 fell 126 points to 24,340.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2625408-2024-10-30",
      "headline": "Afcons Infrastructure IPO allotment: Step-by-step guide to check status Afcons Infrastructure allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-day-3-check-latest-subscription-gmp-sees-dip-2625226-2024-10-29",
      "headline": "Afcons Infrastructure Day 3: Check latest subscription, GMP sees dip  The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-expert-tips-to-maximise-your-diwali-returns-review-2625087-2024-10-29",
      "headline": "Muhurat trading 2024: Expert tips to maximise your Diwali returnsMuhurat trading is a unique session conducted by Indian stock exchanges on Diwali, rooted in the belief that this 'auspicious hour' is a time to attract prosperity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-q2-results-profit-surges-664-percent-yoy-to-rs-1742-crore-2625030-2024-10-29",
      "headline": "Adani Enterprises Q2 results: Profit surges 664% YoY to Rs 1,742 croreThe company reported a net profit of Rs 1,742 crore in the July-September quarter, up from Rs 228 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-momentum-weak-session-banking-diwali-week-2625027-2024-10-29",
      "headline": "Sensex, Nifty pare losses to end higher as banking stocks gainThe S&P BSE Sensex rose 363.99 points to 80,369.03 at the closing bell, while the NSE Nifty50 gained 127.70 points to settle at 24,446.85. Most of the broader market indices, including smallcap and midcaps, staged a stronger recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buying-property-this-festive-season-diwali-2024-top-3-things-you-should-consider-expert-advice-2625010-2024-10-29",
      "headline": "Buying property this festive season: 3 things you should consider Many people consider Dhanteras an auspicious time to make significant investments, with property being one of the most popular choices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-falls-over-5-percent-q2-profit-declines-market-expectations-2624959-2024-10-29",
      "headline": "Maruti Suzuki share price slumps over 5% as Q2 profit declines 17%Following a disappointing Q2 performance, shares of Maruti Suzuki fell over 5.5% amid concerns about the company's future growth.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-diwali-celebrations-with-jawans-kutch-gujarat-2626021-2024-10-31",
      "headline": "Government won't compromise on even an inch of India's borders: PM ModiDuring his visit to Kachchh, PM Modi was seen offering sweets to Indian soldiers as he celebrated the festival of lights with jawans at Lucky Nala near Sir Creek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patrolling-starts-indo-china-border-disengagement-completes-line-of-actual-control-lac-ladakh-2626011-2024-10-31",
      "headline": "Patrolling resumes at Depsang, Demchok as disengagement along LAC completeThe Indian and Chinese armies resumed patrolling in eastern Ladakh's Demchok and Depsang Plains after completing disengagement, following an agreement to end the four-year standoff along the India-China border. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/crisis-canada-immigration-record-number-people-food-banks-toronto-st-peters-inflation-housing-crisis-grocery-2625713-2024-10-31",
      "headline": "Crisis at food banks is reality check of the Canadian dreamFood banks in Canada, which provide food for free, have been pushed to the brink as a record number of people are leaning on them for survival. Around 30% of those tapping the food banks are newcomers to Canada and are likely to include Indians. This is how the rush at food banks is a reality check of the Canadian dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-live-updates-mi-csk-rcb-kkr-dc-pbks-srh-rr-gt-lsg-pant-retained-released-list-2625927-2024-10-31",
      "headline": "LIVE Updates: Focus on Pant, Rahul, and Iyer as teams set to announce listIPL Retention 2025 LIVE Updates: All 10 IPL franchises are set to announce their final retentions by 5 PM IST today. Teams can keep up to six players within a Rs 120 crore budget, with a cap of five capped and two uncapped Indian players, ahead of the 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/amaran-review-sivakarthikeyan-sai-pallavi-2625999-2024-10-31",
      "headline": "Amaran review: Emotional tribute to army menReleased-Thu Oct 31, 2024Amaran movie review: Directed by Rajkumar Periasamy, Amaran is a biopic of Major Mukund Varadarajan, starring Sivakarthikeyan and Sai Pallavi. The film is a fitting tribute to the valour and sacrifice of Major Mukund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/karthik-naralasetty-the-hills-mayor-election-texas-us-presidential-election-andhra-guntur-indian-origin-2626042-2024-10-31",
      "headline": "Meet Karthik, Indian-American businessman running for Mayor in TexasIf elected, Karthik Naralasetty would be the youngest mayor in The Hills' history and the first of Indian descent, marking a historic milestone for both The Hills and Texas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/war-plan-against-israel-to-continue-naim-qassem-1st-speech-as-new-hezbollah-chief-2625971-2024-10-31",
      "headline": "War plan against Israel to go on: Naim Qassem in 1st speech as Hezbollah chiefQassem said that those claiming Israel was provoked into war due to the October 7 (2023) attacks by Hamas, are forgetting 75 years of killing of Palestinians, stealing of their land, holy sites, and other properties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-sardar-vallabhbhai-patel-birth-anniversary-gujarat-kevadia-statue-of-unity-rashtriya-ekta-diwas-2625918-2024-10-31",
      "headline": "One Nation One Election, Uniform Civil Code soon: PM on Unity Day in GujaratPrime Minister Narendra Modi paid floral tribute to Sardar Vallabhbhai Patel on the latter's 149th birth anniversary at the Statue of Unity in Gujarat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-cryptic-post-arjun-kapoor-confirms-breakup-2625960-2024-10-31",
      "headline": "Malaika Arora shares cryptic post after Arjun Kapoor confirms breakupMalaika Arora shared a cryptic post about touching hearts following Arjun Kapoor's public confirmation of their breakup. The former couple started dating in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/chennai-ceo-complains-rapido-driver-demanded-extra-money-company-takes-strict-action-2626018-2024-10-31",
      "headline": "Chennai CEO complains Rapido driver demanded extra money, company takes strict actionAshok Raj Rajendran explained that he had reported the matter initially on the customer support section of the Rapido app but failed to receive help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/election-commission-of-india-point-by-point-explanation-congress-dismissing-evm-tampering-claim-2625959-2024-10-31",
      "headline": "On Congress's EVM tampering claim, poll body's point-by-point rebuttalAfter losing the October 5 Haryana Assembly polls, Congress had expressed apprehensions over the display of a 99 per cent battery status on EVMs during vote counting. It suggested possible tampering of EVMs and intentional delay of the counting process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-series-defeat-gautam-gambhir-press-conference-2625984-2024-10-31",
      "headline": "New Zealand series loss hurting but can't just blame batters: Coach GambhirIndia head coach Gautam Gambhir admitted that the Test series loss to New Zealand was hurting while calling for accountability across the board for the Pune and Bengaluru losses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-voyager-1-transmitter-not-used-since-1981-re-established-communication-2625948-2024-10-31",
      "headline": "Voyager-1, Earth's interstellar traveller, calls home on a dying signalNasa successfully re-established communication with the Voyager 1 spacecraft on October 24 after a brief pause due to a fault protection system activation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-presidential-election-2024-live-updates-kamala-harris-donald-trump-vice-president-tim-walz-jd-vance-2626056-2024-10-31",
      "headline": "Trump, Kamala Harris trade blame for deepening polarisation in final campaignUS Presidential Election 2024 Live Updates: Donald Trump and Kamala Harris, along with their running mates JD Vance and Tim Walz, are on the final leg of their campaigns with just days left until the US Presidential election. Both the Republican and Democratic camps are confident of winning the Oval Office, with polls predicting a close race. Early voting has already started, showing a steady turnout in many states. Voter turnout is expected to be high, reflecting the intense interest and stakes involved. Key issues dominating the campaign include the economy, immigration, healthcare, abortion rights, foreign policy, and several other topics. The election is closely watched worldwide, as the outcome will have significant implications for global policies. Stay tuned with India Today for the latest updates in the lead-up to the November 5 US Presidential election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/neet-ug-exam-reforms-multiple-stage-exam-digital-papers-other-proposals-2626054-2024-10-31",
      "headline": "Multi-stage NEET UG exams, digital paper delivery among suggested reformsA government panel has proposed multi-stage NEET UG exams, digital question papers, and OMR responses to tackle exam security risks following the recent paper leak incident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kbc-16-varun-dhawan-sings-lullaby-for-daughter-lara-asks-big-b-for-parenting-tips-2625964-2024-10-31",
      "headline": "KBC 16: Varun Dhawan sings lullaby for daughter Lara, asks Big B for parenting tipsVarun Dhawan got a 'golden rule' of parenting from Amitabh Bachchan during his appearance on KBC 16. He also sang a lullaby that he made for his daughter Lara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/indias-silent-epidemic-whats-killing-our-students-2625134-2024-10-29",
      "headline": "India's silent epidemic: What's killing our students? Surging suicides in campuses, driven by relentless academic pressure and inadequate mental health support, expose the deep-rooted flaws in the educational and societal frameworks\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-rajnath-singh-india-china-truce-consensus-restore-ground-situation-disengagement-ladakh-2625946-2024-10-31",
      "headline": "Aim is to go beyond disengagement: Defence Minister on India-China border truceArmy sources on Wednesday confirmed that disengagement between Indian and Chinese forces in eastern Ladakh's Depsang and Demchok plains was completed, four years after continued tensions in the wake of the 2020 border skirmishes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-woman-beautician-missing-killed-body-parts-chopped-jodhpur-police-case-2625903-2024-10-31",
      "headline": "Beautician, 50, went missing in Rajasthan, chopped body parts found 2 days laterA 50-year-old woman, a beautician by profession, went missing for two days in Jodhpur before police found her chopped body parts buried near the accused's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-ms-dhoni-thrills-jaipur-crowd-with-183-against-sri-lanka-2625963-2024-10-31",
      "headline": "On This Day: MS Dhoni thrills Jaipur crowd with 183 against Sri LankaOn October 31, 2005, MS Dhoni played a legendary innings of 183 not out against Sri Lanka in Jaipur. This performance set a new record for the highest ODI score by a wicketkeeper-batter and remains unmatched. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-2024-donald-trump-rides-garbage-truck-says-in-honour-of-kamala-biden-2625932-2024-10-31",
      "headline": "Donald Trump rides garbage truck, says 'in honour of Kamala, Biden'Trump took questions from reporters sitting inside the cabin of the garbage truck and once again distanced himself from comedian Tony Hinchcliffe's remark, whose rib-tickler on Puerto Rico didn't go as planned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/diwali-2024-i-wish-everyone-a-healthy-happy-and-prosperous-life-says-prime-minister-narendra-modi-2625912-2024-10-31",
      "headline": "Army jawans light diyas, celebrate festival with locals across countryDiwali 2024 Live: Prime Minister Narendra Modi On Thursday extended his greetings on the occasion of Diwali. \"On this divine festival of lights, I wish everyone a healthy, happy and prosperous life,\" he said in his message. Ayodhya dazzled on Diwali-eve as two Guinness records were set: most people (1,121) performing aarti and the most number of diyas (25 lakh) lit up to celebrate the festival. \"After 500 years, this holy moment has come after countless sacrifices and continuous sacrifice and penance of Ram devotees,\" PM said as Ayodhya hosted its first Diwali since the consecration of the Ram Temple. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-index-plunges-very-poor-diwali-thick-smog-covers-city-2625926-2024-10-31",
      "headline": "Delhi's air quality 'very poor' on Diwali, thick layer of smog blankets cityAs per data from the Central Pollution Control Board (CPCB), the average Air Quality Index (AQI) at 39 stations in the city stood at 329 (very poor) at 7 am. Anand Vihar recorded the worst AQI at 419 under the \"severe\" category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-releases-new-poster-of-hit-the-third-case-on-diwali-2024-sailesh-kolanu-2626100-2024-10-31",
      "headline": "Actor Nani unveils new poster of HIT 3 on Diwali: Ignite justiceActor Nani has unveiled a new poster for his much-awaited film, HIT: The Third Case, marking Diwali with this exciting reveal. The poster hints at the intense action and drama awaiting fans in this latest addition to the HIT franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-to-kamal-haasan-celebs-extend-diwali-greetings-2626076-2024-10-31",
      "headline": "Amitabh Bachchan to Kamal Haasan, celebs extend Diwali greetingsActors Amitabh Bachchan, Kamal Haasan, and others have sent their heartfelt wishes to fans on the occasion of Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-turner-divorce-joe-jonas-dating-peregrine-pearson-2626079-2024-10-31",
      "headline": "Sophie Turner opens up about 'incredibly sad' divorce with Joe JonasSophie Turner discussed the emotional impact of her divorce from singer Joe Jonas in a recent interview. The actor spoke about her new relationship with British aristocrat Peregrine Pearson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/ali-fazal-richa-chadha-dia-mirza-at-javed-akhtar-shabana-azmi-diwali-party-2626067-2024-10-31",
      "headline": "Javed Akhtar, Shabana Azmi host Diwali party. Ali-Richa, Dia Mirza, others attendVeterans Javed Akhtar and Shabana Azmi hosted a Diwali party on the night of October 30. It was attended by several celebrities, including Ali Fazal, Richa Chadha, Dia Mirza, among others."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-comes-out-in-prithvi-shaws-support-amid-fitness-concerns-2626081-2024-10-31",
      "headline": "Sunil Gavaskar comes out in Prithvi Shaw's support amid fitness concernsSunil Gavaskar came out in Prithvi Shaw's support amid concerns over his fitness.Mumbai Cricket Association did not name Prithvi Shaw in their Ranji Trophy squad for the third-round match against Tripura. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-tom-blundell-mumbai-rohit-sharma-gautam-gambhir-virat-kohli-2626068-2024-10-31",
      "headline": "India were saying 5-0 on TV: Tom Blundell fires back after New Zealand seal seriesNew Zealand wicketkeeper batter Tom Blundell has recalled India's series build-up for the ongoing Test series saying that their performances left them shell-shocked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-third-test-gautam-gambhir-press-conference-border-gavaskar-trophy-mumbai-2626070-2024-10-31",
      "headline": "India needs Mumbai Test win before Border-Gavaskar Trophy: Gautam GambhirIndia coach Gautam Gambhir has said that his side will be aiming to win the Mumbai Test to gain some momentum heading into the Border-Gavaskar Trophy. The series against Australia will begin on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-announce-16-member-squad-for-home-t20i-series-vs-india-2626063-2024-10-31",
      "headline": "South Africa announce 16-member squad for home T20I series vs IndiaSouth Africa announce a strong 16-member squad for the 4-match T20I series, starting November 8, Friday. Aiden Markram will lead the team and ace pacer Kagiso Rabada has been rested for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-shell-shocked-after-what-happened-in-pune-bengaluru-tests-tom-blundell-2626034-2024-10-31",
      "headline": "India shell-shocked after what happened in Pune, Bengaluru Tests: Tom BlundellNew Zealand wicketkeeper-batter Tom Blundell reckons the Indian cricket team must be feeling \"shell-shocked\" after surprising defeats in the first two Test matches held in Bengaluru and Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-manchester-city-are-in-trouble-claims-pep-guardiola-with-growing-injury-list-2626033-2024-10-31",
      "headline": "Manchester City are in trouble claims Pep Guardiola with growing injury listPep Guardiola has claimed that Manchester City are in trouble at the moment as their injury list continues to grow following their League Cup exit at the hands of Tottenham Hotspur. City lost Savinho and Manuel Akanji after the loss on October 30, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-predicted-xi-3rd-test-mumbai-jasprit-bumrah-matt-henry-rohit-sharma-2626029-2024-10-31",
      "headline": "India vs New Zealand, 3rd Test Predicted XI: Bumrah to get much-needed rest?India and New Zealand are all set to lock horns in the third Test of the series on Friday, November 1. Both teams might make one change in their playing XI keeping in mind the conditions and pitch at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-test-live-streaming-when-and-where-to-watch-live-2626014-2024-10-31",
      "headline": "India vs New Zealand, 3rd Test: When and where to watch series finale in MumbaiIndia faces a do-or-die match against New Zealand in the third Test at Wankhede. Trailing 0-2, a win is crucial for their World Test Championship journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-nothing-to-do-india-coach-gautam-gambhir-player-retentions-2626013-2024-10-31",
      "headline": "IPL has nothing to do with me: Gautam Gambhir on player retentionsIndia coach Gautam Gambhir has downplayed concerns that the upcoming IPL retention list, to be released just before the third Test against New Zealand, could distract him or his team. Gambhir emphasized his focus remained solely on the Test match. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-kl-rahul-delhi-capitals-lucknow-super-giants-ipl-2025-2626009-2024-10-31",
      "headline": "Rishabh Pant and Rahul will bag Rs 25 crore - 30 crore in auction: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra feels that wicketkeeper batters Rishabh Pant and KL Rahul will bag huge sums of money in the auction if they don't get retained by their respective franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-preview-series-whitewash-wtc-points-2626003-2024-10-31",
      "headline": "WTC points at stake as India look to avoid whitewash against New ZealandIndia vs New Zealand, Mumbai Test preview: Pride, reputation and WTC points will be at stake when India, having lost the series, take on New Zealand in the third and final Test at Mumbai's Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-predicted-xi-3rd-test-mumbai-jasprit-bumrah-matt-henry-rohit-sharma-2626029-2024-10-31",
      "headline": "India vs New Zealand, 3rd Test Predicted XI: Bumrah to get much-needed rest?India and New Zealand are all set to lock horns in the third Test of the series on Friday, November 1. Both teams might make one change in their playing XI keeping in mind the conditions and pitch at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-test-live-streaming-when-and-where-to-watch-live-2626014-2024-10-31",
      "headline": "India vs New Zealand, 3rd Test: When and where to watch series finale in MumbaiIndia faces a do-or-die match against New Zealand in the third Test at Wankhede. Trailing 0-2, a win is crucial for their World Test Championship journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-nothing-to-do-india-coach-gautam-gambhir-player-retentions-2626013-2024-10-31",
      "headline": "IPL has nothing to do with me: Gautam Gambhir on player retentionsIndia coach Gautam Gambhir has downplayed concerns that the upcoming IPL retention list, to be released just before the third Test against New Zealand, could distract him or his team. Gambhir emphasized his focus remained solely on the Test match. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-kl-rahul-delhi-capitals-lucknow-super-giants-ipl-2025-2626009-2024-10-31",
      "headline": "Rishabh Pant and Rahul will bag Rs 25 crore - 30 crore in auction: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra feels that wicketkeeper batters Rishabh Pant and KL Rahul will bag huge sums of money in the auction if they don't get retained by their respective franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-preview-series-whitewash-wtc-points-2626003-2024-10-31",
      "headline": "WTC points at stake as India look to avoid whitewash against New ZealandIndia vs New Zealand, Mumbai Test preview: Pride, reputation and WTC points will be at stake when India, having lost the series, take on New Zealand in the third and final Test at Mumbai's Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-ind-vs-nz-3rd-test-virat-kohli-rohit-sharma-wankhede-stadium-mumbai-2626002-2024-10-31",
      "headline": "Gautam Gambhir blames rise of T20 cricket for poor defence of Indian battersIndia head coach Gautam Gambhir has blamed the rise of T20 cricket for the poor defensive technique of Indian batters against spin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-gautam-gambhir-press-conference-start-as-coach-mumbai-2626000-2024-10-31",
      "headline": "Never expected easy run as coach: Gambhir on rocky start to India tenureGautam Gambhir has claimed that he wasn't expecting an easy run as the India coach after a rocky start to his tenure. Gambhir has suffered series losses to Sri Lanka away from home and New Zealand in India after taking over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-series-defeat-gautam-gambhir-press-conference-2625984-2024-10-31",
      "headline": "New Zealand series loss hurting but can't just blame batters: Coach GambhirIndia head coach Gautam Gambhir admitted that the Test series loss to New Zealand was hurting while calling for accountability across the board for the Pune and Bengaluru losses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-mumbai-weather-forecast-wankhede-stadium-2625982-2024-10-31",
      "headline": "IND vs NZ 3rd Test, Mumbai weather forecast: Rain to affect play on Day 1?India and New Zealand are set to clash in the final Test at Mumbai's Wankhede Stadium. With rain predicted on Day 1, the match holds significant stakes for the World Test Championship race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-ms-dhoni-thrills-jaipur-crowd-with-183-against-sri-lanka-2625963-2024-10-31",
      "headline": "On This Day: MS Dhoni thrills Jaipur crowd with 183 against Sri LankaOn October 31, 2005, MS Dhoni played a legendary innings of 183 not out against Sri Lanka in Jaipur. This performance set a new record for the highest ODI score by a wicketkeeper-batter and remains unmatched. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrids-clash-at-valencia-to-be-postponed-due-to-floods-in-region-reports-2625961-2024-10-31",
      "headline": "Real Madrid's clash at Valencia to be postponed due to floods in region: ReportsLaLiga and the Spanish FA have called for the postponement of all football matches in Valencia this weekend due to severe flash floods that have claimed at least 95 lives. This means that the Real Madrid vs Valencia game at the weekend is set to be postponed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-kane-williamson-injury-recovery-england-series-gary-stead-2625949-2024-10-31",
      "headline": "Kane Williamson will return for England series: New Zealand coach Gary SteadNew Zealand head coach Gary Stead is optimistic about Kane Williamson's recovery in time for the England Test series. Despite missing the India series, Williamson's return is anticipated for series at home against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/1st-unofficial-test-australia-a-brendan-doggett-6-wickets-india-a-out-107-2625938-2024-10-31",
      "headline": "Australia A's Doggett picks 6 wickets to bowl India A out for 1071st Unofficial Test: India A collapsed to a mere 107 runs, largely due to a ferocious six-wicket haul from Australia A's Brendan Doggett on the first day of the first unofficial Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/on-this-day-ms-dhoni-thrills-jaipur-crowd-with-183-against-sri-lanka-2625963-2024-10-31",
      "headline": "On This Day: MS Dhoni thrills Jaipur crowd with 183 against Sri LankaOn October 31, 2005, MS Dhoni played a legendary innings of 183 not out against Sri Lanka in Jaipur. This performance set a new record for the highest ODI score by a wicketkeeper-batter and remains unmatched. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrids-clash-at-valencia-to-be-postponed-due-to-floods-in-region-reports-2625961-2024-10-31",
      "headline": "Real Madrid's clash at Valencia to be postponed due to floods in region: ReportsLaLiga and the Spanish FA have called for the postponement of all football matches in Valencia this weekend due to severe flash floods that have claimed at least 95 lives. This means that the Real Madrid vs Valencia game at the weekend is set to be postponed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-kane-williamson-injury-recovery-england-series-gary-stead-2625949-2024-10-31",
      "headline": "Kane Williamson will return for England series: New Zealand coach Gary SteadNew Zealand head coach Gary Stead is optimistic about Kane Williamson's recovery in time for the England Test series. Despite missing the India series, Williamson's return is anticipated for series at home against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/1st-unofficial-test-australia-a-brendan-doggett-6-wickets-india-a-out-107-2625938-2024-10-31",
      "headline": "Australia A's Doggett picks 6 wickets to bowl India A out for 1071st Unofficial Test: India A collapsed to a mere 107 runs, largely due to a ferocious six-wicket haul from Australia A's Brendan Doggett on the first day of the first unofficial Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-ruud-van-nistelrooy-wants-manchester-united-stay-amidst-ruben-amorim-links-2625940-2024-10-31",
      "headline": "Ruud van Nistelrooy wants Manchester United stay amidst Ruben Amorim linksManchester United's interim manager Ruud van Nistelrooy has expressed his desire to stay with the club in a managerial capacity after a stunning 5-2 win against Leicester City. As the search for Erik ten Hag's permanent replacement continues, Van Nistelrooy hopes to remain with his former side in some capacity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-live-updates-mi-csk-rcb-kkr-dc-pbks-srh-rr-gt-lsg-pant-retained-released-list-2625927-2024-10-31",
      "headline": "LIVE Updates: Focus on Pant, Rahul, and Iyer as teams set to announce listIPL Retention 2025 LIVE Updates: All 10 IPL franchises are set to announce their final retentions by 5 PM IST today. Teams can keep up to six players within a Rs 120 crore budget, with a cap of five capped and two uncapped Indian players, ahead of the 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-nets-session-batting-fortunes-virat-rohit-2625923-2024-10-31",
      "headline": "India batters adopt desperate measure in nets to turn fortunes aroundTrailing 0-2 at home, Team India had adopted desperate measures to counter New Zealand's precise bowling, especially the spinners, with talk of a rank-turner pitch dominating pre-match discussions for the third Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}