{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-qatar-economic-forum-committed-to-being-ceo-of-tesla-in-5-years-2727862-2025-05-20",
      "headline": "Elon Musk vows to retain Tesla CEO post for next 5 years: No doubt about thatMusk made a video appearance at the Qatar Economic Forum hosted by Bloomberg after he recently travelled to Doha as part of Donald Trump's Mideast trip last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-sahaj-vs-itr-4-sugam-which-itr-form-should-you-use-tax-filing-2025-2727615-2025-05-20",
      "headline": "ITR-1 Sahaj vs ITR-4 Sugam: Which ITR form should you use?ITR-1 is for straightforward income from salary or pension, while ITR-4 is suitable if you're into small business or freelance work and are using the presumptive taxation scheme. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-closes-873-points-lower-nifty-falls-below-25000-eternal-down-4-2727592-2025-05-20",
      "headline": "Sensex closes 873 points lower, Nifty falls below 25,000; Eternal down 4%The S&P BSE Sensex lost 872.98 points to end at 81,186.44, while the NSE Nifty50 was down by 261.55 points to close at 24,683.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-itr-u-check-who-can-file-penalties-and-last-date-2727537-2025-05-20",
      "headline": "What is ITR-U? Check who can file, penalties, and last dateIf you missed filing your return on time or made a mistake in your previous ITR, the ITR-U gives you another chance to set things right—this time with more time on your hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-gcc-coverage-south-city-bangalore-hyderabad-bengaluru-chennai-hyderabad-2727538-2025-05-20",
      "headline": "South India emerges as top choice for GCC offices in early 2025With Bengaluru, Chennai, and Hyderabad collectively securing a dominant 64% share of all GCC office leasing in Q1 2025, the southern region has firmly established itself as the preferred destination for global corporations setting up specialised capability centres in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-boom-in-india-guess-what-is-fuelling-the-rs-65-lakh-crore-surge-2727514-2025-05-20",
      "headline": "Mutual fund boom in India: Guess what's fuelling the Rs 65 lakh crore surgeMumbai alone leads the chart, contributing 27% (Rs 17.75 lakh crore), followed by Delhi at 12.63%, Bengaluru at 5.39%, Pune at 4%, and Kolkata at 3.49%. These numbers haven't changed much since last year, according to data from the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-positive-opening-reasons-behind-sensex-nifty-fall-explained-2727500-2025-05-20",
      "headline": "Explained: Why Sensex tanked nearly 900 points todayAt today's closing, the Sensex had plunged 872.98 points to settle at 81,186.44, while the Nifty 50 fell 261.55 points to end at 24,683.90. All major sectoral indices closed in the red, with Auto, Media, Financial Services, and Healthcare stocks among the worst hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-nifty-rally-pause-what-should-investors-do-book-profit-paras-cochin-shipyard-ideaforge-2727480-2025-05-20",
      "headline": "Is the defence stock party over? Here's what investors need to knowShares of Paras Defence and Cochin Shipyard dropped more than 6% each during the day. The broader Nifty India Defence index was also down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-uan-step-by-step-guide-to-get-it-back-in-minutes-2727476-2025-05-20",
      "headline": "Lost your UAN? Here's a step-by-step guide to get it back in minutesYour UAN is more than just a number. Without your UAN, you can't check your PF balance, update your account, or even withdraw money when you need it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-cochin-shipyard-why-these-defence-stocks-tumbled-over-6-today-2727451-2025-05-20",
      "headline": "Paras Defence, Cochin Shipyard: Why these defence stocks tumbled over 6% todayLeading the slide were Paras Defence, Cochin Shipyard. Both fell over 6% in intraday trade. The broader Nifty India Defence index dropped 1.4% to around 11:50 am, marking its second straight day of decline after a blistering multi-week rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-checklist-who-must-file-deadlines-documents-and-the-truth-about-zero-tax-2727441-2025-05-20",
      "headline": "ITR checklist: Who must file, deadlines, documents and the truth about 'zero tax'In the 2025–26 Union Budget, the government gave a big relief, i.e., no tax on income up to Rs 12 lakh under the new tax regime. But here's the catch: You must file your ITR to claim it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-protean-egov-shares-are-in-free-fall-2727426-2025-05-20",
      "headline": "Explained: Why Protean eGov shares are in free fallAfter crashing 20% on Monday, the stock fell another 13% in early trade, briefly hovering near the Rs 995 mark—perilously close to its 52-week low of Rs 930."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/it-welocome-to-derry-trailer-shows-the-fear-of-pennywise-strikes-back-2727800-2025-05-20",
      "headline": "IT Welocome to Derry trailer: Fear of Pennywise strikes backThe horror of Pennywise, the dancing clown, once again strikes back with the disappearance of kids in the trailer of the upcoming miniseries IT - Welcome to Derry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-recalled-facing-casting-couch-as-a-teenager-2727762-2025-05-20",
      "headline": "Saiyami Kher recalls facing casting couch at 19: Was asked to make compromisesActor Saiyami Kher recalled when a female casting director asked her to compromise for a role. She faced the casting couch incident when she was 19-year-old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/director-priyadarshan-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727744-2025-05-20",
      "headline": "Priyadarshan reacts to Paresh Rawal's exit from Hera Pheri 3: I am hurtDirector Priyadarshan has expressed deep disappointment over Paresh Rawal's sudden exit from 'Hera Pheri 3', calling it hurtful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-called-hrithik-roshan-jr-ntrs-war-2-epic-2727718-2025-05-20",
      "headline": "Karan Johar calls Hrithik, Jr NTR's War 2 epic: How hot Kiara is lookingFilmmaker Karan Johar called Hrithik Roshan, Jr NTR's War 2 'blockbuster of the year.' He also praised Kiara Advani's look from the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-addresses-marital-trouble-rumours-with-husband-parmeet-sethi-2727697-2025-05-20",
      "headline": "Archana Puran Singh reacts to marital trouble rumours with Parmeet SethiArchana Puran Singh has put an end to rumours about marital issues with husband Parmeet Sethi, clarifying in a recent vlog that their playful banter is often mistaken for tension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-professionally-handles-wardrobe-malfunction-during-show-in-vegas-2727573-2025-05-20",
      "headline": "How Katy Perry managed to avoid a wardrobe malfunction during Las Vegas showKaty Perry gracefully managed a mid-show wardrobe slip during her Las Vegas concert, continuing her performance without missing a beat. The singer is currently on tour for her seventh studio album, 143."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-arrives-at-cannes-with-daughter-aaradhya-bachchan-2727680-2025-05-20",
      "headline": "Aishwarya Rai arrives in Cannes with daughter Aaradhya. WatchAishwarya Rai Bachchan has arrived at the Cannes Film Festival 2025 alongside her daughter Aaradhya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-vishal-jethwa-travels-to-cannes-with-his-mother-shares-adorable-pics-2727539-2025-05-20",
      "headline": "Actor Vishal Jethwa travels to Cannes with his mother, shares adorable picsActor Vishal Jethwa fulfilled his childhood dream by taking his mother to Cannes, where his film 'Homebound' will premiere on May 21. He shared photos with a heartfelt note, expressing gratitude to his fans for their support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mukesh-khanna-is-thrilled-to-return-as-shaktimaan-2727641-2025-05-20",
      "headline": "Mukesh Khanna returns as Shaktimaan: Thrilled to connect with today's youthMukesh Khanna is returning as India's first superhero Shaktimaan. The actor expressed excitement about connecting with a whole new generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raashii-khanna-hints-intense-new-role-with-bruised-behind-the-scene-pics-2727650-2025-05-20",
      "headline": "Raashii Khanna teases intense new role with bruised BTS picsRaashii Khanna shared bruised behind-the-scenes photos from her upcoming project, hinting at an intense and physically demanding role. While she didn't reveal the title, fans suspect she is shooting for 'Farzi 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-ray-film-institute-student-kokob-gebrehaweria-at-cannes-la-cinef-want-to-be-voice-for-africans-2727597-2025-05-20",
      "headline": "Satyajit Ray film institute student at Cannes La Cinef: Want to be voice for AfricansEthiopian filmmaker Kokob Gebrehaweria's no-budget film featuring a Nigerian footballer has been selected for Cannes La Cinef 2025. The film sheds light on the exploitation faced by African footballers in India and aims to give them a strong voice through cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-portrait-made-of-jackfruits-ahead-of-birthday-2727628-2025-05-20",
      "headline": "Mohanlal gets sweet tribute as Kerala artist creates his jackfruit portrait. WatchAhead of Mohanlal's birthday, a Kerala-based artist created a portrait of the actor using jackfruits. It took five hours and 20 jackfruits to create the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/even-akshay-is-clueless-suniel-shetty-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727570-2025-05-20",
      "headline": "It's a crisis: Suniel Shetty on Paresh Rawal's shock exit from Hera Pheri 3Actor Suniel Shetty, in an exclusive interview with IndiaToday.in, said that the sudden announcement of Paresh Rawal's exit from 'Hera Pheri 3' was shocking, calling it a \"big crisis\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kiara-advani-on-her-first-bikini-shot-from-yrf-war-2-first-action-film-2727558-2025-05-20",
      "headline": "Kiara Advani lists her firsts from War 2: First action film, first bikini shotActor Kiara Advani listed her 'lots of firsts' from Hrithik Roshan and Jr NTR-starrer 'War 2.' This is the first time she has collaborated with filmmaker Ayan Mukerji for an action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-aarti-divorce-blames-keneeshaa-for-marriage-failure-2727575-2025-05-20",
      "headline": "Ravi Mohan's wife Aarti blames 'third person' for failure of marriage in new noteAarti Ravi, estranged wife of actor Ravi Mohan, blamed a third person in a new statement. She clarified the accusations levelled against her by Ravi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vj-aishwarya-hits-back-at-reporter-who-questioned-attire-film-event-slams-media-silence-2727515-2025-05-20",
      "headline": "Tamil actor blasts reporter for 'sleeveless' comment, questions media silenceA woman anchor called out a reporter who questioned her attire at a film event and criticised the media's silence. She said such incidents affected her mentally and questioned the ethics of the film press."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-groups-twice-enhypen-announce-new-music-bts-to-reunite-next-month-2727492-2025-05-20",
      "headline": "K-pop groups TWICE, ENHYPEN, and BTS set for comebacks in 2025The second quarter of 2025 is shaping up to be a rollercoaster for K-pop fans—with groups like TWICE, ENHYPEN making a comeback and BTS all set to reunite after completing their mandatory military service. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-to-lead-as-major-general-punia-in-upcoming-war-drama-2727489-2025-05-20",
      "headline": "Operation Khukri: Randeep Hooda to lead as Major General Punia in war dramaRandeep Hooda will star as Major General Raj Pal Punia in 'Operation Khukri', a war drama based on the Indian Army's daring 2000 rescue mission in Sierra Leone. The film highlights the bravery of 233 Indian soldiers trapped for 75 days in enemy territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-sanu-daughter-shannon-interview-coachella-cannes-2727493-2025-05-20",
      "headline": "Singer Shannon says 'didn't take' father Kumar Sanu's help: Had my own journeyShannon K has successfully established herself as an independent artist, performing at Coachella and contributing to the Cannes film 'Tanvi The Great'. She credits hard work to nepotism and aims to inspire young Indian musicians worldwide."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-missile-drone-attack-golden-temple-army-guns-head-granthi-operation-sindoor-2727358-2025-05-20",
      "headline": "Army denies deploying air defence guns at Golden Temple during Op SindoorThe Indian Army denied deploying air defence systems inside the Golden Temple in Punjab's Amritsar after reports claimed rare coordination with shrine authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-mallikarjun-kharge-operation-sindoor-small-war-bjp-hits-back-2727640-2025-05-20",
      "headline": "We're doing small war against Pak: Mallikarjun Kharge's veiled jab at Op SindoorSpeaking at a rally in Karnataka, Mallikarjun Kharge claimed that PM Modi cancelled his scheduled visit to Jammu and Kashmir after receiving intelligence about potential unrest three days before the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-haryana-youtuber-jyoti-malhotras-diary-recover-copys-what-she-wrote-2727648-2025-05-20",
      "headline": "Cops recover 'spy' YouTuber Jyoti Malhotra's diary: What she wrote after Pak tripThe police have recovered a personal diary belonging to YouTuber Jyoti Malhotra, who was recently arrested on charges of spying for Pakistan. The diary contains notes and travel records of Jyoti. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-asim-munir-promotion-field-marsahal-lost-war-failed-bunyan-um-marsoos-operation-sindoor-narrative-2727757-2025-05-20",
      "headline": "Munir's magic: Lose a war, get a promotionThe promotion of Pakistani army chief Asim Munir to Field Marshal has been packaged as a reward for his so-called military success against India. However, it is more a desperate attempt to mask the failure of his Operation Bunyan al-Marsoos. Munir's elevation cements his control, not credibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/luke-coutinho-on-the-rise-of-heart-attacks-in-the-fit-and-young-2727572-2025-05-20",
      "headline": "Luke Coutinho on the rise of heart attacks in the 'fit and young'In an exclusive interview, Luke Coutinho broke down how being 'fit' and working out isn't enough to keep your heart healthy; it's, at the end of the day, the overall lifestyle that counts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-rajasthan-beat-chennai-vaibhav-suryavanshi-akash-madhwal-2727845-2025-05-20",
      "headline": "Suryavanshi, Samson end Royals' campaign on triumphant note as CSK hit new lowRajasthan Royals (RR) beat Chennai Super Kings (CSK) by 6 wickets in Match 62 of the Indian Premier League 2025 (IPL 2025) at Arun Jaitley Stadium, Delhi. Vaibhav Suryavanshi once again starred with a magnificent innings of 57 (33). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-indians-who-got-nishan-e-pakistan-and-why-bjp-congress-morarji-desai-rahul-gandhi-2727691-2025-05-20",
      "headline": "Who are the Indians who got Nishan-e-Pakistan and whyA war of words between the BJP and the Congress over Operation Sindoor saw the mention of Nishan-e-Pakistan, the Islamic republic's highest civilian award. Who are the Indians on whom Nishan-e-Pakistan has been conferred upon and why?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-imd-rainfall-yellow-alert-orange-thunderstorm-weather-forecast-maharashtra-2727830-2025-05-20",
      "headline": "Sudden rainfall lashes Mumbai, adjoining areas; alert issued across MaharashtraAccording to the meteorological department, rainfall activity across Maharashtra is expected to intensify between May 21 and May 24 due to the impact of a cyclonic circulation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/a-little-bit-of-zardozi-a-little-bit-of-pm-modi-at-the-cannes-red-carpet-and-how-2727741-2025-05-20",
      "headline": "A little bit of zardozi, a little bit of PM Modi at the Cannes red carpet and howAt a festival known for fashion risks, red carpet politics, and the occasional peacock moment, this Indian actress may have delivered one of the most eyebrow-raising entries of Cannes 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-maximum-temperature-bakes-at-40-degrees-and-feels-like-50-degrees-2727775-2025-05-20",
      "headline": "Delhi bakes at 40 degrees and it feels like 50 degreesThe Safdarjung station recorded the maximum temperature to be 40 degrees at 5.30 pm, but it felt much hotter due to 43 per cent humidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indias-shubhanshu-shukla-to-team-up-with-nasa-for-five-space-experiments-2727781-2025-05-20",
      "headline": "Indian astronaut to conduct 5 experiments with Nasa, speak to studentsThe announcement comes as the Axiom crew completes its ISS training and prepares for launch, with a flight readiness review scheduled for Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ms-dhoni-touches-feet-ipl-2025-2727855-2025-05-20",
      "headline": "Vaibhav Suryavanshi bows down to Dhoni, signs off IPL with blessingsVaibhav Suryavanshi played a mature innings to help Rajasthan Royals chase down 188 against Chennai Super Kings. His gesture of seeking MS Dhoni's blessings highlighted respect and his upbringing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/asim-munir-becomes-field-marshal-decoding-the-pakistan-armys-top-rank-2727715-2025-05-20",
      "headline": "Asim Munir to become Field Marshal: Decoding the Pakistan Army's top rankThis elevation marks only the second time in Pakistan's history that the five-star rank has been awarded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/is-donald-trump-familys-pakistan-crypto-deal-behind-his-india-pak-mediation-itch-2727652-2025-05-20",
      "headline": "Is Trump family's Pakistan crypto deal behind his Indo-Pak mediation itch?Donald Trump's family-backed World Liberty Financial signed a deal with Pakistan Crypto Council days after the Pahalgam attack. Was Trump's urge to mediate in the India-Pakistan war triggered by the deal? The WLF and its stablecoin have been questioned in the US over conflicts of interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/even-akshay-is-clueless-suniel-shetty-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727570-2025-05-20",
      "headline": "It's a crisis: Suniel Shetty on Paresh Rawal's shock exit from Hera Pheri 3Actor Suniel Shetty, in an exclusive interview with IndiaToday.in, said that the sudden announcement of Paresh Rawal's exit from 'Hera Pheri 3' was shocking, calling it a \"big crisis\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/op-sindoor-how-igla-s-missile-system-neutralised-armed-pakistani-drones-2727658-2025-05-20",
      "headline": "Op Sindoor: How IGLA-S missile system neutralised armed Pakistani dronesIn this exclusive report, India Today's Sunil Ji Bhat showcases the IGLA-S missile system, a crucial component of the Indian Army's air defence that neutralised armed Pakistani drones during Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-awami-league-ban-muhammad-yunus-islamists-cant-kill-sheikh-hasina-al-sheikh-mujibur-rahman-2727402-2025-05-20",
      "headline": "Why Yunus govt, Bangladesh Islamists can't kill Awami LeagueThe Awami League, banned by Muhammad Yunus' interim government, isn't a political party but a cult. Outlawed thrice in the past, the party sprang back to life each time, and commands a 40% vote share. It is the inheritor of Mujibur Rahman's legacy, whose life is integral to Bangladesh's freedom struggle, and Bengali nationalism. This is why Islamists or Yunus won't be able to sink the AL boat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bjp-slams-karnataka-cong-govt-for-bangalore-waterlogging-timing-of-two-year-anniversary-samavesha-2727620-2025-05-20",
      "headline": "Bengaluru flooded but Congress celebrates: BJP slams anniversary event timingBJP criticised the Karnataka government over its priorities, as while Bengaluru battled flooding and reported rain-related deaths, the Congress marked its government's two-year anniversary with a grand event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venue-change-ahmedabad-eden-gardens-playoffs-mullanpur-2727653-2025-05-20",
      "headline": "IPL 2025 final taken out of Kolkata, to be played in AhmedabadThe Indian Premeir League final 2025 final will be played in Ahmedabad, the Indian Cricket Board announced on Tuesday, May 20. Two of the playoffs matches have been shifted to Mullanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-kanteerava-stadium-sampangi-lake-revival-rain-flood-water-traffic-bangalore-waterlogging-2727674-2025-05-20",
      "headline": "Beneath Bengaluru's iconic Kanteerava stadium, a lake stirs in fresh rain?Heavy rains left Bengaluru waterlogged, with a viral video showing flood water entering the popular Kanteerava Stadium. The stadium, which is home for Bengaluru FC, sits atop the old Sampangi Lake bed, reminding the city of its forgotten water heritage and urban planning gaps."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-couple-neha-sharma-amandeep-sharma-swindle-nz2-million-flying-india-business-class-new-zealand-2727494-2025-05-20",
      "headline": "After Rs 10-crore scam, New Zealand couple flew business class to IndiaAn Indian-origin couple living in Christchurch, New Zealand, are alleged to have been involved in a scam that defrauded the country's child welfare agency of NZ$2 million (Rs 10 crore). After the scam was discovered, they flew business class to India in 2023, but the law caught up with them. While Neha Sharma was jailed earlier in May, her husband, Amandeep, has pleaded guilty recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/naani-ke-ghar-rasna-and-dark-room-the-indian-summer-vacation-in-the-90s-gave-us-2727541-2025-05-20",
      "headline": "The lost summers of 'naani ka ghar': What 90s kids had that Gen Z doesn'tBack when summer meant a train to Naani's house, not a flight to a resort. When cousins were your first best friends, not just names on a family WhatsApp group. Let's rewind to the Great Indian summer vacation of the 90s-the kind that today's kids may never truly know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashoka-university-professor-ali-khan-mahmudabad-sent-to-14-day-judicial-custody-over-op-sindoor-post-2727617-2025-05-20",
      "headline": "Ashoka University professor sent to jail for 14 days in Op Sindoor post caseAli Khan Mahmudabad was arrested on Sunday after his social media post was perceived as critical of the armed forces and disrespectful to women officers."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-delighted-with-acing-the-chase-after-making-brave-call-at-the-toss-2727870-2025-05-21",
      "headline": "Sanju Samson delighted with acing the chase after making brave call at the tossRajasthan Royals (RR) captain Sanju Samson was elated after his team's successful run chase against Chennai Super Kings (CSK) in Match 62 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ms-dhoni-touches-feet-ipl-2025-2727855-2025-05-20",
      "headline": "Vaibhav Suryavanshi bows down to Dhoni, signs off IPL with blessingsVaibhav Suryavanshi played a mature innings to help Rajasthan Royals chase down 188 against Chennai Super Kings. His gesture of seeking MS Dhoni's blessings highlighted respect and his upbringing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-rajasthan-beat-chennai-vaibhav-suryavanshi-akash-madhwal-2727845-2025-05-20",
      "headline": "Suryavanshi, Samson end Royals' campaign on triumphant note as CSK hit new lowRajasthan Royals (RR) beat Chennai Super Kings (CSK) by 6 wickets in Match 62 of the Indian Premier League 2025 (IPL 2025) at Arun Jaitley Stadium, Delhi. Vaibhav Suryavanshi once again starred with a magnificent innings of 57 (33). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-dale-steyn-slams-csk-for-bizarre-batting-tactics-2727807-2025-05-20",
      "headline": "Dale Steyn slams CSK for bizarre batting tactics: 3 down and they send 2 bowlersLegendary South Africa fast bowler Dale Steyn slammed Chennai Super Kings (CSK) for promoting Ravichandran Ashwin and Ravindra Jadeja in the batting order after their collapse in the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-dc-munaf-patel-full-pre-match-press-conference-2727791-2025-05-20",
      "headline": "DC bowling coach Munaf Patel admits being under pressure ahead of must-win fixture vs MIDelhi Capitals (DC) bowling coach Munaf Patel admitted that the team is under pressure ahead of the must-win fixture against Mumbai Indians (MI) in the Indian Premier League 2025 (IPL2 205). Delhi desperately need to win the upcoming fixture to stay alive in the play-offs race. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/munaf-patel-delhi-capitals-ipl-points-table-2727785-2025-05-20",
      "headline": "Win or lose, it's always a party at DC: Bowling coach Munaf PatelDelhi Capitals bowling coach Munaf Patel has said that win or lose, there is always a party in the team's dressing room. His comments come ahead of a crucial clash against Mumbai Indians, which might decide the playoffs spots this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-team-england-kl-rahul-2727761-2025-05-20",
      "headline": "Bumrah should lead India in England, KL Rahul can replace Kohli: MSK PrasadFormer selector MSK Prasad has recommended Jasprit Bumrah as the Indian Test captain. The suggestion includes Shubman Gill as vice-captain and KL Rahul for a key batting role, hinting at team stability and strategic changes for the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-name-playing-xi-for-one-off-test-vs-zimbabwe-sam-cook-set-to-make-debut-2727723-2025-05-20",
      "headline": "England name playing XI for one-off Test vs Zimbabwe, Sam Cook set to make debutEngland cricket team has named their playing XI for their upcoming one-off Test against Zimbabwe, set to be played from Thursday, May 22 at Trent Bridge, Nottingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-drop-farooqi-for-last-fixture-vs-chennai-super-kings-2727740-2025-05-20",
      "headline": "IPL 2025: Rajasthan Royals drop Farooqi for last fixture vs Chennai Super KingsRajasthan Royals (RR) dropped Afghanistan's left-arm seamer Fazalhaq Farooqi for their last fixture against Chennai Super Kings (CSK). They brought in Yudvir Singh to replace him in the playing XI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-ms-dhoni-chennai-rebuild-toss-delhi-2727734-2025-05-20",
      "headline": "CSK vs RR: MS Dhoni says the Chennai rebuild process is already underwayMS Dhoni said that the Chennai Super Kings have already started their rebuilding process for next season. CSK are already out of the tournament and will use the remaining games to get their combination right moving ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-test-team-england-kl-rahul-2727761-2025-05-20",
      "headline": "Bumrah should lead India in England, KL Rahul can replace Kohli: MSK PrasadFormer selector MSK Prasad has recommended Jasprit Bumrah as the Indian Test captain. The suggestion includes Shubman Gill as vice-captain and KL Rahul for a key batting role, hinting at team stability and strategic changes for the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-name-playing-xi-for-one-off-test-vs-zimbabwe-sam-cook-set-to-make-debut-2727723-2025-05-20",
      "headline": "England name playing XI for one-off Test vs Zimbabwe, Sam Cook set to make debutEngland cricket team has named their playing XI for their upcoming one-off Test against Zimbabwe, set to be played from Thursday, May 22 at Trent Bridge, Nottingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajasthan-royals-drop-farooqi-for-last-fixture-vs-chennai-super-kings-2727740-2025-05-20",
      "headline": "IPL 2025: Rajasthan Royals drop Farooqi for last fixture vs Chennai Super KingsRajasthan Royals (RR) dropped Afghanistan's left-arm seamer Fazalhaq Farooqi for their last fixture against Chennai Super Kings (CSK). They brought in Yudvir Singh to replace him in the playing XI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-ms-dhoni-chennai-rebuild-toss-delhi-2727734-2025-05-20",
      "headline": "CSK vs RR: MS Dhoni says the Chennai rebuild process is already underwayMS Dhoni said that the Chennai Super Kings have already started their rebuilding process for next season. CSK are already out of the tournament and will use the remaining games to get their combination right moving ahead. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}