{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-is-back-as-pop-mart-shares-rise-by-11-percent-ceo-predicts-record-sales-2774005-2025-08-20",
      "headline": "Labubu mania is back as Pop Mart shares rise by 11%, CEO predicts record salesPop Mart reported a 204% rise in revenue to 13.88 billion yuan for the first half of 2025, beating the average analyst estimate of 13.76 billion yuan. Net income jumped 397% to 4.57 billion yuan, highlighting the company's rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/online-betting-gaming-real-money-shares-down-nazara-technologies-delta-corp-2773965-2025-08-20",
      "headline": "Online gaming bill: Nazara Technologies and Delta Corp shares take a hitThe bill, which proposes strict rules for money-based online games and makes online betting a punishable offence, is expected to be tabled in the Lok Sabha later today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/shifted-to-new-tax-regime-here-are-5-investments-you-shouldnt-drop-nps-elss-2773943-2025-08-20",
      "headline": "Shifted to new tax regime? Here are 5 investments you shouldn't dropAlthough the new regime comes with lower tax rates and no exemptions, several traditional investment products continue to play a vital role in securing your finances and growing long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-targets-private-refiners-ril-nayara-ioc-india-import-russia-oil-tariff-2773938-2025-08-20",
      "headline": "Pumping profits or picking a fight? US goes after Indian refinersThe criticism from US is focused on India's private refiners, particularly Reliance Industries and Nayara Energy, which together account for a large share of refined fuel exports to Europe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-jump-13-as-winning-streak-continues-what-next-2773919-2025-08-20",
      "headline": "Ola Electric shares jump 13%, up over 20% in two sessions. Should you buy?On Tuesday, the stock climbed almost sharply after founder and chairman Bhavish Aggarwal outlined an aggressive strategy to reclaim market share and improve profitability in India's competitive EV segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-down-it-stocks-gain-banking-financials-decline-bajaj-finance-airtel-2773891-2025-08-20",
      "headline": "Sensex, Nifty open lower as financial stocks offset IT gains in early tradeThe S&P BSE Sensex was down by 125.67 points to 81,518.72, while the NSE Nifty50 lost 34.50 points to 24,946.15 as of 9:33 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/game-over-for-online-gaming-firms-industry-in-shock-over-proposed-blanket-ban-2773881-2025-08-20",
      "headline": "Game over for money-based online gaming? Industry in shock over proposed banIf passed in Parliament, the bill will outlaw all money-based online games (irrespective of whether they involve skill or chance), ban advertisements promoting such platforms, and bar banks and financial institutions from processing related transactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/will-cause-serious-harm-all-india-gaming-federation-writes-to-amit-shah-on-online-gaming-ban-2773868-2025-08-20",
      "headline": "Death knell for industry: Gaming body writes to Amit Shah on money-based gaming banIn its communication, the All India Gaming Federation stressed the need for \"progressive regulation\" rather than outright prohibition, highlighting the potential fallout for millions of players and the broader industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-370-points-nifty-above-24950-adani-ports-tata-motors-among-top-gainers-2773517-2025-08-19",
      "headline": "Sensex, Nifty close higher on GST buzz, easing global tensionsThe S&P BSE Sensex gained 370.64 points, while the NSE Nifty50 rose 103.70 points to settle at 24,980.65. Broader markets also ended in the green, with mid- and small-cap stocks outperforming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pm-viksit-bharat-rozgar-yojana-who-can-get-rs-15000-and-other-benefits-2773508-2025-08-19",
      "headline": "PM Viksit Bharat Rozgar Yojana: Who can get Rs 15,000 and other benefitsFirst-time employees under Part A can receive a one-time incentive equal to about one month's basic pay, up to Rs 15,000, paid in two instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidhu-vinod-chopra-recalls-vidya-balan-giving-him-gaalis-during-parineeta-auditions-2773947-2025-08-20",
      "headline": "Vidhu Vinod Chopra recalls Vidya Balan giving him gaalis during Parineeta auditionsFilmmaker Vidhu Vinod Chopra shares how actor Vidya Balan secured her role in 'Parineeta'. He recalled that Balan was so tired by the final round of auditions that she must have given him gaalis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-sharma-confirms-apne-2-script-is-ready-quashes-shelf-reports-sunny-deol-bobby-deol-dharmendra-2774013-2025-08-20",
      "headline": "Director Anil Sharma confirms Apne 2 script is ready, quashes shelf reports'Apne 2' director Anil Sharma confirmed that the scripting of the film is complete. This comes amid several reports about the project being shelved due to multiple delays, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sooraj-barjatya-backs-rupali-ganguly-call-on-national-awards-for-television-actors-2773967-2025-08-20",
      "headline": "Sooraj Barjatya backs Rupali Ganguly's call for National Awards for TV actorsTelevision actor Rupali Ganguly urged the government to recognise TV artistes at the National Awards, saying they work tirelessly without due acknowledgement. Filmmaker Sooraj Barjatya supported her demand, calling television an art form that deserves equal respect as cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rapper-vedan-arrest-hold-kerala-high-court-sexual-assault-allegations-2773994-2025-08-20",
      "headline": "Rapper Vedan's arrest stalled by Kerala High Court amid sexual assault allegationsThe Kerala High Court has put on hold the arrest of rapper Vedan pending police information on further cases. The court stressed that decisions must rely on evidence, not social media allegations, as it prepares to hear his anticipatory bail plea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hbo-harry-potter-series-announces-weasley-children-with-new-cast-members-2773890-2025-08-20",
      "headline": "New Weasley siblings join Harry Potter series, Ginny played by Gracie CochraneThe makers of the new 'Harry Potter' series have announced the cast of the Weasley children. While Ginny is played by Gracie Cochrane, here are the other cast members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-on-being-called-plastic-surgery-ki-dukaan-coolie-2773925-2025-08-20",
      "headline": "Shruti Haasan on being called plastic surgery ki dukaan: This is my choiceShruti Haasan openly addressed the criticism she faces for her cosmetic procedures, highlighting the double standards women encounter regarding beauty and authenticity in the industry. Meanwhile, she celebrates the massive success of her latest film Coolie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-nairobi-ssmb29-shoot-mahesh-babu-safari-2773926-2025-08-20",
      "headline": "Priyanka Chopra in Nairobi for SSMB 29 shoot, enjoys safari outingActor Priyanka Chopra has joined Mahesh Babu in Nairobi for 'SSMB 29'. The film marks Chopra's return to Indian cinema, with a March 2027 release likely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-makers-move-madras-high-court-against-a-certificate-for-rajinikanth-film-2773895-2025-08-20",
      "headline": "Coolie makers approach Madras High Court against A tag for Rajinikanth's filmThe legal tussle over Rajinikanth's film 'Coolie' has reached the Madras High Court as Sun Pictures challenges the CBFC's 'A' certificate, arguing for a U/A rating akin to other big releases. The film is currently running in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-nickname-us-fan-meet-and-greet-viral-video-2773911-2025-08-20",
      "headline": "Vijay Deverakonda adorably calls Rashmika by nickname at US fan meet. Viral videoIn a viral video from a US fan meet-and-greet, Vijay Deverakonda can be seen calling Rashmika Mandanna by her nickname. The two are rumoured to be dating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-on-ott-pawan-kalyan-period-drama-to-stream-on-prime-video-2773876-2025-08-20",
      "headline": "Hari Hara Veera Mallu on OTT: Pawan Kalyan period drama to stream on Prime VideoPawan Kalyan's 'Hari Hara Veera Mallu' makes a swift transition to OTT after a lukewarm theatrical release. It will soon premiere on Prime Video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-fauji-look-leaks-online-makers-issue-cyber-crime-warning-2773871-2025-08-20",
      "headline": "Prabhas's pic from director Hanu's film leaked, makers remove posts, warn actionPrabhas' photo from the upcoming film 'Fauji' leaked, leading to legal warnings from the producers. The film, tentatively titled 'Fauji', is being directed by Hanu Raghavapudi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/boney-kapoor-no-entry-2-regret-not-taking-salman-khan-anil-kapoor-fardeen-khan-2773874-2025-08-20",
      "headline": "Boney Kapoor on No Entry 2: Regret not retaining Salman Khan, Anil, and FardeenFilmmaker Boney Kapoor shared that he waited for Salman Khan, Anil Kapoor, and Fardeen Khan for nearly 8 to 10 years to move ahead with the sequel to 'No Entry'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ar-murugadoss-shah-rukh-khan-was-the-first-to-hear-sivakarthikeyan-madharasi-2773867-2025-08-20",
      "headline": "AR Murugadoss says SRK liked Madharasi pitch before SivakarthikeyanAcclaimed director AR Murugadoss revealed that his upcoming Tamil film 'Madharasi' starring Sivakarthikeyan was once pitched to Shah Rukh Khan for a Bollywood version but never took off. Sivakarthikeyan's version of the film will hit theatres on September 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-criticises-ai-film-chiranjeevi-hanuman-vijay-subramaniam-2773857-2025-08-20",
      "headline": "Anurag Kashyap blasts AI-film Chiranjeevi Hanuman producer: Future for spinelessAnurag Kashyap criticised the backing of an AI-generated film 'Chiranjeevi Hanuman' by Vijay Subramaniam, prompting discussions on AI's role in filmmaking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-baldoni-subpoena-dispute-isabela-ferrer-blake-lively-legal-case-it-ends-with-us-2773842-2025-08-20",
      "headline": "Inappropriate attack: Justin Baldoni slams Isabela Ferrer's harassment claimsThe subpoena dispute between Justin Baldoni and Isabela Ferrer escalated with allegations of misconduct and legal manoeuvring, as Ferrer's counsel challenged Baldoni's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-release-date-out-new-teaser-flawed-president-2773734-2025-08-19",
      "headline": "The Diplomat Season 3 release date out: New teaser introduces a flawed PresidentThe new teaser of 'The Diplomat Season 3' has been released along with the date announcement. Global diplomacy and foreign negotiations get tougher this time, led by a flawed President in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-boman-irani-mourn-achyut-potdar-death-3-idiots-actor-2773706-2025-08-19",
      "headline": "Achyut Potdar dies: Aamir Khan, Boman Irani pay last respects to 3 Idiots co-starActors Aamir Khan and Boman Irani mourned the death of veteran actor Achyut Potdar. They paid their last respects to their '3 Idiots' co-star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-yuzvendra-chahal-court-divorce-proceedings-tshirt-controversy-2773694-2025-08-19",
      "headline": "I started howling in court: Dhanashree Verma on divorce with Yuzvendra ChahalChoreographer Dhanashree Verma shared that she had an emotional breakdown during her divorce proceedings with cricketer Yuzvendra Chahal. She also reacted to her ex-husband's controversial T-shirt that said 'Be Your Sugar Daddy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-comeback-mahesh-narayanan-film-september-release-2773578-2025-08-19",
      "headline": "Actor Mammootty to resume shoot after taking a break due to health complicationsMalayalam actor Mammootty, who had recently faced some health complications, has recovered completely and will be joining the sets of his upcoming film with Mahesh Narayanan. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/ahmedabad-student-stabbed-to-death-gujarat-police-school-vandalised-protests-2774012-2025-08-20",
      "headline": "Class 10 student stabbed to death by junior in Ahmedabad, school vandalisedA 15-year-old student was fatally stabbed by a junior at an Ahmedabad school, triggering protests, vandalism, and police action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-rekha-gupta-slapped-by-man-during-jan-sunvai-event-alleges-bjp-2773882-2025-08-20",
      "headline": "Delhi Chief Minister hit by Gujarat man at public event, attacker arrestedPreliminary interrogation has revealed that the accused, identified as Rajesh Bhai Khimji Bhai Sakariya, is a 41-year-old resident of Rajkot. Police said he remains in custody and will face detailed questioning to determine his motives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bills-to-remove-prime-minister-chief-minister-ministers-arrest-parliament-explained-2773918-2025-08-20",
      "headline": "PM, chief ministers can go if arrested for 30 days. Why the uproar over new bills?With the bills, the government looks to end a rather tepid Parliament session with a bang, even as the opposition has gone on a warpath, terming them 'draconian'. What are the bills, and why have they hit a nerve with the opposition?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/game-over-for-online-gaming-firms-industry-in-shock-over-proposed-blanket-ban-2773881-2025-08-20",
      "headline": "Game over for money-based online gaming? Industry in shock over proposed banIf passed in Parliament, the bill will outlaw all money-based online games (irrespective of whether they involve skill or chance), ban advertisements promoting such platforms, and bar banks and financial institutions from processing related transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-stray-romance-love-lies-rabies-solutions-dogs-cows-2773984-2025-08-20",
      "headline": "India's Stray Romance: Love, lies, rabies, solutionsIndia's romance with strays is a tragic farce - sacred cows choking, dogs biting - when proven fixes like sterilisation, shelters, and accountability could turn chaos into compassion. But our rage is just bark without bite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-targets-private-refiners-ril-nayara-ioc-india-import-russia-oil-tariff-2773938-2025-08-20",
      "headline": "Pumping profits or picking a fight? US goes after Indian refinersThe criticism from US is focused on India's private refiners, particularly Reliance Industries and Nayara Energy, which together account for a large share of refined fuel exports to Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thaw-india-china-ties-part-of-process-not-sudden-fling-xi-jinping-narendra-modi-wang-yi-dokhlam-galwan-jaishankar-2773501-2025-08-20",
      "headline": "Thaw in India-China ties is part of a process, not a sudden swingChinese Foreign Minister Wang Yi was in India for talks to shore up ties after a difficult phase in relations marked by border clashes. Wang met PM Narendra Modi ahead of his China visit after seven years. Though the meetings come amid Trump's tariff turbulence, they are part of a process, not a sudden swing. This is how the two sides worked to mend ties, with pragmatism as the pivot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/will-break-table-tear-bill-chaos-likely-in-parliament-over-motion-to-remove-arrested-pm-chief-ministers-2773915-2025-08-20",
      "headline": "'Will break table, tear bill': Row over motion to remove arrested PM, chief ministersUnder the proposed anti-corruption draft laws, a Prime Minister, Chief Minister or Minister facing charges with a minimum five-year jail term will be stripped of office if kept in custody for 30 consecutive days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/why-indians-are-taking-their-long-weekends-abroad-2773627-2025-08-20",
      "headline": "Why Indians are taking their long weekends abroadThis Independence Day long weekend, Indians skipped the usual road trips to the hills and staycations nearby. Instead, the new-age traveller packed their bags for international getaways."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-weather-forecast-live-update-news-heavy-rainfall-monsoon-airlines-travel-advisory-2773851-2025-08-20",
      "headline": "Live: Red alert on, city records 875 mm rainfall in 4 daysMumbai Rain Live Updates: A Red warning has been issued for Mumbai, with the Indian Meteorological Department forecasting moderate to intense spells of rain today. The rains have already left 1 dead and 3 injured in the city. Tune in to intoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/narendra-modi-set-for-sco-summit-how-fragile-border-peace-tests-india-china-thaw-2773605-2025-08-19",
      "headline": "Modi set for SCO Summit, how fragile border peace tests India-China thaw\"Differences must not become disputes nor competition conflicts,\" external affairs minister S. Jaishankar has emphasised to his visiting Chinese counterpart Wang Yi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/why-should-one-pay-rs-150-top-court-says-no-tolls-on-highways-riddled-with-potholes-2773888-2025-08-20",
      "headline": "Why pay Rs 150 for bad roads? Top court says no tolls on Kerala highway with potholesThe Supreme Court has stopped toll collection on a pothole-ridden highway in Kerala. The court said citizens cannot be charged extra for poorly maintained roads. Appeals by the National Highways Authority of India and others were dismissed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/james-webb-telescope-discovers-unknown-moon-orbiting-uranus-2773936-2025-08-20",
      "headline": "James Webb Telescope discovers unknown moon orbiting UranusEstimated to be about 10 kilometres wide, the moon has remained invisible for decades after the Voyager-2 spacecraft conducted the lunar survey around Uranus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-rejects-rahul-gandhi-voter-deletion-claim-bihar-2773917-2025-08-20",
      "headline": "Poll body fact-checks Rahul Gandhi after viral 'Subodh Kumar vote chori' videoThe Election Commission rebutted Rahul Gandhi's allegations of large-scale voter deletion in Bihar. The poll body stated that Subodh Kumar, who featured in a now viral video shared by Gandhi, did not submit required forms or follow due procedure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/kerala-class-4-text-draft-says-netaji-fled-to-germany-in-fear-correction-ordered-2773978-2025-08-20",
      "headline": "Kerala Class 4 text draft says Netaji fled to Germany in fear, correction orderedA draft Kerala textbook claimed Netaji Subhas Chandra Bose \"fled to Germany in fear of the British\". Minister V Sivankutty ordered corrections, called it a \"historical mistake\", and confirmed revised text is online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/justice-sudershan-reddy-opposition-vice-president-election-interview-constitution-2773957-2025-08-20",
      "headline": "MPs elect Veep, not parties: Justice Reddy appeals to NDA to back him in pollsIn an exclusive interview, Justice Sudershan Reddy, the opposition's vice-presidential candidate, spoke on his contest with NDA's CP Radhakrishnan and his agenda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vice-captain-india-asia-cup-t20i-squad-return-2773904-2025-08-20",
      "headline": "Why Shubman Gill for Asia Cup T20? With Virat Kohli gone, his idea enduresSanju Samson and Abhishek Sharma symbolise India's new brand of T20 audacity, yet selectors have turned to Shubman Gill for balance. His return, signals not just a tactical switch but also the renewal of an insurance policy that Virat Kohli once provided to the T20I side."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-update-lok-sabha-opposition-bihar-sir-protest-bills-vice-president-2773889-2025-08-20",
      "headline": "Live: Online cash game ban bill tabled in Lok Sabha, Houses adjourned till 2 pmParliament Session Live: Union Home Minister Amit Shah will introduce three important bills in the Lok Sabha today, including a provision that could unseat a Union Minister, Chief Minister, or even the Prime Minister if they remain under arrest or detention for 30 consecutive days in cases carrying a minimum sentence of five years. Electronics and IT Minister Ashwini Vaishnaw tabled the Promotion and Regulation of Online Gaming Bill. The Opposition, meanwhile, is expected to intensify protests demanding a debate on the Special Intensive Revision exercise in Bihar and other pending issues. With the exception of brief discussions on Operation Sindoor in both Houses, parliamentary business has largely stalled since the Monsoon session opened on July 21, repeatedly disrupted by adjournments amid opposition protests. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-rekha-gupta-attacker-mentally-ill-loves-animals-upset-stray-dog-supreme-court-order-mother-2773970-2025-08-20",
      "headline": "Delhi Chief Minister's attacker mentally ill, upset over stray dog ruling: MotherA Gujarat man who attacked Delhi Chief Minister Rekha Gupta was upset over the Supreme Court's stray dog ruling, his mother has claimed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/1-out-of-4-millennials-say-they-feel-underpaid-worrying-employers-study-2773999-2025-08-20",
      "headline": "1 out of 4 millennials say they feel underpaid, worrying employers: StudyGreat Place To Work India has revealed that pay fairness to millennials is now a top retention risk. The 2025 study has shown gaps in financial wellbeing, psychological safety and innovation opportunities. Employers that act on pay, safety and communication stand to keep the millennial majority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-man-aura-farming-dance-video-flooded-street-viral-mumbra-divider-heavy-rain-waterlogging-2773993-2025-08-20",
      "headline": "Mumbai man's 'Aura Farming' dance on flooded street is now a viral videoIn the video, the Mumbai man is seen balancing on a divider submerged in rainwater. Moments later, he breaks into the signature Aura Farming dance steps before leaping onto the waterlogged street and landing on a makeshift mat he carried with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/55-year-old-chennai-man-mauled-to-death-by-neighbours-pitbull-while-returning-home-from-work-2773979-2025-08-20",
      "headline": "Chennai man, 55, mauled to death in unprovoked attack by neighbour's Pitbull dogA 55-year-old man returning home from work in Chennai's Jafferkhanpet was mauled to death by his neighbour's Pitbull dog, with police now investigating and planning to file charges against the owner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-imposed-sanctions-india-pressure-russia-end-ukraine-war-white-house-glbs-2773836-2025-08-20",
      "headline": "Trump imposed sanctions on India to pressure Russia over Ukraine war: White HouseWhite House Press Secretary Karoline Leavitt said Trump increased India's tariffs to 50% as part of sanctions designed to pressure Russia to end the Ukraine war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-makers-move-madras-high-court-against-a-certificate-for-rajinikanth-film-2773895-2025-08-20",
      "headline": "Coolie makers approach Madras High Court against A tag for Rajinikanth's filmThe legal tussle over Rajinikanth's film 'Coolie' has reached the Madras High Court as Sun Pictures challenges the CBFC's 'A' certificate, arguing for a U/A rating akin to other big releases. The film is currently running in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidhu-vinod-chopra-recalls-vidya-balan-giving-him-gaalis-during-parineeta-auditions-2773947-2025-08-20",
      "headline": "Vidhu Vinod Chopra recalls Vidya Balan giving him gaalis during Parineeta auditionsFilmmaker Vidhu Vinod Chopra shares how actor Vidya Balan secured her role in 'Parineeta'. He recalled that Balan was so tired by the final round of auditions that she must have given him gaalis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anil-sharma-confirms-apne-2-script-is-ready-quashes-shelf-reports-sunny-deol-bobby-deol-dharmendra-2774013-2025-08-20",
      "headline": "Director Anil Sharma confirms Apne 2 script is ready, quashes shelf reports'Apne 2' director Anil Sharma confirmed that the scripting of the film is complete. This comes amid several reports about the project being shelved due to multiple delays, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rapper-vedan-arrest-hold-kerala-high-court-sexual-assault-allegations-2773994-2025-08-20",
      "headline": "Rapper Vedan's arrest stalled by Kerala High Court amid sexual assault allegationsThe Kerala High Court has put on hold the arrest of rapper Vedan pending police information on further cases. The court stressed that decisions must rely on evidence, not social media allegations, as it prepares to hear his anticipatory bail plea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-on-being-called-plastic-surgery-ki-dukaan-coolie-2773925-2025-08-20",
      "headline": "Shruti Haasan on being called plastic surgery ki dukaan: This is my choiceShruti Haasan openly addressed the criticism she faces for her cosmetic procedures, highlighting the double standards women encounter regarding beauty and authenticity in the industry. Meanwhile, she celebrates the massive success of her latest film Coolie. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-monday-night-raw-naomi-pregnancy-2773960-2025-08-20",
      "headline": "From Shock to Celebration: Fans React to Naomi's Emotional RAW MomentWWE's Naomi shocked fans on Monday Night RAW with a heartfelt pregnancy reveal. The WWE Universe, Reddit fans, and superstars like Becky Lynch, Bayley, Rhea Ripley, and Triple H reacted with joy, support, and emotion to this unforgettable real-life moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-iqoo-orangutan-leads-leaderboard-masters-challenger-series-2773940-2025-08-20",
      "headline": "WIP: BGMS S4 League Stage – Week 1, Day 2 ends with iQOO OG on topBGMS Season 4 features fierce competition, with iQOO Orangutan currently leading the Masters Series. The tournament's multi-series format keeps teams constantly striving for semifinal and playoff spots amid intense daily matchups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-mixed-doubles-emma-raducanu-carlos-alcaraz-2773944-2025-08-20",
      "headline": "Emma Raducanu and Carlos Alcaraz bow out early of the US Open 2025Emma Raducanu and Carlos Alcaraz were knocked out early from the 2025 US Open mixed doubles. Apart from the duo, there were multiple other high-profile players who bowed out early from the mixed doubles competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shreyas-iyer-asia-cup-2025-exclusion-questioned-abhishek-nayar-2773927-2025-08-20",
      "headline": "Shreyas Iyer is not liked as much as someone else: Ex-coach questions Asia Cup snubFormer India assistant coach Abhishek Nayar has questioned Shreyas Iyer's exclusion from the Asia Cup 2025 squad. Shubman Gill, meanwhile, has been named vice-captain of the 15-man India team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-penalty-real-madrid-vs-osasuna-laliga-2773916-2025-08-20",
      "headline": "Madrid off to underwhelming start as Mbappe penalty earns 1-0 win over OsasunaReal Madrid were off to a stuttering start against Osasuna in their LaLiga opener. The last year's runner-ups earned a 1-0 win owing to a penalty from Kylian Mbappe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vice-captain-india-asia-cup-t20i-squad-return-2773904-2025-08-20",
      "headline": "Why Shubman Gill for Asia Cup T20? With Virat Kohli gone, his idea enduresSanju Samson and Abhishek Sharma symbolise India's new brand of T20 audacity, yet selectors have turned to Shubman Gill for balance. His return, signals not just a tactical switch but also the renewal of an insurance policy that Virat Kohli once provided to the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-morgan-rogers-pfa-player-of-the-year-awards-full-list-2773906-2025-08-20",
      "headline": "Mohamed Salah scripts history with third PFA Player of the Year awardLiverpool forward Mohamed Salah was named the Professional Footballers' Association (PFA) Player of the Year on Tuesday, becoming the first player in history to win the award three times. Aston Villa and England midfielder Morgan Rogers was also recognised, receiving the PFA Young Player of the Year award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-emma-raducanu-viral-shot-us-open-mixed-doubles-2773869-2025-08-20",
      "headline": "Watch: Alcaraz shocks Raducanu, internet with daring around-the-net shotDespite their defeat, Carlos Alcaraz and Emma Raducanu created one of the most memorable moments of the US Open mixed doubles.. The moment sparked widespread fan admiration and highlighted their unique on-court chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-yashasvi-jaiswal-asia-cup-squad-selection-2773866-2025-08-20",
      "headline": "Asia Cup: Jaiswal's exclusion from Indian squad surprises Madan LalYoung India opener Yashasvi Jaiswal's exclusion from the Asia Cup squad has surprised former cricketer Madan Lal. Jaiswal was snubbed for Shubman Gill in India's 15-member squad, announced on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alexander-isak-vs-newcastle-united-premier-league-transfer-standoff-explained-2773856-2025-08-20",
      "headline": "Alexander Isak vs Newcastle United: Premier League transfer stand-off explainedAlexander Isak's standoff with Newcastle United escalated dramatically on Tuesday night, as the Sweden striker publicly accused the club of breaking promises and betraying his trust. Newcastle said in a statement that no commitment was made by a club official that Isak could leave this summer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-buchi-babu-fresh-intent-no-sympathy-maharashrtra-century-2773804-2025-08-20",
      "headline": "Don't want anyone's sympathy: Prithvi Shaw on fresh start in Buchi BabuPrithvi Shaw has dismissed any need for sympathy as he looks to restart his cricketing journey. Shaw has backed himself to return stronger with consistent domestic performances and a renewed sense of determination after his Buchi Babu century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-morgan-rogers-pfa-player-of-the-year-awards-full-list-2773906-2025-08-20",
      "headline": "Mohamed Salah scripts history with third PFA Player of the Year awardLiverpool forward Mohamed Salah was named the Professional Footballers' Association (PFA) Player of the Year on Tuesday, becoming the first player in history to win the award three times. Aston Villa and England midfielder Morgan Rogers was also recognised, receiving the PFA Young Player of the Year award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-emma-raducanu-viral-shot-us-open-mixed-doubles-2773869-2025-08-20",
      "headline": "Watch: Alcaraz shocks Raducanu, internet with daring around-the-net shotDespite their defeat, Carlos Alcaraz and Emma Raducanu created one of the most memorable moments of the US Open mixed doubles.. The moment sparked widespread fan admiration and highlighted their unique on-court chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-yashasvi-jaiswal-asia-cup-squad-selection-2773866-2025-08-20",
      "headline": "Asia Cup: Jaiswal's exclusion from Indian squad surprises Madan LalYoung India opener Yashasvi Jaiswal's exclusion from the Asia Cup squad has surprised former cricketer Madan Lal. Jaiswal was snubbed for Shubman Gill in India's 15-member squad, announced on Tuesday, August 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/alexander-isak-vs-newcastle-united-premier-league-transfer-standoff-explained-2773856-2025-08-20",
      "headline": "Alexander Isak vs Newcastle United: Premier League transfer stand-off explainedAlexander Isak's standoff with Newcastle United escalated dramatically on Tuesday night, as the Sweden striker publicly accused the club of breaking promises and betraying his trust. Newcastle said in a statement that no commitment was made by a club official that Isak could leave this summer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-buchi-babu-fresh-intent-no-sympathy-maharashrtra-century-2773804-2025-08-20",
      "headline": "Don't want anyone's sympathy: Prithvi Shaw on fresh start in Buchi BabuPrithvi Shaw has dismissed any need for sympathy as he looks to restart his cricketing journey. Shaw has backed himself to return stronger with consistent domestic performances and a renewed sense of determination after his Buchi Babu century."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}