{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pfizer-share-price-jump-12-percent-why-reason-q4-fy25-profit-rise-dividend-2727401-2025-05-20",
      "headline": "Pfizer share price rises 12% today. Here's whyPfizer stock: The stock jumped 11.91% during the day to touch a high of Rs 4,995.85 on the stock exchanges, after starting the day at Rs 4,698.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bangladesh-trade-route-curbs-economic-impact-explained-2727389-2025-05-20",
      "headline": "Explained: How Bangladesh is hurting itself by curbing Indian exportsIndia's new import rules sharply limit Bangladesh's access through Northeast land ports, forcing key goods onto restricted sea routes. The move comes after Bangladesh imposed similar restrictions on Indian goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-crypto-gold-and-stocks-why-indias-ultra-rich-are-buying-land-2727378-2025-05-20",
      "headline": "Forget crypto, gold and stocks: Why India's ultra-rich are buying landA luxury real estate advisor has said that India's top 0.001%, from unicorn founders to legacy dynasties, are quietly building Rs 75–500 crore portfolios, but not in stocks or crypto. Their focus is on land and branded real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-up-nifty-below-25000-tata-steel-gains-2-percent-2727369-2025-05-20",
      "headline": "Sensex opens 150 points up, Nifty below 25,000; Tata Steel gains 3%The S&P BSE Sensex gained 150.58 points to 82,210.00, while the NSE Nifty50 added 20.45 points to 24,965.90 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-open-for-bidding-subscribe-skip-review-gmp-good-bad-listing-gain-price-band-2727363-2025-05-20",
      "headline": "Borana Weaves IPO open for bidding: Should you subscribe? Check latest GMPThe company aims to raise Rs 144.89 crore through a fresh issue of 67 lakh shares. Borana Weaves IPO will remain open for three days and will close on Thursday, May 22, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-fall-rise-prediction-trade-setup-nse-bse-2727357-2025-05-20",
      "headline": "Stock market opening: Will Sensex, Nifty rise or fall today?Foreign Portfolio Investors (FPIs) sold shares worth Rs 525.95 crore, which added pressure on stock prices. This selling by investors was one of the reasons why the market fell slightly on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-20-bel-indusind-bank-rvnl-bel-dlf-trading-nse-bse-2727351-2025-05-20",
      "headline": "Stocks to watch on May 20: BEL, IndusInd Bank, RVNL, BEL, DLFMarkets ended lower in the last session. This decline came after global markets reacted to Moody's decision to lower the credit rating of the United States. However, mid-cap and small-cap stocks continued to do wel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-insider-trading-sebi-probe-six-officials-accounting-error-report-2727042-2025-05-19",
      "headline": "Six IndusInd Bank officials under Sebi scanner for insider trading: ReportThe Securities and Exchange Board of India (Sebi) is checking the timing of these trades to find out whether the share sales broke Sebi's rules or the bank's own internal code of conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-boyfriend-shikhar-pahariya-sister-khushi-kapoor-orry-become-cheerleaders-at-cannes-2727396-2025-05-20",
      "headline": "Janhvi Kapoor's boyfriend Shikhar, sister Khushi become her cheerleaders at CannesActor Janhvi Kapoor is set to walk the Cannes red carpet for her film 'Homebound' screening. Ahead of the grand appearance, the actor received a shout-out from her squad, who accompanied her to the French Riviera. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raid-2-worldwide-box-office-collection-day-19-detailed-report-ajay-devgn-film-hits-rs-200-crore-globally-2nd-in-club-after-chhaava-2727388-2025-05-20",
      "headline": "Raid 2 box office: Ajay's film hits Rs 200 crore worldwide, 2nd after ChhaavaAjay Devgn's 'Raid 2' has entered the Rs 200 crore club at the worldwide box office. The film has also breached the Rs 150 crore nett mark back home. It is only the second Bollywood film this year after 'Chhaava' to have achieved the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-rocks-beige-outfit-at-italy-event-with-blackpink-lisa-liu-yifei-bulgari-2727380-2025-05-20",
      "headline": "Priyanka Chopra rocks beige outfit at Italy event with Lisa and Liu YifeiPriyanka Chopra looked gorgeous in a beige outfit as she attended the Bulgari event with Blackpink's Lisa and Liu Yifei. Several photos from the event have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-the-final-reckoning-box-office-collection-day-3-detailed-report-tom-cruise-film-sees-big-drop-on-monday-2727367-2025-05-20",
      "headline": "Mission Impossible 8 box office Day 3: Tom Cruise's film sees big drop on MondayWhile 'Mission: Impossible - The Final Reckoning' opened on a strong note at the Indian box office on Saturday, the film saw a huge drop on its first Monday. It is still looking at gathering solid numbers towards the second weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-simi-garewal-attend-cannes-screening-satyajit-rays-aranyer-din-ratri-2727360-2025-05-20",
      "headline": "Sharmila Tagore, Simi Garewal attend Cannes screening of Ray's Aranyer Din RatriVeteran actors Sharmila Tagore and Simi Garewal attended the screening of Satyajit Ray's iconic film, 'Aranyer Din Ratri.' The pictures of the two walking the red carpet with the team have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-reviews-tourist-family-director-abishan-jeevinth-reaction-sasikumar-simran-2727355-2025-05-20",
      "headline": "Rajamouli recommends Tourist Family after a glowing review. Director reactsDirector SS Rajamouli showered appreciation on the Tamil film, 'Tourist Family', starring Sasikumar and Simran. Debutant director Abishan Jeevinth was over the moon after the 'RRR' director called his film the best cinematic experience of the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-sai-dhanshika-wedding-august-29-relationship-yogi-da-event-2727344-2025-05-20",
      "headline": "Tamil actors Vishal, Sai Dhanshika announce wedding in AugustTamil actors Vishal and Sai Dhanshika made their relationship official at 'Yogi Da' event in Chennai on Monday. The two will get married in August. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sesame-street-heads-to-netflix-while-staying-on-pbs-glbs-2727331-2025-05-20",
      "headline": "'Sesame Street' heads to Netflix while staying on PBSSesame Street will stream new and classic episodes on Netflix later this year, while continuing its run on PBS. Season 56 will feature shorter, story-driven episodes and fresh visual updates.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/billie-eilish-tour-2025-new-dates-austin-concerts-and-ticket-info-glbs-2727322-2025-05-20",
      "headline": "Billie Eilish Tour 2025: New dates, Austin concerts, and ticket infoBillie Eilish has added 23 new shows to her 2025 tour, including Austin, Texas. The expanded tour spans Japan and the US, and tickets will be available from May 22.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dilbert-creator-scott-adams-diagnosed-with-same-prostate-cancer-as-joe-biden-glbs-2727317-2025-05-20",
      "headline": "'Dilbert' creator Scott Adams diagnosed with same prostate cancer as Joe Biden\"Dilbert\" creator Scott Adams announced he has advanced prostate cancer, similar to Joe Biden's. He expects to live only a few more months and continues updating fans despite constant pain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dawn-richard-testifies-diddy-threatened-her-after-witnessing-cassie-attack-glbs-2727310-2025-05-20",
      "headline": "Dawn Richard testifies Diddy threatened her after witnessing Cassie attackDawn Richard testified that Diddy threatened her after she saw him abuse Cassie. Cassie's ex-roommate also detailed alleged assaults, NDAs, and financial control in the ongoing federal trial.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-to-team-up-with-director-vivek-athreya-for-his-next-2727190-2025-05-19",
      "headline": "Rajinikanth to team up with director Vivek Athreya for his next: ReportTelugu director Vivek Athreya, known for 'Brochevarevarura' and 'Saripodhaa Sanivaaram,' is reportedly in talks with Superstar Rajinikanth for his next film, likely to be produced by Mythri Movie Makers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-fame-shilpa-shirodkar-tests-covid-19-positive-urges-fans-to-wear-masks-2727191-2025-05-19",
      "headline": "Bigg Boss fame Shilpa Shirodkar tests Covid-19 positive, urges fans to 'wear masks'Former Bigg Boss 18 contestant Shilpa Shirodkar has tested Covid-19 positive. She has urged her fans to follow adequate precautions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-recalls-working-3-shifts-a-day-just-for-money-no-worse-torture-2727180-2025-05-19",
      "headline": "Naseeruddin Shah recalls working '3 shifts a day' just for money: No worse tortureNaseeruddin Shah spoke about the struggles of doing multiple film shifts just for money and called it a painful experience. His wife, Ratna Pathak Shah, shared how she always gives her best, even in small roles, and admired Naseeruddin's deep dedication to his art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-takes-train-ride-from-delhi-kolkata-in-rare-photos-shared-by-old-friend-2727093-2025-05-19",
      "headline": "SRK takes train ride from Delhi-Kolkata in rare photos shared by old friendActor Amar Talwar shared rare old photos of Shah Rukh Khan from their theatre days, showing the superstar during a train journey with friends before fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-director-priyanka-ghose-responds-to-criticism-on-ishaan-khatter-bhumi-pednekar-chemistry-zeenat-aman-cameo-2727151-2025-05-19",
      "headline": "Ishaan-Bhumi's chemistry to Zeenat's cameo, The Royals director reacts to criticism'The Royals' director Priyanka Ghose responds to mixed reactions to the show's lead chemistry and cameo roles. She remains focused on her work while fans await news of a second season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/twinkle-khannas-lesson-to-pakistan-let-dhinchak-pooja-re-dub-abida-parveen-songs-2727145-2025-05-19",
      "headline": "Twinkle Khanna's lesson to Pakistan: Let Dhinchak Pooja re-dub Abida Parveen songsTwinkle Khanna reacted to Pakistani actors getting removed from posters of Bollywood songs. The actor-author suggested that Abida Parveen's songs get re-dubbed by Dhinchak Pooja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-meets-tourist-family-director-abishan-jeevinth-says-he-knew-it-would-work-2726997-2025-05-19",
      "headline": "Dhanush meets Tourist Family director Abishan Jeevinth, says he knew it would workDebutant director Abishan Jeevinth has been receiving a lot of appreciation for his film 'Tourist Family', starring Sasikumar and Simran. The latest to join the list is 'Raayan' actor Dhanush. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-fewer-work-opportunities-in-films-people-thought-i-moved-to-los-angeles-2727131-2025-05-19",
      "headline": "Nimrat Kaur on fewer work opportunities in films: People thought I moved to USActor Nimrat Kaur reveals how industry assumptions about her moving abroad affected her career opportunities. She discusses her preference for quality roles and interest in exploring new genres like horror and action."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-in-range-attack-ceasefire-pak-army-rawalpindi-lt-gen-sumer-ivan-dcunha-deep-hole-to-hide-2727342-2025-05-20",
      "headline": "Top Army officer says India can strike all of Pak: They'll need deep hole to hideThe entire territory of Pakistan is within India's strike range, and if the Pakistani Army relocates its headquarters, it would need to find a very deep hole to hide, a top Indian Army officer underscored India's military prowess."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-rain-elderly-man-12-year-old-boy-electrocuted-flooded-apartment-2727350-2025-05-20",
      "headline": "Bengaluru rain: Elderly man, 12-year-old boy electrocuted in flooded apartmentFollowing heavy rains in Bengaluru, two people died in the BTM Layout area while trying to clear waterlogging in their apartment complex. A 35-year-old woman died in Whitefield after a compound wall collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-wants-saeed-lakhvi-extradition-like-us-did-tahawwur-rana-envoy-to-israel-glbs-2727325-2025-05-20",
      "headline": "Hand over Hafiz Saeed, things will be over: Indian diplomat's message to PakIndia's envoy to Israel says Operation Sindoor is paused, not over. He urges Pakistan to extradite 26/11 terrorists and warns that cross-border terror will be met with continued offensive action.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-amendment-act-hearing-waqf-by-user-interim-order-2727384-2025-05-20",
      "headline": "Interim order in Waqf law case? Key Supreme Court hearing todayWaqf law hearing: It was decided in the last hearing that only five leading petitions would be heard from among the raft of pleas filed against the law, which expands the government's role in regulating Waqf properties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-new-delhi-bypass-bangladesh-trade-commerce-kaladan-multi-modal-project-myanmar-siliguri-corridor-2727179-2025-05-20",
      "headline": "How India will bypass Bangladesh roads and roadblocksAfter Bangladeshi interim leader Muhammad Yunus referred to India's \"landlocked\" Northeast during a China visit, New Delhi responded by restricting Bangladeshi exports and fast-tracking alternative connectivity plans for the Northeast, bypassing Bangladesh. The key to that is the Kaladan Multi-Modal Transit Project, which will link Kolkata with Mizoram via Myanmar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-man-legal-notice-bbmp-seeks-rs-50-lakh-for-health-issues-caused-by-broken-roads-rain-2727359-2025-05-20",
      "headline": "Bengaluru man's Rs 50 lakh notice to civic body for 'trauma' due to poor roadsA 43-year-old Bengaluru man has served BBMP a legal notice seeking Rs 50 lakh compensation for physical and emotional trauma allegedly caused by poorly maintained roads. He linked his health issues to daily commutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-missile-drone-attack-golden-temple-army-guns-head-granthi-operation-sindoor-2727358-2025-05-20",
      "headline": "Golden Temple gave rare go-ahead to deploy guns to counter Pak drones: OfficerIn an unprecedented move, the chief religious official of the Golden Temple permitted the Indian Army to deploy air defence systems within the shrine's premises to counter Pakistani drone and missile attacks amid India's Operation Sindoor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/wooden-blocks-placed-tracks-derail-trains-up-hardoi-2727362-2025-05-20",
      "headline": "Wooden blocks placed on tracks in a bid to derail trains in UP's HardoiAnti-social elements placed wooden blocks entangled in an earthing wire on the railway track in Uttar Pradesh's Hardoi in an attempt to derail the Rajdhani Express and Kathgodam Express."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-crypto-gold-and-stocks-why-indias-ultra-rich-are-buying-land-2727378-2025-05-20",
      "headline": "Forget crypto, gold and stocks: Why India's ultra-rich are buying landA luxury real estate advisor has said that India's top 0.001%, from unicorn founders to legacy dynasties, are quietly building Rs 75–500 crore portfolios, but not in stocks or crypto. Their focus is on land and branded real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-daughter-rape-murder-by-mother-boyfriend-toddler-dies-in-malvani-area-2727094-2025-05-19",
      "headline": "Mumbai woman looked on as lover raped, killed her 2-year-old daughter: CopsThe minor girl was raped by Farhan Shaikh in front of her mother, Reena Shaikh, in Mumbai's Malvani area. Both the accused are currently in police custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/news-menu-india-pakistan-waqf-law-supreme-court-s-jaishankar-ashoka-university-putin-trump-russia-war-2727354-2025-05-20",
      "headline": "News Menu, May 20: Waqf Act in top court; Beating Retreat at Wagah resumes todayWaqf Act hearing in the Supreme Court today. Donald Trump says a Russia-Ukraine ceasefire is imminent. The political fight over Operation Sindoor continues. Beating Retreat at ceremony the Wagah border resumes today. Check out what else is on the rich menu of India Today's news today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-is-take-it-down-act-new-us-law-targets-deepfakes-revenge-porn-glbs-2727332-2025-05-20",
      "headline": "What is Take It Down Act? New US law targets revenge porn, deepfakesUS President Trump signed the Take It Down Act, criminalising non-consensual explicit content, including AI deepfakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-rahul-gandhi-is-stirring-the-poll-pot-in-bihar-2025-bihar-assembly-elections-2726958-2025-05-19",
      "headline": "How Rahul Gandhi is stirring the poll pot in BiharThe Congress is making a concerted push to reclaim lost ground in Bihar. Central to its strategy is Rahul's visible involvement in the assembly election campaign"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jyoti-malhotra-arrested-haryana-youtuber-vaisakhi-festival-pak-pilgrimage-espionage-2727189-2025-05-19",
      "headline": "From Vaisakhi in Pak to espionage: How Jyoti Malhotra became a security threatJyoti Malhotra, the Haryana-based YouTuber arrested on charges of espionage, first visited Pakistan in 2023 during the 324th Vaisakhi Festival. Her trip has come under the scanner by Indian intel agencies for allegedly aiding cross-border influence operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-parking-space-no-car-maharashtra-transport-minister-announces-new-rule-2727330-2025-05-20",
      "headline": "No parking space, no car: Maharashtra's new policy to tackle congestionMaharashtra transport minister Pratab Sarnaik announced that proof of parking space will now be mandatory for car registration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-sai-dhanshika-wedding-august-29-relationship-yogi-da-event-2727344-2025-05-20",
      "headline": "Tamil actors Vishal, Sai Dhanshika announce wedding in AugustTamil actors Vishal and Sai Dhanshika made their relationship official at 'Yogi Da' event in Chennai on Monday. The two will get married in August. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-to-immediately-start-talks-on-ceasefire-trump-after-two-hour-call-with-putin-2727338-2025-05-20",
      "headline": "Russia, Ukraine to immediately start ceasefire talks: Trump after call with PutinUS President Donald Trump said that Russia and Ukraine will immediately start talks on a ceasefire. He said that around 5,000 soldiers are killed every week in the Russia-Ukraine conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-celebi-aviation-security-clearance-revoked-turkey-india-pakistan-tensions-2727203-2025-05-19",
      "headline": "Better safe than sorry: High Court after Turkish firm Celebi's clearance revokedIndia revoked the security clearance of Turkish-based firm Celebi Aviation in the interest of \"national security\" after Ankara sided with Pakistan and condemned India's strikes on the neighbouring country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/justice-yashwant-varma-cash-row-vice-president-jagdeep-dhankhar-questions-delay-fir-2727138-2025-05-19",
      "headline": "Who are bigger sharks: Vice President on delay in FIR in Justice Varma cash rowVice President Jagdeep Dhankhar questioned the delay in the lodging of an FIR in the cash discovery case involving High Court judge Justice Yashwant Varma and said \"who are the bigger sharks\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-a-protein-shake-help-shed-weight-2726953-2025-05-19",
      "headline": "Can a protein shake help shed weight?Protein plays a big role in weight management by boosting metabolism, keeping us satiated for longer and preserving muscle mass"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-delhi-ms-dhoni-vaibhav-suryavanshi-2727313-2025-05-20",
      "headline": "MS Dhoni vs Vaibhav Suryavanshi: New Delhi set for IPL's oldest vs youngestIPL 2025: MS Dhoni is set to play what could be one of his final IPL matches in New Delhi as CSK face RR in a dead-rubber clash. The spotlight also shines on 14-year-old Vaibhav Suryavanshi, who will take on the CSK captain in a rare oldest-vs-youngest IPL showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-alleges-cover-up-in-bidens-cancer-diagnosis-says-public-was-misled-glbs-2727336-2025-05-20",
      "headline": "Trump alleges cover-up in Biden's cancer diagnosis, says public was misledTrump questioned the timing of Biden's cancer disclosure, suggesting a cover-up. Biden revealed an aggressive prostate cancer diagnosis with a Gleason score of 9. Health transparency reemerges as a political flashpoint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-professor-in-uk-loses-oci-status-anti-india-activities-nitasha-kaul-university-of-westminster-2726943-2025-05-19",
      "headline": "Indian-origin professor in UK loses OCI status over anti-India activitiesThe OCI status of UK-based Indian-origin academician Nitasha Kaul has been cancelled over \"anti-India activities\", driven by \"malice and complete disregard for facts or history\". The government notice was shared by Kaul, who was deported from Bengaluru airport last year within hours of her landing in India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-nicholas-pooran-fuming-angry-reaction-abdul-samad-run-out-2727395-2025-05-20",
      "headline": "LSG's Nicholas Pooran fumes in dressing room after costly run-out vs SRHLSG star batter Nicholas Pooran was seen furious after his run-out in the final over. His reaction reflected LSG's heartbreak as SRH chased down the 206-run target and ended LSG's IPL 2025 playoff hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mitchell-marsh-press-conference-lsg-exit-2727390-2025-05-20",
      "headline": "Losing close games made the difference: Marsh on LSG's IPL 2025 exitIPL 2025: Mitchell Marsh said that Lucknow Super Giants were not helped in their campaign after losing close matches. On Monday, LSG made an exit from the tournament after their six-wicket defeat to the Sunrisers Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saurabh-tiwary-shahbaz-nadeem-elected-as-jsca-secretary-and-joint-secretary-2727387-2025-05-20",
      "headline": "Saurabh Tiwary, Shahbaz Nadeem elected as JSCA secretary and joint secretaryFormer Indian cricketers Saurabh Tiwary and Shahbaz Nadeem have been appointed as secretary and joint secretary, respectively, of the Jharkhand State Cricket Association."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-mitchell-marsh-lsg-vs-srh-press-conference-2727372-2025-05-20",
      "headline": "Rishabh Pant will be back: Marsh backs LSG skipper for strong comebackIPL 2025: Mitchell Marsh has backed Rishabh Pant to bounce back in Lucknow Super Giants' last two matches after LSG crashed out of the tournament following their six-wicket defeat to SRH on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-abhishek-sharma-spin-early-challenge-daniel-vettori-2727368-2025-05-20",
      "headline": "SRH used to Abhishek Sharma taking on early challenge: Coach Daniel VettoriAbhishek Sharma's power-packed fifty ensured SRH finished strong against LSG, showing flashes of brilliance that coach Daniel Vettori believes are integral to the franchise's future, even in a season short on consistency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-dc-vs-gt-feature-2727356-2025-05-20",
      "headline": "With wheels falling off, Delhi Capitals back in familiar IPL blackhole againA 10-wicket loss to Gujarat Titans has pushed Delhi Capitals down to fifth place, outside the playoff spots, with 13 points from 12 matches. Delhi began the season strong but lost momentum midway due to poor tactics, underused players, and sloppy fielding. Now, they face a do-or-die battle to keep their playoff hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammad-kaif-lsg-vs-srh-verdict-2727346-2025-05-20",
      "headline": "Retain fully fit players next time: Kaif's scathing verdict on LSGFormer cricketer Mohammad Kaif has criticised LSG's team-building strategy, urging the franchise to prioritise fitness over star power after their IPL 2025 playoff exit. Injuries to key bowlers like Mayank Yadav and Mohsin Khan played a major role in the team's poor second-half showing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-delhi-ms-dhoni-vaibhav-suryavanshi-2727313-2025-05-20",
      "headline": "MS Dhoni vs Vaibhav Suryavanshi: New Delhi set for IPL's oldest vs youngestIPL 2025: MS Dhoni is set to play what could be one of his final IPL matches in New Delhi as CSK face RR in a dead-rubber clash. The spotlight also shines on 14-year-old Vaibhav Suryavanshi, who will take on the CSK captain in a rare oldest-vs-youngest IPL showdown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-aakash-chopra-2727341-2025-05-20",
      "headline": "Nightmares end: Pant should have faith despite poor IPL, says ChopraFormer cricketer Aakash Chopra has urged Rishabh Pant to have faith in what is turning out to be a difficult patch in his career. Pant is not only out of the ODI team, but has fallen into a terrible spiral in the IPL 2025 as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-vs-bangladesh-2nd-t20i-historic-win-sharjah-score-2727316-2025-05-20",
      "headline": "UAE chase record 206 in Sharjah, beat Bangladesh for first time in T20I cricketUAE vs Bangladesh, 2nd T20I: The UAE pulled off their highest-ever T20I chase to beat Bangladesh for the first time in T20I cricket. Captain Muhammad Waseem led from the front with a blistering 82 in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-blames-unsettled-bowling-unit-after-early-exit-from-ipl-2025-2727303-2025-05-20",
      "headline": "Rishabh Pant blames unsettled bowling unit after early exit from IPL 2025Lucknow Super Giants (LSG) captain Rishabh Pant has blamed the team's unsettled bowling unit following their early exit from the Indian Premier League 2025 (IPL 2025). LSG got out of the playoffs race after a six-wicket loss against Sunrisers Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammad-kaif-lsg-vs-srh-verdict-2727346-2025-05-20",
      "headline": "Retain fully fit players next time: Kaif's scathing verdict on LSGFormer cricketer Mohammad Kaif has criticised LSG's team-building strategy, urging the franchise to prioritise fitness over star power after their IPL 2025 playoff exit. Injuries to key bowlers like Mayank Yadav and Mohsin Khan played a major role in the team's poor second-half showing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-delhi-ms-dhoni-vaibhav-suryavanshi-2727313-2025-05-20",
      "headline": "MS Dhoni vs Vaibhav Suryavanshi: New Delhi set for IPL's oldest vs youngestIPL 2025: MS Dhoni is set to play what could be one of his final IPL matches in New Delhi as CSK face RR in a dead-rubber clash. The spotlight also shines on 14-year-old Vaibhav Suryavanshi, who will take on the CSK captain in a rare oldest-vs-youngest IPL showdown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-aakash-chopra-2727341-2025-05-20",
      "headline": "Nightmares end: Pant should have faith despite poor IPL, says ChopraFormer cricketer Aakash Chopra has urged Rishabh Pant to have faith in what is turning out to be a difficult patch in his career. Pant is not only out of the ODI team, but has fallen into a terrible spiral in the IPL 2025 as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-vs-bangladesh-2nd-t20i-historic-win-sharjah-score-2727316-2025-05-20",
      "headline": "UAE chase record 206 in Sharjah, beat Bangladesh for first time in T20I cricketUAE vs Bangladesh, 2nd T20I: The UAE pulled off their highest-ever T20I chase to beat Bangladesh for the first time in T20I cricket. Captain Muhammad Waseem led from the front with a blistering 82 in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-blames-unsettled-bowling-unit-after-early-exit-from-ipl-2025-2727303-2025-05-20",
      "headline": "Rishabh Pant blames unsettled bowling unit after early exit from IPL 2025Lucknow Super Giants (LSG) captain Rishabh Pant has blamed the team's unsettled bowling unit following their early exit from the Indian Premier League 2025 (IPL 2025). LSG got out of the playoffs race after a six-wicket loss against Sunrisers Hyderabad."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}