{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-tax-free-benefit-pass-to-people-private-public-sector-finance-minister-nirmala-sitharaman-2782521-2025-09-05",
      "headline": "Exclusive: Will common man get insurance rate cut benefits in GST 2.0? FM answersFinance Minister Nirmala Sitharaman made it clear that the tax relief was introduced for citizens and not for insurance companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/popcorn-puzzle-solved-nirmala-sitharaman-explains-gst-classification-2782506-2025-09-05",
      "headline": "Popcorn puzzle solved: Nirmala Sitharaman explains GST classificationIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman explained why salted and chocolate-coated variants had earlier attracted different GST rates."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-very-jonas-christmas-teaser-kevin-jonas-joe-jonas-nick-jonas-bring-holiday-mischief-to-screens-2782945-2025-09-06",
      "headline": "A Very Jonas Christmas teaser: The Jonas Brothers' festive fun is here to sleighThe Jonas Brothers have delighted fans with a sneak peek of their festive film 'A Very Jonas Christmas Movie', premiering on Disney+ this November. Featuring comedy, music, and family moments, the movie promises a joyous holiday experience with a star-studded cast and original songs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nostalgia-save-theatres-bollywood-hollywood-bet-cinema-icons-meena-kumari-biopic-rocky-2782582-2025-09-06",
      "headline": "Can nostalgia save theatres? Bollywood-Hollywood bet on cinema icons and memoriesPop culture icons are the new flavour of the season in Indian cinema and Hollywood. Where is cinema headings with the announcement of Sourav Ganguly and Meena Kumari biopics, 'Rambo' origins story, 'I Play Rocky' and 'The Smashing Machine'? On Cinematic Saturday, we reflect on the future of storytelling as filmmakers recreate nostalgia to evoke audience emotions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhamaal-4-shoot-wrap-ajay-devgn-eid-2026-comedy-2782903-2025-09-06",
      "headline": "Dhamaal 4 shoot wraps up, set for Eid 2026 releaseActor Ajay Devgn has officially wrapped up 'Dhamaal 4' shoot in Mumbai after six months. The film promises a unique blend of comedy, drama and action for its Eid 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-ashish-warang-remembering-the-marathi-actor-who-died-at-55-2782913-2025-09-06",
      "headline": "Who is Ashish Warang? Remembering the Marathi actor who died at 55Ashish Warang, a versatile actor known for his impactful supporting roles across Bollywood, Marathi and South Indian cinema, has died at 55. His memorable performances in films like 'Drishyam' and 'Sooryavanshi' will continue to be cherished by audiences and peers alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-bailey-announces-break-from-acting-2782902-2025-09-06",
      "headline": "Jonathan Bailey announces break from actingJonathan Bailey is taking a break from acting next year to focus on The Shameless Fund, an LGBTQ+ charity he founded. He was last seen in 'Jurassic World Rebirth'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madharaasi-vs-ghaati-box-office-day-1-sivakarthikeyan-film-races-ahead-anushka-shetty-film-2782874-2025-09-06",
      "headline": "Madharaasi vs Ghaati box office Day 1: Sivakarthikeyan-Murugadoss film races aheadSivakarthikeyan's 'Madharaasi' has opened to a strong box office response, overshadowing Anushka Shetty's 'Ghaati' on its first day. Both films received mixed reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-vs-bengal-files-box-office-day-1-tiger-shroff-actioner-dominates-vivek-agnihotri-film-lags-2782858-2025-09-06",
      "headline": "Baaghi 4 vs Bengal Files box office Day 1: Tiger Shroff's actioner dominates'Baaghi 4' and 'The Bengal Files' clashed at the box office with contrasting opening performances. While Tiger Shroff's action-packed 'Baaghi 4' impressed with strong collections, Vivek Agnihotri's complex drama struggled to make an impact amid stiff competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-aneet-padda-celebrate-saiyaara-50-day-run-with-dreamy-pictures-2782848-2025-09-06",
      "headline": "Ahaan Panday-Aneet Padda celebrate Saiyaara's 50-day run with dreamy picturesMohit Suri's 'Saiyaara', starring debutants Ahaan Panday and Aneet Padda, has completed 50 days in theatres, crossing Rs 500 crore worldwide to become Indian cinema's highest-grossing love story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kiku-sharda-shuts-down-rumours-of-rift-with-krushna-abhishek-says-bond-is-unbreakable-2782843-2025-09-06",
      "headline": "Kiku Sharda shuts down rumours of rift with Krushna Abhishek, says bond is unbreakableComedian Kiku Sharda has dismissed rumours of a fallout with co-star Krushna Abhishek, affirming his ongoing role in 'The Great Indian Kapil Show'. Fans can look forward to the remaining episodes on Netflix as the cast's strong camaraderie remains intact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/bad-girl-review-varsha-bharath-anjali-sivaraman-coming-of-age-master-break-patriarchal-chains-2782729-2025-09-05",
      "headline": "Bad Girl review: A coming-of-age masterpiece about breaking patriarchal chainsRelease Date:Fri Sep 05, 2025Bad Girl movie review: Director Varsha Bharath's 'Bad Girl' is a fantastic coming-of-age film of a woman. This lovely gem of a film lays bare patriarchy and showcases how women are slowly breaking away from generational trauma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rise-and-fall-contestants-premiere-date-ashneer-grover-reality-tv-show-amazon-mx-player-2782659-2025-09-05",
      "headline": "Rise & Fall: All about Ashneer Grover's reality showA new reality TV show, titled 'Rise & Fall', hosted by entrepreneur Ashneer Grover, is set to stream on Amazon MX Player. Some of the confirmed contestants include Arjun Bijlani, Dhanashree Verma, Kiku Sharda and Kubbra Sait, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pledges-rs-5-crore-for-punjab-flood-relief-calls-it-sewa-2782673-2025-09-05",
      "headline": "Akshay Kumar pledges Rs 5 crore for Punjab flood relief, calls it sewaActor Akshay Kumar has generously pledged Rs 5 crore to support relief efforts in flood-hit Punjab. His timely contribution, alongside heartfelt messages from celebrities like Diljit Dosanjh, brings hope and strength to the resilient people of Punjab during this difficult time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ghaati-review-anushka-shetty-comeback-film-struggles-basic-tropes-2782642-2025-09-05",
      "headline": "Ghaati review: Anushka Shetty's comeback film fails to rise above basic tropesRelease Date:Fri Sep 05, 2025Ghaati movie review: Director Krish Jagarlamudi's 'Ghaati', starring Anushka Shetty, Vikram Prabhu and others, is a strictly average tale on exploitation and oppression. The film relies on familiar tropes with very little to look forward to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aditya-narayan-pawan-singh-join-ashneer-grover-reality-show-rise-and-fall-2782663-2025-09-05",
      "headline": "Pawan Singh and Aditya Narayan join Ashneer Grover's reality show Rise and FallAmazon MX Player's new reality show 'Rise & Fall' welcomes singer-host Aditya Narayan and Bhojpuri superstar Pawan Singh, promising a thrilling mix of drama and entertainment. The series challenges 15 celebrities to adapt and strategise in a dynamic luxury-versus-bare-basics setting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/patralekhaa-opens-up-on-egg-freezing-struggles-pregnancy-was-way-easier-2782584-2025-09-05",
      "headline": "Pregnancy was way easier: Patralekhaa opens up on egg-freezing strugglesActor Patralekhaa, expecting her first child with husband Rajkummar Rao, opened up about the difficulties she faced during her egg-freezing journey three years ago, revealing that conceiving naturally was much easier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-bengal-files-movie-review-vivek-agnihotri-ruthless-hard-hitting-political-film-but-stretched-thin-2782426-2025-09-05",
      "headline": "The Bengal Files review: Ruthless, hard-hitting but stretched thinRelease Date:Fri Sep 05, 2025The Bengal Files review: Director Vivek Agnihotri's political-thriller 'The Bengal Files' is based on the 1946 Calcutta Killings and the Noakhali riots. Is the film able to do justice to a sensitive subject involving communal tensions and democracy? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-korean-dramas-use-time-travel-to-explore-love-regret-and-second-chances-2782367-2025-09-05",
      "headline": "How Korean dramas use time travel to explore love, regret and second chancesIn this week's K-fix we will discover how Korean dramas like 'A Time Called You', 'Moon Lovers: Scarlet Heart Ryeo', and 'Couple on the Backtrack' use time travel to explore love, regret, and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-odisha-contestant-reveals-father-forced-her-to-quit-studies-for-marriage-2782409-2025-09-05",
      "headline": "KBC 17: Odisha contestant says father forced her to quit studies for marriageIn the latest episode of 'Kaun Banega Crorepati 17', a contestant from Odisha revealed that she had to give up her job and that her father pressured her to marry at a young age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-visits-mumbai-months-after-sardaar-ji-3-row-2782405-2025-09-05",
      "headline": "Diljit Dosanjh visits Mumbai months after Sardaar Ji 3 rowSinger-actor Diljit Dosanjh made a rare appearance in Mumbai on Thursday. The visit came months after controversy over his film 'Sardaar Ji 3'. The actor recently wrapped filming for 'Border 2'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/deeply-appreciate-fully-reciprocate-trumps-sentiments-pm-after-us-presidents-always-be-friends-remark-2782859-2025-09-06",
      "headline": "Fully reciprocate his sentiments: PM as Trump dials down with 'friends' remarkThe Prime Minister's remarks come after Trump said he would 'always be friends' with Modi, in an apparent climbdown, a day after he asserted that the US had 'lost India to China'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/khalistani-extremist-funding-canada-finance-report-2025-justin-trudeau-mark-carney-2782901-2025-09-06",
      "headline": "Khalistani terror groups operate, raise funds, Canada admits in new risk reportCanada has long ignored India's repeated concerns about Khalistani elements' anti-India activities on Canadian soil, an issue that has soured relations between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-launched-covert-operation-to-intercept-kim-jong-un-calls-before-2019-nuke-talks-it-failed-2782671-2025-09-05",
      "headline": "How US Seal team's attempt to intercept Kim's call before 2019 N-talks fell apartIn early 2019, US Navy SEAL Team 6 launched a covert mission on North Korean soil, authorised by Donald Trump, with the objective of installing an electronic device designed to intercept communications from Kim Jong-un."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/tesla-will-give-elon-musk-1-trillion-salary-but-conditions-apply-and-he-has-to-achieve-all-this-2782868-2025-09-06",
      "headline": "Tesla will give Elon Musk $1 trillion salary, but conditions applyBillionaire Elon Musk could take home a $1 trillion salary if Tesla manages to hit audacious targets spanning car sales, robotaxis, and AI-powered humanoid bots over the next decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-imported-insects-to-fight-foreign-pests-classical-biological-control-locusts-cassava-mealybug-2782880-2025-09-06",
      "headline": "When India imported insects to fight pestsWhat does a country do when pests end up flying across borders, stuck on ships or hidden in food consignments, threatening crops and native plants? Faced with such destruction, India has imported insects from the UK and Africa to fight the pest menace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-man-held-for-hoax-bomb-threat-in-mumbai-ahead-of-anant-chaturdashi-last-day-ganesh-visarjan-2782852-2025-09-06",
      "headline": "Noida man arrested for Mumbai bomb threat claiming 14 Pak terrorists, 400 kg RDXThe police have arrested Ashwin Kumar Supra (50) from Noida for sending a WhatsApp message threatening serial blasts across Mumbai on Anant Chaturdashi. The sender alleged that 14 Pakistani terrorists had infiltrated the city and planned to detonate 400 kg of RDX, killing as many as \"one crore people.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-zuckerberg-caught-on-hot-mic-donald-trump-white-house-dinner-tech-ceos-2782922-2025-09-06",
      "headline": "Wasn't sure...: Zuckerberg's blunt investment apology to Trump caught on hot micDuring a White House dinner, Trump asked the tech CEOs about how much they were planning on spending in the US. Zuckerberg appeared to have been caught off guard and blurted out that Meta would invest $600 billion in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/diamond-ruby-emerald-studded-urn-worth-rs-1-crore-stolen-from-red-fort-delhi-jain-ritual-2782886-2025-09-06",
      "headline": "Man poses as Jain priest, steals Rs 1 crore gem-studded urn from Red Fort parkA jewelled urn studded with diamonds, rubies, and emeralds worth nearly Rs 1 crore was stolen from the Red Fort park during a Jain religious ritual. Police have identified the suspect through CCTV footage and an FIR has been registered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/indian-restaurants-turning-into-art-galleries-experiential-dining-2782910-2025-09-06",
      "headline": "Is it a restaurant or an art gallery? Both, actuallyArt today isn't confined to museums or galleries. With guests increasingly seeking unique experiences, several Indian restaurants are transforming their dining spaces into art galleries. Here's why it's a win-win for both the culinary and art worlds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/stopped-seven-wars-in-seven-months-trump-to-republican-lawmakers-at-dinner-2782855-2025-09-06",
      "headline": "Stopped seven wars in seven months: Trump to Republican lawmakers at dinnerUS President Donald Trump hosted a dinner party for Republicans at the newly renovated White House Garden where he claimed that his administration stopped seven wars in seven months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-waqf-board-case-against-hazratbal-shrine-plaque-vandals-2782740-2025-09-05",
      "headline": "Ashoka Emblem at J&K's Hazratbal shrine vandalised, Omar Abdullah backs moveA political and religious controversy erupted over the engraving of the national emblem on the renovation plaque at Hazratbal Shrine in Jammu and Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ka-sengottaiyan-who-called-for-re-induction-of-expelled-leaders-for-unity-sacked-from-aiadmk-2782916-2025-09-06",
      "headline": "AIADMK sacks ex-minister who called for re-induction of expelled leaders for unityAIADMK sacked ex-minister and senior party leader KA Sengottaiyan, a day after he called for re-induction of expelled leaders for unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nostalgia-save-theatres-bollywood-hollywood-bet-cinema-icons-meena-kumari-biopic-rocky-2782582-2025-09-06",
      "headline": "Can nostalgia save theatres? Bollywood-Hollywood bet on cinema icons and memoriesPop culture icons are the new flavour of the season in Indian cinema and Hollywood. Where is cinema headings with the announcement of Sourav Ganguly and Meena Kumari biopics, 'Rambo' origins story, 'I Play Rocky' and 'The Smashing Machine'? On Cinematic Saturday, we reflect on the future of storytelling as filmmakers recreate nostalgia to evoke audience emotions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-says-pm-modi-values-us-partnership-notes-personal-ties-with-trump-india-us-relations-video-2782906-2025-09-06",
      "headline": "PM values our partnership with US, has very good equation with Trump: JaishankarExternal Affairs Minister S Jaishankar on Saturday said Prime Minister Narendra Modi places enormous importance on India's partnership with the US and has always shared a strong personal rapport with President Donald Trump. His remarks came hours after Modi said he \"deeply appreciates and fully reciprocates\" Trump's positive assessment of bilateral ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-massive-landslide-in-himachal-pradeshs-shimla-national-highway-blocked-2782920-2025-09-06",
      "headline": "Video: Massive landslide in Himachal Pradesh's Shimla, national highway blockedA massive landslide occurred near Juri in Rampur subdivision of Shimla district, where a hill collapsed onto National Highway-05, blocking traffic. Another landslide was reported in Gaanchwa area of Ani subdivision, where falling boulders damaged roads and trees. Fortunately, no casualties were reported. Live videos of the incidents have surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/madhopatti-upsc-success-civil-servants-community-mentorship-uttar-pradesh-2782550-2025-09-06",
      "headline": "The Madhopatti Story: Why this tiny UP village is known as India's IAS factoryNo coaching centres. No big schools. Yet this small UP village has produced generations of IAS officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-preview-batting-shubman-gill-suryakumar-yadav-jasprit-bumrah-2782724-2025-09-06",
      "headline": "Asia Cup: India look to continue fearless mode as road to T20 World Cup beginsIndia enter the Asia Cup 2025 as defending champions, combining youth and experience. With Shubman Gill back in the squad, Jasprit Bumrah's expertise, and Arshdeep Singh's rise, the Men in Blue aim to fine-tune a team for the next era of T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-520-05-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovc-us-open-defeat-carlos-alcaraz-jannik-sinner-analysis-2782813-2025-09-06",
      "headline": "Once ageless, now 38, Djokovic just can't stop the Sincaraz partyAt 38, Novak Djokovic still chases a record-breaking 25th Grand Slam, but the Sincaraz party shows no mercy. Even the GOAT may need something extraordinary to crash it. And whether he can is anyone's guess as the young guns keep raising the bar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-leader-kaish-khan-arrested-in-kannauj-for-violating-district-ban-2782789-2025-09-06",
      "headline": "Video: Dramatic arrest of Samajwadi leader, UP cops find him hiding behind mattressSamajwadi Party leader Kaish Khan was arrested in Kannauj for defying a court order that barred him from entering the district. Police found Khan hiding behind a mattress in the loft at his brother's house."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bihar-man-shares-reckless-train-stunt-video-in-which-he-tries-to-touch-woman-2782887-2025-09-06",
      "headline": "Bihar man shares reckless train stunt video in which he tries to touch woman, slammedA man from Bihar posted a video of himself performing a reckless stunt on a moving train and attempting to touch a woman on the platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-impact-infiltration-attempts-loc-army-chief-dwivedi-2782824-2025-09-06",
      "headline": "War with Pakistan didn't end on May 10: Army Chief on Op SindoorArmy Chief General Upendra Dwivedi said it is too early to assess Operation Sindoor's impact on the LoC. Infiltration attempts by Pakistan-backed terrorists continue, indicating ongoing security challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-skip-un-session-in-us-this-month-will-be-replaced-by-s-jaishankar-trump-is-set-to-address-event-2782837-2025-09-06",
      "headline": "PM to skip general debate at UN session in US, S Jaishankar to represent IndiaPrime Minister Narendra Modi will not address the UN General Assembly's high-level General Debate later this month, with External Affairs Minister S Jaishankar scheduled to speak for India on September 27. The 80th UNGA session, opening September 9, will focus on global conflicts and mark the UN's 80th anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/abu-dhabi-bound-indigo-flight-6e-1403-returns-to-kochi-after-technical-snag-lands-safely-2782940-2025-09-06",
      "headline": "Abu Dhabi-bound IndiGo flight returns to Kochi after technical snagAn IndiGo flight from Kochi to Abu Dhabi returned to Cochin International Airport on Saturday after a technical snag. Flight 6E 1403 landed safely and is undergoing maintenance checks."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-on-womens-world-cup-2025-india-vs-australia-2782936-2025-09-06",
      "headline": "Australia ready for challenging Indian conditions in Women's World Cup: HealyAustralia women's cricket team captain Alyssa Healy expresses confidence ahead of the 2025 Women's World Cup in India. The defending champions are focused on overcoming local challenges and achieving back-to-back titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-mitchell-starc-plan-t20i-retirement-test-cricket-priority-2782918-2025-09-06",
      "headline": "Test cricket will always remain my priority: Starc after T20I retirementAustralia pacer Mitchell Starc has stated that he is willing to push his body to its limits to continue playing Test cricket. Starc recently retired from T20Is to concentrate on the ODI World Cup and his Test career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-preview-batting-shubman-gill-suryakumar-yadav-jasprit-bumrah-2782724-2025-09-06",
      "headline": "Asia Cup: India look to continue fearless mode as road to T20 World Cup beginsIndia enter the Asia Cup 2025 as defending champions, combining youth and experience. With Shubman Gill back in the squad, Jasprit Bumrah's expertise, and Arshdeep Singh's rise, the Men in Blue aim to fine-tune a team for the next era of T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-grand-slam-history-us-open-final-open-era-djokovic-2782892-2025-09-06",
      "headline": "Sinner, Alcaraz reach US Open final, end Big Three's 23-year-old Slam streakThe Jannik Sinner-Carlos Alcaraz era in men's tennis has taken full flight after a sensational Grand Slam season in 2025. For the first time since 2003, a season has passed without Novak Djokovic, Roger Federer or Rafael Nadal featuring in a Grand Slam final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-us-open-final-sinner-federer-advice-2782873-2025-09-06",
      "headline": "Carlos Alcaraz shares Roger Federer's advice ahead of US Open finalCarlos Alcaraz stormed into the final of the US Open after beating Novak Djokovic. After setting up the final against Jannik Sinner, Alcaraz recounted Roger Federer's advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-creates-panel-to-review-female-issues-in-olympic-sports-protects-experts-identity-2782862-2025-09-06",
      "headline": "IOC creates panel to review female issues in Olympic sportsThe IOC has formed a confidential female protection panel ahead of the 2028 Los Angeles Olympics. This move aims to address gender issues while maintaining the integrity of the group's work amid ongoing sports controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-sinner-vs-alcaraz-battle-for-world-no-1-2782849-2025-09-06",
      "headline": "Sinner vs Alcaraz: How US Open 2025 final will settle race for World No. 1The US Open final between Jannik Sinner and Carlos Alcaraz will decide not only the season's last Grand Slam title but also the battle for World No. 1 in the PIF ATP Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sinner-semifinal-match-report-2782846-2025-09-06",
      "headline": "Jannik Sinner sets up grand Sincaraz final after 4-set battle vs Auger AliassimeWorld No.1 Jannik Sinner set up a grand US Open final against Carlos Alcaraz. On Saturday, Sinner beat Canada's Felix Auger Aliassime with mechanical precision in a 4-set battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/luis-suarez-spitting-ban-inter-miami-2782825-2025-09-06",
      "headline": "Luis Suarez banned for 6 games after spitting saga in Leagues Cup finalInter Miami's Luis Suarez has been handed a 6-game ban for his antics in the Leagues Cup final against Seattle Sounders. Suarez had spit on the face of one of the opposition staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/rajgir-sports-complex-bihar-sporting-revival-hockey-asia-cup-2782820-2025-09-06",
      "headline": "Inside Rajgir sports complex: Cradle of Bihar's sporting culture revival, dreamsWith world-class facilities and an international cricket stadium on the way, the Rajgir Sports Complex is leading a revolution in Bihar by reviving the state's sporting culture and laying out new dreams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-sinner-vs-alcaraz-battle-for-world-no-1-2782849-2025-09-06",
      "headline": "Sinner vs Alcaraz: How US Open 2025 final will settle race for World No. 1The US Open final between Jannik Sinner and Carlos Alcaraz will decide not only the season's last Grand Slam title but also the battle for World No. 1 in the PIF ATP Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sinner-semifinal-match-report-2782846-2025-09-06",
      "headline": "Jannik Sinner sets up grand Sincaraz final after 4-set battle vs Auger AliassimeWorld No.1 Jannik Sinner set up a grand US Open final against Carlos Alcaraz. On Saturday, Sinner beat Canada's Felix Auger Aliassime with mechanical precision in a 4-set battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/luis-suarez-spitting-ban-inter-miami-2782825-2025-09-06",
      "headline": "Luis Suarez banned for 6 games after spitting saga in Leagues Cup finalInter Miami's Luis Suarez has been handed a 6-game ban for his antics in the Leagues Cup final against Seattle Sounders. Suarez had spit on the face of one of the opposition staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/rajgir-sports-complex-bihar-sporting-revival-hockey-asia-cup-2782820-2025-09-06",
      "headline": "Inside Rajgir sports complex: Cradle of Bihar's sporting culture revival, dreamsWith world-class facilities and an international cricket stadium on the way, the Rajgir Sports Complex is leading a revolution in Bihar by reviving the state's sporting culture and laying out new dreams. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}