{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2625408-2024-10-30",
      "headline": "Afcons Infrastructure IPO allotment: Step-by-step guide to check status Afcons Infrastructure allotment: Investors can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-day-3-check-latest-subscription-gmp-sees-dip-2625226-2024-10-29",
      "headline": "Afcons Infrastructure Day 3: Check latest subscription, GMP sees dip  The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-expert-tips-to-maximise-your-diwali-returns-review-2625087-2024-10-29",
      "headline": "Muhurat trading 2024: Expert tips to maximise your Diwali returnsMuhurat trading is a unique session conducted by Indian stock exchanges on Diwali, rooted in the belief that this 'auspicious hour' is a time to attract prosperity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-q2-results-profit-surges-664-percent-yoy-to-rs-1742-crore-2625030-2024-10-29",
      "headline": "Adani Enterprises Q2 results: Profit surges 664% YoY to Rs 1,742 croreThe company reported a net profit of Rs 1,742 crore in the July-September quarter, up from Rs 228 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-gain-momentum-weak-session-banking-diwali-week-2625027-2024-10-29",
      "headline": "Sensex, Nifty pare losses to end higher as banking stocks gainThe S&P BSE Sensex rose 363.99 points to 80,369.03 at the closing bell, while the NSE Nifty50 gained 127.70 points to settle at 24,446.85. Most of the broader market indices, including smallcap and midcaps, staged a stronger recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buying-property-this-festive-season-diwali-2024-top-3-things-you-should-consider-expert-advice-2625010-2024-10-29",
      "headline": "Buying property this festive season: 3 things you should consider Many people consider Dhanteras an auspicious time to make significant investments, with property being one of the most popular choices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-falls-over-5-percent-q2-profit-declines-market-expectations-2624959-2024-10-29",
      "headline": "Maruti Suzuki share price slumps over 5% as Q2 profit declines 17%Following a disappointing Q2 performance, shares of Maruti Suzuki fell over 5.5% amid concerns about the company's future growth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-fully-booked-check-latest-subscription-gmp-good-bad-2624953-2024-10-29",
      "headline": "Afcons Infrastructure IPO fully booked: Check latest subscription, GMPAfcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-muhurat-trading-2024-stocks-axis-bank-ltd-can-fin-homes-karur-vysya-bank-stylam-industries-2624948-2024-10-29",
      "headline": "Diwali Muhurat trading 2024: 4 stocks set to shine by next yearThe Muhurat trading session will be held on Friday, November 1, 2024, from 6 PM to 7 PM, with a pre-opening session starting between 5:45 PM and 6 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-down-should-you-buy-or-avoid-price-target-2624941-2024-10-29",
      "headline": "Zomato share price falls nearly 2% today. Should you buy or avoid? Zomato shares are down nearly 2% today. Is this dip a chance to buy in on India's food delivery growth story? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buying-gold-prices-dhanteras-diwali-check-latest-rates-future-outlook-2624904-2024-10-29",
      "headline": "Buying gold this Dhanteras? Check latest price and future outlookCelebrated just before Diwali, Dhanteras is considered an auspicious occasion for buying gold in various forms, whether jewellery, coins, or bars."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-sardar-vallabhbhai-patel-birth-anniversary-gujarat-kevadia-statue-of-unity-rashtriya-ekta-diwas-2625918-2024-10-31",
      "headline": "One Nation One Election, Uniform Civil Code soon: PM on Unity Day in GujaratPrime Minister Narendra Modi paid floral tribute to Sardar Vallabhbhai Patel on the latter's 149th birth anniversary at the Statue of Unity in Gujarat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-index-plunges-very-poor-diwali-thick-smog-covers-city-2625926-2024-10-31",
      "headline": "Delhi's air quality 'very poor' on Diwali, thick layer of smog blankets cityAs per data from the Central Pollution Control Board (CPCB), the average Air Quality Index (AQI) at 39 stations in the city stood at 329 (very poor) at 7 am. Anand Vihar recorded the worst AQI at 419 under the \"severe\" category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-laddu-temple-sweets-delhi-lucknow-mumbai-tested-for-purity-2625727-2024-10-30",
      "headline": "Operation Laddu: India Today tests purity of temple sweets across major cities\"Operation Laddu\" highlights an essential concern- the quality and authenticity of sweets consumed by millions of devotees across India vary significantly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-woman-beautician-missing-killed-body-parts-chopped-jodhpur-police-case-2625903-2024-10-31",
      "headline": "Beautician, 50, went missing in Rajasthan, chopped body parts found 2 days laterA 50-year-old woman, a beautician by profession, went missing for two days in Jodhpur before police found her chopped body parts buried near the accused's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-2024-donald-trump-rides-garbage-truck-says-in-honour-of-kamala-biden-2625932-2024-10-31",
      "headline": "Donald Trump rides garbage truck, says 'in honour of Kamala, Biden'Trump took questions from reporters sitting inside the cabin of the garbage truck and once again distanced himself from comedian Tony Hinchcliffe's remark, whose rib-tickler on Puerto Rico didn't go as planned. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-live-updates-mi-csk-rcb-kkr-dc-pbks-srh-rr-gt-lsg-pant-retained-released-list-2625927-2024-10-31",
      "headline": "LIVE Updates: Focus on Pant, Rahul, and Iyer as teams set to announce listIPL Retention 2025 LIVE Updates: All 10 IPL franchises are set to announce their final retentions by 5 PM IST today. Teams can keep up to six players within a Rs 120 crore budget, with a cap of five capped and two uncapped Indian players, ahead of the 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-quality-level-local-pollution-sources-farm-fires-cse-study-stubble-burning-diwali-2625901-2024-10-31",
      "headline": "Local pollution sources responsible for Delhi's bad air, not farm fires: StudyDelhi saw the highest number of 'very poor' air days in three years, with 11 such days recorded alongside five 'poor' days. In contrast, 'good' air quality days drastically declined, from 11 days in 2022 to just two in 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/silvered-onions-mcdonalds-quarter-pounder-burger-e-coli-outbreak-source-us-cdc-2625908-2024-10-31",
      "headline": "Onions on McDonald's burgers may have caused E Coli outbreak: US public health bodyE Coli outbreak linked to McDonald's Quarter Pounder hamburgers was first reported on October 22 and slivered onions were suspected to be the source of the infections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lucky-baskhar-movie-review-dulquer-salmaan-terrific-in-venky-atluri-film-on-banking-share-market-2625893-2024-10-30",
      "headline": "Lucky Baskhar review: Dulquer Salmaan is terrific in film on banking fraudsReleased-Thu Oct 31, 2024Lucky Baskhar movie review: Director Venky Atluri's film, starring Dulquer Salmaan, explains banking and share market to a layman. With a terrific actor at core, the film comes together in the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-man-arrested-fresh-death-threat-bollywood-actor-salman-khan-extortion-money-demand-2625911-2024-10-31",
      "headline": "Mumbai man arrested for threatening to kill Salman Khan, demanding ransomOn Tuesday, Mumbai Traffic Police received a message wherein the unidentified sender threatened to kill Bollywood actor Salman Khan if he did not pay a Rs 2 crore ransom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/diwali-2024-i-wish-everyone-a-healthy-happy-and-prosperous-life-says-prime-minister-narendra-modi-2625912-2024-10-31",
      "headline": " Devotees throng temples across India as celebrations begin Diwali 2024 Live: Prime Minister Narendra Modi On Thursday extended his greetings on the occasion of Diwali. \"On this divine festival of lights, I wish everyone a healthy, happy and prosperous life,\" he said in his message. Ayodhya dazzled on Diwali-eve as two Guinness records were set: most people (1,121) performing aarti and the most number of diyas (25 lakh) lit up to celebrate the festival. \"After 500 years, this holy moment has come after countless sacrifices and continuous sacrifice and penance of Ram devotees,\" PM said as Ayodhya hosted its first Diwali since the consecration of the Ram Temple. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-prediction-atmospheric-outlook-help-pollutant-dispersal-diwali-crackers-2625836-2024-10-30",
      "headline": "Post-Diwali air quality conditions in Delhi: What to expectNovember 1, the day after Diwali, will present more favourable meteorological conditions for dispersing pollutants. With expected high daytime temperatures reaching around 35 degrees Celsius and night temperatures at about 20 degrees, there is potential for aiding the dispersion of particulate matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-england-captain-house-robbery-theft-appeals-for-finding-robbers-jewellery-valuables-stolen-2625879-2024-10-30",
      "headline": "Theft at Ben Stokes's home: England captain appeals for help in finding robbersBen Stokes revealed that his home in the Castle Eden area of North East England was robbed and many valuable items holding sentimental values were stolen by thye perpetrators. The England Test captain has sought help in finding the robbers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/nawab-malik-mankhurd-shivaji-nagar-ncp-ticket-maharashtra-assembly-polls-bjp-shiv-sena-2625898-2024-10-31",
      "headline": "I'm not a rebel, will always stand with Ajit Pawar: NCP's Nawab MalikNCP leader Nawab Malik asserted that he would always stand with party leader Ajit Pawar and predicted that the latter could play a key role in the government formation in the event of a hung assembly in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-korea-launches-long-range-missile-designed-to-strike-us-2625910-2024-10-31",
      "headline": "North Korea launches long-range missile designed to strike USSouth Korea said it detected a ballistic missile launch from North Korea's capital region around 7.10 am on Thursday and that the weapon flew toward the waters between the Korean Peninsula and Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-2625843-2024-10-30",
      "headline": "Virat Kohli's struggles vs spin: A technical hiccup or the start of a decline?Can Virat Kohli, India's batting maestro, overcome his prolonged struggle against spin? With technical flaws creeping in and time running out, a return to basics might be the key for yet another comeback in the purest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/indias-silent-epidemic-whats-killing-our-students-2625134-2024-10-29",
      "headline": "India's silent epidemic: What's killing our students? Surging suicides in campuses, driven by relentless academic pressure and inadequate mental health support, expose the deep-rooted flaws in the educational and societal frameworks\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-restaurants-and-food-outlets-24-hour-operation-aerocity-atishi-government-2625902-2024-10-31",
      "headline": "Restaurants and food outlets allowed to operate 24x7 in Delhi's AerocityDelhi Chief Minister Atishi approved the 24-hour operations of restaurants and food outlets in Aerocity in a move that is expected to enhance the national capital's nightlife and drive economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-donald-trump-kamala-harris-live-updates-republican-democrats-swing-states-tour-november-5-polls-2625644-2024-10-30",
      "headline": "Live: Arnold Schwarzenegger endorses Harris, Trump distances from Puerto Rico remarksUS Elections LIVE updates: As the November 5 election approaches, the competition intensifies with polls revealing a closely matched race between former President and Republican candidate Donald Trump and Vice President and Democratic nominee Kamala Harris. Both candidates are making their final pushes to sway voters, with North Carolina — a crucial swing state known for its Republican-leaning presidential picks — set to host pivotal campaign stops today. Follow IndiaToday.in for the latest coverage, analysis, and updates as the US Election Day draws near."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/25-lakh-diyas-to-be-lit-ayodhya-aiming-for-guinness-world-record-1st-diwali-after-ram-temple-inauguration-2625512-2024-10-30",
      "headline": "Ayodhya's first Deepotsav after Ram temple consecration, 25 lakh diyas litChief Minister Yogi Adityanath, along with his cabinet members and others, lit the first few lamps to mark the launch of the Deepostav -- the first since the consecration of Ram temple on January 22 this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-message-on-diwali-wish-happy-prosperous-life-for-everyone-2625914-2024-10-31",
      "headline": "Wish happy, prosperous life for everyone: PM Modi's message on Diwali Live Updates PM Modi said this Diwali was special as it was the first Diwali after the consecration of the Ram Temple in Ayodhya. He said many generations had waited for this, and lakhs had \"sacrificed and suffered torture\" for this Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/singham-again-bhool-bhulaiyaa-3-amaran-to-not-release-saudi-arabia-here-is-why-2625929-2024-10-31",
      "headline": "Singham Again, Bhool Bhulaiyaa 3, Amaran to not release in Saudi ArabiaIndian films Singham Again, Bhool Bhulaiyaa 3, and Amaran will not be released in Saudi Arabia due to content restrictions. They will be available in other parts of the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-new-cnn-poll-kamala-harris-ahead-in-wisconsin-michigan-tied-donald-trump-in-pennsylvania-2625878-2024-10-31",
      "headline": "Kamala Harris ahead in Wisconsin, Michigan, tied in Pennsylvania: New CNN pollA latest poll by CNN shows US Vice President Kamala Harris has a marginal edge over her Republican rival Donald Trump in Michigan and Wisconsin, but the two candidates are tied in Pennsylvania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/singham-again-bhool-bhulaiyaa-3-amaran-to-not-release-saudi-arabia-here-is-why-2625929-2024-10-31",
      "headline": "Singham Again, Bhool Bhulaiyaa 3, Amaran to not release in Saudi ArabiaIndian films Singham Again, Bhool Bhulaiyaa 3, and Amaran will not be released in Saudi Arabia due to content restrictions. They will be available in other parts of the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lucky-baskhar-movie-review-dulquer-salmaan-terrific-in-venky-atluri-film-on-banking-share-market-2625893-2024-10-30",
      "headline": "Lucky Baskhar review: Dulquer Salmaan is terrific in film on banking fraudsReleased-Thu Oct 31, 2024Lucky Baskhar movie review: Director Venky Atluri's film, starring Dulquer Salmaan, explains banking and share market to a layman. With a terrific actor at core, the film comes together in the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-celebrates-birthday-with-boyfriend-walker-blanco-chunky-bhavna-2625799-2024-10-30",
      "headline": "Watch: Ananya Panday celebrates birthday with boyfriend Walker Blanco, parentsBollywood actor Ananya Panday celebrated her 26th birthday with a close-knit gathering of family and friends. Social media influencer Orry shared glimpses of the joyous event on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/karan-johar-diwali-wish-children-yash-roohi-mother-hiroo-2625793-2024-10-30",
      "headline": "Karan Johar shares photos with Yash and Roohi, mother Hiroo ahead of DiwaliKaran Johar sent festive wishes to his fans and friends on Instagram. The director, producer and actor shared family photos - with his twins Yash and Roohi and mother Hiroo Johar."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/1st-unofficial-test-australia-a-brendan-doggett-6-wickets-india-a-out-107-2625938-2024-10-31",
      "headline": "Australia A's Doggett picks 6 wickets to bowl India A out for 1071st Unofficial Test: India A collapsed to a mere 107 runs, largely due to a ferocious six-wicket haul from Australia A's Brendan Doggett on the first day of the first unofficial Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-ruud-van-nistelrooy-wants-manchester-united-stay-amidst-ruben-amorim-links-2625940-2024-10-31",
      "headline": "Ruud van Nistelrooy wants Manchester United stay amidst Ruben Amorim linksManchester United's interim manager Ruud van Nistelrooy has expressed his desire to stay with the club in a managerial capacity after a stunning 5-2 win against Leicester City. As the search for Erik ten Hag's permanent replacement continues, Van Nistelrooy hopes to remain with his former side in some capacity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-live-updates-mi-csk-rcb-kkr-dc-pbks-srh-rr-gt-lsg-pant-retained-released-list-2625927-2024-10-31",
      "headline": "LIVE Updates: Focus on Pant, Rahul, and Iyer as teams set to announce listIPL Retention 2025 LIVE Updates: All 10 IPL franchises are set to announce their final retentions by 5 PM IST today. Teams can keep up to six players within a Rs 120 crore budget, with a cap of five capped and two uncapped Indian players, ahead of the 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-nets-session-batting-fortunes-virat-rohit-2625923-2024-10-31",
      "headline": "India batters adopt desperate measure in nets to turn fortunes aroundTrailing 0-2 at home, Team India had adopted desperate measures to counter New Zealand's precise bowling, especially the spinners, with talk of a rank-turner pitch dominating pre-match discussions for the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-retention-hurt-rishabh-pant-leaves-gmr-run-delhi-capitals-shreyas-might-lead-2625920-2024-10-31",
      "headline": "Hurt Rishabh Pant leaves GMR-run Delhi Capitals, Shreyas might leadRishabh Pant, the star wicketkeeper-batter, has been released by Delhi Capitals after eight years, making him a hot target for the upcoming IPL auction. The decision follows a management overhaul and intense negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-manchester-united-thrash-leicester-spurs-knock-city-out-2625919-2024-10-31",
      "headline": "Manchester United thrash Leicester 5-2, Spurs knock City outManchester United responded to the firing of Erik ten Hag by thrashing Leicester City 5-2 in the English League Cup, while Tottenham Hotspur eliminated Manchester City in the last 16 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-england-captain-house-robbery-theft-appeals-for-finding-robbers-jewellery-valuables-stolen-2625879-2024-10-30",
      "headline": "Theft at Ben Stokes's home: England captain appeals for help in finding robbersBen Stokes revealed that his home in the Castle Eden area of North East England was robbed and many valuable items holding sentimental values were stolen by thye perpetrators. The England Test captain has sought help in finding the robbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odis-shakib-al-hasan-bcb-president-2625874-2024-10-30",
      "headline": "Shakib Al Hasan available for ODIs vs Afghanistan: BCB presidentShakib Al Hasan is available for Bangladesh's ODI series against Afghanistan, starting November 6 in Sharjah. Shakib recently pulled out of his 'farewell' Test against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-2625843-2024-10-30",
      "headline": "Virat Kohli's struggles vs spin: A technical hiccup or the start of a decline?Can Virat Kohli, India's batting maestro, overcome his prolonged struggle against spin? With technical flaws creeping in and time running out, a return to basics might be the key for yet another comeback in the purest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-a-vs-india-a-ruturaj-gaikwad-nathan-mcsweeney-2625841-2024-10-30",
      "headline": "Australia A vs India A Live Streaming: When and where to watch Test series?  Ruturaj Gaikwad's India A and Nathan McSweeney's Australia A will lock horns in an unofficial two-match Test series, starting Thursday, October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-manchester-united-thrash-leicester-spurs-knock-city-out-2625919-2024-10-31",
      "headline": "Manchester United thrash Leicester 5-2, Spurs knock City outManchester United responded to the firing of Erik ten Hag by thrashing Leicester City 5-2 in the English League Cup, while Tottenham Hotspur eliminated Manchester City in the last 16 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-england-captain-house-robbery-theft-appeals-for-finding-robbers-jewellery-valuables-stolen-2625879-2024-10-30",
      "headline": "Theft at Ben Stokes's home: England captain appeals for help in finding robbersBen Stokes revealed that his home in the Castle Eden area of North East England was robbed and many valuable items holding sentimental values were stolen by thye perpetrators. The England Test captain has sought help in finding the robbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odis-shakib-al-hasan-bcb-president-2625874-2024-10-30",
      "headline": "Shakib Al Hasan available for ODIs vs Afghanistan: BCB presidentShakib Al Hasan is available for Bangladesh's ODI series against Afghanistan, starting November 6 in Sharjah. Shakib recently pulled out of his 'farewell' Test against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-virat-kohlis-struggles-vs-spin-a-technical-hiccup-or-the-start-of-a-decline-2625843-2024-10-30",
      "headline": "Virat Kohli's struggles vs spin: A technical hiccup or the start of a decline?Can Virat Kohli, India's batting maestro, overcome his prolonged struggle against spin? With technical flaws creeping in and time running out, a return to basics might be the key for yet another comeback in the purest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-a-vs-india-a-ruturaj-gaikwad-nathan-mcsweeney-2625841-2024-10-30",
      "headline": "Australia A vs India A Live Streaming: When and where to watch Test series?  Ruturaj Gaikwad's India A and Nathan McSweeney's Australia A will lock horns in an unofficial two-match Test series, starting Thursday, October 31. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pkl-11-narender-kandola-stars-as-tamil-thalaivas-decimate-gujarat-giants-2625821-2024-10-30",
      "headline": "PKL 11: Narender Kandola stars as Tamil Thalaivas decimate Gujarat GiantsThe Tamil Thalaivas crushed the Gujarat Giants 44-25 in PKL Season 11, powered by Narender Kandola's 15-point Super 10. With two ALL OUTs and a dominant second-half display, the Thalaivas secured their third win of the season in style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-eng-jos-buttler-eager-to-get-back-on-the-field-after-frustrating-calf-injury-2625804-2024-10-30",
      "headline": "Jos Buttler eager to get back on the field after 'frustrating' calf injuryEngland white-ball captain Jos Buttler recently revealed that he's eager to be back on the field in the upcoming T20I series vs West Indies after recovering from calf injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-irfan-pathan-shreyas-iyer-rishabh-pant-dc-kkr-2625803-2024-10-30",
      "headline": "Irfan Pathan advises DC to keep Pant, wants KKR to retain Shreyas IPL 2025: Irfan Pathan said that Delhi Capitals should try and retain Rishabh Pant, who has been a part of their setup since the 2016 edition. Last year, Pant failed to lead DC through to the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wankhede-test-when-ajaz-patel-picked-10-wicket-haul-vs-india-in-2021-2625785-2024-10-30",
      "headline": "Wankhede Test: When Ajaz patel picked 10-wicket haul vs India in 2021Ajaz Patel etched his name in history with a stunning 10-wicket haul against India at Wankhede, becoming only the third bowler ever to achieve the feat. He delivered a masterclass on his return to his birthplace, Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gives-autograph-to-specially-abled-child-before-wankhede-test-2625780-2024-10-30",
      "headline": "Virat Kohli gives autograph to specially abled child before Wankhede TestIn a heart-warming gesture, Virat Kohli gave his autograph to a specially abled child ahead of the 3rd Test betwen India and New Zealand at the Wankhede stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retentions-rcb-retentions-virat-kohli-glenn-maxwell-will-jacks-faf-du-plessis-cameron-green-2625773-2024-10-30",
      "headline": "RCB to retain Kohli, Du Plessis, Maxwell among others? franchise drops major hintIndian Premier League (IPL) franchise Royal Challengers Bengaluru (RCB) dropped major hints for their retentions ahead of IPL 2025 through a social media post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-danni-wyatt-up-warriorz-rcb-2625772-2024-10-30",
      "headline": "RCB trade in Danni Wyatt-Hodge from UP Warriorz for WPL WPL 2025: Defending champions Royal Challengers Bengaluru (RCB) have roped in English batter Danni Wyatt-Hodge from the UP Warriorz. Wyatt recently played in the Women's T20 World Cup where England failed to go through to the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gary-kirsten-breached-his-contract-with-pakistan-cricket-board-mohsin-naqvi-2625755-2024-10-30",
      "headline": "Gary Kirsten breached his contract with Pakistan Cricket Board: Mohsin NaqviPakistan Cricket Board Chairman Mohsin Naqvi has claimed that their head coach Gary Kirsten broke his contract by breaching it. Kirsten recently resigned from his position as white-ball head coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gives-autograph-to-specially-abled-child-before-wankhede-test-2625780-2024-10-30",
      "headline": "Virat Kohli gives autograph to specially abled child before Wankhede TestIn a heart-warming gesture, Virat Kohli gave his autograph to a specially abled child ahead of the 3rd Test betwen India and New Zealand at the Wankhede stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retentions-rcb-retentions-virat-kohli-glenn-maxwell-will-jacks-faf-du-plessis-cameron-green-2625773-2024-10-30",
      "headline": "RCB to retain Kohli, Du Plessis, Maxwell among others? franchise drops major hintIndian Premier League (IPL) franchise Royal Challengers Bengaluru (RCB) dropped major hints for their retentions ahead of IPL 2025 through a social media post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-danni-wyatt-up-warriorz-rcb-2625772-2024-10-30",
      "headline": "RCB trade in Danni Wyatt-Hodge from UP Warriorz for WPL WPL 2025: Defending champions Royal Challengers Bengaluru (RCB) have roped in English batter Danni Wyatt-Hodge from the UP Warriorz. Wyatt recently played in the Women's T20 World Cup where England failed to go through to the semis. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gary-kirsten-breached-his-contract-with-pakistan-cricket-board-mohsin-naqvi-2625755-2024-10-30",
      "headline": "Gary Kirsten breached his contract with Pakistan Cricket Board: Mohsin NaqviPakistan Cricket Board Chairman Mohsin Naqvi has claimed that their head coach Gary Kirsten broke his contract by breaching it. Kirsten recently resigned from his position as white-ball head coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-lands-in-trouble-delhi-court-fresh-probe-cheating-case-2625750-2024-10-30",
      "headline": "Delhi court orders fresh probe against Gautam Gambhir in cheating caseSpecial Judge Vishal Gogne said that the allegations against Indian men's cricket coach Gautam Gambhir in a cheating case \"merit further investigation\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manu-bhakers-vocal-for-local-style-diwali-with-street-vendors-selling-diyas-2625745-2024-10-30",
      "headline": "Manu Bhaker's 'vocal for local' style Diwali with street vendors selling diyasManu Bhaker supports local artisans by choosing handmade 'mitti' diyas for Diwali. Sharing a heartfelt moment with street vendors, the 22-year-old shooter promotes the 'vocal for local' movement, encouraging fans to celebrate the festival with traditional, homegrown products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-slams-pakistan-cricket-board-for-losing-gary-kirsten-as-head-coac-2625729-2024-10-30",
      "headline": "Kevin Pietersen slams Pakistan Board for losing Gary Kirsten as head coachFormer England cricketer Kevin Pietersen has slammed Pakistan Cricket Board for letting their white ball head coach Gary Kirsten resign from his position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-shubman-gill-takes-pay-cut-to-keep-gujarat-titans-core-intact-2625725-2024-10-30",
      "headline": "IPL 2025 retention: Gill takes pay cut to keep Gujarat Titans' core intactShubman Gill takes a pay cut to help Gujarat Titans retain their core players ahead of the IPL 2025 season. Rashid Khan will be the franchise's top retention, with the mega auction set to take place overseas in November."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}