{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/black-monday-us-jim-cramer-expert-warns-donald-trump-tariffs-could-trigger-worst-crash-since-1987-2704742-2025-04-06",
      "headline": "'Black Monday': US expert warns Trump tariffs could trigger worst crash since 1987Jim Cramer warned that markets might face a bloodbath similar to 1987 - when the Dow Jones suffered its biggest single-day crash to date. He claimed that if the US President didn't 'reach out' to nations which have not imposed retaliatory tariffs and reward them for their compliance, the situation could worsen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-helpline-startups-dukandari-jibe-innovation-startup-maha-kumbh-event-2704717-2025-04-06",
      "headline": "Piyush Goyal announces helpline for startups days after 'dukandari' jibe at themDays after questioning the innovation of Indian startups overtly focussing on food delivery and betting and fantasy sports apps, Commerce and Industry Minister Piyush Goyal announced a helpline for startups if they wanted to make suggestions or file complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-china-us-trade-war-unfolded-a-timeline-of-tariffs-and-countermoves-glbs-2704712-2025-04-06",
      "headline": "How China-US trade war unfolded: A timeline of tariffs and countermovesChina is responding forcefully to Trump's latest tariffs with a 34% tax on US imports, rare earth export curbs, company bans, and WTO action, raising fears of another full-blown trade war. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/british-automobile-maker-jaguar-land-rover-suspend-shipments-to-us-over-tariffs-britain-2704600-2025-04-05",
      "headline": "Jaguar Land Rover to suspend shipments to US over tariffs on BritainJaguar Land Rover, which is owned by India's Tata Motors, confirmed the temporary export suspension after the Times newspaper reported the plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-warns-of-60-chance-of-global-recession-after-donald-trumps-tariffs-2704407-2025-04-05",
      "headline": "JP Morgan warns of 60% chance of global recession after Trump's tariffsFollowing the US-China trade war, global investment firm J.P. Morgan said it now sees a 60% chance of the global economy entering recession by year-end, up from 40% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05",
      "headline": "Wall Street shatters as Trump tariffs trigger worst day in US markets since 2020US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-crashes-2000-points-as-trumps-tariffs-spark-global-market-panic-glbs-2704333-2025-04-05",
      "headline": "Dow crashes 2,000 points as Trump's tariffs spark global market panicGlobal markets plunged as Trump's tariffs triggered a trade war escalation with China. The Dow fell over 2,000 points, crude prices tumbled, and investors feared an impending global recession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-warns-higher-inflation-slower-growth-trump-tariffs-2704280-2025-04-04",
      "headline": "Higher inflation, slower growth: US Federal Reserve chair warns after Trump tariffsUS Federal Reserve chair Jerome Powell spoke as global markets continued a swoon that has wiped some 10 per cent off major US stock indexes since Trump announced a raft of new tariffs on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-opened-sharply-lower-after-chinas-retaliatory-tariff-measure-nasdaq-composite-2704230-2025-04-04",
      "headline": "US stocks plummet after China's retaliatory levies in response to Trump tariffsNasdaq IXIC dropped more than 20 per cent from its all-time closing high touched in December, putting it on course to confirm a bear market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-return-2025-itr-2-filing-now-made-easier-check-latest-updates-2704180-2025-04-04",
      "headline": "Income tax return 2025: ITR-2 filing now made easierITR-2 is meant for individuals whose annual income is above Rs 50 lakh or who earn from sources like rent, capital gains, or other sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-share-price-reliance-industries-stock-fall-4-percent-stock-market-crash-mukesh-ambani-net-worth-2703996-2025-04-04",
      "headline": "RIL share price falls 4% ahead of Q4 results. Should you sell?Reliance Industries stock: RIL shares opened at Rs 1,240 and fell to an intraday low of Rs 1,192.85 in the afternoon session. The stock was close to its 52-week low of Rs 1,156, which it touched on March 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-india-26-percent-clarity-while-house-new-document-trade-2703962-2025-04-04",
      "headline": "US tariffs stay at 26% as White House unveils new trade documentInitially, India's tariff rate was mentioned as 27% in the earlier version of the White House annex. However, the latest revision has adjusted it to 26%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/withdrawing-epf-know-rules-for-marriage-education-home-and-medical-needs-2703935-2025-04-04",
      "headline": "Withdrawing EPF? Know rules for marriage, education, home and medical needsIf you require money out of your EPF for the purposes of marriage or further studies, there are set regulations one needs to adhere to. You must have been an EPF member for at least seven years and must have at least Rs 1,000 in your EPF account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-says-politicians-need-reality-check-after-piyush-goyal-startup-focused-on-food-delivery-remark-2703916-2025-04-04",
      "headline": "Politicians need reality check, says Ashneer Grover on Piyush Goyal's startup remarkAshneer Grover has said that Indian politicians need a reality check after Piyush Goyal criticised startups for being too focused on food delivery apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pension-rules-updates-8-rbi-guidelines-every-pensioner-must-know-2703884-2025-04-04",
      "headline": "Pension rules updates: 8 RBI guidelines every pensioner must knowIf a bank accidentally credits more pension than it should to a pensioner, then the bank must consult the Pension Sanctioning Authority before recovering the extra money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-fall-5-percent-today-why-reasons-explained-clsa-trump-tariff-2703862-2025-04-04",
      "headline": "Explained: Why Tata Motors share price has fallen 5% todayTata Motors share price: Tata Motors has gone down 8.68% in the last 5 days, 33.43% in the past month and 38.75% in the last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-slams-indian-startups-urges-to-shift-focus-from-food-delivery-apps-2703842-2025-04-04",
      "headline": "Piyush Goyal slams Indian startups, urges to shift focus from food delivery appsUnion Commerce Minister Piyush Goyal criticised India's startup ecosystem, saying it's too focused on food delivery, betting, and fantasy sports apps. In contrast, he praised Chinese startups for prioritising advanced tech like EVs, batteries, semiconductors, and AI, urging Indian innovators to shift toward deeper, tech-driven innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-crash-today-sensex-nifty-under-pressure-trump-reciprocal-tariffs-global-recession-it-sector-2703831-2025-04-04",
      "headline": "Sensex crashes 1,000 points: 3 reasons behind today's stock market bloodbathStock market crash: The S&P BSE Sensex was down 965.90 points to 75,329.46, while the NSE Nifty50 fell 361.10 points to 22,889.00 as of 2:08 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startup-news-zepto-founder-aadit-palicha-mohandas-pai-defend-2703830-2025-04-04",
      "headline": "Storm of protest from startups after Minister Piyush Goyal's 'dukaandari' jibeStartup ecosystem leaders' response came after Piyush Goyal took a firm stance and said that while Indian startups were busy building food delivery platforms and fantasy gaming apps, those in countries like China were working on EVs, semiconductors, batteries, and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-over-350-points-nifty-slides-below-23200-it-and-auto-stocks-drag-markets-2703803-2025-04-04",
      "headline": "Sensex tanks over 700 points as Wall Street bloodbath sinks Indian IT stocksStock market crash: The S&P BSE Sensex was down 698.89 points to 75,596.47 at around 10:06 am, while the NSE Nifty50 was trading 269.50 points lower at 22,980.60."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-expectations-april-4-sensex-nifty-today-wall-street-crash-trump-tariff-2703776-2025-04-04",
      "headline": "Trump's tariff jitters hit US stocks: Will Sensex, Nifty feel the heat today?The extensive tariff announcements by the US government have raised concerns about a global recession, leading to sharp losses in stock markets worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-4-shares-in-focus-hdfc-bank-zomato-dmart-nestle-india-sensex-nifty-2703770-2025-04-04",
      "headline": "Stocks to watch on April 4: Shares in news; HDFC Bank, Zomato, DMartStocks in news today: In Friday's session, shares of Zomato, Nestle India, HDFC Bank, DMart, Mazagon Dock, Bajaj Finance, and others will be in focus due to key corporate developments and financial updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startups-grocery-delivery-comparison-china-ai-zepto-ceo-mohandas-pai-2703750-2025-04-04",
      "headline": "Dukaandari hi karni hai? Piyush Goyal slams startups stuck on food deliveryCommerce Minister Piyush Goyal asked Indian startups to shift their focus from food delivery apps to high-tech sectors like semiconductors and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-drops-1600-as-us-stocks-lead-sell-off-after-trumps-tariffs-cause-covid-like-shock-glbs-2703733-2025-04-04",
      "headline": "Trump tariff blitz wrecks Wall Street, markets suffer biggest fall since CovidTrump's sweeping tariffs sent shockwaves through financial markets, with Wall Street suffering its worst decline since 2020. Analysts warn of economic slowdowns, surging inflation, and a potential recession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tech-retail-stocks-lead-rout-after-trumps-tariff-blow-glbs-2703723-2025-04-04",
      "headline": "US tech, retail stocks lead rout after Trump's tariff blowTrump's broad tariffs send US markets into a tailspin, with tech, retail, and banking stocks plunging. Apple, Walmart, and Nike face rising costs, while energy prices drop amid economic concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-sharply-lower-amid-trade-war-fears-after-trump-tariffs-2703618-2025-04-03",
      "headline": "Wall Street opens sharply lower amid trade war fears after Trump tariffsWall Street's major indexes fell sharply after President Trump's new tariffs raised trade war fears. The Dow dropped 2.66%, the S&P 500 declined 3.32%, and the Nasdaq plunged 4.50%, reflecting market uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-nomination-updation-now-free-says-finance-minister-nirmala-sitharaman-2703506-2025-04-03",
      "headline": "PPF nomination updation now free, says Nirmala SitharamanIt is important to add a nominee to the PPFaccount so that the money is transferred in a smooth manner in the event of the death of the PPF account holder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-liberation-day-reciprocal-tariff-announcement-india-at-27-percent-pakistan-29-percent-tariff-2703432-2025-04-03",
      "headline": "Trump's 'Liberation Day' tariff: India at 27%, but where does Pakistan stand?Asian nations have been the hardest hit by Trump's latest tariff move. The new duties aim to cut the US trade deficit and change global supply chains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-300-points-as-trump-tariffs-weigh-but-nifty-holds-23200-amid-limited-impact-2703450-2025-04-03",
      "headline": "Sensex, Nifty snap 2-day winning streak as D-Street sees limited tariff impactThe S&P BSE Sensex fell 322.08 points to close at 76,295.36, while the NSE Nifty50 shed 82.25 points to end at 23,250.10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-us-calculate-reciprocal-tariff-for-different-countries-explanation-factors-reasons-2703440-2025-04-03",
      "headline": "Explained: How Trump's administration calculated reciprocal tariffsIn a statement released on Wednesday night, the United States Trade Representative (USTR) explained how the tariffs were determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-shares-video-on-x-alleges-fraud-conspiracy-legal-battle-2703395-2025-04-03",
      "headline": "Byju Raveendran alleges conspiracy caught on video amid legal woesThe video he shared is one minute and 44 seconds long and appears to be a screen recording of a virtual meeting involving Byju's shareholders and their lawyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-asia-countries-hardest-hit-china-vietnam-thailand-south-korea-india-2703307-2025-04-03",
      "headline": "Trump's tariff list: Here's why Asian countries took the biggest hitTrump tariff: Besides China, which now faces a total tariff of 54%, Vietnam has been hit with 46%, Thailand with 37%, South Korea with 25%, and India with 27%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-order-india-gets-key-exemptions-on-several-critical-minerals-ytvd-2703245-2025-04-03",
      "headline": "Trump's tariff order: India gets key exemptions on several critical mineralsTrump's new tariff order exempts India on copper, lumber, and critical minerals. The order imposes a 26% lower tariff on India compared to China, but experts question the calculation methods. Former diplomat Ashok Sajjanar criticises the non-transparent system and highlights the impact on strategic partnerships in the Indo-Pacific region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-analyzes-impact-of-us-tariff-mixed-bag-not-a-setback-commerce-ministry-ytvd-2703226-2025-04-03",
      "headline": "Mixed bag, not a setback: India's first response to Trump's tariffThe Commerce Ministry of India is analysing the impact of the 27% tariff imposed by the US. The ministry states it's a mixed bag and not a setback. Exemptions are expected in sectors like pharmaceuticals, semiconductors, and critical minerals. The tariff ranges from 10% to 27% across various sectors. India aims to sign a Bilateral Trade Agreement with the US by fall this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pharmaceutical-stocks-rising-today-donald-trump-reciprocal-tariff-exempt-glanf-pharma-cipla-dr-reddys-2703255-2025-04-03",
      "headline": "Sun Pharma, Gland, Cipla, Dr Reddy's: Why pharma stocks are rising todayShares of Sun Pharma, Dr Reddy's Laboratories, Gland Pharma, and Cipla rose sharply during early trade, defying the weak trend visible on the broader markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-tanks-500-points-nifty-below-23200-it-stocks-worst-hit-hcltech-infosys-2703240-2025-04-03",
      "headline": "Trump tariffs roil Dalal Street: Sensex, Nifty fall as IT stocks worst hitThe S&P BSE Sensex fell 344.27 points to 76,273.17, while the NSE Nifty50 lost 80.60 points to 23,251.75 as of 9:31 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fountain-of-youth-trailer-out-john-kransinski-natalie-portman-eliza-gonzalez-2704942-2025-04-06",
      "headline": "Fountain of Youth trailer: John Kransinski, Natalie Portman search for immortalityThe trailer of Guy Ritchie's upcoming film, Fountain of Youth, released recently. Starring John Krasinski and Natalie Portman, the film is a thrilling heist adventure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-reunite-on-screen-after-daughter-dua-birth-2704934-2025-04-06",
      "headline": "Watch: Ranveer Singh, Deepika Padukone reunite on-screen after Dua's birthOne of Bollywood's favourite couple, Deepika Padukone and Ranveer Singh, delighted fans with a recent appearance, marking their first on-screen collaboration since welcoming their daughter, Dua."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jack-blacks-a-minecraft-movie-becomes-a-smash-hit-revives-hollywood-box-office-2704920-2025-04-06",
      "headline": "Jack Black's A Minecraft Movie becomes a smash hit, revives Hollywood box officeJack Black's latest venture, A Minecraft Movie, has taken the global box office by storm. The film's success is a beacon of hope for Hollywood, showcasing the appeal of video game adaptations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/peddi-first-glimpse-ram-charan-hits-it-out-of-the-stadium-in-buchi-babu-sanas-film-2704884-2025-04-06",
      "headline": "Peddi 1st glimpse: Ram Charan hits it out of the stadium in Buchi Babu Sana's filmOn the occasion of Ram Navami, the teaser for 'Peddi' starring Ram Charan was released, showcasing his striking new look. The film is set to hit theatres on March 27, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parth-samnthaan-replace-shivaji-satam-next-acp-cid-2704861-2025-04-06",
      "headline": "Parth Samthaan to join CID as new ACP after Shivaji Satam's exitParth Samthaan is set to be the next ACP in CID. He will be replacing Shivaji Satam, whose character ACP Pradyuman, was killed on the show."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jacqueline-fernandezs-mother-dies-due-to-stroke-and-health-complications-2704827-2025-04-06",
      "headline": "Jacqueline Fernandez's mother dies due to health complicationsJacqueline Fernandez is grieving the loss of her mother, who died after being hospitalised in Mumbai. The actor and her family will release a statement soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-unaware-of-acp-pradyuman-track-over-cid-okay-with-it-2704824-2025-04-06",
      "headline": "Shivaji Satam aka ACP Pradyuman had 'no clue' about his track being over in CIDShivaji Satam, who plays ACP Pradyuman on CID, spoke about his character's death on the show, stating he was not informed of the end of his track and is currently on a break."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tron-ares-trailer-jared-leto-unleashes-digital-chaos-as-he-enters-the-real-world-2704782-2025-04-06",
      "headline": "Tron Ares trailer: Jared Leto unleashes digital chaos as he enters the real worldTron Ares, the third instalment in the iconic sci-fi series, releases its trailer, showcasing a thrilling chase and digital mayhem. Jared Leto stars as Ares, a program crossing into the real world, with a stellar cast alongside him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshaye-khanna-set-to-make-telugu-debut-after-chhaava-success-2704768-2025-04-06",
      "headline": "Akshaye Khanna set to make Telugu debut after Chhaava successAkshaye Khanna has been confirmed to join the cast of Mahakali, the next film in the Prasanth Varma Cinematic Universe. This will also mark the actor's Telugu debut.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/diljit-dosanjh-will-smith-groove-to-dhol-beats-fans-call-it-ultimate-collab-2704762-2025-04-06",
      "headline": "Diljit Dosanjh, Will Smith groove to dhol beats. Fans call it ultimate collabDiljit Dosanjh surprised fans with a viral Instagram video featuring Will Smith. The duo was seen enjoying a vibrant Bhangra dance, sparking excitement online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hugh-grant-criticises-heathrow-officer-for-creepy-questions-with-his-children-fans-react-2704746-2025-04-06",
      "headline": "Hugh Grant criticises Heathrow officer for 'creepy' questions with his children. Fans reactActor Hugh Grant expressed his discontent on social media after a Heathrow immigration officer's comments to his children. The incident has divided opinions online, with many defending the officer's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/miss-mary-review-meena-kumari-gemini-ganesan-kishore-kumar-2704692-2025-04-06",
      "headline": "Miss Mary: The Meena Kumari-Kishore Kumar classic that captured age of innocenceIn this week's Retro Review, we revisit 'Miss Mary', starring Meena Kumari, Gemini Ganesan and Kishore Kumar. Perhaps one of India's most remade films, the comedy movie still remains a classic six decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhota-saif-ali-khan-in-talks-for-race-4-producer-ramesh-taurani-2704640-2025-04-05",
      "headline": "Sidharth Malhotra, Saif Ali Khan in talks for Race 4: Producer Ramesh TauraniProducer Ramesh Taurani clarified the casting rumors surrounding Race 4. He mentioned that only Saif Ali Khan and Sidharth Malhotra are currently in talks for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-10-teen-shows-to-watch-on-netflix-in-april-2025-glbs-2704466-2025-04-05",
      "headline": "Top 10 teen shows to watch on Netflix in April 2025Netflix's April 2025 lineup features ten top-rated teen shows, blending romance, drama, comedy, and fantasy. Highlights include Heartstopper, Stranger Things, Never Have I Ever, and Teenage Bounty Hunters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/burqa-city-director-fabrice-bracq-surprised-by-similarity-with-laapataa-ladies-plot-2704619-2025-04-05",
      "headline": "Burqa City director 'surprised' by similarity with Laapataa Ladies' plotFrench director Fabrice Bracq accused Kiran Rao's Laapataa Ladies of plagiarising his short film Burqa City. The controversy has sparked a debate on originality and creative influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/laapataa-ladies-writer-biplab-goswami-denies-plagiarism-claims-in-social-media-post-2704593-2025-04-05",
      "headline": "Laapataa Ladies writer Biplab Goswami denies plagiarism claims: Completely untrueBiplab Goswami, screenwriter of Laapataa Ladies, denied plagiarism allegations following online comparisons to Burqa City. He asserted the film's originality, citing years of research and screenplay registration since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-calls-jr-ntr-favourite-co-star-wants-to-work-with-christopher-nolan-2704562-2025-04-05",
      "headline": "Hrithik Roshan calls Jr NTR his favourite co-star: He's brilliant and amazingHrithik Roshan, during his Tour marking 25 years in Bollywood, called Jr NTR his favourite co-star. He also spoke about directing Krrish 4 and his desire to work with Christopher Nolan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actors-mugdha-chaphekar-ravish-desai-separation-9-years-of-marriage-2704534-2025-04-05",
      "headline": "Mugdha Chaphekar, Ravish Desai announce separation after 9 years of marriageTV actors Mugdha Chaphekar and Ravish Desai have announced their separation after nine years of marriage. They have been living apart for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-scott-india-debut-circus-maximus-tour-second-show-added-tickets-live-2704500-2025-04-05",
      "headline": "Travis Scott India Tour: Second show added in Delhi due to high demandTravis Scott is set to perform in India for the first time with his Circus Maximus Tour on October 18, 2025. Owing to a huge demand, a second show has also been added."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-tamil-nadu-rameswaram-speech-tamil-sign-language-row-2704887-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leaders write to me, no one signs in Tamil: PM's dig at Stalin amid language rowPrime Minister Narendra Modi, addressing a rally in Rameshwaram, said the letters he receives from Tamil Nadu leaders don't have signatures in Tamil language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-farmer-leader-jagjit-singh-dallewal-ends-over-4-month-long-hunger-strike-2704919-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Farmer leader Jagjit Singh Dallewal ends hunger strike after 131 daysJagjit Singh Dallewal ended his hunger strike after over four months. He was protesting for a legal guarantee on minimum support prices. Union ministers had urged him to end the fast due to health concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamras-letter-to-mumbai-police-after-skipping-three-summons-in-eknath-shinde-row-2704765-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra's letter to Mumbai Police after skipping third summons in Shinde rowKunal Kamra sparked a massive row after a clip from his stand-up show went viral on social media where he made a joke at Shiv Sena leader Eknath Shinde and referred to him as a 'traitor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrah-to-play-vs-rcb-mahela-jayawardene-2704961-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah available for Mumbai's next fixture, confirms Mahela JayawardeneJasprit Bumrah available for selection in Mumbai Indians' next fixture against Royal Challengers Bengaluru (RCB) revealed their head coach Mahela Jaywardene in the pre-match press conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pokemon-pikachu-turkey-washington-us-trump-musk-hands-off-protests-go-global-2704869-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Turkey, Pikachu steals the thunder at 'Hands Off!' protests against TrumpDressed in the iconic yellow costume nostalgic to every nineties kid, Pikachu hit the streets of both Washington, D.C., and New York City over the weekend holding \"end oppression\" signboard, infusing new life into the mass demonstrations while dancing and singing with the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/piyush-goyal-battle-startups-engage-in-just-to-survive-indian-ecosystem-murtaza-amin-x-post-it-burhanpur-mp-2704852-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mr Piyush Goyal, this is the battle startups engage in just to surviveAfter Commerce and Industry Minister Piyush Goyal slammed Indian startups for the lack of innovation and a narrow focus on just e-commerce, a startup founder discussed, in a post on X, how difficult it was to do business in India. Murtaza Amin, who runs an IT services company, BizProspex, from Burhanpur in Madhya Pradesh, revealed the challenges faced by startups in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-prime-minister-keir-starmer-to-declare-end-of-globalisation-amid-trumps-trade-war-2704763-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UK Prime Minister to declare end of globalisation amid Trump's trade warThe UK Prime Minister Keir Starmer is all set to announce that globalisation - which began with the fall of the Soviet Union in 1991 - has caused disappointment to millions of voters as Trump's unprecedented 10 per cent 'baseline' tariffs slipped the global markets into uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2025-retirement-raj-shamani-podcast-2704862-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MS Dhoni breaks silence on IPL retirement, addresses rumours in latest podcastLegendary MS Dhoni addressed his retirement rumours from the Indian Premier League in a latest podcast. Dhoni in his latest interview, has revealed how he will take a call on his retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/apples-farming-rajasthan-thai-guava-mp-commercial-farming-reaping-profit-agriculture-dragon-fruit-bihar-kesar-farm-market-2704187-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Apples in Rajasthan, Thai guava in MP: Farming seeing a start-up-like disruptionA new breed of farmers in India are going beyond the lure of paddy and wheat MSP, and sowing unconventional cash crops that are in high demand. They are bending the climate and conventional wisdom in the process by growing apples and saffron in Rajasthan, dragon fruit in Bihar and Thai guava in Madhya Pradesh. If the Green Revolution filled stomachs, Green Revolution 2.0 promises to fill bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-poses-as-uk-cardiologist-performs-surgeries-patients-die-madhya-pradesh-damoh-2704774-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man poses as UK cardiologist, performs 15 surgeries, 7 patients dieIn a letter to the NHRC, the complainant alleged that the hospital did not report the deaths to the local police or hospital outpost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-batting-dc-vs-csk-2704948-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "KL Rahul joins T20 party with mental shift: Strike rate no longer overrated?KL Rahul steered Delhi Capitals to a win against Chennai Super Kings on April 5. After the match, Rahul revealed a key change in his mentality in T20 cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/peddi-first-glimpse-ram-charan-hits-it-out-of-the-stadium-in-buchi-babu-sanas-film-2704884-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Peddi 1st glimpse: Ram Charan hits it out of the stadium in Buchi Babu Sana's filmOn the occasion of Ram Navami, the teaser for 'Peddi' starring Ram Charan was released, showcasing his striking new look. The film is set to hit theatres on March 27, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mk-stalin-skips-pm-modi-pamban-event-in-tamil-nadu-demands-fair-delimitation-guarantee-2704840-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stalin skips PM's Pamban event in Tamil Nadu, demands fair delimitation guaranteeTamil Nadu Chief Minister MK Stalin said the Prime Minister should also ensure that the state's share of parliamentary seats, in percentage terms, remains unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-inaugurate-pamban-bridge-india-first-vertical-lift-sea-bridge-today-rameshwaram-tamil-nadu-2704733-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi inaugurates India's first vertical lift sea bridge in Tamil NaduRooted in mythology, Pamban Bridge holds deep spiritual significance, as the Ramayana recounts the construction of Ram Setu beginning from Dhanushkodi, near Rameswaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/bride-to-be-dies-after-fall-from-roller-coaster-at-delhi-amusement-park-2704753-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bride-to-be, 24, dies after fall from roller coaster at Delhi amusement parkPriyanka, a sales manager from Chanakyapuri, was at Fun and Food Village near the Kapashera border with her future husband, Nikhil, on Wednesday afternoon, when the incident happened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-match-preview-predicted-xi-pitch-conditions-2704773-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRH vs GT Match Preview: Can composed Gujarat make life worse for Hyderabad?IPL 2025, Sunrisers Hyderabad vs Gujarat Titans Match Preview: As Sunrisers Hyderabad aim to halt their losing streak, Gujarat Titans ride into the clash brimming with momentum. With high stakes, a batter-friendly pitch, and dew in play, fireworks are expected in this crucial IPL 2025 showdown at Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-470-04-04-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/na-na-hey-hey-goodbye-white-house-shares-new-deportation-video-x-users-react-2704855-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Na na, hey hey, goodbye': White House's new deportation video sparks backlashThe White House is facing fresh backlash after posting a video celebrating migrant deportations - the second in recent weeks - featuring detainees being processed to the tune of the pop hit 'Na Na Hey Hey Kiss Him Goodbye'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-row-rahul-gandhis-church-land-claim-draws-rajeev-chandrasekhar-ire-2704831-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf row: Rahul Gandhi's church land claim draws Rajeev Chandrasekhar's ireIn response to the Waqf's criticism,  Rajeev Chandrashekhar said that the amended law seeks to undo the injustice Congress had committed in 2013, when the Waqf law was last amended, because of its \"shameless appeasement politics.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/miss-mary-review-meena-kumari-gemini-ganesan-kishore-kumar-2704692-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Miss Mary: The Meena Kumari-Kishore Kumar classic that captured age of innocenceIn this week's Retro Review, we revisit 'Miss Mary', starring Meena Kumari, Gemini Ganesan and Kishore Kumar. Perhaps one of India's most remade films, the comedy movie still remains a classic six decades later."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/black-monday-us-jim-cramer-expert-warns-donald-trump-tariffs-could-trigger-worst-crash-since-1987-2704742-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Black Monday': US expert warns Trump tariffs could trigger worst crash since 1987Jim Cramer warned that markets might face a bloodbath similar to 1987 - when the Dow Jones suffered its biggest single-day crash to date. He claimed that if the US President didn't 'reach out' to nations which have not imposed retaliatory tariffs and reward them for their compliance, the situation could worsen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-sri-lankan-president-anura-kumara-dissanayake-state-banquet-what-unites-india-sri-lanka-curry-cuisine-cricket-2704794-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Curry, cuisine, and cricket: PM Modi on what unites India and Sri LankaThe Prime Minister also highlighted the symbolic significance of shared sacred sites, saying, \"From Bodh Gaya to Anuradhapura and Rameshwaram to Thirukoneswaram, the Buddhist and Ramayana-linked pilgrimage sites reflect our cultural ties.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-woman-collapses-dies-while-giving-farewell-speech-in-college-maharashtra-dharashiv-2704751-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman, 20, collapses and dies while giving farewell speech in collegeThe video circulating online shows Varsha laughing and addressing the gathering moments before she loses consciousness and collapses."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrah-to-play-vs-rcb-mahela-jayawardene-2704961-2025-04-06",
      "headline": "Jasprit Bumrah available for Mumbai's next fixture, confirms Mahela JayawardeneJasprit Bumrah to feature in MI's next fixture, confirms head coach Mahela Jayawardene"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-batting-dc-vs-csk-2704948-2025-04-06",
      "headline": "KL Rahul joins T20 party with mental shift: Strike rate no longer overrated?KL Rahul steered Delhi Capitals to a win against Chennai Super Kings on April 5. After the match, Rahul revealed a key change in his mentality in T20 cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-retirement-speculation-pbks-vs-csk-chandigarh-2704938-2025-04-06",
      "headline": "Watch: MS Dhoni arrives in Chandigarh for PBKS vs CSK amidst retirement rumoursAmidst all the speculation about his future, MS Dhoni arrived in Chandigarh for Chennai Super Kings' clash against Punjab Kings. Dhoni's future is under the scanner after CSK's loss to DC on April 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-speaks-on-yuvraj-singh-virender-sehwag-sachin-tendulkar-2704927-2025-04-06",
      "headline": "Would love to see Yuvraj, Sehwag, Sachin and Ganguly play together again: DhoniLegendary India and Chennai Super Kings (CSK) wicketkeeper batter MS Dhoni expressed his desire to see his former teammates Virender Sehwag, Sachin Tendulkar, Yuvraj Singh, and Sourav Ganguly play together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rohit-sharma-relationship-indian-team-memories-2704896-2025-04-06",
      "headline": "Kohli opens up on 15 years with Rohit Sharma: Grateful for the memoriesAs RCB and MI get ready to face off in Bengaluru, fans will hope to see Virat Kohli and Rohit Sharma back on the field together, as the two stars bring 15 years of friendship into this big IPL clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2025-retirement-raj-shamani-podcast-2704862-2025-04-06",
      "headline": "MS Dhoni breaks silence on IPL retirement, addresses rumours in latest podcastLegendary MS Dhoni addressed his retirement rumours from the Indian Premier League in a latest podcast. Dhoni in his latest interview, has revealed how he will take a call on his retirement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-ipl-2025-nitish-reddy-abhishek-sharma-2704841-2025-04-06",
      "headline": "Not Travishek, Nitish Reddy needs to change batting approach for SRH: JafferSRH vs GT: Former batter Wasim Jaffer has said all-rounder Nitish Reddy needs to bat better in the IPL. Jaffer has asked Nitish to provide stability to the line-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-kl-rahul-kevin-pietersen-paint-on-dry-wall-watch-2704826-2025-04-06",
      "headline": "KL Rahul reminds Pietersen of old 'paint on a wall dry' tweet after CSK knockDelhi Capitals batter KL Rahul, in what was a fun banter with his side's mentor Kevin Pietersen, reminded the former England skipper about his old tweet that criticised the India batter's batting style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-simon-helmot-travis-head-abhishek-sharma-2704694-2025-04-06",
      "headline": "SRH vs GT: Travishek duo won't tone down aggression, says assistant coachIPL 2025, SRH vs GT: SunRIsers Hyderabad assistant coach Simon Helmot said Travis Head and Abhishek Sharma will continue being aggressive despite results not going their way early in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-japan-grand-prix-result-max-verstappen-norris-piastri-2704789-2025-04-06",
      "headline": "Max Verstappen wins his 4th straight Japan Grand Prix. Norris, Piastri finish 2nd and 3rd.Red Bull's Max Verstappen won his 4th straight Japan Grand Prix on Sunday, April 6. McLaren's Lando Norris and Oscar Piastri finished 2nd and 3rd respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-live-score-ipl-2025-updates-sunrisers-hyderabad-gujarat-titans-2704787-2025-04-06",
      "headline": "SRH vs GT Live Score, IPL 2025: Sunrisers Hyderabad look to arrest the slideSunrisers Hyderabad (SRH) vs Gujarat Titans (GT) Live Score, IPL 2025: Sunrisers Hyderabad will take on Gujarat Titans at their home ground at the Rajiv Gandhi Stadium in Hyderabad. SRH have lost three games on the trot and will look to arrest the slide against a confident Gujarat side. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-ipl-2025-nitish-reddy-abhishek-sharma-2704841-2025-04-06",
      "headline": "Not Travishek, Nitish Reddy needs to change batting approach for SRH: JafferSRH vs GT: Former batter Wasim Jaffer has said all-rounder Nitish Reddy needs to bat better in the IPL. Jaffer has asked Nitish to provide stability to the line-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-kl-rahul-kevin-pietersen-paint-on-dry-wall-watch-2704826-2025-04-06",
      "headline": "KL Rahul reminds Pietersen of old 'paint on a wall dry' tweet after CSK knockDelhi Capitals batter KL Rahul, in what was a fun banter with his side's mentor Kevin Pietersen, reminded the former England skipper about his old tweet that criticised the India batter's batting style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-simon-helmot-travis-head-abhishek-sharma-2704694-2025-04-06",
      "headline": "SRH vs GT: Travishek duo won't tone down aggression, says assistant coachIPL 2025, SRH vs GT: SunRIsers Hyderabad assistant coach Simon Helmot said Travis Head and Abhishek Sharma will continue being aggressive despite results not going their way early in the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-japan-grand-prix-result-max-verstappen-norris-piastri-2704789-2025-04-06",
      "headline": "Max Verstappen wins his 4th straight Japan Grand Prix. Norris, Piastri finish 2nd and 3rd.Red Bull's Max Verstappen won his 4th straight Japan Grand Prix on Sunday, April 6. McLaren's Lando Norris and Oscar Piastri finished 2nd and 3rd respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/srh-vs-gt-live-score-ipl-2025-updates-sunrisers-hyderabad-gujarat-titans-2704787-2025-04-06",
      "headline": "SRH vs GT Live Score, IPL 2025: Sunrisers Hyderabad look to arrest the slideSunrisers Hyderabad (SRH) vs Gujarat Titans (GT) Live Score, IPL 2025: Sunrisers Hyderabad will take on Gujarat Titans at their home ground at the Rajiv Gandhi Stadium in Hyderabad. SRH have lost three games on the trot and will look to arrest the slide against a confident Gujarat side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-vs-rcb-jasprit-bumrah-2704783-2025-04-06",
      "headline": "Mumbai Indians tease Jasprit Bumrah return ahead of RCB clashStar fast bowler Jasprit Bumrah might play Mumbai Indians' next match against Royal Challengers Bengaluru, the team teased on Sunday, April 6. MI put up a post for Bumrah who joined the team ahead of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-match-preview-predicted-xi-pitch-conditions-2704773-2025-04-06",
      "headline": "SRH vs GT Match Preview: Can composed Gujarat make life worse for Hyderabad?IPL 2025, Sunrisers Hyderabad vs Gujarat Titans Match Preview: As Sunrisers Hyderabad aim to halt their losing streak, Gujarat Titans ride into the clash brimming with momentum. With high stakes, a batter-friendly pitch, and dew in play, fireworks are expected in this crucial IPL 2025 showdown at Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-vikram-solanki-srh-vs-gt-2704663-2025-04-06",
      "headline": "Siraj has been exceptional, don't be quick to judge: Vikram SolankiIPL 2025, SRH vs GT: Director of Cricket Operations at Gujarat Titans, Vikram Solanki, praised Mohammed Siraj for being exceptional for the team. Siraj won the Player of the Match award against the Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-shubman-gill-ishan-mohammed-siraj-batting-watch-video-2704764-2025-04-06",
      "headline": "SRH vs GT: Shubman Gill and Ishan Kishan hilariously rate 'batter' Mohammed SirajAhead of GT and SRH's Hyderabad showdown, close friends Ishan Kishan and Shubman Gill shared a light-hearted moment hyping up Mohammed Siraj's batting in the nets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-ashutosh-sharma-interact-batting-watch-2704752-2025-04-06",
      "headline": "Watch: MS Dhoni talks batting with DC's Ashutosh Sharma after Chepauk clashDelhi Capitals batter Ashutosh Sharma took to Instagram to share a glimpse of his interaction with Chennai Super Kings star-man MS Dhoni after the Chepauk clash between the two sides. Although Ashutosh was dismissed for 1 against CSK, he has been key to DC's success in \r\nIPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-villian-chennai-struggle-2704750-2025-04-06",
      "headline": "CSK's identity crisis could turn MS Dhoni into the villainIPL 2025: MS Dhoni wasn't meant to carry CSK in IPL 2025. He planned and trained to just finish with a flourish. But a timid, unrecognisable CSK now risks rewriting his farewell as a fall from grace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-concern-wasim-jaffer-defeat-2704714-2025-04-06",
      "headline": "Rattled CSK not even trying: Wasim Jaffer on major concern after DC defeatIPL 2025: Former batter Wasim Jaffer was surprised by the Chennai Super Kings' (CSK) batting approach after their 25-run defeat to Axar Patel's Delhi Capitals (DC) on Saturday at Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-glenn-maxwell-halleys-comet-of-cricket-sanjay-manjrekar-2704739-2025-04-06",
      "headline": "Maxwell like Halley's Comet of Cricket, scores once in 75 games: ManjrekarSanjay Manjrekar didn't hold back while critiquing Glenn Maxwell's IPL form, comparing his rare batting success to Halley's Comet. As Punjab Kings falter, questions loom large over Maxwell's impact with the bat despite occasional breakthroughs with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-ashutosh-sharma-interact-batting-watch-2704752-2025-04-06",
      "headline": "Watch: MS Dhoni talks batting with DC's Ashutosh Sharma after Chepauk clashDelhi Capitals batter Ashutosh Sharma took to Instagram to share a glimpse of his interaction with Chennai Super Kings star-man MS Dhoni after the Chepauk clash between the two sides. Although Ashutosh was dismissed for 1 against CSK, he has been key to DC's success in \r\nIPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-villian-chennai-struggle-2704750-2025-04-06",
      "headline": "CSK's identity crisis could turn MS Dhoni into the villainIPL 2025: MS Dhoni wasn't meant to carry CSK in IPL 2025. He planned and trained to just finish with a flourish. But a timid, unrecognisable CSK now risks rewriting his farewell as a fall from grace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-concern-wasim-jaffer-defeat-2704714-2025-04-06",
      "headline": "Rattled CSK not even trying: Wasim Jaffer on major concern after DC defeatIPL 2025: Former batter Wasim Jaffer was surprised by the Chennai Super Kings' (CSK) batting approach after their 25-run defeat to Axar Patel's Delhi Capitals (DC) on Saturday at Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-glenn-maxwell-halleys-comet-of-cricket-sanjay-manjrekar-2704739-2025-04-06",
      "headline": "Maxwell like Halley's Comet of Cricket, scores once in 75 games: ManjrekarSanjay Manjrekar didn't hold back while critiquing Glenn Maxwell's IPL form, comparing his rare batting success to Halley's Comet. As Punjab Kings falter, questions loom large over Maxwell's impact with the bat despite occasional breakthroughs with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-retire-2023-manoj-tiwary-2704737-2025-04-06",
      "headline": "MS Dhoni should have retired after IPL 2023, he is losing respect: Manoj TiwaryManoj Tiwary feels that MS Dhoni should have retired after the IPL 2023 title win and claimed that the CSK legend is slowly starting to lose the respect of the fans. Dhoni has struggled to make an impact this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-jofra-archer-x-factor-transitioning-from-2704734-2025-04-06",
      "headline": "IPL 2025: Vintage Jofra Archer might be X-factor for transitioning Rajasthan RoyalsAfter a lacklustre start, Jofra Archer has gone into turbo mode by cranking up the speed in the last two outings for RR. With the England pacer showing signs of returning to his former self, a transitioning Rajasthan side can slowly start dreaming of a fantastic campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-jofra-archer-reaction-player-of-match-award-2704709-2025-04-06",
      "headline": "Jofra Archer breathes fire again in IPL: RR pacer reveals mantra to successIPL 2025, PBKS vs RR: Fast bowler Jofra Archer won the Player of the Match award in Rajasthan's 50-run win over Punjab on Saturday. The express pacer took three wickets, including two in in his first over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-sanju-samson-jofra-archer-sandeep-sharma-2704708-2025-04-06",
      "headline": "Sanju Samson claims RR have finally found their 'pattern' after PBKS winRajasthan Royals captain Sanju Samson feels that his side has finally found their right combination after thrashing Punjab Kings by 50 runs on Saturday, April 5. Royals made it two out of two wins in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-csk-vs-dc-pbks-vs-rr-highlights-orange-purple-cap-2704707-2025-04-06",
      "headline": "Points Table, April 5: DC storm to top, PBKS slide after RR lossIPL Points Table Update, April 5: Delhi Capitals beat Chennai Super Kings in the first game, after which Rajasthan Royals defeated the Punjab Kings by 50 runs in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-jofra-archer-yashasvi-jaiswal-mullanpur-2704697-2025-04-05",
      "headline": "PBKS vs RR: Archer, Jaiswal star as Royals halt Project Punjab momentumIPL 2025 PBKS vs RR: Jofra Archer and Yashasvi Jaiswal were the stars of the show as Rajasthan Royals handed Punjab Kings their first loss of the season in Mullanpur on Saturday, April 5."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-gt-assistant-coach-simon-helmot-press-conference-2704688-2025-04-05",
      "headline": "Talks about 300 is outside noise, no added pressure on us: SRH assistant coachIPL 2025, SRH vs GT: Speaking to the press on the eve of SunRisers Hyderabad's home game against Gujarat Titans, assistant coach Simon Helmet said the surrounding chatter over them breaching the 300-run mark is just outside noise and there is no added pressure on the team. SRH have flopped as a batting unit in IPL 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-dc-ms-dhoni-intent-stephen-fleming-press-conference-2704687-2025-04-05",
      "headline": "MS Dhoni had intent against DC: CSK coach Stephen Fleming defends legendChennai Super Kings coach Stephen Fleming has defended the intent shown by MS Dhoni during their loss against the Delhi Capitals on Saturday, April 5. Dhoni scored 30 off 26 balls against Delhi at Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-vikram-solanki-press-conference-srh-vs-gt-2704670-2025-04-05",
      "headline": "Sunrisers very capable and strong: Vikram Solanki not undermining SRHIPL 2025, SRH vs GT: In the pre-match press conference, Gujarat Titans Director of Cricket, Vikram Solanki, said that his team won't undermine the Sunrisers Hyderabad in their upcoming clash on Sunday at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-meets-sri-lankas-1996-world-cup-heroes-in-colombo-2704661-2025-04-05",
      "headline": "PM Modi meets Sri Lanka's 1996 World Cup heroes in ColomboPrime Minister Narendra Modi met with Sri Lanka's 1996 World Cup heroes in Colombo on Saturday, April 5. PM Modi had a chat with some of the stars from the iconic side that defeated Australia to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-retirement-rumour-stephen-fleming-reaction-2704651-2025-04-05",
      "headline": "MS Dhoni is still going strong: CSK coach Fleming brushes off retirement chatterIPL 2025, CSK vs DC: Head coach Stephen Fleming addressed MS Dhoni retirement rumours after Chennai's humbling defeat to Delhi. Dhoni struggled to hit big sixes in his laboured knock of 30 in CSK's failed chase of 184. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-sakshi-video-viral-2704650-2025-04-05",
      "headline": "MS Dhoni's last match? Wife Sakshi's chat with Ziva goes viralIPL 2025, CSK vs DC: A video of Sakshi Dhoni where she was talking to Ziva went viral on social media. Sakshi appeared to say \"last match\" to Ziva, as seen from lip-reading the video."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}