{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-127-points-higher-nifty-above-25200-eternal-gains-1-percent-2746333-2025-06-26",
      "headline": "Sensex opens 127 points higher, Nifty above 25,200; Eternal gains 1%The S&P BSE Sensex was up 364.24 points to 83,119.75, while the NSE Nifty50 added 114.95 points to 25,359.70 as of 9:31 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-fine-bse-rs-25-lakh-why-reason-for-unequal-data-access-failure-in-oversight-order-trading-rights-2746330-2025-06-26",
      "headline": "Sebi penalises BSE Rs 25 lakh for unequal data access, failure in oversightSebi called the failure by BSE 'laxity and negligence' and pointed out that BSE, being a first-level regulator, has a duty to maintain a clean and fair trading environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-june-26-trading-setup-nse-bse-rise-fall-2746310-2025-06-26",
      "headline": "Sensex, Nifty opening on June 26: Will stock market rise again today?As of 8:24 am, the Gift Nifty futures were trading at 25,287 points. This suggests that the Nifty50 could open around its previous close of 25,244.75."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-26-share-market-tips-nse-bse-trading-sbi-tata-steel-mobikwik-adani-2746300-2025-06-26",
      "headline": "Stocks to watch on June 26: SBI, Tata Steel, One Mobikwik, Adani EnterprisesStrong global signals and a steady flow of news from domestic companies helped keep investor sentiment upbeat as Sensex and Nifty gained nearly 1% in the last session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-and-reliance-jio-bp-partner-to-expand-fuel-access-across-india-2746044-2025-06-25",
      "headline": "Adani Total Gas and Jio-bp partner to expand fuel access across IndiaThis collaboration will see Jio-bp's premium petrol and diesel sold at select Adani fuel outlets, according to ATGL's statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-700-points-higher-nifty-above-25200-titan-up-4-mahindra-infosys-2746018-2025-06-25",
      "headline": "Sensex closes 700 points higher, Nifty above 25,200, Titan up 4%The S&P BSE Sensex added 700.40 points to end at 82,755.51, while the NSE Nifty50 gained 200.40 points to close at 25,244.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/jewellery-vs-gold-etfs-how-to-make-make-money-shine-not-just-wrists-explains-ca-2745981-2025-06-25",
      "headline": "Jewellery vs gold ETFs: How to make make money shine, not just wrists, explains CAGold jewellery may look beautiful, but it often comes with hidden costs, resale hassles, and emotional attachment that cloud financial judgement."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-hrithik-roshan-jr-ntr-and-kiara-advanis-1st-look-posters-promise-power-and-action-2746415-2025-06-26",
      "headline": "War 2: Hrithik, Jr NTR and Kiara Advani's 1st look posters promise power and actionOn Thursday, the makers of 'War 2' unveiled the first-look posters of Hrithik Roshan, Jr NTR and Kiara Advani, showcasing them in fierce and commanding avatars. The film is set to hit theatres on August 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-reacts-to-criticism-of-speaking-only-about-punjab-not-india-says-cartier-stole-patiala-necklace-2746164-2025-06-26",
      "headline": "Diljit Dosanjh reacts to criticism of speaking only about Punjab, not IndiaDiljit Dosanjh got emotional while recalling how he represented Punjab at global events like the Met Gala, saying it was never about him but about showcasing his culture. He also addressed criticism for not speaking about India, stating, \"I am Punjabi, what can I say?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-final-trailer-marvel-first-family-faces-galactus-in-epic-showdown-2746364-2025-06-26",
      "headline": "Fantastic Four final trailer: Marvel's first family faces Galactus in epic showdownThe final trailer of 'Fantastic Four: The First Steps' shows the epic battle between Marvel's first superhero family and their arch-rival Galactus. The film will release in theatres on on July 25, 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-box-office-collection-day-6-dhanush-nagarjuna-sekhar-kammula-film-100-crore-worldwide-2746397-2025-06-26",
      "headline": "Kuberaa box office Day 6: Dhanush-Nagarjuna's film is Rs 100 crore strongDirector Sekhar Kammula's 'Kuberaa' starring Dhanush and Nagarjuna earned Rs 100 crore globally in its first week in theatres. The film is now eyeing a solid second weekend in cinemas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-debuts-her-wounded-unborken-warrior-look-in-new-film-2746394-2025-06-26",
      "headline": "Unbroken Rashmika Mandanna debuts her wounded warrior look in new filmActor Rashmika Mandanna announced her new film on social media on Thursday. The title of the film and more details about it will be out on Friday at 10:08 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dune-director-denis-villeneuve-helming-new-james-bond-film-new-missions-2746345-2025-06-26",
      "headline": "New missions to come: Dune director Denis Villeneuve on helming new James Bond filmDirector Denis Villeneuve will be helming the next James Bond film. He emphasised honouring the legacy and introducing many new missions to the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-box-office-collection-day-6-detailed-report-aamir-khan-film-steady-during-weekdays-2746372-2025-06-26",
      "headline": "Sitaare Zameen Par box office Day 6: Aamir Khan's film steady during weekdaysAamir Khan's 'Sitaare Zameen Par' is working well during the weekdays at the box office. The film has surpassed the Rs 80 crore benchmark and is now looking at going past Rs 100 crore by the end of its second weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-says-main-pregnant-hoon-in-laughterchefs-2-promo-fans-react-2746362-2025-06-26",
      "headline": "Did Ankita Lokhande confirm pregnancy in new LaughterChefs 2 promo? WatchAnkita Lokhande recently appeared to have confirmed her pregnancy in a new 'LaughterChefs 2' promo video. The revealtion left many fans congratulating the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-spent-entire-night-re-dubbing-for-agneepath-abhishek-bachchan-2746327-2025-06-26",
      "headline": "Amitabh Bachchan spent entire night re-dubbing for Agneepath: Abhishek BachchanAbhishek Bachchan, in an exclusive interview with India Today, shared a rare insight about Amitabh Bachchan re-dubbing the entire 'Agneepath' film in one night. The legendary actor changed his voice for the movie, which initially upset audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-kannappa-ticket-price-hiked-by-rs-50-by-andhra-pradesh-government-2746318-2025-06-26",
      "headline": "Vishnu Manchu's Kannappa ticket price hiked by Rs 50 in Andhra PradeshActor Vishnu Manchu's 'Kannappa' is set to release on June 27. Ahead of its premiere, the Andhra Pradesh government has approved a Rs 50 hike in the standard ticket price across the state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-pharrell-williams-yaara-louis-vuitton-paris-fashion-week-j-hope-vibes-to-song-2746313-2025-06-26",
      "headline": "AR Rahman, J-Hope collab calls trend after BTS star vibes to Yaara at fashion showOscar-winning composer AR Rahman teamed up with Pharrell Williams for a Punjabi track Yaara, which premiered at Paris Fashion Week. The song has gained widespread social media acclaim, with BTS's J-Hope spotted enjoying the music live."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-must-apologise-remove-objectionable-scenes-mika-singh-pak-actor-hania-aamir-casting-sardaar-ji-3-2746294-2025-06-26",
      "headline": "Diljit must apologise, remove objectionable scenes: Mika Singh amid Sardaar Ji 3 rowSinger-rapper Mika Singh, in another post, said that he is willing to forgive Diljit Dosanjh if he apologises. He called him a 'fake' singer and lashed out at him for working with a Pakistani actor in 'Sardaar Ji 3'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-drops-season-2-of-the-ultimatum-queer-love-set-in-miami-glbs-2746279-2025-06-26",
      "headline": "Netflix drops season 2 of The Ultimatum: Queer Love, set in MiamiNetflix's The Ultimatum: Queer Love returns for Season 2 in vibrant Miami, exploring love and commitment among six queer couples in a bold relationship test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fitness-influencer-liver-king-arrested-after-threatening-joe-rogan-online-glbs-2746265-2025-06-26",
      "headline": "Fitness influencer 'Liver King' arrested after threatening Joe Rogan onlineFitness influencer Liver King Brian Johnson was arrested in Austin for threatening Joe Rogan on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/perfect-match-season-3-netflix-announces-cast-and-release-schedule-glbs-2746263-2025-06-26",
      "headline": "Perfect Match season 3: Netflix announces cast and release schedulePerfect Match Season 3 premieres August 1 on Netflix, featuring stars from The Bachelor, Love Island, and more in a high-stakes dating showdown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/fwice-slams-diljit-dosanjh-casting-border-2-pakistani-ties-boycott-violation-2746235-2025-06-25",
      "headline": "Film body slams Diljit Dosanjh's casting in Border 2 amid Sardaar Ji 3 rowThe Federation of Western India Cine Employees (FWICE) has condemned Diljit Dosanjh's casting in 'Border 2'. This move highlights ongoing tensions over collaborations with Pakistani artistes and national sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/hania-amir-was-signed-before-pahalgam-attack-diljit-dosanjh-sardaarji-3-makers-on-row-2746162-2025-06-25",
      "headline": "Pak actor was signed before Pahalgam attack: Sardaar Ji 3 makers on Hania Aamir rowAmid a raging controversy, the makers of 'Sardaar Ji 3', on Wednesday, clarified that Pakistani actor Hania Aamir was signed before the Pahalgam attack. The film is headlined by actor-singer Diljit Dosanjh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-5-direction-nearly-complete-chandan-kumar-2746166-2025-06-25",
      "headline": "Panchayat writer Chandan Kumar says direction for Season 5 is almost done'Panchayat' writer Chandan Kumar says the direction for Season 5 is almost done. The fourth season of the TVF series premiered on Prime Video on June 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-krishna-questioned-by-police-in-drug-abuse-case-2746165-2025-06-25",
      "headline": "After Srikanth's arrest, Tamil actor Krishna questioned by police in drug caseTamil actor Krishna was questioned by the police in connection with the ongoing drug abuse investigation. Earlier, actor Srikanth was arrested under four sections of the Narcotics Control Act. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-namaskar-from-space-says-thrilled-to-be-here-2746413-2025-06-26",
      "headline": "Like baby learning to walk: Shubhanshu Shukla describes his space debut in live callIn his first call from space, Indian astronaut Shubhanshu Shukla reflected on Wednesday's launch, calling the experience 'indescribable.' Greeting with a 'namaskar' from space, Shukla said he is getting used to zero gravity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-shanghai-meet-joint-statement-as-rajnath-singh-refuses-to-sign-document-sources-2746381-2025-06-26",
      "headline": "Rajnath Singh refuses to sign SCO document as Pak-China dilute terror standChina and its 'all-weather friend' Pakistan tried to divert the attention from terrorism in the SCO document, but Rajnath Singh firmly stood his ground on India's stand on terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/100-communist-lunatic-trump-rages-after-mamdani-wins-nyc-mayoral-primary-glbs-2746273-2025-06-26",
      "headline": "100% lunatic: Trump rages after Zohran Mamdani wins New York mayoral primaryDonald Trump launched a furious attack on Zohran Mamdani after the 33-year-old Democratic socialist won NYC's mayoral primary. Calling him a \"100% Communist Lunatic,\" he also mocked Mamdani's appearance and allies, while warning that Democrats are pushing the country toward extreme left politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-falls-to-death-from-13th-floor-while-filming-instagram-reel-during-late-night-party-2746411-2025-06-26",
      "headline": "20-year-old woman dies after falling from 13th floor while filming reel in BengaluruA 20-year-old woman died after falling from the 13th floor of an under-construction building in Bengaluru's Parappana Agrahara while filming a reel. She was partying with friends when the incident happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-operation-sindoor-israel-rising-lion-pakistan-iran-nuclear-site-strikes-five-similarities-explained-2746146-2025-06-26",
      "headline": "How India's Op Sindoor and Israel's Op Rising Lion were similar | 5 pointsFrom the idea of safeguarding the country and its people with aerial strikes inside enemy territory to a nuclear quotient, Israel's Operation Rising Lion had several similarities with India's Operation Sindoor. Trump's truce claims and ceasefire breaches in both cases were also uncannily similar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/muslim-women-khula-divorce-telangana-high-court-husband-consent-not-needed-2746408-2025-06-26",
      "headline": "Muslim woman's right to seek divorce absolute, husband's consent not needed: CourtIn its ruling, the High Court affirmed that a Muslim woman can unilaterally seek Khula, a divorce initiated by the wife, without her husband's consent or the involvement of religious bodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-khamenei-where-is-iran-supreme-leader-israel-conflict-nuclear-sites-trump-2746324-2025-06-26",
      "headline": "Where is Khamenei? Supreme Leader absent while Iran faces deadliest escalationAmid the deadliest escalation between Iran and Israel in decades, Supreme Leader Ayatollah Khamenei's week-long absence from public view has triggered anxiety in the Islamic nation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-supreme-court-constitution-parliament-judiciary-debate-bulldozer-justice-2746373-2025-06-26",
      "headline": "Constitution or Parliament, which is supreme? Chief Justice answers amid debateJustice Gavai, speaking at a felicitation event in his hometown, said all three wings of democracy - the executive, legislature and the judiciary - work under the Constitution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-reacts-to-criticism-of-speaking-only-about-punjab-not-india-says-cartier-stole-patiala-necklace-2746164-2025-06-26",
      "headline": "Diljit Dosanjh reacts to criticism of speaking only about Punjab, not IndiaDiljit Dosanjh got emotional while recalling how he represented Punjab at global events like the Met Gala, saying it was never about him but about showcasing his culture. He also addressed criticism for not speaking about India, stating, \"I am Punjabi, what can I say?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/traders-on-kanwar-yatra-route-must-display-their-names-on-every-shop-says-yogi-adityanath-2746409-2025-06-26",
      "headline": "Traders on Kanwar Yatra route must display their names on shop: Yogi AdityanathYogi Adityanath instructed officials to ensure that no open sale of meat takes place along the yatra route. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-gautam-gambhir-transition-dropped-catches-2746168-2025-06-26",
      "headline": "Transition no excuse: India needs to take World Test Championship seriouslyEngland vs India: India are a team in transition, and the Headingley Test can be seen as a minor blip in their journey as a side. However, transition cannot be used as an excuse for the poor display at vital moments in a game that India could have easily won."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/india-louis-vuitton-paris-pharrell-williams-prada-kolhapuri-ar-rahman-bijoy-jain-2746101-2025-06-25",
      "headline": "Prada ignored India. Louis Vuitton put it centre stage at Paris Fashion Week French luxury brand LV's creative director and rapper Pharrell Williams put on a show that openly celebrated India, a move that LV's contemporaries (hello, Prada) should certainly take cues from."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/axiom-4-mission-docking-live-updates-astronaut-shubhanshu-shukla-to-dock-with-iss-check-timing-live-coverage-2746400-2025-06-26",
      "headline": "LIVE: Shubhanshu Shukla calls home ahead of historic Space Station dockingShubhanshu Shukla to dock with ISS Live Updates: Indian astronaut Shubhanshu Shukla is all set to dock the Dragon spacecraft that he is piloting with the International Space Station. The Ax-4 crew has been orbiting Earth since their launch from Florida a day before, as they look forward to spending 14 days on the ISS. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/worlds-first-electric-passenger-flight-commercial-beta-air-taxi-revolution-unbelievable-price-india-2745815-2025-06-26",
      "headline": "Air travel will get super-cheap. A 35-minute flight just proved thatElectric air travel has officially arrived. The Alia CX300 aircraft flew 130 km from East Hampton to New York's JFK in just half an hour. The one-way, 35-minute trip, which cost passengers only $8 (around Rs 700), heralds a new era of cheap air travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-in-space-how-docking-will-happen-explained-by-ex-isro-scientist-2746062-2025-06-26",
      "headline": "Shubhanshu Shukla launched: Ex-Isro scientist explains space dockingThe Dragon's docking with the ISS is a sophisticated procedure that typically occurs 12–24 hours after launch, involving autonomous systems with human monitoring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/what-it-takes-to-make-love-last-after-60-2746066-2025-06-26",
      "headline": "What it takes to make love last after 60In between building a life and raising a family, do couples lose the script of how to grow old together? Experts say it is normal. It is not about chasing sparks but keeping the warmth alive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/navy-staffer-arrested-for-spying-for-pakistan-in-delhi-received-payments-via-crypto-2746301-2025-06-26",
      "headline": "Navy staffer arrested for spying for Pakistan, leaked critical info on Op SindoorThe accused was in regular contact with a Pakistani female handler, who allegedly lured him with money in exchange for critical strategic information from naval operations, on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-ukraine-journalist-question-war-with-russia-us-defense-system-2746383-2025-06-26",
      "headline": "Can see it's upsetting: Trump responds to Ukraine reporter's emotional questionA Ukrainian journalist's emotional question to Donald Trump on US air defence support drew a rare moment of empathy at the Nato summit, as her husband fights on Ukraine's frontlines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-must-apologise-remove-objectionable-scenes-mika-singh-pak-actor-hania-aamir-casting-sardaar-ji-3-2746294-2025-06-26",
      "headline": "Diljit must apologise, remove objectionable scenes: Mika Singh amid Sardaar Ji 3 rowSinger-rapper Mika Singh, in another post, said that he is willing to forgive Diljit Dosanjh if he apologises. He called him a 'fake' singer and lashed out at him for working with a Pakistani actor in 'Sardaar Ji 3'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bid-to-deflect-attention-from-atrocities-against-children-india-calls-out-paks-nefarious-agenda-at-un-meet-2746349-2025-06-26",
      "headline": "Bid to deflect attention: India calls out Pak's 'nefarious agenda' at UN meetIndian Ambassador called out Pakistan's efforts to shift focus were aimed at distracting from its own record of atrocities against children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-doubles-down-on-demand-for-digital-rolls-cctv-polling-footage-from-maharashtra-haryana-2746388-2025-06-26",
      "headline": "Congress doubles down on demand for digital rolls, polling footage from MaharashtraThe Opposition party was responding to the central poll body's request to meet Lok Sabha Leader of the Opposition Rahul Gandhi to iron out any confusion over last year's Maharashtra Assembly results."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/silver-dinner-plates-rs-5000-per-meal-maharashtra-government-event-sparks-row-2746180-2025-06-25",
      "headline": "'Silver dinner plates, Rs 5,000 per meal': Maharashtra government event sparks rowAn event hosted by the Maharashtra government has come under the scanner after guests were served meals on silver plates, despite the state facing strain. However, sources refuted claims of the government hosting a \"lavish\" party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-iran-and-daddy-drama-nato-summit-gets-weird-glbs-2746262-2025-06-26",
      "headline": "Trump, Iran, and 'daddy' drama: Nato summit gets weirdNATO Secretary General Mark Rutte clarified he didn't call Donald Trump \"daddy,\" saying he used the term to explain how countries ask if the US will stay committed to NATO. Rutte praised Trump for his decisive strike on Iran's nuclear sites."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-gautam-gambhir-aakash-chopra-2746422-2025-06-26",
      "headline": "Why was Bumrah's participation not kept a secret? Aakash Chopra questions callAakash Chopra questioned why the Indian team management made Jasprit Bumrah's participation in the England series public. Bumrah is expected to play just three Tests against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-sports-hernia-surgery-recovery-rehab-captain-india-2746393-2025-06-26",
      "headline": "Suryakumar Yadav undergoes successful sports hernia surgery in GermanyIndia's T20I captain Suryakumar Yadav has undergone successful surgery for a sports hernia in his lower right abdomen, performed in Munich, Germany. He is expected to begin rehabilitation soon and lead India in upcoming T20I matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-new-big-three-wimbledon-john-mcenroe-2746382-2025-06-26",
      "headline": "Who could join Carlos Alcaraz, Jannik Sinner in new Big Three? John McEnroe revealsAmerican tennis legend John McEnroe has called for the emergence of a third standout player to join Carlos Alcaraz and Jannik Sinner in forming a new Big Three. He believes that a strong third contender would raise the level of competition and named three rising stars as potential candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/muaythai-athletes-bhavjot-kohli-shubham-nishad-bronze-senior-asian-muaythai-championship-2746374-2025-06-26",
      "headline": "Chhattisgarh Muaythai athletes Bhavjot and Shubham win bronze in AsiaYoung Muaythai talents from Chhattisgarh, Bhavjot Singh Kohli and Shubham Kumar Nishad, have made the state proud by winning bronze medals for India at the Senior Asian Muaythai Championship held in Vietnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-duckett-ollie-pope-outsmart-jasprit-bumrah-leeds-test-2746365-2025-06-26",
      "headline": "How Ben Duckett and Ollie Pope neutralised Jasprit Bumrah in 1st TestEngland vs India, 1st Test: Ben Duckett played a fantastic innings in Leeds to hand England a 1-0 lead in the 5-match Test series. Duckett's handling of Bumrah might turn out to be crucial in this Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ab-de-villiers-praise-rishabh-pant-twin-hundred-2746356-2025-06-26",
      "headline": "AB de Villiers gives honest verdict on Rishabh Pant's batting mindsetAB de Villiers shared his honest take on Rishabh Pant's fearless batting in the first Test against England at Leeds. Pant scored 134 and 118 in a losing cause, but his aggressive approach and twin tons helped him break a few batting records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-monterrey-through-to-round-of-16-bvb-win-jobe-bellingham-assist-2746334-2025-06-26",
      "headline": "Club World Cup: Inter, Monterrey through to Round of 16, BVB winInter, Monterrey and Borussia Dortmund have secured their spots in the Round of 16 stages of the FIFA Club World Cup after their respective wins in the final group-stage watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-1st-test-shubman-gill-captaincy-greg-chappell-2746312-2025-06-26",
      "headline": "Shubman Gill will only get better as Test captain: Chappell backs India skipperGreg Chappell has thrown his support behind Shubman Gill, saying the young opener showed encouraging signs in his first outing as India's Test captain. Despite the five-wicket defeat to England in Leeds, Chappell believes Gill has the temperament to evolve into a strong leader in the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-warns-india-after-england-record-chase-headingley-2746297-2025-06-26",
      "headline": "Michael Vaughan taunts Wasim Jaffer, predicts 4-0 England sweepFormer England captain Michael Vaughan, known for his spirited banter with former Indian opener Wasim Jaffer on X (formerly Twitter), didn't miss the chance to take a dig after India's five-wicket defeat in the first Test at Headingley. Seizing the moment, Vaughan not only poked fun at Jaffer but also revised his series prediction, calling for a 4-0 win in England's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-gautam-gambhir-transition-dropped-catches-2746168-2025-06-26",
      "headline": "Transition no excuse: India needs to take World Test Championship seriouslyEngland vs India: India are a team in transition, and the Headingley Test can be seen as a minor blip in their journey as a side. However, transition cannot be used as an excuse for the poor display at vital moments in a game that India could have easily won."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-monterrey-through-to-round-of-16-bvb-win-jobe-bellingham-assist-2746334-2025-06-26",
      "headline": "Club World Cup: Inter, Monterrey through to Round of 16, BVB winInter, Monterrey and Borussia Dortmund have secured their spots in the Round of 16 stages of the FIFA Club World Cup after their respective wins in the final group-stage watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-1st-test-shubman-gill-captaincy-greg-chappell-2746312-2025-06-26",
      "headline": "Shubman Gill will only get better as Test captain: Chappell backs India skipperGreg Chappell has thrown his support behind Shubman Gill, saying the young opener showed encouraging signs in his first outing as India's Test captain. Despite the five-wicket defeat to England in Leeds, Chappell believes Gill has the temperament to evolve into a strong leader in the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-warns-india-after-england-record-chase-headingley-2746297-2025-06-26",
      "headline": "Michael Vaughan taunts Wasim Jaffer, predicts 4-0 England sweepFormer England captain Michael Vaughan, known for his spirited banter with former Indian opener Wasim Jaffer on X (formerly Twitter), didn't miss the chance to take a dig after India's five-wicket defeat in the first Test at Headingley. Seizing the moment, Vaughan not only poked fun at Jaffer but also revised his series prediction, calling for a 4-0 win in England's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-gautam-gambhir-transition-dropped-catches-2746168-2025-06-26",
      "headline": "Transition no excuse: India needs to take World Test Championship seriouslyEngland vs India: India are a team in transition, and the Headingley Test can be seen as a minor blip in their journey as a side. However, transition cannot be used as an excuse for the poor display at vital moments in a game that India could have easily won."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}