{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-favours-administrative-allocation-spectrum-amid-elon-musk-ambani-showdown-2617515-2024-10-16",
      "headline": "No spectrum auction: Government after Elon Musk objects to Mukesh Ambani's pitchTelecom Minister Jyotiraditya Scindia has announced that India will follow the global trend of administrative spectrum allocation. The decision came after Starlink CEO Elon Musk objected to Ambani's Reliance Jio lobbying for the auction route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-53-percent-update-central-government-employees-can-expect-big-diwali-gift-2617350-2024-10-15",
      "headline": "DA hike update: Central government employees can expect big Diwali giftThe expected hike in DA would mean that over 1 crore central government employees and pensioners will receive their October salaries with the new DA rate, along with three months' worth of arrears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-mutual-fund-reduces-daily-minimum-sip-limit-to-rs-100-investment-tips-2617301-2024-10-15",
      "headline": "LIC Mutual Fund reduces daily minimum SIP limit to Rs 100Investors can now begin a SIP with just Rs 100 and in multiples of Re 1 thereafter for select schemes of LIC Mutual Fund (LIC MF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-review-should-you-buy-shares-after-its-listing-analyst-views-2617282-2024-10-15",
      "headline": "Hyundai IPO: Should you buy shares after its listing?While the buzz surrounding the IPO is palpable, many brokerages are urging investors to take a cautious approach. They advise looking at Hyundai's long-term growth potential rather than getting caught up in the excitement of quick listing gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-lower-amid-volatility-reliance-industries-ril-shares-down-2-percent-2617209-2024-10-15",
      "headline": "Sensex, Nifty end in red as metal and auto stocks pull markets downThe S&P BSE Sensex was down 152.93 points to close at 81,820.12, while the NSE Nifty50 lost 61.85 points to end at 25,066.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-review-investors-subscription-long-term-growth-not-listing-gains-experts-2617144-2024-10-15",
      "headline": "Hyundai IPO: Why investors should focus on long-term growth, not listing gainsHyundai Motor IPO: While Hyundai's IPO is undoubtedly generating excitement, experts are saying this is more of a marathon than a sprint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-day-1-check-latest-subscription-gmp-key-details-2617105-2024-10-15",
      "headline": "Hyundai IPO: Check latest subscription and GMP on Day 1Hyundai Motor India IPO: India's biggest public offering opened for subscription on Monday, looking to raise Rs 27,870.16 crore with an offer for sale of 14.22 crore shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-share-price-drops-q2-results-net-profit-investor-trading-strategy-brokerage-views-2617086-2024-10-15",
      "headline": "RIL shares dip 1% after Q2 results. What should investors do? Reliance Industries share price: The dip, driven by weaker-than-expected performance in its oil-to-chemicals (O2C) segment, has left investors and analysts contemplating their next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-subscription-latest-gmp-price-band-issue-size-subscribe-or-not-2617010-2024-10-15",
      "headline": "Hyundai IPO opens for subscription: Check GMP, price band, other key detailsHyundai Motor India IPO: The price band for the IPO has been set between Rs 1,865 and Rs 1,960 per share. Through this public offering, Hyundai aims to raise Rs 27,856 crore"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-scraps-zero-notice-policy-amid-talent-war-in-quick-commerce-zomato-swiggy-report-2617005-2024-10-15",
      "headline": "Blinkit scraps 'zero notice' policy amid talent war in quick commerce: ReportThe change in policy comes in response to growing competition in the quick commerce industry as Blinkit faces stiff competition from other players like Zepto, Flipkart, and Swiggy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-view-book-profit-or-hold-for-long-term-2617002-2024-10-15",
      "headline": "Garuda Construction and Engineering listing: Book profit or hold?Garuda Construction and Engineering listing: Despite a sluggish outlook in the grey market, which had indicated a flat or negative listing, the company surprised many with its strong opening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-gain-premium-rs-105-2616990-2024-10-15",
      "headline": "Garuda Construction and Engineering shares list at 10.5% premium at Rs 105Garuda Construction and Engineering IPO listing: The company's market debut has exceeded expectations, particularly given the flat to negative outlook in the grey market before the listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-close-to-surpassing-apple-worlds-most-valuable-company-market-value-stock-surge-2616986-2024-10-15",
      "headline": "Nvidia inches closer to overtaking Apple as world's most valuable companyNvidia share price: The latest stock jump pushed Nvidia's market value to $3.39 trillion, just shy of Apple's $3.52 trillion, but ahead of Microsoft's $3.12 trillion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-reliance-industries-hcltech-q2-results-cpi-retail-inflation-2616983-2024-10-15",
      "headline": "Sensex, Nifty gain in early trade, RIL shares drop after Q2 resultsThe S&P BSE Sensex was up 194.75 points at 82,167.80 at around 9:39 am, while the NSE Nifty50 was up 38.30 points to 25,166.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-limited-q2fy25-results-earnings-net-profit-revenue-2616792-2024-10-14",
      "headline": "RIL Q2 profit slips 5% to Rs 16,563 crore, still beats market expectationsRIL Q2 results: Reliance Industries beat street expectations in Q2 despite a 5% drop in profit, driven by strong digital and upstream growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcl-technologies-q2-fy25-net-profit-revenue-rs-12-interim-dividend-declared-2616703-2024-10-14",
      "headline": "HCLTech Q2 results: Net profit jumps 11% to Rs 4,235 crore, dividend declaredHCLTech declared another interim dividend of Rs 12 per share, taking the total interim dividend for the fiscal year so far to Rs 42 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-increases-549-per-cent-september-2616687-2024-10-14",
      "headline": "Retail inflation jumps to 9-month high of 5.49% in SeptemberFood prices saw an even more significant spike, with the Consumer Food Price Index (CFPI) recording a year-on-year inflation rate of 9.24%. Rural areas faced food inflation of 9.08%, while urban areas experienced an increase of 9.56%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-tomorrow-latest-gmp-price-band-brokerage-views-subscribe-or-not-2616672-2024-10-14",
      "headline": "Hyundai Motor IPO opens tomorrow: Check latest GMP, brokerage reviews and moreHyundai Motor India IPO: Priced between Rs 1,865 and Rs 1,960 per share, the IPO is expected to raise Rs 27,856 crore through an offer for sale of 14.2 crore shares, representing a 17.5% stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-update-sensex-600-points-nifty-above-25000-hdfc-wipro-reliance-industries-2616626-2024-10-14",
      "headline": "Sensex ends 600 points higher, Nifty gains; Wipro, HDFC Bank stocks rallyThe S&P BSE Sensex was up 591.69 points to 81,973.05 at the closing bell, while the NSE Nifty50 gained 163.70 points to settle at 25, 127.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/daron-acemoglu-simon-johnson-james-a-robinson-award-nobel-economics-prize-2616586-2024-10-14",
      "headline": "Daron Acemoglu, Simon Johnson, James A. Robinson awarded Nobel Economics Prize 2024Nobel Economics Prize 2024: This year's laureates provide valuable insights into how institutions are formed and their crucial role in fostering sustainable development and prosperity."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-chief-minister-oath-taking-ceremony-omar-abdullah-lg-manoj-sinha-national-conference-congress-2617569-2024-10-16",
      "headline": "Stage set for Omar Abdullah to take oath as Jammu and Kashmir Chief Minister Live UpdatesThe National Conference (NC) has invited INDIA alliance leaders to attend the oath-taking ceremony of Omar Abdullah as next Chief Minister of Jammu and Kashmir in Srinagar today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-favours-administrative-allocation-spectrum-amid-elon-musk-ambani-showdown-2617515-2024-10-16",
      "headline": "No spectrum auction: Government after Elon Musk objects to Mukesh Ambani's pitchTelecom Minister Jyotiraditya Scindia has announced that India will follow the global trend of administrative spectrum allocation. The decision came after Starlink CEO Elon Musk objected to Ambani's Reliance Jio lobbying for the auction route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/singapore-deploys-fighter-jets-escort-air-india-express-plane-after-bomb-threat-2617581-2024-10-16",
      "headline": "Singapore scrambled fighter jets after bomb threat on Air India Express flightSingapore Defence Minister Ng Eng Hen said that the two RSAF F-15SG jets escorted the Air India Express flight away from populated areas before it landed at the Changi Airport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shanghai-cooperation-organisation-sco-summit-begin-pakistan-islamabad-lockdown-heavy-security-external-affairs-minister-s-jaishankar-attendance-2617012-2024-10-15",
      "headline": "S Jaishankar, Shehbaz Sharif shake hands, exchange greetings in PakistanExternal Affairs Minister S Jaishankar landed in Pakistan today to attend the two-day SCO meet. It's the first time in nearly nine years that an Indian foreign minister has visited Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-row-sanctions-melanie-joly-justin-trudeau-universities-students-2617538-2024-10-15",
      "headline": "What actions can India take if Canada imposes sanctions? Shiv Aroor explainsCanada's Foreign Minister Mélanie Joly has suggested that \"everything is on the table\" when asked if Ottawa would consider imposing sanctions on India. If Canada imposes sanctions on India, New Delhi has these possible options to hurt Ottawa back."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-imran-khan-former-wife-jemima-goldsmith-social-media-post-solitary-confinement-dark-jail-cell-2617597-2024-10-16",
      "headline": "Imran Khan in dark jail cell, no calls to sons, claims ex-wife Jemima GoldsmithJemima Goldsmith's allegations against the Pakistan government come amid the ongoing two-day SCO Summit in Islamabad, which has drawn top leaders from member states and turned the capital city into a fortress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/johnson-johnson-baby-powder-cancer-connecticut-man-lawsuit-jury-2617570-2024-10-16",
      "headline": "Johnson & Johnson to pay $15 million to man who blamed baby powder for cancerThe jury in Fairfield County, Connecticut Superior Court also found that the company should pay additional punitive damages, which will be determined later by the judge overseeing the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-philadelphia-rally-election-campaign-ymca-song-dance-party-presidential-election-2617578-2024-10-16",
      "headline": "Trump turns poll rally to dance party, sways to favourite songs for 30 minutesOn Monday, Trump attended a Town Hall on Monday in Pennsylvania's Oaks suburb moderated by Republican South Dakota Governor Kristi Noem, who faced widespread criticism earlier this year for an incident she mentioned in her book about killing her pet dog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/are-dehydrated-vegetable-chips-a-healthy-snacking-option-2617561-2024-10-16",
      "headline": "Are dehydrated veggies a healthy snacking option?As India is undergoing a smart snacking revolution - witnessing a rise in demand for healthier snack options - dehydrated vegetable chips are also making their presence felt in the scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-polls-2024-aaditya-thackeray-shiv-sena-ubt-bjp-hindutva-eknath-shinde-2617558-2024-10-16",
      "headline": "Aaditya Thackeray slams BJP's Hindutva, calls Eknath Shinde 'contractor mantri'Aaditya Thackeray slammed the BJP's eagerness to inaugurate the Ram Temple in Ayodhya for electoral gains, while asserting that his party had visited the temple multiple times without politicising it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-maharashtra-waived-the-toll-on-light-vehicles-at-mumbai-entry-points-2617410-2024-10-15",
      "headline": "Why Maharashtra waived the toll on light vehicles at Mumbai entry pointsA long-standing demand, the waiver brings respite to motorists and commuters but detractors flag the timing ahead of elections"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-kamala-harris-donald-trump-american-celebrities-support-stand-2617454-2024-10-15",
      "headline": "Kamala Harris vs Donald Trump: Where top American celebrities standAs the 2024 presidential race intensifies, numerous top American celebrities with large fan bases are endorsing their preferred candidates, Kamala Harris and Donald Trump, for the top job in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-day-2-sco-summit-s-jaishankar-shehbaz-sharif-shanghai-cooperation-organisation-2617577-2024-10-16",
      "headline": "Day 2 of SCO summit in Pak: S Jaishankar to attend talks on trade, economy Live UpdatesAccording to Pakistan's Foreign Ministry, discussions will focus on economic cooperation, trade, environmental issues, and socio-cultural ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-predicted-in-tamil-nadu-karnataka-andhra-pradesh-kerala-bengaluru-chennai-depression-in-bay-of-bengal-2617579-2024-10-16",
      "headline": "Live: Schools, colleges shut in Chennai, Bengaluru today, showers likely in KeralaSqually weather with wind speeds reaching up to 60 km per hour (kmph) is likely over southwest and adjoining west-central Bay of Bengal, including along and off Tamil Nadu, Puducherry and south Andhra Pradesh coasts till October 17 as the well-marked low-pressure area over the southwest and adjoining southeast Bay of Bengal moved west to northwestwards and intensified into a depression on Tuesday evening. Meanwhile, schools in Bengaluru and Chennai will remain shut on Wednesday following the heavy rain forecast. Teams of National Disaster Response Force and State Disaster Response Force personnel have also been deployed in the city following the heavy rain forecast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-elections-2024-kalpna-soren-jmm-jharkhand-mukti-morcha-campaign-hemant-soren-2617563-2024-10-16",
      "headline": "Kalpana Soren's ascent: From newcomer to Jharkhand Mukti Morcha's key campaignerKalpana Soren's role as a campaigner for the Jharkhand Mukti Morcha (JMM) has made her a well-known name, and her influence has extended to the broader INDIA bloc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-warns-israel-to-boost-humanitarian-aid-into-gaza-or-risk-weapons-funding-2617508-2024-10-15",
      "headline": "US warns Israel to boost humanitarian aid into Gaza or risk weapons fundingThe US sent a letter to their Israeli counterparts as they saw a recent decrease in assistance reaching Gaza. The official said a similar letter sent by Blinken in April triggered a constructive response and \"concrete measures from the Israelis.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-khans-home-under-surveillance-with-247-police-patrol-ai-enabled-cctv-2617425-2024-10-15",
      "headline": "Salman Khan's home under surveillance with 24/7 police patrol, AI-enabled CCTVOver 60 plain-clothed policemen have been stationed around Bandstand and near Galaxy Apartments, as security cover for Salman Khan has been heightened."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-high-court-shouting-jai-shri-ram-inside-mosque-does-not-hurt-religious-feelings-2617450-2024-10-15",
      "headline": "Shouting 'Jai Shri Ram' inside mosque doesn't hurt religious feelings: High CourtThe two men had entered a local mosque in Karnataka and shouted \"Jai Shri Ram\" slogans. The court held that the said offence did not have any adverse effect on public order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-will-poll-go-haryana-way-for-bjp-mahayuti-shiv-sena-congres-haryana-explained-2617228-2024-10-15",
      "headline": "Will Maharashtra election go Haryana way for BJP? Explained in 3 pointsParties are gearing up for a fierce but complex electoral battle in Maharashtra, which votes on November 20. Will the BJP and its alliance partners see the Maharashtra election go the Haryana way? Here's the battle explained in three points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-pharmaceutical-firm-mitskind-healthcare-in-panchkula-gifts-15-cars-to-employees-ahead-of-diwali-2617556-2024-10-16",
      "headline": "Pharmaceutical firm in Haryana gifts 15 cars to employees ahead of DiwaliMitskind Healthcare, located in the Panchkula industrial area, awarded 13 Tata Punch vehicles and two Maruti Grand Vitara models to its top-performing staff members."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/advocate-seeking-enquiry-against-former-chief-justice-ranjan-gogoi-removed-from-court-2617297-2024-10-15",
      "headline": "Supreme Court calls security after tense scenes over plea naming ex-Chief JusticeThe Supreme Court rejected the advocate's petition and directed the removal of the former Chief Justice's name from the case before the matter could be heard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-news-air-quality-index-pollution-weather-condition-2617564-2024-10-16",
      "headline": "Delhi air quality improves to 'moderate' category after 2 days The Air Quality Index was recorded at 198, a notable improvement from the average index of over 200 witnessed over the past two days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/vishal-dadlani-schools-contestant-for-imitating-atif-aslam-on-indian-idol-15-2617591-2024-10-16",
      "headline": "Vishal Dadlani schools contestant for imitating Atif Aslam on Indian Idol 15In a recent promo for Indian Idol 15, singer Vishal Dadlani is seen scolding a contestant who mimics Atif Aslam's singing style. The season is judged by Vishal Dadlani, Shreya Ghoshal and Badshah.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayasurya-living-martyr-sexual-abuse-interrogation-allegations-2617594-2024-10-16",
      "headline": "Actor Jayasurya calls himself living martyr amid sexual abuse allegationsMalayalam actor Jayasurya was questioned by Thiruvananthapuram police, who recorded his statement on October 15. In an interaction with the media, he called himself a living martyr amid sexual misconduct allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/nick-jonas-runs-off-stage-at-prague-concert-after-man-aims-laser-at-him-2617590-2024-10-16",
      "headline": "Watch: Nick Jonas runs off stage at Prague concert after man aims laser at himNick Jonas ran off stage during a Prague concert after a laser was aimed at his head. Fans expressed concern, and the show resumed after the individual was removed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-mani-ratnam-new-film-suhasini-shares-update-2617582-2024-10-16",
      "headline": "Rajinikanth and Mani Ratnam to collaborate for a film? Suhasini shares updateIt was rumoured that Rajinikanth and Mani Ratnam were about to collaborate for a film after 33 years. Actor Suhasini Mani Ratnam shared an update regarding the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-launches-android-15-for-pixel-phones-what-is-new-2617593-2024-10-16",
      "headline": "Google launches Android 15 for Pixel phones: What is newThe much awaited Android 15 is finally here for the Google Pixel smartphones. The new OS brings a range of new features. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-launches-new-ipad-mini-with-a17-pro-chipset-says-it-supports-pencil-and-is-ai-ready-2617393-2024-10-15",
      "headline": "Apple launches new iPad Mini with A17 Pro chipset, says it supports Pencil and is AI-readyRumours hinted that Apple is getting ready to launch a new iPad. And today it is here. The company has launched new iPad mini, with its price in India starting from Rs 49,900. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/reviews/story/asus-proart-px13-review-one-of-the-best-laptops-in-the-market-for-creators-2617290-2024-10-15",
      "headline": "Asus ProArt PX13 review: One of the best laptops in the market for creatorsAsus ProArt PX13 is a well-rounded option for creators who need power, precision, and a display that makes their work shine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iqoo-13-likely-to-launch-in-first-week-of-december-2617268-2024-10-15",
      "headline": "iQOO 13 likely to launch in first week of December On December 5, iQOO is launching its flagship smartphone, iQOO 13, in India to compete fiercely with the OnePlus 13, both featuring Qualcomm's Snapdragon 8 series chipset."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-describes-test-cricket-in-one-word-before-ind-vs-nz-respect-2617595-2024-10-16",
      "headline": "Mohammed Siraj describes Test cricket in one word before IND vs NZ: 'Respect'Indian bowlers described their love for the 'red cherry' in a video posted by the BCCI on X. India face New Zealand for a three-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-first-test-day-one-bengaluru-weather-live-updates-chinnaswamy-stadium-2617585-2024-10-16",
      "headline": "IND vs NZ, 1st Test Day 1 Weather Updates: Rain threat to series openerIND vs NZ, 1st Test Day 1 Weather Updates: The opener to the India vs New Zealand series in Bengaluru is under serious threat from rain. Heavy rains have lashed the city over the last few days and it seems we could see a delayed start to the game on October 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-most-sixes-virat-kohli-9000-runs-ravichandran-ashwin-530-wickets-2617542-2024-10-16",
      "headline": "IND vs NZ: Rohit, Kohli, Ashwin on the brink of major milestones ahead of 1st TestIndia players Rohit Sharma, Virat Kohli and Ravichandran Ashwin are on the brink of shattering major milestones in the first Test against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-results-spain-reach-quarters-portugal-scotland-draw-2617580-2024-10-16",
      "headline": "Nations League: Spain thrash Serbia to reach quarters, Portugal held by ScotlandSpain has reached the quarterfinals of the UEFA Nations League with a commanding 3-0 win over Serbia on October 15, Tuesday. Portugal also edge closer to the knockout stages, despite being held to a 0-0 draw by Scotland. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-top-gear-australia-tour-preperation-batting-form-2617546-2024-10-16",
      "headline": "Can Virat Kohli hit top Test gear against New Zealand before flight to Australia?As India prepares to face New Zealand in the Bengaluru Test, all eyes are on Virat Kohli to finally click into his usual run-scoring form. After a lean run so far in 2024, the series offers a key opportunity for him to regain form ahead of the high-profile Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-tom-latham-bengaluru-test-rohit-sharma-virat-kohli-2617548-2024-10-16",
      "headline": "Tom Latham 'excited' to be full-time captain, says past experience to come in handyNew Zealand captain Tom Latham expressed excitement on being full time skipper for New Zealand ahead of India Test series set to begin from October 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-tuchel-agrees-deal-with-english-fa-to-be-england-manager-2617544-2024-10-15",
      "headline": "Thomas Tuchel signs contract to become new England manager: ReportsFormer Chelsea head coach Thomas Tuchel has signed a contract to become the new England manager, Sky Sports News reported on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-udita-highest-bid-day-1-womens-player-auction-2617527-2024-10-15",
      "headline": "India defender Udita attracts highest bid on Day 1 of women's player auctionIndian defender Udita Duhan emerged as the costliest buy at the Hockey India League women's auction after she was acquired by Shrachi Rarh Bengal Tigers for Rs 32 lakh on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-four-semi-finalists-aus-vs-sa-wi-vs-nz-2617514-2024-10-15",
      "headline": "Women's T20 World Cup: Four semi finalists confirmed after enthralling group stageThe four semi-finalists of the Women's T20 World Cup were confirmed after the end of the group stages of the tournament. Australia, New Zealand, West Indies and South Africa were the teams to qualify for the last four."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-form-test-cricket-2617512-2024-10-15",
      "headline": "India vs New Zealand: Can Tim Southee rediscover his mojo in Tests?Tim Southee is looking to rediscover form and his experience and past success in Indian conditions may prove crucial for New Zealand in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-west-indies-semifinals-england-knocked-out-hayley-matthews-qiana-joseph-2617503-2024-10-15",
      "headline": "West Indies knock England out of with a thumping win in DubaiWest Indies stormed into the T20 World Cup semi-finals with a dominant 6-wicket win over England, thanks to a blazing 102-run partnership between Qiana Joseph and Hayley Matthews that knocked England out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thomas-tuchel-agrees-deal-with-english-fa-to-be-england-manager-2617544-2024-10-15",
      "headline": "Thomas Tuchel signs contract to become new England manager: ReportsFormer Chelsea head coach Thomas Tuchel has signed a contract to become the new England manager, Sky Sports News reported on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-udita-highest-bid-day-1-womens-player-auction-2617527-2024-10-15",
      "headline": "India defender Udita attracts highest bid on Day 1 of women's player auctionIndian defender Udita Duhan emerged as the costliest buy at the Hockey India League women's auction after she was acquired by Shrachi Rarh Bengal Tigers for Rs 32 lakh on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-four-semi-finalists-aus-vs-sa-wi-vs-nz-2617514-2024-10-15",
      "headline": "Women's T20 World Cup: Four semi finalists confirmed after enthralling group stageThe four semi-finalists of the Women's T20 World Cup were confirmed after the end of the group stages of the tournament. Australia, New Zealand, West Indies and South Africa were the teams to qualify for the last four."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-form-test-cricket-2617512-2024-10-15",
      "headline": "India vs New Zealand: Can Tim Southee rediscover his mojo in Tests?Tim Southee is looking to rediscover form and his experience and past success in Indian conditions may prove crucial for New Zealand in the upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-west-indies-semifinals-england-knocked-out-hayley-matthews-qiana-joseph-2617503-2024-10-15",
      "headline": "West Indies knock England out of with a thumping win in DubaiWest Indies stormed into the T20 World Cup semi-finals with a dominant 6-wicket win over England, thanks to a blazing 102-run partnership between Qiana Joseph and Hayley Matthews that knocked England out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-t20i-sri-lanka-beat-west-indies-report-wellalage-spin-2617497-2024-10-15",
      "headline": "Wellalage spins a web as Sri Lanka hammer West Indies to level seriesSri Lanka hammered West Indies by 73 runs to level the T20I series 1-1, thanks to a stellar performance from their spinners on a turning pitch in Dambulla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-wi-2nd-t20i-pathum-nissanka-shamar-joseph-five-boundaries-2617493-2024-10-15",
      "headline": "Watch: Pathum Nissanka smacks Shamar Joseph for 5 consecutive fours in 2nd T20ISri Lanka batter Pathum Nissanka smashed Shamar Joseph for five consecutive boundaries during the second T20I against West Indies on Tuesday, October 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-wants-to-play-test-cricket-for-india-2617474-2024-10-15",
      "headline": "Sanju Samson wants to play Test cricket for IndiaIndia wicketkeeper Sanju Samson, after scoring a century in the third T20I against Bangladesh, has expressed his strong desire to play Test cricket for India, aiming to establish himself as an all-format player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-highlights-jasprit-bumrahs-threat-ahead-of-india-test-series-2617469-2024-10-15",
      "headline": "Pat Cummins highlights Jasprit Bumrah's threat ahead of India Test seriesAustralia captain Pat Cummins highlighted India fast bowler Jasprit Bumrah's threat ahead of the upcoming five-match Test series beginning from November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-kamran-ghulam-steve-smith-in-him-nasser-hussain-debut-century-2617447-2024-10-15",
      "headline": "Kamran Ghulam has a bit of Steve Smith in him: Nasser HussainNasser Hussain drew comparisons between Pakistan debutant Kamran Ghulam and Australia's Steve Smith after Ghulam's resilient century in the second Test against England. His composed 118-run knock steadied Pakistan after early trouble, showcasing impressive skill and determination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kamran-ghulam-babar-azam-pak-vs-eng-2nd-test-multan-2617436-2024-10-15",
      "headline": "Kamran Ghulam opens on replacing Babar Azam: Was determined to give my 110 percentPakistan batter Kamran Ghulam revealed that he was determined to give his 110% after replacing Babar Azam in the squad for the second Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-preview-predictions-weather-playing-11-2617420-2024-10-15",
      "headline": "IND v NZ, 1st Test: Will India reactivate sprint mode in rainy Bengaluru?India vs New Zealand: Rain seems to be following the Indian Test team. After they sprinted to victory in less than two days in Kanpur, rain is threatening to play spoilsport in the series opener in Bengaluru. All eyes on overhead conditions as India look to extend their dominance over the BlackCaps at home. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/denmark-open-2024-lakshya-sen-malvika-bansod-crash-out-in-first-round-2617414-2024-10-15",
      "headline": "Lakshya and Malvika make first-round exits, Sindhu advancesDenmark Open 2024: India's Lakshya Sen and Malvika Bansod made early exits from the Super 750 badminton tournament, suffering first-round defeats on Tuesday. Meanwhile, PV Sindhu moved into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-kamran-ghulam-steve-smith-in-him-nasser-hussain-debut-century-2617447-2024-10-15",
      "headline": "Kamran Ghulam has a bit of Steve Smith in him: Nasser HussainNasser Hussain drew comparisons between Pakistan debutant Kamran Ghulam and Australia's Steve Smith after Ghulam's resilient century in the second Test against England. His composed 118-run knock steadied Pakistan after early trouble, showcasing impressive skill and determination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kamran-ghulam-babar-azam-pak-vs-eng-2nd-test-multan-2617436-2024-10-15",
      "headline": "Kamran Ghulam opens on replacing Babar Azam: Was determined to give my 110 percentPakistan batter Kamran Ghulam revealed that he was determined to give his 110% after replacing Babar Azam in the squad for the second Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-preview-predictions-weather-playing-11-2617420-2024-10-15",
      "headline": "IND v NZ, 1st Test: Will India reactivate sprint mode in rainy Bengaluru?India vs New Zealand: Rain seems to be following the Indian Test team. After they sprinted to victory in less than two days in Kanpur, rain is threatening to play spoilsport in the series opener in Bengaluru. All eyes on overhead conditions as India look to extend their dominance over the BlackCaps at home. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/denmark-open-2024-lakshya-sen-malvika-bansod-crash-out-in-first-round-2617414-2024-10-15",
      "headline": "Lakshya and Malvika make first-round exits, Sindhu advancesDenmark Open 2024: India's Lakshya Sen and Malvika Bansod made early exits from the Super 750 badminton tournament, suffering first-round defeats on Tuesday. Meanwhile, PV Sindhu moved into the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mithali-raj-says-time-is-right-to-replace-harmanpreet-kaur-with-a-young-captain-2617368-2024-10-15",
      "headline": "Mithali Raj says time is right to replace Harmanpreet Kaur with a young captainFormer India captain Mithali Raj has recommended a leadership change following India's early exit from the 2024 Women's T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-babar-azam-on-kamran-ghulams-debut-test-century-2617366-2024-10-15",
      "headline": "Babar Azam's Instagram post for Kamran Ghulam's debut Test century goes viral Star Pakistan batter Babar Azam congratulated Kamran Ghulam for his sensational hundred on Test debut against England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}