{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-2025-high-sensex-ends-1000-points-higher-nifty-above-25500-tata-steel-gains-3-percent-2746581-2025-06-26",
      "headline": "Sensex ends 1,000 points higher, Nifty above 25,500; Tata Steel gains 3%The S&P BSE Sensex jumped 1,000.36 points to end at 83,755.87, while the NSE Nifty50 gained 304.25 points to close at 25,549.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-phones-to-partners-8-money-lessons-to-learn-before-30-2746518-2025-06-26",
      "headline": "From phones to partners: 8 money lessons to learn before 30Managing money isn't just about making budgets, it's about making better choices, every single day. CA Nitin Kaushik shares eight crucial money lessons that everyone should grasp by the age of 30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-ppf-nsc-rate-cut-government-review-june-30-investors-tip-2746530-2025-06-26",
      "headline": "Are your savings at risk? Government may slash PPF, NSC rates next weekSo far this year, interest rates for schemes such as Sukanya Samriddhi Yojana (SSY), Senior Citizens Savings Scheme (SCSS), and Post Office term deposits have remained unchanged. However, this may not continue in the next quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/housing-sales-india-quarter-2025-trends-high-prices-buyers-wait-2746520-2025-06-26",
      "headline": "Housing sales drop 20% across top 7 cities in Q2 2025 as prices stay highA sluggish Q2 masked early signs of recovery in India's housing market, with rising prices, cautious buyers, and skewed supply dampening sales—but softening rates and easing tensions may turn the tide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hiding-income-or-making-wrong-claims-your-itr-could-attract-a-200-percent-penalty-2746447-2025-06-26",
      "headline": "Hiding income or making wrong claims? Your ITR could attract a 200% penaltyThe recent changes in Income Tax Return (ITR) regulations highlight stricter penalties for incorrect filings, including a potential 200% penalty on false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-127-points-higher-nifty-above-25200-eternal-gains-1-percent-2746333-2025-06-26",
      "headline": "Sensex opens 127 points higher, Nifty above 25,200; Eternal gains 1%The S&P BSE Sensex was up 364.24 points to 83,119.75, while the NSE Nifty50 added 114.95 points to 25,359.70 as of 9:31 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-slams-diljit-dosanjh-amid-sardaar-ji-3-row-be-proud-of-where-you-were-born-2746576-2025-06-26",
      "headline": "Guru Randhawa slams Diljit Dosanjh amid row: Be proud of where you were bornSinger Guru Randhawa called out Diljit Dosanjh amid the ongoing controversy surrounding his upcoming film Sardaar Ji 3. As calls to ban the film grow, Randhawa shared a post, seen as a dig at Dosanjh, urging him to be proud of the country he was born in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-sreeleela-exits-akhil-akkineni-lenin-citing-date-conflicts-reports-2746436-2025-06-26",
      "headline": "Actor Sreeleela exits Akhil Akkineni's Lenin citing date conflicts: ReportsActor Sreeleela has quit 'Lenin' due to date conflicts after shooting some scenes. The unexpected exit could potentially delay the film's progress till a suitable replacement for the actor is finalised.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-krishna-peddler-kevin-arrested-in-drug-case-2746559-2025-06-26",
      "headline": "Tamil actor Krishna among two arrested in drug caseTamil actor Krishna has been arrested following questioning in the ongoing drug abuse investigation in Tamil Nadu. Earlier, actor Srikanth was also taken into custody by the Chennai police under the Narcotic Drugs and Psychotropic Substances (NDPS) Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rakhi-sawant-congratulates-hania-aamir-appreciates-diljit-dosanjh-for-sardaar-ji-3-2746510-2025-06-26",
      "headline": "Rakhi Sawant congratulates 'Hania Ameer', appreciates Diljit Dosanjh for Sardaar Ji 3Reality TV star Rakhi Sawant extended support to Pakistani actor Hania Aamir amid a raging controversy over her film 'Sardaar Ji 3.' Rakhi, not only congratulated Hania, who she referred to as 'Hania Ameer', on her Bollywood debut but also urged everyone to watch the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-wishes-ex-arjun-kapoor-with-a-white-heart-on-his-birthday-watch-2746548-2025-06-26",
      "headline": "Malaika Arora wishes ex Arjun Kapoor with white heart on his birthday. WatchMalaika Arora wished Arjun Kapoor, her ex-partner, on his 40th birthday. She shared an old Boomerang of the actor on her Instagram stories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-preparation-mythological-film-lord-karthikeya-trivikram-srinivas-naga-vamsi-2746531-2025-06-26",
      "headline": "Jr NTR begins prep for mythological film on Lord Karthikeya, here's proofJr NTR and his family were seen at Mumbai's Kalina airport on Thurdsay ahead of 'War 2' promotions. He was seen holding a book on Lord Karthikeya aka Muruga, hinting at his preparation for his upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-recruits-dancers-through-social-media-killin-it-girl-song-2746484-2025-06-26",
      "headline": "Did you know BTS J-Hope handpicked Killin' It Girl dancers via social media?In a recent video, it was revealed that BTS member J-Hope recruited the dancers through social media for his 'Killin' It Girl' music video. The music video was released on June 13. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-announces-genelia-dsouza-will-scare-all-in-his-next-film-police-station-mein-bhoot-praises-sitaare-zameen-par-2746524-2025-06-26",
      "headline": "RGV announces sweet-innocent Genelia will scare all in his next, praises SitaareDirector Ram Gopal Varma appreciated Genelia D'Souza's 'delightful' performance in 'Sitaare Zamee Par', and announced that she will be playing a 'scary' role in his next, titled 'Police Station Mein Bhoot'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sean-diddy-combs-declines-to-testify-as-prosecutors-drop-multiple-charges-2746418-2025-06-26",
      "headline": "Sean Diddy Combs declines to testify as prosecutors drop multiple chargesRapper Sean \"Diddy\" Combs' federal trial is set for its closing argument on June 26. Prosecutors have dropped multiple allegations apart from charges of sex trafficking and racketeering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/smita-patil-was-first-choice-but-rekha-was-perfect-umrao-jaan-muzaffar-ali-2746498-2025-06-26",
      "headline": "Smita Patil was my first choice, but Rekha was perfect as Umrao Jaan: Muzaffar AliFilmmaker Muzaffar Ali shares insights on casting Rekha over Smita Patil for 'Umrao Jaan'. The restored classic releases in cinemas, rekindling the timeless appeal and passion for cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shriya-pilgaonkar-compliments-alone-wont-get-you-work-other-factors-also-at-play-2746516-2025-06-26",
      "headline": "Shriya Pilgaonkar: Compliments alone won't get you work; other factors also at playActor Shriya Pilgaonkar discussed the challenges of sustaining a career in the entertainment industry. She also shared her ambition to break free from typecasting and emphasises the importance of being recognised as an actor beyond pap culture in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-denies-making-the-viral-virgin-wife-statement-calls-it-fake-content-2746505-2025-06-26",
      "headline": "Priyanka Chopra denies making the viral virgin wife statement, calls it fake contentActor Priyanka Chopra Jonas made a long note, clarifying that she never made the statement suggesting men shouldn't look for a virgin wife, which is going viral on social media. The 'Heads of State' star urged her fans to stay aware of the unverified news on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lijo-jose-pellissery-rubbishes-joju-george-non-payment-claims-for-churuli-cameo-shares-proof-2746495-2025-06-26",
      "headline": "Churuli director Lijo Jose rubbishes Joju George's non-payment claims, shares proofDirector Lijo Jose Pellissery responded to actor Joju George's allegations of non-payment for his cameo in 'Churuli', providing payment proof. He also explained the film's delayed theatrical release due to CBFC's A certificate and a related High Court order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ram-kapoor-admits-being-guilty-of-making-inappropriate-remarks-at-mistry-event-2746459-2025-06-26",
      "headline": "Ram Kapoor admits to making inappropriate remarks at Mistry eventActor Ram Kapoor admitted to making inappropriate remarks at a promotional event for his upcoming series 'Mistry'. He promised to change and apologised to those offended by his comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-teaser-ajay-devgn-takes-the-madhouse-of-laughter-to-scotland-2746472-2025-06-26",
      "headline": "Son of Sardaar 2 teaser: Ajay Devgn takes the madhouse of laughter to ScotlandAjay Devgn's 'Son of Sardaar 2' is set in Scotland. The actor shared the teaser for the film on social media on Thursday, with a glimpse of all the actors in the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-dating-rumours-with-vijay-varma-good-guys-exist-only-in-films-2746416-2025-06-26",
      "headline": "Actor Fatima Sana Shaikh breaks silence on dating rumours with Vijay VarmaActor Fatima Sana Shaikh said she's single and there is no one in her life as good guys exist only in films. Her statement came after dating rumours between her and actor Vijay Varma surfaced online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/f1-x-twitter-reviews-brad-pitt-film-is-worth-a-trip-to-cinemas-fans-call-it-outstanding-2746451-2025-06-26",
      "headline": "F1 X reviews: Brad Pitt's film is worth a trip to cinemas, fans call it outstandingJoseph Kosinski's 'F1' starring Brad Pitt has thrilled audiences worldwide with its high-octane action and immersive IMAX experience. The film promises adrenaline-pumping scenes and a cinematic treat for motorsport fans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/3bhk-trailer-siddharth-emotional-middle-class-tale-buying-a-house-sarathkumar-devayani-meetha-raghunath-sri-ganesh-2746445-2025-06-26",
      "headline": "3BHK trailer: Siddharth powers through emotional middle-class tale of buying a houseDirected by Sri Ganesh, '3BHK' is an emotional tale about a middle-class family of four and their wish to own a house in the city. The film stars Siddharth, Sarathkumar, Devayani and Meetha Raghunath in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-hrithik-roshan-jr-ntr-and-kiara-advanis-1st-look-posters-promise-power-and-action-2746415-2025-06-26",
      "headline": "War 2: Hrithik, Jr NTR and Kiara Advani's 1st look posters promise power and actionOn Thursday, the makers of 'War 2' unveiled the first-look posters of Hrithik Roshan, Jr NTR and Kiara Advani, showcasing them in fierce and commanding avatars. The film is set to hit theatres on August 14.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/axiom-4-mission-docking-live-updates-astronaut-shubhanshu-shukla-to-dock-with-iss-check-timing-live-coverage-2746400-2025-06-26",
      "headline": "LIVE: Shubhanshu Shukla's Dragon spacecraft on final approach to Space StationShubhanshu Shukla to dock with ISS Live Updates: Indian astronaut Shubhanshu Shukla is all set to dock the Dragon spacecraft that he is piloting with the International Space Station. The Ax-4 crew has been orbiting Earth since their launch from Florida a day before, as they look forward to spending 14 days on the ISS. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-cryptic-post-message-rift-party-leadership-bird-message-2746575-2025-06-26",
      "headline": "Even free bird must watch skies: Congress jabs Shashi Tharoor after cryptic postA day after Shashi Tharoor posted a cryptic message amid his rift with the Congress, party leader Manickam Tagore on Tuesday took a dig at the Thiruvananthapuram MP, saying that \"even a free bird must watch the skies\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-black-box-data-extraction-process-started-memory-module-successfully-accessed-investigation-bureau-2746512-2025-06-26",
      "headline": "Black box data downloaded in Air India crash probe breakthroughThese efforts aim to reconstruct the sequence of events leading to the accident and identify contributing factors to enhance aviation safety and prevent future occurrences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohram-mamdani-nyc-new-york-city-mayor-candidate-2020-old-viral-post-arya-rajendra-kerala-youngest-mayor-2746555-2025-06-26",
      "headline": "Who's Kerala's Arya Rajendran, cited by NYC's Mamdani in now-viral postZohran Mamdani, the son of Indian-American filmmaker Mira Nair, has emerged victorious in run for the New York City Mayor's post. In 2020, Mamdani shared a CPM Puducherry post on Arya Rajendran to talk about what the NYC Mayor should be like. Who's Rajendran, and what does the 5-year-old post signify?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-shanghai-meet-joint-statement-as-rajnath-singh-refuses-to-sign-document-sources-2746381-2025-06-26",
      "headline": "Rajnath Singh refuses to sign SCO document as Pak-China snub PahalgamChina and its 'all-weather friend' Pakistan tried to divert the attention from terrorism in the SCO document, but Rajnath Singh firmly stood his ground on India's stand on terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-namaskar-from-space-says-thrilled-to-be-here-2746413-2025-06-26",
      "headline": "Like baby learning to walk: Shubhanshu Shukla describes his space debut in callIn his first call from space, Shubhanshu Shukla said that this mission was 'a strong step forward for India's human space program and for the upcoming Gaganyaan mission.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-new-york-democrat-mayor-candidate-votes-whites-asians-blacks-2746578-2025-06-26",
      "headline": "Not only Asians, Whites also backed Zohran Mamdani despite racist attacksZohran Mamdani made history as the first Muslim nominee of the Democrats after former Governor Andrew Cuomo conceded the race on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/woman-held-after-driving-car-on-telangana-railway-tracks-causing-train-services-delay-for-45-minutes-2746502-2025-06-26",
      "headline": "Video: Woman drives car on Telangana railway tracks, trains delayed by 45 minutesA woman drove her car on the railway tracks near Shankarpalli in Telangana delaying train services between Bengaluru and Hyderabad by nearly an hour, triggering safety concerns and police action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/snake-oil-seller-to-communist-why-zohran-mamdani-mira-nair-son-facing-backlash-tsunami-democratic-primary-new-york-mayor-election-trump-2746442-2025-06-26",
      "headline": "Snake oil seller to 100% communist. Why Mamdani is facing backlash tsunamiZohran Mamdani is facing fierce backlash after his victory in New York's Democratic mayoral primary. Mamdani is the son of Indian-American filmmaker Mira Nair. Mamdani's critics include US President Donald Trump, New York City Mayor Eric Adams, as well as fellow Democrats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ivanka-trump-kim-kardashian-and-more-whos-on-jeff-bezoss-lavish-wedding-list-2746511-2025-06-26",
      "headline": "Ivanka Trump, Kim Kardashian, and more: Who's on Jeff Bezos's lavish wedding list?Among the 200 guests confirmed to be attending the wedding are Mick Jagger, Ivanka Trump, Jared Kushner, Oprah Winfrey, Katy Perry and Leonardo DiCaprio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdanis-wife-rama-duwaji-syrian-american-artist-2746554-2025-06-26",
      "headline": "Who is Rama Duwaji, Zohran Mamdani's wife and a Syrian American artist?Zohran Mamdani married his wife Rama Duwaji, a Syrian American artist, this year amid his rising political career. The couple met on Hinge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-reacts-to-criticism-of-speaking-only-about-punjab-not-india-says-cartier-stole-patiala-necklace-2746164-2025-06-26",
      "headline": "Diljit Dosanjh reacts to criticism of speaking only about Punjab, not IndiaDiljit Dosanjh got emotional while recalling how he represented Punjab at global events like the Met Gala, saying it was never about him but about showcasing his culture. He also addressed criticism for not speaking about India, stating, \"I am Punjabi, what can I say?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zohran-mamdani-nyc-mayor-kangana-ranaut-mira-nair-new-york-democratic-nominee-2746475-2025-06-26",
      "headline": "Now he's ready to wipe out Hinduism: Kangana Ranaut's swipe at Zohran MamdaniKangana Ranaut questioned New York mayoral nominee Zohran Mamdani's cultural identity after his primary win, accusing the Indian-American lawmaker of rejecting Hindu roots and sounding \"more Pakistani than Indian\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/visa-applicants-must-disclose-all-social-media-accounts-from-past-5-years-us-embassy-in-india-student-visa-2746478-2025-06-26",
      "headline": "Disclose all social media handles from past 5 years for visa: US Embassy in IndiaThe US Embassy in New Delhi has mandated visa applicants to disclose social media usernames from the past five years on the DS-160 form. Failure to do so might lead to visa denial and future ineligibility, it warned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-slams-diljit-dosanjh-amid-sardaar-ji-3-row-be-proud-of-where-you-were-born-2746576-2025-06-26",
      "headline": "Guru Randhawa slams Diljit Dosanjh amid row: Be proud of where you were bornSinger Guru Randhawa called out Diljit Dosanjh amid the ongoing controversy surrounding his upcoming film Sardaar Ji 3. As calls to ban the film grow, Randhawa shared a post, seen as a dig at Dosanjh, urging him to be proud of the country he was born in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/zero-dose-children-india-rise-covid19-immunisation-gap-2746541-2025-06-26",
      "headline": "Explained: Zero-dose children and why India ranks second globallyA Lancet report reveals over 1.44 million zero-dose children in India missing essential vaccines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/photo/kullu-cloudburst-flash-flood-water-level-destruction-2746375-2025-06-26",
      "headline": "Kullu cloudburst triggers flash floods, leaves trail of destruction in HimachalA sudden cloudburst and relentless rain in Himachal Pradesh's Kullu district have unleashed widespread devastation — washing away roads and bridges, damaging hydropower projects, and wrecking schools and homes. Several people are feared dead or missing, while tourists and locals remain stranded amid chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-operation-sindoor-israel-rising-lion-pakistan-iran-nuclear-site-strikes-five-similarities-explained-2746146-2025-06-26",
      "headline": "How India's Op Sindoor and Israel's Op Rising Lion were similar | 5 pointsFrom the idea of safeguarding the country and its people with aerial strikes inside enemy territory to a nuclear quotient, Israel's Operation Rising Lion had several similarities with India's Operation Sindoor. Trump's truce claims and ceasefire breaches in both cases were also uncannily similar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indigo-passenger-confronts-man-stealing-hiding-life-jacket-in-his-bag-on-flight-viral-video-2746544-2025-06-26",
      "headline": "IndiGo passenger confronts man hiding life jacket in his bag on flight. Watch videoThe identity of the accused passenger remains unknown, and his face was intentionally blurred in the viral video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-khamenei-where-is-iran-supreme-leader-israel-conflict-nuclear-sites-trump-2746324-2025-06-26",
      "headline": "Where is Khamenei? Supreme Leader absent while Iran faces deadliest escalationAmid the deadliest escalation between Iran and Israel in decades, Supreme Leader Ayatollah Khamenei's week-long absence from public view has triggered anxiety in the Islamic nation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-falls-to-death-from-13th-floor-while-filming-instagram-reel-during-late-night-party-2746411-2025-06-26",
      "headline": "Bengaluru woman, 20, falls to death from 13th floor while filming reelA 20-year-old woman died after falling from the 13th floor of an under-construction building in Bengaluru's Parappana Agrahara while filming a reel. She was partying with friends when the incident happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/old-bridge-collapses-in-bihars-saharsa-after-overloaded-tractor-passes-over-it-2746562-2025-06-26",
      "headline": "Old bridge collapses in Bihar's Saharsa after overloaded tractor drives over itThe incident occurred in Ward No. 04 of Pama, as the tractor was passing over the old culvert built across a seasonal stream."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-vs-sa-tri-series-dewald-brevis-rassie-van-der-dussen-shukri-conrad-2746577-2025-06-26",
      "headline": "Dewald Brevis returns to T20I squad after two years for tri-series in ZimbabweAfter his heroics in the IPL 2025 season for CSK, Dewald Brevis has made a return to the South Africa squad for the tri-series against Zimbabwe and New Zealand. Brevis joined CSK as a replacement during the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mark-wood-jofra-archer-partnership-injury-return-2746563-2025-06-26",
      "headline": "ENG vs IND: Wood wants Archer linkup, but says duo won't get instant returnMark Wood said that he is eager to link up with Jofra Archer but admitted that the duo will take time to make a return to the England lineup. Archer and Wood are making a recovery from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-siraj-new-role-r-ashwin-jasprit-bumrah-birmingham-2746540-2025-06-26",
      "headline": "Be a cushion to Bumrah: R Ashwin asks Siraj to take new role in 2nd TestRavichandran Ashwin has come out and suggested that Mohammed Siraj take up the holding role in India's bowling attack and curb his usual attacking style, which had resulted in poor returns in the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-1st-test-shamar-joseph-ian-healy-sledging-2746506-2025-06-26",
      "headline": "After Shamar Joseph runs through Australia, Healy responds to sledge at pacerAfter Shamar Joseph ran through the Australian top order on Day 1 of the first Test between West Indies and Australia, Ian Healy commented on his sledge aimed at the youg pacer. Healy said he made the comments at Shamar after the West Indies pacer sent a warning to Sam Konstas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ecb-bcci-oppose-saudi-arabia-backed-t20-competition-2746486-2025-06-26",
      "headline": "England Cricket Board and BCCI join hands to scuttle ambitious Saudi T20: ReportThe England and Wales Cricket Board has joined forces with the Board of Control for Cricket in India in an attempt to thwart a new global Twenty20 league backed by Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-tickets-sold-out-sydney-odi-canberra-t20i-2746457-2025-06-26",
      "headline": "AUS vs IND: Tickets for Sydney ODI and Canberra T20I sold out in two weeksCricket Australia has announced that tickets for two matches in India's white-ball tour this November were snapped up within just two weeks of going on sale.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-india-november-19-revenge-australia-t20-world-cup-2024-2746469-2025-06-26",
      "headline": "Rohit reveals India wanted November 19 revenge on Australia in T20 World CupRohit Sharma revealed that the Indian team wanted to take revenge on Australia during the T20 World Cup 2024 after they were beaten by the Aussies in the final of the ODI World Cup 2023 in Ahmedabad on November 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-gautam-gambhir-aakash-chopra-2746422-2025-06-26",
      "headline": "Why was Bumrah's participation not kept a secret? Aakash Chopra questions callAakash Chopra questioned why the Indian team management made Jasprit Bumrah's participation in the England series public. Bumrah is expected to play just three Tests against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-sports-hernia-surgery-recovery-rehab-captain-india-2746393-2025-06-26",
      "headline": "Suryakumar Yadav undergoes successful sports hernia surgery in GermanyIndia's T20I captain Suryakumar Yadav has undergone successful surgery for a sports hernia in his lower right abdomen, performed in Munich, Germany. He is expected to begin rehabilitation soon and lead India in upcoming T20I matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-new-big-three-wimbledon-john-mcenroe-2746382-2025-06-26",
      "headline": "Who could join Carlos Alcaraz, Jannik Sinner in new Big Three? John McEnroe revealsAmerican tennis legend John McEnroe has called for the emergence of a third standout player to join Carlos Alcaraz and Jannik Sinner in forming a new Big Three. He believes that a strong third contender would raise the level of competition and named three rising stars as potential candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/muaythai-athletes-bhavjot-kohli-shubham-nishad-bronze-senior-asian-muaythai-championship-2746374-2025-06-26",
      "headline": "Chhattisgarh Muaythai athletes Bhavjot and Shubham win bronze in AsiaYoung Muaythai talents from Chhattisgarh, Bhavjot Singh Kohli and Shubham Kumar Nishad, have made the state proud by winning bronze medals for India at the Senior Asian Muaythai Championship held in Vietnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-india-november-19-revenge-australia-t20-world-cup-2024-2746469-2025-06-26",
      "headline": "Rohit reveals India wanted November 19 revenge on Australia in T20 World CupRohit Sharma revealed that the Indian team wanted to take revenge on Australia during the T20 World Cup 2024 after they were beaten by the Aussies in the final of the ODI World Cup 2023 in Ahmedabad on November 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-gautam-gambhir-aakash-chopra-2746422-2025-06-26",
      "headline": "Why was Bumrah's participation not kept a secret? Aakash Chopra questions callAakash Chopra questioned why the Indian team management made Jasprit Bumrah's participation in the England series public. Bumrah is expected to play just three Tests against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-sports-hernia-surgery-recovery-rehab-captain-india-2746393-2025-06-26",
      "headline": "Suryakumar Yadav undergoes successful sports hernia surgery in GermanyIndia's T20I captain Suryakumar Yadav has undergone successful surgery for a sports hernia in his lower right abdomen, performed in Munich, Germany. He is expected to begin rehabilitation soon and lead India in upcoming T20I matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-new-big-three-wimbledon-john-mcenroe-2746382-2025-06-26",
      "headline": "Who could join Carlos Alcaraz, Jannik Sinner in new Big Three? John McEnroe revealsAmerican tennis legend John McEnroe has called for the emergence of a third standout player to join Carlos Alcaraz and Jannik Sinner in forming a new Big Three. He believes that a strong third contender would raise the level of competition and named three rising stars as potential candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/muaythai-athletes-bhavjot-kohli-shubham-nishad-bronze-senior-asian-muaythai-championship-2746374-2025-06-26",
      "headline": "Chhattisgarh Muaythai athletes Bhavjot and Shubham win bronze in AsiaYoung Muaythai talents from Chhattisgarh, Bhavjot Singh Kohli and Shubham Kumar Nishad, have made the state proud by winning bronze medals for India at the Senior Asian Muaythai Championship held in Vietnam."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}