{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/investors-cautious-of-it-stocks-h-1b-visa-changes-psu-consumption-banking-gold-vs-equities-2792662-2025-09-24",
      "headline": "Should investors be cautious of IT stocks amid H-1B visa changes?With ongoing changes in visa fees and policies, analysts say the outlook for the sector has turned uncertain in the short run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/npci-rs-500-crore-profit-half-of-world-digital-payment-upi-transactions-2792595-2025-09-24",
      "headline": "How NPCI powers half the world's digital payments on just Rs 500 croreNational Payments Corporation of India handles 46% of the world's digital transactions. UPI alone processes 3,729 transactions per second. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-rs-1866-crore-productivity-bonus-for-railway-staff-2792634-2025-09-24",
      "headline": "Cabinet clears Rs 1,866 crore productivity bonus for railway staffRailway employees are in for festive cheer as the Union Cabinet has approved a productivity-linked bonus, benefiting lakhs of staff members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-have-two-credit-cards-here-is-what-you-need-to-know-2792617-2025-09-24",
      "headline": "Should you have two credit cards? Here's what you need to knowCredit card usage is on the rise in India, and many people are wondering if having a second card makes sense. From rewards to financial flexibility, here's what you should know before applying for another card."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-386-points-lower-nifty-below-25100-tata-motors-bel-among-top-losers-2792602-2025-09-24",
      "headline": "Sensex, Nifty end lower as profit booking continues; Tata Motors falls over 2%The S&P BSE Sensex fell 386.47 points to 81,715.63, while the NSE Nifty50 lost 112.60 points to close at 25,056.90. Broader market indices also ended lower, with sectoral breadth largely negative, except for pharma stocks, which managed modest gains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cashless-health-insurance-claim-rejection-key-reasons-explained-2792600-2025-09-24",
      "headline": "Why your cashless insurance claim isn't always 'cashless'Cashless claims promise convenience, but long delays, unclear policies, and unjust deductions often leave patients stressed. Understanding your rights and navigating the system proactively can prevent financial and medical headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-scss-ssy-are-small-saving-scheme-interest-rates-set-to-change-sukanya-samriddhi-yojana-public-provident-fund-2792534-2025-09-24",
      "headline": "PPF, SCSS, SSY: Are Small Saving Scheme interest rates set to change?As the September 30 announcement approaches, savers are wondering if interest rates on popular small saving schemes like PPF, SCSS, and Sukanya Samriddhi Yojana (SSY) will change. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-buy-gold-the-right-way-this-festive-season-2792466-2025-09-24",
      "headline": "How to buy gold the right way this festive seasonGold shopping is a festive tradition for many Indian families, but with rising prices and endless options, making the right choice can feel tricky. Here's how you can buy gold the right way this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-us-h1b-visa-fee-hike-trump-tariff-remittance-money-send-india-2792464-2025-09-24",
      "headline": "H-1B crackdown cracks the rupee. Know why INR hit an all-time lowEconomists estimate that remittances, the money Indians abroad send back, could drop by around $400 million. For a country that relies on foreign money flowing in, that's significant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-around-the-corner-union-cabinet-likely-to-approve-bonus-for-railways-employees-government-sources-2792463-2025-09-24",
      "headline": "Union Cabinet likely to clear bonus for railway staff soon: Government sourcesThe bonus, usually extended to non-gazetted railway employees, is meant to recognise their contribution to the efficiency and performance of one of India's most crucial transport networks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-2025-deadlines-rules-and-penalties-you-must-know-2792436-2025-09-24",
      "headline": "Income tax audit 2025: Deadlines, rules and penalties you must knowThe clock is ticking for taxpayers who fall under the audit bracket. With the income tax audit deadline for FY 2024–25 just around the corner, here's a quick look at key dates, rules, and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/confused-between-swiggy-and-eternal-stock-heres-what-experts-suggest-2792404-2025-09-24",
      "headline": "Confused between Swiggy and Eternal stock? Here's what experts suggestMarket experts say the two companies are in very different positions when it comes to earnings visibility and investor confidence. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-reacts-to-anurag-kashyap-vikramaditya-motwanes-ai-criticism-2792722-2025-09-24",
      "headline": "Sunny Leone reacts to Anurag Kashyap, Vikramaditya Motwane's AI criticism Actor Sunny Leone recently addressed the concerns around the use of artificial intelligence (AI) in cinema. She also highlighted the relevance of AI-driven cinema in the entertainment industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-anurag-kashyap-follow-saiyaara-playbook-for-nishaanchi-leads-aaishvary-thackeray-2792709-2025-09-24",
      "headline": "Exclusive: Did Anurag Kashyap follow Saiyaara playbook for Nishaanchi leads? In an exclusive chat with India Today, filmmaker-actor Anurag Kashyap revealed why he kept newcomers away from interviews ahead of 'Nishaanchi's' release. He praised Aaishvary Thackeray's impressive debut while brushing aside nepotism concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-anniversary-post-paris-2792604-2025-09-24",
      "headline": "Parineeti Chopra's playful anniversary wish for Raghav Chadha has a Paris twist Actor Parineeti Chopra wished her politician husband, Raghav Chadha, on their second wedding anniversary with a dash of humour. The reference to Paris in their social media post was unmissable. Check it out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-manoj-kumar-sharma-is-family-stood-by-me-at-national-film-awards-2792663-2025-09-24",
      "headline": "Vikrant Massey: Manoj Kumar Sharma is family, stood by me at National Awards Vikrant Massey's Best Actor win for '12th Fail' at the 71st National Film Awards was a heartfelt celebration shared with the real-life IPS officer, Manoj Kumar Sharma, who inspired the film. The actor, while rooted in portraying the common man, told us that he is eager to explore diverse roles and entertain audiences in new ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/urmila-jevliya-wins-rs-kbc-17-strategic-play-amitabh-bachchan-cricket-joke-indi-pakistan-2792517-2025-09-24",
      "headline": "KBC 17: Amitabh Bachchan jokes about Pakistanis smashing TVs after losing to India In the latest episode of 'Kaun Banega Crorepati 17', host Amitabh Bachchan entertained all with a joke about Pakistani fans after a cricket match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-enjoy-london-outing-with-son-akaay-viral-pics-2792633-2025-09-24",
      "headline": "Anushka Sharma, Virat Kohli enjoy London outing with son Akaay. See viral pics Anushka Sharma and Virat Kohli, who have been staying in London lately, were clicked enjoying strolling on the streets. The couple was accompanied by their son, Akaay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-one-piece-season-2-loguetown-grand-line-new-adventures-2026-2792383-2025-09-24",
      "headline": "One Piece Season 2: First look at Loguetown out crew sets sail for Grand Line Netflix teases new locations for 'One Piece' Season 2, beginning with Loguetown. Official synopsis highlights peril and discovery in the Grand Line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/honoured-to-share-national-award-with-shah-rukh-khan-hes-a-legend-actor-vikrant-massey-to-india-today-2792621-2025-09-24",
      "headline": "Vikrant Massey on National Award win: To be mentioned in same breath as SRK... Vikrant Massey celebrated his first National Award for '12th Fail', calling it a \"dream\" to share the honour with Shah Rukh Khan, who also won his first for 'Jawan'. The actor recalled a heartfelt moment with SRK and Rani Mukerji as they cherished their medals together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-ai-film-kaur-vs-kore-first-indian-ai-powered-feature-film-2792597-2025-09-24",
      "headline": "Exclusive: Sunny Leone sets trend with AI-driven feature film 'Kaur vs KORE' Sunny Leone is set to star in 'Kaur vs KORE', a pioneering AI-powered film. The movie blends futuristic technology with human emotions and highlights digital safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/main-hoon-nas-amrita-rao-recalls-shah-rukh-khans-advice-on-choosing-films-2792458-2025-09-24",
      "headline": "Main Hoon Na's Amrita Rao recalls Shah Rukh Khan's advice on choosing films Actor Amrita Rao shared valuable career advice she received from Shah Rukh Khan. She said on a recent podcast that the actor's philosophy guided her selective approach to signing films. What was his advice? Read on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-akaza-anime-backstories-2792169-2025-09-24",
      "headline": "How humanised backstories of demons made Demon Slayer a global hit Demon Slayer: Infinity Castle Part 1 – Akaza Returns' has become a global blockbuster, and one key reason is that it demonstrates not only the Demon Slayers' strength but also how demons reflect human vices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-restored-version-premiere-in-sydney-with-original-ending-as-centrepiece-2792545-2025-09-24",
      "headline": "Sholay restored version to premiere in Sydney with original ending as centrepiece The newly restored version of 'Sholay' will be screened as centrepiece at The Indian Film Festival of Sydney. The restoration includes the original ending and involved archival discoveries in London and Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-was-sad-after-saiyaara-fever-wiped-out-tanvi-the-great-2792495-2025-09-24",
      "headline": "Anupam Kher says he was sad after Saiyaara fever wiped out Tanvi: The Great Actor Anupam Kher recently opened up on being heartbroken over his directorial 'Tanvi: The Great' being sidelined by 'Saiyaara'. He revealed how he had to borrow money from friends after the financier backed out of the film at the last moment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/sai-pallavi-trolled-for-wearing-swimsuit-because-saree-girl-cant-be-a-beach-babe-2792544-2025-09-24",
      "headline": "Sai Pallavi trolled for wearing swimsuit, because saree girl can't be a beach babe Sai Pallavi was trolled for wearing a swimsuit on the beach, with fans unable to see beyond her saree-clad image. The outrage exposes society's hypocrisy, patriarchy, and the fragile idea of culture that refuses women the freedom to just be human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samyuktha-hedge-claims-baseer-ali-is-not-a-good-boyfriend-amid-bigg-boss-19-link-ups-2792515-2025-09-24",
      "headline": "Samyuktha Hedge claims Baseer is not a good boyfriend amid Bigg Boss 19 link-ups Actor Samyuktha Hegde called her rumoured boyfriend Baseer Ali a bad boyfriend. The Bigg Boss 19 contestant has recently been linked to Nehal Chudasama and Farrhana Bhatt on 'Bigg Boss 19'. However, that doesn't stop Samyuktha from supporting him in the reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manikandan-kalaimamani-award-tamil-nadu-actor-director-2023-2792529-2025-09-24",
      "headline": "Tamil actor Manikandan on his Kalaimamani win: We artistes work for recognition Tamil actor Manikandan has been awarded the prestigious Kalaimamani award by the Tamil Nadu government. The actor, in an exclusive interview with India Today, expressed happiness and a sense of responsibility upon receiving the honour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jimmy-kimmel-returns-late-night-tv-after-suspension-addresses-charlie-kirk-remarks-2792438-2025-09-24",
      "headline": "Jimmy Kimmel thanks fellow late night hosts for support during suspension Jimmy Kimmel resumes his late-night show following a week-long suspension over Charlie Kirk comments. Kimmel addresses the controversy, offers clarification and thanks supporters and critics alike. Fellow late-night hosts and public figures express solidarity, with Kimmel reflecting on broader reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mardaani-2-actor-vikram-singh-chauhan-reflects-on-leaving-law-to-pursue-acting-2792527-2025-09-24",
      "headline": "Mardaani 2 actor Vikram Singh Chauhan reflects on leaving law to pursue acting Actor Vikram Singh Chauhan recently reflected on his decision to quit law and pursue acting. In an exclusive interview, Chauhan recalled hiding his acting assignments from his parents initially. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/teja-sajja-hrithik-roshan-childhood-superhero-clean-mass-commercial-films-2792480-2025-09-24",
      "headline": "Teja Sajja reveals Hrithik Roshan was his childhood superhero, not Hollywood stars In an exclusive interview with India Today, Teja Sajja revealed that Hrithik Roshan was his childhood superhero, not Hollywood icons. He was recently seen in the Telugu superhero film, 'Mirai'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/protests-demanding-statehood-for-ladakh-turn-violent-bjp-office-vehicle-torched-2792622-2025-09-24",
      "headline": "4 dead, 70 injured as Ladakh's statehood protests turn violent, curfew imposedThe call for a shutdown came after two of 15 people on a hunger strike, led by climate activist Sonam Wangchuk, since September 10 were shifted to a hospital due to deteriorating health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kashmir-man-who-provided-logistical-support-to-pahalgam-terrorists-arrested-2792704-2025-09-24",
      "headline": "Kashmir man who provided logistical support to Pahalgam terrorists arrestedPolice have arrested Mohammad Yousuf Kataria, a 26-year-old resident of Kulgam, for providing logistical support to the terrorists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/cbse-to-conduct-class-10-12-board-exams-including-sports-and-supplementary-papers-from-feb-17-to-july-2026-2792727-2025-09-24",
      "headline": "CBSE to conduct Class 10, 12 board exams, including sports and supplementary papers, from Feb 17 to July 2026 CBSE to conduct Class 10, 12 board exams, including sports and supplementary papers, from Feb 17 to July 2026 "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-ashram-swami-chaitanyananda-saraswati-trail-of-abuse-threats-to-fail-obscene-messages-deleted-chats-2792586-2025-09-24",
      "headline": "Come to my room: Delhi godman's indecent messages to women he 'molested'Swami Chaitanyananda Saraswati reportedly summoned girls to his room late at night, threatened to reduce their marks or fail them if they did not comply, and lured some with promises of foreign trips."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/leh-protests-ladakh-statehood-sixth-schedule-bjp-office-torched-reason-gen-z-delay-statehood-explained-2792643-2025-09-24",
      "headline": "What sparked Gen Z protests in Ladakh? 5 pointsThe agitation for Ladakh's statehood and inclusion in the Sixth Schedule in the capital Leh turned violent on Wednesday. Four people were killed and over 70 injured. This came even as protesters torched a BJP office and a CRPF van. Activist Sonam Wangchuk has called the protests a \"Gen Z\" revolution. The BJP has slammed the Congress for the chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/gunman-opens-fire-at-dallas-ice-office-killing-and-wounding-several-before-taking-own-life-2792726-2025-09-24",
      "headline": "Gunman opens fire at Dallas ICE office, killing several before taking own lifeGunman opens fire at Dallas ICE office, killing and wounding several before taking own life"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/h1b-visa-wage-based-lottery-system-overhaul-key-changes-job-location-explained-2792695-2025-09-24",
      "headline": "How your wage, job site will play a role in Trump's new H-1B selection processThe Trump administration has proposed a major overhaul of the H-1B visa selection process, causing confusion and concern, especially among Indian techies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-death-fans-suspect-murder-wife-garima-saikia-trolled-saving-manager-is-going-too-far-explained-2792647-2025-09-24",
      "headline": "Don't post, just mourn: Trolls attack Zubeen Garg's wife, strangers fight for herGarima Saikia Garg, the grieving wife of singer Zubeen Garg, urged fans for patience and defended his manager Siddharth Sarma amid suspicions surrounding his death. Her video, meant as a plea for peace, sparked backlash, with many accusing her of neglect or defending those responsible. Now, Garima has found huge support online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/retreating-lion-dancing-dragon-rogue-hyena-the-chaotic-geopolitical-jungle-of-2025-2792142-2025-09-24",
      "headline": "Chaotic geopolitical jungle of 2025: Retreating Lion, Dancing Dragon, Reckless Bear, Rogue HyenaThe global geopolitical landscape in 2025 is a volatile multipolar arena marked by America's retreat, China's rise, and shifting alliances. India faces both challenges and opportunities in this unpredictable world order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-high-court-rejects-xs-plea-against-centres-takedown-orders-says-it-must-follow-indias-laws-2792627-2025-09-24",
      "headline": "X must follow Indian laws: High Court rejects plea against Centre's takedown ordersThe Karnataka High Court said that X must comply with the country's laws and clarified that the constitutional protection of free speech under Article 19 is available only to Indian citizens, not foreign entities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad live: Sarfaraz Khan to make a comeback?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/sai-pallavi-trolled-for-wearing-swimsuit-because-saree-girl-cant-be-a-beach-babe-2792544-2025-09-24",
      "headline": "Sai Pallavi trolled for wearing swimsuit, because saree girl can't be a beach babeSai Pallavi was trolled for wearing a swimsuit on the beach, with fans unable to see beyond her saree-clad image. The outrage exposes society's hypocrisy, patriarchy, and the fragile idea of culture that refuses women the freedom to just be human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-mourns-kannada-author-noevlist-sl-bhyrappas-death-2792703-2025-09-24",
      "headline": "Noted Kannada author SL Bhyrappa dies, PM Modi mourns 'fearless, timeless thinker'SL Bhyrappa, the eminent Kannada author, passed away at 94 in Bengaluru. His death has drawn heartfelt tributes from Prime Minister Modi, Karnataka Chief Minister Siddaramaiah, and literary figures nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelensky-ukraine-russia-war-india-donald-trump-address-to-united-nation-general-assembly-china-funding-2792454-2025-09-24",
      "headline": "India with us: Zelenskyy fact-checks Trump on Russia warUkrainian President Volodymyr Zelenskyy said \"India is mostly with Ukraine\", differing with his American counterpart, Donald Trump, who blamed New Delhi for \"funding Russia\". Zelenskyy also called for Europe's stronger ties with India to wean it off Russian energy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/successor-hardeep-singh-nijjar-inderjeet-singh-gosal-arrested-canada-illegal-firearm-charges-khalistan-sikhs-for-justice-gurpatwant-singh-pannun-2792514-2025-09-24",
      "headline": "Nijjar's successor, a Pannun aide, held in Canada for possession of illegal armsKhalistani extremist Inderjeet Singh Gosal has been arrested in Canada over illegal firearms' possession. An aide to designated terrorist Gurpatwant Singh Pannun, Gosal organised Khalistan referendum rallies in Canada. He previously faced assault charges linked to a 2024 temple attack. His rise followed the 2023 killing of Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-ai-film-kaur-vs-kore-first-indian-ai-powered-feature-film-2792597-2025-09-24",
      "headline": "Exclusive: Sunny Leone sets trend with AI-driven feature film 'Kaur vs KORE'Sunny Leone is set to star in 'Kaur vs KORE', a pioneering AI-powered film. The movie blends futuristic technology with human emotions and highlights digital safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-us-h1b-visa-global-race-indian-talent-uk-europe-canada-reality-check-immigration-2792531-2025-09-24",
      "headline": "Trump's H-1B move a lottery for UK, Europe? A reality check for Indian talentH-1B visa: After Trump's H-1B visa clampdown, several European nations are positioning themselves as a magnet for global talent. A closer look reveals that in many countries, immigration policies are becoming increasingly restrictive.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/honoured-to-share-national-award-with-shah-rukh-khan-hes-a-legend-actor-vikrant-massey-to-india-today-2792621-2025-09-24",
      "headline": "Vikrant Massey on National Award win: To be mentioned in same breath as SRK...Vikrant Massey celebrated his first National Award for '12th Fail', calling it a \"dream\" to share the honour with Shah Rukh Khan, who also won his first for 'Jawan'. The actor recalled a heartfelt moment with SRK and Rani Mukerji as they cherished their medals together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/trump-goes-after-h-1b-visa-indian-diaspora-ceos-make-an-unpleasant-statement-by-saying-nothing-2792718-2025-09-24",
      "headline": "Trump goes after H-1B visa, here is what Indian diaspora CEOs are sayingA lot of people have said many things about US President Donald Trump targeting H-1B visas. But one group, the group of Indian tech CEOs, is silent and their silence is now catching the attention of Indians on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-rubbishes-claims-of-aryan-khan-not-directing-the-bas-of-bollywood-2792432-2025-09-24",
      "headline": "Anya Singh rubbishes claims of Aryan Khan not directing The Ba***s of BollywoodAcor Anya Singh addressed criticism and rumours around Aryan Khan's directorial debut 'The Ba***s of Bollywood'. She commended Aryan's decision to work with young talent and his steadfast vision. The actor also opened up on the shocking climax of the Netflix series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/durga-puja-dampener-how-rain-battered-kolkata-is-coping-with-the-deluge-2792055-2025-09-23",
      "headline": "Durga Puja dampener? How rain-battered Kolkata is coping with the delugeAfter record-breaking overnight rain, Kolkata woke up to streets turned into lakes, traffic at a standstill and lives upended in the run-up to Durga Puja festivities\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/medical-student-suicide-maharashtra-academic-pressure-aiims-gorakhpur-2792546-2025-09-24",
      "headline": "A businessman earns as much: Medical student dies by suicide in MaharashtraA 20-year-old medical aspirant from Maharashtra died by suicide just hours before he was set to leave for his MBBS admission at AIIMS Gorakhpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-interview-world-athletics-championships-not-superhero-another-human-2792533-2025-09-24",
      "headline": "The Noah Lyles way: I am not a superhero, just another humanNoah Lyles is one of the fastest men on the planet, but his greatest skill isn't just sprinting. In this interview, following his triumphant Tokyo World Athletics Championships campaign, the American sprinter opens up about handling pressure, being an authentic role model, and the incredible support system that keeps him grounded."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-super-4-ind-vs-ban-live-score-suryakumar-yadav-litton-das-2792720-2025-09-24",
      "headline": "IND vs BAN Live Score, Asia Cup Super 4: Unbeaten India eye final spot India (IND) vs Bangladesh (BAN) Live Score, Asia Cup Super 4: India and Bangladesh are set to lock horns in the Super 4 stage of the Asia Cup 2025 in Dubai. Both teams are coming into the game having won their respective last fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-icc-t20i-batting-rankings-suryakumar-yadav-tilak-varma-2792688-2025-09-24",
      "headline": "Abhishek Sharma solidifies top spot, Tilak, Suryakumar rise in T20I batting rankings India's Abhishek Sharma retains his top position in the ICC T20I batting rankings after impressive Asia Cup 2025 performances. Apart from him, captain Suryakumar Yadav and Tilak Varma also gained one spot each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-focuses-cricket-asia-cup-2025-fighter-jet-gesture-controversy-2792644-2025-09-24",
      "headline": "Shaheen Afridi opens up on Pakistan's gestures vs India: Each have their own opinions Shaheen Afridi has downplayed criticism of Pakistan's on-field gestures during the Asia Cup clash against India. He emphasised the team's focus on cricket and their push for a place in the final amid ongoing controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shaheen-afridi-reacts-suryakumar-yadav-no-rivalry-india-vs-pakistan-comments-2792606-2025-09-24",
      "headline": "Shaheen Afridi shrugs Suryakumar Yadav's 'no rivalry' take: We'll see in the final Shaheen Afridi shrugged off Suryakumar Yadav's \"no rivalry\" comments, insisting the real verdict will come if India and Pakistan meet in the Asia Cup final. India defeated Pakistan twice in the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-laura-wolvaardt-south-africa-maiden-title-hopeful-2792608-2025-09-24",
      "headline": "Winning the Women's World Cup is a matter of when, not if: Laura Wolvaardt South Africa's women's cricket team is gearing up for their first ICC Women's ODI World Cup final. The Proteas are confident and well-prepared to face tough competition from top cricketing nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-a-vs-australia-a-failure-dhruv-jurel-nitish-kumar-reddy-flop-west-indies-test-squad-announcement-2792579-2025-09-24",
      "headline": "KL Rahul, Jurel falter vs Australia A ahead of India's West Indies Test squad reveal KL Rahul and Dhruv Jurel's early dismissals against Australia A in Lucknow have raised questions ahead of India's Test squad announcement for the West Indies series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/if-you-flop-for-pakistan-media-and-fans-are-after-you-hussain-talat-2792580-2025-09-24",
      "headline": "If you flop for Pakistan, media and fans are after you: Hussain Talat Pakistan's Hussain Talat revealed that the players can be under pressure from the media and the public if they do not perform for a couple of games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-u19-vs-aus-u19-vaibhav-suryavanshi-breaks-unmukt-chands-record-2792575-2025-09-24",
      "headline": "Vaibhav Suryavanshi breaks Unmukt Chand's record on maiden Australia tour Vaibhav Suryavanshi smashed his maiden half-century in Australia and broke Unmukt Chand's sixes record in Youth ODIs. He played a brilliant innings of 70 (68) and clobbered five fours and six sixes during his stay at the crease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-interview-world-athletics-championships-not-superhero-another-human-2792533-2025-09-24",
      "headline": "The Noah Lyles way: I am not a superhero, just another human Noah Lyles is one of the fastest men on the planet, but his greatest skill isn't just sprinting. In this interview, following his triumphant Tokyo World Athletics Championships campaign, the American sprinter opens up about handling pressure, being an authentic role model, and the incredible support system that keeps him grounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-ind-vs-pak-subtle-dig-india-pakistan-t20-dominance-haris-rauf-2792526-2025-09-24",
      "headline": "Irfan Pathan strikes cheeky dig at Pakistan, celebrates India's historic T20 feat Former India all-rounder Irfan Pathan took a playful swipe at Pakistan while celebrating India's landmark performance in T20 cricket, highlighting the team's long-standing dominance over their arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-struggles-batting-position-after-shubman-gill-return-t20is-2792192-2025-09-24",
      "headline": "Sanju Samson battles middle-order blues after Shubman Gill's T20I return Sanju Samson has found it tough to adjust to new batting roles after Shubman Gill's return to the top. The wicketkeeper batter is being made to strive hard to seal his place in the T20I side, despite having proven his worth as an opener in the lead-up to Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/if-you-flop-for-pakistan-media-and-fans-are-after-you-hussain-talat-2792580-2025-09-24",
      "headline": "If you flop for Pakistan, media and fans are after you: Hussain Talat Pakistan's Hussain Talat revealed that the players can be under pressure from the media and the public if they do not perform for a couple of games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-u19-vs-aus-u19-vaibhav-suryavanshi-breaks-unmukt-chands-record-2792575-2025-09-24",
      "headline": "Vaibhav Suryavanshi breaks Unmukt Chand's record on maiden Australia tour Vaibhav Suryavanshi smashed his maiden half-century in Australia and broke Unmukt Chand's sixes record in Youth ODIs. He played a brilliant innings of 70 (68) and clobbered five fours and six sixes during his stay at the crease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-interview-world-athletics-championships-not-superhero-another-human-2792533-2025-09-24",
      "headline": "The Noah Lyles way: I am not a superhero, just another human Noah Lyles is one of the fastest men on the planet, but his greatest skill isn't just sprinting. In this interview, following his triumphant Tokyo World Athletics Championships campaign, the American sprinter opens up about handling pressure, being an authentic role model, and the incredible support system that keeps him grounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-ind-vs-pak-subtle-dig-india-pakistan-t20-dominance-haris-rauf-2792526-2025-09-24",
      "headline": "Irfan Pathan strikes cheeky dig at Pakistan, celebrates India's historic T20 feat Former India all-rounder Irfan Pathan took a playful swipe at Pakistan while celebrating India's landmark performance in T20 cricket, highlighting the team's long-standing dominance over their arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-struggles-batting-position-after-shubman-gill-return-t20is-2792192-2025-09-24",
      "headline": "Sanju Samson battles middle-order blues after Shubman Gill's T20I return Sanju Samson has found it tough to adjust to new batting roles after Shubman Gill's return to the top. The wicketkeeper batter is being made to strive hard to seal his place in the T20I side, despite having proven his worth as an opener in the lead-up to Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad live: Sarfaraz Khan to make a comeback?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-focus-fitness-ishant-sharma-resilience-cricket-career-2792457-2025-09-24",
      "headline": "Virat Kohli was always focused, nothing affected his game, says Ishant SharmaIshant Sharma reveals how Virat Kohli had laser-like focus when on the field and nothing came in his way, including matters off the field when it came down to performing for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phil-salt-ipl-2025-final-child-birth-wife-decision-royal-challengers-bengaluru-kkr-2792459-2025-09-24",
      "headline": "Phil Salt on becoming a father and playing IPL final: Wife made the decisionPhil Salt returned to play the IPL 2025 Final immediately after becoming a father, thanks to his wife's push. He scored, took a brilliant catch, and helped RCB win their first-ever title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-squad-announcement-shubman-gill-bumrah-rishabh-pant-2792398-2025-09-24",
      "headline": "India vs West Indies: What to expect from Test squad for season's first home seriesIndia vs West Indies: India's squad for the two-Test series, starting on 2 October, will be announced on Wednesday. While Jasprit Bumrah is expected to make the cut, attention will be on Karun Nair as he bids to retain his place after a subdued comeback in England. It also remains to be seen whether Axar Patel will earn a recall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-joins-sydney-thunder-big-bash-league-debut-2792395-2025-09-24",
      "headline": "Ravichandran Ashwin set to play for Sydney Thunder in Big Bash League: ReportRavichandran Ashwin is reportedly set to join Sydney Thunder for his first Big Bash League stint. This move marks a significant moment as he becomes the first major Indian male cricketer to play in Australia's premier franchise tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-india-proposal-delegation-ahmedabad-2792386-2025-09-24",
      "headline": "Indian delegation presents proposal to host 2030 Commonwealth Games in AhmedabadIndia has formally submitted Ahmedabad's bid to host the 2030 Commonwealth Games. The proposal emphasises affordability, sustainability, inclusivity, and a lasting legacy for athletes and communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-bangladesh-super-4-litton-das-upset-shakib-al-hasan-2792380-2025-09-24",
      "headline": "Asia Cup 2025: Why India should be wary of underdogs Bangladesh in Super 4 clashAsia Cup 2025: India enter the Super 4 clash as clear favourites, but Bangladesh's history of upsets - from the 2007 World Cup to consecutive bilateral wins in 2015 and nail-biting finishes in Asia Cup finals - proves they can make even the giants sweat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-bangladesh-should-perform-well-super-4-aakash-chopra-2792374-2025-09-24",
      "headline": "Bangladesh should perform well vs India, they deserve better: Chopra on Super 4 clashBangladesh's resurgence in the Asia Cup 2025 sets up a fascinating Super 4 showdown against unbeaten India. With Aakash Chopra and coach Phil Simmons backing them, Litton Das's men enter the clash with renewed confidence and passionate support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-joins-sydney-thunder-big-bash-league-debut-2792395-2025-09-24",
      "headline": "Ravichandran Ashwin set to play for Sydney Thunder in Big Bash League: ReportRavichandran Ashwin is reportedly set to join Sydney Thunder for his first Big Bash League stint. This move marks a significant moment as he becomes the first major Indian male cricketer to play in Australia's premier franchise tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-india-proposal-delegation-ahmedabad-2792386-2025-09-24",
      "headline": "Indian delegation presents proposal to host 2030 Commonwealth Games in AhmedabadIndia has formally submitted Ahmedabad's bid to host the 2030 Commonwealth Games. The proposal emphasises affordability, sustainability, inclusivity, and a lasting legacy for athletes and communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-bangladesh-super-4-litton-das-upset-shakib-al-hasan-2792380-2025-09-24",
      "headline": "Asia Cup 2025: Why India should be wary of underdogs Bangladesh in Super 4 clashAsia Cup 2025: India enter the Super 4 clash as clear favourites, but Bangladesh's history of upsets - from the 2007 World Cup to consecutive bilateral wins in 2015 and nail-biting finishes in Asia Cup finals - proves they can make even the giants sweat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-bangladesh-should-perform-well-super-4-aakash-chopra-2792374-2025-09-24",
      "headline": "Bangladesh should perform well vs India, they deserve better: Chopra on Super 4 clashBangladesh's resurgence in the Asia Cup 2025 sets up a fascinating Super 4 showdown against unbeaten India. With Aakash Chopra and coach Phil Simmons backing them, Litton Das's men enter the clash with renewed confidence and passionate support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nashra-sandhu-6-gesture-haris-rauf-controversy-explained-2792370-2025-09-24",
      "headline": "Did another Pakistan bowler, Nashra Sandhu copy Haris Rauf's 6-0 gesture: ExplainedPakistan spinner Nashra Sandhu celebrated her six-wicket haul and 100th ODI wicket with a six-finger gesture. The pose has sparked debate about whether it was a celebratory act or a political statement amid India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-india-vs-bangladesh-super-4-preview-qualification-2792346-2025-09-24",
      "headline": "Asia Cup Super 4: India, a win away from final berth, face upbeat BangladeshAsia Cup IND vs BAN, Super 4 preview: The numbers are heavily in favour of India, but Suryakumar Yadav and his men are likely to face their sternest test of the tournament on Wednesday. Bangladesh, on the back of a morale-boosting win against Sri Lanka, will be keen on testing themselves against the best team in the world. Can Litton Das and his men produce an upset? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-under-pressure-vs-india-ishant-sharma-no-rivalry-2792333-2025-09-24",
      "headline": "Pakistan not at the same level as India, feel bad for them sometimes: Ishant SharmaIndia's dominance over Pakistan in the Asia Cup has reignited debates around the once-iconic rivalry. Ishant Sharma's remarks highlight how Pakistan's players buckle under fan pressure, unlike their past stars, raising questions about the current team's competitiveness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-predicted-playing-xi-asia-cup-super-4-clash-vs-bangladesh-2792229-2025-09-24",
      "headline": "India predicted XI for Super 4 clash vs Bangladesh: Will Jasprit Bumrah be rested?Asia Cup, India vs Bangladesh Super 4 predicted XI: During the opening round, India experimented with their line-up only once their place in the Super Four had been secured. Now, with the business end of the tournament approaching, the management are expected to retain the same combination for the clash against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-2025-win-super-4-race-final-qualification-scenario-2792299-2025-09-24",
      "headline": "Super 4 Qualification Scenario: Pakistan breathe back life in race for finalPakistan's five-wicket win over Sri Lanka has blown the Asia Cup 2025 Super 4 race wide open, leaving India, Pakistan, Bangladesh, and Sri Lanka in a tight battle for the spots in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-hussain-talat-asia-cup-win-sri-lanka-key-performance-press-conference-2792300-2025-09-24",
      "headline": "Hussain Talat eyes title after PAK beat SL: Two matches, trophy is oursPakistan all-rounder Hussain Talat hailed his team's five-wicket win over Sri Lanka in the Asia Cup Super Four, emphasising that players are regaining form and aiming for the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-alive-final-race-sri-lanka-knocked-out-2792296-2025-09-24",
      "headline": "Pakistan bounce back to hammer Sri Lanka, stay alive in final raceAsia Cup 2025: Pakistan overcame Sri Lanka in a tense and nervy chase to secure valuable points in the Super Four stage of the Asia Cup. After a disciplined bowling show, Pakistan chased down a 133-run target in just 18 overs in Dubai on Tuesday, September 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-suspends-usa-cricket-membership-governance-breaches-2028-olympics-2792282-2025-09-23",
      "headline": "ICC suspends USA cricket body over governance issuesThe International Cricket Council has suspended USA Cricket membership citing governance failures and reputational damage. The ICC will oversee US teams and guide reforms to protect cricket's future in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-abrar-ahmed-asia-cup-2025-duel-sri-lanka-pakistan-2792271-2025-09-23",
      "headline": "After war of celebrations, Hasaranga hugs it out with Pakistan's Abrar AhmedWanindu Hasaranga and Abrar Ahmed lit up the Asia Cup 2025 Super 4 clash on Tuesday with a playful duel of wickets and imitations, turning a tense low-scoring game into box-office theatre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-west-indies-test-squad-asia-cup-rest-2792260-2025-09-23",
      "headline": "No rest in Asia Cup, Jasprit Bumrah likely to be picked for West Indies TestsAsia Cup 2025: On the eve of India's Super Four match against Bangladesh in Dubai, assistant coach Ryan ten Doeschate hinted that Jasprit Bumrah will be included in the Test squad for the upcoming two-match series against the West Indies, starting on 2 October in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-request-break-test-cricket-fitness-concerns-west-indies-report-2792243-2025-09-23",
      "headline": "Shreyas Iyer requests break from red-ball cricket ahead of West Indies Tests: ReportShreyas Iyer has reportedly requested a break from red-ball cricket, writing to the Board of Control for Cricket in India (BCCI) to ask that he not be considered for Test matches for the time being, according to news agency PTI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abrar-ahmed-wanindu-hasaranga-bowling-restricts-sri-lanka-asia-cup-2025-2792228-2025-09-23",
      "headline": "Watch: Pakistan's Abrar Ahmed gives Wanindu Hasaranga a dose of own medicineAsia Cup 2025, PAK vs SL: Pakistan spinner Abrar Ahmed added a fun twist to the Super 4 clash against Sri Lanka by imitating Wanindu Hasaranga's signature celebration after dismissing him."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}