{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-466-points-nifty-below-25750-bel-jumps-4-2811380-2025-10-31",
      "headline": "Sensex, Nifty continue losing streak amid profit booking; BEL jumps 4%The S&P BSE Sensex closed 465.75 points lower at 83,938.71, while the NSE Nifty50 fell 155.75 points to 25,722.10. Selling pressure was broad-based, with most sectoral indices ending in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-crosses-full-subscription-on-day-1-qibs-drive-demand-2811374-2025-10-31",
      "headline": "Lenskart IPO crosses full subscription on Day 1; QIBs drive demandThe IPO opened today and closes on November 4. Lenskart has set a price band of Rs 382 to Rs 402 per share, with a lot size of 37 shares for retail bidders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-leads-indias-crypto-investments-in-q3-2025-report-2811359-2025-10-31",
      "headline": "Gen Z leads India's crypto investments in Q3 2025: ReportThe 18–25 age group has officially overtaken the 26–35 bracket as the most active investors in crypto. For them, digital assets are no longer a risky experiment — they're becoming part of a serious investment plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/from-groww-to-icici-amc-key-ipos-to-watch-this-november-2025-2811333-2025-10-31",
      "headline": "From Groww to ICICI AMC: Key IPOs to watch this November 2025Bengaluru-based investing platform Groww is set to launch its IPO worth Rs 6,632.3 crore. The issue includes a fresh issue of Rs 1,060 crore and an offer for sale of Rs 5,572.3 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/5x-income-rule-first-home-loan-affordability-2811330-2025-10-31",
      "headline": "Buying your first house? Check the 5x annual income rule and avoid EMI trapA rising number of first-time buyers are running the affordability math more cautiously. From the 5X income rule to avoiding EMI strain, housing decisions are shifting toward sustainability rather than stretch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hni-india-rebrands-as-kokuyo-workplace-india-targets-leadership-in-asia-by-2030-2811280-2025-10-31",
      "headline": "HNI India rebrands as Kokuyo Workplace India, targets leadership in Asia by 2030The rebranding marks a key step in Kokuyo's plan to make India a central hub for its Asia-Pacific operations. The move comes after Kokuyo's acquisition of HNI India earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-employees-letter-salaries-unpaid-beer-cafe-investors-2811262-2025-10-31",
      "headline": "Employees unpaid, control slipping: Bira 91's bad hangoverThe taps are dry, employees unpaid, and investors have taken charge. The question isn't how Bira 91 got here anymore. It's whether it can get out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-loan-vs-gold-overdraft-which-one-truly-saves-you-money-2811260-2025-10-31",
      "headline": "Gold loan vs gold overdraft: Which one truly saves you money?Gold loans and gold overdrafts both help unlock the value of your jewellery when you need cash fast. But they don't work the same way — and one could quietly cost you more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-aadhaar-to-bank-rules-7-key-financial-changes-starting-november-1-2811219-2025-10-31",
      "headline": "From Aadhaar to bank rules: 7 key financial changes starting November 1As November begins, a fresh set of financial rules will come into effect that could impact your daily money matters. From Aadhaar updates and bank nomination changes to new GST slabs and card fees — here's a quick look at what's changing from November 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/air-india-seeks-rs-10000-crore-support-from-tata-singapore-airlines-after-crash-report-2811203-2025-10-31",
      "headline": "Air India seeks Rs 10,000 crore lifeline from Tata, SIA after crash: ReportThe request comes at a sensitive moment for the airline, which has been trying to rebuild its reputation, modernise its ageing fleet and streamline operations since being taken over by the Tata Group in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meta-plans-record-30-billion-bond-sale-to-fund-costly-ai-push-2811194-2025-10-31",
      "headline": "Meta plans record $30 billion bond sale to stay ahead in AI rcaseThe move comes as Meta signals that its capital expenditure in 2026 will be \"notably larger\" than next year, underscoring how aggressively it is investing to stay ahead in the AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-2025-gmp-latest-price-band-and-should-you-apply-2811181-2025-10-31",
      "headline": "Lenskart IPO opens: Check GMP, price band, and should you apply?The total issue size is about Rs 7,278 crore, of which roughly Rs 2,150 crore is a fresh issue, while the rest is an offer for sale by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-future-outlook-precious-metals-volatility-rates-in-india-world-2811180-2025-10-31",
      "headline": "Gold prices shaky, silver steady. What next for precious metals?Gold is wobbling as the dollar strengthens, while silver holds firm on industrial demand cues. With central banks still buying and the Fed unpredictable, where do precious metals go next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-in-volatile-trade-ntpc-falls-over-25-2811165-2025-10-31",
      "headline": "Sensex, Nifty open flat in volatile trade; NTPC, Cipla among top losersAt around 9:24 am, the S&P BSE Sensex was up just 21.15 points at 84,425.61, while the NSE Nifty50 edged higher by 7.35 points to 25,885.20. Broader market indices also hovered marginally higher, mirroring the lack of conviction at the headline level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-remain-stable-will-prices-gain-after-us-fed-rate-cut-2810903-2025-10-31",
      "headline": "Gold and silver prices remain stable: Will prices gain after US Fed rate cut?Gold and silver prices steadied on Thursday after a choppy start, as investors weighed the impact of the US Federal Reserve's latest rate cut and awaited further clarity on global economic cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-ceo-umang-vohra-to-exit-in-2026-coo-achin-gupta-named-successor-2810838-2025-10-30",
      "headline": "Cipla CEO Umang Vohra to exit in 2026; COO Achin Gupta named successorThe company said Achin Gupta, currently Cipla's Global Chief Operating Officer (COO), will take over as CEO and MD from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/novo-nordisk-starts-bidding-war-with-pfizer-over-us-biotech-metsera-2810832-2025-10-30",
      "headline": "Novo Nordisk starts bidding war with Pfizer over US biotech MetseraNovo Nordisk bid up to $8.5 billion, including $6 billion upfront and later milestone payments. Pfizer's bid was worth $7.3 billion including milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-593-points-lower-nifty-below-25900-ril-down-1-percent-2810783-2025-10-30",
      "headline": "Sensex closes 593 points lower, Nifty below 25,900; RIL down 1%The S&P BSE Sensex lost 592.67 points to close at 84,404.46, while the NSE Nifty50 was down by 176.05 points to end at 25,877.85. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-celebrates-thamma-success-kids-are-my-best-critics-rashmika-mandanna-2811669-2025-10-31",
      "headline": "Ayushmann Khurrana celebrates Thamma's success: Kids are my best critics In an exclusive interaction with India Today, actor Ayushman Khurrana spoke about how his latest release 'Thamma' won the hearts of his children and became their favourite. The film also starring Rashmika Mandanna, released in theatres on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-malik-lashes-out-malti-chahar-after-she-calls-him-gutter-2811667-2025-10-31",
      "headline": "BB 19 Episode 69: Amaal Malik lashes out at Malti after she calls him gutter In the latest episode of 'Bigg Boss 19', Amaal Malik locks horns with Malti Chahar after she called him a gutter. On the other hand, Pranit More was declared the new captain of the house.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-nayanika-seal-their-love-in-a-dreamy-elegant-engagement-ceremony-allu-arjun-2811653-2025-10-31",
      "headline": "Allu Sirish and Nayanika's engagement is all about love, grace and family warmth Actor Allu Sirish shared pictures from his dreamy engagement with Nayanika. The event was attended by close friends and family members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-hand-that-rocks-the-cradle-maika-monroe-mary-elizabeth-winstead-on-chemistry-and-boundaries-2811624-2025-10-31",
      "headline": "The Hand That...: Maika Monroe, Mary Elizabeth Winstead on chemistry and boundaries In an exclusive interaction with India Today, 'The Hand That Rocks the Cradle' actors Maika Monroe and Mary Elizabeth Winstead spoke about their camaraderie and dynamics in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-indian-film-television-directors-association-condemns-mumbai-hostage-crisis-denies-rohit-arya-industry-link-2811599-2025-10-31",
      "headline": "Film and TV body condemns Mumbai hostage crisis, denies Rohit Arya's industry link The Indian Film & Television Directors' Association (IFTDA) issued a statement and denied Rohit Arya's links in the entertainment industry. The body stated that Arya is not affiliated with any recognised and registered body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-cena-to-shah-rukh-khan-will-never-forget-your-kindness-you-inspire-the-world-2811575-2025-10-31",
      "headline": "John Cena to SRK: Will never forget your kindness, you inspire the world WWE legend John Cena replied to Shah Rukh Khan with a special post on X. He thanked the superstar for his kindness and wrote how he continues to inspire the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/streaming-in-november-delhi-crime-3-to-stranger-things-5-whats-new-on-ott-2811477-2025-10-31",
      "headline": "Streaming in November: Delhi Crime 3 to Stranger Things 5, what's new on OTT November 2025 brings a powerhouse lineup of OTT releases – from 'Delhi Crime Season 3' and 'The Family Man 3' to 'Stranger Things 5'. Explore every major show and film premiering across Netflix, Prime Video, JioHotstar, SonyLIV, and more this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-taj-story-review-paresh-rawal-digs-deep-but-plot-collapses-halfway-through-2811476-2025-10-31",
      "headline": "The Taj Story review: Paresh Rawal digs deep, but plot collapses halfway throughRelease Date:Fri Oct 31, 2025 'The Taj Story', starring Paresh Rawal, tries to blend history, faith and courtroom drama, but ends up a confusing, poorly written mess that fails to deliver on any front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-viral-sabrina-carpenter-imitation-suhana-khan-laughter-2811498-2025-10-31",
      "headline": "Orry's hilarious Sabrina Carpenter spoof with Suhana Khan goes viral. Watch Social media sensation Orry shared a viral video impersonating Sabrina Carpenter, prompting laughter from Suhana Khan and widespread fan reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-hospitalised-for-routine-check-up-actor-team-says-hes-doing-fine-2811481-2025-10-31",
      "headline": "Dharmendra hospitalised for routine check-up, actor's team shares update Veteran actor Dharmendra has been hospitalised ahead of his 90th birthday and is currently under observation at Mumbai's Breach Candy Hospital for routine tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rm-bts-leadership-empathy-intellect-emotional-intelligence-2811261-2025-10-31",
      "headline": "How BTS' RM became the leader Gen Z needs right now In this week's K-fix, we discuss how BTS' RM redefines modern leadership with honesty, intellect, and empathy. From his thoughtful lyrics to his UN speech and solo album Indigo, RM proves that true leadership isn't about control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-cheers-jemimah-rodrigues-after-cricketer-opens-up-on-anxiety-2811416-2025-10-31",
      "headline": "Deepika Padukone cheers Jemimah Rodrigues after cricketer opens up on anxiety Indian cricketer Jemimah Rodrigues opened up about her anxiety during the Women's World Cup 2025 semifinal. Actor Deepika Padukone praised her for being vulnerable at a public forum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tears-songs-and-tributes-assam-bids-farewell-zubeen-garg-roi-roi-binale-2811419-2025-10-31",
      "headline": "Tears, songs, and tributes: Assam bids farewell to Zubeen Garg with Roi Roi Binale Assam bids an emotional farewell to Zubeen Garg as his final film, 'Roi Roi Binale', turns theatres into temples of remembrance. For fans, it's not just a movie, it's a last meeting with their legend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-spends-a-day-with-rescued-animals-at-mumbai-shelter-2811412-2025-10-31",
      "headline": "Aneet Padda spends a day with rescued animals at Mumbai shelter. Watch Aneet Padda's compassionate visit to Kanchan's Global Foundation highlights her love for animals and her message to support shelters making a difference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahima-chaudhry-sanjay-mishra-wedding-video-goes-viral-turns-out-to-be-movie-magic-2811391-2025-10-31",
      "headline": "Mahima Chaudhry-Sanjay Mishra's 'wedding' goes viral, turns out to be movie magic A video showing Mahima Chaudhry and Sanjay Mishra dressed as a bride and groom went viral on social media. The two actors feature together in an upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/brat-review-darling-krishna-promising-film-let-down-by-poor-outdated-execution-2811397-2025-10-31",
      "headline": "Brat review: Promising start, outdated finish for Darling Krishna's entertainerRelease Date:Fri Oct 31, 2025 The Kannada film 'Brat' starring Darling Krishna of 'Love Mocktail' fame is a template commercial film that entertains in bits but doesn't offer anything unique. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-conjuring-gets-prequel-after-last-rites-achieves-box-office-milestone-report-2811360-2025-10-31",
      "headline": "The Conjuring gets prequel after Last Rites achieves box office milestone: Report Paranormal investigators Ed and Lorraine Warren will return in a new prequel in 'The Conjuring' franchise. The popular horror universe is also all set to expand with a television series in the works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sharp-comeback-troll-questioning-his-stardom-proves-he-is-king-of-wit-2811369-2025-10-31",
      "headline": "SRK's sharp comeback to troll questioning his stardom proves he's the king of wit Shah Rukh Khan hosted an interactive session on X as he approached his 60th birthday, revealed updates on upcoming projects, and responded to a critical comment online with characteristic humour."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-defends-remarks-on-wife-usha-vances-faith-says-she-is-not-a-christian-and-has-no-plans-to-convert-2811616-2025-10-31",
      "headline": "Usha isn't converting: JD Vance hits back at critics, calls outrage bigotryThe Vice President's response followed intense criticism over his recent remarks at a university event, where he said he hoped his wife, Usha, might one day share his Christian faith. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-christianity-under-threat-nigeria-us-watch-list-2811677-2025-11-01",
      "headline": "Christianity under threat in Nigeria, says Trump, adds country to US watch listUS President Donald Trump warned that Christianity faces an existential threat in Nigeria and announced the country's return to the State Department's watch list for religious persecution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-raut-udhhav-sena-leader-health-update-pm-modi-well-wishes-speedy-recovery-2811579-2025-10-31",
      "headline": "Serious health issue, says Sanjay Raut; PM wishes him, he respondsSanjay Raut, a prominent face of Uddhav Thackeray's Shiv Sena (UBT) faction, will be temporarily absent from political activity in the coming weeks. Prime Minister Narendra Modi wished the senior leader a speedy recovery."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-sheeshmahal-chandigarh-6-flag-staff-road-delhi-aap-bhagwant-mann-punjab-2811352-2025-10-31",
      "headline": "Now, Sheeshmahal in Chandigarh for Arvind Kejriwal, claims BJP; AAP says not trueThe BJP has alleged that Arvind Kejriwal has been allotted a \"7-star luxury bungalow\" in Chandigarh by the Punjab government, reviving the 'sheeshmahal' controversy that centred on his previous Delhi residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/arun-khetarpal-pakistani-soldier-confession-1971-indo-pak-war-ikkis-agastya-nanda-basantar-tank-battle-history-2811014-2025-10-31",
      "headline": "I killed your son Lt Arun Khetarpal: Pak soldier's confession to Indian BrigadierSecond Lieutenant Arun Khetarpal, all of 21, blew up a series of Pakistani tanks before laying down his life for the country in the 1971 War. When Arun's father, Brigadier ML Khetarpal (Retd) visited Sargodha in 2001, he was hosted by a Pakistani soldier, Khwaja Mohammad Naser. Naser confessed that he was the one who pulled the tank trigger in 1971 that got his son killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/potential-terrorist-attack-over-halloween-weekend-averted-in-michigan-fbi-chief-kash-patel-2811574-2025-10-31",
      "headline": "Halloween terror attack averted in Michigan, multiple suspects arrestedThe FBI prevented a potential terrorist attack in Michigan over Halloween weekend, Director Kash Patel said on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-kidnapping-crisis-hostage-children-rohit-arya-big-story-5-points-powai-hostage-ra-studio-explained-2811321-2025-10-31",
      "headline": "What triggered Mumbai hostage crisis, who's Rohit Arya? Explained in 5 pointsMumbai witnessed a crisis with 19 people, including 17 children, taken hostage in a building by Rohit Arya. Police commandos stormed the Powai building after two hours of negotiations, shot Arya and rescued the people. This is what triggered the Mumbai hostage crisis and what Arya claimed pushed him to such a desperate act.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-hints-us-nuclear-testing-return-after-33-years-123456-2811678-2025-11-01",
      "headline": "You'll find out soon: Trump declines to say if US will test nuclear weaponsUS President Donald Trump hinted at resuming underground nuclear tests after over three decades, saying the US won't \"play by old rules\" while rivals expand their arsenals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/kamala-sohonie-iisc-first-woman-phd-biochemistry-nutrition-science-india-2811170-2025-10-31",
      "headline": "The student who stared Sir CV Raman down, became first Indian woman PhDDenied entry for being a woman, she didn't protest; she proved. And in doing so, she rewrote India's scientific story. Kamala Sohonie challenged gender bias to become the first Indian woman with a PhD in biochemistry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-lincoln-bathroom-renovation-white-house-restoration-2811676-2025-11-01",
      "headline": "Trump unveils Lincoln Bathroom makeover, says 1940s tiles were inappropriateUS President Donald Trump unveiled a renovation of the Lincoln Bathroom in the White House, replacing 1940s green tiles with black-and-white marble to reflect Lincoln-era aesthetics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-he-is-not-considering-strikes-in-venezuela-after-reports-claim-white-house-planning-an-attack-2811627-2025-10-31",
      "headline": "US not considering strikes in Venezuela: Trump after reports of military buildupTrump's remarks come weeks after a series of US air and maritime operations destroyed several suspected drug-smuggling vessels near Venezuelan waters, prompting speculation that Washington might extend its campaign to targets inside the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/nvidia-samsung-and-hyundai-chiefs-dine-in-seoul-fried-chicken-beer-chimaek-summit-pics-video-2811385-2025-10-31",
      "headline": "Bomb shots and fried chicken: Nvidia, Samsung and Hyundai chiefs' night outNvidia's Jensen Huang, Samsung's Lee Jae-yong and Hyundai's Chung Euisun had a great time when they met for fried chicken and beer at Kkanbu Chicken in the Gangnam district. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indus-waters-treaty-suspension-india-hit-pakistan-danger-agriculture-no-storage-reveals-report-2811246-2025-10-31",
      "headline": "Pak in acute danger, India's small change in Indus flow can hit agriculture: ReportPakistan's agriculture, which is heavily reliant on the Indus basin, is facing severe risks as even minor adjustments in India's dam operations could trigger widespread water shortages, revealed the IEP's the Ecological Threat Report 2025. It warned that Pakistan's dams could store just about 30 days of Indus flow, making any prolonged disruption potentially disastrous for agriculture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/marathi-actor-ruchita-jadhav-reveals-rohit-arya-invited-her-to-audition-for-film-based-on-hostage-crisis-2811444-2025-10-31",
      "headline": "Actor reveals Rohit Arya invited her to audition for film based on hostage crisisJadhav said Arya had contacted her in early October and even sent her the same RA Studio in Powai's location, but she cancelled their meeting due to family reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/h1b-roadblocks-rise-with-end-of-us-ead-extensions-indian-students-impact-2811292-2025-10-31",
      "headline": "US study-to-work path gets tougher. What now for Indian students on OPT?US has ended automatic EAD extensions for H-4 dependants, OPT students and asylum seekers. What does this mean for Indian students and tech workers hoping to study and work in America?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/pamela-colman-smith-the-forgotten-artist-behind-the-modern-tarot-died-penniless-2811458-2025-10-31",
      "headline": "Pamela Colman Smith, the forgotten artist behind the modern tarot, died pennilessPamela Colman Smith, an artist and mystic from the early 20th century, illustrated the iconic 1909 Rider-Waite tarot deck, the most famous tarot deck today. Yes, the woman behind the iconic images that are used both as a teaching tool and a cultural shorthand for tarot across the world today, died penniless and in obscurity, her art and belongings sold to cover debt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-waves-gamchha-grand-welcome-muzaffarpur-bihar-elections-viral-video-2811363-2025-10-31",
      "headline": "Why PM Modi's gamcha wave is making waves in poll-bound BiharModi in Bihar: This is not the first time that PM Modi was seen making this gesture. In August, the Prime Minister waved a gamcha at the crowd after the inauguration of the Aunta-Simaria bridge. What is the message behind it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/mumbai-powai-studio-hostage-taker-rohit-arya-lawyer-seeks-fir-over-encounter-by-police-calls-him-scape-goat-2811621-2025-10-31",
      "headline": "Lawyer seeks FIR over hostage-taker Rohit Arya's encounter, calls him scape goatLawyer Nitin S Satpute said that the police \"encountered the accused, Rohit Arya, under the garb of protecting the main accused in this matter, as accused Rohit Arya was just a scapegoat tainted by the police officers\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-make-me-pregnant-ad-fraud-contractor-goes-after-advertisement-loses-rs-11-lakh-in-return-2811625-2025-10-31",
      "headline": "Pune man goes after 'make me pregnant' online ad, loses Rs 11 lakh in returnThe incident has exposed links to a nationwide cyber racket known as the \"Pregnant Job\" or \"Playboy Service\" scam, which has been active across several states since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/india-is-taking-halloween-seriously-swiggy-blinkit-social-2811424-2025-10-31",
      "headline": "India is taking Halloween seriously, and the proof is everywhereHalloween wasn't always part of India's cultural calendar, yet suddenly it's everywhere — from malls and schools to bars and grocery apps. The question, however, remains – how?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-cup-2025-jemimah-rodrigues-best-fielder-award-india-win-2811536-2025-10-31",
      "headline": "Jemimah extends winning run, wins best fielder medal after historic Australia triumphJemimah Rodrigues dazzled with both bat and fielding brilliance as India sealed a famous win to reach the World Cup final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-ravi-kishan-receives-death-threat-unknown-caller-threatens-to-shoot-him-in-bihar-2811663-2025-10-31",
      "headline": "Will shoot him: Unknown caller threatens Ravi Kishan, BJP MP says not scaredThe caller, identifying himself as Ajay Kumar Yadav from Bihar, allegedly contacted the MP's personal secretary, Shivam Dwivedi, used abusive language and issued an explicit threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/ka-sengottaiyan-removed-from-aiadmk-after-meeting-expelled-leaders-panneerselvam-ttv-dhinakaran-2811474-2025-10-31",
      "headline": "KA Sengottaiyan removed from AIADMK after unity show with expelled leadersAIADMK expelled senior leader and former minister KA Sengottaiyan after he joined hands with expelled leaders O Panneerselvam and TTV Dhinakaran. He was previously removed from party positions after he called for party unity and criticised leadership under EPS."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-t20i-lahore-saim-ayub-faheem-ashaf-salman-mirza-level-series-2811673-2025-10-31",
      "headline": "PAK vs SA: Saim Ayub, Faheem Ashraf star as Pakistan crush South Africa in 2nd T20I Pakistan bounced back in style as Salman Mirza and Faheem Ashraf destroyed South Africa's batting before Saim Ayub's fluent fifty sealed a nine-wicket win, setting up a thrilling series decider in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and more The 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal difference East Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20I Afghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-womens-test-matches-multi-day-domestic-games-devajit-saikia-2811660-2025-10-31",
      "headline": "BCCI committed to increasing women's Test matches and multi-day domestic games BCCI secretary Devajit Saikia reaffirmed the board's commitment to expanding women's red-ball cricket, hinting at more Test matches and multi-day domestic tournaments as the next step in developing the game across all levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-wi-3rd-t20i-romario-shepherd-hat-trick-roston-chase-west-indies-3-0-sweep-2811658-2025-10-31",
      "headline": "Romario Shepherd hat-trick, Roston Chase heroics guide West Indies to 3-0 sweep West Indies wrapped up a 3-0 T20 series sweep over Bangladesh as Roston Chase and Ackeem Auguste hit rapid fifties, and Romario Shepherd claimed a stunning hat-trick to cap off a dominant display in the series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dabang-delhi-kc-clinches-pro-kabaddi-league-season-12-title-historic-home-victory-2811654-2025-10-31",
      "headline": "Dabang Delhi claim PKL season 12 title with thrilling win over Puneri Paltan Dabang Delhi K.C. clinched their second PKL title with a 31–28 win against Puneri Paltan in the Season 12 Final at Thyagaraj Indoor Stadium, Delhi. Delhi became the first home team since 2015 to win the Pro Kabaddi League in their own city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-womens-world-cup-final-ticket-update-dy-patil-stadium-2811649-2025-10-31",
      "headline": "Historic Women's World Cup final looms, but tickets still not on sale in Navi Mumbai Two days before India and South Africa meet in the Women's World Cup final, ticket sales have yet to be opened, leaving eager fans refreshing browsers and wondering when they'll finally get the chance to be part of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-south-africa-a-rishabh-pant-bat-flop-prenelan-subrayen-2811619-2025-10-31",
      "headline": "Rishabh Pant fails with bat on comeback, Test stars flop in Bengaluru Rishabh Pant made his return to competitive cricket with a disappointing outing for India A against South Africa in the first practice match in Bengaluru. Devdutt Padikkal and Sai Sudharsan also failed to make an impact as India were bowled out for 234, conceding a 75-run first-innings lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-viswanathan-anand-trophy-indian-grandmasters-2811610-2025-10-31",
      "headline": "Viswanathan Anand Trophy: FIDE World Chess Cup named after Indian great The FIDE World Chess Cup trophy, named the Viswanathan Anand Trophy, celebrates India's first Grandmaster, honouring his enduring legacy and the nation's rise as a global chess powerhouse. The World Cup will be held in Panjim from October 31 to November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-shubman-gill-t20i-consistency-yashasvi-jaiswal-bench-2811608-2025-10-31",
      "headline": "Gill needs to perform with Jaiswal being left on bench: Irfan Pathan Irfan Pathan said that Shubman Gill will need to start to score consistently in T20Is as he is keeping Yashasvi Jaiswal waiting in the bench for his chance. Gill was dismissed for 5 runs in the Melbourne T20I against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dabang-delhi-kc-clinches-pro-kabaddi-league-season-12-title-historic-home-victory-2811654-2025-10-31",
      "headline": "Dabang Delhi claim PKL season 12 title with thrilling win over Puneri Paltan Dabang Delhi K.C. clinched their second PKL title with a 31–28 win against Puneri Paltan in the Season 12 Final at Thyagaraj Indoor Stadium, Delhi. Delhi became the first home team since 2015 to win the Pro Kabaddi League in their own city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-womens-world-cup-final-ticket-update-dy-patil-stadium-2811649-2025-10-31",
      "headline": "Historic Women's World Cup final looms, but tickets still not on sale in Navi Mumbai Two days before India and South Africa meet in the Women's World Cup final, ticket sales have yet to be opened, leaving eager fans refreshing browsers and wondering when they'll finally get the chance to be part of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-south-africa-a-rishabh-pant-bat-flop-prenelan-subrayen-2811619-2025-10-31",
      "headline": "Rishabh Pant fails with bat on comeback, Test stars flop in Bengaluru Rishabh Pant made his return to competitive cricket with a disappointing outing for India A against South Africa in the first practice match in Bengaluru. Devdutt Padikkal and Sai Sudharsan also failed to make an impact as India were bowled out for 234, conceding a 75-run first-innings lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-viswanathan-anand-trophy-indian-grandmasters-2811610-2025-10-31",
      "headline": "Viswanathan Anand Trophy: FIDE World Chess Cup named after Indian great The FIDE World Chess Cup trophy, named the Viswanathan Anand Trophy, celebrates India's first Grandmaster, honouring his enduring legacy and the nation's rise as a global chess powerhouse. The World Cup will be held in Panjim from October 31 to November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-shubman-gill-t20i-consistency-yashasvi-jaiswal-bench-2811608-2025-10-31",
      "headline": "Gill needs to perform with Jaiswal being left on bench: Irfan Pathan Irfan Pathan said that Shubman Gill will need to start to score consistently in T20Is as he is keeping Yashasvi Jaiswal waiting in the bench for his chance. Gill was dismissed for 5 runs in the Melbourne T20I against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2nd-t20i-ashwin-gambhir-arshdeep-team-selection-controversy-2811606-2025-10-31",
      "headline": "Can't understand how Arshdeep misses out: Ashwin rips into Gambhir for MCG blunderRavichandran Ashwin has criticised Gautam Gambhir and the Indian team management for repeatedly benching Arshdeep Singh despite his stellar record. Ashwin insists Arshdeep deserves a permanent spot, calling him India's best T20 bowler after Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-south-africa-2nd-t20i-ball-by-ball-commentary-babar-azam-lahore-2811592-2025-10-31",
      "headline": "Pakistan vs South Africa, 2nd T20I Highlights from LahorePakistan put up a comprehensive display with the ball to down South Africa for a small target. Saim Ayub led their charge to ensure that they complete the chase without any hiccups. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-2nd-t20i-abhishek-sharma-press-conference-melbourne-2811591-2025-10-31",
      "headline": "Knew Harshit Rana can bat, he hits me for sixes in training: Abhishek SharmaIND vs AUS, 2nd T20I: Speaking to the press after hitting a fifty in India's defeat in Melbourne, opener Abhishek Sharma said he was not surprised to see Harshit Rana chip in with the bat. Abhishek also backed India to win the Women's World Cup on Sunday in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gavaskars-big-promise-will-sing-with-jemima-if-india-wins-world-cup-ytvd-2811581-2025-10-31",
      "headline": "Gavaskar's Big Promise: Will Sing With Jemima If India Wins World Cup!This special report focuses on the Indian women's cricket team's historic World Cup semi-final win against Australia, with insights from cricket legend Sunil Gavaskar on the stellar performances by Jemima Rodrigues and Harmanpreet Kaur. Mr. Gavaskar hailed the record-breaking chase, stating, 'It was exhilarating, absolutely, and thrilling, absolutely thrilling.' The analysis delves into Jemima Rodrigues' magnificent unbeaten century and her crucial partnership with Captain Harmanpreet Kaur that powered India to chase down a mammoth target of 339. Gavaskar highlights Jemima's all-round contribution, including critical fielding, and her mental fortitude, having been dropped earlier in the tournament. The report also covers Gavaskar's view that this victory signals the 'coming of age' for the team and his personal promise to sing a duet with Jemima if India lifts the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-india-vs-south-africa-womens-world-cup-final-prediction-2811572-2025-10-31",
      "headline": "Fanboy Abhishek Sharma backs India to win Women's World Cup final vs South AfricaWomen's World Cup 2025: Opener Abhishek Sharma backed India to beat South Africa in the grand final in Navi Mumbai. The batting star said that the men's team cricketers had followed the semi-final win over Australia from Melbourne, which hosted a T20I on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jemima-redefined-strength-it-requires-vulnerability-to-be-strong-dr-shyam-bhat-ytvd-2811539-2025-10-31",
      "headline": "Jemima redefined strength; it requires vulnerability to be strong: Dr. Shyam BhatPsychiatrist Dr. Shyam Bhat discusses the larger significance of cricketer Jemima Rodrigues' recent statements on mental health. Dr. Bhat states, 'she actually redefined what strength actually means...you should be in touch with your feelings. A certain vulnerability is required in order actually to be strong.' The conversation explores how Rodrigues represents a new generation that is more open about mental health challenges. Dr. Bhat also addresses why women are often more vocal about their struggles, the societal pressure on men to suppress vulnerability, and the shift in organisations towards valuing empathic leadership over traditional command-and-control structures. The interview highlights resilience, the importance of seeking support, and the changing narrative around mental wellness in India, both in sports and corporate life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-cup-2025-jemimah-rodrigues-best-fielder-award-india-win-2811536-2025-10-31",
      "headline": "Jemimah extends winning run, wins best fielder medal after historic Australia triumphJemimah Rodrigues dazzled with both bat and fielding brilliance as India sealed a famous win to reach the World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-reaction-josh-hazlewood-out-of-t20i-series-india-australia-2025-10-31-2811533-2025-10-31",
      "headline": "Abhishek Sharma's priceless reaction knowing Hazlewood will miss rest of T20I seriesAbhishek Sharma had a priceless reaction to knowing that Josh Hazlewood will miss the remainder of the T20I series against India. Hazlewood will start his preparations for the Ashes series, which will begin next month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-india-vs-south-africa-womens-world-cup-final-prediction-2811572-2025-10-31",
      "headline": "Fanboy Abhishek Sharma backs India to win Women's World Cup final vs South AfricaWomen's World Cup 2025: Opener Abhishek Sharma backed India to beat South Africa in the grand final in Navi Mumbai. The batting star said that the men's team cricketers had followed the semi-final win over Australia from Melbourne, which hosted a T20I on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jemima-redefined-strength-it-requires-vulnerability-to-be-strong-dr-shyam-bhat-ytvd-2811539-2025-10-31",
      "headline": "Jemima redefined strength; it requires vulnerability to be strong: Dr. Shyam BhatPsychiatrist Dr. Shyam Bhat discusses the larger significance of cricketer Jemima Rodrigues' recent statements on mental health. Dr. Bhat states, 'she actually redefined what strength actually means...you should be in touch with your feelings. A certain vulnerability is required in order actually to be strong.' The conversation explores how Rodrigues represents a new generation that is more open about mental health challenges. Dr. Bhat also addresses why women are often more vocal about their struggles, the societal pressure on men to suppress vulnerability, and the shift in organisations towards valuing empathic leadership over traditional command-and-control structures. The interview highlights resilience, the importance of seeking support, and the changing narrative around mental wellness in India, both in sports and corporate life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-cup-2025-jemimah-rodrigues-best-fielder-award-india-win-2811536-2025-10-31",
      "headline": "Jemimah extends winning run, wins best fielder medal after historic Australia triumphJemimah Rodrigues dazzled with both bat and fielding brilliance as India sealed a famous win to reach the World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-reaction-josh-hazlewood-out-of-t20i-series-india-australia-2025-10-31-2811533-2025-10-31",
      "headline": "Abhishek Sharma's priceless reaction knowing Hazlewood will miss rest of T20I seriesAbhishek Sharma had a priceless reaction to knowing that Josh Hazlewood will miss the remainder of the T20I series against India. Hazlewood will start his preparations for the Ashes series, which will begin next month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-criticises-india-benching-arshdeep-singh-t20i-loss-australia-2811517-2025-10-31",
      "headline": "Varun Aaron tears into India management for benching Arshdeep SinghFormer fast bowler Varun Aaron criticised India for not selecting Arshdeep Singh in the second T20I against Australia. The decision sparked debate as India lost by four wickets defending a low total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-mohsin-naqvi-bcci-icc-meeting-november-4-2811499-2025-10-31",
      "headline": "BCCI hopes Mohsin Naqvi returns Asia Cup trophy before ICC meeting on Nov 4BCCI secretary Devajit Saikia stated that the Indian cricket board would raise the matter at the International Cricket Council's quarterly meeting on 4 November should Asian Cricket Council (ACC) chairman Mohsin Naqvi fail to hand over the Asia Cup trophy prior to that date. India are yet to be presented with the silverware, despite more than a month having elapsed since the final on 28 September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semifinal-amol-muzumdar-whiteboard-message-2811489-2025-10-31",
      "headline": "A Ted Lasso touch: Amol Muzumdar's whiteboard message that inspired Team IndiaA few powerful words from the head coach's whiteboard fired up India's belief and sparked a semifinal masterclass against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-praises-josh-hazlewood-abhishek-sharma-india-australia-2nd-t20i-2025-10-31-2811471-2025-10-31",
      "headline": "AUS vs IND: Suryakumar doffs hat to Hazlewood, expecting Abhishek to continue formSuryakumar Yadav heaped praise on Josh Hazlewood for his performance against India in the second T20I. The Indian captain was also happy with Abhishek Sharma and the way he batted in Melbourne. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-2nd-t20i-varun-chakravarthy-abhishek-sharma-josh-hazlewood-2811439-2025-10-31",
      "headline": "India's 17-year Melbourne streak ends after batting flop in 2nd T20IIND vs AUS, 2nd T20I: Australia beat India by four wickets in the second T20I at Melbourne Cricket Ground to take a 1-0 lead in the five-match series. Josh Hazlewood was adjudged Player of the Match for his magnificent spell of 3/13 in four overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-injury-woes-isak-alisson-sidelined-aston-villa-premier-league-2811408-2025-10-31",
      "headline": "Liverpool without Alexander Isak, Alisson for crucial Aston Villa clashLiverpool will be without injured Alexander Isak and Alisson for the Premier League clash with Aston Villa, as Arne Slot's side seeks to recover from a disappointing spell that has left them seventh in the table."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}