{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-414-points-higher-nifty-above-26000-nptc-up-nearly-3-2810208-2025-10-29",
      "headline": "Sensex, Nifty end higher amid optimism over US Fed decisionThe S&P BSE Sensex rose 368.97 points to close at 84,997.13, while the NSE Nifty50 gained 117.70 points to settle at 26,053.90. Broader market indices also closed higher, with oil & gas and metal stocks leading the uptrend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/the-story-of-the-sons-in-tata-sons-2810204-2025-10-29",
      "headline": "The story of the sons in Tata SonsTata Sons Private Limited, established in 1917, is the principal holding company and promoter of the Tata Group, India's largest and one of the world's most respected conglomerates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-earn-3-4x-more-these-4-countries-are-actively-hiring-indians-2810133-2025-10-29",
      "headline": "Want to earn 3–4x more? These 4 countries are actively hiring IndiansSkilled Indians are catching the world's attention. An expert says that Germany, Japan, Finland and Taiwan — are actively hiring Indian professionals and offering salaries up to three to four times higher than those in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/despite-tax-implications-and-fema-why-are-nris-flocking-to-buy-homes-in-india-real-estate-investment-2810087-2025-10-29",
      "headline": "Why are NRIs flocking to buy homes in India?The transformation of India's real estate ecosystem has further strengthened this trust of the NRIs. Over the past decade, reforms such as the RERA improved project transparency, digitisation of land records and professionalisation of developers have collectively boosted buyer confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-cabinet-clears-terms-of-reference-what-does-this-mean-2810072-2025-10-29",
      "headline": "8th Pay Commission: Cabinet clears terms of reference. What does this mean?With the Cabinet approving the Terms of Reference for the 8th Central Pay Commission, the countdown begins for the next pay and pension revision that could reshape earnings for millions of central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-organised-farmstay-market-set-to-touch-rs-63000-crore-by-2029-2810035-2025-10-29",
      "headline": "India's organised farmstay market set to touch Rs 63,000 crore by 2029As city life grows more chaotic and polluted, many urban Indians are finding peace in the countryside. The growing shift towards wellness and greener living is now driving India's organised farmstay market to new heights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/it-big-tech-layoffs-severance-costs-ai-restructuring-2810028-2025-10-29",
      "headline": "The billion-dollar goodbye: Why global tech giants are spending more to let people goIn this deep-dive on global tech layoffs, we analyse severance costs, project realignments, and slowing demand cycles to understand why companies are standardising leaner headcounts and shifting toward automation-driven operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-rebound-slightly-ahead-of-us-fed-decision-check-latest-rates-2809995-2025-10-29",
      "headline": "Gold, silver prices rise slightly ahead of US Fed decision. Check latest ratesOn the Multi Commodity Exchange (MCX), Gold December futures were trading at Rs 1,19,755 per 10 grams at 9:43 am, up modestly from Tuesday's close. Silver December futures were quoted at Rs 1,44,768 per kg, also showing a slight uptick after recent losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-higher-tracking-asian-markets-us-fed-decision-in-focus-2809988-2025-10-29",
      "headline": "Sensex, Nifty open higher tracking Asian markets; US Fed decision in focusThe S&P BSE Sensex was trading 153.31 points higher at 84,781.47, while the NSE Nifty50 hovered just below the 26,000 level after briefly crossing it during early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-fall-sharply-should-you-buy-now-gold-prices-today-silver-prices-today-2809707-2025-10-29",
      "headline": "Gold and silver prices fall sharply. Should you buy now?With gold and silver prices falling sharply, investors are eyeing the market closely. Is now the right time to buy, or could prices dip further?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-to-cut-14000-jobs-in-biggest-ever-layoffs-amid-ai-driven-cost-cuts-glbs-2809914-2025-10-29",
      "headline": "Amazon to cut 14,000 corporate jobs amid company's AI push to slash costsAmazon will cut about 14,000 corporate jobs, its biggest layoffs since 2023, as it ramps up artificial intelligence investments and trims costs under CEO Andy Jassy's ongoing restructuring plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/apple-becomes-third-company-to-cross-4-trillion-dollar-market-value-2809787-2025-10-28",
      "headline": "Apple joins Microsoft, Nvidia in exclusive $4 trillion market-cap clubApple is now the third member of the $4 trillion market-cap club, joining Nvidia—currently valued above $4.5 trillion—and Microsoft, which re-entered the group following gains linked to its partnership with OpenAI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-slightly-lower-amid-volatility-and-profit-booking-2809612-2025-10-28",
      "headline": "Sensex, Nifty end slightly lower amid volatility and profit bookingThe S&P BSE Sensex slipped 75.11 points to close at 84,703.73 and the NSE Nifty50 fell 29.85 points to settle at 25,936.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/mehli-mistry-set-to-exit-tata-trusts-after-trustees-block-reappointment-2809599-2025-10-28",
      "headline": "Mehli Mistry set to exit Tata Trusts after trustees block reappointmentMehli Mistry, who joined both trusts in 2022, has been regarded as a close associate of the late Ratan Tata. The Sir Dorabji Tata Trust and the Sir Ratan Tata Trust together hold the largest shareholding in Tata Sons and play a central role in board nominations and governance across the Tata Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-terms-of-reference-for-8th-pay-commission-rollout-likely-from-january-2026-2809589-2025-10-28",
      "headline": "Cabinet clears terms of reference for 8th Pay CommissionInformation and Broadcasting Minister Ashwini Vaishnaw confirmed that the government has finalised the commission's composition, mandate and timelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/whats-driving-the-6-percent-rise-in-office-rentals-across-indias-major-cities-real-estate-prices-2809535-2025-10-28",
      "headline": "What's driving the 6% rise in office rentals across India's major cities?Average monthly office rentals increased from Rs 85 per sq. ft. in the first nine months of 2024 to Rs 90 per sq. ft. in the same period of 2025. Bengaluru saw the sharpest rise of about 9%, followed by steady gains in cities like Pune and Delhi-NCR."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/indian-refiners-halt-new-russian-oil-deals-await-clarity-amid-sanctions-2809532-2025-10-28",
      "headline": "Indian refiners halt new Russian oil deals, await clarity amid sanctions: ReportLast week, the US imposed new sanctions on Russia's two largest oil producers, Lukoil and Rosneft, expanding restrictions already in place from the European Union and the UK over the war in Ukraine. The fresh measures have forced Indian buyers to reassess supply routes and payment mechanisms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/peyush-bansals-lenskart-ipo-opens-on-october-31-heres-all-you-need-to-know-2809502-2025-10-28",
      "headline": "Peyush Bansal's Lenskart IPO opens on October 31. Here's all you need to knowPeyush Bansal-led Lenskart is set to hit the primary market on October 31 with its Rs 7,278 crore IPO. Backed by a strong brand presence and rapid expansion, the issue is among the most awaited listings of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/6-hidden-home-loan-traps-your-bank-wont-tell-you-expert-shares-smart-hacks-2809469-2025-10-28",
      "headline": "6 hidden home loan traps your bank won't tell you. Expert shares smart hacksBuying your dream home can quickly turn stressful when hidden costs and surprise clauses appear. From processing fees to \"mandatory\" insurance, a tax expert shares six practical hacks every borrower should know before signing their home loan papers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-series-crpf-officer-care-health-insurance-fight-autistic-son-treatment-2809453-2025-10-28",
      "headline": "How a CRPF officer fought insurer for his autistic son's treatmentSyam Krishna, a CRPF officer, was advised to hospitalise his autistic son when he fell ill. However, his insurer called it \"unnecessary\" and even raised questions on the family's claim history. This week's 'Claim Denied' story delves into how genuine policyholders are forced to fight for rightful care."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jungkook-jin-livestream-gaming-weverse-issues-eyesight-revelation-2810187-2025-10-29",
      "headline": "BTS' Jungkook jokes about streaming games, opens up on astigmatism BTS Jungkook's recent late-night livestream saw challenges with Weverse's game-streaming function, a candid health update, and playful interaction with Jin and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/down-cemetery-road-review-ruth-wilson-emma-thompson-suburban-meltdown-is-deliciously-twisted-2810113-2025-10-29",
      "headline": "Down Cemetery Road review: Ruth Wilson's suburban meltdown is deliciously twistedRelease Date:Wed Oct 29, 2025 Apple TV+ dropped the first two episodes of 'Down Cemetery Road' on October 29. With stellar turns by Ruth Wilson and Emma Thompson, this Oxford-set thriller promises an addictive ride for viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exclusive-bb19-producer-on-salman-khan-rs-150-crore-salary-buzz-alleged-biases-2810168-2025-10-29",
      "headline": "Exclusive: BB19 producer on Salman Khan's Rs 150-crore salary buzz, alleged biases 'Bigg Boss 19' producer Rishi Negi opened up about long-standing allegations of Salman Khan's bias on the reality show, addressing whether the host is guided by the makers during weekend episodes. In an exclusive chat with India Today, Negi explains how Salman personally reviews footage, forms his own opinions, and collaborates with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/juhi-chawla-daughter-jahnavi-mehta-ipl-2810151-2025-10-29",
      "headline": "Juhi Chawla's daughter Jahnavi Mehta on IPL thrills and phuchka promises Jahnavi reveals she nurtured sporting dreams growing up and was never really drawn to the film industry despite being Juhi Chawla's daughter"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-51-nominations-heat-up-as-bharani-and-srija-make-a-comeback-2810098-2025-10-29",
      "headline": "Bigg Boss Telugu 9 Day 51: Nominations heat up as Bharani and Srija make a comeback The week inside the 'Bigg Boss Telugu 9' house turned intense as Bharani and Srija re-entered amid high anticipation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/harshvardhan-rane-milap-zaveri-hint-next-film-ek-deewane-ki-deewaniyat-2810099-2025-10-29",
      "headline": "Harshvardhan Rane hints another film with Milap Zaveri. Director responds After 'Ek Deewane Ki Deewaniyat', actor Harshvardhan Rane is likely to collaborate with director Milap Zaveri again. The duo hinted at the upcoming project on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/billion-dollar-srk-ronaldo-passion-profit-2810110-2025-10-29",
      "headline": "The billion-dollar dream: How SRK and Ronaldo turned passion into profit Sports was always about honour, the movies about art. Now, the world rewards visibility over virtuosity. The athlete is a brand ambassador, the artist is an influencer, and algorithm the new critic"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matthew-perry-sister-caitlin-morrison-says-she-still-feels-his-presence-2810112-2025-10-29",
      "headline": "Matthew Perry's sister says she still feels his presence: Maybe ghosts are real Nearly two years after Matthew Perry's death, his sister Caitlin Morrison shared that she still feels his presence and often hears his voice in daily moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/don-lee-joins-prabhas-telugu-cop-action-film-spirit-2810086-2025-10-29",
      "headline": "Don Lee to face off with Prabhas in Sandeep Vanga's Spirit, reports Korean media Multiple Korean media outlets report Don Lee, known for 'Train to Busan' and 'Eternals', will take on a pivotal role in the Telugu film 'Spirit', directed by Sandeep Reddy Vanga and starring Prabhas. The film is expected to be released in 2026, though official confirmation from the production team is pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-refuses-to-hear-pil-urgently-against-paresh-rawals-the-taj-story-2810058-2025-10-29",
      "headline": "Delhi High Court refuses to hear PIL urgently against Paresh Rawal's The Taj Story A petition was filed in the Delhi High Court challenging the release of the film 'The Taj Story', starring Paresh Rawal, amid concerns that it spreads fringe theories about the Taj Mahal's origins and may threaten communal harmony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kufar-music-video-controversy-manushi-chhillar-diljit-dosanjh-respond-to-viral-leg-lift-moment-backlash-2810085-2025-10-29",
      "headline": "Manushi, Diljit break silence on Kufar controversy after viral leg-lift moment After Diljit Dosanjh, Manushi Chhillar addressed online trolling and defended a fellow dancer after a controversial scene from Diljit Dosanjh's video 'Kufar' drew attention on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shinde-comeback-angoori-bhabhi-bhabi-ji-ghar-par-hai-2810069-2025-10-29",
      "headline": "Shilpa Shinde to make comeback as Angoori Bhabhi in Bhabiji Ghar Par Hai? Actor Shilpa Shinde is likely to make her return to 'Bhabiji Ghar Par Hai' nearly a decade after her controversial exit. Discussions are reportedly underway to replace Shubhangi Atre with Shilpa as Angoori Bhabhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blanco-selena-gomez-celebrate-one-month-marriage-private-beach-outing-2810057-2025-10-29",
      "headline": "Benny Blanco is making every month count with wife Selena Gomez Singer Selena Gomez and Benny Blanco got married on September 27 in Santa Barbara, and recently commemorated their first month as newlyweds with a private beach walk and intimate dinner, joined by close friends from the entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/why-courage-the-cowardly-dog-still-feels-like-perfect-halloween-comfort-2810022-2025-10-29",
      "headline": "Why Courage the Cowardly Dog still feels like perfect Halloween comfort Revisiting 'Courage the Cowardly Dog' this Halloween proves that spooky doesn't always mean soulless. It's scary, weird, and full of heart, the perfect nostalgic comfort show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-reacts-to-constant-comparisons-with-father-saif-ali-khan-2810075-2025-10-29",
      "headline": "Ibrahim Ali Khan reacts to constant comparisons with father Saif: It's a compliment Ibrahim Ali Khan opened up about being constantly compared to his father Saif Ali Khan, saying it motivates him to live up to his legacy. Despite a slow start with his first two films, the young actor remains determined as he gears up for his next project, 'Diler'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-pickleball-court-video-the-bads-of-bollywood-success-2810040-2025-10-29",
      "headline": "Watch Aryan Khan hit pickleball court after The Ba***ds of Bollywood success Videos of Aryan Khan, son of Shah Rukh Khan, showcasing his pickleball skills have gone viral. He recently garnered praise for his directorial debut series 'The Ba***ds of Bollywood'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-bids-farewell-to-satish-shah-blames-bollywood-for-typecasting-him-2810041-2025-10-29",
      "headline": "Naseeruddin Shah bids farewell to Satish Shah, blames Bollywood for typecasting him Veteran actor Naseeruddin Shah penned an emotional tribute to his late friend and 'Jaane Bhi Do Yaaro' co-star Satish Shah, recalling his warmth, humour, and brilliance. In his heartfelt note, Shah reflected on how Bollywood unfairly typecast Satish as a comedian despite his immense talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bison-kaalamaadan-success-mani-ratnam-praises-mari-selvaraj-impactful-film-unique-voice-2810046-2025-10-29",
      "headline": "Mani Ratnam praises Bison, calls director Mari Selvaraj's voice important Filmmaker Mani Ratnam has praised Mari Selvaraj's film 'Bison Kaalamaadan', prompting a heartfelt response from the director. The film, which features Dhruv Vikram in the lead, was released on October 17 and is based on the story of kabaddi player Manathi Ganesan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hiten-tejwani-reveals-taxing-work-schedules-and-long-hours-faced-by-television-actors-2810016-2025-10-29",
      "headline": "Worked 22 hours a day: Actor Hiten Tejwani opens up on tough TV schedules Hiten Tejwani sheds light on the exhausting work culture of Indian television, recalling sleepless nights and relentless schedules that shaped his rise from humble beginnings to one of the industry's most respected actors."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-attacks-pm-modi-will-dance-votes-sir-nitish-kumar-bihar-polls-2810177-2025-10-29",
      "headline": "Tell him to dance, he'll dance: Rahul Gandhi taunts PM Modi at Bihar rallyRahul Gandhi kicked off his Bihar poll campaign with a strong attack on PM Modi and Nitish Kumar. His remarks have set the tone for a fiercely contested election season in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/president-murmu-rafale-sortie-iaf-woman-pilot-shivangi-singh-pakistan-op-sindoor-2810167-2025-10-29",
      "headline": "President poses with woman Rafale pilot Pakistan falsely claimed to have capturedPresident Droupadi Murmu's Rafale sortie came with a powerful image -- her standing beside Squadron Leader Shivangi Singh, the Rafale pilot Pakistan had falsely claimed was captured during Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-rohit-sharma-oldest-no1-batter-shubman-india-vs-australia-2810117-2025-10-29",
      "headline": "Rohit Sharma becomes oldest-ever No. 1 ODI batter, replaces Shubman Gill at topRohit Sharma has made history by becoming the world's No.1 batter in the latest ICC ODI rankings at the age of 38. The Indian opener displaced teammate and ODI captain Shubman Gill to reclaim the top spot following a dominant performance in the three-match series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/it-big-tech-layoffs-severance-costs-ai-restructuring-2810028-2025-10-29",
      "headline": "The billion-dollar goodbye: Why global tech giants are spending more to let people goIn this deep-dive on global tech layoffs, we analyse severance costs, project realignments, and slowing demand cycles to understand why companies are standardising leaner headcounts and shifting toward automation-driven operational efficiency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sudan-civil-war-2023-rsf-capture-el-fasher-dafur-hemedti-mohamed-hamdan-dagalo-al-burhan-reasons-explained-2809907-2025-10-29",
      "headline": "Devils on horseback, rape for Arab babies, and gold mines: The Sudan storySudan's military withdrew from its last western stronghold in Darfur, ceding control of El-Fasher city to the paramilitary Rapid Support Forces (RSF). The RSF started off as Janjaweed or devils on horseback, a militia of Arabs that raped and murdered animists and Christians. Sudan's gold mines and the UAE's interest in them add another dimension to the bloody history that has seen tens of thousands killed and millions displaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-live-score-updates-abhishek-sharma-suryakumar-yadav-canberra-2810079-2025-10-29",
      "headline": "IND vs AUS, Live: Rain stops play again, halts Gill and Surya's attackAUS vs IND, Live score 1st T20I: Just when captain Suryakumar Yadav and vice-captain Shubman Gill were going for the big hits, rain has yet again halted India's momentum. The game has already been reduced to 18 overs a side, and now fans patiently wait for the heavens to close its gates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iiscs-80-hour-rule-sparks-campus-unrest-students-call-it-oppressive-2810138-2025-10-29",
      "headline": "IISc's 50–80 hour weeks trigger protest, students call policy oppressiveThe unrest at IISc began after a new work-hour policy was introduced, mandating 40 hours a week for staff and up to 50 hours for students – with senior PhD scholars often expected to match their supervisors' schedules, stretching the workweek to nearly 80 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-gujarat-marked-the-pakistan-navys-pearl-harbour-2810198-2025-10-29",
      "headline": "Why Gujarat marked the Pakistan Navy's Pearl HarbourA raid on Dwarka in 1965 led to the demise of the Pakistan Navy in 1971."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kufar-music-video-controversy-manushi-chhillar-diljit-dosanjh-respond-to-viral-leg-lift-moment-backlash-2810085-2025-10-29",
      "headline": "Manushi, Diljit break silence on Kufar controversy after viral leg-lift momentAfter Diljit Dosanjh, Manushi Chhillar addressed online trolling and defended a fellow dancer after a controversial scene from Diljit Dosanjh's video 'Kufar' drew attention on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/jaish-e-mohammed-masood-azhar-recruits-women-terror-training-india-operations-2810131-2025-10-29",
      "headline": "Inside Masood Azhar's women's jihad brigade to counter Hindu womenMasood Azhar promised paradise to women who join Jamaat-ul-Mominat, portraying the unit as a counter to what he calls the use of women in armies and media by the \"enemies of Jaish\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/after-zoho-founder-sridhar-vembus-claim-what-really-causes-autism-in-children-2810202-2025-10-29",
      "headline": "What really causes autism? Here's what science, not entrepreneurs, tells usGenetics and prenatal environment explain most risk. Vaccines don't. What Indian parents need to know now"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nicest-looking-guy-trump-praises-pm-as-he-again-claims-to-have-stopped-india-pak-conflict-2810031-2025-10-29",
      "headline": "Nicest looking guy: Trump praises PM Modi, repeats India-Pak ceasefire claimSpeaking at a luncheon in South Korea, US President Donald Trump praised Prime Minister Narendra Modi and again claimed he personally helped end fighting between India and Pakistan earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurgaon-ceo-calls-employee-breakup-leave-mail-most-honest-request-approves-instantly-2810002-2025-10-29",
      "headline": "Gurgaon CEO calls employee's breakup leave mail 'most honest request', approvesJasveer Singh, co-founder and CEO of Knot Dating, opined that \"Gen Z doesn't do filters,\" suggesting that younger employees are increasingly upfront about their emotions and mental well-being. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stroke-symptoms-golden-hour-urgency-zerodha-ceo-nithin-kamath-india-rising-cases-2810178-2025-10-29",
      "headline": "Nithin Kamath puts spotlight on Golden Hour and India's stroke burdenOn World Stroke Day, Nithin Kamath shared how critical immediate hospitalisation is in cases of stroke, especially within the golden hour period to improve recovery chances. The Zerodha CEO suffered a mild stroke last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aqi-today-delhi-government-lagaan-moment-cloud-seeding-experiment-fail-ncr-pollution-aqi-iit-kanpur-rain-2810029-2025-10-29",
      "headline": "Is this Delhi's Lagaan moment? Does cloud-seeding always bring rain?Like the villagers of Champaner in Lagaan, Delhiites on Tuesday looked towards the sky with hope. But the clouds drifted away, and all that was left was toxic air. Was the cloud-seeding experiment, which cost crores, the Lagaan moment of the Delhi government? This is what cloud seeding does and its success rate. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/why-delhi-did-not-see-rain-despite-cloud-seeding-pollution-smog-2809910-2025-10-29",
      "headline": "Why Delhi's cloud-seeding trial for artificial rain was bound to failDelhi rain: The much-hyped cloud seeding experiment in Delhi on Tuesday to induce rainfall is yet to yield visible results. In reality, there was little chance of the experiment succeeding due to low moisture content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/coal-tar-in-shampoo-is-superb-for-dandruff-but-is-it-safe-2809805-2025-10-29",
      "headline": "Coal tar in shampoo is superb for dandruff. But is it safe?Don't be surprised (or scared) to see coal tar as an ingredient in your shampoo bottle prescribed by a dermatologist. It is known to help with a bevy of scalp issues like psoriasis, dandruff and seborrhoeic dermatitis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/darshan-singh-sahasi-an-indian-businessman-from-punjab-shot-dead-in-canada-2809965-2025-10-29",
      "headline": "Caught on CCTV: Lawrence Bishnoi gang kills Indian businessman in CanadaThe brazen daylight killing on a busy street has sent shockwaves through Abbotsford's South Asian community. Local authorities have begun a probe into the veracity of the gang's online claim, with Canadian police coordinating with Indian agencies for intelligence inputs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/childhood-vaccines-autism-controversy-mccullough-report-zoho-founder-vembu-2810052-2025-10-29",
      "headline": "Sridhar Vembu draws sharp rebuttal from doctors over unverified vaccine-autism linkA self-published report claims a link between vaccines and autism, strongly promoted by Zoho founder Sridhar Vembu. Doctors and public health experts warn this misinformation could harm decades of public health progress in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/fined-bike-rider-confronts-mumbai-cops-halts-their-scooter-video-goes-viral-2810140-2025-10-29",
      "headline": "Fined bike rider confronts Mumbai cops, halts their scooter. Video goes viralA video of a biker confronting Mumbai traffic cops after being fined has gone viral online, prompting the police to clarify the incident and caution against such confrontations on the road."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/down-cemetery-road-review-ruth-wilson-emma-thompson-suburban-meltdown-is-deliciously-twisted-2810113-2025-10-29",
      "headline": "Down Cemetery Road review: Ruth Wilson's suburban meltdown is deliciously twistedRelease Date:Wed Oct 29, 2025Apple TV+ dropped the first two episodes of 'Down Cemetery Road' on October 29. With stellar turns by Ruth Wilson and Emma Thompson, this Oxford-set thriller promises an addictive ride for viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/subu-vedam-detained-india-born-man-subramanyam-deportation-battle-spent-43-years-us-jail-ice-pennsylvania-2808653-2025-10-29",
      "headline": "I'm still a detainee: India-born man's new battle after 43 years in US JailSubramanyam Subu Vedam, an India-born man exonerated after 43 years in a US prison for a wrongful murder conviction, was immediately detained by ICE under a decades-old deportation order. Freed after new FBI evidence proved his innocence, 64-year-old Vedam now faces deportation to India, the country he left as a nine-month-old. Here's the story of the ordeal of the longest-serving wrongfully convicted person in Pennsylvania's history, and one of the longest in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/khalistani-terrorist-gurpatwant-singh-pannun-sikhs-for-justice-threatens-diljit-dosanjh-touching-amitabh-bachchan-feet-2810011-2025-10-29",
      "headline": "Khalistani outfit threatens Diljit Dosanjh for touching Amitabh Bachchan's feetThe banned Khalistani outfit has said that Diljit Dosanjh touching Amitabh Bachchan's feet was an insult to every victim of the 1984 anti-Sikh riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/conscious-unbossing-gen-z-employees-dont-want-to-be-managers-2810166-2025-10-29",
      "headline": "Conscious unbossing: Why 52% of Gen-Z employees don't want to be managersOver half of Gen Z employees are opting out of becoming managers in a workplace trend being termed \"conscious unbossing\". They prefer autonomy, lower stress and skills-driven roles. Employers need to rethink leadership paths or risk losing their future talent."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashi-tharoor-on-sarfaraz-khan-india-selectors-whats-the-value-of-ranji-runs-2810190-2025-10-29",
      "headline": "Shashi Tharoor slams selectors for ignoring Sarfaraz despite rich form Congress MP Shashi Tharoor criticises Indian selectors for excluding Sarfaraz Khan from the Test team despite his impressive domestic and international records. He stressed the need to value consistent domestic cricket performances over IPL form in team selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-kevin-pietersen-wife-delhi-capitals-light-hearted-exchange-2810200-2025-10-29",
      "headline": "KL Rahul reveals hilarious banter with Kevin Pietersen's wife in England KL Rahul lifted the lid on his playful camaraderie with Kevin Pietersen during the 2025 Indian Premier League, recounting how their light-hearted banter extended beyond the field to Pietersen's wife, Jessica."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/hitmans-crowning-glory-when-rohit-sharma-first-became-world-no1-ytvd-2810194-2025-10-29",
      "headline": "Rohit Sharma's Crowning Glory: When Rohit Sharma First Became World No.1 This special report revisits the historic moment when 'Hitman' Rohit Sharma first claimed the top spot in the ICC ODI batter rankings. At 38, he became the oldest player to achieve this milestone after a stellar performance in the ODI series against Australia, which included a match-winning unbeaten century. The report examines the key performances that led to this achievement, including his record-breaking run in the 2019 World Cup where he became the first batsman to score five centuries in a single tournament. A significant quote from the time highlights the magnitude of the event: 'Rohit Sharma has created history by becoming the number one ranked player for the very first time in his career as far as ICC ranking is concerned.' This milestone cemented his legacy as one of India's all-time greatest white-ball cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/hitmans-crowning-glory-when-rohit-sharma-first-became-world-no1-ytvd-2810195-2025-10-29",
      "headline": "Rohit Sharma's Crowning Glory: When Rohit Sharma First Became World No.1 This special report revisits the historic moment when 'Hitman' Rohit Sharma first claimed the top spot in the ICC ODI batter rankings. At 38, he became the oldest player to achieve this milestone after a stellar performance in the ODI series against Australia, which included a match-winning unbeaten century. The report examines the key performances that led to this achievement, including his record-breaking run in the 2019 World Cup where he became the first batsman to score five centuries in a single tournament. A significant quote from the time highlights the magnitude of the event: 'Rohit Sharma has created history by becoming the number one ranked player for the very first time in his career as far as ICC ranking is concerned.' This milestone cemented his legacy as one of India's all-time greatest white-ball cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-eng-vs-sa-1st-semi-final-live-laura-wolvaardt-nat-sciver-brunt-2810173-2025-10-29",
      "headline": "ENG vs SA 1st semi-final live: Brits, Woolvaardt off to steady start Women's World Cup 2025, ENG vs SA 1st semi-final live: England have won the toss in the first semi-final of the Women's World Cup 2025 at Barsapara Cricket Stadium in Guwahati and decided to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-t20i-nitish-reddy-injury-arshdeep-singh-benched-harshit-2810149-2025-10-29",
      "headline": "Injured Nitish ruled out of first 3 T20Is, Arshdeep benched for series opener Australia vs India, 1st T20I: India were without Nitish Reddy for the series opener in Canberra after the all-rounder was ruled out of the first three T20Is due to neck spasms. India picked two frontline pacers, but left out Arshdeep Singh on Tuesday, October 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-mother-prays-shreyas-iyer-speedy-recovery-chhath-puja-2810150-2025-10-29",
      "headline": "Suryakumar Yadav's mother prays for Shreyas Iyer's recovery during Chhath Puja Australia vs India: In a video shared on Instagram by India's T20I captain Suryakumar Yadav's sister, his mother was seen praying for Shreyas Iyer's recovery during Chhath Puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-rohit-sharma-oldest-no1-batter-shubman-india-vs-australia-2810117-2025-10-29",
      "headline": "Rohit Sharma becomes oldest-ever No. 1 ODI batter, replaces Shubman Gill at top Rohit Sharma has made history by becoming the world's No.1 batter in the latest ICC ODI rankings at the age of 38. The Indian opener displaced teammate and ODI captain Shubman Gill to reclaim the top spot following a dominant performance in the three-match series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-england-2nd-odi-report-tickner-mitchell-archer-2810103-2025-10-29",
      "headline": "New Zealand outclass England to take unassailable 2–0 lead in ODI series New Zealand delivered a commanding all-round performance to defeat England by five wickets in the second ODI at Seddon Park, Hamilton, on Tuesday, taking an unassailable 2–0 lead in the three-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-poor-form-india-t20i-captain-scrutiny-australia-series-2810091-2025-10-29",
      "headline": "Suryakumar Yadav's extended poor run will create internal scrutiny: Nayar Former India cricketer Abhishek Nayar warns of intense scrutiny on Suryakumar Yadav's poor form ahead of the Australia T20I series. Suryakumar hasn't been in good form ever since being appointed as a full-time T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-t20i-nitish-reddy-injury-arshdeep-singh-benched-harshit-2810149-2025-10-29",
      "headline": "Injured Nitish ruled out of first 3 T20Is, Arshdeep benched for series opener Australia vs India, 1st T20I: India were without Nitish Reddy for the series opener in Canberra after the all-rounder was ruled out of the first three T20Is due to neck spasms. India picked two frontline pacers, but left out Arshdeep Singh on Tuesday, October 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-mother-prays-shreyas-iyer-speedy-recovery-chhath-puja-2810150-2025-10-29",
      "headline": "Suryakumar Yadav's mother prays for Shreyas Iyer's recovery during Chhath Puja Australia vs India: In a video shared on Instagram by India's T20I captain Suryakumar Yadav's sister, his mother was seen praying for Shreyas Iyer's recovery during Chhath Puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-rohit-sharma-oldest-no1-batter-shubman-india-vs-australia-2810117-2025-10-29",
      "headline": "Rohit Sharma becomes oldest-ever No. 1 ODI batter, replaces Shubman Gill at top Rohit Sharma has made history by becoming the world's No.1 batter in the latest ICC ODI rankings at the age of 38. The Indian opener displaced teammate and ODI captain Shubman Gill to reclaim the top spot following a dominant performance in the three-match series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-england-2nd-odi-report-tickner-mitchell-archer-2810103-2025-10-29",
      "headline": "New Zealand outclass England to take unassailable 2–0 lead in ODI series New Zealand delivered a commanding all-round performance to defeat England by five wickets in the second ODI at Seddon Park, Hamilton, on Tuesday, taking an unassailable 2–0 lead in the three-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-poor-form-india-t20i-captain-scrutiny-australia-series-2810091-2025-10-29",
      "headline": "Suryakumar Yadav's extended poor run will create internal scrutiny: Nayar Former India cricketer Abhishek Nayar warns of intense scrutiny on Suryakumar Yadav's poor form ahead of the Australia T20I series. Suryakumar hasn't been in good form ever since being appointed as a full-time T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-live-score-updates-abhishek-sharma-suryakumar-yadav-canberra-2810079-2025-10-29",
      "headline": "IND vs AUS, Live: Rain stops play again, halts Gill and Surya's attackAUS vs IND, Live score 1st T20I: Just when captain Suryakumar Yadav and vice-captain Shubman Gill were going for the big hits, rain has yet again halted India's momentum. The game has already been reduced to 18 overs a side, and now fans patiently wait for the heavens to close its gates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/inter-goalkeeper-josep-martinez-car-accident-killls-wheelchair-2810073-2025-10-29",
      "headline": "Inter Milan's Josep Martinez in car accident that kills 81-year-old in wheelchairInter Milan's Josep Martinez was involved in a fatal road accident in Como that killed an 81-year-old man in a wheelchair. Police have launched an investigation into the tragic incident as Inter cancelled media duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-explosive-t20-batter-ravi-shastri-warns-australia-india-series-2810062-2025-10-29",
      "headline": "Abhishek Sharma can create chaos: Ravi Shastri warns Australia ahead of 1st T20IFormer India coach Ravi Shastri warns Australia about Abhishek Sharma's explosive batting ahead of the T20I series. India seek to bounce back after losing by 1-2 in the ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-al-nassr-trophy-curse-kings-cup-al-ittihad-loss-saudi-2810042-2025-10-29",
      "headline": "Ronaldo's Al Nassr trophy curse: 13 tournaments lost after King's Cup heartbreakCristiano Ronaldo's hunt for silverware in Saudi Arabia continues after Al Nassr's King's Cup exit to Al Ittihad. Despite his individual brilliance, major trophies remain out of reach since his move to the Riyadh-based club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-predicts-australia-england-womens-world-cup-final-2810030-2025-10-29",
      "headline": "Meg Lanning predicts Australia vs England final, leaves out IndiaMeg Lanning has excluded India from her Women's World Cup final prediction, tipping Australia and England to dominate their semi-finals and face off in the title clash in Navi Mumbai on November 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-1st-t20i-batting-issues-salman-agha-reaction-2810000-2025-10-29",
      "headline": "Pakistan need to fix middle order issues: Salman Ali Agha on 1st T20I loss vs SAPakistan captain Salman Ali Agha admitted that his side's repeated failure to build partnerships once again proved costly, as South Africa handed them a defeat in the opening T20I of the series at the Rawalpindi Cricket Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-canberra-weather-forecast-2809990-2025-10-29",
      "headline": "AUS vs IND 1st T20I Canberra weather forecast: Will rain affect the series opener?Australia vs India, Canberra Weather Forecast: Cricket fans might need to keep their fingers crossed, with rain threatening to play spoilsport when India and Australia kick off their five-match T20I series in Canberra on Wednesday (October 29)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-returns-india-womens-world-cup-semi-final-australia-2809860-2025-10-29",
      "headline": "Shafali Verma rides on luck, but faces tough redemption road against AustraliaWomen's World Cup, IND vs AUS: India have included Shafali Verma in the squad as a replacement for Pratika Rawal, but the youngster faces a tough challenge as India prepare to take on Australia in the first semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-predicts-australia-england-womens-world-cup-final-2810030-2025-10-29",
      "headline": "Meg Lanning predicts Australia vs England final, leaves out IndiaMeg Lanning has excluded India from her Women's World Cup final prediction, tipping Australia and England to dominate their semi-finals and face off in the title clash in Navi Mumbai on November 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-1st-t20i-batting-issues-salman-agha-reaction-2810000-2025-10-29",
      "headline": "Pakistan need to fix middle order issues: Salman Ali Agha on 1st T20I loss vs SAPakistan captain Salman Ali Agha admitted that his side's repeated failure to build partnerships once again proved costly, as South Africa handed them a defeat in the opening T20I of the series at the Rawalpindi Cricket Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-canberra-weather-forecast-2809990-2025-10-29",
      "headline": "AUS vs IND 1st T20I Canberra weather forecast: Will rain affect the series opener?Australia vs India, Canberra Weather Forecast: Cricket fans might need to keep their fingers crossed, with rain threatening to play spoilsport when India and Australia kick off their five-match T20I series in Canberra on Wednesday (October 29)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-returns-india-womens-world-cup-semi-final-australia-2809860-2025-10-29",
      "headline": "Shafali Verma rides on luck, but faces tough redemption road against AustraliaWomen's World Cup, IND vs AUS: India have included Shafali Verma in the squad as a replacement for Pratika Rawal, but the youngster faces a tough challenge as India prepare to take on Australia in the first semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-vs-south-africa-semi-final-preview-revenge-69-nightmare-2809968-2025-10-29",
      "headline": "South Africa look for revenge in semis against England after 69 nightmareWomen's World Cup, ENG vs SA: South Africa will be looking to avenge their previous defeat to England when the two teams meet on Tuesday, October 28 at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-irfan-pathan-suryakumar-yadav-t20i-form-2809966-2025-10-29",
      "headline": "Australian pitches will help Suryakumar Yadav regain form, says Irfan PathanFormer India all-rounder Irfan Pathan believes the Australian pitches could help Suryakumar Yadav rediscover his batting rhythm. The Indian captain has endured a lean run of form this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-player-of-the-match-award-prithvi-shaw-share-maharashtra-vs-chandigarh-2809961-2025-10-29",
      "headline": "Watch: Ruturaj shares Ranji Trophy award with double centurion Prithvi ShawRuturaj Gaikwad shared his Player of the Match award with Prithvi Shaw after Maharashtra's Ranji Trophy win over Chandigarh. Shaw's explosive double century played a decisive role in his team's 144-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/shreyas-iyer-injury-scare-cricketer-suffers-lacerated-spleen-internal-bleeding-ytvd-2809955-2025-10-29",
      "headline": "Shreyas Iyer Injury Scare: Cricketer Suffers Lacerated Spleen, Internal BleedingThis special report focuses on the critical injury sustained by Indian cricketer Shreyas Iyer during the third ODI against Australia in Sydney. The BCCI confirmed the extent of the injury in a press release. According to the board, 'Shreyas Iyer sustained a blunt injury to his abdomen, resulting in a laceration of his spleen with internal bleeding on 25th October during the third ODI against Australia'. The injury, which occurred while taking a catch, was promptly identified and the bleeding was arrested, leading to his condition stabilising. Now out of the ICU, Iyer remains under the close observation of the BCCI's medical team in consultation with specialists in Sydney and India, with scans showing significant improvement on his road to recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2809935-2025-10-29",
      "headline": "Jasprit Bumrah returns to Australia after BGT heroics in a new avatar in T20IsAUS vs IND: Jasprit Bumrah returns to his favourite hunting ground, Australia, where he impressed everyone with his performance in BGT last year. Now in a new role as powerplay enforcer, Bumrah will have big responsibility on him to deliver. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-1st-t20i-preview-abhishek-sharma-suryakumar-2809924-2025-10-29",
      "headline": "1st T20I preview: Will Abhishek Sharma stamp his authority Down Under?India vs Australia, 1st T20I Preview: With the ODIs done, the focus finally shifts to things that matter – the build-up for T20 World Cup. Suryakumar Yadav's India are set to take on Australia in a 5-match series, one that promises a battle between high-voltage batting orders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-rawalpindi-t20i-babar-azam-report-2809912-2025-10-29",
      "headline": "Babar Azam flops as South Africa crush Pakistan by 55 runs in RawalpindiPAK vs SA: South Africa crushed Pakistan by 55 runs in the first T20I at Rawalpindi, with George Linde starring in an all-round show. Babar Azam's return ended in disappointment as he fell for a duck, deepening Pakistan's batting woes.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}