{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": " No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-meets-with-accident-undergoing-treatment-2679715-2025-02-13",
      "headline": "Singer-composer Vishal Dadlani meets with an accident, undergoes treatmentVishal Dadlani of the Vishal-Sheykhar duo is undergoing treatment after an accident, leading to the postponement of their upcoming concert scheduled for March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-unfiltered-india-tour-shows-across-nation-cancelled-indias-got-latent-controversy-2679669-2025-02-13",
      "headline": "Not just Gujarat, all Samay Raina shows cancelled amid India's Got Latent rowSamay Raina's shows in India have been cancelled following controversy around India's Got Latent, with Gujarat shows being the first to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-jonita-gandhi-to-perform-at-lollapalooza-india-will-open-for-shawn-mendes-2679497-2025-02-13",
      "headline": "Singer Jonita Gandhi to perform at Lollapalooza India, will open for Shawn MendesJonita Gandhi will perform at Lollapalooza India on March 8, opening for Shawn Mendes. Her latest single Channa has also been nominated for a Juno Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twilight-star-taylor-lautner-to-return-as-werewolf-in-self-aware-werewolf-series-2679572-2025-02-13",
      "headline": "Twilight star Taylor Lautner to return as werewolf in self-aware werewolf seriesTwilight star Taylor Lautner is returning to portray a werewolf in the self-aware Amazon series. Details of the show are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/anupamaa-actor-rupali-ganguly-seeks-blessings-at-maha-kumbh-2679484-2025-02-13",
      "headline": "Anupamaa actor Rupali Ganguly seeks blessings at Maha KumbhActor Rupali Ganguly visited Maha Kumbh in Prayagraj with her family. She shared moments from her spiritual visit, including performing aarti, attending a hawan, and meeting a saint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-begins-raat-akeli-hai-2-shooting-in-lucknow-2679426-2025-02-13",
      "headline": "Nawazuddin Siddiqui begins Raat Akeli Hai 2 shooting in LucknowActor Nawazuddin Siddiqui has begun Raat Akeli Hai 2 shooting in Lucknow. The actor will be seen sharing screen space with Chitragandha Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/olivia-swann-on-ncis-sydney-her-characters-growth-challenges-2679301-2025-02-13",
      "headline": "Olivia Swann on NCIS: Sydney, her character's growth & challenges In this exclusive interview with India Today's Bhavna Agarwal, Olivia Swann dives deep into her role in NCIS: Sydney, sharing insights into her character's journey, development, and challenges throughout the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-sues-ankita-lokhande-for-defamation-over-cheap-remark-2679295-2025-02-13",
      "headline": "Rozlyn Khan sues Ankita Lokhande for defamation over 'cheap' remark TV actor Rozlyn Khan took legal action against Ankita Lokhande's recent comments. Ankita had called her 'cheap', for her claims about Hina Khan's cancer battle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-makes-a-powerful-comeback-with-high-alone-from-magic-man-2-2679273-2025-02-13",
      "headline": "Jackson Wang makes a powerful comeback with High Alone from Magic Man 2Jackson Wang drops a new single, High Alone, that marks the beginning of his new album, MAGIC MAN 2. The album promises a deep dive into themes of identity and personal transformation, set against a backdrop of atmospheric production and introspective lyrics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-lithgow-approached-to-play-albus-dumbledore-in-harry-potter-series-2679264-2025-02-13",
      "headline": "Actor John Lithgow approached to play Albus Dumbledore in Harry Potter seriesAward-winning American actor John Lithgow has reportedly been approached to play the iconic character of Hogwarts principal Albus Dumbledore in HBO's Harry Potter series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-stepdaughter-esha-verma-calls-her-evil-step-lady-issues-clarification-2679232-2025-02-13",
      "headline": "Rupali Ganguly's stepdaughter calls her 'evil step lady', issues clarificationRupali Ganguly's stepdaughter, Esha Verma, clarified her viral social media post against the actor. Esha requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-cries-loss-of-work-indias-got-latent-controversy-viral-video-truth-2679217-2025-02-13",
      "headline": "Truth behind viral video of Ranveer Allahbadia crying over 'loss of work'Amid backlash over India's Got Latent, an old video of Ranveer Allahbadia crying resurfaces. In the video, the podcaster is seen breaking down over 'loss of work'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brother-hint-at-big-change-for-2025-shocked-fans-ask-another-breakup-2679190-2025-02-13",
      "headline": "Jonas Brothers hint at big change for 2025, shocked fans ask, 'another breakup?'The Jonas Brothers shared a letter on social media that briefly sent fans into a panic. In it, they hinted at their 2025 lineup and expressed gratitude to their fans for supporting them throughout their musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ma-baap-ki-kabaddi-joke-viral-ranveer-allahbadia-remark-2679097-2025-02-12",
      "headline": "Kapil Sharma's 'Maa Baap ki Kabaddi' joke goes viral amid Ranveer Allahbadia rowAmid the controversy over Ranveer Allahbadia's comment on Samay Raina's show India's Got Latent, an old clip of Kapil Sharma joking about kids watching \"maa baap ki kabaddi\" is going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/did-ar-rahman-refer-to-ranveer-allahbadia-row-at-chhaava-music-launch-vicky-kaushal-2679084-2025-02-12",
      "headline": "Watch: Did AR Rahman refer to Ranveer Allahbadia row at Chhaava music launch?AR Rahman made a humorous remark at the Chhaava music launch that has led to speculation about its connection to the recent controversy involving Ranveer Allahbadia and Samay Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/ed-sheeran-india-dump-football-with-john-abraham-2679075-2025-02-12",
      "headline": "Ed Sheeran's India dump features photo from football match with John AbrahamSinger Ed Sheeran shared his India dump, which also featured a glimpse of his football match with Bollywood actor John Abraham. Sheeran is in India for his Mathematics Tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/aly-goni-feels-samay-raina-was-forced-to-delete-indias-got-latent-episodes-2679069-2025-02-12",
      "headline": "Aly Goni feels Samay Raina was 'forced' to delete India's Got Latent episodesActor Aly Goni has commented on YouTuber-comedian Samay Raina's decision to remove episodes of India's Got Latent. Fans have also reacted to Samay's decision on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/odisha-rapper-abhinav-singh-dies-by-suicide-in-bengaluru-2679059-2025-02-12",
      "headline": "Odia rapper Abhinav Singh, 32, dies by suicide in BengaluruA rapper from Odisha, Abhinav Singh, died in Bengaluru where he was working for a private company. He was 32."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kendrick-lamar-super-bowl-halftime-show-is-the-most-watched-2678978-2025-02-12",
      "headline": "Kendrick Lamar's Super Bowl Halftime show is the most-watchedRapper Kendrick Lamar's Super Bowl Halftime show has become the most-watched Super Bowl show of all time, garnering an impressive 133.5 million views. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-ranveer-allahbadia-2678979-2025-02-12",
      "headline": "Too much to handle: Samay Raina deletes all videos from his show amid jokes rowComedian Samay Raina finally broke his silence on the controversy over Ranveer Allahbadia's remark on his show, India's Got Latent. He has confirmed deleting all the videos of the show, and also added that whatever is happening right now is too much for him to handle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amy-adams-javier-bardem-to-lead-cape-fear-show-apple-tv-2678846-2025-02-12",
      "headline": "Amy Adams joins Javier Bardem in Cape Fear TV adaptationAfter Javier Bardem, actor Amy Adams is on board for the much-awaited Cape Fear TV adaptation. The release date for the show has not been announced yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-dropped-by-talent-agency-amid-antisemitic-controversial-actions-2678955-2025-02-12",
      "headline": "Kanye West dropped by talent agency amid antisemitic, controversial actionsKanye West's controversial actions have led to his talent agency, 33&West, dropping him. The decision follows a series of antisemitic remarks and troubling social media posts by the rapper that have sparked widespread condemnation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-gujarat-show-march-april-cancelled-after-indias-got-latent-controversy-2678896-2025-02-12",
      "headline": "Samay Raina's show in Gujarat cancelled amid India's Got Latent controversyComedian Samay Raina's Gujarat shows have been cancelled following a controversy sparked by the latest episode of his show, India's Got Latent. The decision comes amid backlash after a distasteful comment by YouTuber Ranveer Allahbadia on the show."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-human-trafficking-us-deportation-row-congress-partap-singh-bajwa-aap-government-bhagwant-mann-2680548-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's been done to curb trafficking, Congress asks Punjab AAP amid deportation rowPunjab opposition leader Partap Singh Bajwa criticised Chief Minister Bhagwant Mann for failing to curb human trafficking. He questioned the enforcement of existing laws and condemned the lack of support for deported Indians. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranveer-allahbadia-after-row-over-obscene-remarks-death-threats-police-cooperation-2680611-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "People invading my mother's clinic, sending death threats: Ranveer Allahbadia YouTube Ranveer Allahbadia on Saturday revealed that he was scared for his life, claiming that he and his family is facing repeated death threats over the past few days following his obscene remarks at the now-deleted India's Got Latent comedy show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-j-jayalalithaa-disproportionate-assets-case-crown-sword-2680588-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gold crown, gold sword: Jayalalithaa's seized assets transferred to Tamil NaduTamil Nadu officially received former Chief Minister J Jayalalithaa's seized assets, including 27.5 kg of gold, over a tonne of silver, and land documents. Karnataka authorities transferred the valuables under court supervision, revealing her vast wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-west-global-democracy-double-standards-munich-security-conference-panel-2680452-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar tears into West over global democracy: 'Practice what you preach'Flagging the \"double standards\" of the West over its view on global democracy, External Affairs Minister S Jaishankar said Western leaders treated democracy as a \"Western characteristic\". He urged them to embrace the successful models of non-Western countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/darien-gap-most-dangerous-stretch-on-donkey-route-indian-deported-from-us-trump-darien-gap-explained-2676300-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where the dead warn the living: Darien Gap, deadliest stretch on donkey routeA second flight with over 100 Indians who migrated illegally to the US will land in Amritsar today. Most of them and others who are in the US illegally took the donkey route. The Darien Gap -- a 97-km stretch on the border of Columbia and Panama -- is the most dangerous part of the South American donkey route. Here's all about the Darien Gap and its dangers that have forced immigrants even to abandon their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-love-jihad-religious-conversion-law-committee-formed-2680501-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Law against 'love jihad' in Maharashtra soon? 7-member committee formedThe committee, which will be headed by the Maharashtra Director General of Police, will suggest measures to tackle complaints related to forced conversions and 'love jihad'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-illegal-immigration-more-and-more-indian-asylum-seekers-to-us-are-speaking-a-different-tongue-immighrants-2679990-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "More and more Indian asylum seekers to US are speaking a different tonguePunjabi speakers formed 66% of all asylum-seekers from India from 2001 to 2022, according to an analysis by Johns Hopkins University researchers. However, the five years from 2017 to 2022 saw a 30% rise in asylum petitions being filed in the US by Hindi-speaking Indians. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-president-volodymyr-zelenskyy-ukraine-russia-peace-deal-not-possible-without-kyiv-2680589-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ukraine won't accept peace deal made behind our backs: ZelenskyyUkrainian president Volodymyr Zelenskyy said that his country will not accept any peace deal made without the involvement of Kyiv as US President Donald Trump held a phone call with Russian President Vladimir Putin on phone this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/narendra-modi-donald-trump-diplomacy-sparks-unease-in-beijing-chinese-chatter-opinion-2680531-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chinese Chatter: Modi-Trump diplomacy sparks unease in BeijingChina's rise is a common concern for both the United States and India; therefore, relevant issues about China have most likely dominated the agenda of Modi and Trump's meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": " No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-india-co-operative-bank-ex-manager-hitesh-pravinchand-mehta-arrested-in-fraud-case-2680600-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New India Co-operative Bank ex-manager arrested in Rs 122 crore fraud caseEarlier, the Mumbai police accused Mehta of misusing his position for stealing from Dadar and Goregaon branches between 2020 to 2025, when he was responsible for running the two branches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-last-bollywood-superstars-pankaj-tripathi-sooraj-barjatya-2679306-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The last of the stars: Why Bollywood has a superstar crisis after the Khans The Khans-Salman Khan, Shah Rukh Khan, and Aamir Khan - share an indelible stardom like no other. But, will there be any successor to their superstardom throne? Industry veterans discuss how digital accessibility has diminished the aura of superstardom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-arrest-mug-shot-photo-frame-oval-office-while-house-pm-modi-visit-2680556-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's infamous arrest mugshot seen in White House during PM Modi's visitThe image of the mugshot, in an ornate gold frame and hung outside the Oval Office, went viral on social media as Donald Trump greeted PM Modi before their meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-classics-india-vs-south-africa-semi-final-2002-2680598-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy Classics: India's miraculous turnaround vs SA in 2002 semisThe India vs South Africa match in the semi-finals of the Champions Trophy 2002 turned out to be a classic in Colombo. Down and out midway through the second innings, India made an incredible comeback for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/which-walk-is-more-effective-for-weight-loss-empty-stomach-or-post-meal-stmp-2679595-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walking on an empty stomach vs after a meal: Which one burns more fat?While many head out for a walk after hearty meals, others prefer walking on an empty stomach, thinking that it will burn more calories. Know it from experts on which one is more effective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-grwm-video-goes-viral-internet-says-his-sass-is-contagious-2680447-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blinkit delivery agent's sassy style in GRWM video is off the charts. Watch videoA Blinkit delivery agent's GRWM video has gone viral on social media. The internet, impressed by his effortless confidence, says his sass is contagious. Scroll down to watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-meeting-agreements-trade-tariffs-american-experts-decode-takeaways-2680431-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi has pulled off magic in US, says Ashley Tellis: India Today ExclusiveModi-Trump meet: American foreign policy experts were unanimous in their verdict that the wide-ranging agreements, from defence equipment to trade, left no doubt that the US-India relationship was off to a very good start during Trump 2.0. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-ex-goa-mla-lavoo-mamledar-dies-auto-rickshaw-driver-slap-belagavi-2680557-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Goa MLA dies shortly after auto-rickshaw driver slaps him in KarnatakaThe dispute escalated when the auto-rickshaw driver, identified as Mujahid Sanadi, slapped 68-year-old Lavoo Mamledar, a former Goa MLA in Karnataka's Belagavi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/pariksha-pe-charcha-2025-sadhguru-on-intelligence-focus-and-tackling-stress-2680603-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sadhguru on Pariksha Pe Charcha: Top tips on intelligence, focus, tackling stressSadhguru shared a long list of practical tips in Pariksha Pe Charcha 2025, advising students to tips to reduce stress, manage the mind and technology better, make studying playful, and not take comparison seriously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-releases-three-more-israeli-hostages-gaza-ceasefire-deal-palestinian-prisoners-idf-2680513-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas frees 3 more hostages, including an American, under Gaza truce dealThree more Israeli hostages, including an American, were released by Hamas after 498 days, after the Palestinian group and Israel threatened each other with resuming fighting over alleged violation of a ceasefire deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/revanth-reddy-pm-modi-remark-on-caste-birth-row-bjp-congress-hyderabad-2680471-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revanth Reddy claims PM is 'legally converted backward class', BJP hits backTelangana Chief Minister Revanth Reddy claimed that Prime Minister Narendra Modi is from the \"legally converted Backward Class (BC)\" and not born in the BC category. The BJP hit back at Revanth Reddy for his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalamkaval-mammmootty-shares-first-look-poster-from-jithin-k-jose-film-2680602-2025-02-15",
      "headline": "Kalamkaval: Mammmootty shares first look poster from Jithin K Jose's filmMalayalam superstar Mammootty shared his first look poster from the upcoming Kalamkaval. Headlined by Vinayakan, it has been touted that Mammootty will play an anti-hero in the film. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/tovino-thomas-shares-pics-with-ms-dhoni-rohit-sharma-and-irfan-pathan-2680601-2025-02-15",
      "headline": "Tovino Thomas shares pics with MS Dhoni, Rohit Sharma and Irfan PathanIn a heartwarming moment, Malayalam actor Tovino Thomas met cricketers MS Dhoni, Rohit Sharma, and Irfan Pathan. He shared the pictures on social media on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-sreeleela-musical-drama-aashiqui-3-to-release-on-diwali-2680597-2025-02-15",
      "headline": "Kartik Aaryan, Sreeleela's romantic musical to release on Diwali, first look outKartik Aaryan and Sreeleela's highly anticipated romantic film is set to hit theatres on Diwali 2025. Kartik announced the release with an intriguing first-look video on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-jannik-sinner-doping-ban-kyrgios-warinka-2680609-2025-02-15",
      "headline": "Tennis is not a clean sport anymore: Warinka on Sinner's 3-month banTennis stars Nick Kyrgios and Stan Warinka have slammed the 3-month ban of Jannik Sinner. The World No.1 player came to a settlement with WADA on the matter of him testing positive for doping back in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ben-duckett-declared-fit-after-injury-scare-in-india-england-cricket-2680604-2025-02-15",
      "headline": "Ben Duckett declared fit for Champions Trophy 2025 after injury scare in IndiaEngland opener Ben Duckett has been declared fit for the ICC Champions Trophy 2025 after undergoing scans for his groin injury suffered in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-classics-india-vs-south-africa-semi-final-2002-2680598-2025-02-15",
      "headline": "Champions Trophy Classics: India's miraculous turnaround vs SA in 2002 semisThe India vs South Africa match in the semi-finals of the Champions Trophy 2002 turned out to be a classic in Colombo. Down and out midway through the second innings, India made an incredible comeback for the ages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcb-rajat-patidar-captain-virat-kohli-kaif-2680584-2025-02-15",
      "headline": "Virat Kohli effectively runs RCB, wanted Rajat Patidar to be captain: KaifFormer India cricketer Mohammed Kaif feels that Rajat Patidar would not have become the RCB captain unless Virat Kohli wanted him to be. Kaif said that the decision was taken keeping franchise's future in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-babar-azam-opener-pakistan-cricket-team-mohammad-amir-2680574-2025-02-15",
      "headline": "Babar should play at No.3: Amir not a fan of Pakistan star's new roleFormer Pakistan pacer Mohammad Amir feels that Babar Azam should be batting at the No.3 spot during the Champions Trophy. Babar was used as an opener during the tri-series ahead of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-spotted-at-a-party-with-ms-dhoni-after-no-friendship-claims-2680573-2025-02-15",
      "headline": "Watch: Harbhajan Singh spotted at a party with Dhoni after 'no friendship' claimsFormer India spinner Harbhajan Singh was spotted with MS Dhoni months after claiming that the duo don't talk to each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-pep-guardiola-takes-bizarre-jibe-at-liverpool-cannot-do-100-points-already-2680567-2025-02-15",
      "headline": "Pep Guardiola takes bizarre jibe at Liverpool: Cannot do 100 points alreadyManchester City boss Pep Guardiola took a bizarre jibe at Liverpool, claiming that Arne Slot's team won't be able to reach the 100-point mark this season. Liverpool are leading the points table at the moment, while City are in 5th. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-lloyd-rues-best-bowler-japrit-bumrahs-absence-bumrah-injury-2680550-2025-02-15",
      "headline": "Former England cricketer rues 'best bowler' Bumrah's absence in Champions TrophyFormer England cricketer David Lloyd said that he would miss fast bowler Jasprit Bumrah's presence in the upcoming ICC Champions Trophy. Bumrah has been ruled out of the tournament due to a lower back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-signs-autographs-for-fans-before-leaving-for-dubai-2680541-2025-02-15",
      "headline": "Watch: Virat Kohli signs autographs for fans before leaving for Champions TrophyStar India batter Virat Kohli was seen signing autographs for fans at the Mumbai airport before leaving for Dubai for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-spotted-at-a-party-with-ms-dhoni-after-no-friendship-claims-2680573-2025-02-15",
      "headline": "Watch: Harbhajan Singh spotted at a party with Dhoni after 'no friendship' claimsFormer India spinner Harbhajan Singh was spotted with MS Dhoni months after claiming that the duo don't talk to each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-pep-guardiola-takes-bizarre-jibe-at-liverpool-cannot-do-100-points-already-2680567-2025-02-15",
      "headline": "Pep Guardiola takes bizarre jibe at Liverpool: Cannot do 100 points alreadyManchester City boss Pep Guardiola took a bizarre jibe at Liverpool, claiming that Arne Slot's team won't be able to reach the 100-point mark this season. Liverpool are leading the points table at the moment, while City are in 5th. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-lloyd-rues-best-bowler-japrit-bumrahs-absence-bumrah-injury-2680550-2025-02-15",
      "headline": "Former England cricketer rues 'best bowler' Bumrah's absence in Champions TrophyFormer England cricketer David Lloyd said that he would miss fast bowler Jasprit Bumrah's presence in the upcoming ICC Champions Trophy. Bumrah has been ruled out of the tournament due to a lower back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-signs-autographs-for-fans-before-leaving-for-dubai-2680541-2025-02-15",
      "headline": "Watch: Virat Kohli signs autographs for fans before leaving for Champions TrophyStar India batter Virat Kohli was seen signing autographs for fans at the Mumbai airport before leaving for Dubai for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-team-india-first-batch-rohit-sharma-virat-kohli-gautam-gambhir-take-off-dubai-2680523-2025-02-15",
      "headline": "Watch: India's first batch takes off for Dubai ahead of Champions TrophyThe first batch of India Champions Trophy squad, including captain Rohit Sharma, Virat Kohli, Gautam Gambhir and other staff members took off for Dubai, where they will be playing all their group stage clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-team-analysis-2680519-2025-02-15",
      "headline": "Will Champions Trophy turn out to be Australia's worst-ever ICC tournament?An injury-stricken Australia fell to their worst defeat in Asia on Friday, February 14, losing Sri Lanka by 174 runs. Without their entire first choice fast bowling group, could the Champions Trophy turn out to be Australia's worst outing ever in ICC tournaments?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-pbks-priyansh-arya-reveals-special-message-from-india-captain-suryakumar-yadav-after-record-feat-2680509-2025-02-15",
      "headline": "PBKS' Priyansh Arya reveals special message from Suryakumar after record featPBKS batter Priyansh Arya revealed the special message he got from India T20I captain Suryakumar Yadav after his record feat in the Delhi Premier League 2024. Priyansh hit 6 sixes in an over during the DPL match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-cannot-win-less-odi-matches-mark-butcher-india-series-defeat-2680490-2025-02-15",
      "headline": "England cannot win Champions Trophy due to lack of ODI experience: ButcherMark Butcher questions England's Champions Trophy readiness, citing a lack of ODI match practice as a major hurdle. Following their 3-0 series loss to India, concerns grew over England's ability to compete against top teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-ben-duckett-england-india-series-loss-remark-r-ashwin-2680489-2025-02-15",
      "headline": "R Ashwin slams Ben Duckett's India series remark: You are hiding your failuresR Ashwin has slammed Ben Duckett after his India series loss remark ahead of the Champions Trophy 2025. Duckett had claimed he didn't care about the loss to India as long as England go on to win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tri-series-final-pakistan-vs-new-zealand-mohammad-rizwan-toss-ahmed-shehzad-2680469-2025-02-15",
      "headline": "Mohammad Rizwan's tri-series final toss call was brainless: Ahmed ShehzadAhmed Shehzad slammed Pakistan captain Mohammad Rizwan and the team management after they decided to bat first in Karachi during the tri-series final. Pakistan's decision backfired as they lost the match to New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-free-ride-is-over-for-fans-whats-jiohotstar-planning-2680451-2025-02-15",
      "headline": "IPL free ride is over for fans, what's JioHotstar planning?The IPL free ride may be over for the Indian cricket fans as JioHotstar is all set to introduce a hybrid subscription model. JioHotstar was formed on Friday, February 14 after the merger between Disney+ Hotstar and JioCinema was completed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-rohit-sharma-ravindra-jadeja-last-icc-event-aakash-chopra-2680449-2025-02-15",
      "headline": "Champions Trophy will be Kohli, Rohit, and Jadeja's last ICC event: ChopraAakash Chopra believes the Champions Trophy 2025 will be the final ICC event for Virat Kohli, Rohit Sharma, and Ravindra Jadeja, as the senior trio may not wait until the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-ben-duckett-england-india-series-loss-remark-r-ashwin-2680489-2025-02-15",
      "headline": "R Ashwin slams Ben Duckett's India series remark: You are hiding your failuresR Ashwin has slammed Ben Duckett after his India series loss remark ahead of the Champions Trophy 2025. Duckett had claimed he didn't care about the loss to India as long as England go on to win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tri-series-final-pakistan-vs-new-zealand-mohammad-rizwan-toss-ahmed-shehzad-2680469-2025-02-15",
      "headline": "Mohammad Rizwan's tri-series final toss call was brainless: Ahmed ShehzadAhmed Shehzad slammed Pakistan captain Mohammad Rizwan and the team management after they decided to bat first in Karachi during the tri-series final. Pakistan's decision backfired as they lost the match to New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-free-ride-is-over-for-fans-whats-jiohotstar-planning-2680451-2025-02-15",
      "headline": "IPL free ride is over for fans, what's JioHotstar planning?The IPL free ride may be over for the Indian cricket fans as JioHotstar is all set to introduce a hybrid subscription model. JioHotstar was formed on Friday, February 14 after the merger between Disney+ Hotstar and JioCinema was completed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-rohit-sharma-ravindra-jadeja-last-icc-event-aakash-chopra-2680449-2025-02-15",
      "headline": "Champions Trophy will be Kohli, Rohit, and Jadeja's last ICC event: ChopraAakash Chopra believes the Champions Trophy 2025 will be the final ICC event for Virat Kohli, Rohit Sharma, and Ravindra Jadeja, as the senior trio may not wait until the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-classics-india-2013-win-ms-dhoni-ishant-sharma-england-2680437-2025-02-15",
      "headline": "Champions Trophy classics: When Dhoni-led India outsmarted England to win titleMS Dhoni's tactical prowess and some brave performances from Ravindra Jadeja and Virat Kohli saw India defeat England by 5 runs to win the Champions Trophy 2013 final in Birmingham. This was the last time India lifted the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-virat-kohli-would-have-decilned-rcb-captaincy-rajat-patidar-kris-srikkanth-2680424-2025-02-15",
      "headline": "Kohli would have declined RCB captaincy to focus on batting: SrikkanthKris Srikkanth believes Virat Kohli himself would have opted out of RCB captaincy, prioritising his batting. He backs Rajat Patidar's appointment, highlighting reduced expectations and a fresh leadership approach ahead of the IPL 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-jake-fraser-mcgurk-poor-form-steve-smith-australia-squad-2680422-2025-02-15",
      "headline": "Champions Trophy: 'Dangerous' Jake Fraser-McGurk gets backing from Steve SmithSteve Smith has backed the 'dangerous' Jake Fraser-McGurk to succeed during the Champions Trophy for Australia after the young batter's poor run of form in ODIs. Fraser-McGurk failed in both the ODIs against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-freestyle-grand-slam-d-gukesh-ends-campaign-winless-loss-to-firouzja-2680408-2025-02-15",
      "headline": "D Gukesh finishes Freestyle campaign without a win after loss to FirouzjaWorld champion D Gukesh finished eighth at the Freestyle Chess Grand Slam, suffering a disappointing campaign without a single win after losing to Alireza Firouzja in the seventh-place playoff in Hamburg, Germany."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-opening-pakistan-firm-tri-series-final-vs-new-zealand-head-coach-aqib-javed-2680404-2025-02-15",
      "headline": "Pakistan firm on Babar opening despite tri-series flop showPakistan head coach Aqib Javed backed Babar Azam to continue opening in the Champions Trophy, expressing confidence in his ability despite recent struggles in the Tri-Series against New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-rcb-vs-gg-richa-ghosh-kanika-ahuja-poistive-game-plan-record-run-chase-2680387-2025-02-15",
      "headline": "RCB's Richa reveals 'positive' game plan with Kanika Ahuja behind GG winRicha Ghosh credits a fearless mindset and coaching strategies for RCB's record WPL run chase, as she and Kanika Ahuja led a stunning comeback win over Gujarat Giants in the season opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-squad-analysis-predicted-xi-team-news-mitchell-santer-kane-williamson-2680023-2025-02-15",
      "headline": "Champions Trophy: Can New Zealand clinch second title without key stars?New Zealand face a fresh challenge in the Champions Trophy with a revamped squad, injury concerns, and a lack of spin options as they aim to secure their second ICC title since their 2000 triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-smriti-mandhana-ash-gardner-record-dismissal-cheeky-response-rcb-2680346-2025-02-15",
      "headline": "Mandhana's cheeky response on 'dinner' with Gardner after record dismissalWPL 2025: Smriti Mandhana cheekily said that she needed to find a way to get runs off Ash Gardner, who dismissed the Indian batter for the ninth time in Women's T20Is.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-rcb-gujarat-giants-richa-ghosh-ellyse-perry-2680304-2025-02-14",
      "headline": "Richa Ghosh, Ellyse Perry help RCB thrash Giants with historic run-chase WPL 2025: Royal Challengers Bengaluru (RCB) scripted history after notching the highest run-chase in the history of the tournament. Richa Ghosh and Ellyse Perry scored fifties to help RCB beat Gujarat Giants by six wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bayern-munich-jamal-musiala-contract-2680292-2025-02-14",
      "headline": "Bayern Munich ties Jamal Musiala to contract until 2030Bayern Munich star Jamal Musiala has committed his future to the club, signing a contract extension through June 2030. The 21-year-old midfielder, who arrived from Chelsea's youth system in 2019, secured a new deal ahead of his previous contract's expiration next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-tri-series-final-score-champions-trophy-rehearsal-karachi-2680287-2025-02-14",
      "headline": "Tame Pakistan lose tri-series final to New Zealand in Champions Trophy rehearsalPakistan (PAK) vs New Zealand (NZ), ODI tri-series final: New Zealand were clinical with both bat and ball as they outclassed Pakistan in the final by five wickets. The two teams will meet in the Champions Trophy opener inKarachi on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/zinedine-zidane-france-coach-didier-deschamps-speculation-2026-2680280-2025-02-14",
      "headline": "Deschamps backs legendary Zinedine Zidane to succeed him as France coachFrance coach Didier Deschamps, who will bring an end to his 14-year stint in 2026, backed Zinedine Zidane to take up the role. Zidane has been out of managerial duty since stepping down as Real Madrid's coach in 2021. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}