{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-when-will-it-be-formed-a-look-at-the-past-trends-2683359-2025-02-21",
      "headline": "8th Pay Commission: When will it be formed? A look at the past trendsA Pay Commission recommends changes to the salary structure, allowances and benefits to be offered to employees depending upon the prevailing economic structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-falls-6-percent-today-rights-issue-subsidiaries-explained-2683333-2025-02-21",
      "headline": "Explained: Why M&M share price tumbled 6% todayThe stock tumbled after the company said it will put money into a rights issue for its two subsidiaries—Mahindra & Mahindra Financial Services (MMFSL) and Mahindra Lifespace Developers (MLDL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-about-volatile-stock-market-check-these-10-best-multibagger-stocks-investment-2683312-2025-02-21",
      "headline": "Worried about volatile stock market? Check these 10 potential multibagger stocksThe most important factor for determining multibagger stocks is to check earnings and growth potential. Investors should seek stocks that consistently deliver revenue and profit, check metrics like PE ratio and dividend yield, and compare their performance with sectoral or broader market trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/religare-enterprises-stock-price-jump-up-to-9-percent-today-burman-family-takeover-2683282-2025-02-21",
      "headline": "Explained: Why Religare Enterprises share price jumped up to 9% today Soon after the announcement, Religare's stock price climbed 8.52% to hit Rs 242 on the Bombay Stock Exchange. At around 11:24 am, shares of the company were trading 2.31% higher at Rs 228.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-may-let-foreign-electric-vehicle-makers-like-tesla-test-market-before-investing-2683262-2025-02-21",
      "headline": "India may let foreign EV makers like Tesla test market before investing: ReportThe government may let foreign electric vehicle makers like Tesla sell cars first and invest later, with final SMEC guidelines expected soon to kickstart local manufacturing incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-fall-as-fii-selling-trumps-tariff-threat-batter-d-street-2683240-2025-02-21",
      "headline": "Sensex, Nifty fall as FII selling, Trump's tariff threat batter D-StreetThe S&P BSE Sensex was down 272.61 points to 75,463.64 at around 9:51 am, while the NSE Nifty50 declined 91.80 points to 22,821.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/punjab-national-bank-interest-rates-pnb-revises-interest-rates-check-new-home-car-and-personal-loan-rates-2683021-2025-02-20",
      "headline": "PNB revises interest rates. Check new home, car and personal loan rates There will be zero processing fees and documentation charges on most of PNB's home loan schemes till March 31, 2025, thereby making housing loans more affordable and more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-smart-pension-plan-check-eligibility-and-other-details-2682975-2025-02-20",
      "headline": "LIC Smart Pension Plan: Check eligibility and other details The Smart Pension Plan requires a minimum investment of Rs 1,00,000, while there is no cap on the maximum purchase limit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-electric-vehicle-set-for-india-entry-with-first-ev-shipment-in-coming-months-report-2682925-2025-02-20",
      "headline": "Tesla set for India entry with first EV shipment in coming months: Report The US carmaker plans to start selling these cars in the three major cities of Mumbai, Delhi, and Bangalore around the third quarter of the year, say reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-surprise-street-performance-london-leaves-fans-in-disbelief-2683349-2025-02-21",
      "headline": "Atif Aslam's surprise street performance in London leaves fans in disbelief. WatchSinger Atif Aslam's video of him performing on a London street has emerged online. This surprise clip has left many fans in disbelief. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-millionaire-tour-what-makes-it-special-2683339-2025-02-21",
      "headline": "Honey Singh Millionaire tour: Reasons why it's unlike any otherYo Yo Honey Singh is set to electrify Mumbai with his high-energy performance as part of the Stage Tak Millionaire tour, promising an unforgettable night of music and nostalgia. Here are a few reasons why one should not miss it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-season-2-on-netflix-what-is-leighton-meester-playing-in-husband-adam-brody-show-2683330-2025-02-21",
      "headline": "Nobody Wants This 2: What is Leighton Meester playing in husband Adam Brody's show?Netflix renewed 'Nobody Wants This' for season 2 last year, and now actor Leighton Meester, known for playing Blair Waldorf in 'Gossip Girl', has joined the show. Her husband, actor Adam Brody, plays the lead character, Noah, in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21",
      "headline": "Comedian Varun Grover's jibe at BeerBiceps: Sounds like Gurgaon's pornstarComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-18-alice-kaushik-tajinder-bagga-and-others-reunite-at-arfeen-saras-goa-bash-2683249-2025-02-21",
      "headline": "BB 18's Alice Kaushik, Tajinder Bagga, others reunite at Arfeen-Sara's Goa bashBigg Boss 18 contestants, including Alice Kaushik, Tajinder Bagga, and Nyrraa Banerjii reunited to celebrate Sara and Arfeen Khan's anniversary in Goa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-cryptic-post-amid-divorce-rumours-with-yuzvendra-chahal-stressed-to-blessed-2683241-2025-02-21",
      "headline": "Dhanashree Verma's cryptic post amid divorce rumours: From stressed to blessedDhanashree Verma recently shared a cryptic message on social media, suggesting a shift from 'stressed to blessed'. This comes amid swirling rumours of a possible divorce with cricketer Yuzvendra Chahal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/popular-tv-actor-dipika-kakar-ibrahim-has-quit-celebrity-masterchef-india-2683158-2025-02-20",
      "headline": "TV actor Dipika Kakar Ibrahim quits Celebrity MasterChef amid health concernsPopular TV actor Dipika Kakar Ibrahim has withdrawn from Celebrity MasterChef due to health issues. Despite the show's support, she prioritised her well-being over the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-singer-honey-singh-arrives-in-mumbai-for-millionaire-concert-stageaajtak-2683117-2025-02-20",
      "headline": "Rapper-singer Honey Singh arrives in Mumbai for sold-out concertHoney Singh is in Mumbai for the much-anticipated Stage AajTak Millionaire concert this Saturday, February 22. With a fantastic set list, the sold-out show promises a night full of magic and madness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/boyfriend-on-demand-jisoo-seo-in-guk-to-star-in-netflixs-next-show-on-virtual-dating-2683100-2025-02-20",
      "headline": "Jisoo, Seo In-guk to star in Netflix's next show on virtual datingJisoo and Seo In-guk are joining hands for an upcoming Netflix drama, Boyfriend on Demand. The show will explore virtual reality dating. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-part-2-set-for-april-release-pedro-pascal-bella-ramsey-hbo-2682924-2025-02-20",
      "headline": "The Last Of Us Part 2 release date announced The Last Of Us Part 2's release date has been announced. The Pedro Pascal show is all set to stream on Prime Video from April 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/eminem-finally-coming-to-india-rappers-leaked-schedule-hints-so-2682961-2025-02-20",
      "headline": "Is Eminem finally coming to India? Rapper's leaked schedule hints soLeaked documents have suggested that Eminem will perform in Mumbai in June 2025 as part of his world tour. The rapper's first visit to India is stirring excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cid-now-streaming-on-netflix-2682942-2025-02-20",
      "headline": "Iconic TV show CID now streaming on NetflixCID on Netflix: The iconic Indian crime series CID is now available on Netflix, allowing fans worldwide to stream the popular show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/will-prime-video-jack-reacher-ever-visit-india-author-lee-child-speaks-2682815-2025-02-20",
      "headline": "Will Prime Video's Jack Reacher ever visit India? Author Lee Child speaksAuthor Lee Child, whose Reacher books have inspired a series on Prime Video, spoke to India Today Digital, about the possibility of seeing his leading character travelling to India in the future. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/shenaz-treasury-reveals-losing-a-brand-deal-after-ranveer-allahbadia-controversy-samay-raina-indias-got-latent-2682822-2025-02-20",
      "headline": "Vlogger Shenaz Treasury reveals losing a brand deal after Ranveer Allahbadia row Former actor and influencer Shenaz Treasury recently shared how she lost a brand deal after Ranveer Allahbadia's controversy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-ibrahim-ali-khan-explains-love-to-miss-briganza-release-date-out-2682803-2025-02-20",
      "headline": "Nadaaniyan: Ibrahim Ali Khan explains love to Miss Briganza; release date outNetflix on Thursday announced the release date of Ibrahim Ali Khan and Khushi Kapoor's 'Nadaaniyan'. The film is a Gen-Z love story and is set in Delhi-Noida. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/palak-muchhal-on-timeless-appeal-of-sanam-teri-kasam-title-song-2682763-2025-02-20",
      "headline": "Palak Muchhal on timeless appeal of Sanam Teri Kasam title song: It's magicalSanam Teri Kasam's title track is topping the music charts. Singer Palak Muchhal calls it surreal, recalls recording it, and hints at a new version. She also discusses Amitabh Bachchan's praise and the evolving music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-daniel-fernandes-samay-raina-ranveer-allahbadia-indias-got-latent-2682707-2025-02-20",
      "headline": "They'll just ask Samay Raina to write a 300-word essay: Comic mocks outrageComedian Daniel Fernandes mocked the outrage over Samay Raina's controversy, joking that he'd only need to write a \"300-word essay.\" He also criticised calls to ban India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-rihanna-promised-to-name-their-next-baby-after-lawyer-joe-tacopina-2682691-2025-02-20",
      "headline": "Rihanna, A$AP Rocky to name next baby after lawyer who helped win caseIn a statement, A$AP Rocky's lawyer revealed that the rapper and his long-time partner Rihanna jokingly promised to name their next child after him. A$AP Rocky was found not guilty in a felony assault trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-trailer-bobby-deol-is-back-as-the-menacing-baba-nirala-2682511-2025-02-19",
      "headline": "Aashram 3 part 2 trailer: Bobby Deol is back as the menacing Baba NiralaAshram Season 3, Part 2 trailer: The much-awaited Aashram returns with Part 2 of Season 3, directed by Prakash Jha. The new season delves into themes of power, betrayal, and revenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/melo-movie-review-slow-burn-netflix-drama-choi-wooshik-park-boyoung-kim-jaewook-2682347-2025-02-19",
      "headline": "Melo Movie review: A slow-burn, mature drama that will stay with youReleased-Fri Feb 14, 2025Melo Movie released in Netflix on February 14. Starring Choi Woo-shik and Park Bo-young, the 10-episode-show deals with love, loss, and grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/new-matthew-perry-documentary-promises-to-dig-deep-into-the-hollywood-tragedy-2682494-2025-02-19",
      "headline": "New Matthew Perry documentary promises to dig deep into the Hollywood tragedyA new Matthew Perry documentary called Matthew Perry: A Hollywood Tragedy will be out later this month, wherein the makers will investigate the untimely death of the Friends star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-first-frost-review-love-trauma-longing-new-chinese-drama-delivers-it-all-2682428-2025-02-19",
      "headline": "The First Frost review: Love, trauma, longing - new Chinese drama delivers it all Released-Thu Feb 20, 2025The First Frost review: This Chinese drama delves into the complexities of love, trauma, and longing, offering a poignant narrative that diverges from typical romance tropes. With its melancholic visuals and dual perspectives, it explores the tangled history between its protagonists, making it a compelling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-mother-on-her-bold-fashion-was-shocked-at-first-but-i-support-her-2682289-2025-02-19",
      "headline": "Uorfi Javed's mother on her bold fashion: Was shocked at first, but I support herUorfi Javed revealed her mother was the first in their family to try Botox. Her mother also recalled her reaction when she saw Uorfi's \"new style\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-trailer-kathir-takes-on-gripping-murder-mystery-with-aishwarya-rajesh-2682271-2025-02-19",
      "headline": "Suzhal 2 trailer: Kathir takes on gripping murder mystery with Aishwarya RajeshThe official trailer of the highly-anticipated second season of the Tamil crime thriller Suzhal - The Vortex was released on Wednesday. Starring Kathir and Aishwarya Rajesh in lead roles, the series will premiere on Prime Video on February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-thankful-humbled-after-aap-rocky-found-not-guilty-in-shooting-case-2682140-2025-02-19",
      "headline": "Rihanna 'thankful, humbled' after A$AP Rocky found not guilty in shooting caseA$AP Rocky was declared not guilty in a felony assault trial, leading to an emotional embrace with Rihanna in court. After the verdict, the singer issued her first statement, expressing relief. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papons-valentines-day-special-show-retro-hits-to-soulful-music-moh-moh-ke-dhaage-to-bulleya-2681678-2025-02-18",
      "headline": "Retro hits to soulful music: Magical evening at Papon's Valentine's Day special showPapon's concert in Delhi, hosted by TV9, was an unforgettable night filled with soulful music. Held at Major Dhyan Chand National Stadium, the event was part of the World Travel and Tourism Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-picks-fathers-video-call-during-live-concert-2681893-2025-02-18",
      "headline": "Watch: Arijit Singh attends father's video call during live concertArijit Singh's live concert in Chandigarh was made memorable by a surprise video call from his father during his performance. The singer shared heartfelt moments from the event on Instagram, expressing gratitude to his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/baarishein-singer-anuv-jain-married-shares-photos-with-wife-2681838-2025-02-18",
      "headline": "Pics: Singer Anuv Jain married, shares photos with wifeSinger Anuv Jain, popular for songs like Baarishein, is now married. He shared photos from the wedding and pre-wedding festivities on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-akhil-sachdeva-on-diljit-dosanjh-infrastructure-remark-2681792-2025-02-18",
      "headline": "Singer Akhil Sachdeva on Diljit Dosanjh's infrastructure remark: I feel it's amazingSinger Akhil Sachdeva discusses the rise of concerts in India, film vs indie music, ticket prices, and Diljit Dosanjh's comments on concert infrastructure. He also stresses the importance of crediting technicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/usaid-funding-voter-turnout-bangladesh-india-report-bjp-congress-donald-trump-claim-2683353-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "USAID funds for India or Bangladesh? BJP, Congress spar over new reportThe alleged USAID grant to India has rocked the political corridors since Donald Trump hinted that the funds might have been used to interfere in the 2024 Lok Sabha polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-says-even-god-cant-fix-bengalurus-urban-challenges-soon-2682977-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Even God can't fix Bengaluru in a year, we need better planning: DK ShivakumarAdmitting that Bengaluru's infrastructural situation was \"extremely challenging\", Karnataka Deputy Chief Minister DK Shivakumar said that the issues wouldn't be resolved soon even if \"God himself descends from heaven and walks on the streets of Bengaluru\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-rekha-gupta-delhi-women-cheated-monthly-allowance-2500-bjp-counter-chief-minister-aap-2683348-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Don't lecture: Rekha Gupta on Atishi's 'BJP cheated Delhi women voters' chargeDelhi Chief Minister Rekha Gupta slammed AAP's Atishi for her comments on the BJP government failing to fulfill its promise of passing a scheme of Rs 2,500 monthly allowance to women in its first cabinet meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-lady-don-zoya-khan-arrested-gangster-hashim-baba-wife-lavish-parties-luxury-brands-drug-syndicate-2683313-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi's 'lady don' arrested: Lavish parties, luxury brands and drug ring tiesPolice had been trying to arrest Zoya for years, but she always managed to evade arrest. However, Special Cell ACP Sanjay Dutt and Inspector Sandeep Dabas finally managed to trap her in a drug case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-vs-pakistan-champions-trophy-cricket-1947-partition-lala-amarnath-fazal-mahmood-ck-nayudu-history-2683094-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How 1947 Partition turned two friends into on-field cricket rivalsLala Amarnath and Fazal Mahmood, two cricketers who grew up playing cricket in Lahore, found themselves on opposite sides of history after India's Partition in 1947. Amarnath was a mentor and friend to Mahmood, and they were supposed to be part of Independent India's first international cricket tour. But history turned them into on-field rivals. While Amarnath captained India, Mahmood led Pakistan's bowling attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-andreas-mogensen-sunita-williams-butch-wilmore-return-space-spat-twitter-retarded-lie-idiot-donald-trump-joe-biden-2683221-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Idiot: Elon Musk feuds with astronaut over Sunita Williams' return from spaceFormer ISS commander Andreas Mogensen called out SpaceX CEO Elon Musk for claiming Joe Biden abandoned Sunita Williams and Butch Wilmore in space for \"political reasons\". Musk was quick to counter, calling Mogensen an \"idiot\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-kachchh-bus-truck-accident-death-injuries-toll-2683374-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 killed in bus-truck collision in Gujarat's Kachchh, more casualties fearedAs many as seven people were killed following a collision between a private bus and a truck in Gujarat's Kachchh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Comic Varun Grover's sharp take on Ranveer Allahbadia, censorship and BeerBicepsComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/has-trump-declared-putin-winner-of-russia-ukraine-war-zelensky-yalta-system-nato-2682841-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Has Trump declared Putin the winner of Russia-Ukraine war?US President Donald Trump might have decided the war in Ukraine in favour of his Russian counterpart, Vladimir Putin. The exclusion of Ukraine from the Riyadh talks, attacks on President Volodymyr Zelenskyy, and the US reportedly halting the supply of weapons to Kyiv are signals enough. Russia now controls 20% of Ukraine's territory and has stalled its NATO membership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kash-patel-fbi-director-confirmed-donald-trump-loyalist-republican-dan-scavino-assistant-bollywood-meme-video-viral-2683177-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Trump aide's 'Malhari' edit to welcome new FBI chief Kash PatelTaking to X, Dan Scavino - who is US President Donald Trump's assistant and White House Deputy Chief of Staff - shared an edited 47-second dance clip from the film 'Bajirao Mastani' to congratulate Kash Patel on becoming the FBI director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rss-imprint-modis-messaging-how-rekha-gupta-got-to-the-hot-seat-in-delhi-2683038-2025-02-20#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS imprint, Modi's messaging: How Rekha Gupta got to the hot seat in DelhiGupta joins the BJP's small league of woman CMs, bringing to the table dyed-in-the-wool Sangh experience, strong organisational skills and an uncontroversial image\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/its-2025-but-has-dating-become-any-easier-for-divorced-indian-women-2683214-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It's 2025, but has dating become any easier for divorced Indian women?Everyone wants to find love—because why not? It's a magical feeling. But in this search for love, do divorced men have it easier than women?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankars-veiled-dig-at-china-during-g20-ministers-meet-in-south-africa-no-room-for-coercion-2683197-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No room for coercion: Jaishankar's veiled dig at China during G20 ministers' meetJaishankar said that the member nations must also recognise that multilateralism itself lies deeply damaged and that the UN and its Security Council are often grid-locked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-usaid-funds-india-voter-turnout-kickback-scheme-bjp-rahul-gandhi-2683261-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump now calls USAID funds to India kickback scheme, BJP targets Rahul GandhiThe BJP was quick to latch on to Trump's latest remarks to accuse Rahul Gandhi of seeking foreign intervention ahead of the 2024 election, citing his comments at an event in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-udhayanidhi-clash-over-get-out-modistalin-social-media-challenge-2683251-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hashtag war: Annamalai dares DMK over 'Get Out Modi', pushes for 'Get Out Stalin'BJP Tamil Nadu President Annamalai challenged DMK's IT wing to a social media battle, asking them to tweet 'Get Out Modi' while he would post 'Get Out Stalin' at 6 am. His remarks came after Udhayanidhi Stalin warned that Prime Minister Modi would face such slogans if Hindi imposition continued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-wants-to-crash-the-space-station-earlier-than-planned-can-he-2683316-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can Elon Musk really crash the Space Station earlier than planned?Elon Musk's SpaceX has been contracted by Nasa to slowly deorbit the space station at the end of its life in 2030. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tesla-ceo-elon-musk-waves-chainsaw-symbolising-us-federal-spending-cuts-under-doge-javier-milei-2683182-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'For bureaucracy': Elon Musk waves chainsaw gifted by Argentina's MileiThe Department of Government Efficiency (DOGE) headed by Tesla CEO and billionaire Elon Musk, claims to have saved $55 billion by February 19, with a single contract being worth USD 8 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-millionaire-tour-what-makes-it-special-2683339-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Honey Singh Millionaire tour: Reasons why it's unlike any otherYo Yo Honey Singh is set to electrify Mumbai with his high-energy performance as part of the Stage Tak Millionaire tour, promising an unforgettable night of music and nostalgia. Here are a few reasons why one should not miss it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/grimes-public-appeal-ex-boyfriend-elon-musk-help-child-medical-crisis-now-deleted-x-posts-2683360-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grimes asks Elon Musk for help over their child's 'medical crisis' in now-deleted X postsGrimes also expressed frustration over Elon Musk's lack of response, emphasising the urgency of the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-jai-sholay-gabbar-jasprit-bumrah-india-2683274-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shami: The Jai of Indian cricket's Sholay, overshadowed by Gabbar BumrahTime travel to the 90s and the 2000s when Javagal Srinath and Zaheer Khan shared the burden of Indian pace bowling with trundlers like Manoj Prabhakar. Had Mohammed Shami been part of any of these teams, he would have been a legend, a superstar whose face could have launched a million brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-claims-brics-india-china-broke-up-threatened-150-tariffs-undermining-dollar-2683205-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump claims BRICS 'broke up' after tariff threat: Haven't heard from them latelyTrump claims BRICS, which includes India, 'broke up' after he threatened 150% tariffs for undermining dollar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mere-husband-ki-biwi-review-rating-arjun-kapoor-bhumi-pednekar-rakul-preet-2683253-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mere Husband Ki Biwi review: Arjun Kapoor shines in this chaotic comedyReleased-Fri Feb 21, 2025Mere Husband Ki Biwi sets up a fun premise but loses steam with a chaotic climax. Arjun Kapoor shines, while Rakul Preet and Bhumi Pednekar struggle to leave an impact. Harsh Gujral steals scenes with his comic timing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ashish-chanchlani-india-got-latent-vulgar-joke-row-case-petition-supreme-court-ranveer-allahbadia-samay-raina-2683245-2025-02-21#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Top court clubs Ashish Chanchlani, Ranveer Allahbadia cases in vulgar joke rowYouTuber Ashish Chanchlani, who has been named in the FIR registered by Assam Police, had approached the Supreme Court seeking the cancellation of the case of transfer of the same to Mumbai, citing it was filed in the latter first. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-boards-martin-scorsese-hawaii-set-crime-drama-2683336-2025-02-21",
      "headline": "Dwayne Johnson boards Martin Scorsese's Hawaii-set crime dramaAcclaimed director Martin Scorsese will now work with Dwayne 'The Rock' Johnson in his next project, which is being touted as a crime drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/daniel-craig-on-amazons-james-bond-takeover-2683318-2025-02-21",
      "headline": "Daniel Craig on Amazon's James Bond takeover: Respect for producers remains constantHollywood star Daniel Craig has finally reacted to Amazon's surprise takeover of the James Bond franchise. The actor expressed his longstanding admiration for Bond producers, Michael Wilson and Barbara Broccoli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-7-detailed-report-vicky-kaushal-film-roars-past-rs-200-crore-but-will-it-beat-uri-the-surgical-strike-2683284-2025-02-21",
      "headline": "Chhaava box office Day 7: Vicky's film roars past Rs 200 crore, will it beat Uri?'Chaava' has wrapped up its first week at the box office on a stupendous note. The Vicky Kaushal film has entered the Rs 200 crore club, and has become Kaushal's second after 'Uri: The Surgical Strike' to do so. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mere-husband-ki-biwi-review-rating-arjun-kapoor-bhumi-pednekar-rakul-preet-2683253-2025-02-21",
      "headline": "Mere Husband Ki Biwi review: Arjun Kapoor shines in this chaotic comedyReleased-Fri Feb 21, 2025Mere Husband Ki Biwi sets up a fun premise but loses steam with a chaotic climax. Arjun Kapoor shines, while Rakul Preet and Bhumi Pednekar struggle to leave an impact. Harsh Gujral steals scenes with his comic timing."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pat-cummins-injury-return-date-ipl-2025-target-2683386-2025-02-21",
      "headline": "After missing Champions Trophy, Pat Cummins targets IPL 2025 returnAustralian skipper Pat Cummins is eyeing a return in IPL 2025 after missing the Champions Trophy due to injury. While recovering, he's balancing family time and rehabilitation, ensuring full fitness for upcoming cricketing commitments, including the World Test Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-vs-south-africa-cricket-live-score-today-match-karachi-updates-2683364-2025-02-21",
      "headline": "AFG vs SA LIVE: Dark horse Afghanistan eye early scalp in KarachiAfghanistan (AFG) vs South Africa (SA), Champions Trophy Live Cricket Score and Updates: Afghanistan will make their debut in the premier eight-team tournament today in Karachi. They face South Africa, who are heading into the tournament after the heartbreak of the T20 World Cup last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kerala-vs-gujarat-ranji-trophy-historic-miracle-catch-ahmedabad-2683354-2025-02-21",
      "headline": "Watch: Kerala edge closer to their first-ever Ranji final after miraculous catchRanji Trophy 2024-25: With two runs needed to take a decisive first-innings lead, Gujarat were left heartbroken after a miraculous catching effort from Kerala. The visiting team are all but through to the final of the domestic tournament for the first time in their history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-hans-niemann-cheating-joe-rogan-podcast-2683314-2025-02-21",
      "headline": "Carlsen recalls Niemann cheating controversy on Joe Rogan podcastMagnus Carlsen has finally addressed the 2022 cheating scandal involving Hans Niemann, revealing how Niemann's gameplay raised suspicions. He also acknowledged that while most have moved on, trust issues still persist in the chess community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-knocked-out-qatar-open-jiri-lehecka-2683281-2025-02-21",
      "headline": "Alcaraz crashes out of Qatar Open after shock defeat in quarter-finalCarlos Alcaraz suffered a shock Qatar Open exit after losing to Jiri Lehecka in the quarter-finals. The Czech player secured the biggest win of his career, shaking up the tournament with another major upset following Djokovic's early elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-jai-sholay-gabbar-jasprit-bumrah-india-2683274-2025-02-21",
      "headline": "Shami: The Jai of Indian cricket's Sholay, overshadowed by Gabbar BumrahTime travel to the 90s and the 2000s when Javagal Srinath and Zaheer Khan shared the burden of Indian pace bowling with trundlers like Manoj Prabhakar. Had Mohammed Shami been part of any of these teams, he would have been a legend, a superstar whose face could have launched a million brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-comeback-india-vs-bangladesh-dubai-2683246-2025-02-21",
      "headline": "8 hours a day at NCA: Mohammed Shami's relentless grind for Champions Trophy gloryMohammed Shami stamped his authority with the ball in India's Champions Trophy opener against Bangladesh. Shami picked up 5 wickets and overtook Zaheer Khan as India's most successful bowler in the ICC white-ball tournaments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-slow-over-rate-penalty-new-zealand-mohammed-rizwan-guilty-2683226-2025-02-21",
      "headline": "Champions Trophy: Pakistan fined for slow-over rate against New ZealandPakistan were fined 5 percent of their match fee for maintaining a slow over-rate against New Zealand in their Champions Trophy opener, adding to their struggles as they prepare for a high-stakes clash against India on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-towhid-hridoy-century-india-vs-bangladesh-build-confidence-2683208-2025-02-21",
      "headline": "Champions Tropphy: Hridoy hopeful century vs India will build confidenceBangladesh batter Towhid Hridoy expressed optimism after his maiden ODI century against India in the Champions Trophy opener on February 20, believing the knock will boost his confidence and play a crucial role in shaping his international cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammed-shami-india-vs-bangladesh-dedicates-to-father-role-model-2683194-2025-02-21",
      "headline": "Shami dedicates bowling brilliance vs Bangladesh to 'role model' fatherIndia's veteran pacer Mohammed Shami dedicated his stunning five-wicket haul against Bangladesh in the Champions Trophy opener to his father, whom he hailed as his greatest inspiration and role model, crediting him for shaping his cricketing journey and resilience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly accident: Former India captain escapes unhurt after collision on roadFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan University. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-comeback-india-vs-bangladesh-dubai-2683246-2025-02-21",
      "headline": "8 hours a day at NCA: Mohammed Shami's relentless grind for Champions Trophy gloryMohammed Shami stamped his authority with the ball in India's Champions Trophy opener against Bangladesh. Shami picked up 5 wickets and overtook Zaheer Khan as India's most successful bowler in the ICC white-ball tournaments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-slow-over-rate-penalty-new-zealand-mohammed-rizwan-guilty-2683226-2025-02-21",
      "headline": "Champions Trophy: Pakistan fined for slow-over rate against New ZealandPakistan were fined 5 percent of their match fee for maintaining a slow over-rate against New Zealand in their Champions Trophy opener, adding to their struggles as they prepare for a high-stakes clash against India on February 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-towhid-hridoy-century-india-vs-bangladesh-build-confidence-2683208-2025-02-21",
      "headline": "Champions Tropphy: Hridoy hopeful century vs India will build confidenceBangladesh batter Towhid Hridoy expressed optimism after his maiden ODI century against India in the Champions Trophy opener on February 20, believing the knock will boost his confidence and play a crucial role in shaping his international cricketing career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-mohammed-shami-india-vs-bangladesh-dedicates-to-father-role-model-2683194-2025-02-21",
      "headline": "Shami dedicates bowling brilliance vs Bangladesh to 'role model' fatherIndia's veteran pacer Mohammed Shami dedicated his stunning five-wicket haul against Bangladesh in the Champions Trophy opener to his father, whom he hailed as his greatest inspiration and role model, crediting him for shaping his cricketing journey and resilience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sourav-ganguly-accident-durgapur-expressway-uninjured-2683198-2025-02-21",
      "headline": "Sourav Ganguly accident: Former India captain escapes unhurt after collision on roadFormer Indian captain Sourav Ganguly narrowly avoided a major accident en route to Burdwan University. Fortunately, no one was injured in the accident. However, two cars in Ganguly's convoy suffered minor damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-india-vs-pakistan-no-special-mindset-needed-2683192-2025-02-21",
      "headline": "5-star Shami not stressing over India vs Pakistan: No special mindsetMohammed Shami remains unfazed ahead of India's high-stakes Champions Trophy clash against Pakistan, trusting his momentum from a stellar five-wicket haul against Bangladesh instead of adopting a special mindset for the blockbuster encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-robin-uthappa-on-virat-kohlis-form-india-vs-bangladesh-ind-vs-ban-2683155-2025-02-21",
      "headline": "Virat Kohli more worried about middling the ball instead of scoring: Robin UthappaFormer India batter Robin Uthappa commented on Virat Kohli's poor form after he got dismissed for 22 in India's first match of the ICC Champions Trophy 2025 against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-harbhajan-singh-india-lession-interview-2683165-2025-02-21",
      "headline": "Harbhajan Singh wants India to learn 'one lesson' despite win against Bangladesh  Champions Trophy: Former Indian spinner Harbhajan Singh said that India should try and put around 280-300 runs on the board while batting first to put pressure on the opposition on the slow and low pitches at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-shubman-gill-reactions-2683159-2025-02-21",
      "headline": "Who said what after Shami, Shubman Gill help India beat Bangladesh Champions Trophy: Rohit Sharma praised Shubman Gill and Mohammed Shami for their incredible performance after India beat Bangladesh by six wickets. Shanto, on the other hand, said that losing wickets in the powerplay pushed the Tigers back on the backfoot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-shami-flying-kiss-father-2683142-2025-02-20",
      "headline": "Shami reveals reason behind 'flying kiss' after 5-wicket haul vs BangladeshChampions Trophy 2025: Fast bowler Mohammed Shami said that he did the flying kiss celebration for his father after taking the five-wicket haul against Bangladesh on Thursday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-scores-century-vs-bangladesh-ind-vs-ban-2683129-2025-02-20",
      "headline": "Shubman Gill repays Rohit Sharma's faith, hits another ton as vice captainStar India batter Shubman Gill scored a magnificent hundred to script a six-wicket win for India in their first game of the ICC Champions Trophy 2025 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-axar-patel-catch-2683123-2025-02-20",
      "headline": "Rohit Sharma plans to take Axar Patel out for 'dinner' after drop catch on hat-trickChampions Trophy: Rohit Sharma said that he plans to take Axar Patel out for dinner after dropping a catch off his bowling during India's match against Bangladesh at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-mohammed-shami-highlights-2683111-2025-02-20",
      "headline": "Gritty Gill, sensational Shami help India overcome tricky Bangladesh test in DubaiIndia begin their Champions Trophy 2025 campaign with a win over tricky Bangladesh. Shubman Gill's gritty century and Mohammed Shami's terrific 5-wicket haul were the highlight of India's win on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-shami-flying-kiss-father-2683142-2025-02-20",
      "headline": "Shami reveals reason behind 'flying kiss' after 5-wicket haul vs BangladeshChampions Trophy 2025: Fast bowler Mohammed Shami said that he did the flying kiss celebration for his father after taking the five-wicket haul against Bangladesh on Thursday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-scores-century-vs-bangladesh-ind-vs-ban-2683129-2025-02-20",
      "headline": "Shubman Gill repays Rohit Sharma's faith, hits another ton as vice captainStar India batter Shubman Gill scored a magnificent hundred to script a six-wicket win for India in their first game of the ICC Champions Trophy 2025 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-axar-patel-catch-2683123-2025-02-20",
      "headline": "Rohit Sharma plans to take Axar Patel out for 'dinner' after drop catch on hat-trickChampions Trophy: Rohit Sharma said that he plans to take Axar Patel out for dinner after dropping a catch off his bowling during India's match against Bangladesh at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-shubman-gill-mohammed-shami-highlights-2683111-2025-02-20",
      "headline": "Gritty Gill, sensational Shami help India overcome tricky Bangladesh test in DubaiIndia begin their Champions Trophy 2025 campaign with a win over tricky Bangladesh. Shubman Gill's gritty century and Mohammed Shami's terrific 5-wicket haul were the highlight of India's win on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-axar-patel-reacts-to-rohit-sharmas-catch-drop-india-vs-bangladesh-2683104-2025-02-20",
      "headline": "Axar Patel recalls emotions prior to Rohit's catch drop: Almost began celebratingIndia all-rounder Axar Patel opened up on the roller coaster of emotions which went inside his head just before Rohit Sharma dropped Bangladesh's Jaker Ali's catch which denied him a hat-trick during the Champions Trophy 2025 match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afghanistan-south-africa-rashid-khan-bavuma-2683095-2025-02-20",
      "headline": "Afghanistan aim to repeat past heroics against South Africa on debut Champions Trophy: Afghanistan are looking to make their debut a memorable one when they face South Africa on February 21 at the National Stadium in Karachi. The Afghans have won three bilateral ODI series on the trot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-karachi-pitch-report-playing-xi-2683088-2025-02-20",
      "headline": "AFG vs SA, all you need to know: Karachi pitch report, playing XIChampions Trophy: Afghanistan and South Africa begin their campaign in Karachi on Friday, February 21. Both teams have done well in the ICC tournaments in recent past and will look to continue their charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-retirement-comments-ipl-2683055-2025-02-20",
      "headline": "MS Dhoni addresses retirement rumours, gives life lessons in heartfelt speechLegendary MS Dhoni has addressed the topic of his retirement once again. The former CSK captain, who stepped away from international cricket after the ODI World Cup 2019 said that he wants to enjoy his cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-hashmatullah-shahidi-press-conference-ahead-of-south-africa-game-2683030-2025-02-20",
      "headline": "Not here just to participate, our aim is to win the final: Hashmatullah ShahidiAfghanistan Captain Hashmatullah Shahidi has made it clear to the rest of the teams in the ICC Champions Trophy 2025 that they're not here just to participate and will give their all to win the trophy. Afghanistan start their campaign on February 21 vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-sachin-tendulkar-11k-record-2683024-2025-02-20",
      "headline": "Rohit Sharma faster than Sachin Tendulkar to 11,000 ODI runs, trails Virat KohliChampions Trophy 2025: Rohit Sharma reached the landmark of 11K runs in ODIs during India's match against Najmul Hossain Shanto's Bangladesh on Thursday, February 20 at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-hashmatullah-shahidi-sends-warning-to-south-africa-afg-vs-sa-2683012-2025-02-20",
      "headline": "Hashmatullah Shahidi sends warning to South Africa: We beat them 2-1 in SharjahAfghanistan captain Hashmatullah Shahidi has sent a warning to South Africa ahead of their first game in the ICC Champions Trophy 2025 on February 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/satwiksairaj-rankireddy-father-kasi-viswanatham-death-2682972-2025-02-20",
      "headline": "Badminton star Satwiksairaj Rankireddy's father, 65, dies due to cardiac arrestIndia badminton star Satwiksairaj Rankireddy's father R Kasi Viswanatham died due to cardiac arrest. Satwik's father was set to meet his son in New Delhi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-world-record-200-wickets-mitchell-starc-2682974-2025-02-20",
      "headline": "Mohammed Shami sets world record, faster than Mitchell Starc to 200 ODI wickets Champions Trophy 2025: Mohammed Shami picked up his 200th wicket in India's Group A match against Bangladesh in Dubai. The senior pacer returned to fine form, leading India's bowling attack in the marquee tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-champions-trophy-shoaib-akhtar-fumes-at-pakistan-for-timid-batting-vs-new-zealand-2682943-2025-02-20",
      "headline": "Champions Trophy: Shoaib Akhtar fumes at Pakistan for timid batting vs New Zealand Former Pakistan fast bowler Shoaib Akhtar has slammed the national side for their timid batting approach in their opening match of the ICC Champions Trophy vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-vs-new-zealand-babar-azam-wasim-akram-joke-2682944-2025-02-20",
      "headline": "Watch: Wasim Akram's hilarious take on Babar Azam's slow knock vs New ZealandChampions Trophy 2025: Wasim Akram came up with a hilarious analogy to describe Babar Azam's 90-ball 64, which cost Pakistan their opening match against New Zealand in Karachi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azams-poor-intent-at-start-cost-pakistan-game-vs-new-zealand-2682596-2025-02-20",
      "headline": "Babar Azam's poor intent at start cost Pakistan vs New Zealand: Sanjay BangarFormer India cricketer and batting coach Sanjay Bangar said that Babar Azam's poor intent with the bat cost Pakistan dearly in their opening match of the Champions Trophy vs New Zealand."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}