{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-gold-price-has-become-cheaper-in-india-than-in-gulf-uae-qatar-oman-singapore-2634724-2024-11-17",
      "headline": "Explained: Why Gold has become cheaper in India than in Gulf and SingaporeGold prices in India have become cheaper than in some traditional gold-buying destinations, like the United Arab Emirates, Qatar, Oman, and Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fpis-stock-market-selloff-q2-earnings-downgrade-trump-trade-high-valuations-ipos-2634365-2024-11-16",
      "headline": "Why are foreign investors exiting India? 3 reasons behind stock market selloffExperts suggest that the trajectory of future FPI flows will largely depend on how India maintains macroeconomic stability and improves corporate earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-gmp-price-band-key-dates-other-details-2634349-2024-11-16",
      "headline": "NTPC Green Energy IPO: Check key dates, price band, and latest GMPNTPC Green Energy IPO: The IPO is positioned as one of the largest in India this year, alongside Hyundai Motor India Ltd. and Swiggy Ltd. The anchor book will open for subscription on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-biggest-weekly-drop-in-3-years-should-you-buy-sell-expert-views-2634341-2024-11-16",
      "headline": "Gold rates see biggest weekly drop in 3 years. Good time to buy?Despite the fall in prices, analysts remain bullish about the yellow metal's long-term potential. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-listings-fall-flat-is-ipo-market-losing-its-charm-hyundai-swiggy-ntpc-green-energy-2633955-2024-11-15",
      "headline": "Is the IPO craze over? Stock market correction hits public listingsSubscription figures for IPOs have dropped in recent months. Global economic uncertainty, rising interest rates, and tighter liquidity have made investors cautious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-details-10-things-to-know-before-subscribing-review-price-gmp-2633922-2024-11-15",
      "headline": "NTPC Green Energy IPO: 10 things to know before subscribingNTPC Green Energy is a wholly-owned subsidiary of NTPC Ltd, focusing on renewable energy projects through both organic growth and acquisitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-i-dont-believe-in-work-life-balance-6-day-workweek-debate-2633876-2024-11-15",
      "headline": "I don't believe in work-life balance: Narayana MurthyNarayana Murthy said that hard work is key to national progress, citing Prime Minister Narendra Modi's long work hours as an example. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atv-projects-india-lic-multibagger-stock-rs-1-lakh-investment-now-worth-rs-8-lakh-2633835-2024-11-15",
      "headline": "Rs 1 lakh investment now worth Rs 8 lakh: Check this LIC-backed penny stockATV Projects India has shown remarkable growth over recent years, making it one of the standout multibagger stocks in the Indian market. Since the start of 2024, the stock has risen by over 110%, moving from Rs 15.25 to Rs 32.50 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-free-fall-good-time-to-invest-mutual-funds-2633831-2024-11-15",
      "headline": "Stock markets in free fall: Is it a good time to invest in mutual funds?With the Sensex and Nifty tumbling nearly 10% from their peaks, investors are wondering: Could this market correction be a blessing in disguise for mutual fund investors?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-crisis-dalal-street-sensex-nifty-outlook-brokerage-expert-views-2633803-2024-11-15",
      "headline": "Stock markets in correction phase: More turbulence ahead on Dalal Street?The Sensex and Nifty have tumbled nearly 10% from their recent peaks, leaving investors wondering: Is this just a healthy pause, or should they brace for more turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-hikes-home-loan-interest-rates-by-5-basis-points-check-details-november-15-2633789-2024-11-15",
      "headline": "SBI hikes home loan interest rates by 5 basis points. Check details  The change in interest rates is effective from November 15, and will make borrowing costs slightly higher for customers seeking loans from the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-share-price-target-rs-2000-brokerages-bullish-icici-motilal-oswal-2633769-2024-11-15",
      "headline": "Signature Global shares at over Rs 2,000? These 2 brokerages are bullishShares of Signature Global rose nearly 3.5% in the previous trading session after multiple brokerages raised their target price. Its total market capitalisation stands at 18,238.99 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-wants-rbi-to-cut-interest-rates-shaktikanta-das-responds-mpc-meeting-december-2633674-2024-11-15",
      "headline": "Piyush Goyal wants RBI to cut interest rates. Shaktikanta Das respondsUnion Minister Piyush Goyal described the link between food inflation and interest rates as an 'absolutely flawed theory.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-infosys-founder-stands-firm-on-6-day-workweek-pm-modi-2633642-2024-11-15",
      "headline": "I'll take this with me to grave: Narayana Murthy defends 6-day workweek viewNarayana Murthy, who has been vocal about his views on work ethics and productivity, expressed disappointment over India's move from a six-day workweek to a five-day one in 1986. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wolf-in-sheeps-clothing-kutniti-report-flags-elon-musk-starlink-us-military-intelligence-ties-india-entry-plans-2633628-2024-11-15",
      "headline": "'Wolf in sheep's clothing': Report flags Starlink's US military tiesStarlink operates through a constellation of satellites to provide internet access worldwide, a model distinct from traditional telecom services that rely on ground-based towers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-nse-bse-closed-today-holiday-guru-nanak-jayanti-no-trading-sensex-nifty-2633616-2024-11-15",
      "headline": "Stock markets closed today for Guru Nanak Jayanti holiday?Sensex and Nifty, have faced a six-session losing streak, marked by selling pressure from foreign institutional investors (FIIs) and worries over rising retail inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-schools-shift-online-mode-for-all-classes-except-10-and-12-aqi-air-quality-2634908-2024-11-17",
      "headline": "Delhi pollution worsens, schools shift to online mode for all classes except 10 and 12 starting tomorrowDelhi pollution worsens, schools shift to online mode for all classes except 10 and 12 starting tomorrow"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-quality-index-grap-vehicles-banned-caqm-weather-smog-fog-2634906-2024-11-17",
      "headline": "All that is banned as GRAP-IV pollution curbs imposed in Delhi from tomorrowThe restrictions were announced by the Commission for Air Quality Management (CAQM), which also asked the Delhi government to take a call on running of vehicles on an \"odd and even\" basis, and switching classes 6-9 to online mode."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-conflict-union-minister-amit-shah-reviews-unrest-kuki-meitei-key-meeting-tomorrow-12-pm-say-sources-2634855-2024-11-17",
      "headline": "Amit Shah reviews Manipur security, key meeting tomorrow at 12 pm: SourcesA curfew was imposed in Imphal West and East after six people from Meitei groups, who were allegedly kidnapped by militants, were found dead. Internet was suspended in several districts as mobs attacked the homes of MLAs and also indulged in vandalism. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sheikh-hasina-extradition-india-bangladesh-muhammad-yunus-chief-advisor-2634903-2024-11-17",
      "headline": "We will seek Sheikh Hasina's extradition from India: Bangladesh's Muhammad YunusThe interim government in Bangladesh has accused Sheikh Hasina of ordering brutal suppression of the Anti-Discrimination Students Movement, resulting in over 700 deaths during the July-August protests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-trailer-watch-allu-arjun-becomes-wildfire-rashmika-mandanna-fahadh-faasil-shine-2634840-2024-11-17",
      "headline": "Pushpa 2 The Rule trailer: Allu Arjun becomes 'wildfire', Rashmika-Fahadh shineThe trailer of Pushpa 2: The Rule was released at a grand event in Patna on Sunday, November 17. The video promises an entertaining story, with action, romance and a lot of thrills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/anti-pollution-restrictions-grap-iv-delhi-monday-air-quality-worsens-severe-plus-2634890-2024-11-17",
      "headline": "GRAP-IV in Delhi from tomorrow: Trucks' entry, operations of some vehicles bannedStage IV of GRAP will be imposed on Monday after the air quality on Sunday breached the 'severe plus' mark."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gorakhpur-man-arrested-hit-sleeping-women-ajay-nishad-breaking-homes-looting-2634886-2024-11-17",
      "headline": "UP man used to break into homes, hit sleeping women with sharp objects; arrestedThe accused, Ajay Nishad, used to target isolated homes in Gorakhpur village during late nights, attack women with sharp objects and flee with their valuables, police said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-praises-film-the-sabarmati-report-vikrant-massey-2002-godhra-gujarat-2634791-2024-11-17",
      "headline": "Truth coming out: PM praises 'The Sabarmati Report', film on Godhra train burningPrime Minister Narendra Modi said that a \"fake narrative can persist only for a limit period of time,\" as he heaped praise on 'The Sabarmati Report'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/robert-f-kennedy-donald-trump-secretary-department-of-health-us-elections-once-claimed-brainworm-after-india-visit-2634853-2024-11-17",
      "headline": "RFK Jr, now Trump's health czar, once claimed he got brainworm after India visitThis claim, which Kennedy first disclosed during a 2012 deposition and later elaborated on in interviews, has resurfaced online following his appointment as the secretary of the Department of Health and Human Services (HHS) by Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indian-women-storm-whisky-world-make-alcohol-drink-companies-take-note-whiskey-tasting-club-single-malt-2634586-2024-11-17",
      "headline": "Indian women storm whisky world, make alcobev companies take noteWhisky Culture in India: Women, long considered wine and cocktail connoisseurs, are experimenting and drinking whisky in such large numbers that they are making whisky makers take note and create products for them. This is how women in India are influencing whiskies and shaping the whisky world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashok-gahlot-quits-aap-delhi-minister-arvind-kejriwal-bjp-lt-governor-atishi-2634843-2024-11-17",
      "headline": "What happened in months leading up to Kailash Gahlot's AAP exitKailash Gahlot, Delhi Transport Minister and senior Aam Aadmi Party (AAP) leader, resigned citing controversies surrounding the party just months ahead of Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-enjoy-sunday-visit-to-delhi-qutub-minar-with-sons-2634870-2024-11-17",
      "headline": "Nayanthara-Vignesh enjoy Sunday visit to Delhi's Qutub Minar with sons Actor Nayanthara was seen at Delhi's Qutub Minar on Sunday, November 17. Accompanying her were her husband Vignesh Shivan and their adorable twin sons, Uyir and Ulag. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-tensions-simmer-within-himachal-congress-leadership-2634504-2024-11-16",
      "headline": "Why tensions simmer within Himachal Congress leadershipThe high command faces the challenge of balancing the competing interests of the camps led by chief minister Sukhvinder Sukhu and the party's state chief Pratibha Singh"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mangaluru-private-resort-swimming-pool-women-die-drowning-someshwara-uchila-2634805-2024-11-17",
      "headline": "Woman drowns in swimming pool, two others die in attempt to rescue her The women entered the swimming pool in a private resort in Mangaluru on Sunday. Just a few minutes after entering the pool, one of the women drowned, and in an attempt to rescue her, the other two women also drowned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/national-peoples-party-npp-manipur-government-n-biren-singh-bjp-six-bodies-found-2634852-2024-11-17",
      "headline": "Biren Singh-led Manipur government failed: Conrad Sangma's party withdraws supportIn a strong-worded letter to BJP chief JP Nadda, the National People's Party said that Manipur government, under the leadership of Chief Minister N Biren Singh, has completely failed to control the ethnic violence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/spacex-to-launch-4700-kg-indian-gsat-n2-satellite-why-isro-has-to-rely-on-elon-musk-2634692-2024-11-17",
      "headline": "Why Isro is relying on Elon Musk's SpaceX to launch Indian satelliteThe satellite is designed to enhance India's communication infrastructure, featuring a Ka-band high-throughput communications payload with a mission lifespan of 14 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-science-431-15-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/former-raw-officer-vikas-yadv-delhi-court-extortion-kidnapping-plot-to-kill-khalistani-gurpatwant-pannun-2634744-2024-11-17",
      "headline": "Exposed to serious threat: Ex-RAW officer charged for 'plotting to kill' PannunThe former RAW officer contended that his personal details, including his address, background, and photographs, have been published worldwide, exposing him to a serious and imminent threat to his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-minister-kailash-gahlot-resigns-from-aam-aadmi-party-2634709-2024-11-17",
      "headline": "Delhi Minister Kailash Gahlot resigns from AAP; party claims ED, CBI pressureDelhi's Transport Minister Kailash Gahlot has resigned from both Aam Aadmi Party and the Council of Ministers, citing unfulfilled promises and controversies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/inside-naga-chaitanya-sobhita-dhulipala-wedding-invite-basket-food-clothes-and-flowers-2634750-2024-11-17",
      "headline": "Inside Naga Chaitanya-Sobhita's wedding invite basket: Food, clothes and flowersNaga Chaitanya and Sobhita Dhulipala will be getting married on December 4 this year. A few pictures of their wedding invitation have now surfaced on the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-trailer-launch-in-patna-why-allu-arjun-chose-bihar-for-the-grand-event-2634679-2024-11-17",
      "headline": "Pushpa 2 trailer launch in Patna: Why Allu Arjun chose Bihar for the grand eventPushpa 2: The Rule trailer will be launched in Patna today, November 17. But, why did a Telugu superstar like Allu Arjun decide not to launch the event in the South? Here's everything you need to know about the big event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/did-elon-musk-crack-up-on-memes-next-to-us-president-elect-donald-trump-at-ufc-event-tesla-ceo-reacts-2634838-2024-11-17",
      "headline": "Did Musk crack up looking at memes next to Trump? Tesla CEO reacts to viral postDonald Trump entered the UFC arena to loud music. He also raised his fist towards the crowd, recreating a moment from his Pennsylvania rally, where he narrowly escaped death. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/caught-on-cctv-video-karnataka-congress-leader-deviprasad-shetty-son-prajwal-crushes-biker-thar-suv-man-killed-2634663-2024-11-17",
      "headline": "Caught on CCTV: Karnataka Congress leader's son crushes biker with SUVPolice seized the SUV involved on the same day as the incident. Prajwal was taken into custody on November 14; however, he was released on bail soon after."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-the-rule-trailer-4-million-telugu-25-million-hindi-views-in-an-hour-2634883-2024-11-17",
      "headline": "Pushpa 2 The Rule trailer: 4.3 million Telugu, 2.9 million Hindi views in an hourThe highly anticipated trailer for Pushpa 2: The Rule was released on November 17 amid much fanfare in Patna. Within an hour of its release, the Telugu trailer garnered a staggering 4.3 million views on YouTube. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-bows-down-to-bihar-crowd-at-pushpa-2-trailer-launch-event-jhukega-nahi-par-aaj-2634877-2024-11-17",
      "headline": "Allu Arjun 'bows down' to the Bihar crowd at Pushpa 2 event: Jhukega nahi par...Actor Allu Arjun seemed overwhelmed by the turnout at the trailer launch event of Pushpa 2: The Rule in Patna. He thanked the people of Bihar in his speech, and bowed down to them on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-enjoy-sunday-visit-to-delhi-qutub-minar-with-sons-2634870-2024-11-17",
      "headline": "Nayanthara-Vignesh enjoy Sunday visit to Delhi's Qutub Minar with sons Actor Nayanthara was seen at Delhi's Qutub Minar on Sunday, November 17. Accompanying her were her husband Vignesh Shivan and their adorable twin sons, Uyir and Ulag. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-trailer-twitter-reactions-allu-arjun-fans-celebrate-iconic-swag-of-pushpa-raj-2634866-2024-11-17",
      "headline": "Pushpa 2 trailer reactions: Allu Arjun's fans celebrate iconic swag of Pushpa RajThe fans shared their excitement on social media after the launch of Pushpa 2: The Rule in Patna. Many also highlighted Allu Arjun's iconic performance as Pushpa Raj in the film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-cricket-board-jason-gillespie-head-coach-statement-2634907-2024-11-17",
      "headline": "PCB dismisses rumours of sacking Gillespie as Pakistan head coach Pakistan Cricket Board dismissed the reports of Aqib Javed replacing Jason Gillespie as the head coach of the national team across formats. Gillespie will stay the red-ball coach for the series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-atp-finals-taylor-fritz-jannik-sinner-final-2634885-2024-11-17",
      "headline": "Taylor Fritz wary of Jannik Sinner challenge in US Open final rematchATP Finals 2024: Taylor Fritz is wary of the challenge that Jannik Sinner could pose to him in the all-important final in Turin. Sinner has beaten Fritz in their last three meetings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aaqib-javed-set-to-replace-jason-gillespie-as-pakistan-white-ball-teams-coach-2634873-2024-11-17",
      "headline": "Aaqib Javed set to replace Jason Gillespie as Pakistan white-ball teams' coachJason Gillespie is expected to be replaced as Pakistan's head coach across formats by Aaqib Javed. Gillespie is Pakistan's Test coach and currently the temporary coach of the white-ball side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harshit-prasidh-vie-for-3rd-pacers-slot-in-perth-test-shami-to-play-in-smat-2634872-2024-11-17",
      "headline": "Harshit, Prasidh vie for 3rd pacer's slot in Perth Test, Shami to play in SMATHarshit Rana's raw pace and Prasidh Krishna's experience set up a fierce contest for India's third pacer's spot in the Perth Test. Meanwhile, Mohammed Shami will feature in the Syed Mushtaq Ali Trophy as he eyes a Border-Gavaskar return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-indian-team-needs-to-improve-in-everything-to-beat-malaysia-manolo-marquez-2634868-2024-11-17",
      "headline": "Indian football team needs to improve in everything to beat Malaysia: Coach ManoloThe Indian football team is set to face Malaysia in their final match of the year, with coach Marquez Manolo emphasising the need for overall improvement as they aim to break a winless streak stretching across 11 games in 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tabraiz-shamsi-reveals-similarities-with-jasprit-bumrah-crazy-coincidence-2634858-2024-11-17",
      "headline": "Tabraiz Shamsi reveals similarities with Jasprit Bumrah: Crazy coincidenceTabraiz Shamsi revealed a striking coincidence: he and Jasprit Bumrah share identical T20I records in matches played, balls bowled, and wickets taken. Shamsi highlighted this quirky stat on X, calling it a \"crazy coincidence\" that surprised cricket fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-syed-mushtaq-ali-trophy-prithvi-shaw-shreyas-iyer-mumbai-squad-2634854-2024-11-17",
      "headline": "Prithvi Shaw returns for Mumbai in SMAT, Shreyas Iyer named captainSyed Mushtaq Ali Trophy: Prithvi Shaw has returned to play for Mumbai and has been picked in the 17-member squad for the tournament. Shreyas Iyer has been appointed as the skipper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rohit-sharma-set-to-miss-perth-test-with-jasprit-bumrah-to-lead-india-2634849-2024-11-17",
      "headline": "Rohit Sharma set to miss Perth Test with Jasprit Bumrah to lead India: SourcesBorder-Gavaskar Trophy: Skipper Rohit Sharma is set to join the team in Adelaide after spending time with his newborn. Pace spearhead Jasprit Bumrah will lead the team in Rohit's absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sunil-gavaskar-predicts-shreyas-iyers-new-ipl-team-ahead-of-mega-auction-2634846-2024-11-17",
      "headline": "Sunil Gavaskar predicts Shreyas Iyer's new IPL team ahead of mega auctionSunil Gavaskar predicts Shreyas Iyer's new team ahead of the IPL 2025 mega auction. Iyer has set his base price at Rs 2 crore after being released by Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wbbl-lucy-hamilton-brisbane-heat-melbourne-stars-record-2634839-2024-11-17",
      "headline": "18-year-old Lucy Hamilton becomes youngest to take 5-wicket haul in WBBLWBBL 2023-24: Brisbane Heat's Lucy Hamilton picked up a five-wicket haul in a record-breaking spell in the clash against Melbourne Stars on Sunday at the Drummoyne Oval in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-justin-langer-2634833-2024-11-17",
      "headline": "Never write off champions: Virat Kohli backed to regain form by Justin LangerFormer Australia coach Justin Langer has expressed confidence in Virat Kohli's ability to bounce back during the Border-Gavaskar Trophy. Despite recent struggles, Langer believes Kohli's performance in Australia will be crucial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-syed-mushtaq-ali-trophy-prithvi-shaw-shreyas-iyer-mumbai-squad-2634854-2024-11-17",
      "headline": "Prithvi Shaw returns for Mumbai in SMAT, Shreyas Iyer named captainSyed Mushtaq Ali Trophy: Prithvi Shaw has returned to play for Mumbai and has been picked in the 17-member squad for the tournament. Shreyas Iyer has been appointed as the skipper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rohit-sharma-set-to-miss-perth-test-with-jasprit-bumrah-to-lead-india-2634849-2024-11-17",
      "headline": "Rohit Sharma set to miss Perth Test with Jasprit Bumrah to lead India: SourcesBorder-Gavaskar Trophy: Skipper Rohit Sharma is set to join the team in Adelaide after spending time with his newborn. Pace spearhead Jasprit Bumrah will lead the team in Rohit's absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sunil-gavaskar-predicts-shreyas-iyers-new-ipl-team-ahead-of-mega-auction-2634846-2024-11-17",
      "headline": "Sunil Gavaskar predicts Shreyas Iyer's new IPL team ahead of mega auctionSunil Gavaskar predicts Shreyas Iyer's new team ahead of the IPL 2025 mega auction. Iyer has set his base price at Rs 2 crore after being released by Kolkata Knight Riders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wbbl-lucy-hamilton-brisbane-heat-melbourne-stars-record-2634839-2024-11-17",
      "headline": "18-year-old Lucy Hamilton becomes youngest to take 5-wicket haul in WBBLWBBL 2023-24: Brisbane Heat's Lucy Hamilton picked up a five-wicket haul in a record-breaking spell in the clash against Melbourne Stars on Sunday at the Drummoyne Oval in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-justin-langer-2634833-2024-11-17",
      "headline": "Never write off champions: Virat Kohli backed to regain form by Justin LangerFormer Australia coach Justin Langer has expressed confidence in Virat Kohli's ability to bounce back during the Border-Gavaskar Trophy. Despite recent struggles, Langer believes Kohli's performance in Australia will be crucial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-may-skip-singles-action-in-davis-cup-farewell-if-it-helps-spain-2634827-2024-11-17",
      "headline": "Rafael Nadal may skip singles action in Davis Cup farewell if it helps SpainRafael Nadal announced that he might forgo singles matches at this week's Davis Cup Finals in Málaga, focusing solely on doubles if it boosts Spain's chances of securing the title in his final tournament as a professional player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mitchell-johnson-wants-virat-kohli-to-score-one-more-test-ton-vs-australia-2634821-2024-11-17",
      "headline": "Mitchell Johnson wants Virat Kohli to 'score one more Test ton' vs AustraliaMitchell Johnson opened up about his expectations over Virat Kohli's performance in the upcoming Border Gavaskar Trophy series. This will be Kohli's 5th Test tour to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/devdutt-padikkal-set-to-stay-back-in-australia-as-back-up-sources-2634818-2024-11-17",
      "headline": "Devdutt Padikkal set to stay back in Australia as back-up: SourcesThe Indian cricket team management has reportedly decided to keep Devdutt Padikkal in Australia as a batting reserve following a mixed performance in the 'A' tour. This move comes as a relief amid concerns over the absence of Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-steve-smith-reveals-he-wants-to-adopt-a-proactive-approach-ashwin-2634815-2024-11-17",
      "headline": "Steve Smith reveals why he wants to adopt a proactive approach vs R AshwinAustralian batting stalwart Steve Smith has set his sights on neutralizing Indian off-spinner Ravichandran Ashwin, who has posed a formidable challenge ahead of the Border-Gavaskar Trophy. The five-match Test series begins on November 22 in Perth, and Smith is determined to adopt a more proactive approach against his long-time rival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-kl-rahul-elbow-injury-2634816-2024-11-17",
      "headline": "KL Rahul recovers from elbow injury, declared fit before Perth Test Border-Gavaskar Trophy: KL Rahul has recovered from an elbow injury scare and has been declared fit for the Perth Test, starting November 22. Rahul sustained an injury during an intra-squad match simulation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-has-to-be-leading-run-scorer-if-india-aims-to-win-michael-clarke-2634802-2024-11-17",
      "headline": "Virat Kohli has to be leading run scorer if India aims to win: Michael ClarkeMichael Clarke predicted that Virat Kohli has to be the leading run-getter in the series if India aim to win the series against Australia. He also said that Rishabh Pant also has to be right behind Kohli and make an impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohan-bopanna-matthew-ebden-ivan-dodig-rumours-2634792-2024-11-17",
      "headline": "Bopanna shuts down rumours of partnering Ivan Dodig after Ebden splitRohan Bopanna said that he would not partner Croatia's Ivan Dodig after parting ways with Australia's Matthew Ebden. Bopanna and Ebden recently played in the ATP Finals 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-victor-gyokeres-ruben-amorim-sporting-cp-2634780-2024-11-17",
      "headline": "Victor Gyokeres to Manchester United? Swedish striker breaks silence on rumoursVictor Gyokeres has opened up on the rumours connecting him to join Ruben Amorim at Manchester United from Sporting CP. Gyokeres became one of the hottest strikers in Europe under Amorim's guidance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-kl-rahul-elbow-injury-2634816-2024-11-17",
      "headline": "KL Rahul recovers from elbow injury, declared fit before Perth Test Border-Gavaskar Trophy: KL Rahul has recovered from an elbow injury scare and has been declared fit for the Perth Test, starting November 22. Rahul sustained an injury during an intra-squad match simulation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-has-to-be-leading-run-scorer-if-india-aims-to-win-michael-clarke-2634802-2024-11-17",
      "headline": "Virat Kohli has to be leading run scorer if India aims to win: Michael ClarkeMichael Clarke predicted that Virat Kohli has to be the leading run-getter in the series if India aim to win the series against Australia. He also said that Rishabh Pant also has to be right behind Kohli and make an impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohan-bopanna-matthew-ebden-ivan-dodig-rumours-2634792-2024-11-17",
      "headline": "Bopanna shuts down rumours of partnering Ivan Dodig after Ebden splitRohan Bopanna said that he would not partner Croatia's Ivan Dodig after parting ways with Australia's Matthew Ebden. Bopanna and Ebden recently played in the ATP Finals 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-victor-gyokeres-ruben-amorim-sporting-cp-2634780-2024-11-17",
      "headline": "Victor Gyokeres to Manchester United? Swedish striker breaks silence on rumoursVictor Gyokeres has opened up on the rumours connecting him to join Ruben Amorim at Manchester United from Sporting CP. Gyokeres became one of the hottest strikers in Europe under Amorim's guidance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-nathan-mcsweeney-opening-matt-renshaw-2634757-2024-11-17",
      "headline": "Matt Renshaw admits frustration as Nathan McSweeney gets nod for Perth TestMatt Renshaw has voiced his frustration after Nathan McSweeney's selection as opener for the Perth Test against India. Despite McSweeney's strong form, Renshaw believes the decision has left many Australian openers frustrated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-india-vs-australia-mitchell-marsh-shoulder-charge-virat-kohli-2634752-2024-11-17",
      "headline": "Marsh ready to shoulder charge Kohli: Will take him out when he gets to 30Australia all-rounder Mitchell Marsh has joked that he would shoulder charge Virat Kohli whenever he reaches his 30s. The first Test match between India and Australia begins on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-gujarat-titans-prediction-ishan-kishan-glenn-maxwell-ahmedabad-2634739-2024-11-17",
      "headline": "IPL auction prediction: Will GT target Maxwell, Kishan with Rs 69 crore-purse?GT had a season to forget in 2024 and would be tempted to try for some big names during the IPL auction. With a 69-crore purse, GT are joint 4th when it comes to remaining budget."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}