{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-vs-credit-card-emi-which-option-saves-you-more-money-cost-effective-interest-on-credit-card-emi-2812602-2025-11-03",
      "headline": "Personal loan vs credit card EMI: Which option saves you more money?Managing expenses through instalments can be convenient, but it's important to know what you're signing up for. Should you go for a personal loan or a credit card EMI when you need quick funds? Let's find out which one benefits your pocket more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/renting-vs-buying-the-real-question-is-liquidity-vs-liability-says-expert-2812564-2025-11-03",
      "headline": "Renting vs buying? The real question is liquidity vs liability, says expertIs it smarter to rent or buy a home? An expert says that's not the question to ask. He believes the real issue lies in whether you're building liquidity or adding liability through your financial choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-steady-returns-check-which-bank-giving-up-to-765-percent-on-3-year-fds-2812525-2025-11-03",
      "headline": "Looking for steady returns? Check who's giving up to 7.65% on 3-year FDsIf you're aiming for safe yet rewarding investments, 3-year fixed deposits are worth a look. Several banks are offering interest rates of up to 7.65%, giving savers a solid balance of security and returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-launches-employee-enrolment-scheme-2025-how-it-benefits-employers-and-workers-pension-scheme-2812498-2025-11-03",
      "headline": "EPFO launches Employee Enrolment Scheme 2025: How it benefits workersIn a move to strengthen the formal workforce, the government has rolled out the Employee Enrolment Scheme 2025 under the EPFO. The scheme aims to benefit workers by ensuring PF coverage and long-term financial security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-row-ratan-tata-sisters-emotions-family-not-cloud-business-decision-judgement-report-2812482-2025-11-03",
      "headline": "Amid Tata Trusts row, Ratan Tata's sisters recall his unwavering judgementRatan Tata died on October 9, 2024, at the age of 86. Though he never married, he maintained close relationships with his siblings, brother Jimmy Tata, half-brother Noel Tata, and half-sisters Shireen and Deanna Jejeebhoy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-triple-investment-usd-788-million-rare-earth-magnet-cut-china-reliance-report-2812463-2025-11-03",
      "headline": "India triples rare earth magnet investment to cut China reliance: ReportThe new plan represents a major step up from the earlier $290 million initiative, which was focused on ensuring supplies of essential materials for electric vehicles, renewable energy, and defence sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/mehli-mistry-sets-stage-for-legal-battle-with-caveat-after-ouster-move-at-tata-trusts-board-2812454-2025-11-03",
      "headline": "Mehli Mistry sets stage for legal battle after removal from Tata Trusts boardMehli Mistry's caveat sets up a hearing where questions of process, past resolutions, and trust deed interpretation will decide if the non-renewal stands or triggers a deeper inquiry in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-low-tariff-trade-deal-must-for-economic-growth-2812437-2025-11-03",
      "headline": "Why India needs a low-tariff trade deal with the US nowA trade pact with the US can expand exports and create millions of jobs, but only if India tackles agriculture and labour reforms. The opportunity is real, and the moment demands resolve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-in-red-private-banking-shares-pull-markets-down-2812435-2025-11-03",
      "headline": "Sensex, Nifty open in red as private lenders pull markets downThe S&P BSE Sensex was down by 252.57 points to 83,686.14, while the NSE Nifty50 was down by 50.40 points to 25,671.70 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-silver-prices-today-precious-metal-rates-down-why-prices-are-falling-2812426-2025-11-03",
      "headline": "Gold prices drop again: What's dragging precious metal rates downOn the Multi Commodity Exchange (MCX) in India, gold futures maturing on December 5, 2025, were trading at Rs 1,21,284 per 10 grams, down by Rs 224 or 0.18%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/mid-segment-housing-is-it-the-real-core-of-indias-property-boom-real-estate-home-buyers-2812112-2025-11-02",
      "headline": "Mid-segment housing: Is it the real core of India's property boom?After years of luxury-led projects, India's real estate developers are refocusing on the mid-segment — a market driven by young professionals, dual-income families, and first-time buyers. But is this segment truly the backbone of India's property boom?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-bankim-brahmbhatt-indian-origin-ceo-blackrock-loan-fraud-united-states-2811790-2025-11-01",
      "headline": "The 'missing' Indian-origin CEO behind Rs 4,200 crore BlackRock loan fraudBankim Brahmbhatt, the Indian-origin CEO of a US-based telecom company, is facing a lawsuit in the US filed by HPS, the private credit investment arm of BlackRock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-links-anil-ambani-rana-kapoor-in-rs-2796-crore-yes-bank-loss-case-2811693-2025-11-01",
      "headline": "CBI links Anil Ambani, Rana Kapoor in Rs 2,796-crore Yes Bank loss caseThe CBI has accused industrialist Anil Ambani of approving favours to Yes Bank founder Rana Kapoor's family, causing huge financial losses to the bank. This development highlights alleged corruption and risky investments linked to Ambani's companies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-466-points-nifty-below-25750-bel-jumps-4-2811380-2025-10-31",
      "headline": "Sensex, Nifty continue losing streak amid profit booking; BEL jumps 4%The S&P BSE Sensex closed 465.75 points lower at 83,938.71, while the NSE Nifty50 fell 155.75 points to 25,722.10. Selling pressure was broad-based, with most sectoral indices ending in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-crosses-full-subscription-on-day-1-qibs-drive-demand-2811374-2025-10-31",
      "headline": "Lenskart IPO crosses full subscription on Day 1; QIBs drive demandThe IPO opened today and closes on November 4. Lenskart has set a price band of Rs 382 to Rs 402 per share, with a lot size of 37 shares for retail bidders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-leads-indias-crypto-investments-in-q3-2025-report-2811359-2025-10-31",
      "headline": "Gen Z leads India's crypto investments in Q3 2025: ReportThe 18–25 age group has officially overtaken the 26–35 bracket as the most active investors in crypto. For them, digital assets are no longer a risky experiment — they're becoming part of a serious investment plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/from-groww-to-icici-amc-key-ipos-to-watch-this-november-2025-2811333-2025-10-31",
      "headline": "From Groww to ICICI AMC: Key IPOs to watch this November 2025Bengaluru-based investing platform Groww is set to launch its IPO worth Rs 6,632.3 crore. The issue includes a fresh issue of Rs 1,060 crore and an offer for sale of Rs 5,572.3 crore. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dies-irae-box-office-collection-crosses-rs-25-crore-top-grossing-a-rated-malayalam-opener-2812613-2025-11-03",
      "headline": "Pranav Mohanlal's Dies Irae beats Marco, becomes highest A-rated Malayalam opener Pranav Mohanlal's horror thriller 'Dies Irae' has outperformed last year's 'Marco', becoming the biggest opening for an A-rated Malayalam film. With strong initial collections and robust demand, the film is showing significant momentum across Kerala and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ai-mahabharat-trends-as-viewers-spot-modern-bedside-table-joke-chargers-missing-2812606-2025-11-03",
      "headline": "AI Mahabharat trends as viewers spot modern bedside table, joke charger's missing Viewers are having a field day with JioHotstar's new AI-generated series 'Mahabharat – Ek Dharmayudh' after spotting a modern bedside table in a palace scene. The unexpected detail sparked hilarious reactions online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ssunita-ahuja-talks-about-govindas-affair-rumours-i-have-heard-its-a-marathi-actress-2812604-2025-11-03",
      "headline": "Ssunita Ahuja talks about Govinda's affair buzz: I've heard it's a Marathi actress Ssunita Ahuja broke her silence on rumours of Govinda's alleged affair with a 30-year-old Marathi actor, saying she will only believe it if she sees proof herself. She also spoke about valuing honesty, women's independence, and putting old family feuds behind her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-samantha-celebrities-congratulate-indian-womens-team-world-cup-victory-2812576-2025-11-03",
      "headline": "Rajinikanth to Kamal Haasan, actors celebrate Indian women's team's World Cup win Rajinikanth to Kamal Haasan, South celebrities congratulated the Indian Women's team for winning their first-ever World Cup. Their words of appreciation commended the grit and dedication of the players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-kamala-harris-joe-biden-2812581-2025-11-03",
      "headline": "George Clooney: Kamala Harris replacing Joe Biden in 2024 US polls was a mistake Hollywood star George Clooney has voiced his opinion that Kamala Harris should not have replaced Joe Biden as the Democratic Party candidate in the US elections of last year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/raat-akeli-hai-the-bansal-murders-has-nawazuddin-probing-a-new-murder-case-2812553-2025-11-03",
      "headline": "Raat Akeli Hai: The Bansal Murders has Nawazuddin probing a new murder case The sequel to Nawazuddin Siddiqui, Radhika Apte's crime-thriller 'Raat Akeli Hai', was recently announced. Titled 'Raat Akeli Hai: The Bansal Murders', the film will premiere at IFFI Goa, promising a gripping new investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-playing-grey-character-king-actors-like-me-must-explore-diverse-roles-2812588-2025-11-03",
      "headline": "SRK on playing grey character in King: Actors like me must explore diverse roles Shah Rukh Khan recently spoke about playing a grey character in the upcoming film 'King'. The superstar mentioned the importance of playing diverse roles in cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/india-womens-cricket-world-cup-win-palash-muchhal-smriti-mandhana-wedding-celebrations-2812548-2025-11-03",
      "headline": "Palash Muchhal celebrates World Cup win ahead of wedding with Smriti Mandhana Music composer and filmmaker Palash Muchhal, partner of Indian cricketer Smriti Mandhana, celebrated India's historic ICC Women's World Cup victory just weeks before their upcoming wedding. The couple is reportedly getting married in Sangli, Maharashtra, on November 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-raone-sequel-discusses-anubhav-sinha-hardwork-film-failure-with-fans-2812557-2025-11-03",
      "headline": "Shah Rukh Khan says he's ready for Ra.One sequel, discusses its failure with fans Shah Rukh Khan opened up about the failure of 'Ra.One' and expressed his willingness to return for a sequel. During his 60th birthday fan interaction, SRK revealed how the film was close to his heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-blames-amitabh-bachchan-for-wasted-lifeline-refuses-to-leave-kaun-banega-crorepati-hot-seat-2812555-2025-11-03",
      "headline": "Diljit Dosanjh blames Big B for wasted lifeline, refuses to leave KBC hot seat Diljit Dosanjh's hilarious stint on 'Kaun Banega Crorepati 17' saw him refusing to leave the hot seat after winning Rs 50 lakh, jokingly telling Amitabh Bachchan, \"I haven't lost, give me my money.\" The singer also teased Big B for making him waste a lifeline, turning the episode into a laughter-filled highlight of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aaryan-climax-shortened-audience-backlash-selvaraghavan-speech-2812544-2025-11-03",
      "headline": "Vishnu Vishal's Aaryan climax trimmed after feedback, revised film out in theatres The makers of Vishnu Vishal's 'Aaryan' have shortened the film's climax following viewer feedback, with the revised version to be screened in theaters starting Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-grateful-after-major-win-at-dadasaheb-phalke-film-festival-2025-2812522-2025-11-03",
      "headline": "Allu Arjun grateful after major win at Dadasaheb Phalke Film Festival 2025 Allu Arjun was recognised for his outstanding performance in 'Pushpa 2: The Rule' at the Dadasaheb Phalke Awards. He expressed gratitude and thanked everyone for the recognition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-stable-after-breathlessness-admission-mumbai-breach-candy-hospital-2812520-2025-11-03",
      "headline": "Hema Malini reassures fans as Dharmendra recovers after brief hospitalisation Veteran actor Dharmendra was admitted to Mumbai's Breach Candy Hospital recently. The actor is currently stable and recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-vs-ek-deewane-ki-deewaniyat-harshvardhan-rane-urges-fans-not-to-compare-2812512-2025-11-03",
      "headline": "Saiyaara vs Ek Deewane Ki Deewaniyat: Harshvardhan Rane urges fans not to compare Actor Harshvardhan Rane reacted to comparisons between 'Ek Deewane Ki Deewaniyat' and 'Saiyaara'. He requested fans to avoid rivalry and appreciate both creative works as comparisons lead to friction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-55-rashmika-mandanna-enters-as-guest-madhuri-eliminated-2812527-2025-11-03",
      "headline": "Bigg Boss Telugu 9 Day 55: Rashmika Mandanna enters as guest, Madhuri gets eliminated What was meant to be a light-hearted Sunday episode turned into one of the most intense ones of 'Bigg Boss Telugu 9'. After a fiery Saturday, Nagarjuna returned with stern reality checks, emotional confrontations, and a shocking elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-admits-hes-bored-of-baburao-repetition-it-dominates-my-other-roles-2812511-2025-11-03",
      "headline": "Paresh Rawal admits he's bored of Baburao repetition: It dominates my other roles Paresh Rawal opened up about feeling bored of repeatedly playing Baburao, his iconic character from the 'Hera Pheri' film series. The actor said Baburao's popularity often overshadows his other roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/stanley-fung-shui-fan-hong-kong-actor-filmmaker-dies-aged-80-new-taipei-2812494-2025-11-03",
      "headline": "Stanley Fung, veteran Hong Kong actor and filmmaker, dies at 80 Stanley Fung Shui-fan, well-known for his comedy and film roles in Hong Kong, has died at 80 in New Taipei, just a week after writing a moving farewell for fellow actor Hui Shiu-hung."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-dhaba-legal-notice-resolved-actor-consent-hyderabad-2812495-2025-11-03",
      "headline": "Chiranjeevi Dhaba gets green light to use actor's name after legal notice The owner of Chiranjeevi Dhaba in Hyderabad addressed receiving a legal notice for using the star's name and likeness and clarifying the outcome following discussions with Chiranjeevi's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-opens-up-on-lobbying-in-national-awards-it-happens-at-the-oscars-too-2812505-2025-11-03",
      "headline": "Paresh Rawal opens up on lobbying in National Awards: It happens at the Oscars too Paresh Rawal shared that even prestigious honours like the National Awards aren't entirely free from lobbying, drawing parallels with the Oscars. The actor added that he values genuine appreciation from directors and writers over any trophy or title."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-china-conducting-nuclear-tests-claims-us-president-donald-trump-2812547-2025-11-03",
      "headline": "Pakistan, China testing nuclear weapons, says Trump. Concern for India?US President Donald Trump has said that Pakistan and China, apart from Russia and North Korea, are testing nuclear weapons. This is of concern for India as it faces two nuclear-armed rivals on two fronts. Trump made the revelation in a CBS news interview, justifying his order to US forces to test nuclear weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-donald-trump-nuclear-test-race-will-india-participate-hydrogen-bomb-thermonuclear-weapon-pakistan-china-2811856-2025-11-03",
      "headline": "Has Trump created a big nuclear opportunity for India?Will US President Donald Trump's orders to the US military to test nuclear weapons after a 33-year gap restart a nuclear test race? What is the status of India's nuclear weapons stockpile and does India need to participate in such a race?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-techie-kills-manager-dumbbells-light-switch-fight-chilli-powder-thrown-2812603-2025-11-03",
      "headline": "Chilli powder thrown, hit with dumbbell: Bengaluru techie kills manager over lightsA workplace argument over switching off lights turned deadly in Bengaluru when a 24-year-old man from Vijayawada killed his 41-year-old manager with a dumbbell and later surrendered to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-fires-employees-with-these-two-early-morning-text-messages-2812466-2025-11-03",
      "headline": "Amazon fires employees with these two early morning text messagesIn a move that caught many off guard, Amazon employees woke up to text messages informing them that their roles had been eliminated. Here is everything you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-equal-pay-2812389-2025-11-03",
      "headline": "India's Women's World Cup win just showed the world what equal pay can doA historic Women's World Cup victory, years in the making, powered by a policy that dared to believe women deserved more. The BCCI's gamble on equality has now rewritten the future of women's sport, in India and beyond."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-survivor-viswashkumar-ramesh-struggles-loss-ptsd-family-impact-2812552-2025-11-03",
      "headline": "Lost and broken, not talking to family: Lone Air India crash survivor's anguishViswashkumar Ramesh, the only survivor of the Air India crash that killed 241 people in June, described himself as the \"luckiest man\" alive, but stressed he has been unable to communicate with his family after the tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-war-news-peace-talk-munir-pak-army-bypass-shehbaz-sharif-govt-creating-troubles-afghanistan-2812534-2025-11-03",
      "headline": "Pak army bypassing Sharif govt, creating friction with Kabul at US' behest?A startling revelation by Afghanistan's Taliban official suggests that the Asim Munir-led Pakistan Army might be pulling the strings, bypassing PM Shehbaz Sharif's civilian government to foment tensions with Kabul. This revelation follows claims that US drones were attacking Afghanistan using Pakistani soil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/10-killed-40-injured-as-dumper-truck-driver-rams-vehicles-in-drunken-rampage-in-jaipur-2812619-2025-11-03",
      "headline": "10 dead, 50 injured as drunk truck driver drags vehicles for 5 km in JaipurEyewitnesses said the driver, suspected to be drunk, kept speeding for nearly five kilometres, ramming cars and motorcycles on Jaipur's Lohamandi Road. He has been taken into police custody. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/when-delaying-divorce-becomes-a-strategy-for-the-childs-education-2811339-2025-11-01",
      "headline": "Why Indian parents delay divorce until kids are 'old enough'Many Indian parents put off divorce thinking kids will cope better when they're older. But growing up in a quiet, loveless home often leaves deeper scars than separation ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-air-quality-monitoring-stations-defunct-supreme-court-asks-caqm-cpcb-to-file-report-2812580-2025-11-03",
      "headline": "Supreme Court seeks report on 'defunct' air quality monitoring stations in DelhiA counsel appearing before the top court questioned how the Graded Response Action Plan (GRAP) could be implemented in Delhi-NCR effectively when crucial pollution data was missing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-coimbatore-gang-rape-college-student-airport-abduction-police-special-team-2812448-2025-11-03",
      "headline": "Tamil Nadu college student gang raped by 3 men near airport, accused on the runA college student in Tamil Nadu's Coimbatore was allegedly gang raped by three men who abducted her after attacking her friend near the Airport area on Sunday night. Police have formed seven special teams to nab them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ai-mahabharat-trends-as-viewers-spot-modern-bedside-table-joke-chargers-missing-2812606-2025-11-03",
      "headline": "AI Mahabharat trends as viewers spot modern bedside table, joke charger's missingViewers are having a field day with JioHotstar's new AI-generated series 'Mahabharat – Ek Dharmayudh' after spotting a modern bedside table in a palace scene. The unexpected detail sparked hilarious reactions online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/telangana-ranga-reddy-bus-truck-collision-wrong-side-speeding-death-injured-2812427-2025-11-03",
      "headline": "20 dead in head-on collision between truck, bus in Telangana, PMO announces aidA tragic road accident in Telanaga's Rangareddy district has claimed at least 20 lives and left 20 injured after a speeding truck collided head-on with a TGRTC bus. The incident has sparked an urgent investigation and calls for stricter road safety measures in Telangana."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-india-pakistan-nuclear-war-us-trade-deal-modi-shehbaz-sharif-2812545-2025-11-03",
      "headline": "India was on verge of nuclear war with Pak, Trump claims again amid US test plansIn an interview, President Donald Trump claimed his threat to cut trade ties forced India and Pakistan to step back from the brink of a nuclear exchange during their military confrontation in May this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-south-africa-know-your-team-2812368-2025-11-03",
      "headline": "Meet your wonder women: The incredible stories of India's world championsWomen's World Cup: The mercurial Indian women's team beat South Africa to win their maiden ODI World Cup. In this article, we explore what our stars look like beyond the cricket field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/jaipur-woman-walks-1km-with-ola-driver-to-petrol-pump-still-charged-extra-for-detour-2812600-2025-11-03",
      "headline": "Jaipur woman walks 1 km with Ola driver to petrol pump, charged extra for detourA Jaipur woman narrated her Ola bike ride experience that turned into a lesson in empathy after she accompanied the driver to refuel his vehicle, arrived late, and still paid an extra charge for the detour."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-landlord-demands-rs-30-lakh-security-deposit-2bhk-frazer-town-reddit-calls-it-scam-bangalore-rent-2812559-2025-11-03",
      "headline": "Bengaluru landlord demands Rs 30 lakh deposit for 2BHK, Reddit calls it 'scam'The description of the flat in Bengaluru mentioned a stylish, furnished 2BHK with designer interiors, premium beds, modular kitchen appliances, full power backup, in-house security, and a car park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-bcci-announces-prize-money-india-vs-south-africa-final-2812416-2025-11-03",
      "headline": "BCCI announces Rs 51 crore prize money for Indian women's teamWomen's World Cup: The Indian Cricket Board has announced a bumper prize for the national women's team. Secretary Devajit Saikia confirmed that the players and support staff will receive Rs 51 crore for winning India's maiden ODI World Cup title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-match-ball-gesture-sunil-gavaskar-1983-2812409-2025-11-03",
      "headline": "From 1983 to 2025: Harmanpreet Kaur pulls off a Gavaskar after India's World Cup gloryWomen's World Cup: Harmanpreet Kaur recreated Sunil Gavaskar's iconic 1983 match-ball gesture after India's World Cup win in Navi Mumbai. The captain pocketed the ball moments after taking the catch that sealed India's historic triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-raone-sequel-discusses-anubhav-sinha-hardwork-film-failure-with-fans-2812557-2025-11-03",
      "headline": "Shah Rukh Khan says he's ready for Ra.One sequel, discusses its failure with fansShah Rukh Khan opened up about the failure of 'Ra.One' and expressed his willingness to return for a sequel. During his 60th birthday fan interaction, SRK revealed how the film was close to his heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/mehli-mistry-sets-stage-for-legal-battle-with-caveat-after-ouster-move-at-tata-trusts-board-2812454-2025-11-03",
      "headline": "Mehli Mistry sets stage for legal battle after removal from Tata Trusts boardMehli Mistry's caveat sets up a hearing where questions of process, past resolutions, and trust deed interpretation will decide if the non-renewal stands or triggers a deeper inquiry in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-cost-of-eating-healthy-in-india-is-falling-but-is-it-really-nutritious-indiaspend-report-2812543-2025-11-03",
      "headline": "The cost of eating healthy in India is falling, but does it count as balanced diet?While numbers show that basic nutrition is more affordable than ever, the real cost of a truly balanced diet is still higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suresh-chand-agarwal-owner-dinesh-555-brand-beedi-killed-by-son-over-drinking-dispute-2812447-2025-11-03",
      "headline": "UP man kills beedi tycoon father after row over drinking, then shoots himselfThe victim, Suresh Chand Agarwal, was the owner of the Dinesh 555 beedi brand, a company he founded in 1977. He had been battling cancer. Meanwhile, his son, Naresh Agarwal, struggled with a drinking problem, which frequently led to disputes with his father."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-amanjot-kaur-father-crying-india-vs-south-africa-watch-video-2812590-2025-11-03",
      "headline": "Amanjot Kaur's father sheds tears of joy as life comes full circle in Women's World Cup Women's World Cup: From Mohali's modest lanes to the world stage, Amanjot Kaur's inspiring rise came full circle as her father wept with pride watching India lift their maiden Women's ODI World Cup trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narendra-modi-meet-indian-womens-team-final-2812586-2025-11-03",
      "headline": "PM Narendra Modi likely to meet Indian women's team in Delhi Prime Minister Narendra Modi is likely to meet the Indian women's team on Wednesday, November 5. The meeting is likely to happen in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-heist-in-kashmir-stars-like-chris-gayle-duped-in-massive-league-fraud-ytvd-2812574-2025-11-03",
      "headline": "Cricket Heist in Kashmir: Stars Like Chris Gayle Duped in Massive League Fraud? This special report focuses on a major cricket scam in Jammu and Kashmir involving the 'Indian Heaven Premier League', where organisers fled midway through the tournament, leaving national and international players like Chris Gayle unpaid. 'Clearly the Jammu and Kashmir government rolled out the red carpet for the league without any background checks or verification process that's coming to the forefront at this point.' The scandal has left a trail of unpaid hotel bills amounting to tens of lakhs, with players and officials initially being prevented from leaving their hotel in Srinagar. While the J&K Sports Council, which had promoted the event and provided the Bakshi Stadium, has since tried to distance itself, questions are being raised about the lack of due diligence that allowed the fraudulent league to operate, tarnishing the region's image."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-win-meaning-whats-next-2812471-2025-11-03",
      "headline": "Triumph and transition: Women's World Cup was not the destination, it's the dawn Women's World Cup 2025, IND vs SA: Harmanpreet Kaur's India lifted the trophy after defeating South Africa on Sunday in Navi Mumbai — but the tougher journey now begins: sustaining that success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/father-sanjeev-verma-fiery-pep-talk-inspired-shafali-vermas-world-cup-final-heroics-2812550-2025-11-03",
      "headline": "How father's fiery pep talk inspired Shafali Verma's World Cup final heroics Shafali Verma's father, Sanjeev Verma, revealed how he kept her motivated during her year out of the ODI team. His support and Harmanpreet Kaur's trust helped Shafali deliver a match-winning performance in the Women's World Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-south-africa-final-harmanpreet-kaur-full-press-conference-2812556-2025-11-03",
      "headline": "Coaching stability, some harsh words: How India became world champions Women's World Cup Final: India captain Harmanpreet Kaur credited the stability in the Indian team management behind the team's success in the World Cup. The skipper said that Amol Mazumdar's harsh words riled them up after they dropped form midway through the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-mandhana-wake-up-with-trophy-trend-after-world-cup-triumph-2812499-2025-11-03",
      "headline": "Jemimah, Smriti hop on viral 'wake up with trophy' trend after World Cup triumph India batters Jemimah Rodrigues and Smriti Mandhana hopped on to the 'wake up with trophy' trend after their historic maiden World Cup triumph. India beat South Africa by 52 runs to clinch their maiden World Cup title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-team-song-womens-world-cup-final-jemimah-smriti-2812491-2025-11-03",
      "headline": "Jemimah keeps promise, reveals India's team song after World Cup victory India broke into massive celebrations after winning the Women's ODI World Cup on Sunday. They finally revealed their team song after winning their maiden ICC ODI World Cup trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-shefali-verma-bowling-surprise-india-vs-south-africa-laura-wolvaardt-2812481-2025-11-03",
      "headline": "Shafali Verma bowling was a surprise from India: South Africa's Laura Wolvaardt South Africa skipper Laura Wolvaardt admitted that her side were caught off guard by Shafali Verma's surprise spell for India in the Women's World Cup 2025 final, calling it the decisive moment in such a high stakes match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-amol-muzumdar-touches-feet-guru-shishya-viral-photo-2812460-2025-11-03",
      "headline": "Guru-Shishya: Harmanpreet touches coach Amol Muzumdar's feet after World Cup win Women's World Cup: India captain Harmanpreet Kaur touching coach Amol Muzumdar's feet after their World Cup glory became a defining image of respect and gratitude between the two, The duo guided India to their first-ever Women's ODI World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-replies-to-critics-after-world-cup-win-2812459-2025-11-03",
      "headline": "With grace, Harmanpreet Kaur answers critics of women's cricket after World Cup win India women's cricket team captain Harmanpreet Kaur responded to the widespread criticism of the team following their historic World Cup triumph on home soil. India beat South Africa by 52 runs in the final to claim their maiden World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-mandhana-wake-up-with-trophy-trend-after-world-cup-triumph-2812499-2025-11-03",
      "headline": "Jemimah, Smriti hop on viral 'wake up with trophy' trend after World Cup triumph India batters Jemimah Rodrigues and Smriti Mandhana hopped on to the 'wake up with trophy' trend after their historic maiden World Cup triumph. India beat South Africa by 52 runs to clinch their maiden World Cup title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-team-song-womens-world-cup-final-jemimah-smriti-2812491-2025-11-03",
      "headline": "Jemimah keeps promise, reveals India's team song after World Cup victory India broke into massive celebrations after winning the Women's ODI World Cup on Sunday. They finally revealed their team song after winning their maiden ICC ODI World Cup trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-shefali-verma-bowling-surprise-india-vs-south-africa-laura-wolvaardt-2812481-2025-11-03",
      "headline": "Shafali Verma bowling was a surprise from India: South Africa's Laura Wolvaardt South Africa skipper Laura Wolvaardt admitted that her side were caught off guard by Shafali Verma's surprise spell for India in the Women's World Cup 2025 final, calling it the decisive moment in such a high stakes match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-amol-muzumdar-touches-feet-guru-shishya-viral-photo-2812460-2025-11-03",
      "headline": "Guru-Shishya: Harmanpreet touches coach Amol Muzumdar's feet after World Cup win Women's World Cup: India captain Harmanpreet Kaur touching coach Amol Muzumdar's feet after their World Cup glory became a defining image of respect and gratitude between the two, The duo guided India to their first-ever Women's ODI World Cup triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-replies-to-critics-after-world-cup-win-2812459-2025-11-03",
      "headline": "With grace, Harmanpreet Kaur answers critics of women's cricket after World Cup win India women's cricket team captain Harmanpreet Kaur responded to the widespread criticism of the team following their historic World Cup triumph on home soil. India beat South Africa by 52 runs in the final to claim their maiden World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-harmanpreet-kaur-anjum-chopra-viral-interview-2812449-2025-11-03",
      "headline": "Destiny's champion: Harmanpreet's Punjabi interview with Anjum breaks internetIndia captain Harmanpreet Kaur gave an emotional interview to Anjum Choopra after her team won the Women's World Cup. The heartfelt interview, given in her native Punjabi language broke the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-south-africa-know-your-team-2812368-2025-11-03",
      "headline": "Meet your wonder women: The incredible stories of India's world championsWomen's World Cup: The mercurial Indian women's team beat South Africa to win their maiden ODI World Cup. In this article, we explore what our stars look like beyond the cricket field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-bcci-announces-prize-money-india-vs-south-africa-final-2812416-2025-11-03",
      "headline": "BCCI announces Rs 51 crore prize money for Indian women's teamWomen's World Cup: The Indian Cricket Board has announced a bumper prize for the national women's team. Secretary Devajit Saikia confirmed that the players and support staff will receive Rs 51 crore for winning India's maiden ODI World Cup title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-harmanpreet-kaur-match-ball-gesture-sunil-gavaskar-1983-2812409-2025-11-03",
      "headline": "From 1983 to 2025: Harmanpreet Kaur pulls off a Gavaskar after India's World Cup gloryWomen's World Cup: Harmanpreet Kaur recreated Sunil Gavaskar's iconic 1983 match-ball gesture after India's World Cup win in Navi Mumbai. The captain pocketed the ball moments after taking the catch that sealed India's historic triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/history-made-indias-women-clinch-maiden-world-cup-in-midnight-thriller-nation-erupts-in-joy-ytvd-2812397-2025-11-03",
      "headline": "India's Women Clinch Maiden World Cup In Midnight Thriller, Nation Erupts In JoyThis special report focuses on the Indian women's cricket team's historic first-ever World Cup victory, a moment that has sent the entire nation into a frenzy. Key figures discussed include captain Harmanpreet Kaur, standout players Deepti Sharma and Richa Ghosh, and the celebratory message from Prime Minister Narendra Modi. One fan from Kolkata captured the national mood, stating he was as happy as he was on '2nd April when Dhoni has lifted the World Cup'. The report covers the emotional and jubilant scenes from Kolkata, where reporter Anirban Sinha Roy is tracking the overnight celebrations. The victory is being hailed as the 'coming of age' for Indian women's cricket, with many comparing its significance to the men's team's 1983 World Cup win. Prime Minister Modi praised the team for their 'spectacular win' and 'exceptional teamwork'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/history-made-indias-women-in-blue-crowned-world-champions-for-first-time-ytvd-2812395-2025-11-03",
      "headline": "India's Women World Cup Win: Women In Blue Crowned World Champions For First TimeThis special report covers the Indian women's cricket team's historic first-ever World Cup victory against South Africa at the D.Y. Patil Stadium in Navi Mumbai. Key figures discussed include captain Harmanpreet Kaur and star performers Shafali Verma and Deepti Sharma. A fan ecstatically proclaimed, 'Indian girls have played very well and they have proved that India has always been number one and will always be number one.' The team chased redemption after final losses in 2005 and 2017, with this victory being their third attempt at the title. India set a formidable target of 299, ultimately defeating South Africa by 52 runs in a landmark moment for Indian sport, reminiscent of the men's 1983 World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-deepti-sharma-dsp-ultimate-hero-india-vs-south-africa-final-2812391-2025-11-03",
      "headline": "DSP Deepti Sharma turns into India's ultimate World Cup hero in dream tournamentIndian women's cricket's very own DSP, Deepti Sharma, delivered a performance filled with redemption and guided her side to their maiden Women's World Cup 2025 title. The all-rounder had a Yuvraj Singh-esque performance that saw her being adjudged as the Player Of The Tournament. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-equal-pay-2812389-2025-11-03",
      "headline": "India's Women's World Cup win just showed the world what equal pay can doA historic Women's World Cup victory, years in the making, powered by a policy that dared to believe women deserved more. The BCCI's gamble on equality has now rewritten the future of women's sport, in India and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/history-made-indias-women-clinch-maiden-world-cup-in-midnight-thriller-nation-erupts-in-joy-ytvd-2812397-2025-11-03",
      "headline": "India's Women Clinch Maiden World Cup In Midnight Thriller, Nation Erupts In JoyThis special report focuses on the Indian women's cricket team's historic first-ever World Cup victory, a moment that has sent the entire nation into a frenzy. Key figures discussed include captain Harmanpreet Kaur, standout players Deepti Sharma and Richa Ghosh, and the celebratory message from Prime Minister Narendra Modi. One fan from Kolkata captured the national mood, stating he was as happy as he was on '2nd April when Dhoni has lifted the World Cup'. The report covers the emotional and jubilant scenes from Kolkata, where reporter Anirban Sinha Roy is tracking the overnight celebrations. The victory is being hailed as the 'coming of age' for Indian women's cricket, with many comparing its significance to the men's team's 1983 World Cup win. Prime Minister Modi praised the team for their 'spectacular win' and 'exceptional teamwork'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/history-made-indias-women-in-blue-crowned-world-champions-for-first-time-ytvd-2812395-2025-11-03",
      "headline": "India's Women World Cup Win: Women In Blue Crowned World Champions For First TimeThis special report covers the Indian women's cricket team's historic first-ever World Cup victory against South Africa at the D.Y. Patil Stadium in Navi Mumbai. Key figures discussed include captain Harmanpreet Kaur and star performers Shafali Verma and Deepti Sharma. A fan ecstatically proclaimed, 'Indian girls have played very well and they have proved that India has always been number one and will always be number one.' The team chased redemption after final losses in 2005 and 2017, with this victory being their third attempt at the title. India set a formidable target of 299, ultimately defeating South Africa by 52 runs in a landmark moment for Indian sport, reminiscent of the men's 1983 World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-deepti-sharma-dsp-ultimate-hero-india-vs-south-africa-final-2812391-2025-11-03",
      "headline": "DSP Deepti Sharma turns into India's ultimate World Cup hero in dream tournamentIndian women's cricket's very own DSP, Deepti Sharma, delivered a performance filled with redemption and guided her side to their maiden Women's World Cup 2025 title. The all-rounder had a Yuvraj Singh-esque performance that saw her being adjudged as the Player Of The Tournament. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-final-equal-pay-2812389-2025-11-03",
      "headline": "India's Women's World Cup win just showed the world what equal pay can doA historic Women's World Cup victory, years in the making, powered by a policy that dared to believe women deserved more. The BCCI's gamble on equality has now rewritten the future of women's sport, in India and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-india-vs-south-africa-sunil-gavaskar-reaction-2812377-2025-11-03",
      "headline": "Women's World Cup win is amongst Indian cricket's greatest moments: GavaskarSunil Gavaskar heaped praise on the Indian team's incredible win in the Women's World Cup 2025 final, calling it one of the greatest moments in Indian cricket. India defeated South Africa by 52 runs to clinch their maiden World Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-india-womens-cricket-team-lifts-world-cup-trophy-historic-moment-dy-patil-stadium-2812372-2025-11-03",
      "headline": "Watch: Harmanpreet Kaur lifts India's first-ever Women's World Cup trophyTears, joy, and pure pride at DY Patil Stadium — India's women's cricket team etched their names in history, lifting their maiden ICC Women's World Cup trophy amid thunderous cheers and emotional celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-harmanpreet-kaur-kapil-dev-habit-winning-2812370-2025-11-03",
      "headline": "After doing a Kapil Dev for India, Harmanpreet Kaur vows to make winning a habitIndia clinched their first Women's World Cup title after 20 years with a thrilling win over South Africa. Harmanpreet Kaur's decisive catch and Shafali Verma's all-round performance marked a historic moment for Indian women's cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jhulan-goswami-emotional-reaction-india-womens-world-cup-2025-win-2812371-2025-11-03",
      "headline": "Watch: Jhulan Goswami in tears as she lifts World Cup alongside Mithali RajIndian legend Jhulan Goswami was left in tears as he finally got the chance to hold the Women's World Cup title as India won the title on Sunday, November 2. India defeated South Africa by 52 runs to win the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marizanne-kapp-jemimah-rodrigues-record-wickets-india-womens-world-cup-win-2812367-2025-11-03",
      "headline": "Watch: Radha Yadav and Jemimah console Marizanne Kapp after South Africa's heartbreakJemimah Rodrigues and Radha Yadav consoled a heartbroken Marizanne Kapp after South Africa's loss in the Women's World Cup final on  Sunday in Navi Mumbai — a touching moment between Delhi Capitals teammates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-world-cup-2025-reactions-sachin-kohli-celebrate-win-2812366-2025-11-03",
      "headline": "You brought it home: Cricketing world hails India's historic Women's World Cup titleCricket legends and fans unite to celebrate India's historic Women's World Cup triumph. From Tendulkar to Kohli, the cricketing world hails Harmanpreet Kaur's team for inspiring a new generation with their grit and glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amol-muzumdar-reaction-india-womens-world-cup-2025-win-2812365-2025-11-03",
      "headline": "The girls deserve it every bit, made every Indian proud: Amol MuzumdarAmol Muzumdar was full of pride after India's historic Women's World Cup triumph, calling it a watershed moment for Indian cricket. Praising his team's hard work, belief, and resilience, he said the victory will inspire generations to come."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pratika-rawal-celebrates-india-womens-world-cup-win-injury-final-2812364-2025-11-03",
      "headline": "On wheelchair, Pratika Rawal celebrates India's World Cup win with tricolourWomen's World Cup, IND vs SA: Pratika Rawal wasn't a part of the final against South Africa, but she celebrated India's win on Sunday in Navi Mumbai. Pratika scored 308 runs from seven matches before getting ruled out of the tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}