{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maximising-returns-how-to-select-top-mutual-funds-for-your-portfolio-investment-tips-money-wealth-2595507-2024-09-07",
      "headline": "Maximising returns: How to select top mutual funds for your portfolioMutual funds have emerged as a popular investment option, offering a balanced approach to growing wealth without the complexity of managing individual stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-criticises-auditor-bdo-exit-call-recordings-illegal-requests-demands-2595495-2024-09-07",
      "headline": "'Multiple call recordings exist': Byju's cries foul after auditor BDO resignsIn a strong response to BDO's resignation, Byju's has accused the audit firm of making unethical requests and manipulating the audit process, including suggesting the backdating of financial reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-auditor-bdo-resigns-financial-crisis-trouble-mounts-edtech-firm-legal-challenges-2595469-2024-09-07",
      "headline": "Byju's crisis worsens as second auditor BDO resigns over financial concernsBDO's exit comes just a year after Deloitte, the company's previous auditor, stepped down citing problems with Byju's financial reporting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-propose-18-percent-tax-on-digital-transactions-up-to-rs-2000-report-2595232-2024-09-06",
      "headline": "Payment aggregators may face 18% GST for transactions up to Rs 2,000: ReportThe final decision will be made at the GST Council's 54th meeting, chaired by Finance Minister Nirmala Sitharaman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-economy-data-adds-142000-jobs-in-august-unemployment-rate-drops-to-42-percent-expert-view-2595171-2024-09-06",
      "headline": "US adds 1,42,000 jobs in August; unemployment rate drops to 4.2%While the job data fell short of expectations, a slight dip in the unemployment rate to 4.2% indicated that the labour market is gradually cooling off, but not dramatically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-study-ipo-investors-not-looking-beyond-listing-gains-are-they-missing-out-expert-view-analysis-2595125-2024-09-06",
      "headline": "IPO investors are not looking beyond listing gains, are they missing out?According to a Sebi study, 70% of the shares, by value, were sold within a year of the IPO. The quick turnover is particularly noticeable in cases where IPO shares see a strong rise in value right after listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anant-ambani-donates-20-kg-gold-crown-worth-rs-15-crore-to-lalbaugcha-raja-2595102-2024-09-06",
      "headline": "Anant Ambani donates 20 kg gold crown worth Rs 15 crore to Lalbaugcha RajaLalbaugcha Raja, Mumbai's most popular Ganesh idol, was unveiled on Thursday ahead of Ganesh Chaturthi. Devotees visit the Lalbaugcha Raja for darshan during the 10-day Ganesh festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-share-price-surges-15-percent-record-high-despite-stock-market-crash-explained-2595026-2024-09-06",
      "headline": "Explained: Why Godfrey Phillips shares hit record high despite market downturnAt the closing bell, the shares of Godfrey Phillips were up 12.69% at Rs 7,204.35 on the Bombay Stock Exchange (BSE). Earlier, the stock jumped 14.50% to reach a record high of Rs 7,320, defying a sharp correction in the domestic indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-decline-for-6th-straight-day-is-it-a-good-time-to-buy-2595008-2024-09-06",
      "headline": "Tata Motors shares decline for 6th straight day. Is it a good time to buy?Tata Motors stock settled over 1.8% lower on Friday, extending losses for the sixth consecutive session. Read on to know whether it is the right time to buy the stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-1000-point-nifty-slips-under-24900-on-us-data-jitters-2595006-2024-09-06",
      "headline": "Sensex crashes 1,000 points, Nifty slips under 24,900 on US data jittersThe S&P BSE Sensex lost 1017.23 points to close at 81,183.93, while the NSE Nifty50 ended 292.95 points lower to end at 24,852.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godfrey-phillips-set-to-consider-21-bonus-issue-september-20-shares-jump-over-9-percent-2594984-2024-09-06",
      "headline": "Godfrey Phillips set to consider 2:1 bonus issue; shares jump over 9%A bonus issue is a way for companies to reward existing shareholders without making them pay for the additional shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-1000-points-rs-5-lakh-crore-investors-wealth-wiped-off-2594971-2024-09-06",
      "headline": "Sensex crashes 1,000 points, investors lose Rs 5 lakh croreThe bloodbath on Dalal Street has wiped off nearly Rs 5 lakh crore from the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-may-slash-fuel-prices-as-global-crude-oil-costs-decline-report-2594925-2024-09-06",
      "headline": "Government may slash petrol, diesel prices as global crude oil rates fallUS crude oil prices dropped by more than 1% on Wednesday, falling below $70 per barrel. Brent crude prices followed suit, falling by $1 to reach $72.75 per barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inheritance-showdown-godfrey-phillips-bina-modi-to-vote-on-behalf-of-family-trust-agm-2594904-2024-09-06",
      "headline": "Bina Modi to vote on behalf of family trust at Godfrey Phillips AGMThe Delhi High Court recently allowed Bina to cast her vote on behalf of the trust, which holds a 47.5% stake in the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/goldman-sachs-sbi-sell-rating-with-revised-target-price-reason-explained-2594888-2024-09-06",
      "headline": "Goldman Sachs gives SBI 'sell' rating with revised target price. Know whyThe brokerage highlighted a growing risk-reward imbalance for SBI's stock, driven by challenges in maintaining a strong return on assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-household-food-spending-dips-to-less-than-50-percent-eac-pm-report-2594878-2024-09-06",
      "headline": "India's household food spending dips to less than 50%: ReportThe change in spending, highlighted in a recent report by the Economic Advisory Council to the Prime Minister (EAC-PM), signals a shift in how Indian families allocate their monthly budgets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-turbulence-sensex-nifty-down-key-factors-explained-2594841-2024-09-06",
      "headline": "Sensex, Nifty down 1%: What's behind today's stock market turbulence?Today's market turbulence is partly linked to investor jitters ahead of the US non-farm payrolls report expected later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-tumbles-goldman-sachs-brokerage-view-83-percent-downside-2594825-2024-09-06",
      "headline": "Explained: Why Vodafone Idea shares tumbled over 14% today As of 11:51 am, Vodafone Idea's shares were trading at Rs13.60, down nearly 10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boss-packaging-solution-shares-sme-ipo-list-25-percent-premium-2594809-2024-09-06",
      "headline": "Boss Packaging Solutions makes debut on NSE SME at 25% premiumBoss Packaging Solutions listing: The stock was listed at Rs 82.5 on the NSE SME, marking a 25% premium over its IPO price of Rs 66."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kangana-ranaut-emergency-ua-certificate-makers-asked-to-cut-scenes-add-disclaimers-2596031-2024-09-08",
      "headline": "'Emergency' gets UA certificate with cut scenes, added disclaimers: SourcesKangana Ranaut's 'Emergency' has received a UA certificate from the censor board. The makers have been asked to cut scenes and add disclaimers in a few sequences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mpox-case-india-suspected-isolated-hospital-stable-2595992-2024-09-08",
      "headline": "Mpox case suspected in man who recently travelled to India, samples under testThe man has been isolated and admitted to a hospital. He is in a stable condition, the health ministry said, adding that his samples have been sent for testing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranveer-singh-announce-birth-of-baby-girl-in-adorable-post-celebs-congratulate-2595950-2024-09-08",
      "headline": "Deepika-Ranveer announce birth of daughter, Alia Bhatt has the best reactionDeepika Padukone and Ranveer Singh became parents to a baby girl on September 8. The couple shared the happy news in a heartfelt post on Instagram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-jawhar-sircar-resigns-rajya-sabha-mp-mamata-banerjee-rg-kar-trainee-doctor-rape-murder-kolkata-2596010-2024-09-08",
      "headline": "Corruption in Bengal, too many mistakes being made: Trinamool MP who quit postTrinamool Congress's Jawhar Sircar, who resigned as a Rajya Sabha MP over his government's handling of the trainee doctor's rape-murder in Kolkata, said there was a \"disease of corruption\" in Bengal and that things had become complicated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ic-814-kandahar-hijack-untold-story-when-hijackers-destroyed-honeymoon-photos-netflix-series-indian-airlines-2595049-2024-09-08",
      "headline": "IC 814 newlyweds: Burger destroyed our honeymoon photos, but we emerged strongerIndian Airlines flight IC 814, which was hijacked in 1999, had 26 couples returning from their honeymoon. Ipseeta and Bipin Menon were two of them. From losing their honeymoon photos to a hijacker to surviving on oranges and milk to avoid going to the clogged toilets, they went through seven hells in eight days. This is the IC 814 story of two newly-weds stuck in a hijack and how they emerged stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-leaders-chief-minister-post-siddaramaiah-muda-scam-probe-2596013-2024-09-08",
      "headline": "Karnataka Congress leaders eye chief minister's post as Siddaramaiah faces probeWhile the Karnataka Congress and ministers maintain that Siddaramaiah will continue in the post, some party leaders have not shied away from putting up their name for the top post in case he quits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rajnath-singh-omar-abdullah-afzal-guru-hanging-row-national-conference-bjp-jammu-kashmir-elections-2595982-2024-09-08",
      "headline": "Should we have garlanded Afzal Guru then? Rajnath Singh jabs Omar AbdullahSlamming NC leader Omar Abdullah over his remarks on the execution of 2001 Parliament attack convict Afzal Guru, Defence Minister Rajnath Singh questioned, if not hanged, should Afzal Guru have been \"garlanded\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-leader-virender-bahadur-pal-raping-lawyer-blackmailing-case-filed-2596007-2024-09-08",
      "headline": "Samajwadi Party leader accused of raping lawyer, blackmailing herA case has been filed against Samajwadi Party (SP) leader Virender Bahadur Pal, also a former president of the Mau Bar Association, in connection with the alleged rape of a female lawyer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-historic-campaign-record-29-medals-paris-full-list-2595957-2024-09-08",
      "headline": "India's historic campaign ends with record 29 medals in ParisParis Paralympics 2024: India concluded its historic campaign with a record 29 medals, including seven gold, nine silver, and 13 bronze. India secured the 18th position in the overall medals table, marking the nation's best-ever showing at the Paralympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bjp-former-mp-brij-bhushan-vinesh-phogat-bajrang-punia-haryana-assembly-elections-2595977-2024-09-08",
      "headline": "BJP advises Brij Bhushan against speaking on Vinesh Phogat, Bajrang Punia: SourcesBrij Bhushan Sharan Singh also attacked Vinesh Phogat after the Congress named her as the candidate for the Haryana Assembly election from Julana."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/aam-aadmi-party-aap-haryana-congress-alliance-india-bloc-candidate-arvind-kejriwal-rahul-gandhi-2595962-2024-09-08",
      "headline": "AAP firm on key Haryana seats in poll alliance talks with Congress: SourcesAAP is holding firm on securing key Assembly seats, particularly Kalayat and at least one seat in Kurukshetra, in its ongoing pre-poll alliance discussions with Congress, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-vlogger-christopher-lewis-found-chennai-phd-student-rayan-street-food-cart-2595889-2024-09-08",
      "headline": "Viral video: How US vlogger discovered PhD student's food cart in ChennaiA video of Chennai's PhD street food vendor asking a US food vlogger to 'Google his name' has gone viral. Here's the backstory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/creative-emmys-2024-saturday-night-live-wins-big-see-full-winners-list-2596005-2024-09-08",
      "headline": "Creative Emmys 2024: Saturday Night Live wins big. See full winners listThe first set of winners for the Creative Emmys are here. The list includes names such as Saturday Night Live, actors Maya Rudolph and Angela Bassett. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nsa-ajit-doval-likely-to-hold-talks-on-russia-ukraine-war-in-moscow-brics-nsa-meeting-2595859-2024-09-08",
      "headline": "NSA Ajit Doval to visit Russia this week, take up Ukraine peace talks: SourcesNational Security Advisor (NSA) Ajit Doval will visit Russia this week to participate in the BRICS-NSA meeting and to discuss peace efforts amid the ongoing Russia-Ukraine war."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-jordan-gunman-kills-civilians-allenby-bridge-border-army-2595990-2024-09-08",
      "headline": "3 Israelis killed by gunman crossing border from Jordan, says Israeli armyIsrael closed all three of its land border crossings with Jordan, according to the Israel Airports Authority which oversees such routes. A Jordanian border official said at least two dozen Jordanian truck drivers in the offloading area had been detained by Israel's military for interrogation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-india-bs-rishabh-pant-hilariously-joins-india-a-huddle-in-duleep-trophy-2595971-2024-09-08",
      "headline": "Watch: India B's Rishabh Pant hilariously joins India A huddle in Duleep TrophyDuleep Trophy 2024: Rishabh Pant who was representing India B hilariously joined India A's huddle on Day four morning. He scored a blazing fifty in the 3rd innings for India B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-business-politics-sports-420-06-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-boy-death-fake-doctor-quack-surgery-watching-youtube-video-2595961-2024-09-08",
      "headline": "Bihar boy, 15, dies after fake doctor performs YouTube-guided surgeryA 15-year-old boy died after a fake doctor operated on him while watching YouTube tutorials, his family alleges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/non-hindus-rohingya-muslims-hawkers-prohibited-signboards-put-up-uttarakhand-rudraprayag-2595983-2024-09-08",
      "headline": "'Non-Hindus, Rohingya Muslims prohibited' signboards put up in RudraprayagSignboards banning the entry of non-Hindus, Rohingyas and hawkers in several villages of Uttarakhand's Rudraprayag district have sparked controversy, prompting the police to launch an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nita-ambani-in-pic-with-anant-ambani-and-radhika-merchant-at-ganesh-chaturthi-celebrations-2595939-2024-09-08",
      "headline": "Nita Ambani in pics with Anant Ambani, Radhika Merchant at Ganesh Chaturthi celebrationsNita Ambani posed with her son Anant and daughter-in-law Radhika Merchant at the family's Ganesh Chaturthi celebrations held at their Mumbai residence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-assembly-election-bjp-new-candidate-list-kavinder-gupta-2595945-2024-09-08",
      "headline": "J&K polls: BJP releases 6th candidates' list, drops ex-Deputy Chief MinisterThe BJP dropped senior leader Kavinder Gupta from the Bahu constituency (formerly Gandhi Nagar) as the party released its sixth list for the Jammu and Kashmir Assembly elections today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-poolls-aap-congress-allies-raghav-chadha-cites-win-win-condition-2595944-2024-09-08",
      "headline": "Raghav Chadha cites 'win-win' condition for AAP-Congress alliance in HaryanaSpeaking to the media, AAP Rajya Sabha MP Raghav Chaddha said that \"ball-by-ball commentary\" on the alliance discussion cannot be done and people will be informed once the final decision is made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/tv-actor-vikas-sethi-dies-at-48-2595965-2024-09-08",
      "headline": "TV actor Vikas Sethi dies at 48Actor Vikas Sethi, known for his roles in shows such as Kyunki Saas Bhi Kabhi Bahu Thi and Kahiin To Hoga, died on September 8 in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kangana-ranaut-emergency-ua-certificate-makers-asked-to-cut-scenes-add-disclaimers-2596031-2024-09-08",
      "headline": "'Emergency' gets UA certificate with cut scenes, added disclaimers: SourcesKangana Ranaut's 'Emergency' has received a UA certificate from the censor board. The makers have been asked to cut scenes and add disclaimers in a few sequences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/creative-emmys-2024-saturday-night-live-wins-big-see-full-winners-list-2596005-2024-09-08",
      "headline": "Creative Emmys 2024: Saturday Night Live wins big. See full winners listThe first set of winners for the Creative Emmys are here. The list includes names such as Saturday Night Live, actors Maya Rudolph and Angela Bassett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/honey-singh-calls-out-misogyny-in-gulzar-song-beedi-objectification-of-women-2595998-2024-09-08",
      "headline": "Honey Singh calls out misogyny in Gulzar's song Beedi: Why am I the only target?Honey Singh defended his songs against objectification claims, pointing out Gulzar's controversial lyrics. He questioned why he's criticised while Gulzar is celebrated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/photo/jennifer-lopez-turns-heads-in-a-silver-slit-dress-at-unstoppable-premiere-2595987-2024-09-08",
      "headline": "Jennifer Lopez turns heads in a silver slit dress at Unstoppable premiereHollywood star and singing sensation Jennifer Lopez looked gorgeous in a silver slit dress, which she wore for her film Unstoppable's premiere at the Toronto International Film Festival (TIFF).  "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-india-vs-china-abhishek-singh-harmanpreet-singh-2596025-2024-09-08",
      "headline": "Asian Champions Trophy: India start title defence with 3-0 win against ChinaIndia started their title defence at the Asian Champions Trophy 2024 with a comprehensive 3-0 win over hosts China on Sunday, September 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-hashmatullah-shahidi-press-conference-india-test-home-2596019-2024-09-08",
      "headline": "Shahidi calls for more Tests and a dedicated home venue in India for AfghanistanAfghanistan captain Hashmatullah Shahidi is pushing for more Test matches and a dedicated home stadium in India to improve the team's training and competitive edge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-india-b-beat-a-pant-akash-musheer-saini-mukesh-report-2595999-2024-09-08",
      "headline": "Akash Deep cameo in vain as India B beat India A by 76 runs India A's poor showing with the bat helped India B secure six points in the opening round of the Duleep Trophy 2024 at the M. Chinnaswamy Stadium in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-kl-rahul-half-century-chinnaswamy-stadium-cheering-watch-video-2595997-2024-09-08",
      "headline": "KL Rahul's fighting fifty in Duleep Trophy sends Chinnaswamy into cheersKL Rahul's resilient half-century of 57 runs off 121 balls in India A's Duleep Trophy clash against India B earned him a standing ovation at Chinnaswamy Stadium, even as his team faced a challenging batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-womens-singles-aryna-sabalenka-wwe-championship-belt-flushing-meadows-2595993-2024-09-08",
      "headline": "Watch: Aryna Sabalenka gets special WWE customised belt after US Open winAryna Sabalenka received a special gift from the WWE in the form of a customised championship belt to celebrate her US Open final win on Saturday, September 7. Sabalenka secured her first US open title win on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-extremely-strong-because-talent-comes-from-everywhere-rahul-dravid-2595976-2024-09-08",
      "headline": "Indian cricket extremely strong because talent comes from everywhere: DravidCricket legend Rahul Dravid emphasized the role of nationwide talent in making Indian cricket a formidable force. Dravid highlighted the shift from urban-centric talent to a more inclusive system that nurtures players from every part of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-india-bs-rishabh-pant-hilariously-joins-india-a-huddle-in-duleep-trophy-2595971-2024-09-08",
      "headline": "Watch: India B's Rishabh Pant hilariously joins India A huddle in Duleep TrophyDuleep Trophy 2024: Rishabh Pant who was representing India B hilariously joined India A's huddle on Day four morning. He scored a blazing fifty in the 3rd innings for India B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-historic-campaign-record-29-medals-paris-full-list-2595957-2024-09-08",
      "headline": "India's historic campaign ends with record 29 medals in ParisParis Paralympics 2024: India concluded its historic campaign with a record 29 medals, including seven gold, nine silver, and 13 bronze. India secured the 18th position in the overall medals table, marking the nation's best-ever showing at the Paralympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-indian-contingent-medal-tally-paris-vs-tokyo-athletics-2595760-2024-09-08",
      "headline": "India at Paralympics, Paris 2024 vs Tokyo 2020: How our athletes faredIndia had their best Paralympics campaign in Paris as compared to Tokyo. The athletics contingent proved to be the difference makers for India as the contingent was able to bag close to 30 medals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-live-streaming-when-and-where-to-watch-2595946-2024-09-08",
      "headline": "Afghanistan vs New Zealand one-off Test Live streaming: When and where to watchAfghanistan and New Zealand will square off against each other in their first-ever one-off Test match in Greater Noida. Find out all the live streaming details of the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-india-bs-rishabh-pant-hilariously-joins-india-a-huddle-in-duleep-trophy-2595971-2024-09-08",
      "headline": "Watch: India B's Rishabh Pant hilariously joins India A huddle in Duleep TrophyDuleep Trophy 2024: Rishabh Pant who was representing India B hilariously joined India A's huddle on Day four morning. He scored a blazing fifty in the 3rd innings for India B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-historic-campaign-record-29-medals-paris-full-list-2595957-2024-09-08",
      "headline": "India's historic campaign ends with record 29 medals in ParisParis Paralympics 2024: India concluded its historic campaign with a record 29 medals, including seven gold, nine silver, and 13 bronze. India secured the 18th position in the overall medals table, marking the nation's best-ever showing at the Paralympic Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-indian-contingent-medal-tally-paris-vs-tokyo-athletics-2595760-2024-09-08",
      "headline": "India at Paralympics, Paris 2024 vs Tokyo 2020: How our athletes faredIndia had their best Paralympics campaign in Paris as compared to Tokyo. The athletics contingent proved to be the difference makers for India as the contingent was able to bag close to 30 medals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-live-streaming-when-and-where-to-watch-2595946-2024-09-08",
      "headline": "Afghanistan vs New Zealand one-off Test Live streaming: When and where to watchAfghanistan and New Zealand will square off against each other in their first-ever one-off Test match in Greater Noida. Find out all the live streaming details of the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-syria-intercontinental-cup-livestreaming-channel-lallianzuala-chhangte-2595941-2024-09-08",
      "headline": "India vs Syria, Intercontinental Cup Live-streaming: All you need to knowIndia faces a must-win clash against Syria in the Intercontinental Cup. New coach Manolo Marquez aims to secure his first trophy, but only a victory will keep India's hopes alive against a strong Syrian sideThe "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/randhir-singh-becomes-first-indian-to-be-elected-as-oca-president-2595935-2024-09-08",
      "headline": "Randhir Singh becomes first Indian to be elected as OCA presidentRandhir Singh has become the first Indian to be elected president of the Olympic Council of Asia (OCA). His unanimous election took place during the 44th General Assembly of the OCA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-or-joe-root-dinesh-karthik-picks-his-no1-choice-test-batter-2595934-2024-09-08",
      "headline": "Virat Kohli or Joe Root? Dinesh Karthik picks his No.1 choice Test batterDinesh Karthik picked Virat Kohli over Joe Root as his No. 1 Test batter. However, his choice was purely based on his association with Kohli and acknowledged "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/exclusive-imran-majid-imzilla-fastest-car-in-india-nissan-skyline-gtr-2595933-2024-09-08",
      "headline": "Imran Majid: Indian drag racer aims to be world's fastest with 'love' ImzillaIn an exclusive interaction with IndiaToday.in, Indian drag racer Imran Majid talks about how he came into the sport, the future of it in India and his dream of making the fastest car in the world with his true 'love', Imzilla. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-most-catches-equal-ms-dhoni-record-innings-duleep-trophy-2595926-2024-09-08",
      "headline": "Jurel equals Dhoni's record of most catches in an innings in Duleep TrophyIndia A wicketkeeper Dhruv Jurel equalled MS Dhoni's record for the most catches by a wicketkeeper in an innings during the Duleep Trophy match against India B. Jurel's seven catches were instrumental in restricting India B to 184 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-jannik-sinner-mens-singles-final-head-to-head-2595767-2024-09-08",
      "headline": "Sinner vs Taylor Fritz, Men's Singles Final: All you need to knowUS Open 2024: Jannik Sinner and Taylor Fritz will face each other in the final of the men's singles on Sunday. While Fritz is taking part in his maiden Grand Slam final, Sinner made the record for becoming the first Italian man to qualify for the final at Flushing Meadows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-five-star-akash-deep-auditions-well-for-bangladesh-test-series-2595918-2024-09-08",
      "headline": "Duleep Trophy: Five-star Akash Deep auditions well for Bangladesh Test seriesAkash Deep impressed in his outing in round one of the Duleep Trophy 2024 for India A as he picked up a five-wicket haul in the third innings. The bowler made a strong case for himself for getting selected in the Test series vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-retires-from-international-cricket-after-australia-series-snub-2595878-2024-09-08",
      "headline": "Moeen Ali retires from international cricket after Australia series snubEngland all-rounder Moeen Ali announced his retirement from international cricket at the age of 37. He would continue playing franchise cricket and might consider taking a coaching role later on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jurel-most-catches-equal-ms-dhoni-record-innings-duleep-trophy-2595926-2024-09-08",
      "headline": "Jurel equals Dhoni's record of most catches in an innings in Duleep TrophyIndia A wicketkeeper Dhruv Jurel equalled MS Dhoni's record for the most catches by a wicketkeeper in an innings during the Duleep Trophy match against India B. Jurel's seven catches were instrumental in restricting India B to 184 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jannik-sinner-jannik-sinner-mens-singles-final-head-to-head-2595767-2024-09-08",
      "headline": "Sinner vs Taylor Fritz, Men's Singles Final: All you need to knowUS Open 2024: Jannik Sinner and Taylor Fritz will face each other in the final of the men's singles on Sunday. While Fritz is taking part in his maiden Grand Slam final, Sinner made the record for becoming the first Italian man to qualify for the final at Flushing Meadows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-five-star-akash-deep-auditions-well-for-bangladesh-test-series-2595918-2024-09-08",
      "headline": "Duleep Trophy: Five-star Akash Deep auditions well for Bangladesh Test seriesAkash Deep impressed in his outing in round one of the Duleep Trophy 2024 for India A as he picked up a five-wicket haul in the third innings. The bowler made a strong case for himself for getting selected in the Test series vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/moeen-ali-retires-from-international-cricket-after-australia-series-snub-2595878-2024-09-08",
      "headline": "Moeen Ali retires from international cricket after Australia series snubEngland all-rounder Moeen Ali announced his retirement from international cricket at the age of 37. He would continue playing franchise cricket and might consider taking a coaching role later on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-fitness-coach-tiger-head-tattoo-jason-stacy-jessica-pegula-2595876-2024-09-08",
      "headline": "Sabalenka reveals 'Tiger-head' bet with fitness coach on US Open triumphAryna Sabalenka's fitness coach Jason Stacy sported a tiger tattoo on his head which was part of a hilarious bet between the two, just before Sabalenka clinched her first US Open title by defeating Jessica Pegula in a thrilling final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/olympics/story/rebecca-cheptegeis-death-exposes-a-tragic-pattern-in-kenyan-athletics-community-2595875-2024-09-08",
      "headline": "Rebecca Cheptegei's death exposes a tragic pattern in Kenyan athletics communityMarathoner Rebecca Cheptegei, who competed in the Paris Olympics last month, was tragically set on fire by her boyfriend this week, according to police. This incident marks the fourth horrific killing of an Olympian in Kenya in the past three years. The rising statistics on domestic violence in Kenya underscore a troubling trend, with these tragedies bringing renewed global attention to the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/avesh-khans-response-after-chinnaswamy-erupts-with-rcb-chants-in-duleep-trophy-2595868-2024-09-08",
      "headline": "Avesh Khan's response after Chinnaswamy erupts with RCB chants in Duleep TrophyAvesh Khan gave a priceless response after the Chinnaswamy crowd started teasing him with the chants of 'RCB-RCB'. Avesh was representing India A in Duleep Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-beit-sadegh-controversy-disqualification-javelin-final-navdeep-singh-gold-2595863-2024-09-08",
      "headline": "Why Iran's Sadegh was disqualified from Paralympics javelin finalIran's Beit Sadegh won gold in Men's Javelin Throw F41 at the Paris Paralympics, only to be shockingly disqualified for a code violation, turning India's Navdeep Singh's silver into an unexpected gold."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}