{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/why-family-offices-are-crucial-to-indias-viksit-bharat-by-2047-dream-2690899-2025-03-08",
      "headline": "Why family offices are crucial to India's 'Viksit Bharat by 2047' dream?At the India Today Conclave 2025, Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, discussed the growing role of family offices in India's journey towards becoming a developed economy by 2047. In a session titled \"A Case for Tomorrow\", moderated by Siddharth Zarabi, Shroff explained why family offices are vital for India's economic expansion and how they can contribute to achieving a Rs 30 trillion GDP target in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-gold-card-visas-not-worth-it-for-wealthy-indian-investors-rishabh-shroff-partner-law-firm-cyril-amarchand-mangaldas-2690874-2025-03-08",
      "headline": "US Gold Card visa expensive, not worth it for Indians: Top law firm bossRishabh Shroff, partner at Cyril Amarchand Mangaldas, said Donald Trump's $5 million US Gold Card visa does not make sense for Indians as cheaper alternatives are available. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indias-ultra-rich-top-1-percent-seeking-new-homes-abroad-rishabh-shroff-explains-2690872-2025-03-08",
      "headline": "Why are the richest 1% leaving India? Law firm boss Rishabh Shroff explains Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, shared insights into the rising trend of high-net-worth individuals (HNWIs) acquiring foreign passports and moving their wealth abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pay-is-based-on-capability-not-gender-avarna-jain-on-pay-gap-in-music-industry-2690861-2025-03-08",
      "headline": "Pay is based on capability, not gender: Avarna Jain on pay gap in music industryAt the India Today Conclave 2025, Avarna Jain, Vice Chairperson of Saregama, spoke about the role of women in the workforce and addressed the long-debated issue of pay parity in the music and entertainment industry. She stated that in creative fields, women are leading the way, and pay is determined by ability and capability, not gender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/place-of-tv-will-never-be-taken-away-anu-ranjan-on-otts-replacing-tv-2690829-2025-03-08",
      "headline": "Place of TV will never be taken away: Anu Ranjan on OTTs replacing TVAnu Ranjan, President of The Indian Television Academy, said that television will remain relevant despite the rise of OTT platforms at the India Today Conclave 2025. She explained that while digital streaming services are growing, they cannot replace television, mainly due to affordability and accessibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-today-conclave-2025-women-leaders-on-breaking-barriers-challenges-and-leadership-2690741-2025-03-08",
      "headline": "Conclave 2025: Women leaders on breaking barriers, challenges and leadershipAt the India Today Conclave 2025, Namita Thapar, Executive Director of Emcure Pharmaceuticals, stated that businesses should be evaluated based on numbers, not gender. Speaking at the session \"Breaking Barriers and Building Legacies,\" Thapar stressed that success in business depends on financial results, not whether a man or woman runs it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-see-best-week-of-2025-after-massive-correction-what-dalal-street-investors-can-expect-next-2690794-2025-03-08",
      "headline": "Dalal Street logs best week of 2025. Will positive momentum continue?After a long spell of selling, investors on Dalal Street have finally got some relief. But does this mean the worst is over? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/businesses-should-be-judged-on-numbers-not-genders-namita-thapar-2690743-2025-03-08",
      "headline": "Businesses should be judged by numbers, not gender: Namita Thapar International Women's Day: Namita Thapar, Executive Director of Emcure Pharmaceuticals, highlighted how financial results remain the key factor in business success, regardless of whether a man or a woman runs the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/women-investors-are-putting-in-more-money-in-mutual-funds-than-men-phonepe-wealth-report-2690737-2025-03-08",
      "headline": "Women investors outpacing men in mutual fund investments: ReportThere's a common belief that women prefer safer investments, but the data challenges that view. More women are actively investing in mutual funds and surpassing men in key areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-money-deadlines-you-can-not-miss-in-march-2025-2690529-2025-03-07",
      "headline": "These 3 money deadlines you can't miss in March 2025If you want to secure better returns, deposit in these special fixed deposits, which are available only for a limited period. The last date for investing in these schemes is March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rents-are-increasing-faster-than-salary-in-bengaluru-details-here-2690496-2025-03-07",
      "headline": "Bengaluru's housing rent crisis triggers online debate. Details hereA recent social media post has ignited debate over Bengaluru's soaring rents, with users sharing how housing costs are outpacing salaries and making city living unaffordable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adtech-new-delhi-unveils-adtechhonours-to-recognise-marketing-tech-innovation-2690472-2025-03-07",
      "headline": "ad:tech New Delhi unveils ad:techHonours to recognise marketing tech innovationHeld on March 6 at Yashobhoomi, in collaboration with the International Advertising Association (IAA) India Chapter, this event brought together industry leaders to honour the innovators shaping the future of tech-driven marketing."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/zahan-kapoor-on-legacy-black-warrant-and-carving-his-own-path-watch-video-india-today-conclave-2025-2690902-2025-03-08",
      "headline": "Zahan Kapoor on legacy, Black Warrant, and carving his own path. Watch"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zahan-kapoor-black-warrant-kapoor-family-ranbir-kapoor-india-today-conclave-2690795-2025-03-08",
      "headline": "Zahan Kapoor reflects on celebrityhood, Kapoor legacy and Black Warrant's successActor Zahan Kapoor opened up about his career, his latest Netflix show, Black Warrant, his famous cousins, and more, at the India Today Conclave 2025 held in New Delhi on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mindy-kaling-reacts-to-criticism-of-meghan-markle-with-love-meghan-2690838-2025-03-08",
      "headline": "Mindy Kaling reacts to criticism of Meghan Markle's With Love, MeghanActor and creator Mindy Kaling has finally reacted to the criticism of Meghan Markle's lifestyle series, With Love, Meghan. The show premiered on Netflix on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-electric-state-review-russo-brothers-dystopian-film-sparks-and-fizzles-out-2690796-2025-03-08",
      "headline": "The Electric State review: Russo Brothers' dystopian film sparks and fizzles outReleased-Fri Mar 14, 2025The Netflix film, 'The Electric State' falls short of entertainment. The chemistry between Millie Bobbie Brown and Chris Pratt looks awkward, while the bots don't do enough to keep the excitement alive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-x-reviews-internet-shreds-ibrahim-ali-khan-khushi-kapoor-film-calls-it-trashy-2690816-2025-03-08",
      "headline": "Nadaaniyan X reviews: Internet shreds Ibrahim-Khushi's film, calls it trashyNadaaniyan, starring Ibrahim Ali Khan and Khushi Kapoor, debuts on Netflix to widespread criticism, with viewers and critics alike branding it 'unbearable' and 'trashy'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ruby-review-a-debut-album-thats-ambitious-polished-and-unapologetically-jennie-2690749-2025-03-08",
      "headline": "Ruby review: A debut album that's ambitious, polished, and unapologetically Jennie Blackpink's Jennie's debut solo album, Ruby, is a bold exploration of her musical identity, featuring 15 tracks that delve into themes of empowerment and self-discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-with-love-meghan-renewed-for-season-2-amid-criticism-2690736-2025-03-08",
      "headline": "Meghan Markle's With Love, Meghan renewed for season 2 amid criticismThe Duchess of Sussex, Meghan Markle, has announced a second season of her Netflix series, With Love, Meghan. The show premiered on the OTT giant on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/armaan-malik-kritika-malik-son-zaid-diagnosed-with-rickets-dont-curse-children-payal-malik-2690728-2025-03-08",
      "headline": "BB OTT 3 fame Kritika-Armaan Malik's son Zaid diagnosed with ricketsBigg Boss OTT 3 fame Kritika Malik and husband Armaan Malik's son, Zaid has been diagnosed with rickets. The news was shared by Armaan's first wife, Payal Malik, in her latest vlog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/neena-gupta-tvf-phulera-ka-panchayati-raj-exposes-proxy-politics-in-rural-india-2690697-2025-03-08",
      "headline": "Neena Gupta's 'Phulera Ka Panchayati Raj' exposes proxy politics in rural IndiaTVF's new series 'Phulera Ka Panchayati Raj' exposed the problem of proxy politics in rural India. In collaboration with the popular series, Panchayat, the series starring Neena Gupta, Faisal Malik, and others is currently trending at No 1 on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pritam-defends-blackpink-jennie-plagiarism-controversy-minor-similarities-statement-rocky-aur-rani-kii-prem-kahaani-alia-bhatt-2690676-2025-03-08",
      "headline": "Pritam defends Blackpink's Jennie amid plagiarism row: Minor similarities happenMusic composer Pritam recently shared a statement and defended Blackpink's Jennie amid plagiarism claims after her recently released teaser looked similar to Alia Bhatt's theme song from Rocky Aur Rani Kii Prem Kahaani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-trailer-out-tom-hardy-pierce-brosnan-helen-mirren-guy-ritchie-jiohotstar-2690587-2025-03-07",
      "headline": "Mobland trailer: Tom Hardy, Pierce Brosnan headline Guy Ritchie's new crime showMobland, the much-awaited crime series by Guy Ritchie, is all set for its grand premiere on JioHotstar this March. Featuring stars like Tom Hardy and Helen Mirren, the show explores the dark world of international crime syndicates."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mrityunjay-mahakumbh-not-mrityu-kumbh-yogi-adityanath-india-today-conclave-2690978-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Critics said Mrityu Kumbh, devotees showed it's Mrityunjay Kumbh: Yogi AdityanathIndia Today Conclave: Yogi Adityanath said that the huge number of devotees turnout at Maha Kumbh silenced those who made negative comments about the religious gathering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihars-nalanda-was-oxford-cambridge-and-nasa-of-its-day-william-dalrymple-2690972-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar's Nalanda was Oxford, Cambridge, and NASA of its day: William DalrympleIndia Today Conclave: Historian William Dalrymple spoke about the intellectual exchange of India with the rest of the world. He pointed out that at the heart of this was the Nalanda University in Bihar, which Dalrymple described as the \"Oxford, Cambridge, or NASA of its day.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indias-ultra-rich-top-1-percent-seeking-new-homes-abroad-rishabh-shroff-explains-2690872-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why are the richest 1% leaving India? Law firm boss Rishabh Shroff explains Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, shared insights into the rising trend of high-net-worth individuals (HNWIs) acquiring foreign passports and moving their wealth abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-world-championship-win-parents-india-today-conclave-2690846-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "D Gukesh on success, stability: Glad my parents don't have to worry about moneyWorld Champion D Gukesh dedicated his title win to his parents, saying that they don't have to think about money anymore. Gukesh's parents played a big role in shaping his career and his Championship win over Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-2025/story/meet-aishan-and-ruh-india-today-group-unveils-ai-popstars-by-stage-aaj-tak-at-conclave-2025-2690880-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India Today Group unveils AI popstars by Stage Aaj Tak at Conclave 2025 At India Today Conclave 2025, the India Today Group's Stage Aaj Tak introduced two AI popstars — Aishan and Ruh — with an aim to blend technology and culture for times when AI is increasingly going to play a key role in our lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-dead-injured-kuki-members-clash-forces-kangpokpi-curfew-2690947-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 dead, 27 security personnel hurt in Manipur as Kukis clash with forces: SourcesThe clashes occurred as locals defied Union Home Minister Amit Shah's directive for the free movement of all vehicles across Manipur starting today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/india-today-conclave-2025-nara-lokesh-spotlight-andhra-pradesh-from-it-to-ai-2690748-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana has Hyderabad, what do you have? Nara Lokesh's 'Deewar' style replySpeaking at the India Today Conclave, Andhra Pradesh IT and Human Resources Minister Minister Nara Lokesh said Chief Minister Chandrababu Naidu was the competitive advantage that their state had.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/historian-william-dalrymple-ancient-trade-route-silk-road-history-marginalised-rome-trade-relations-2690963-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, not China, centre of ancient trade: William Dalrymple debunks popular historyIndia was the centre of ancient trade, not China, historian William Dalrymple said, debunking popular historical claims at the India Today Conclave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gene-hackman-lived-with-wife-corpse-for-a-week-2690917-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Gene Hackman lived with wife's corpse for a week, say officialsThe late Gene Hackman reportedly lived with his wife Betsy's dead body for a week, before he succumbed to heart disease. The medical officials have now disclosed why that was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/israeli-tourist-homestay-owner-raped-in-karnataka-koppal-male-friend-drowned-body-found-case-2690696-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israeli tourist, homestay host raped in Hampi, male friend's body found in canalThree male companions, who were with the women, were assaulted and then thrown into a canal near Hampi in Karnataka. While two of them managed to come out of the waters, the body of another was recovered this morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/pfizer-covid-vaccine-rushed-to-market-led-to-reproductive-damages-dr-naomi-wolf-2690943-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pfizer Covid vaccine rushed to market, led to reproductive damages: Dr Naomi WolfWolf, who stated that she is not vaccinated against Covid-19, claimed that live birth rates have dropped by 13-20%, attributing the decline to adverse effects of the vaccines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-new-tattoo-t20-world-cup-2026-india-today-conclave-2690952-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Win T20 World Cup 2026, get a new tattoo: Suryakumar Yadav reveals wife's challengeSurykumar Yadav revealed that his wife told him to get a new tattoo after doing something special in the T20 World Cup 2026. Suryakumar is the current T20I captain of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-and-kareena-kapoor-hug-interact-at-iifa-event-video-2690820-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Geet and Aditya reunite: Kareena, Shahid Kapoor hug at IIFA event. WatchActors Shahid Kapoor and Kareena Kapoor were seen interacting with each other at IIFA Awards event ahead of the grand night. The two had famously shared screen space in the Imtiaz Ali directorial, Jab We Met. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-final-shubman-gill-2690922-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma to retire after Champions Trophy? Here's what Shubman Gill saidIndia vice-captain Shubman Gill has reacted to Rohit Sharma's retirement rumours. At the pre-final press conference, Gill said that Rohit is yet to discuss his ODI retirement with the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/walter-andersen-american-author-rss-bp-relation-debate-global-outreach-india-today-conclave-2690942-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS encourages debate, but leadership's decision final: Author Walter AndersenIndia Today Conclave: American academic and author Walter K Andersen examines the evolution of the RSS, its ideological framework, and its relationship with the ruling BJP."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kathua-search-operation-three-missing-civilians-after-wedding-indian-army-special-operations-group-possible-terror-link-2690722-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bodies of 3 missing J&K locals found, cops suspect accident: SourcesPolice suspect that the Jammu and Kashmir locals, who went missing while on their way to attend a wedding, could have been killed in an accident, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/lalit-modi-acquires-vanuatu-citizenship-all-about-pacific-island-nation-2690875-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lalit Modi acquires Vanuatu citizenship: All about Pacific island nationVanuatu, a tropical paradise in the Pacific, has drawn global attention after former IPL chief Lalit Modi acquired its citizenship. The country is known for its Citizenship-by-Investment (CBI) program, often called the 'golden passport' scheme, which offers fast-track citizenship to foreign investors. Here's all you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-458-07-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/personalised-vaccine-autogene-cevumeran-treatment-deadly-pancreatic-cancer-vinod-balachandran-2689748-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New personalised vaccine shows promise in treating deadly pancreatic cancerThese vaccines work by stimulating the body's immune response against cancer cells, often by training immune cells (like T cells) to target specific tumor proteins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/digital-immortality-can-ai-clones-let-us-live-forever-2690886-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AI must serve us, not rule us: Guru Gauranga Das on digital clonesAs AI and digital cloning evolve, the debate intensifies—can technology grant us digital immortality, or will it redefine what it means to be human? While AI assists in preserving memories, true wisdom lies in ensuring that human values and ethics remain at the core."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-hands-over-command-of-space-station-to-russian-cosmonaut-2690910-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Homecoming soon: Sunita Williams hands over command of Space StationWilliams now turns her attention to her return to Earth with fellow crewmates Nick Hague and Butch Wilmore from Nasa and Roscosmos cosmonaut Aleksandr Gorbunov. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhis-need-to-filter-out-remark-at-gujarat-congress-assembly-election-meet-bjp-reacts-2690935-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi's 'need to filter out' remark at Gujarat Congress meet, BJP reactsDuring his two-day visit to Gujarat, Congress leader Rahul Gandhi called for identifying and removing party leaders and workers covertly supporting the BJP, as he sought to strengthen the party ahead of the 2027 Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-chief-minister-mohan-yadav-death-penalty-for-conversion-congress-arif-masood-2690926-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Those behind religious conversions will be hanged: Madhya Pradesh Chief MinisterMadhya Pradesh Chief Minister Mohan Yadav proposed death penalty for religious conversion, equating it with the punishment for the rape of minors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-offer-yet-air-force-chief-ap-singh-us-f35-fighter-jet-pitch-india-today-conclave-2690717-2025-03-08#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not like a fridge we can buy by just the looks of it: Air chief on US F-35 jetsAir Force chief AP Singh, speaking at the India Today Conclave, flagged India's need to catch up with the latest technology and accelerate its fifth-generation fighter jet program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-pic-ahead-of-iifa-event-fan-reactions-viral-2690964-2025-03-08",
      "headline": "SRK's pic ahead of IIFA event grabs fans' attention: Ageing like fine wineSuperstar Shah Rukh Khan is currently in Pink City Jaipur for the IIFA event. The actor looked dapper in his latest photo, which was shared by his manager, Pooja Dadlani, on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gene-hackman-lived-with-wife-corpse-for-a-week-2690917-2025-03-08",
      "headline": "Actor Gene Hackman lived with wife's corpse for a week, say officialsThe late Gene Hackman reportedly lived with his wife Betsy's dead body for a week, before he succumbed to heart disease. The medical officials have now disclosed why that was. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/pics-zahan-kapoor-on-surname-theatre-background-and-grandfather-shashi-kapoor-india-today-conclave-2025-2690898-2025-03-08",
      "headline": "Zahan Kapoor on his surname, theatre background, and grandfather Shashi Kapoor. PicsZahan Kapoor, on day two of India Today Conclave 2025, reflected on the weight of his surname, his deep-rooted connection to theatre, and the lasting legacy of his grandfather, Shashi Kapoor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-ajit-agarkar-2690981-2025-03-08",
      "headline": "Ajit Agarkar to discuss Rohit Sharma's future after Champions Trophy finalChief selector Ajit Agarkar is set to meet India captain Rohit Sharma after the conclusion of the Champions Trophy.  According to sources privy to the matter, they are going to discuss Rohit's future in the ODI team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-t20-world-cup-victory-broke-the-jinx-were-now-hungry-to-win-more-shubman-gill-2690979-2025-03-08",
      "headline": "T20 World Cup victory broke the jinx, we're now hungry to win more: Shubman GillIndia vice captain Shubman Gill said that the T20 World Cup 2024 victory broke the knockout jinx of the team, and they are now they're hungry to add more titles to their cabinet. India are set to lock horns in the final of the ICC Champions Trophy 2025 against New Zealand on Sunday, March 9 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadav-on-t20-world-cup-catch-2690967-2025-03-08",
      "headline": "I watch my T20 World Cup 2024 final catch every day: Suryakumar YadavIndia's T20I captain Suryakumar Yadav revealed that he watches his T20 World Cup catch every day. Suryakumar Yadav took a sensational catch at long off in the final to help India beat South Africa and clinch their second successive T20 World Cup title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-corbin-bosch-peshawar-zalmi-psl-2690960-2025-03-08",
      "headline": "IPL or PSL? Mumbai Indians new man Corbin Bosch signs up for both leaguesMumbai Indians' new man Corbin Bosch finds himself in a tricky spot as the South African all-rounder has signed up for the IPL 2025 and PSL 2025. Bosch came in as a replacement signing for MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-new-tattoo-t20-world-cup-2026-india-today-conclave-2690952-2025-03-08",
      "headline": "Win T20 World Cup 2026, get a new tattoo: Suryakumar Yadav reveals wife's challengeSurykumar Yadav revealed that his wife told him to get a new tattoo after doing something special in the T20 World Cup 2026. Suryakumar is the current T20I captain of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-childhood-coach-rajkumar-sharma-2690929-2025-03-08",
      "headline": "If Virat Kohli continues his form, India will win: Childhood coach Rajkumar SharmaStar India batter Virat Kohli's childhood coach Rajkumar Sharma has said that India will definitely win the final of the ICC Champions Trophy final if the batting stalwart continues his form. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-final-shubman-gill-2690922-2025-03-08",
      "headline": "Rohit Sharma to retire after Champions Trophy? Here's what Shubman Gill saidIndia vice-captain Shubman Gill has reacted to Rohit Sharma's retirement rumours. At the pre-final press conference, Gill said that Rohit is yet to discuss his ODI retirement with the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-admits-pressure-of-final-ind-vs-nz-india-vs-new-zealand-2690907-2025-03-08",
      "headline": "Gill admits pressure of final but assures team will make amends for World Cup lossStar India batter Shubman Gill admitted that the pressure of the final would be there on the team ahead of the summit clash against New Zealand in the ICC Champions Trophy. However, he assured that the team will look to achieve what they couldn't the last time around."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/d-gukesh-alpha-walk-india-today-conclave-exclusive-2690884-2025-03-08",
      "headline": "World Champion D Gukesh shows off 'alpha walk' at India Today Conclave 2025World Champion D Gukesh showed off his 'alpha walk' during the India Today Concalve 2025 on Saturday, March 8. Gukesh spoke about his World title win and how he wanted to dedicate it to his parents, the impact of Viswanathan Anand on India's golden chess revolution and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-r-ashwin-on-indias-dubai-advantage-can-only-laugh-at-questions-2690870-2025-03-08",
      "headline": "R Ashwin on India's criticism for Dubai advantage: Can only laugh at questionsFormer India spinner Ravichandran Ashwin has said that the questions on India's advantage in Dubai in the ongoing ICC Champions Trophy 2025 makes him laugh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-india-chess-revolution-covid-pandemic-viswanathan-anand-2690860-2025-03-08",
      "headline": "D Gukesh explains how Covid-19 fuelled India's chess revolutionWorld Chess Champion D Gukesh credited the Covid-19 lockdown and Viswanathan Anand's mentorship for India's chess revolution. He credited the training and government support for helping young talents achieve global success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-retirement-india-vs-new-zealand-final-shubman-gill-2690922-2025-03-08",
      "headline": "Rohit Sharma to retire after Champions Trophy? Here's what Shubman Gill saidIndia vice-captain Shubman Gill has reacted to Rohit Sharma's retirement rumours. At the pre-final press conference, Gill said that Rohit is yet to discuss his ODI retirement with the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-shubman-gill-admits-pressure-of-final-ind-vs-nz-india-vs-new-zealand-2690907-2025-03-08",
      "headline": "Gill admits pressure of final but assures team will make amends for World Cup lossStar India batter Shubman Gill admitted that the pressure of the final would be there on the team ahead of the summit clash against New Zealand in the ICC Champions Trophy. However, he assured that the team will look to achieve what they couldn't the last time around."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/d-gukesh-alpha-walk-india-today-conclave-exclusive-2690884-2025-03-08",
      "headline": "World Champion D Gukesh shows off 'alpha walk' at India Today Conclave 2025World Champion D Gukesh showed off his 'alpha walk' during the India Today Concalve 2025 on Saturday, March 8. Gukesh spoke about his World title win and how he wanted to dedicate it to his parents, the impact of Viswanathan Anand on India's golden chess revolution and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-r-ashwin-on-indias-dubai-advantage-can-only-laugh-at-questions-2690870-2025-03-08",
      "headline": "R Ashwin on India's criticism for Dubai advantage: Can only laugh at questionsFormer India spinner Ravichandran Ashwin has said that the questions on India's advantage in Dubai in the ongoing ICC Champions Trophy 2025 makes him laugh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-india-chess-revolution-covid-pandemic-viswanathan-anand-2690860-2025-03-08",
      "headline": "D Gukesh explains how Covid-19 fuelled India's chess revolutionWorld Chess Champion D Gukesh credited the Covid-19 lockdown and Viswanathan Anand's mentorship for India's chess revolution. He credited the training and government support for helping young talents achieve global success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-press-conference-dubai-pitch-weather-2690858-2025-03-08",
      "headline": "IND vs NZ, presser Highlights: Mitchell Santner wary of Varun and Virat threatIND vs NZ, Champions Trophy Final press conference Highlights: New Zealand captain Mitchell Santner says that his team will have to adapt rapidly to the conditions on Sunday. Santner concluded the press conference by saying that both teams have to be prepared for sustained spells of pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-world-championship-win-parents-india-today-conclave-2690846-2025-03-08",
      "headline": "D Gukesh on success, stability: Glad my parents don't have to worry about moneyWorld Champion D Gukesh dedicated his title win to his parents, saying that they don't have to think about money anymore. Gukesh's parents played a big role in shaping his career and his Championship win over Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-will-young-knockout-2000-heroics-dubai-2690836-2025-03-08",
      "headline": "Will Young hopes New Zealand can repeat ICC Knockout 2000 heroics vs IndiaNew Zealand opener Will Young has said that the current side will be aiming to replicate the heroics of the team that won the ICC Knockout in 2000. India and New Zealand will face off in the final of the Champions Trophy 2025 on Sunday, March 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mohammad-amir-virat-kohli-royal-challengers-bengaluru-2690824-2025-03-08",
      "headline": "Mohammad Amir, Virat Kohli at RCB? Pakistan pacer keen to play IPL in 2026Pakistan pacer Mohammad Amir is hoping that he can play in the IPL in 2026 after he obtains a British passport. Amir also said that his favourite team in the IPL is Royal Challengers Bengaluru, where Virat Kohli plays. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-dubai-pitch-report-advantage-semi-fresh-2690803-2025-03-08",
      "headline": "IND vs NZ, Champions Trophy final pitch report: Who gets the advantage?India's Champions Trophy final against New Zealand will be played on a 'semi-fresh' Dubai pitch used in their group-stage win over Pakistan, adding an intriguing element to the high-stakes clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-sunday-jinx-icc-tournaments-dubai-2690755-2025-03-08",
      "headline": "India to battle 'Sunday jinx' in Champions Trophy Final vs New ZealandIndia will look to break their long-standing Sunday final curse when they face New Zealand in the Champions Trophy final, as Rohit Sharma aims to secure his first ICC trophy as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ravi-shastri-prediction-virat-kohli-kane-williamson-2690745-2025-03-08",
      "headline": "If there's one team that can beat India, it's New Zealand: Ravi ShastriRavi Shastri has given his prediction for the Champions Trophy 2025 final, claiming that India hold just a slender advantage over New Zealand. Shastri also gave his picks for potential gamechangers and Player Of The Match nominees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ravindra-jadeja-indian-team-gautam-gambhir-2690721-2025-03-08",
      "headline": "Indian dressing room knows value of underrated Ravindra Jadeja: Gautam GambhirIndian team coach Gautam Gambhir has said that the squad understands the value of Ravindra Jadeja, calling him one of the top all-rounders in world cricket. Jadeja has continued to be a vital cog in the Indian cricket team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-dubai-pitch-report-advantage-semi-fresh-2690803-2025-03-08",
      "headline": "IND vs NZ, Champions Trophy final pitch report: Who gets the advantage?India's Champions Trophy final against New Zealand will be played on a 'semi-fresh' Dubai pitch used in their group-stage win over Pakistan, adding an intriguing element to the high-stakes clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-sunday-jinx-icc-tournaments-dubai-2690755-2025-03-08",
      "headline": "India to battle 'Sunday jinx' in Champions Trophy Final vs New ZealandIndia will look to break their long-standing Sunday final curse when they face New Zealand in the Champions Trophy final, as Rohit Sharma aims to secure his first ICC trophy as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ravi-shastri-prediction-virat-kohli-kane-williamson-2690745-2025-03-08",
      "headline": "If there's one team that can beat India, it's New Zealand: Ravi ShastriRavi Shastri has given his prediction for the Champions Trophy 2025 final, claiming that India hold just a slender advantage over New Zealand. Shastri also gave his picks for potential gamechangers and Player Of The Match nominees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ravindra-jadeja-indian-team-gautam-gambhir-2690721-2025-03-08",
      "headline": "Indian dressing room knows value of underrated Ravindra Jadeja: Gautam GambhirIndian team coach Gautam Gambhir has said that the squad understands the value of Ravindra Jadeja, calling him one of the top all-rounders in world cricket. Jadeja has continued to be a vital cog in the Indian cricket team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-2025-final-india-vs-new-zealand-weather-forecast-in-dubai-2690707-2025-03-08",
      "headline": "India vs New Zealand, Dubai Weather Forecast: Cloudy weather to grace final?IND vs NZ Champions Trophy Final, Dubai Weather Update: India and New Zealand are all set to battle it out for the Champions Trophy 2025 title on Sunday, March 9. Will the weather in Dubai be ideal for the summit clash?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-champions-trophy-2025-final-match-when-and-where-to-watch-online-2690694-2025-03-08",
      "headline": "IND vs NZ Champions Trophy final: When & where to watch, live-streamingIndia and New Zealand are set for a high-stakes Champions Trophy final in Dubai on March 9, with both teams looking to clinch the coveted ICC silverware in what promises to be a blockbuster Super Sunday showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ind-vs-nz-2000-champions-trophy-squad-where-are-they-now-2690495-2025-03-08",
      "headline": "India playing 11 from 2000 Champions Trophy final vs NZ: Where are they now?India were beaten by four wickets in the final of the ICC Knockout Trophy 2000 against New Zealand as they failed to win their second ICC Trophy. Here's a look at what the Indian playing XI from the final is upto now:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kl-rahul-number-six-batter-sitanshu-kotak-2690675-2025-03-08",
      "headline": "KL Rahul at number 6 is great for the team: India batting coach praises batterKL Rahul has embraced his new No. 6 role, providing India with stability and finishing power ahead of the Champions Trophy Final, as praised by batting coach Sitanshu Kotak for his adaptability and crucial contributions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-santners-record-against-india-ind-vs-nz-final-2690643-2025-03-08",
      "headline": "IND vs NZ: Can Mitchell Santner pull off a Pat Cummins to stun India in the final?India and New Zealand will be up against each other in the final of the ICC Champions Trophy 2025 on Sunday, March 9. The Kiwi captain, Mitchell Santner, has scripted several downfalls for team India in the past few years. Will he turn out to be the thorn in their flesh once again with both his spin and leadership?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-beware-of-mitchell-santer-kane-williamson-dinesh-karthik-2690663-2025-03-08",
      "headline": "Dinesh Karthik picks 2 key New Zealand stars that India need to beware ofDinesh Karthik believes India must be cautious of Kane Williamson and Mitchell Santner in the Champions Trophy Final, as their batting and spin prowess could challenge India's dominance despite favourable conditions in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-dubai-advantage-pitch-conditions-spinners-2690657-2025-03-08",
      "headline": "Forget India, it's New Zealand who might make use of the Dubai advantageChampions Trophy 2025: Mitchell Santner's New Zealand are the only other team, apart from India, to have played in Dubai, and that could work to their advantage in the grand finale on Sunday, 9th March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-practice-nets-vs-spin-mitchell-santner-ind-vs-nz-2690629-2025-03-08",
      "headline": "India batters polish their skills in nets ahead of spin battle vs New ZealandIndian batters were seen engaging in a rigorous practice session to counter New Zealand's spin threat in the upcoming ICC Champions Trophy 2025 final. The two teams are set to lock horns in the summit clash on Sunday, March 9 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-harleen-deol-meg-lanning-gujarat-giants-vs-delhi-capitals-2690622-2025-03-07",
      "headline": "Deol, Meghna help Gujarat seal Eliminator berth with 5-wicket win over DelhiGujarat Giants qualified for the Eliminator game of the Women's Premier League 2025 by beating Delhi Capitals by five wickets in Match 17 played at Ekana Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-final-sitanshu-kotak-batting-coach-press-2690615-2025-03-07",
      "headline": "Sitanshu Kotak: India have great batters, unfair to say my arrival changed thingsChampions Trophy Final: Batting coach Sitanshu Kotak addressed the press during India's training session on Friday. The former Saurashtra captain said he doesn't want credit for India's strong batting in the tournament. Kotak joined Gautam Gambhir's coaching staff after India's poor batting display in the 2024-25 Test series in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-new-zealand-hoping-for-an-off-day-for-indian-spinners-gary-stead-ind-vs-nz-2690611-2025-03-07",
      "headline": "New Zealand hoping for an 'off day' for Indian spinners in Champions Trophy finalNew Zealand head coach Gary Stead is hoping for a bad day from the Indian spin-quartet in the final of the ICC Champions Trophy 2025. India and New Zealand are all set to lock horns in the summit clash on Sunday, March 9 at the Dubai International Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-sitanshu-kotak-press-conference-dubai-advantage-critcisism-2690610-2025-03-07",
      "headline": "Batting coach echoes Gautam Gambhir's stance, rejects Dubai advantage criticismChampions Trophy 2025: Speaking to the press during India's training session in Dubai on Friday, batting coach Sitanshu Kotak hit out at critics, dismissing claims that India enjoy an advantage by playing all their games in Dubai. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}