{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-cuts-interest-rate-third-time-signals-pause-glbs-2834156-2025-12-11",
      "headline": "US Fed cuts rates for third time in a row: What it means for your moneyThe US Federal Reserve reduced its key interest rate for the third time in a row on Wednesday. It also signalled that it may leave rates unchanged in the coming months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reforms-and-young-talent-are-powering-indias-growth-say-experts-2834027-2025-12-10",
      "headline": "Reforms and young talent are powering India's growth, say expertsThe country's strong GDP growth and controlled inflation are \"great reasons to rejoice\", adding that robust macro factors are also helping stabilise labour markets and household well-being, said the expert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/air-india-admits-compliance-culture-needs-overhaul-after-flying-airbus-without-permit-2833927-2025-12-10",
      "headline": "Air India admits compliance culture needs overhaul after flying Airbus without permitAir India last week called the Airbus November incident \"regrettable\" and said that some people had been suspended, while India's civil aviation watchdog DGCA ordered the aircraft to be grounded and called for an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-fall-how-to-invest-sips-right-time-to-buy-dip-entry-for-long-term-investors-2833893-2025-12-10",
      "headline": "Markets trade in red: Is this the right entry point for long-term investors?India's stock market has been one of the weakest performers globally in 2025 so far. The Sensex has delivered just 1.9% returns, making it the worst performer among 17 major global indices, while the Nifty 50 has risen only 3.2%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-275-points-lower-nifty-below-25800-eternal-down-3-percent-2833828-2025-12-10",
      "headline": "Sensex closes 275 points lower, Nifty below 25,800; Eternal down 3%The S&P BSE Sensex lost 275.01 points to close at 84,391.27, while the NSE Nifty50 was down by 81.65 points to end at 25,758.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-trade-talks-progress-resolve-tariffs-boost-exports-2833810-2025-12-10",
      "headline": "US delegation in Delhi, trade pact talks making headway: Piyush GoyalCommerce Minister Piyush Goyal announced steady progress in India-US trade talks with the US team visiting New Delhi. The agreement aims to resolve tariff disputes and significantly expand bilateral trade by 2030."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-are-young-millennials-leaving-cities-and-better-pay-2833782-2025-12-10",
      "headline": "Why are young millennials leaving cities and better pay?If cities offer better pay and faster growth, why are so many young millennials moving out? What's making suburban living more appealing than the urban hustle? Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-ais-mismatches-to-capital-gains-confusion-biggest-tax-mistakes-of-2025-and-how-to-fix-them-2833728-2025-12-10",
      "headline": "From AIS mismatches to capital gains confusion: Biggest tax mistakes of 2025With more Indians juggling salary, digital earnings, investments and gig income, tax filings in 2025 saw a jump in errors. The biggest trouble areas were AIS mismatches and confusion around capital gains, leading to incorrect returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/amazon-bets-big-on-india-with-35-billion-investment-5-things-to-know-2833724-2025-12-10",
      "headline": "Amazon bets big on India with $35 billion investment: 5 things to knowBy 2030, Amazon plans to create an additional 3.8 million direct, indirect, induced and seasonal jobs in India. These roles are expected to come from the expansion of its core businesses and the rapid scaling of its fulfilment and last-mile delivery network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-trading-less-really-make-you-more-profitable-zerodhas-nithin-kamath-explains-2833698-2025-12-10",
      "headline": "Can trading less really make you more profitable? Zerodha's Nithin Kamath explainsNithin Kamath shares insights on trading frequency, platform incentives, and the approach taken to protect clients from excessive trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hinge-founder-justin-mcleod-steps-down-to-launch-new-ai-dating-platform-overtone-2833662-2025-12-10",
      "headline": "Hinge founder Justin McLeod steps down to launch new AI dating platform OvertoneHinge founder Justin McLeod is stepping down after nearly fifteen years to lead Overtone, a new AI-powered dating venture backed by Match Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aequs-listing-today-share-price-13-percent-premium-nse-bse-hold-or-sell-book-profit-expert-view-2833657-2025-12-10",
      "headline": "Aequs lists at 13% premium: Should you book profits or hold?Aequs share price: The stock listed at Rs 140 on both the NSE and the BSE, compared with its issue price of Rs 124."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/day-after-microsofts-175-billion-ai-plan-in-india-amazon-announces-to-invest-over-35-billion-by-2030-2833653-2025-12-10",
      "headline": "Amazon to invest $35 billion in India, support 3.8 million jobs by 2030With markets tightening globally, Amazon's $35 billion India bet underlines confidence in the country's digital demand, logistics scale and workforce depth as growth drivers through the next decade for investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-flight-crisis-hits-delhi-trade-loss-estimated-at-rs-1000-crore-trade-body-2833650-2025-12-10",
      "headline": "IndiGo flight crisis hits Delhi trade, loss estimated at Rs 1,000 crore: Trade bodyCTI Chairman Brijesh Goyal said that daily flight disruptions have severely impacted the movement of traders, tourists and business travellers, leading to a sharp fall in market activity across the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/meesho-share-price-bse-nse-listing-46-percent-premium-over-ipo-price-2833627-2025-12-10",
      "headline": "Meesho share price: Stock lists at 46% premium over IPO priceThe stock debuted at Rs 162.05 on the NSE and Rs 161.20 on the BSE, marking a gain of nearly 46% over its issue price of Rs 111."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/corona-remedies-ipo-subscription-nears-10-times-pharma-market-growth-boosts-investor-interest-2833609-2025-12-10",
      "headline": "Corona Remedies IPO Day 3: Check subscription status, latest GMP and moreInvestor interest in the Corona Remedies IPO has surged, with strong demand and key brokerages recommending a long-term approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-marginally-higher-as-investors-buy-recent-market-dip-2833600-2025-12-10",
      "headline": "Sensex, Nifty open marginally higher as investors buy recent market dipThe S&P BSE Sensex was up 127.93 points to 84,794.21, while the NSE Nifty50 added 60.15 points to 25,899.80 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-listing-share-price-subscribed-over-104-times-set-to-debut-strong-investor-interest-aerospace-manufacturing-2833585-2025-12-10",
      "headline": "Aequs IPO listing: What does GMP suggest about stock market debut?Applicants can check their allotment status via the KFin Technologies website or the Bombay Stock Exchange portal by providing the necessary application details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-listing-expected-share-price-market-debut-latest-gmp-profit-investor-allotment-2833565-2025-12-10",
      "headline": "Meesho IPO listing: Does GMP signal bumper debut on stock market?Meesho IPO was subscribed 81.76 times overall. Retail investors subscribed 19.89 times, qualified institutional buyers excluding anchor investors subscribed 123.34 times, while the non-institutional investor portion was booked 39.85 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/microsoft-ceo-satya-nadella-meets-pm-modi-commits-175-billion-to-indias-ai-first-future-2833370-2025-12-09",
      "headline": "Satya Nadella's big announcement for India: Rs 1.5 lakh crore for AI first futureMicrosoft CEO Satya Nadella announced that he is committing USD 17.5 billion, the company's largest-ever investment in Asia, to build infrastructure and skills needed for boosting Artificial Intelligence (AI) in India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mohanlal-reflects-on-seven-seasons-of-bigg-boss-malayalam-not-drama-but-magic-2834128-2025-12-10",
      "headline": "Not drama, but magic: Mohanlal reflects on seven seasons of Bigg Boss Malayalam Actor Mohanlal shared insights on his seven-season experience hosting 'Bigg Boss Malayalam' at an event. He highlighted the show's positive impact and confirmed its future with three more years signed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-praises-ranveer-singhs-dhurandhar-but-questions-its-politics-2834120-2025-12-10",
      "headline": "Hrithik Roshan praises Ranveer Singh's Dhurandhar, but questions its politics Actor Hrithik Roshan has applauded the film 'Dhurandhar' for its storytelling while expressing his disagreements with its political undertones. He joined the list of celebrities who have shared their views on the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-ajinkya-deo-says-ramayan-co-star-ranbir-kapoor-has-payaas-aura-2834095-2025-12-10",
      "headline": "Exclusive: Ajinkya Deo says Ramayana co-star Ranbir Kapoor has 'payaas' aura Actor Ajinkya Deo discussed his role as Vishwamitra in Nitesh Tiwari's 'Ramayana'. During an exclusive chat, he opened up about his interactions with Ranbir Kapoor and said he has a pure aura. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-reviews-ranveer-singh-dhurandhar-im-blown-away-2834074-2025-12-10",
      "headline": "Akshay Kumar reviews Ranveer Singh's Dhurandhar: I'm blown away Akshay Kumar has joined the growing chorus of public figures praising 'Dhurandhar'. On Wednesday, the actor shared how deeply the Ranveer Singh-starrer affected him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-explains-why-male-dominated-films-do-so-well-in-india-2834061-2025-12-10",
      "headline": "Nushrratt Bharuccha explains why male-dominated films do so well in India Bollywood actor Nushrratt Bharuccha shared her views on male-dominated films and the challenges faced by women actors. She also revealed details about her upcoming thriller film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-cant-stop-laughing-as-kapil-sharma-cracks-a-joke-on-set-2834022-2025-12-10",
      "headline": "Priyanka Chopra can't stop laughing as Kapil Sharma cracks a joke on set. Watch Priyanka Chopra joined Kapil Sharma on the set of 'The Great Indian Kapil Show Season 4'. The duo posed for the paparazzi and exchanged light-hearted banter, delighting fans and photographers alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-padayappa-film-re-release-25-years-75th-birthday-celebration-2833975-2025-12-10",
      "headline": "Padayappa at 25: Ten facts you didn't know about the Rajinikanth classic As the Rajinikanth blockbuster is set to re-release in theatres on December 12, marking 50 years of the superstar's journey in the film industry and 25 years of the film's release, here are 10 things you might not know about the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-trailer-rajinikanth-1999-hit-returns-ahead-of-his-75th-birthday-2833991-2025-12-10",
      "headline": "Padayappa trailer: Rajinikanth's 1999 hit returns ahead of his 75th birthday The trailer for Rajinikanth's iconic film 'Padayappa' has been released as the movie prepares for a theatrical re-release on December 12. The re-release coincides with the actor's 75th birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khans-bads-of-bollywood-is-imdbs-most-popular-indian-ott-show-of-2025-2833969-2025-12-10",
      "headline": "Aryan Khan's Ba***ds of Bollywood tops IMDb as most popular Indian OTT show of 2025 Aryan Khan's directorial debut, The Ba***ds of Bollywood, becomes the most popular Indian web series of 2025 on IMDb, receiving global attention for its bold storytelling and insider look at Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-farah-khans-cook-dilip-remarry-in-new-zealand-heres-what-happened-2833953-2025-12-10",
      "headline": "Did Farah Khan's cook Dilip remarry in New Zealand? Here's what happened Farah Khan and her cook Dilip headed to New Zealand in the recent vlog shared on her YouTube channel. The team holiday turned into a memorable and playful event as Dilip met Kim. Know all about Kim and her 'alleged' wedding with Dilip here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-padayappa-re-release-celebrates-50-years-iconic-tamil-cinema-2833816-2025-12-10",
      "headline": "Why Rajinikanth's Padayappa remains a monumental film in his 50-year career Rajinikanth's Padayappa is re-released to mark his 75th birthday and 50 years in cinema. The film's timeless appeal highlights the actor's enduring star power and cinematic legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-film-praised-by-shah-rukh-khan-india-official-entry-2026-academy-awards-2833947-2025-12-10",
      "headline": "Shah Rukh Khan praises Neeraj Ghaywan's Homebound, calls it honest and soulful Shah Rukh Khan has praised Homebound for its sensitive and engaging storytelling. The film, directed by Neeraj Ghaywan, features notable performances and has received international recognition, including being India's official entry for the Oscars 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saumya-tandon-addresses-dhurandhar-criticism-denies-misogynistic-content-2833886-2025-12-10",
      "headline": "Saumya Tandon addresses Dhurandhar criticism, denies misogynistic content Saumya Tandon has defended the film 'Dhurandhar' after it was criticised online for alleged misogyny. She argued that the women characters are depicted with dignity and not subjected to violence or objectification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bekhayali-song-dispute-sachet-parampara-publicly-address-amaal-mallik-on-instagram-2833791-2025-12-10",
      "headline": "Shame on you: Sachet-Parampara slam Amaal Malik over Bekhayali song claim Music composers, Sachet-Parampara have posted a video on Instagram to directly address composer Amaal Mallik, accusing him of repeatedly claiming the origin of the song Bekhayali from the film Kabir Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/agastya-nanda-on-being-offered-role-of-lt-arun-khetarpal-in-ikkis-at-21-2833834-2025-12-10",
      "headline": "Agastya Nanda on being offered role of Lt Arun Khetarpal in Ikkis at 21 Newcomer Agastya Nanda shared insights into being offered the role of Second Lieutenant Arun Khetarpal in 'Ikkis' at age 21. He also described how embodying the life of a soldier influenced his perspective and approach towards life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-re-release-ramya-krishnan-backlash-praise-neelambari-role-2833838-2025-12-10",
      "headline": "Padayappa re-release: Tracing Ramya Krishnan's journey from backlash to praise Actor Ramya Krishnan, in an interview, recalled her experience of receiving strong backlash from fans for her portrayal of Neelambari in the film Padayappa, before the role later gained widespread appreciation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-being-real-life-king-of-romance-at-60-hate-drains-you-love-heals-2833836-2025-12-10",
      "headline": "Aamir Khan on being real-life king of romance at 60: Hate drains you, love heals During his appearance on Agenda Aaj Tak 2025, Aamir Khan reflected on love, companionship and the relationships that shaped his life, from Reena and Kiran to his present commitment to Gauri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/merv-movie-review-charlie-cox-zooey-deschanel-and-dog-light-up-this-christmas-romcom-2833735-2025-12-10",
      "headline": "Merv review: Charlie Cox, Zooey Deschanel and dog light up this holiday rom-comRelease Date:Wed Dec 10, 2025 Merv is a sweet, safe Christmas rom-com about an ex-couple trying to cheer up their depressed dog, only to rediscover their feelings along the way. It's predictable but full of warmth and adorable dog moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-reflects-early-struggles-would-come-home-and-cry-many-times-2833826-2025-12-10",
      "headline": "Aamir Khan recalls the 'no' that rebuilt his confidence in career's lowest phase On Day 1 of Agenda AajTak, Aamir Khan looked back at his lowest phase after the success of his hit film Qayamat Se Qayamat Tak. The superstar confessed to being unhappy with his work and many a time crying in front of his ex-wife Reena Datta. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-club-fire-case-accused-luthra-brothers-passports-revoked-paves-way-for-possible-extradition-by-interpol-2834157-2025-12-11",
      "headline": "Goa fire case: Nightclub owners' passports revoked days after blaze killed 25Authorities are tightening the net around Gaurav and Saurabh Luthra as Interpol alerts, fresh court action and new details of their late-night escape deepen the probe into the Goa nightclub fire tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/want-us-tourist-visa-you-might-need-to-disclose-5-year-social-media-history-vetting-h1b-f1-esta-fifa-world-cup-olympics-2833929-2025-12-10",
      "headline": "Want US tourist visa? You might need to disclose 5-year social media historyThe Trump administration plans to make it mandatory for foreign tourists from around 40 countries to provide five years of their social media history as part of enhanced visa screening. Will this affect India? Here's what you need to know about the proposed rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-dares-amit-shah-challenge-debate-parliament-vote-chori-sir-2833951-2025-12-10",
      "headline": "I will decide what to say: Amit Shah fires back at Rahul Gandhi's debate dareTensions flared in the Lok Sabha after Rahul Gandhi interrupted Union Home Minister Amit Shah's speech on SIR to challenge him to a debate on alleged vote theft. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/british-indian-nurse-jailed-rape-sexual-offences-glbs-2834149-2025-12-11",
      "headline": "Kerala-born nurse jailed for rape, sexual assaults at Scotland care homeNaijil Paul had been due to face trial in December 2019 but fled to Kochi shortly before proceedings, claiming a family emergency. He was arrested in February and extradited from Delhi to Scotland in June before entering guilty pleas in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/aditya-dhar-dhurandhar-ranveer-singh-karachi-lyari-history-baloch-muhajir-gang-wars-ppp-history-explained-2833695-2025-12-10",
      "headline": "Untold story of Dhurandhar's Lyari: How Mother of Karachi nursed ferocious gangsAditya Dhar's spy thriller Dhurandhar is set in Pakistan's Lyari of the 2000s. This is how Lyari, a small dock-worker settlement and called the Mother of Karachi, became a stage for brutal gang wars, and is now slowly redeeming itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/agenda-aajtak-kalli-purie-russia-president-putin-interview-operation-sindoor-2833894-2025-12-10",
      "headline": "Asked questions not being done by West: Kalli Purie speaks on Putin interviewInaugurating the Agenda AajTak summit, Kalli Purie, vice chairperson of the India Today group, said the interview with Putin broke the perception that Indian media cannot participate in global issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-attacks-ilhan-omar-immigration-somali-glbs-2834155-2025-12-11",
      "headline": "Imagine if Trump married his sister: US President ramps up attacks on Ilhan OmarDonald Trump launched a fierce attack on Ilhan Omar during a Pennsylvania rally, reviving past inflammatory comments. He called Somalia \"the worst country in the world\" and claimed that Somalis \"kill each other all the time\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-chief-apologises-for-chaos-denies-deliberate-crisis-as-flights-normalise-2834122-2025-12-10",
      "headline": "IndiGo chief apologises for chaos, denies deliberate crisis as flights normaliseIndiGo Chairman Vikram Singh Mehta has publicly apologised for the recent flight disruptions, assuring passengers that operations have normalised and denying any intentional wrongdoing by the airline. The airline is committed to regaining trust and cooperating fully with regulatory investigations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-pollution-why-the-air-feels-worse-than-what-aqi-monitors-show-2834024-2025-12-10",
      "headline": "Delhi pollution: Why the air feels worse than what AQI monitors showContrary to guidelines, several AQI stations in Delhi are located near dense greenery, possibly undermining the AQI data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/6-months-without-pay-cops-in-paks-khyber-pakhtunkhwa-reel-under-salary-crisis-2834100-2025-12-10",
      "headline": "6 months without pay: Cops in Pak's Khyber Pakhtunkhwa reel under salary crisisThe Khyber Pakhtunkhwa Tourism Police are facing a severe salary crisis, with officers unpaid for six months, sparking public outrage across Pakistan. The situation highlights administrative delays impacting the force responsible for tourist safety in key regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/powerful-earthquake-strikes-japans-hokkaido-region-day-after-76-magnitude-quake-triggered-tsunami-warning-2834059-2025-12-10",
      "headline": "6.5 quake hits Japan's Hokkaido day after 7.5 tremors triggered tsunami warningJapan's northern region faced another strong earthquake just days after a major tremor shook northeastern Japan, highlighting ongoing seismic risks. The recent quakes have caused injuries, disruptions, and heightened alertness across the region.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-winks-journalist-imran-khan-controversy-2833546-2025-12-10",
      "headline": "Pak army spokesperson winks at woman journalist, video sparks outragePakistan's Lt Gen Ahmed Sharif Chaudhry is facing backlash after winking at a woman journalist during a press briefing. His gesture has drawn criticism online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dhurandhar-rehman-dakait-akshaye-khanna-was-not-big-don-chaudhry-aslams-wife-2833776-2025-12-10",
      "headline": "Rehman Dakait no big don: Dhurandhar cop Aslam's wife tells unheard storiesRehman Dakait, who committed his violent crime at the age of 13, lived only for 34 years but in those years, he committed Karachi's most gruesome murders. At 13, he stabbed someone and at the age of 19, he murdered his own mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ayushmann-khurrana-says-he-sleeps-only-6-hours-a-day-doctors-call-it-slow-poison-2833907-2025-12-10",
      "headline": "Ayushmann Khurrana says he sleeps only 6 hours a day, doctors call it slow poisonAyushmann Khurrana's six-hour sleep confession has sparked a wider conversation on chronic sleep loss. Top doctors explain why cutting your sleep short can silently harm your brain, heart and immunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/tp53-gene-mutation-donor-sperm-cancer-risk-children-europe-2833989-2025-12-10",
      "headline": "Sperm donor with cancer gene used for nearly 200 children across EuropeNearly 200 children across Europe were conceived using sperm carrying a dangerous cancer-linked gene mutation. Children conceived using these affected sperm cells have the mutation in every cell of their body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/we-tried-latiao-the-viral-chinese-snack-everyones-obsessed-with-online-2833767-2025-12-10",
      "headline": "We tried Latiao, the viral Chinese snack everyone's obsessed with onlineIf you've seen an elderly man casually snacking on old-school Chinese treats online, you're not alone. We saw it, tried it, and here's our verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/isha-singh-ips-officer-puducherry-tvk-rally-vijay-bussi-anand-2833923-2025-12-10",
      "headline": "Lady Singham vs TVK's Bussy: Why is IPS Isha Singh making waves in Tamil NaduThe confrontation with TVK general secretary Bussy Anand in Puducherry made her viral, but there's far more to Isha Singh's story. A lawyer-turned IPS officer shaped by principled parents, now carrying that legacy into uniform."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-ed-fir-kn-nehru-son-arun-nehru-meets-finance-minister-delhi-2833642-2025-12-10",
      "headline": "After ED heat on DMK Minister in corruption case, son meets Nirmala SitharamanDays after the ED sought an FIR against DMK Minister KN Nehru, his son and DMK MP Arun Nehru met Finance Minister Nirmala Sitharaman in Delhi, submitting memorandums on credit rating reforms and PACL scam relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vote-chori-happened-under-nehru-indira-gandhi-sonia-became-voter-before-becoming-indian-amit-shah-hits-back-2833957-2025-12-10",
      "headline": "Nehru, Indira did vote chori: Amit Shah goes all guns blazing on GandhisUnion Home Minister Amit Shah launched a strong critique of Congress over historical and present electoral irregularities, highlighting alleged vote chori dating back to Nehru's era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/new-kia-seltos-variants-explained-detailed-breakdown-of-all-trims-2833845-2025-12-10",
      "headline": "New Kia Seltos variants explained: Detailed breakdown of all trimsKia has refreshed the Seltos with a wider, feature-rich variant lineup, multiple powertrain options and premium upgrades across the range, offering buyers and a tech-forward midsize SUV experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/luthra-brothers-booked-thailand-tickets-as-firemen-were-battling-goa-club-blaze-2834058-2025-12-10",
      "headline": "Luthra brothers booked Thailand tickets as firemen were battling Goa club blazeGoa Police revealed that the Luthra brothers booked flights to Thailand while rescue teams battled the deadly fire at their Anjuna nightclub. Their sudden departure amid the tragedy has sparked intense investigation and legal battles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dhurandhar-cop-chaudhry-aslam-told-wife-before-death-movies-will-be-made-on-me-2834034-2025-12-10",
      "headline": "Movies will be made on me: Dhurandhar cop Chaudhry Aslam told wife before death\"Someday they'll make movies on me,\" SSP Chaudhary Aslam had predicted and Dhurandhar proves he wasn't wrong. Sanjay Dutt steps into the boots of the Karachi encounter specialist whose life was as explosive as the men he hunted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/indian-origin-man-arrested-in-canada-brampton-for-exposing-himself-to-female-doctors-mississauga-clinics-crime-vaibhav-2834021-2025-12-10",
      "headline": "Indian-origin man on flashing spree arrested in Canada, targeted women doctorsA 25-year-old Indian-origin man in Canada has been arrested for allegedly exposing himself to female medical staff. The man, Vaibhav, reportedly used a fake name and medical conditions to carry out the obscene acts. Charged with indecent acts, identity fraud, and identity theft, police believe there may be more unreported incidents."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/national-boxing-championship-moved-greater-noida-pollution-2834153-2025-12-11",
      "headline": "Too much pollution: National boxing championships in Greater Noida rescheduled The elite national boxing championships have been rescheduled to January due to pollution in Greater Noida. This comes after persistent issues in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/germany-wins-8th-fih-mens-hockey-junior-world-cup-beating-spain-shootout-2834146-2025-12-10",
      "headline": "Germany win 8th Jr.men's Hockey World Cup title in shootout thriller with Spain Germany overcame Spain 3-2 in a shootout following a 1-1 draw in regulation time, claiming their eighth FIH Men's Hockey Junior World Cup. Goalkeeper Jasper Ditzer played a decisive role, denying Spain their first world title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-new-structure-club-consortium-aiff-indian-super-league-football-2834148-2025-12-10",
      "headline": "New ISL roadmap? AIFF to discuss club-led consortium at its AGM on Dec 20 The All India Football Federation (AIFF) has indicated it is open to ISL clubs forming a consortium to run the league this season, with no timely resolution yet from the federation or the Sports Ministry on the ongoing football impasse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-kolkata-visit-70-foot-statue-december-13-2834091-2025-12-10",
      "headline": "Messi magic to grip Kolkata: Superstar to unveil 70-foot statue of himself Lionel Messi magic is all set to grip Kolkata as the city gets ready to welcome the Argentina superstar on December 13. Messi is set to receive a grand welcome in the city with celebrity-studded events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pr-sreejesh-reaction-india-junior-hockey-team-stun-argentina-win-bronze-fih-world-cup-2834086-2025-12-10",
      "headline": "Great achievement after being down 0-2: Sreejesh proud of India's podium finish PR Sreejesh could barely hide his pride as he reflected on India's junior men's stirring 4-2 comeback win over Argentina that secured the bronze medal at the FIH Junior Men's World Cup on Wednesday, giving the country its first podium finish in nine years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-annual-contract-2025-2026-shubman-gill-rohit-virat-2834081-2025-12-10",
      "headline": "Gill likely to get A+ BCCI contract, will Rohit, Virat be snubbed? India Test captain Shubman Gill is likely to be named in the A+ category in the upcoming BCCI annual contract list. There are also questions about whether Virat Kohli and Rohit Sharma will be retained in the central contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-family-struggle-sacrifice-journey-indian-cricket-2834063-2025-12-10",
      "headline": "From struggle to stardom: Yashasvi on how his family carried him to Indian team Yashasvi Jaiswal revealed how his family carried him during tough times to help complete the dream of playing for India. Jaiswal has represented India in all three formats of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-agenda-aajtak-rohit-sharma-dhurandhar-2834060-2025-12-10",
      "headline": "Rohit Sharma is Dhurandhar, Chahal is Baahubali: Yashasvi Jaiswal IND vs SA: Opener Yashasvi Jaiswal compared Rohit Sharma to the movie Dhurandhar in the Agenda AajTak summit. Jaiswal spoke about the care that Rohit has for the junior India stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhanas-first-reaction-after-calling-off-wedding-love-for-cricket-2834056-2025-12-10",
      "headline": "I don't think I love anything more than cricket: Smriti Mandhana Making her first public appearance after cancelling her wedding, Smriti Mandhana says one truth has become clearer to her than anything else over the past 12 years: there is nothing she cares about more deeply than cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-shoulders-too-much-responsibility-alyssa-healy-decodes-england-ashes-woes-2834036-2025-12-10",
      "headline": "Ben Stokes shoulders too much responsibility: Healy decodes England's Ashes woes Australian cricketer Alyssa Healy, decoding England's poor performance in the ongoing Ashes, believes captain Ben Stokes is overburdening himself during the 2025–26 series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-2026-auction-cameron-green-big-signings-overseas-all-rounder-focus-2834019-2025-12-10",
      "headline": "Cameron Green to CSK? Chennai Super Kings mascot drops big hint before IPL auction CSK teased their IPL 2026 auction strategy through a mascot video, hinting at key overseas signings as they aim to rebuild after a poor season where they finished at the bottom of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/jr-mens-hockey-world-cup-india-vs-argentina-report-pr-sreejesh-chennai-2834018-2025-12-10",
      "headline": "Paris Olympics-inspired fightback! India rally to beat Argentina, claim 3rdJr.men's Hockey World Cup: India secured a thrilling comeback from two goals down to beat Argentina 4-2 in the third-place playoff in Chennai on Wednesday, December 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arne-slot-happy-liverpool-fans-chant-his-name-mohamed-salah-feud-2834012-2025-12-10",
      "headline": "Arne Slot grateful as Liverpool fans chant his name amid Salah feud: Means a lotLiverpool's under-fire manager Arne Slot was grateful as fans chanted his name following his side's gritty 1–0 victory over Inter Milan at the San Siro, a result that delivered one of the biggest European statements of his troubled second tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tejaswi-jasiwal-yashasvi-ind-vs-sa-syed-mushtaq-ali-trophy-2834005-2025-12-10",
      "headline": "Tejaswi Jaiswal sacrificed cricket dreams. Now brother Yashasvi fuels his returnYashasvi Jaiswal's elder brother Tejaswi made his Syed Mushtaq Ali debut for Tripura. Tejaswi had earlier sacrificed his dream due to financial constraints and supported his brother by working as a salesman in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alex-carey-supports-england-noosa-break-ahead-of-adelaide-ashes-test-2833988-2025-12-10",
      "headline": "England's mid-Ashes beach holiday slammed by media, but finds supporter in CareyEngland's mid-Ashes beach holiday may have been slammed by the Australian media, but has found an unlikely supporter in Alex Carey. England are yet to play a practice match in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-harmanpreet-kaur-breakup-returns-india-video-2833977-2025-12-10",
      "headline": "Watch: Mandhana makes first public appearance since calling off wedding, hugs HarmanpreetSmriti Mandhana made her first public appearance on Wednesday after calling off her wedding with Palash Muchhal. Mandhana has also been named in India's squad for the T20I series against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-benched-jitesh-sharma-india-t20-world-cup-deep-dasgupta-2833950-2025-12-10",
      "headline": "Why India should leave Samson on bench for Jitesh? Deep Dasgupta explainsDeep Dasgupta has explained why India have decided to bench Sanju Samson from the lineup for Jitesh Sharma ahead of the T20 World Cup 2026. Samson has missed the last three T20Is for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-virat-kohli-womens-world-cup-semi-final-meme-2833939-2025-12-10",
      "headline": "Watch: Jemimah bursts into laughter after comparisons with viral Virat Kohli memeJemimah Rodrigues scored an unbeaten 115 to help India chase the highest total in Women's ODI history. Her celebration sparked memes comparing her to Virat Kohli, highlighting her rising star status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-kkr-venkatesh-iyer-auction-abhishek-nayar-relives-memories-2833878-2025-12-10",
      "headline": "Are KKR preparing to bring Venkatesh Iyer back home in IPL 2026 auction?IPL 2026: Venkatesh Iyer's release and Abhishek Nayar's praise have created an unexpected subplot ahead of the IPL 2026 mini-auction. The all-rounder now enters the bidding with renewed attention and a compelling narrative behind him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-cricket-security-review-lahore-pakistan-t20i-series-january-2833851-2025-12-10",
      "headline": "After Islamabad bombing, Australia send delegation to Lahore before Pakistan tourAustralia has sent a security delegation to Lahore to review arrangements for their January T20I tour of Pakistan following the recent Islamabad bombing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-england-noosa-break-australia-media-backlash-adelaide-test-prep-2833830-2025-12-10",
      "headline": "Ashes: Ben Stokes's beach pics go viral, Aussie media mock over-preparing PomsThe England team's trip to Noosa was slammed by the Australian media as the visitors struggle in the ongoing Ashes series. England are trailing in the Ashes 0-2 after their embarrassing loss in Brisbane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haider-ali-pakistan-cleared-uk-police-pcb-lifts-suspension-bpl-2025-2833824-2025-12-10",
      "headline": "PCB lifts Pakistan batter Haider Ali's suspension after rape allegation clearancePCB has lifted Haider Ali's suspension after UK authorities dropped the rape allegation, clearing him to resume his career in the upcoming BPL where he will play for Noakhali Express."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-icc-test-rankings-ashes-wickets-jasprit-bumrah-2833803-2025-12-10",
      "headline": "Mitchell Starc threatens Jasprit Bumrah's No.1 Test ranking after Ashes heroicsMitchell Starc has surged to a career-best No. 3 in the ICC Test bowling rankings with 18 wickets in the Ashes, edging closer to Jasprit Bumrah's top spot. Starc also broke Wasim Akram's record of most Test wickets by a left-arm pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-london-spirit-mentor-batting-coach-the-hundred-rcb-mo-bobat-2833781-2025-12-10",
      "headline": "After RCB stint, Dinesh Karthik begins new coaching chapter in EnglandThe Hundred: Dinesh Karthik's coaching journey has officially gone global with his move to London Spirit. After guiding RCB to an IPL title, the former India wicketkeeper now takes his tactical touch to The Hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-virat-kohli-rises-rohit-sharma-number-one-2833768-2025-12-10",
      "headline": "ICC ODI rankings: Virat Kohli rises to No. 2, closes in on Rohit Sharma's top spotIND vs SA: Virat Kohli jumped two places up to No.2 in the latest ODI rankings for batters after scoring 302 runs in the three-match series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-india-vs-south-africa-cuttack-bhuvneshwar-kumar-2833744-2025-12-10",
      "headline": "Bhuvneshwar Kumar 2.0? Arshdeep impresses pundits, firms up T20 World Cup spotIND vs SA, 1st T20I: Aakash Chopra and Irfan Pathan heaped praise on Arshdeep Singh after the Indian speedster picked up two wickets in India's 101-run win over South Africa on Tuesday in Cuttack. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-liverpool-outburst-cristiano-ronaldo-interview-premier-league-cool-or-not-2833164-2025-12-10",
      "headline": "First Ronaldo, now Salah: Is it cool or not when club legends speak out?Mohamed Salah's public outburst has pushed Liverpool into a moment of uncomfortable truth. As comparisons to Cristiano Ronaldo intensify, the debate deepens around what happens when club legends turn their voices against their own teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-west-indies-205-tickner-injured-second-test-basin-reserve-2833710-2025-12-10",
      "headline": "West Indies disappoint with the bat days after heroic display in series openerNZ vs WI, 2nd Test Day 1 Score: New Zealand shot West Indies out for 205 despite their fast bowler Blair Tickner suffering a freak injury. The disappointing batting display came days after the tourists 457 for 6 in the final innings to draw the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-comeback-mahieka-sharma-girlfriend-support-india-vs-south-africa-t20-2833680-2025-12-10",
      "headline": "Runs, rhythm and romance: Hardik Pandya grateful for Mahieka's supportIndia vs South Africa: Hardik Pandya credited the support of his girlfriend, Mahieka Sharma, for his seamless return to international cricket, saying his partner played a big role during his time away from the game. Hardik marked his comeback in style, smashing a match-winning 59 off 28 deliveries in the first T20I in Cuttack on Tuesday, December 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-t20-jitesh-sharma-press-conference-batting-order-opportunity-2833672-2025-12-10",
      "headline": "Batting in middle order or lower, will make India call-up count: Jitesh SharmaIND vs SA: India wicketkeeper-batter Jitesh Sharma explained how he would bat at any position, as long as that helps his team win the match. Jitesh emphasised making every opportunity count when he is wearing the India jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-2-kush-maini-art-2026-season-indian-racer-f1-breakthrough-2833669-2025-12-10",
      "headline": "India's Kush Maini signs with ART for 2026 as he pushes for F1 breakthroughKush Maini's move to ART Grand Prix signals his most decisive push yet toward Formula 1. With a stronger platform beneath him, 2026 could become a make-or-break season in his rising career."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}