{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rent-vs-buy-why-young-indians-are-rethinking-homeownership-is-it-better-to-rent-or-buy-in-india-real-estate-trends-india-2730761-2025-05-26",
      "headline": "Rent vs buy? Why young Indians are rethinking homeownershipNot long ago, a house was more than just a home—it was a badge of honour in Indian families. Parents encouraged early buying, regardless of the financial strain. Today, however, younger Indians are rethinking this dream, looking for new paths to stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-455-points-higher-nifty-settles-above-25000-eternal-tanks-5-2730715-2025-05-26",
      "headline": "Sensex ends 455 points higher, Nifty settles above 25,000; Eternal tanks 5%At the closing bell, the BSE Sensex was up 455.37 points to 82,176.45, while the NSE Nifty50 settled 148 points higher at 25,001.15. The broader markets also performed well during the session, extending the rally in mid-cap and small-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-lta-exempt-under-the-new-tax-regime-what-you-should-know-2730656-2025-05-26",
      "headline": "Is LTA exempt under the New Tax Regime? What you should knowLeave Travel Allowance (LTA) is a common perk in many salary packages, yet with two tax regimes in place, people often ask if the exemption holds true in the new tax regime. Let's find out in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-zomato-share-price-falling-today-global-index-msci-ftse-cut-weights-explained-2730494-2025-05-26",
      "headline": "Eternal shares tumble over 3% in early trade. Why is the stock falling?The Zomato stock was trading 3.17% lower on the NSE at 9:38 am, making it the only significant laggard among Nifty50 constituents during morning trade. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-deepika-padukone-diana-pentys-cocktail-set-for-re-release-in-may-2730935-2025-05-26",
      "headline": "Saif Ali Khan, Deepika Padukone, Diana Penty's Cocktail set for re-release in May'Cocktail,' featuring Saif Ali Khan, Diana Penty and Deepika Padukone in lead roles, is all set to return to the big screens. The film is directed by Homi Adajania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-anistons-sunday-photo-dump-features-hindu-goddesses-lakshmi-and-durga-2730923-2025-05-26",
      "headline": "Jennifer Aniston's 'sunday photo dump' features Hindu Goddesses Lakshmi and Durga'FRIENDS' star Jennifer Aniston uploaded multiple pictures on Sunday, one of which has grabbed the attention of her fans in India. The particular picture features idols of Hindu Goddesses Lakshmi and Durga, next to an idol of Laughing Buddha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/actor-abhishek-banerjees-award-winning-crime-drama-stolen-to-release-in-june-2025-2730906-2025-05-26",
      "headline": "Abhishek Banerjee's award-winning crime-drama Stolen to release in June 2025Actor Abhishek Banerjee's film 'Stolen' is all set to release on Prime Video, two years after its debut at the Venice Film Festival. Anurag Kashyap, Kiran Rao, Nikkhil Advani and Vikramaditya Motwane have executive produced the crime-thriller."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naveen-polishettys-anaganaga-oka-raju-set-for-sankranthi-2026-release-2730908-2025-05-26",
      "headline": "Naveen Polishetty's Anaganaga Oka Raju set for Sankranthi 2026 release After multiple delays, the makers of 'Anaganaga Oka Raju' finally confirmed its release for Sankranthi 2026. The family entertainer stars Naveen Polishetty and Meenakshi Chaudhary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-release-date-siddhant-chaturvedi-triptii-dimri-love-story-in-august-2730907-2025-05-26",
      "headline": "Dhadak 2 release date out: Siddhant-Triptii's film to hit cinemas in AugustAfter facing many delays, 'Dhadak 2', starring Siddhant Chaturvedi and Triptii Dimri, is set to hit theatres. The film will be released in August this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-manchu-manoj-are-bromance-goal-bhairavam-2730801-2025-05-26",
      "headline": "Actor Simbu on Manchu Manoj: He's like a small kid, show him love, not angerAt the pre-release event of Bhairavam, Manchu Manoj called his friend, actor Simbu, during a live segment, leading to a candid and cheerful exchange. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-aravind-extends-support-to-pawan-kalyan-distances-from-exhibitors-strike-2730796-2025-05-26",
      "headline": "Allu Aravind extends support to Pawan Kalyan, distances from exhibitors strikePushpa star Allu Arjun's father and producer Allu Aravind addressed speculations regarding his involvement in the ongoing exhibitor's strike in Telangana and Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-raveena-tandon-recalls-reason-behind-fight-with-karisma-kapoor-shared-non-veg-jokes-2730838-2025-05-26",
      "headline": "Raveena Tandon on alleged feud with Karisma Kapoor: It was classroom politicsActor Raveena Tandon recently recalled her catfight with Karisma Kapoor in the 90s on film sets. In a conversation with Farah Khan on her Vlog, Raveena called it, 'classroom politics.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/singer-demi-lovato-marries-jordan-jutes-in-la-wears-vivienne-westwood-corset-gown-2730770-2025-05-26",
      "headline": "Singer Demi Lovato marries Jordan Jutes in LA, wears Vivienne Westwood corset gownSinger and actor Demi Lovato on Sunday got married to her fiancé, Jordan Jutes Lutes, in California. The bride wore a custom Vivienne Westwood corset dress for the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-chhavi-mittal-on-tahira-kashyaps-advice-during-cancer-diagnosis-gave-me-confidence-2730714-2025-05-26",
      "headline": "Actor Chhavi Mittal says Tahira Kashyap gave her 'confidence' during cancer battleActor Chhavi Mittal said that Tahira Kashyap was the first person she had a long conversation with during her breast cancer diagnosis. Chhavi shared how Tahira's advice gave her clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/sunny-leone-wraps-shoot-for-her-first-hollywood-film-leaked-photos-2730731-2025-05-26",
      "headline": "Sunny Leone wraps shoot for her first independent Hollywood film. See picsSunny Leone is set to make her debut in an independent Hollywood film, playing a United Nations peacekeeping soldier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-switches-to-hulk-mode-at-75-with-heavy-workout-son-hrithik-roshan-goes-uff-watch-viral-video-2730739-2025-05-26",
      "headline": "Rakesh Roshan switches to Hulk mode at 75 with heavy workout, Hrithik commentsFilmmaker Rakesh Roshan shared an inspiring video on social media. The 'Krrish' director could be seen working out dedicatedly in a gym, trying to make the 'best' of every day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-releases-happy-burstday-album-on-10th-anniversary-with-solo-tracks-2730713-2025-05-26",
      "headline": "SEVENTEEN releases Happy Burstday album on 10th anniversary with solo tracksSEVENTEEN commemorated their 10th anniversary by releasing their fifth studio album, 'Happy Burstday'. The album highlights individual member projects and features global artists Pharrell Williams and Timbaland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-glimpse-out-adivi-sesh-mrunal-thakurs-film-for-christmas-release-2730689-2025-05-26",
      "headline": "Dacoit glimpse out: Adivi Sesh-Mrunal Thakur's film for Christmas releaseThe makers of Adivi Sesh's much-awaited bilingual 'Dacoit' have unveiled a fiery glimpse video. The film is releasing on December 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-expresses-admiration-for-fahadh-faasil-at-cannes-aavesham-is-my-favourite-2730682-2025-05-26",
      "headline": "Alia Bhatt expresses admiration for Fahadh Faasil: Aavesham is my favouriteAlia Bhatt, who made her debut at Cannes, recently expressed her admiration for Malayalam actor Fahadh Faasil and said that she would definitely be interested in working with him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ishaan-khatter-on-feeling-safe-shooting-intimate-scenes-with-naughty-tabu-2730675-2025-05-26",
      "headline": "Ishaan Khatter on 'feeling safe' shooting intimate scenes with 'naughty' TabuActor Ishaan Khatter recently recalled her 'A Suitable Boy' days with co-star Tabu. The actor appreciated Tabu for being supportive while filming intense scenes. He will next be seen in Neeraj Ghaywan's 'Homebound.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-ott-release-when-and-where-to-watch-suriyas-gangster-drama-2730606-2025-05-26",
      "headline": "Retro OTT release: When and where to watch Suriya's gangster dramaSuriya and director Karthik Subbaraj's 'Retro' had a decent run at the box office. The film is all set to stream on an OTT platform later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-hina-khan-rocky-jaiswal-colors-tv-pati-patni-aur-panga-2730632-2025-05-26",
      "headline": "Gurmeet-Debina, Hina-Rocky star in new show Pati, Patni Aur PangaColors TV is set to launch a new reality show, 'Pati, Patni Aur Panga', featuring popular celebrity couples. The show promises exciting challenges and a fresh take on couples competing together."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/crpf-jawan-arrested-for-spying-for-pak-moti-ram-jat-pahalgam-posting-terror-attack-2730963-2025-05-26",
      "headline": "CRPF jawan arrested for 'spying' for Pak was transferred out of Pahalgam 6 days before terror attack: SourcesCRPF jawan arrested for 'spying' for Pak was transferred out of Pahalgam 6 days before terror attack: Sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gujarat-visit-pakistan-terrorism-tourism-operation-sindoor-india-pak-conflict-2730846-2025-05-26",
      "headline": "Roti khao, varna meri goli toh hai hi: PM Modi warns Pak on terrorPM Modi, while speaking at a public rally in Gujarat, said that Operation Sindoor was a direct response to the Pahalgam attack and made it clear that India will not hesitate to strike terror bases if provoked.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-jaishankar-us-mediation-claim-trump-operation-sindooor-2730785-2025-05-26",
      "headline": "US warned about big Pak attack, we said we'll hit harder: Jaishankar to MPs panelChairing a meeting of MPs, External Affairs Minister (EAM) S Jaishankar clarified that the ceasefire was initiated by Pakistan through military channels, dismissing US claims of brokering the de-escalation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/illegal-bangladeshi-from-india-push-ins-unacceptable-ready-to-step-in-if-needed-bangladesh-army-2730909-2025-05-26",
      "headline": "Push-ins from India unacceptable, ready to step in if needed: Bangladesh ArmyA top officer of the Bangladesh Army termed India's handing over of Bangladeshi illegal immigrants a \"push in\" and said it was \"unacceptable\". Brigadier General Md Nazim-ud-Daula said the army was ready to step in if needed and instructed by the government. India has been handing over Bangladeshi illegal immigrants to Border Guard Bangladesh personnel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-cannes-gucci-gown-saree-lehenga-debate-2730777-2025-05-26",
      "headline": "No Gucci, that Alia Bhatt outfit was not a gownIn a noteworthy fashion moment, Alia Bhatt attended the Cannes Film Festival closing ceremony in a custom-made Gucci outfit. But was it really a gown, as the brand labelled it in an Instagram post? Not quite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/they-are-in-cahoots-tej-prataps-estranged-wife-aishwarya-rejects-lalu-yadavs-action-against-him-as-poll-season-drama-2730774-2025-05-26",
      "headline": "As Lalu Yadav expels son over sanskar, daughter-in-law shreds it as poll dramaAishwarya Roy rejected the action against Tej Pratap as a mere eyewash to mislead people ahead of Bihar Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-asks-couple-fighting-for-childs-custody-to-talk-out-issues-over-coffee-and-dinner-2730883-2025-05-26",
      "headline": "Talk it out over coffee: Court to 'high-society' couple in child's custody battleThe couple is in the middle of divorce proceedings filed by the wife, who wants court's permission to travel to Europe with their 3-year-old daughter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-yadav-politician-turned-social-media-influencer-son-of-rjd-chief-lalu-prasad-yadav-2730920-2025-05-26",
      "headline": "Tej Pratap Yadav: Politician, lover, influencerTej Pratap's social media reveals how the eldest of the Yadav clan lives in his own world, divided between his deities and his group of supporters, some of whom call him Teju Bhaiya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-closes-sexual-harassment-case-under-pocso-against-former-wrestling-body-chief-brij-bhushan-singh-2730895-2025-05-26",
      "headline": "Delhi court closes POCSO case against ex-wrestling body chief Brij BhushanThe Delhi Police submitted a report under Section 173 CrPC, requesting the cancellation of the case based on the statements of the minor complainant and her father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-army-says-no-differences-with-the-yunus-government-pressure-elections-2730872-2025-05-26",
      "headline": "No differences with government: Top Bangladesh Army officer amid reports of riftCalling the Army and Bangladesh government \"parts of the same family\", Brigadier General Md Nazim-ud-Daula said that any minor differences should be viewed in context."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/french-president-emmanuel-macron-wife-brigitte-smack-his-face-viral-video-2730701-2025-05-26",
      "headline": "Did Macron's wife smack him in the face? Here's what we know about viral videoA video of French President Emmanuel Macron arriving in Vietnam has gone viral. It shows his wife, Brigitte, seemingly smacking him in the face just as he stepped off an aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-was-informed-30-minutes-within-op-sindoor-launch-s-jaishankar-tells-mps-panel-2730712-2025-05-26",
      "headline": "Pak was told 30 minutes after Op Sindoor's first phase, Jaishankar tells MPs panelIndia had informed Pakistan after 30 minutes of launching Operation Sindoor that only terror camps were being targeted, with a ceasefire following talks initiated by Islamabad, S Jaishankar told the Parliamentary Consultative Committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-politics-kabhi-khushi-kabhie-gham-moment-lalu-prasad-yadav-disowns-son-tej-pratap-2730819-2025-05-26",
      "headline": "K3G moment in Bihar politics: Lalu disowns son Tej Pratap over 'love confession'What the Yadav family experienced felt straight out of a Bollywood drama, as Lalu Prasad Yadav expelled his son Tej Pratap not just from the RJD but from the family itself, citing \"irresponsible behaviour.\" The dramatic turn of events drew uncanny parallels to Yashvardhan Raichand disowning his son Rahul over a love affair in Kabhi Khushi Kabhie Gham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sourav-ganguly-brother-snehashish-ganguly-his-wife-arpita-speedboat-capsizes-in-odisha-puri-sea-2730752-2025-05-26",
      "headline": "Close shave for Sourav Ganguly's brother, his wife as speedboat capsizes in PuriThe incident happened near the Lighthouse when the Snehashish and Arpita were enjoying a speedboat ride on Saturday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-inspiration-rafael-nadal-naomi-osaka-french-open-2025-2730934-2025-05-26",
      "headline": "How Rafael Nadal's footprint inspired Paula Badosa in comeback win vs Naomi OsakaFrench Open 2025: World No.1 Paula Badosa drew inspiration from Rafael Nadal's bronze footprint on Court Philippe-Chatrier to secure a hard-fought win over Naomi Osaka in the first round of the Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/king-charles-candan-visit-parliament-inauguration-uk-support-donald-trump-51-state-message-2730871-2025-05-26",
      "headline": "King Charles is on a 2-day trip to Canada. A message for Donald Trump?King Charles is on a two-day visit to Canada to open the 45th Parliament, becoming only the second monarch in Canadian history to take part in the tradition. The historic visit is seen as a subtle message to Donald Trump, who has floated the idea that Canada should become the 51st US state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaipur-jail-inmates-hotel-outing-with-girlfriends-police-constables-among-arrested-2730747-2025-05-26",
      "headline": "Poha, drugs, girlfriends: Jaipur jail break scandal exposed, 13 arrestedA total of 13 people, including five constables, four inmates and four relatives, were arrested on Sunday after it came to the fore that the inmates had allegedly paid bribes to enjoy a few hours of freedom outside the jail. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-newly-inaugurated-underground-metro-station-in-worli-flooded-2730676-2025-05-26",
      "headline": "Video: Mumbai's brand-new underground metro station flooded in heavy rainOperational since May 10, the Acharya Atre Chowk underground metro station on Aqua Line 3 got submerged after incessant rain in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/quick-vitals-app-noninvasive-blood-test-anemia-screening-india-no-needle-2730654-2025-05-26",
      "headline": "Inside India's first AI-driven blood test that doesn't require bloodA new app called Quick Vitals offers blood test results by scanning the face without needles. This innovation aims to improve early health screening, especially for anaemia in pregnant women and children, across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-smells-teen-spirit-free-adolescent-love-from-pocso-cases-sex-education-sexual-relationship-2730550-2025-05-26",
      "headline": "Supreme Court smells teen spirit, acts to free adolescent love from PocsoThe Supreme Court is trying to ensure that adolescents don't end up being jailed for consensual sexual relationships under the stringent Pocso Act, which is meant to protect minors. It has urged the Centre to consider devising a national sex education policy, and formed a committee to look into Pocso-related cases and suggest improvements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/symptoms-of-new-covid-variant-similar-to-viral-fever-delhi-health-minister-2730847-2025-05-26",
      "headline": "Symptoms of new Covid variant similar to viral fever: Delhi Health MinisterDelhi Health Minister said that the Covid variants detected in India cause only mild symptoms. However, the Centre remains vigilant."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-live-streaming-d-gukesh-vs-magnus-carlsen-round-1-match-2730957-2025-05-26",
      "headline": "D Gukesh vs Magnus Carlsen at Norway Chess: When and where to watchNorway Chess 2025: D Gukesh will take on world No.1 Carlsen in the opening round in what should be one of the most keenly-contested matches in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-breaks-mumbai-indians-ipl-season-runs-record-2730946-2025-05-26",
      "headline": "Suryakumar Yadav breaks Sachin Tendulkar's Mumbai Indians record in IPLSuryakumar Yadav has gone past Sachin Tendulkar's long-standing record for the most runs scored by a Mumbai Indians batter in a single season of the Indian Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-andy-murray-banter-champions-league-real-madrid-vs-arsenal-2730948-2025-05-26",
      "headline": "Rafael Nadal reveals Andy Murray banter after Arsenal beat Real Madrid in UCLRafael Nadal revealed the fun banter he had with Andy Murray after Arsenal defeated Real Madrid in the Champions League quarterfinals this season. Nadal revealed it during the press conference after his tribute at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-taylor-fritz-shocked-paula-badosa-beats-naomi-osaka-2730940-2025-05-26",
      "headline": "Upset in Round 1 as 4th seed Fritz ousted, Badosa knocks out OsakaFrench Open 2025: Fourth seed Taylor Fritz crashed out in the first round after losing in four sets to World No. 66 Daniel Altmaier. Meanwhile, Naomi Osaka lost her women's singles first-round match to 10th seed Paula Badosa on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-inspiration-rafael-nadal-naomi-osaka-french-open-2025-2730934-2025-05-26",
      "headline": "How Rafael Nadal's footprint inspired Paula Badosa in comeback win vs Naomi OsakaFrench Open 2025: World No.1 Paula Badosa drew inspiration from Rafael Nadal's bronze footprint on Court Philippe-Chatrier to secure a hard-fought win over Naomi Osaka in the first round of the Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-rcb-josh-hazlewood-return-malolan-rangarajan-lucknow-2730929-2025-05-26",
      "headline": "Happy with Josh Hazlewood return, but RCB have a quality squad: Assistant coachRCB assistant coach Malolan Rangarajan has said that while the team is happy to see Josh Hazlewood return in time for the playoffs, they have enough talent in the squad this time around to make up for then absence of the Australian pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-broadcast-live-streaming-jiotstar-sony-2730919-2025-05-26",
      "headline": "England vs India Tests: Live streaming on JioStar, Sony to telecast seriesJioStar and Sony Pictures Networks India will jointly broadcast India's 2025–26 tours of England, with JioHotstar streaming matches and Sony airing them on TV. The partnership includes a five-Test series and a 2026 white-ball tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-captaincy-playing-xis-jaipur-2730898-2025-05-26",
      "headline": "No pep talk for PBKS: Shreyas Iyer says he lets actions speak more than wordsShreyas Iyer opened up about his captaincy and said that he is a skipper who lets his actions do the talking on the field. Shreyas has been sensational as a captain this season for the Punjab Kings in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-emma-raducanu-results-first-round-2730863-2025-05-26",
      "headline": "Carlos Alcaraz begins title defence in style, Emma Raducanu wriggles out of dangerFrench Open 2025: Carlos Alcaraz began his Roland Garros title defence with a commanding straight sets win. Emma Raducanu fought hard to reach the second round, setting up a tough clash against Iga Swiatek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-sai-sudharsan-debut-sulakshan-kulkarni-tamil-nadu-2730861-2025-05-26",
      "headline": "Sai Sudharsan's technique against moving ball needs to improve: EX-TN coachFormer Tamil Nadu coach Sulakshan Kulkarni has said that Sai Sudharsan's technique needs to improve against the moving ball ahead of the England tour. Sudharsan is one of the new faces in the India squad for the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priyank-panchal-retires-all-forms-of-cricket-statement-2730855-2025-05-26",
      "headline": "Priyank Panchal retires, recalls late father's motivation in emotional noteVeteran Gujarat opener Priyank Panchal has announced his retirement from all formats of cricket with immediate effect. Panchal recalled his late father's motivational message in an emotional farewell note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-broadcast-live-streaming-jiotstar-sony-2730919-2025-05-26",
      "headline": "England vs India Tests: Live streaming on JioStar, Sony to telecast seriesJioStar and Sony Pictures Networks India will jointly broadcast India's 2025–26 tours of England, with JioHotstar streaming matches and Sony airing them on TV. The partnership includes a five-Test series and a 2026 white-ball tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-captaincy-playing-xis-jaipur-2730898-2025-05-26",
      "headline": "No pep talk for PBKS: Shreyas Iyer says he lets actions speak more than wordsShreyas Iyer opened up about his captaincy and said that he is a skipper who lets his actions do the talking on the field. Shreyas has been sensational as a captain this season for the Punjab Kings in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-carlos-alcaraz-emma-raducanu-results-first-round-2730863-2025-05-26",
      "headline": "Carlos Alcaraz begins title defence in style, Emma Raducanu wriggles out of dangerFrench Open 2025: Carlos Alcaraz began his Roland Garros title defence with a commanding straight sets win. Emma Raducanu fought hard to reach the second round, setting up a tough clash against Iga Swiatek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-sai-sudharsan-debut-sulakshan-kulkarni-tamil-nadu-2730861-2025-05-26",
      "headline": "Sai Sudharsan's technique against moving ball needs to improve: EX-TN coachFormer Tamil Nadu coach Sulakshan Kulkarni has said that Sai Sudharsan's technique needs to improve against the moving ball ahead of the England tour. Sudharsan is one of the new faces in the India squad for the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priyank-panchal-retires-all-forms-of-cricket-statement-2730855-2025-05-26",
      "headline": "Priyank Panchal retires, recalls late father's motivation in emotional noteVeteran Gujarat opener Priyank Panchal has announced his retirement from all formats of cricket with immediate effect. Panchal recalled his late father's motivational message in an emotional farewell note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-reveals-his-top-two-teams-and-finalists-of-ipl-2025-2730830-2025-05-26",
      "headline": "Aakash Chopra reveals his top two teams and finalists of IPL 2025Former India cricketer-turned commentator Aakash Chopra has predicted his top two teams and the finalists of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xabi-alonso-real-madrid-head-coach-new-era-ambitions-2730816-2025-05-26",
      "headline": "Alonso thanks Carlo Ancelloti, hopes to make Real Madrid unstoppable forceXabi Alonso has promised to help Real Madrid achieve great things after being unveiled as the club's new manager on Monday. Alonso also thanked Carlo Ancelotti, saying he wouldn't be in this position without his predecessor's influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-t20-world-cup-2026-changed-approach-2730827-2025-05-26",
      "headline": "T20I snub helped me rethink my game, World Cup 2026 in my mind: KL RahulWicketkeeper-batter KL Rahul has expressed his desire to return to the T20I set-up and be part of the World Cup next year. Rahul last played for India in the shortest format of the game in November 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-casper-ruud-emma-navarro-first-round-results-2730825-2025-05-26",
      "headline": "Iga Swiatek made to sweat in first round, Casper Ruud advancesIga Swiatek was made to sweat in her first round clash of the French Open on Monday, May 26. Casper Ruud overcame Albert Ramos-Viñolas to make it to the second round at Roland Garros on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-mohamed-salah-saudi-arabia-move-arne-slot-2730797-2025-05-26",
      "headline": "Liverpool's Mohamed Salah admits talks about Saudi Pro League move was seriousLiverpool's Mohamed Salah has admitted that talks for a move to Saudi Arabia were serious last summer before signing an extension with the Reds. Salah played a key role in Liverpool's title win this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-tom-moody-gt-vs-csk-2730749-2025-05-26",
      "headline": "Gujarat Titans bowlers are losing form at the wrong time: Tom MoodyIPL 2025: Former all-rounder Tom Moody said that Gujarat Titans' bowlers haven't been able to bowl well in partnerships due to which they have lost form in recent matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-ipl-future-murali-karthik-virat-kohli-2730748-2025-05-26",
      "headline": "MS Dhoni IPL future: Murali Karthik uses Virat Kohli reference to discuss topicMurali Karthik said that while people still adore MS Dhoni, there comes a time when players need to step away from the sport. Karthik used the reference of Virat Kohli to make his case to Dhoni, whose future remains a mystery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-iga-swiatek-casper-ruud-emma-navarro-first-round-results-2730825-2025-05-26",
      "headline": "Iga Swiatek made to sweat in first round, Casper Ruud advancesIga Swiatek was made to sweat in her first round clash of the French Open on Monday, May 26. Casper Ruud overcame Albert Ramos-Viñolas to make it to the second round at Roland Garros on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-mohamed-salah-saudi-arabia-move-arne-slot-2730797-2025-05-26",
      "headline": "Liverpool's Mohamed Salah admits talks about Saudi Pro League move was seriousLiverpool's Mohamed Salah has admitted that talks for a move to Saudi Arabia were serious last summer before signing an extension with the Reds. Salah played a key role in Liverpool's title win this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-tom-moody-gt-vs-csk-2730749-2025-05-26",
      "headline": "Gujarat Titans bowlers are losing form at the wrong time: Tom MoodyIPL 2025: Former all-rounder Tom Moody said that Gujarat Titans' bowlers haven't been able to bowl well in partnerships due to which they have lost form in recent matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-ipl-future-murali-karthik-virat-kohli-2730748-2025-05-26",
      "headline": "MS Dhoni IPL future: Murali Karthik uses Virat Kohli reference to discuss topicMurali Karthik said that while people still adore MS Dhoni, there comes a time when players need to step away from the sport. Karthik used the reference of Virat Kohli to make his case to Dhoni, whose future remains a mystery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-erik-ten-hag-bayer-leverkusen-manchester-united-xabi-alonso-2730711-2025-05-26",
      "headline": "Former Manchester United boss Erik ten Hag becomes Bayer Leverkusen managerFormer Manchester United manager Erik ten Hag has replaced Xabi Alonso as the new boss of Bayer Leverkusen, the German club confirmed on Monday, May 26. Ten Hag has been out of work since being sacked by United last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-son-tribute-novak-djokovic-2730709-2025-05-26",
      "headline": "Watch: Rafael Nadal's son plays with Big four after father's tributeRafael Nadal had a dream day in the presence of his son, wife and other family members after the French Open paid him an emotional tribute on Sunday, May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharmas-father-thanks-yuvraj-singh-for-shaping-sons-career-2730705-2025-05-26",
      "headline": "Abhishek Sharma's father thanks Yuvraj Singh for shaping son's careerSunrisers Hyderabad (SRH) opening batter Abhishek Sharma's father Raj Kumar Sharma thanked Yuvraj Singh for shaping son's career. Abhishek had another good season in the IPL 2025 as he scored 439 runs from 13 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}