{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-sharply-lower-amid-trade-war-fears-after-trump-tariffs-2703618-2025-04-03",
      "headline": "Wall Street opens sharply lower amid trade war fears after Trump tariffsWall Street's major indexes fell sharply after President Trump's new tariffs raised trade war fears. The Dow dropped 2.66%, the S&P 500 declined 3.32%, and the Nasdaq plunged 4.50%, reflecting market uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-nomination-updation-now-free-says-finance-minister-nirmala-sitharaman-2703506-2025-04-03",
      "headline": "PPF nomination updation now free, says Nirmala SitharamanIt is important to add a nominee to the PPFaccount so that the money is transferred in a smooth manner in the event of the death of the PPF account holder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-liberation-day-reciprocal-tariff-announcement-india-at-27-percent-pakistan-29-percent-tariff-2703432-2025-04-03",
      "headline": "Trump's 'Liberation Day' tariff: India at 27%, but where does Pakistan stand?Asian nations have been the hardest hit by Trump's latest tariff move. The new duties aim to cut the US trade deficit and change global supply chains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-300-points-as-trump-tariffs-weigh-but-nifty-holds-23200-amid-limited-impact-2703450-2025-04-03",
      "headline": "Sensex, Nifty snap 2-day winning streak as D-Street sees limited tariff impactThe S&P BSE Sensex fell 322.08 points to close at 76,295.36, while the NSE Nifty50 shed 82.25 points to end at 23,250.10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-us-calculate-reciprocal-tariff-for-different-countries-explanation-factors-reasons-2703440-2025-04-03",
      "headline": "Explained: How Trump's administration calculated reciprocal tariffsIn a statement released on Wednesday night, the United States Trade Representative (USTR) explained how the tariffs were determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-shares-video-on-x-alleges-fraud-conspiracy-legal-battle-2703395-2025-04-03",
      "headline": "Byju Raveendran alleges conspiracy caught on video amid legal woesThe video he shared is one minute and 44 seconds long and appears to be a screen recording of a virtual meeting involving Byju's shareholders and their lawyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-asia-countries-hardest-hit-china-vietnam-thailand-south-korea-india-2703307-2025-04-03",
      "headline": "Trump's tariff list: Here's why Asian countries took the biggest hitTrump tariff: Besides China, which now faces a total tariff of 54%, Vietnam has been hit with 46%, Thailand with 37%, South Korea with 25%, and India with 27%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-order-india-gets-key-exemptions-on-several-critical-minerals-ytvd-2703245-2025-04-03",
      "headline": "Trump's tariff order: India gets key exemptions on several critical mineralsTrump's new tariff order exempts India on copper, lumber, and critical minerals. The order imposes a 26% lower tariff on India compared to China, but experts question the calculation methods. Former diplomat Ashok Sajjanar criticises the non-transparent system and highlights the impact on strategic partnerships in the Indo-Pacific region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-analyzes-impact-of-us-tariff-mixed-bag-not-a-setback-commerce-ministry-ytvd-2703226-2025-04-03",
      "headline": "Mixed bag, not a setback: India's first response to Trump's tariffThe Commerce Ministry of India is analysing the impact of the 27% tariff imposed by the US. The ministry states it's a mixed bag and not a setback. Exemptions are expected in sectors like pharmaceuticals, semiconductors, and critical minerals. The tariff ranges from 10% to 27% across various sectors. India aims to sign a Bilateral Trade Agreement with the US by fall this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pharmaceutical-stocks-rising-today-donald-trump-reciprocal-tariff-exempt-glanf-pharma-cipla-dr-reddys-2703255-2025-04-03",
      "headline": "Sun Pharma, Gland, Cipla, Dr Reddy's: Why pharma stocks are rising todayShares of Sun Pharma, Dr Reddy's Laboratories, Gland Pharma, and Cipla rose sharply during early trade, defying the weak trend visible on the broader markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-tanks-500-points-nifty-below-23200-it-stocks-worst-hit-hcltech-infosys-2703240-2025-04-03",
      "headline": "Trump tariffs roil Dalal Street: Sensex, Nifty fall as IT stocks worst hitThe S&P BSE Sensex fell 344.27 points to 76,273.17, while the NSE Nifty50 lost 80.60 points to 23,251.75 as of 9:31 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jesse-eisenberg-kieran-culkins-a-real-pain-an-ode-to-shared-humanity-and-loss-2703588-2025-04-03",
      "headline": "Jesse Eisenberg, Kieran Culkin's A Real Pain: An ode to shared humanity and lossIn A Real Pain, Jesse Eisenberg and Kieran Culkin star as estranged cousins on a poignant journey through Poland. The film delves into themes of grief, heritage, and the enduring bonds that connect us across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-bond-film-in-works-by-amazon-mgm-exotic-new-chapter-2703637-2025-04-03",
      "headline": "James Bond film in works by Amazon MGM, makers promise an exotic new chapterA new James Bond movie is in the works by Amazon MGM. The makers have promised a brand-new exciting chapter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-universal-hypes-christopher-nolan-film-as-once-in-a-generation-epic-2703638-2025-04-03",
      "headline": "The Odyssey: Universal hypes Christopher Nolan film as 'once-in-a-generation' epicUniversal Pictures teased Christopher Nolan's ambitious adaptation of The Odyssey at CinemaCon, promising a cinematic masterpiece. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jack-trailer-siddu-jonnalagadda-turns-spy-in-this-action-entertainer-2703616-2025-04-03",
      "headline": "Jack trailer: Siddu Jonnalagadda turns a spy in this action entertainerActor Siddu Jonnalagadda, known for his roles in the Tillu franchise, steps into a more intense role with the upcoming movie, Jack. The action-comedy, directed by Bommarillu Bhaskar, follows a thrilling mission to eliminate terrorists, blending humour, action, and suspense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/glen-powell-mother-debunks-his-dating-rumours-with-sydney-sweeney-2703600-2025-04-03",
      "headline": "Glen Powell's mother debunks his dating rumours with Sydney SweeneyCyndy Powell addressed the swirling rumours about her son Glen Powell and actress Sydney Sweeney, confirming they are just friends. She highlights their longstanding friendship, dismissing any romantic speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-journey-as-acp-pradyuman-to-end-in-cid-exclusive-2703583-2025-04-03",
      "headline": "Actor Shivaji Satam's journey as ACP Pradyuman to end in CIDVeteran actor Shivaji Satam's journey will end soon on the iconic Sony TV show CID. Satam essayed the character of ACP Pradyuman in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/badshah-raveena-tandon-dances-to-kabhi-tu-chhalia-lagta-hai-video-2703544-2025-04-03",
      "headline": "Indian Idol 15: Badshah, Raveena Tandon groove to Kabhi Tu Chhalia Lagta HaiIndian Idol 15 is set for a spectacular conclusion with Badshah and Raveena Tandon grooving to classic hits. The finale promises electrifying performances by the top six contestants, airing on April 5 and 6 on Sony TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tigmanshu-dhulia-recalls-time-as-shekhar-kapurs-assistant-serving-srk-tea-2703580-2025-04-03",
      "headline": "Tigmanshu Dhulia recalls time as Shekhar Kapur's assistant, serving SRK teaTigmanshu Dhulia reflected on his early days working with Shekhar Kapur, shedding light on the director's shift from Hindi films to Hollywood. He also shared a humorous anecdote about making terrible tea for Shah Rukh Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/drake-granted-access-to-kendrick-lamars-contracts-by-court-glbs-2703578-2025-04-03",
      "headline": "Drake granted access to Kendrick Lamar's contracts by courtDrake wins access to Universal Music Group's confidential records in his defamation lawsuit over Kendrick Lamar's 'Not Like Us.' The lawsuit claims UMG knowingly profited from false accusations against him. With the case moving forward, a key hearing is set for June 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/david-schwimmer-admits-he-didnt-have-a-great-response-to-friends-theme-song-2703565-2025-04-03",
      "headline": "David Schwimmer admits he 'didn't have a great response' to Friends theme songActor David Schwimmer opened up about his reaction to the theme song of Friends. He revealed that listening to it repeatedly took a toll on him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-cynthia-erivo-unveil-1st-wicked-for-good-trailer-at-cinemacon-glbs-2703571-2025-04-03",
      "headline": "Ariana Grande, Cynthia Erivo unveil 1st Wicked For Good trailer at CinemaConWicked For Good, the highly anticipated sequel, continues the magical saga with Cynthia Erivo and Ariana Grande. Unveiled at CinemaCon, the film picks up from the first movie's dramatic cliffhanger, diving deeper into Elphaba and Glinda's journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/where-to-watch-the-most-celebrated-val-kilmer-films-online-glbs-2703563-2025-04-03",
      "headline": "Where to watch the most celebrated Val Kilmer films onlineFrom action-packed thrillers to cult classics, Val Kilmer's legendary career spanned decades of unforgettable performances. Despite being known for his on-set challenges, his undeniable talent made every role iconic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fox-extends-family-guy-and-the-simpsons-for-four-more-seasons-glbs-2703546-2025-04-03",
      "headline": "Fox extends Family Guy and The Simpsons for four more seasonsFox has renewed The Simpsons, Family Guy, Bob's Burgers, and American Dad for four more seasons, extending the legacy of these iconic animated sitcoms. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-minecraft-movie-review-does-jason-momoas-star-power-make-it-worth-watching-glbs-2703535-2025-04-03",
      "headline": "A Minecraft Movie review: Does Jason Momoa's star power make it worth watching?Jason Momoa leads a wild adventure in A Minecraft Movie, blending video game nostalgia with Hollywood action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/reese-witherspoon-announces-legally-blonde-prequel-elle-show-in-production-2703469-2025-04-03",
      "headline": "Reese Witherspoon announces Legally Blonde prequel Elle, show in productionReese Witherspoon has confirmed the production of 'Elle', a prequel to Legally Blonde. The series will delve into the formative years of Elle Woods, portrayed by Lexi Minetree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-cameo-nani-hit-3-to-play-lead-role-in-hit-4-2703505-2025-04-03",
      "headline": "Actor Karthi to be seen in Nani's HIT 3, will headline Part 4: ReportReports are rife that actor Karthi has played a cameo role in Nani's HIT 3, which will release in theatres on May 1. An official confirmation is still awaited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kesari-2-asks-british-empire-for-an-apology-over-jallianwala-bagh-massacre-kjo-2703500-2025-04-03",
      "headline": "Kesari 2 asks British Empire for an apology over Jallianwala Bagh massacre: KJoKaran Johar talked to the media at the trailer launch of 'Kesari 2', and mentioned that his films ask the right questions, including why the British never officially apologised for the Jallianwala Bagh massacre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-announces-kesari-3-based-on-sikh-warrior-hari-singh-nalwa-2703501-2025-04-03",
      "headline": "Akshay Kumar announces Kesari 3, based on Sikh warrior Hari Singh NalwaAkshay Kumar confirmed Kesari 3 at the second installment's trailer launch. The actor shared that it will be based on the life of Sikh warrior Hari Singh Nalwa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-sunny-deol-and-juhi-chawla-darr-to-re-release-in-theatres-on-april-4-2703458-2025-04-03",
      "headline": "SRK, Sunny Deol and Juhi Chawla's Darr to re-release in theatres on April 4Darr, the iconic Shah Rukh Khan film, is set to re-release in theatres on April 4. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-vowing-to-oppose-first-naveen-patnaiks-party-leaves-waqf-bill-vote-to-mps-2703592-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leave it to your conscience: BJD's message to MPs on Waqf Bill vote in U-turnThe BJD has announced that its Rajya Sabha MPs will vote on the Waqf (Amendment) Bill based on their conscience, without a party whip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jdu-leader-mohammed-qasim-ansari-resigns-over-partys-support-to-waqf-bill-all-trust-lost-2703645-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "JDU leader resigns over party's support to Waqf bill: 'All trust lost'Senior JD(U) leader Mohammed Qasim Ansari resigned from the party over its support for the Waqf Amendment Bill, calling it a betrayal of secular values. He said the bill violates constitutional rights and humiliates Indian Muslims. JD(U) defended the bill, saying it promotes transparency in Waqf management."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/l2-empuraan-controversy-it-happens-only-in-kerala-bjp-surprise-stance-suresh-gopi-rajeev-chandrashekhar-2702890-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "It happens only in Kerala: BJP's surprise stance on Empuraan rowUnlike its usual hardline stance on rows involving right-wing sentiments or the 2002 Gujarat riots, the BJP in Kerala has taken a surprisingly measured stance in the L2: Empuraan row. This is what makes Kerala different and why the BJP is taking an unusual approach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-muhammad-yunus-bangladesh-seated-together-official-dinner-thailand-bimstec-summit-2703641-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi, Bangladesh's Yunus seated together at official dinner in ThailandThe seating arrangement of PM Modi and Muhammad Yunus has fuelled speculation about a possible bilateral meeting on the sidelines of BIMSTEC summit in Thailand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-tabled-rajya-sabha-after-lok-sabha-pm-modi-sonia-gandhi-amit-shah-mallikarjun-kharge-2703305-2025-04-03#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live: Milind Deora defends Waqf Bill, says Muslims want empowerment, not appeasementWaqf Bill In Rajya Sabha Live Updates: The Waqf (Amendment) Bill has been tabled in Rajya Sabha, a day after it was passed in Lok Sabha following a 12-hour marathon debate. The Bill was passed after all amendments moved by the opposition members were rejected by voice votes. It was passed after division of votes -- 288 in favour and 232 against. Follow indiatoday.in for more updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-live-score-today-match-updates-kolkata-2703541-2025-04-03#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "KKR vs SRH live score: Venkatesh, Rinku steady KnightsIPL 2025, Kolkata Knight Riders (KKR) vs Sunrisers Hyderabad (SRH) Live Score: After building an 81-run stand, both Angkrish Raghuvanshi and Ajinkya Rahane have departed in quick succession. The onus is now on Rinku Singh and Venkatesh Iyer to rebuild. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-kerala-catholics-back-waqf-amendment-bill-2703524-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Kerala Catholics back Waqf (Amendment) BillAt stake is the future of 600 Christian families in Munambam, a suburb in Kochi, after the State Waqf Board staked claim over their land, measuring over 400 acres"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/american-tourist-arrested-andaman-nicobar-island-north-sentinal-sentinelese-tourist-john-allen-chau-death-2703573-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The last time an American visited the restricted Andaman islands, it led to his deathAfter a tourist from the US was arrested for entering Andaman's restricted island, a look back at the 2018 tragedy when an American attempted to contact the Sentinelese."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-made-donald-trump-go-full-rhetoric-half-on-tariff-global-trade-war-why-next-india-howard-lutnick-2703615-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tariff war: What made Trump go full on rhetoric but half on tariffUS President Donald Trump promised reciprocal tariffs, but while his rhetoric was full, the tariffs imposed seemed half-hearted. There is a reason that prevented Trump from walking the talk on tariffs. It's not a global trade war, but the fear back home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/donald-trump-india-reciprocal-tariffs-opposition-congress-attacks-government-2703316-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Customer phas gaya: Congress chief's quip on Modi-Trump bonhomie amid tariffThe opposition blasted the BJP-led government as Donald Trump announced a 27% reciprocal tariff on Indian imports, citing unfair trade practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivaji-satam-journey-as-acp-pradyuman-to-end-in-cid-exclusive-2703583-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Shivaji Satam's journey as ACP Pradyuman to end in CIDVeteran actor Shivaji Satam's journey will end soon on the iconic Sony TV show CID. Satam essayed the character of ACP Pradyuman in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-reacts-us-donald-trump-reciprocal-tariff-carefully-examining-implications-talks-with-us-trade-team-liberation-day-2703409-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Carefully examining implications, in talks with US: India on Trump's tariffsThe statement by the Finance Ministry further revealed that discussions are underway between Indian and US trade teams to finalise a mutually beneficial, multi-sectoral Bilateral Trade Agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-supreme-court-upholding-dismissal-bengal-teachers-distorted-2703445-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not all are guilty: Mamata Banerjee on top court's ruling against 25,000 teachersMamata Banerjee questioned the blanket dismissal of nearly 25,000 teachers in Bengal, asserting that not all appointees were guilty of wrongdoing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/myanmar-earthquake-video-man-jumps-between-collapsing-skyscrapers-to-save-family-2703498-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar earthquake video: Man jumps between collapsing skyscrapers to save familyKwon Young Jun jumped across a shattered 600ft walkway connecting the two skyscrapers soon after the devastating 7.7-magnitude earthquake struck neighbouring Thailand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-announces-panchayat-season-4-release-date-2703423-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Panchayat makers announce Season 4 release date on show's 5th anniversaryThe much-loved TVF series Panchayat celebrates its 5th anniversary with the announcement of Season 4, set to release in July, 2025. Prime Video marked the occasion by sharing a promotional video starring Jitendra Kumar and Jia Manek.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-faces-rajya-sabha-test-kiren-rijiju-seeks-oppositions-support-2703389-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Bill faces Rajya Sabha test, Kiren Rijiju says all properties for Muslims onlyThe Waqf (Amendment) Bill was tabled in the Rajya Sabha on Thursday, a day after it cleared the Lok Sabha after a 12-hour debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-fighter-jet-crash-cctv-footage-gujarat-jamnagar-2703495-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sharp dive, then fire lights up sky: Video captures IAF jet's crash in JamnagarThe CCTV footage shows the fighter jet flying crashing to the ground. Moments later, a bright explosion lights up the night sky, confirming the intensity of the impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-maharashtras-state-fish-silver-pomfret-is-vanishing-from-meals-2703448-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Maharashtra's 'state' fish silver pomfret is vanishing from mealsOver-fishing, pollution and climate change have taken a heavy toll, pulling the annual catch down to 40 tonnes in 2024 from 1,200 tonnes four decades ago"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/matcha-the-beverage-from-japan-has-now-reached-shark-tank-india-can-it-replace-your-morning-coffee-2703052-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Japan's matcha is on Shark Tank India too. Can it replace your morning coffee?Once exclusive to Japanese households, matcha has now found its way into India's thriving wellness scene. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-reciprocal-tariff-trump-inner-circle-has-fall-guy-ready-india-trade-liberation-day-howard-lutnick-who-is-he-2702864-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What if Trump's reciprocal tariff gambit fails, US has a fall guy readyUS President Donald Trump announced reciprocal tariffs on over 180 countries, including India. The additional tariffs will make imports to the US costlier. What if the entire tariff move backfires? Trump's inner circle has lined up a fall guy. And that is Commerce Secretary Howard Lutnick. This is why Lutnick suits this purpose best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/ramayana-in-india-ramakien-in-thailand-the-epics-journey-to-the-east-2703547-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ramayana in India, Ramakien in Thailand: The epic's journey to the EastThe epic of Lord Rama, known as the Ramayana in India, travelled far beyond its homeland, finding deep cultural roots in Thailand, where it evolved into the Ramakien. More than just a retelling, the Thai version of the saga blends Hindu and Buddhist influences with local traditions, shaping a narrative uniquely its own. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violated-ceasefire-in-jammu-kashmirs-poonch-last-night-twice-in-3-days-2703512-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak violated ceasefire in Jammu-Kashmir's Poonch last night, twice in 3 daysThis marks Pakistan's second ceasefire violation in three days. On Tuesday, after mine blasts at the LoC in Poonch, Pakistani troops attempted to push infiltrators under cover fire. The Indian Army swiftly retaliated, neutralising the threat."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-form-kieron-pollard-press-conference-2703644-2025-04-03",
      "headline": "LSG vs MI: Rohit Sharma gets Kieron Pollard's backing after poor IPL 2025 startMumbai Indians batting coach Kieron Pollard has backed Rohit Sharma to turnaround his poor start to the IPL 2025 season. Rohit has failed as a batter for MI in the first 3 games of the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-playing-xis-hyderabad-kamindu-mendis-pat-cummins-2703620-2025-04-03",
      "headline": "IPL 2025: SRH make two changes for KKR clash after poor start to seasonAfter a poor start to their IPL 2025 campaign, Sunrisers Hyderabad have decided to make 2 changes to their lineup for the clash against Kolkata Knight Riders on April 3 in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-eden-gardens-pitch-controversy-2703619-2025-04-03",
      "headline": "After Eden pitch controversy, KKR lay spin threat for SRH in KolkataIPL 2025: Kolkata Knight Riders laid a spin trap for SunRisers Hyderabad at the Eden Gardens. KKR's move comes after Ajinkya Rahane expressed his dissatisfaction with the wicket after the first match against RCB.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-philadelphia-76ers-confirm-knee-surgery-for-star-joel-embiid-glbs-2703589-2025-04-03",
      "headline": "NBA: Philadelphia 76ers star Joel Embiid set for Knee surgery, will be re-evaluated in six weeksThe Philadelphia 76ers have officially announced that star center Joel Embiid will undergo arthroscopic surgery next week to address lingering issues in his left knee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dorian-finney-smith-named-finalist-for-nba-sportsmanship-award-amid-strong-lakers-performance-glbs-2703591-2025-04-03",
      "headline": "Dorian Finney-Smith named finalist for NBA sportsmanship award amid strong Lakers performanceDorian Finney-Smith's impact on the Lakers earns him a spot as a finalist for the 2025 NBA Sportsmanship Award. Recognized for his defense, leadership, and three-point shooting, he joins Kyrie Irving, Shai Gilgeous-Alexander, and others in the race for the hono"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-mumbai-to-goa-switch-reasons-explained-2703587-2025-04-03",
      "headline": "Why Yashasvi Jaiswal made shocking switch from Mumbai to Goa? Reasons explained Yashasvi Jaiswal sent shockwaves in Indian cricket as the young opener decided to make the switch from Mumbai to Goa. While Jaiswal has come out with his own statement, India Today has learnt that there is more than meets the eye. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-how-will-kickoff-and-overtime-work-in-2025-glbs-2703577-2025-04-03",
      "headline": "NFL: How will kickoff and overtime work in 2025?NFL has made a few changes for the 2025 season including kickoff and overtime after implementing a one-year trial last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-quits-ipl-2025-returns-south-africa-gujarat-titans-2703574-2025-04-03",
      "headline": "Kagiso Rabada exits IPL, flies back to South AfricaGujarat Titans fast bowler Kagiso Rabada has exited the Indian Premier League due to personal reasons. The South African fast bowler has returned home, confirmed Gujarat via a statement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-chairman-asian-cricket-council-2703560-2025-04-03",
      "headline": "PCB chairman Mohsin Naqvi appointed as new ACC presidentPakistan Cricket Board (PCB) chairman Mohsin Naqvi has replaced Shammi Silva as the new president of the Asian Cricket Council. Naqvi will assume his role from April 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-live-score-today-match-updates-kolkata-2703541-2025-04-03",
      "headline": "KKR vs SRH live score: Knights lose Angkrish, Rahane in quick successionIPL 2025, Kolkata Knight Riders (KKR) vs Sunrisers Hyderabad (SRH) Live Score: After building an 81-run stand, both Angkrish Raghuvanshi and Ajinkya Rahane have departed in quick succession. The onus is now on Rinku Singh and Venkatesh Iyer to rebuild. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kendrick-perkins-names-the-clippers-as-thunders-biggest-threat-glbs-2703545-2025-04-03",
      "headline": "NBA: Kendrick Perkins names the Clippers as Thunder's biggest threatThe Los Angeles Clippers are heating up at the right time, and one former NBA champion believes they are the biggest challenge for the Oklahoma City Thunder in the Western Conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-how-will-kickoff-and-overtime-work-in-2025-glbs-2703577-2025-04-03",
      "headline": "NFL: How will kickoff and overtime work in 2025?NFL has made a few changes for the 2025 season including kickoff and overtime after implementing a one-year trial last season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-quits-ipl-2025-returns-south-africa-gujarat-titans-2703574-2025-04-03",
      "headline": "Kagiso Rabada exits IPL, flies back to South AfricaGujarat Titans fast bowler Kagiso Rabada has exited the Indian Premier League due to personal reasons. The South African fast bowler has returned home, confirmed Gujarat via a statement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-chairman-asian-cricket-council-2703560-2025-04-03",
      "headline": "PCB chairman Mohsin Naqvi appointed as new ACC presidentPakistan Cricket Board (PCB) chairman Mohsin Naqvi has replaced Shammi Silva as the new president of the Asian Cricket Council. Naqvi will assume his role from April 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-live-score-today-match-updates-kolkata-2703541-2025-04-03",
      "headline": "KKR vs SRH live score: Knights lose Angkrish, Rahane in quick successionIPL 2025, Kolkata Knight Riders (KKR) vs Sunrisers Hyderabad (SRH) Live Score: After building an 81-run stand, both Angkrish Raghuvanshi and Ajinkya Rahane have departed in quick succession. The onus is now on Rinku Singh and Venkatesh Iyer to rebuild. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kendrick-perkins-names-the-clippers-as-thunders-biggest-threat-glbs-2703545-2025-04-03",
      "headline": "NBA: Kendrick Perkins names the Clippers as Thunder's biggest threatThe Los Angeles Clippers are heating up at the right time, and one former NBA champion believes they are the biggest challenge for the Oklahoma City Thunder in the Western Conference."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}