{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kenya-cancels-700-million-deal-with-adani-group-after-us-charges-2637344-2024-11-21",
      "headline": "Kenya cancels $700 million deal with Adani Group after US chargesKenya has terminated a $700 million agreement with the Adani Group following a US indictment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kenya-cancels-proposed-deals-with-adani-group-after-us-indictment-over-bribery-2637298-2024-11-21",
      "headline": "Kenya cancels $730 million proposed deals with Adani Group after US indictmentKenyan President William Ruto has ordered the cancellation of several proposed deals with the Adani Group after the US indicted industrialist Gautam Adani in a bribery case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-400-points-lower-nifty-dips-as-adani-shares-crash-2637166-2024-11-21",
      "headline": "Sensex ends over 400 points lower, Nifty dips as Adani shares crashThe S&P BSE Sensex declined 422.59 points to close at 77,155.79, while the NSE Nifty50 shed 168.60 points to settle at 23,349."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-the-us-indictment-hurt-adani-group-international-fund-raising-plan-2637154-2024-11-21",
      "headline": "Will the US indictment hurt Adani Group's international fund raising plan?Gautam Adani and seven others have been accused of paying Rs 2,029 crore in bribes to secure solar power contracts between 2020 and 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-net-worth-declines-by-usd-12-billion-forbes-amid-bribery-case-2637106-2024-11-21",
      "headline": "Gautam Adani's net worth declines by $12 billion amid bribery caseAdani Bribery Row: The decline in net worth comes after allegations of bribery and has also dented the companies listed under the huge conglomerate, wiping out Rs 2 lakh crore in investor wealth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-denies-us-prosecutors-bribery-charges-calls-them-baseless-2637086-2024-11-21",
      "headline": "Adani denies US prosecutors' bribery charges, calls them baseless  The Adani Group has denied allegations of bribery and securities fraud made by U.S. prosecutors against its chairman, Gautam Adani, and other top executives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-first-statement-denies-us-indictment-bribery-fraud-allegations-legal-recourse-baseless-2637074-2024-11-21",
      "headline": "Adani Group rejects US bribery charge as baseless, assures stakeholdersAdani Group Bribery Charges: The Adani Group has dismissed the charges levelled by the US prosecutors as \"baseless\" and maintained that it operates with the highest standards of integrity and compliance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-market-cap-falls-lose-rs-2-lakh-crore-stocks-see-worst-day-since-hindenburg-crisis-2637034-2024-11-21",
      "headline": "Adani Group stocks see worst day since Hindenburg crisis, lose Rs 2 lakh croreAdani Group market cap falls: The bribery allegations caused panic selling across Adani Group stocks, marking their worst trading day since the Hindenburg Research report in early 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-conglomerate-share-price-rs-2-lakh-crore-wiped-out-bribary-charge-gautam-adani-2637030-2024-11-21",
      "headline": "Adani Group shares in free fall today. What should investors do?Adani Group Stocks: US authorities have levelled serious charges against Gautam Adani, his nephew Sagar Adani, and former Adani Green Energy CEO Vneet Jaain, accusing them of securities fraud, bribery, and conspiracy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-crash-bribery-allegations-gautam-adani-stock-price-impact-2637001-2024-11-21",
      "headline": "Adani Green, Adani Ports, Adani Transmission: Why Adani group shares are fallingAdani Group Stock Price: Adani Enterprises bore the brunt of the sell-off, falling 23% during the session. Adani Ports and Special Economic Zone (APSEZ) dropped 21%, Adani Power lost 14%, while Adani Energy Solutions and Adani Transmission both declined by 20%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-faces-bribery-charges-us-indictment-5-things-you-need-to-know-adani-group-shares-fall-2636998-2024-11-21",
      "headline": "Gautam Adani faces bribery charges, stocks plunge up to 23%. 5 things to knowAdani Bribery Row: Gautam Adani and seven others have been accused of paying Rs 2,029 crore in bribes to secure solar power contracts between 2020 and 2024.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-responds-to-bribery-charges-issues-statment-bond-deal-called-off-2636969-2024-11-21",
      "headline": "Adani Green issues statement on bribery charges, abandons $600 million bond dealAdani Group bribery charge: Following the charges, shares of Adani Group have crashed by up to 20%, with Adani Green down 18% on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-charged-us-bribery-fraud-solar-power-contracts-what-is-the-case-2636961-2024-11-21",
      "headline": "What is the case in which Gautam Adani has been charged with bribery in US?Gautam Adani bribery case: US prosecutors indicted Gautam Adani and 7 others for allegedly paying Rs 2,029 crore in bribes to Indian government officials for securing solar power contracts. What is the case?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-shares-fall-15percent-today-us-indictment-bribery-case-2636957-2024-11-21",
      "headline": "Explained: Why Adani Enterprises shares fell 15% todayAdani Enterprises share price: Adani Enterprises stock fell 15% to Rs 2,398.25. The shares were still trading above their 52-week low of Rs 2,153.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-adani-group-enterprises-ports-shares-falls-10-percent-2636950-2024-11-21",
      "headline": "Sensex, Nifty crash as Adani group shares fall up to 20% in early tradeSensex, Nifty Today: The S&P BSE Sensex was down 584.87 points to 76,993.51, while the NSE Nifty50 lost 202.40 points to 23,316.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-power-ports-green-energy-group-share-price-stocks-fall-up-to-20-percent-bribery-case-us-2636938-2024-11-21",
      "headline": "Adani Group shares tank up to 20% in early trade after bribery caseAdani group share price: Various stocks of the Adani group witnessed a steep decline on Thursday in early trade with Adani Enterprises falling 10%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-solution-share-price-market-debut-latest-gmp-suggest-ahead-of-listing-2636920-2024-11-21",
      "headline": "Zinka Logistics Solution share price: What does GMP suggest ahead of listing?Zinka Logistics Solution listing: The IPO of Zinka Logistics Solution, held from November 13-18, offered shares at a price band of Rs 259-273 per share with a lot size of 54 shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-reaches-new-record-high-of-usd-95000-etf-trump-5-things-to-know-2636908-2024-11-21",
      "headline": "Bitcoin reaches record high of $95,000. 5 things to knowBitcoin hits new high: The latest surge marks an over 100% increase in its value this year, cementing Bitcoin's position as a key player in the global financial markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-zinka-logistics-solution-vedanta-godfrey-phillips-stock-to-watch-today-2636901-2024-11-21",
      "headline": "Adani Enterprises, Zinka, Vedanta, Godfrey Phillips: Stocks to watch todayStocks in news: Several stocks such as Adani Enterprises, Zinka Logistics Solution, Vedanta, Godfrey Phillips are expected to be in focus due to various news developments. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-charges-in-us-alleged-265-million-bribery-case-2636892-2024-11-21",
      "headline": "Gautam Adani charged in US with alleged $265 million bribery, fraudAdani Bribery Row: Authorities said Adani and seven other defendants, including his nephew Sagar Adani, agreed to pay about $265 million in bribes to Indian government officials to obtain contracts expected to yield $2 billion of profit over 20 years, and develop India's largest solar power plant project."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-indicted-us-bribery-case-allegations-political-row-market-crash-2637272-2024-11-21",
      "headline": "Gautam Adani charged in US: Allegations, rebuttals, and stock market wipeoutBillionaire Gautam Adani and his executives have been accused of paying bribes to obtain solar energy contracts. The allegations by US prosecutors raised a political firestorm back home and led to tanking of Adani Group shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-exit-poll-c-voter-neck-to-neck-battle-nda-india-mahayuti-maha-vikas-aghadi-bjp-congress-ncp-shiv-sena-2637304-2024-11-21",
      "headline": "Dead heat in Maharashtra, predicts C-Voter surveyThe ruling Mahayuti is likely to win 112 of 288 Assembly seats in Maharashtra, while the opposition Maha Vikas Aghadi (MVA) may end up with 104 and 61 others were too close to call, according to C-Voter survey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-launches-intercontinental-ballistic-missile-icbm-ukraine-first-known-use-kyiv-2637149-2024-11-21",
      "headline": "Ukraine says Russia fired ICBM, Western officials counter claimThe Ukrainian authorities claimed that Russia fired an intercontinental ballistic missile (ICBM) targeting its city of Dnipro. However, two Western officials have denied the claims based on an initial assessment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/international-criminal-court-arrest-warrants-benjamin-netanyahu-yoav-gallant-hamas-official-2637213-2024-11-21",
      "headline": "International Criminal Court's arrest warrant against Netanyahu over 'war crimes'The court said it found reasonable grounds to believe that Benjamin Netanyahu and Yoav Gallant intentionally targeted civilians and limited medical supplies, leading to the worsening of the humanitarian crisis in Gaza."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/food-crisis-economic-crisis-canada-justin-trudeau-parents-cut-food-save-for-kids-gst-break-food-bank-shortage-2637299-2024-11-21",
      "headline": "25% of parents in Canada cutting back on food to feed their kids, says reportCanada, once a dream destination for many, is seeing 25% of parents cut back on their food intake to ensure enough food for their children, according to a Salvation Army report. Revealing a crisis in Canada, the report says over 90% of households are cutting back on their expenditure on groceries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tug-of-war-chief-minister-post-mva-mahayuti-maharashtra-elections-2637305-2024-11-21",
      "headline": "Tug of war over Chief Minister's post in MVA, Mahayuti ahead of poll resultsSix parties are part of the two alliances in Maharashtra. Chances of a single party getting a clear mandate is slim, making the contest for Chief Minister post interesting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kenya-cancels-proposed-deals-with-adani-group-after-us-indictment-over-bribery-2637298-2024-11-21",
      "headline": "Kenya cancels $730 million proposed deals with Adani Group after US indictmentKenyan President William Ruto has ordered the cancellation of several proposed deals with the Adani Group after the US indicted industrialist Gautam Adani in a bribery case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-perth-test-preview-pitch-conditions-head-to-head-record-jasprit-bumrah-pat-cummins-2637182-2024-11-21",
      "headline": "Perth Test Preview: Who will land the first blow in heavyweight opening bout?Australia vs India, 1st Test Preview and Prediction: The stage is set at the Optus Stadium as Australia and India are all ready for a heavyweight clash to start the Border-Gavaskar Trophy. Both teams have their issues. India will be hoping that Virat Kohli and stand-in captain Jasprit Bumrah step up and deliver in the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/lindt-admits-its-chocolates-have-heavy-metals-what-it-means-for-your-health-2636990-2024-11-21",
      "headline": "Heavy metals in Lindt chocolates: What it means for your healthSwiss chocolate maker Lindt faces a class action lawsuit in the US over allegations of high levels of heavy metals like lead and cadmium in its dark chocolate bars, raising health concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-spokesperson-ordered-on-call-to-keep-quiet-on-icbm-strike-video-is-viral-2637193-2024-11-21",
      "headline": "Russia spokesperson ordered on call to keep quiet on ICBM strike? Video is viralA viral video showed Russian Foreign Ministry spokesperson Maria Zakharova receiving a call and allegedly getting instructions from her higher authorities about not speaking about the launch of an intercontinental ballistic missile in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-presser-power-outage-blame-game-sambit-patra-jairam-ramesh-jibe-adani-bribery-case-row-2637188-2024-11-21",
      "headline": "Power outage at Rahul Gandhi's presser, BJP says Jairam Ramesh pulled the plugRahul Gandhi sarcastically attributed the power cut at his press conference to \"Adani power, Modi power,\" fuelling a war of words between Congress and the BJP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-being-your-childs-soulmate-backfire-soulmate-parenting-2637081-2024-11-21",
      "headline": "Can being your child's 'soulmate' backfire?Parents today want to be more involved in their children's lives, leading to the rise of soulmate parenting. But can being too involved cause problems?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/cyber-slavery-the-new-job-con-trapping-indian-youth-abroad-2637157-2024-11-21",
      "headline": "'Cyber slavery': The new job con trapping Indian youth abroadLured on the promise of IT jobs in Asian countries and their passports confiscated, the victims are forced to work in call centres duping people back in India"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-nandini-milk-products-enter-delhi-ncr-markets-2637323-2024-11-21",
      "headline": "Karnataka's Nandini milk products enter Delhi-NCR marketsKarnataka's Nandini milk products made an entry into the Delhi-NCR market on Thursday. Karnataka Chief Minister S Siddaramaiah and Deputy Chief Minister DK Shivakumar attended the launch event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-cryptic-blog-amid-rumours-speculations-are-speculations-2637287-2024-11-21",
      "headline": "Speculations are speculations: Big B's cryptic blog amid rumoursAmitabh Bachchan addressed rumours in a cryptic blog post, highlighting the unverified nature of speculations about his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-dhanush-idli-kadai-producer-wedding-netflix-documentary-vignesh-shivan-2637290-2024-11-21",
      "headline": "Nayanthara, Dhanush attend Idli Kadai producer's wedding after public falloutActors Nayanthara and Dhanush were seen under the same roof for Idli Kadai producer, Aakash Baskaran's wedding, after their public fallout. Several pictures and videos of the two stars at the function have gone viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-father-son-moment-poses-salim-khan-first-bike-2637339-2024-11-21",
      "headline": "See: Salman Khan poses with father Salim Khan's first bikeSalman Khan shared a nostalgic moment with his father Salim Khan, posing with the latter's first bike, a Triumph Tiger 100 from 1956. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gun-attack-passenger-vehicles-pakistan-northwest-restive-khyber-pakhtunkhwa-province-2637266-2024-11-21",
      "headline": "38 killed in deadly gun attack on vehicles carrying Shiites in PakistanThe attack occurred when several vehicles carrying Shiite Muslims were travelling in a convoy from the city of Parachinar to Peshawar, the capital of Khyber Pakhtunkhwa province."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-bribery-row-foreign-official-1-andhra-pradesh-government-2637164-2024-11-21",
      "headline": "Who is the mysterious 'Foreign Official #1', named in Adani bribery case?Adani bribery row: The US indictment mentions a large chunk of the bribes paid by Gautam Adani went to \"Foreign Official #1\" - an unnamed high-ranking Andhra Pradesh government official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-pushpa-2-do-what-its-title-declares-rule-2637168-2024-11-21",
      "headline": "Can 'Pushpa 2' do what its title declares—rule?Hitting cinemas on December 5, all bets are on the sequel to the film that gave Allu Arjun a National Award and pan-India star status"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-why-world-class-r-ashwin-could-be-indias-trump-card-vs-aus-2637307-2024-11-21",
      "headline": "IND vs AUS: Why 'world-class' R Ashwin could be India's trump card vs AustraliaBorder-Gavaskar Trophy: Ravichandran Ashwin had a forgettable home series against New Zealand but the veteran spinner has been a true-match winner and could turn out to be India's trump card in the Australia Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zomato-ceo-deepinder-goyal-will-reject-most-applicants-who-will-pay-rs-20-lakh-chief-of-staff-role-2637285-2024-11-21",
      "headline": "Zomato CEO says he will reject most applicants who will pay Rs 20 lakh for job offerZomato CEO Deepinder Goyal said that most applicants willing to pay Rs 20 lakh for his Chief of Staff role would be rejected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-company-bribed-officials-india-why-us-probe-2029-crore-solar-energy-supply-contracts-2637136-2024-11-21",
      "headline": "If Adani company 'bribed' officials in India, what is the US probe all about?US prosecutors have indicted Adani Group chairperson Gautam Adani and seven others for allegedly paying Rs 2,029 crore in bribes to officials in India. But why is the US probing a case where allegations of bribery have to do with Indian states and officials?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/all-we-imagine-as-light-payal-kapadia-characters-grainy-cinematography-rice-cooker-scene-exclusive-2637410-2024-11-21",
      "headline": "Payal Kapadia on All We Imagine As Light: From characters to cinematographyDirector Payal Kapadia, in an interview with India Today Digital, spoke about the film, All We Imagine as Light and the nuances of making the same. She even shared the inspiration behind the characters in the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-lucknow-viral-video-local-delicacies-dil-luminati-tour-2637347-2024-11-21",
      "headline": "Watch: Diljit Dosanjh enjoys Lucknow weather, savours local delicaciesSinger Diljit Dosanjh is set to perform in Lucknow on November 22 as part of his Dil-Luminati Tour. Ahead of the performance, the singer was seen strolling on the streets of the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-father-son-moment-poses-salim-khan-first-bike-2637339-2024-11-21",
      "headline": "See: Salman Khan poses with father Salim Khan's first bikeSalman Khan shared a nostalgic moment with his father Salim Khan, posing with the latter's first bike, a Triumph Tiger 100 from 1956. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-saira-banu-divorce-lawyer-horrified-with-rumours-linked-to-bassist-mohini-dey-2637306-2024-11-21",
      "headline": "AR Rahman-Saira divorce: Lawyer 'horrified' with rumours linked to bassist MohiniMusic legend AR Rahman and wife Saira Banu recently announced their separation after 29 years of marriage. Their lawyer, Vandana Shah, described the decision as mutual and dignified, and dismissed unfounded rumours linking it to other divorces."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-perth-test-pat-cummins-jasprit-bumrah-captaincy-2637401-2024-11-21",
      "headline": "In series named after batters, Bumrah-Cummins steal limelight as fast-bowling captainsBorder-Gavaskar Trophy: Pat Cummins and Jasprit Bumrah will be captaining their respective sides in the Perth Test match. In a series named after legendary batters, Cummins and Bumrah have carved a fandom of their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-chess-olympiad-double-gold-elo-ranking-jump-season-focus-2637400-2024-11-21",
      "headline": "Olympiad glory, 2800 ELO: Arjun Erigaisi recalls thumping 2024 season Arjun Erigaisi's stellar 2024 saw him dominate the chess world with record-breaking performances, including Chess Olympiad golds and achieving the 2800 ELO milestone, marking him as a rising legend in Indian and global chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/arjun-erigaisi-approach-one-tournament-at-a-time-chess-olympiad-candidates-chess-2637348-2024-11-21",
      "headline": "Focused on one tournament at a time: Erigaisi recalls his 2024 approachIn an exclusive chat with India Today's sister group Sports Today, Indian chess grandmaster Arjun Erigaisi reflected on his 2024 season, emphasising a \"one tournament at a time\" approach. The 21-year-old shared insights into navigating the year's highs and lows while embracing valuable learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-kl-rahul-form-sunil-gavaskar-2637334-2024-11-21",
      "headline": "KL Rahul will have no issue with scoring in Australia: Sunil GavaskarSunil Gavaskar feels that KL Rahul will not have an issue with scoring runs in Australia as the batter gets ready to open for India in the Perth Test. Rahul is expected to fill the spot left by Rohit Sharma's absence from the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-virat-kohli-form-deep-dasgupta-exclusive-2637310-2024-11-21",
      "headline": "Hope Virat Kohli finds 'aggressive, combative' zone vs Australia: Deep DasguptaIn an exclusive interview with Indiatoday.in, Deep Dasgupta hopes that Virat Kohli finds his aggressive and combative zone during the Border-Gavaskar Trophy. Dasgupta also said that Kohli could return to form during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-why-world-class-r-ashwin-could-be-indias-trump-card-vs-aus-2637307-2024-11-21",
      "headline": "IND vs AUS: Why 'world-class' R Ashwin could be India's trump card vs AustraliaBorder-Gavaskar Trophy: Ravichandran Ashwin had a forgettable home series against New Zealand but the veteran spinner has been a true-match winner and could turn out to be India's trump card in the Australia Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-is-laidback-bumrah-is-smiley-bloke-vaughan-on-india-missing-aggression-in-bgt-2637303-2024-11-21",
      "headline": "Rohit is laidback, Bumrah is smiley bloke: Vaughan on India missing aggression Michael Vaughan has highlighted India lacking the aggressive leadership in the lead-up to the Border Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sourav-ganguly-prediction-tight-contest-never-rule-out-border-gavaskar-trophy-2637296-2024-11-21",
      "headline": "Will never rule India out: Ganguly predicts tight Border Gavaskar TrophySourav Ganguly backs India's depth and resilience for the Border-Gavaskar Trophy, dismissing doubts over recent struggles, and highlights their history of triumph in adversity, as they gear up for a high-stakes series opener in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ind-vs-aus-exclusive-deep-dasupta-bgt-virat-kohli-rishabh-pant-bumrah-2637294-2024-11-21",
      "headline": "Unpredictable Rishabh Pant should play natural game, says Deep DasguptaBorder-Gavaskar Trophy: Speaking to IndiaToday.in, former India wicketkeeper-batter backed Virat Kohli to return to his confrontational best. Dasgupta said he is excited to watch Jasprit Bumrah leading the side in Perth in the absence of Rohit Sharma. He also backed Rishabh Pant to continue dominating the Australian attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/china-masters-lakshya-sen-reaches-quarterfinals-pv-sindhu-crashes-out-2637293-2024-11-21",
      "headline": "China Masters: Lakshya Sen reaches quarterfinals, PV Sindhu crashes outLakshya Sen showcased a dominant performance to reach the quarterfinals, while PV Sindhu faced a tough exit in the second round of the China Masters Super 750. Indian hopes continue with Satwiksairaj and Chirag in men's doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/if-virat-kohli-scores-a-hundred-he-will-have-a-great-bgt-series-pujara-2637283-2024-11-21",
      "headline": "If Virat Kohli scores a hundred, he will have a great BGT series: PujaraCheteshwar Pujara, while answering to India Today in Star Sports Press Room, backed Virat Kohli to score runs vs Australia. He said that Kohli will gain confidence by hitting hundred and will go on to have a great series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-is-laidback-bumrah-is-smiley-bloke-vaughan-on-india-missing-aggression-in-bgt-2637303-2024-11-21",
      "headline": "Rohit is laidback, Bumrah is smiley bloke: Vaughan on India missing aggression Michael Vaughan has highlighted India lacking the aggressive leadership in the lead-up to the Border Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sourav-ganguly-prediction-tight-contest-never-rule-out-border-gavaskar-trophy-2637296-2024-11-21",
      "headline": "Will never rule India out: Ganguly predicts tight Border Gavaskar TrophySourav Ganguly backs India's depth and resilience for the Border-Gavaskar Trophy, dismissing doubts over recent struggles, and highlights their history of triumph in adversity, as they gear up for a high-stakes series opener in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ind-vs-aus-exclusive-deep-dasupta-bgt-virat-kohli-rishabh-pant-bumrah-2637294-2024-11-21",
      "headline": "Unpredictable Rishabh Pant should play natural game, says Deep DasguptaBorder-Gavaskar Trophy: Speaking to IndiaToday.in, former India wicketkeeper-batter backed Virat Kohli to return to his confrontational best. Dasgupta said he is excited to watch Jasprit Bumrah leading the side in Perth in the absence of Rohit Sharma. He also backed Rishabh Pant to continue dominating the Australian attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/china-masters-lakshya-sen-reaches-quarterfinals-pv-sindhu-crashes-out-2637293-2024-11-21",
      "headline": "China Masters: Lakshya Sen reaches quarterfinals, PV Sindhu crashes outLakshya Sen showcased a dominant performance to reach the quarterfinals, while PV Sindhu faced a tough exit in the second round of the China Masters Super 750. Indian hopes continue with Satwiksairaj and Chirag in men's doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/if-virat-kohli-scores-a-hundred-he-will-have-a-great-bgt-series-pujara-2637283-2024-11-21",
      "headline": "If Virat Kohli scores a hundred, he will have a great BGT series: PujaraCheteshwar Pujara, while answering to India Today in Star Sports Press Room, backed Virat Kohli to score runs vs Australia. He said that Kohli will gain confidence by hitting hundred and will go on to have a great series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-series-prediction-border-gavaskar-trophy-opinions-2637268-2024-11-21",
      "headline": "Border-Gavaskar Trophy Prediction: Can wounded India complete a hat-trick in Australia?Border-Gavaskar Trophy: In the second edition of the Democratic Review System, we predict the scoreline of the much-awaited five-Test series. Will wounded India bounce back or Australia end their losing run at home? It promises to be a blockbuster! "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-jasprit-bumrah-captaincy-deep-dasgupta-exclusive-2637282-2024-11-21",
      "headline": "Jasprit Bumrah as full-time Test captain? Deep Dasgupta highlights major concernIn an exclusive interaction with Indiatoday.in, Deep Dasgupta pointed out the major concern that could stand in the way of Jasprit Bumrah becoming India's next full-time Test captain. Bumrah will be leading India in the Perth Test in Rohit Sharma's absence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/jasprit-bumrah-ready-for-captaincy-challenge-always-loved-responsibility-2637242-2024-11-21",
      "headline": "Jasprit Bumrah ready for captaincy challenge: Always loved responsibilityJasprit Bumrah is all set to lead the Indian team for the 1st Test of the Border Gavaskar Trophy series between India and Australia. Bumrah, while addressing the press conference, said that he is ready for the role and has always loved responsibility. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-shares-motivating-quote-ahead-of-perth-test-pumped-to-shine-again-2637261-2024-11-21",
      "headline": "Rishabh Pant shares motivating quote ahead of Perth Test, pumped to shine againRishabh Pant shared a motivating quote on his Instagram ahead of the 5-match Test series between India and Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-perth-test-preview-pitch-conditions-head-to-head-record-jasprit-bumrah-pat-cummins-2637182-2024-11-21",
      "headline": "Perth Test Preview: Who will land the first blow in heavyweight opening bout?Australia vs India, 1st Test Preview and Prediction: The stage is set at the Optus Stadium as Australia and India are all ready for a heavyweight clash to start the Border-Gavaskar Trophy. Both teams have their issues. India will be hoping that Virat Kohli and stand-in captain Jasprit Bumrah step up and deliver in the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-captain-jasprit-bumrah-last-time-led-team-perth-test-border-gavaskar-trophy-2637221-2024-11-21",
      "headline": "Captain Bumrah: What happened when the pacer last led India in TestsJasprit Bumrah steps into the spotlight, captaining India in Rohit Sharma's absence for the Border Gavaskar Trophy opener, a high-stakes battle that could shape India's World Test Championship fate amid recent struggles and key player injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-perth-test-jasprit-bumrah-captaincy-pressure-ravi-shastri-2637202-2024-11-21",
      "headline": "Captain Jasprit Bumrah will be the main target for Australia: Ravi ShastriFormer India coach Ravi Shastri claimed that Jasprit Bumrah will feel the pressure and Australia would target the pacer during the Perth Test, which will start on November 22. Bumrah will be captaining India for the second time in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-saudi-pro-league-motive-leave-a-leagcy-al-nassr-shock-transfer-2637197-2024-11-21",
      "headline": "Ronaldo reveals true motive behind Saudi move: Want to leave a legacyWith Netflix's new docu-series spotlighting the Saudi Pro League, Cristiano Ronaldo revealed his legacy-driven motive behind joining Al Nassr in 2023, a move that reshaped the league's global appeal and solidified his impact on Saudi football's evolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-perth-test-preview-pitch-conditions-head-to-head-record-jasprit-bumrah-pat-cummins-2637182-2024-11-21",
      "headline": "Perth Test Preview: Who will land the first blow in heavyweight opening bout?Australia vs India, 1st Test Preview and Prediction: The stage is set at the Optus Stadium as Australia and India are all ready for a heavyweight clash to start the Border-Gavaskar Trophy. Both teams have their issues. India will be hoping that Virat Kohli and stand-in captain Jasprit Bumrah step up and deliver in the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-captain-jasprit-bumrah-last-time-led-team-perth-test-border-gavaskar-trophy-2637221-2024-11-21",
      "headline": "Captain Bumrah: What happened when the pacer last led India in TestsJasprit Bumrah steps into the spotlight, captaining India in Rohit Sharma's absence for the Border Gavaskar Trophy opener, a high-stakes battle that could shape India's World Test Championship fate amid recent struggles and key player injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-perth-test-jasprit-bumrah-captaincy-pressure-ravi-shastri-2637202-2024-11-21",
      "headline": "Captain Jasprit Bumrah will be the main target for Australia: Ravi ShastriFormer India coach Ravi Shastri claimed that Jasprit Bumrah will feel the pressure and Australia would target the pacer during the Perth Test, which will start on November 22. Bumrah will be captaining India for the second time in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-saudi-pro-league-motive-leave-a-leagcy-al-nassr-shock-transfer-2637197-2024-11-21",
      "headline": "Ronaldo reveals true motive behind Saudi move: Want to leave a legacyWith Netflix's new docu-series spotlighting the Saudi Pro League, Cristiano Ronaldo revealed his legacy-driven motive behind joining Al Nassr in 2023, a move that reshaped the league's global appeal and solidified his impact on Saudi football's evolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-reveals-virat-kohlis-message-to-him-ahead-of-bgt-series-2637190-2024-11-21",
      "headline": "Yashasvi Jaiswal reveals Virat Kohli's message to him ahead of BGT series                  Yashasvi Jaiswal revealed Virat Khli's word of advice to him ahead of the Border Gavaskar Trophy series. This will be Jaiswal's 1st and Kohli's 5th tour to Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-nathan-lyon-australia-vs-india-2636686-2024-11-21",
      "headline": "India winless, Lyon's den: All you need to know about Perth Stadium AUS vs IND: Australia, captained by Pat Cummins, will have an advantage going into the opening Test against India at the Perth Stadium. The Aussies have won all their four Tests in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-devdutt-padikkal-permenent-stay-test-squad-border-gavaskar-trophy-2637160-2024-11-21",
      "headline": "Padikkal eyes permanent Test spot beyond BGT: Hope to make it countDevdutt Padikkal's return to India's Test squad for the Border Gavaskar Trophy brings fresh hope as he replaces the injured Shubman Gill. The 24-year-old aims to secure his place with strong performances in this crucial series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-prediction-which-players-can-rcb-buy-kl-rahul-yuzvendra-chahal-bengaluru-purse-2636711-2024-11-21",
      "headline": "IPL auction prediction: Can RCB target Rahul, Chahal with Rs 83 crore purse?IPL Mega-Auction: RCB will step into the IPL 2025 mega auction with renewed hopes of being able to make a well-rounded squad who could help the franchise lift its maiden title. Can they target KL Rahul and Yuzvendra Chahal with Rs 83 crore purse?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}