{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-small-ais-check-can-save-you-from-a-tax-notice-2759547-2025-07-22",
      "headline": "How a small AIS check can save you from a tax noticeIf you skip checking your AIS, you might end up missing some income details. This can lead to a mismatch between what you file and what the tax department already knows, and that can easily get you a notice later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-flat-nifty-below-25100-eternal-up-11-percent-tata-motors-down-2759578-2025-07-22",
      "headline": "Sensex closes flat, Nifty below 25,100; Eternal up 11%The S&P BSE Sensex lost 13.53 points to end at 82,186.81, while the NSE Nifty50 ended lower by 29.80 points to close at 25,060.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-entry-india-problem-competition-model-y-price-ev-sector-news-mahindra-tata-mg-2759556-2025-07-22",
      "headline": "Why Tesla's ride into India's EV market won't be a smooth oneTesla's entry comes at a time when it is facing its biggest drop in global sales to date. Its domestic sales in the US fell 6.3% in the second quarter of 2025, the third straight quarterly decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-is-now-tax-free-check-who-benefits-and-how-income-tax-exemption-2759508-2025-07-22",
      "headline": "NOIDA is now tax-free. Check who benefits and howAt a time when cities are competing hard to attract businesses and investors, this tax relief could give NOIDA a fresh edge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-receives-plea-to-cut-28-percent-gst-on-aerated-drinks-2759502-2025-07-22",
      "headline": "Government receives plea to cut 28% GST on aerated drinksThe matter is likely to be taken up at the upcoming 56th GST Council meeting, expected to be held in mid-August. The meeting is already set to review a broader rate rationalisation framework, with officials indicating that certain slabs and cesses may be simplified or merged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ex-icici-ceo-chanda-kochhar-rs-64-crore-vibe-videocon-tribunal-bribe-case-report-2759484-2025-07-22",
      "headline": "Chanda Kochhar found guilty in Rs 64-crore Videocon bribe case: ReportAn appellate tribunal gave this ruling in an order dated July 3. The tribunal said that the money was routed through Kochhar's husband Deepak Kochhar, using a company connected to Videocon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-indian-homebuyers-growing-wealth-or-buying-liabilities-explains-consultant-2759436-2025-07-22",
      "headline": "Are Indian homebuyers growing wealth or buying liabilities? Explains consultantA real-estate consultant points out that the middle class often assumes owning a house means they are moving forward, but in reality, possession alone does not guarantee real financial progress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-rcom-fraud-sbi-allegation-cbi-case-trouble-reliance-communications-2759429-2025-07-22",
      "headline": "SBI to approach CBI after tagging Anil Ambani and RCom as 'fraud'SBI's exposure to Reliance Communications includes a fund-based principal outstanding of Rs 2,227.64 crore, along with interest and expenses since August 26, 2016. In addition, there is a non-fund based bank guarantee exposure of Rs 786.52 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-stricter-digital-banking-rules-what-it-means-for-you-2759405-2025-07-22",
      "headline": "RBI proposes stricter digital banking rules: What it means for youTo keep online fraud in check, all banks must use proper fraud detection tools and keep an eye on unusual transactions. They should also study how customers usually spend money so that any odd activity can be spotted quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-ban-sebi-removal-with-conditions-investigation-ongoing-stock-market-manipulation-2759369-2025-07-22",
      "headline": "Sebi clears Jane Street to resume trading, with strings attachedJane Street was allowed to return to the markets after it complied with a key part of Sebi's interim order. The firm deposited Rs 4,844 crore in an escrow account held with a scheduled commercial bank in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-see-sharp-rally-after-q1-results-buy-sell-or-hold-2759367-2025-07-22",
      "headline": "Eternal shares see sharp rally after Q1 results. Buy, sell or hold?The rally comes on the back of strong performance across verticals, with quick commerce overtaking food delivery in terms of Net Order Value (NOV) for the first time. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-calls-trivikram-srinivas-godsend-explains-reasons-for-choosing-remakes-2759555-2025-07-22",
      "headline": "Pawan Kalyan calls Trivikram a godsend, explains reasons for choosing remakesAs 'Hari Hara Veera Mallu Part-1' inches closer to release, Pawan Kalyan has joined the promotions. At the pre-release event in Hyderabad on July 21, the actor-politician spoke about how personal and professional challenges shaped his choices, from embracing remakes to his enduring bond with director Trivikram Srinivas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-director-ashwin-kumar-want-to-see-hrithik-roshan-ias-nataraja-2759567-2025-07-22",
      "headline": "Mahavatar Narsimha director Ashwin Kumar: Want to see Hrithik Roshan ias NatarajaFilmmaker Ashwin Kumar is set to release his debut mythological epic 'Mahavatar Narsimha' on July 25. He also shares exciting updates on two more live-action mythological projects featuring Hrithik Roshan in a divine role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-saiyaara-sleeper-hit-revives-classic-bollywood-romance-newcomers-2759535-2025-07-22",
      "headline": "Mohit Suri says big filmmakers warned him against making a love story with newcomersMohit Suri reveals how Saiyaara became a sleeper hit despite industry doubts. The film challenges current action trends by reviving a classic romantic genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-saiyaara-winning-hearts-and-the-box-office-is-it-that-good-decoding-aahaan-panday-aneet-padda-film-success-among-gen-z-2759519-2025-07-22",
      "headline": "Why is Saiyaara winning hearts (and the box office)?In a world constantly chasing virality, 'Saiyaara' chooses vulnerability. It doesn't offer a spectacle - it offers sincerity. And if you are still wondering why it's working, here's what you probably don't know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mari-selvaraj-dhanush-new-tamil-film-project-2759490-2025-07-22",
      "headline": "Director Mari Selvaraj calls film with Dhanush a milestone, filming to begin soonDuring a recent awards ceremony, director Mari Selvaraj confirmed starting work on his next project with Dhanush, after wrapping his current film 'Bison' with Dhruv Vikram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-opens-up-about-facing-colour-bias-and-body-shaming-in-bollywood-2759521-2025-07-22",
      "headline": "Vaani Kapoor opens up about colour bias and body shaming in the film industryVaani Kapoor shared that she faced rejection early in her career due to her skin tone and was often body-shamed for being too skinny. Despite the criticism, she remains confident and is now set to lead Netflix's upcoming thriller 'Mandala Murders'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/krish-jagarlamudi-calls-pawan-kalyan-soul-and-storm-of-hhvm-shares-emotional-note-2759501-2025-07-22",
      "headline": "Director Krish calls Pawan Kalyan soul and storm of HHVM, shares emotional noteAhead of the release of the long-delayed period action drama 'Hari Hara Veera Mallu', director Krish Jagarlamudi, who helmed the initial portions of the film, shared an emotional note reflecting on his journey with the project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hrithik-roshan-calls-vir-das-fool-volume-the-best-stand-up-reinstalls-app-to-say-2759489-2025-07-22",
      "headline": "Hrithik Roshan calls Vir Das Fool Volume best stand-up everHrithik Roshan praised Vir Das' Netflix special 'Fool Volume', calling it the best stand-up show ever. The actor shared that he even reinstalled Instagram just to say so. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-undergoes-anti-ageing-laser-treatment-to-look-youthful-in-next-decade-report-2759402-2025-07-22",
      "headline": "Angelina Jolie undergoes laser treatments to look youthful in next decade: ReportIn a bid to look youthful, Hollywood actor Angelina Jolie has reportedly undergone serious laser treatments. The 50-year-old prioritises self-care with dermatologist's assistance. She is said to be no stranger to Botox and has been using it for years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-daughter-malti-marie-steals-the-spotlight-with-her-princess-moment-2759414-2025-07-22",
      "headline": "Priyanka Chopra's daughter Malti steals the spotlight with her princess momentPriyanka Chopra shared adorable new photos of her daughter Malti Marie, delighting fans with glimpses of her playful and princess-like moments. Earlier, the actor shared that Malti loves the Disney character Moana and dressing up, and has even started calling herself 'Malti Marie Moana Chopra Jonas.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-meme-on-taking-ranveer-singh-opinion-is-every-couple-ever-2759447-2025-07-22",
      "headline": "Deepika's meme about taking Ranveer's advice has every couple relatingDeepika Padukone shared a funny meme about asking Ranveer Singh's opinion after already making a decision, giving fans a peek into their playful relationship. The couple, who became parents last year, often share light-hearted moments that fans love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-back-home-recovering-from-dengue-to-begin-kingdom-promotions-2759498-2025-07-22",
      "headline": "Vijay Deverakonda back home recovering from dengue, to begin Kingdom promotionsVijay Deverakonda was discharged from a private hospital after recovering from dengue. He will kickstart 'Kingdom' promotions soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-calls-her-and-hrithik-roshan-og-crushes-amid-saiyaara-vs-kaho-naa-pyaar-hai-comparison-2759441-2025-07-22",
      "headline": "Ameesha Patel calls her and Hrithik OG crushes amid Saiyaara vs Kaho Naa comparisonActor Ameesha Patel recently addressed ongoing comparisons between 'Saiyaara' and 'Kaho Naa... Pyaar Hai'. She called her and Hrithik Roshan the OG crushes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-release-rs-600-for-early-premiere-shows-andhra-pradesh-telangana-2759475-2025-07-22",
      "headline": "Hari Hara Veera Mallu: Rs 600 for premiere shows, Rs 12.5 crore in pre-salesPawan Kalyan's 'Hari Hara Veera Mallu', will have special premiere shows in Andhra Pradesh and Telangana on July 24 at 9 pm. The two governments have given permission to cap the ticket price at Rs 600. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-to-handle-kajol-and-twinkle-khanna-bring-drama-and-fun-to-new-talk-show-2759466-2025-07-22",
      "headline": "Two Much to handle? Kajol and Twinkle Khanna bring drama and fun to new talk showKajol and Twinkle Khanna bring their candid personalities to the new talk show 'Two Much', featuring open discussions on relatable topics. The series will be streaming soon on Prime Video."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raashii-khanna-joins-pawan-kalyan-sreeleela-ustaad-bhagat-singh-2759421-2025-07-22",
      "headline": "Raashii Khanna joins Pawan Kalyan, Sreeleela in Ustaad Bhagat Singh'Thiruchitrambalam' actor Raashii Khanna has joined the cast of the upcoming Telugu film 'Ustaad Bhagat Singh', starring actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-bandar-premiere-toronto-film-festival-2025-2759449-2025-07-22",
      "headline": "Anurag Kashyap, Bobby Deol's Bandar to premiere at Toronto Film FestivalAnurag Kashyap's new film 'Bandar', starring Bobby Deol and Sanya Malhotra, is set to premiere at the Toronto International Film Festival 2025. The film, inspired by true events, marks a significant milestone for Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-dating-rumours-denied-saiyaara-box-office-success-2759409-2025-07-22",
      "headline": "Saiyaara actor Ahaan Panday is not dating Shruti Chauhan: Source'Saiyaara' actor Ahaan Panday is at the centre of dating rumours with Shruti Chauhan. However, sources have dismissed the speculation, emphasising genuine professional admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-jr-ntr-war-2-trailer-to-release-on-this-day-mark-your-calendars-2759407-2025-07-22",
      "headline": "Hrithik Roshan-Jr NTR's War 2 trailer to release on this day - mark your calendars!The trailer for 'War 2', starring Hrithik Roshan, Jr NTR and Kiara Advani, will release this month. The film is set for a grand release on August 14 as a big Independence Day experience. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-resignation-vice-president-reasons-theories-bihar-elections-snub-2759444-2025-07-22",
      "headline": "3 theories floating on Jagdeep Dhankhar's shock exit as Vice PresidentOn Monday, in a surprising move, Jagdeep Dhankhar resigned as Vice President, citing health concerns. The reason, however, had few takers. It has led to a flurry of speculation in political circles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-got-many-opportunities-to-serve-country-wish-him-good-health-pm-after-veeps-resignation-2759439-2025-07-22",
      "headline": "He got many opportunities to serve India: PM after Jagdeep Dhankhar's resignationVice President Jagdeep Dhankhar resignation on the opening day of the Monsoon Session has sparked a political storm, with opposition parties expressing bafflement over the sudden move.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delay-apache-indian-army-aviation-corps-united-states-2759452-2025-07-22",
      "headline": "Apache helicopters finally arrive after 15-month delay, Army hails milestone momentSources aware of the schedule have confirmed that the freshly received helicopters are to be assembled and inspected before they are handed to the Indian Army's Aviation Corps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iconic-fighter-jet-mig-21-to-retire-after-62-years-ceremonial-send-off-on-september-19-2759481-2025-07-22",
      "headline": "Fighter jet MiG-21 to be retired after 62 years, ceremonial send-off in SeptemberThe iconic fighter jet MiG-21, which was key in major conflicts, including the 1965 and 1971 wars, the Kargil War, and Operation Sindoor, is set to be retired by the Indian Air Force."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-saiyaara-winning-hearts-and-the-box-office-is-it-that-good-decoding-aahaan-panday-aneet-padda-film-success-among-gen-z-2759519-2025-07-22",
      "headline": "Why is Saiyaara winning hearts (and the box office)?In a world constantly chasing virality, 'Saiyaara' chooses vulnerability. It doesn't offer a spectacle - it offers sincerity. And if you are still wondering why it's working, here's what you probably don't know. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-collapsed-during-an-event-in-delhi-rajya-sabha-parliament-vice-president-resignation-lok-sabha-monsoon-2759496-2025-07-22",
      "headline": "Jagdeep Dhankhar collapsed at Delhi event days before shock resignation: SourcesJagdeep Dhankhar had collapsed during an event in Delhi on July 17, days before his resignation as Vice President citing health reasons, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-aide-lindsey-graham-warns-india-china-on-russia-ties-2759522-2025-07-22",
      "headline": "Will crush your economy: Trump aide's warning to India, China on Russia tiesUS Senator Lindsey Graham issued a direct warning to India, China and Brazil for importing oil from Russia and said \"we will crush your economies\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-rivals-ideate-nitish-kumar-inks-the-script-behind-the-bihar-election-sop-story-2025-bihar-assembly-elections-2759029-2025-07-21",
      "headline": "What rivals ideate, Nitish inks: The script behind the Bihar election sop storyCall him a borrower of plans or a master of the political long game, Nitish Kumar may well be turning Opposition blueprints into a poll-winning manifesto of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-entry-india-problem-competition-model-y-price-ev-sector-news-mahindra-tata-mg-2759556-2025-07-22",
      "headline": "Why Tesla's ride into India's EV market won't be a smooth oneTesla's entry comes at a time when it is facing its biggest drop in global sales to date. Its domestic sales in the US fell 6.3% in the second quarter of 2025, the third straight quarterly decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/women-forced-to-use-toilets-in-front-of-men-report-on-us-detention-centres-miami-florida-illegal-immigrants-america-2759467-2025-07-22",
      "headline": "Women forced to use toilets in front of men: Report on US detention centresA recent report on US immigration detention centres has uncovered disturbing conditions, including claims that women at a Miami facility were forced to use toilets in full view of male detainees. The report details widespread abuse, neglect, and humiliation across multiple centres. Detainees also described being shackled and made to eat \"like dogs\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-dare-kerala-congress-snub-party-events-friction-2759558-2025-07-22",
      "headline": "What is their party position? Shashi Tharoor on snub by Kerala CongressShashi Tharoor attempted to play down the apparent tensions with the Congress leadership even as he took a swipe at the party's Kerala unit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-meme-on-taking-ranveer-singh-opinion-is-every-couple-ever-2759447-2025-07-22",
      "headline": "Deepika's meme about taking Ranveer's advice has every couple relatingDeepika Padukone shared a funny meme about asking Ranveer Singh's opinion after already making a decision, giving fans a peek into their playful relationship. The couple, who became parents last year, often share light-hearted moments that fans love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-royal-navys-f-35-flies-out-of-keralas-thiruvananthapuram-airport-after-being-stranded-for-37-days-2759389-2025-07-22",
      "headline": "After month-long snag in Kerala, British F-35 fighter jet finally flies homeAfter being grounded for over a month due to a technical glitch, the British F-35 fighter jet stationed at Thiruvananthapuram International Airport finally flies back home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-issues-found-air-india-completes-fuel-control-switch-inspection-of-boeing-787-737-fleets-2759507-2025-07-22",
      "headline": "No issues found: Air India completes fuel control switch checks on Boeing fleetAir India says it has found no faults in the fuel control switch locking mechanism across its Boeing 787 and 737 fleets, after inspections ordered by the aviation watchdog following the June 12 Ahmedabad plane crash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-urinating-inside-virar-apartment-lift-viral-video-maharashtra-2759397-2025-07-22",
      "headline": "Blinkit delivery agent caught urinating inside lift in shocking video from MaharashtraA video of a Blinkit delivery agent urinating inside a lift of an apartment complex in Maharashtra's Virar went viral. The incident left the building's residents furious, creating a tense situation in the complex."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-shubhanshu-shukla-shows-his-recovery-regimen-after-space-mission-2759497-2025-07-22",
      "headline": "Video: Shux going through intense recovery regimen after space missionKnown for his calm demeanour and passion for space exploration, Shukla described the profound effects of microgravity on the human body during spaceflight and the challenges faced upon returning to Earth's gravity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bengaluru-court-restrains-defamatory-posts-on-dharmasthala-temple-religious-head-veerendra-heggade-family-2759430-2025-07-22",
      "headline": "Bengaluru court issues gag order in Dharmasthala mass burial claims caseFollowing an FIR over alleged mass burials near Dharmasthala, a Bengaluru civil court has barred 338 people and media outlets from posting defamatory content against the temple and its trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-rajya-sabha-business-advisory-jp-nadda-kiren-rijiju-parliament-2759363-2025-07-22",
      "headline": "Was Jagdeep Dhankhar snubbed? Ministers' no-show at meet fuels resignation rowJagdeep Dhankhar was allegedly disappointed over the absence of key ministers JP Nadda and Kiren Rijiju at the crucial Business Advisory Committee meeting on Monday evening.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-are-what-we-think-how-to-rewire-the-brain-change-our-future-2759025-2025-07-21",
      "headline": "We are what we think: How to rewire the brain, change our futureFive ways to break out of deep-seated, limiting notions and embrace life-changing personal growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/uorfi-javed-botched-lip-viral-video-what-to-keep-in-mind-before-getting-a-lip-filler-2759150-2025-07-22",
      "headline": "What to keep in mind before getting a lip filler?The stigma associated with beauty-enhancement cosmetic procedures, such as lip fillers and Botox, has subsided over time. Celebrities now openly discuss it even when it goes wrong (Uorfi Javed, for instance).  If you are someone planning to get one, there are things that you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-carens-clavis-ev-review-first-drive-is-this-the-family-ev-india-has-been-waiting-for-2759434-2025-07-22",
      "headline": "Kia Carens Clavis EV review, first drive: Family EV India has been waiting for?Kia has launched the electric version of their recently introduced MPV, the Carens Clavis. So is this the everyday EV India has been waiting for? We find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhars-recent-remarks-in-focus-after-sudden-exit-will-retire-in-august-2027-2759468-2025-07-22",
      "headline": "Will retire in 2027: Jagdeep Dhankhar's 10-day-old video in focus after sudden exitA video of Vice President Jagdeep Dhankhar saying he would retire in 2027 has resurfaced amid speculation over his sudden resignation citing medical reasons. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhangur-baba-panama-shell-company-money-laundering-naveen-rohra-2759548-2025-07-22",
      "headline": "Chhangur Baba's Panama link: ED traces offshore shell company as probe deepensDocuments reveal Chhangur Baba's aide Naveen Rohra controlled a Panama shell company. This raises suspicions of extensive money laundering involving foreign nationals and crores of rupees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-calls-trivikram-srinivas-godsend-explains-reasons-for-choosing-remakes-2759555-2025-07-22",
      "headline": "Pawan Kalyan calls Trivikram a godsend, explains reasons for choosing remakesAs 'Hari Hara Veera Mallu Part-1' inches closer to release, Pawan Kalyan has joined the promotions. At the pre-release event in Hyderabad on July 21, the actor-politician spoke about how personal and professional challenges shaped his choices, from embracing remakes to his enduring bond with director Trivikram Srinivas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-director-ashwin-kumar-want-to-see-hrithik-roshan-ias-nataraja-2759567-2025-07-22",
      "headline": "Mahavatar Narsimha director Ashwin Kumar: Want to see Hrithik Roshan ias NatarajaFilmmaker Ashwin Kumar is set to release his debut mythological epic 'Mahavatar Narsimha' on July 25. He also shares exciting updates on two more live-action mythological projects featuring Hrithik Roshan in a divine role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-saiyaara-sleeper-hit-revives-classic-bollywood-romance-newcomers-2759535-2025-07-22",
      "headline": "Mohit Suri says big filmmakers warned him against making a love story with newcomersMohit Suri reveals how Saiyaara became a sleeper hit despite industry doubts. The film challenges current action trends by reviving a classic romantic genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-saiyaara-winning-hearts-and-the-box-office-is-it-that-good-decoding-aahaan-panday-aneet-padda-film-success-among-gen-z-2759519-2025-07-22",
      "headline": "Why is Saiyaara winning hearts (and the box office)?In a world constantly chasing virality, 'Saiyaara' chooses vulnerability. It doesn't offer a spectacle - it offers sincerity. And if you are still wondering why it's working, here's what you probably don't know. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-body-transformation-diet-naushad-khan-reveals-2759583-2025-07-22",
      "headline": "No roti and rice: Inside Sarfaraz Khan's incredible body transformationSarfaraz Khan's father revealed the strict diet plan the 27-year-old has been following as he has shed close to 17 kilos over the course of the past two months. Sarfaraz is aiming to continue to work on his physique in a bid to return to the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-washington-open-doubles-2759542-2025-07-22",
      "headline": "45-year-old Venus Williams makes stunning comeback in Washington OpenWashington Open: Venus Williams and Hailey Baptiste defeated Eugenie Bouchard and Clervie Ngounoue 6-3, 6-1 in the Round of 16 of the women's doubles on Monday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-hs-prannoy-advances-five-match-points-lakshya-sen-exits-2759514-2025-07-22",
      "headline": "HS Prannoy advances after saving five match points, Lakshya Sen exitsIndian shuttler HS Prannoy saved five match points and clawed his way back from a game down to beat Japan's Koki Watanabe in the opening round of the China Open Super 1000 badminton tournament on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-u17-wrestling-team-greece-visa-delay-world-championship-athens-2759512-2025-07-22",
      "headline": "Indian U17 wrestling team faces visa delay ahead of World ChampionshipIndia's cadet wrestling team faces the risk of missing the U17 World Championships in Athens, as a long visa delay from the Greece embassy threatens to derail months of preparation and selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-decider-england-vs-india-record-2759511-2025-07-22",
      "headline": "Harmanpreet eyes major landmark as India gear up for ODI deciderENG-W vs IND-W: Harmanpreet Kaur is on the cusp of reaching the landmark of 4000 runs in Women's ODIs. She will get her chance in the third ODI on Saturday in Chester-le-Street. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-sudarshan-gopaladesikan-indian-origin-technical-director-2759503-2025-07-22",
      "headline": "Who is Sudarshan Gopaladesikan? Newcastle's Indian-origin technical directorSudarshan Gopaladesikan's appointment as Newcastle United's Technical Director marks a rare breakthrough for Indian-origin professionals in the Premier League, highlighting the growing influence of Indian talent in elite football's backroom and performance spaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-r-ashwin-on-anshul-kamboj-zaheer-bumrah-2759493-2025-07-22",
      "headline": "Anshul Kamboj belongs to same variety of pacers as Zaheer, Jasprit Bumrah: AshwinEngland vs India: Former India off-spinner R Ashwin believes uncapped pacer Anshul Kamboj belongs to a rare breed of fast bowlers, in the mould of Zaheer Khan and Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-aircrash-dhaka-school-t20i-series-2759485-2025-07-22",
      "headline": "Bangladesh cricketers to wear black armbands to mourn Dhaka school tragedyBAN vs PAK: Bangladesh cricketers will wear black armbands in the second T20I in respect of the victims of the tragic aircraft crash at Milestone School and College in Dhaka's Uttara area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-manchester-test-lords-hearbreak-india-eye-comeback-2759478-2025-07-22",
      "headline": "Can India bounce back in England after Lord's heartbreak?England vs India: After the Lord's heartbreak, the Shubman Gill-led Indian side must regroup quickly to script a historic comeback in the final two Tests. India have suffered twin injury setbacks ahead of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-start-august-2-women-competition-august-17-2759464-2025-07-22",
      "headline": "Delhi Premier League to start on August 2, women's competition from August 17The second edition of the Delhi Premier League (DPL) is set to kick off on August 2 with a grand Opening Ceremony, followed by the first men's match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-youth-fitness-sport-2759443-2025-07-22",
      "headline": "Lots of people don't play sport: MS Dhoni on declining youth fitnessMS Dhoni said that the fitness of people in India is going down since they don't play enough sports. The veteran was amongst India's fittest cricketers, having won three ICC titles as captain from 2007 to 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-r-ashwin-on-anshul-kamboj-zaheer-bumrah-2759493-2025-07-22",
      "headline": "Anshul Kamboj belongs to same variety of pacers as Zaheer, Jasprit Bumrah: AshwinEngland vs India: Former India off-spinner R Ashwin believes uncapped pacer Anshul Kamboj belongs to a rare breed of fast bowlers, in the mould of Zaheer Khan and Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-cricketers-aircrash-dhaka-school-t20i-series-2759485-2025-07-22",
      "headline": "Bangladesh cricketers to wear black armbands to mourn Dhaka school tragedyBAN vs PAK: Bangladesh cricketers will wear black armbands in the second T20I in respect of the victims of the tragic aircraft crash at Milestone School and College in Dhaka's Uttara area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-manchester-test-lords-hearbreak-india-eye-comeback-2759478-2025-07-22",
      "headline": "Can India bounce back in England after Lord's heartbreak?England vs India: After the Lord's heartbreak, the Shubman Gill-led Indian side must regroup quickly to script a historic comeback in the final two Tests. India have suffered twin injury setbacks ahead of the Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-start-august-2-women-competition-august-17-2759464-2025-07-22",
      "headline": "Delhi Premier League to start on August 2, women's competition from August 17The second edition of the Delhi Premier League (DPL) is set to kick off on August 2 with a grand Opening Ceremony, followed by the first men's match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-youth-fitness-sport-2759443-2025-07-22",
      "headline": "Lots of people don't play sport: MS Dhoni on declining youth fitnessMS Dhoni said that the fitness of people in India is going down since they don't play enough sports. The veteran was amongst India's fittest cricketers, having won three ICC titles as captain from 2007 to 2013. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}