{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-code-explained-pay-structure-in-hand-salary-rise-fall-impact-basic-pf-deduction-2824336-2025-11-22",
      "headline": "New labour codes are here: Will your in-hand salary rise or fall?With the new labour codes now implemented, many employees are trying to understand what it means for their salary structure, especially basic salary, PF deductions and take-home pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-changes-paid-leaves-working-hours-health-coverage-old-vs-new-laws-2824290-2025-11-22",
      "headline": "New labour codes: What changes for paid leave, work hours and health benefitsThe new labour codes apply across sectors and are designed to improve safety, reduce fatigue and make workplaces more predictable for millions of workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gratuity-new-labour-codes-law-fixed-term-employees-explained-2824241-2025-11-22",
      "headline": "Gratuity in a year? Only if you're a fixed-term employee. Here's what it meansOnly employees hired on fixed-term contracts qualify for the new one-year gratuity rule. Permanent staff remain under the five-year norm, making this benefit exclusive to India's expanding fixed-term workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-codes-laws-explained-from-gratuity-to-gig-worker-insurance-2824221-2025-11-22",
      "headline": "From gratuity to gig worker insurance: What new labour laws mean for employeesFrom gratuity to insurance and safer workplaces, the new rules expand what employees can expect from their jobs. Staying informed will help workers make the most of these changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/employees-to-get-gratuity-after-1-year-of-service-as-per-new-labour-law-overhaul-2824132-2025-11-21",
      "headline": "Fixed-term employees to get gratuity after 1 year of service under new labour lawsAccording to the Union Labour Ministry, the restructuring is aimed at ensuring better wages, wider social security coverage and improved health-related protections for workers across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-400-points-nifty-ends-above-26000-amid-volatile-trade-2823801-2025-11-21",
      "headline": "Sensex tumbles 400 points, Nifty ends above 26,000 amid volatile tradeThe S&P BSE Sensex fell more than 400 points to close at 85,231, while the NSE Nifty50 managed to stay above the 26,000 mark despite broad-based weakness across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-implements-four-labour-codes-replacing-29-old-laws-check-details-2823795-2025-11-21",
      "headline": "Government implements four labour codes, replacing 29 old laws. Check detailsThe move brings together decades-old labour rules that were scattered across multiple legislations into a consolidated framework. Many of these older laws date back to the pre-Independence and early post-Independence era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-to-record-low-of-rs-8945-amid-us-india-trade-uncertainty-2823785-2025-11-21",
      "headline": "Rupee slides to record low of Rs 89.45 amid US-India trade uncertaintyThe outlook for the rupee remains uncertain as global risk sentiment stays fragile and investors wait for clearer signals from both the Fed and ongoing trade negotiations between Washington and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-fully-subscribed-on-day-1-check-latest-gmp-and-other-2823780-2025-11-21",
      "headline": "Sudeep Pharma IPO fully subscribed on day 1. Check latest GMP and otherThe issue, priced between Rs 563 and Rs 593, saw a clear surge from retail and high-net-worth investors, allowing the company to cross the one-time subscription mark even though institutional participation remained weak through the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-gmp-social-media-hype-retail-investors-explained-2823730-2025-11-21",
      "headline": "How GMP and social media hype mislead so many first-time investorsThe Great IPO Gamble series ends here, and in part 3, we break down how GMP and social media hype influence first-time investors. A look at the noise behind the numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-customer-data-restaurants-controversy-privacy-concerns-2823623-2025-11-21",
      "headline": "Recipe for trouble? Zomato's customer data move stirs up controversyZomato controversy: Food delivery giant Zomato has decided to share customer data with restaurants after years of tussle. Politicians and marketing gurus have called it a recipe for trouble, expressing concerns about data privacy and spam messages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/reliance-industries-halts-russian-oil-imports-at-jamnagar-refinery-amid-sanctions-ytvd-2823600-2025-11-21",
      "headline": "Russian Oil: Reliance Halts Russian Crude Imports at Jamnagar SEZ RefineryThis report covers Reliance Industries' decision to halt the import of Russian crude oil for its export-oriented refinery in Jamnagar, Gujarat. The move is in compliance with European Union and United States sanctions targeting Russian oil majors Rosneft and Lukoil, with a wind-down period ending November 21. Reliance stated, 'we'll stay aligned with government's policy.' The company will now source crude from other regions, including West Asia and the EU, for its Special Economic Zone (SEZ) refinery, with all exports to be derived from non-Russian oil starting December 1. The decision impacts a long-term deal between Reliance and Rosneft for the supply of crude oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-power-share-price-falls-after-rally-profit-taking-2823589-2025-11-21",
      "headline": "JP Power share price tumbles 7% after strong rally. Why is it down today?The JP Power share price dip reflects profit-taking after a steep run, as the market waits for clearer evidence that the broader group's restructuring will lift the company's long-term fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-rises-after-two-day-fall-q2-results-why-billionbrains-stock-up-2823581-2025-11-21",
      "headline": "Groww shares jump nearly 7% after two-day tumble: What's driving today's rally?Around 10:03 am, the shares of the company were trading 6.30% higher at Rs 166.44 on the Bombay Stock Exchange (BSE). The rebound comes amid growing anticipation around Groww's performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-26200-hindalco-down-nearly-3-2823559-2025-11-21",
      "headline": "Sensex, Nifty fall in early trade as hopes of US rate cut fadeAround 9:23 am, the S&P BSE Sensex was down 131 points at 85,501.03, while the NSE Nifty50 slipped 40.70 points to 26,151.45. Volatility was high in early trade and all major sectoral indices were in the red, reflecting the cautious mood on Dalal Street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-halts-russian-crude-jamnagar-sez-refinery-eu-sanctions-glbs-2823492-2025-11-21",
      "headline": "Reliance ends use of Russian crude for exports to comply with EU sanctionsReliance's decision shows how quickly the global rules around Russian oil are changing, and how Indian refiners are now being pushed to realign their supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-group-says-ed-attached-assets-belong-to-rcom-not-part-of-group-since-2019-2823468-2025-11-20",
      "headline": "Reliance Group says ED-attached assets belong to RCom, not part of group since 2019The ED, meanwhile, detailed its searches across Tamil Nadu in a land-forgery and inflated compensation scam involving forged deeds, dummy buyers and layered transactions, seizing and freezing assets worth Rs 18.10 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-you-get-itr-refund-december-2025-cbdt-chairman-ravi-agrawal-delay-reason-2823254-2025-11-20",
      "headline": "Waiting for your tax refund? Here's why it's delayed and when it may arriveAccording to the Income Tax Department, more than 7.57 crore returns were filed by September 23, yet refunds for many taxpayers remain pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-nearly-450-points-higher-nifty-nears-life-time-high-2823139-2025-11-20",
      "headline": "Sensex ends nearly 450 points higher, Nifty nears life-time highThe S&P BSE Sensex rose 446.21 points to close at 85,632.68, while the NSE Nifty50 climbed 139.50 points to finish at 26,192.15. Broader indices were mixed, but the tone across frontline stocks remained firmly positive, led by gains in heavyweight financial counters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-500-points-nifty-nears-life-time-high-whats-driving-the-rally-2823064-2025-11-20",
      "headline": "Sensex surges 500 points, Nifty nears life-time high. What's driving the rally?At 1.58 am, the S&P BSE Sensex was up 526.63 points to 85,713.10, while the NSE Nifty50 hit a fresh 52-week high and was nearing an all-time high of 26,277. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/delhi-air-pollution-crisis-worsens-kriti-sanon-calls-urgent-government-action-2824516-2025-11-22",
      "headline": "Kriti Sanon addresses Delhi's air quality: Something needs to be done to stop it Amid persistent hazardous air quality in Delhi, actor Kriti Sanon called for urgent action, describing the situation as deteriorating and potentially dire if measures are not implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ronit-roy-takes-break-from-social-media-for-self-care-and-mental-well-being-2824510-2025-11-22",
      "headline": "Ronit Roy announces social media break: Feeling the need to disconnect Actor Ronit Roy has informed fans of his decision to step back from social media, citing the need for personal time and self-reflection. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-tribute-26-11-pahalgam-terror-attack-victims-urges-peace-india-2824506-2025-11-22",
      "headline": "SRK honours 26/11, Pahalgam and Delhi blast victims, urges unity. Watch At the Global Peace Honours 2025 in Mumbai, actor Shah Rukh Khan paid tribute to victims of recent attacks and emphasised the importance of peace and unity in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-suffers-toe-fracture-on-eetha-sets-shoot-put-on-hold-source-2824503-2025-11-22",
      "headline": "Shraddha Kapoor suffers toe fracture on Eetha sets, shoot put on hold: Source Actor Shraddha Kapoor has sustained an injury while shooting for Laxman Utekar's upcoming film 'Eetha.' Following her toe fracture, the shoot was temporarily put on hold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranbir-kapoor-rom-com-reunion-bollywood-fan-excitement-2824485-2025-11-22",
      "headline": "Deepika Padukone reacts to a fan's request for a rom-com with Ranbir Kapoor Deepika Padukone recently reacted to a fan's social media reel requesting the actor for a rom-com with Ranbir Kapoor after 'Yeh Jawani Hai Deewani'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/b-praak-says-he-should-be-named-brand-ambassador-of-patriotic-songs-2824483-2025-11-22",
      "headline": "B Praak says he should be named brand ambassador of patriotic songs Singer B Praak, during his session at Sahitya AajTak 2025 in New Delhi, spoke about his fondness for patriotic songs. The singer even said that he should be declared the brand ambassador of the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-made-music-a-day-after-his-mother-died-papon-recalls-2824476-2025-11-22",
      "headline": "Zubeen Garg made music a day after his mother died, Papon recalls their bond Zubeen Garg started composing songs the day after his mother's death; Papon reveals how he became friends with the singer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/smriti-mandhana-mehendi-ceremony-celebrations-cricket-teammates-palash-muchhal-traditional-attire-2824466-2025-11-22",
      "headline": "Palash Muchhal and Smriti Mandhana's mehendi is all about love. Pics Indian cricketer Smriti Mandhana and music composer Palash Muchhal continued their wedding celebrations with a vibrant mehendi ceremony following the haldi event. Pictures from the pre-wedding festivties have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjabi-singer-harman-sidhu-dies-in-a-road-accident-at-37-2824453-2025-11-22",
      "headline": "Punjabi singer Harman Sidhu dies in a road accident at 37 Punjabi singer Harman Sidhu died in a road accident on the Mansa-Patiala road after his car collided with a truck. The singer died on the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-struggles-originality-myth-sahitya-aajtak-2025-2824445-2025-11-22",
      "headline": "I haven't written a single original song, says lyricist Manoj Muntashir Manoj Muntashir spoke about his journey and the myth of originality at Sahitya AajTak 2025. His reflections highlighted the importance of inspiration and learning in creative writing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adarsh-gourav-washed-dishes-for-rs-100-a-day-to-prep-for-the-white-tiger-2824436-2025-11-22",
      "headline": "Adarsh Gourav washed dishes for Rs 100 a day to prep for The White Tiger Actor Adarsh Gourav shared his intense preparation for 'The White Tiger', where he worked as a daily wage labourer to deeply understand his character Balram. At the stage of Sahitya Aaj Tak 2025, the actor was joined by Anya Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-aryan-khan-is-extremely-clear-headed-hardworking-the-bads-of-bollywood-the-bastads-of-bollywood-2824435-2025-11-22",
      "headline": "Anya Singh praises Aryan Khan's nuanced direction on The Ba***ds of Bollywood During her session at Sahitya AajTak 2025, actor Anya Singh shared her experience of working with director Aryan Khan in 'The Ba***ds of Bollywood.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/telugu-film-industry-crackdown-on-ibomma-piracy-operator-boosts-anti-piracy-efforts-2824413-2025-11-22",
      "headline": "Ram Gopal Varma lashes out at iBomma supporters over piracy debate Filmmaker Ram Gopal Varma, in a post, suggested criminalising viewers of pirated content. The Telugu film industry and police have intensified efforts against piracy, following the arrest of Immadhi Ravi, alleged operator of the iBomma site. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nepotism-helps-with-entry-not-success-actor-amol-palekar-on-bollywoods-reality-2824421-2025-11-22",
      "headline": "Nepotism helps with entry, not success: Actor Amol Palekar on Bollywood's reality At Sahitya Aaj Tak 2025, veteran actor and filmmaker Amol Palekar said nepotism may open doors, but only talent and hard work lead to real success. He also urged audiences to measure films beyond box office numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-wants-to-play-srikant-in-the-family-man-film-manoj-bajpayee-reacts-2824396-2025-11-22",
      "headline": "Jaideep Ahlawat wants to play Srikant in The Family Man film, Manoj Bajpayee reacts In an exclusive interview with India Today, 'The Family Man 3' team spoke about their plans of converting the popular series into a film like 'Mirzapur.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-meri-main-tera-main-tera-tu-meri-teaser-kartik-ananya-promise-sparks-and-christmas-love-whirlwind-2824367-2025-11-22",
      "headline": "Tu Meri Main Tera teaser: Kartik, Ananya promise sparks and Christmas mush The teaser for 'Tu Meri Main Tera Main Tera Tu Meri', starring Kartik Aaryan and Ananya Panday, has been released, offering audiences a glimpse into a holiday romance set to premiere on December 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-turns-35-naagzilla-set-viral-birthday-celebration-renewed-collaboration-karan-johar-2824360-2025-11-22",
      "headline": "Kartik Aaryan celebrates birthday on Naagzilla set, grooves to Bhojpuri hits Actor Kartik Aaryan celebrated his 35th birthday on November 22 while working on the set of his upcoming film 'Naagzilla'. Several pictures and videos of the actor's dance performance on the set have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-last-samurai-standings-junichi-okada-studies-indian-films-heres-why-2824357-2025-11-22",
      "headline": "Exclusive: Last Samurai Standing's Junichi Okada studies Indian films; here's why With 'Last Samurai Standing', Japan brings a survival-action drama rooted in physical performance and traditional craft, earning early comparisons to 'Squid Game'. Lead actor Junichi Okada highlights minimal CGI and real effort, hoping the series connects with Indian audiences and sparks cultural collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-plan-2-review-wahlberg-monaghan-christmas-film-loses-narrative-spark-2824258-2025-11-22",
      "headline": "The Family Plan 2 review: Wahlberg, Monaghan's Christmas film loses narrative sparkRelease Date:Fri Nov 21, 2025 'The Family Plan 2' offers formulaic holiday fun, powered by the effortless chemistry between Mark Wahlberg and Michelle Monaghan. Although the film struggles with predictable tropes and pacing, it ultimately anchors its charm in the warm, dysfunctional family dynamics rather than groundbreaking action or narrative risk."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/leadership-change-just-speculation-karnataka-chief-minister-siddaramaiah-after-meet-with-congress-chief-mallikarjun-kharge-2824511-2025-11-22",
      "headline": "Leadership change just speculation: Siddaramaiah after meet with Congress chiefKarnataka Chief Minister Siddaramaiah met Congress National President Mallikarjun Kharge to discuss party organisation and upcoming local elections, dismissing rumours of leadership change as media speculation. He emphasised unity within the party and readiness to accept decisions from the high command."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/g20-summit-joint-declaration-says-no-nation-should-use-threat-or-force-for-territorial-expansions-2824514-2025-11-22",
      "headline": "No nation should use threat or force for territorial expansions: G20 declarationThe Declaration notes that global instability, rising geo-economic competition and widening inequality are threatening inclusive growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejas-fighter-jet-crash-new-video-last-moments-pilot-ejection-attempt-2824338-2025-11-22",
      "headline": "New, clear Tejas jet crash video suggests pilot tried to eject last minuteTejas jet crash: The Tejas jet of the IAF was executing a low-altitude aerobatic manoeuvre when it went down at the Dubai Airshow, erupting into a massive fireball. The new video provides a clear picture of what transpired in the final moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dedicated-pilot-with-unyielding-sense-of-duty-iafs-tribute-to-wing-commander-namansh-syal-after-tejas-crash-2824479-2025-11-22",
      "headline": "Dedicated pilot, exceptional skill: IAF's tribute to pilot killed in Tejas crashThe Indian Air Force mourns the loss of Wing Commander Namansh Syal, a brave and dedicated pilot who tragically died in a Tejas fighter jet crash at the Dubai Air Show. His courage and commitment to duty have left a lasting legacy honoured by the nation and international community.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/smriti-mandhana-mehendi-ceremony-celebrations-cricket-teammates-palash-muchhal-traditional-attire-2824466-2025-11-22",
      "headline": "Palash Muchhal and Smriti Mandhana's mehendi is all about love. PicsIndian cricketer Smriti Mandhana and music composer Palash Muchhal continued their wedding celebrations with a vibrant mehendi ceremony following the haldi event. Pictures from the pre-wedding festivties have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-ruled-out-odi-series-sources-rishabh-pant-kl-rahul-2824500-2025-11-22",
      "headline": "Shubman Gill ruled out of ODI series vs South Africa due to neck injury: SourcesShubman Gill's neck injury has ruled him out of the ODI series against South Africa, forcing India into a sudden leadership rethink. With the BCCI meeting looming, Rishabh Pant and KL Rahul now lead the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lost-in-translation-indian-techie-terrified-after-uber-drivers-message-misreads-as-threat-2824315-2025-11-22",
      "headline": "Lost in translation: Indian techie terrified after Uber driver's message misreads as threatA Meta techie's Uber ride turned frightening due to a wrong auto-translated message from the driver, and no one was prepared for what the original message from the driver was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-suffers-toe-fracture-on-eetha-sets-shoot-put-on-hold-source-2824503-2025-11-22",
      "headline": "Shraddha Kapoor suffers toe fracture on Eetha sets, shoot put on hold: SourceActor Shraddha Kapoor has sustained an injury while shooting for Laxman Utekar's upcoming film 'Eetha.' Following her toe fracture, the shoot was temporarily put on hold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-bollywood-stars-netra-mantena-vamsi-gadiraju-wedding-udaipur-2824164-2025-11-22",
      "headline": "Ranveer Singh, Trump Jr trend, Janhvi and Shahid perform at billionaire weddingBollywood celebrities and international stars gathered in Udaipur for the lavish wedding of US-based billionaire Padmaja and Rama Raju Mantena's daughter, Netra. Ranveer Singh and other performers entertained guests, including Donald Trump Jr and Bettina Anderson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pulwama-electrician-detained-in-red-fort-blast-case-his-suspected-jaish-links-under-probe-2824449-2025-11-22",
      "headline": "J&K electrician detained in Delhi blast case, suspected Jaish links under probeSources say the investigation has uncovered strong leads suggesting his involvement in the conspiracy, prompting deeper scrutiny of his role in the network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-squad-selection-south-africa-captaincy-kl-rahul-rishabh-pant-2824482-2025-11-22",
      "headline": "Rishabh Pant or KL Rahul? BCCI set to pick captain for South Africa ODIs on SundayIND vs SA: BCCI will meet on Sunday to pick India's white-ball squads for the home series against South Africa, with Shubman Gill and Shreyas Iyer unavailable and the captaincy choice likely coming down to KL Rahul or Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanjay-raut-shiv-sena-maharashtra-navnirman-sena-together-congresss-reluctance-raj-thackeray-2824499-2025-11-22",
      "headline": "Sanjay Raut's 'Delhi orders' dig amid Congress' resistance to Uddhav Sena–MNS pactRaut stressed that the Congress's decision to ally with the MNS only after a nod from \"Delhi\" is their individual decision and does not affect the Uddhav Sena's poll plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bhopal/story/20-men-storm-gated-colony-in-bhopal-assault-four-over-minor-car-dispute-2824468-2025-11-22",
      "headline": "20 men storm gated colony in Bhopal, assault four over minor car crash disputeVisuals from the spot showed the assailants knocking the young men to the ground and beating them mercilessly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/chief-justice-gavai-tenure-saw-24-obc-minority-judges-cleared-for-high-courts-2824508-2025-11-22",
      "headline": "Chief Justice Gavai's stint saw 24 OBC, minority judges cleared for high courtsDuring CJI Gavai's tenure, 10 judges from the Scheduled Caste community, 11 from Other Backward Classes and Backward Classes, and 13 from minority communities were appointed to various high courts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-afghanistan-boost-trade-via-sea-air-iran-chabahar-port-taliban-delhi-visit-commerce-minister-nooruddin-azizi-pakistan-2823938-2025-11-22",
      "headline": "How Taliban are planning trade with India via air and sea to bypass PakistanIndia and Afghanistan are set to deepen trade ties through Iran's Chabahar port and new cargo flights from Delhi and Amritsar to Kabul. The move, announced during Afghan Trade Minister Nooruddin Azizi's visit, includes commercial attaches, investment incentives, and streamlined logistics. Kabul is shifting away from Islamabad to boost exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/do-iv-drips-belong-at-weddings-the-risks-are-too-serious-to-ignore-2823940-2025-11-22",
      "headline": "Do IV drips belong at weddings? The risks are too serious to ignoreIf you spot an IV drip bar at the next wedding you attend, think twice before signing up as it could lead to serious health risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-545-21-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adarsh-gourav-washed-dishes-for-rs-100-a-day-to-prep-for-the-white-tiger-2824436-2025-11-22",
      "headline": "Adarsh Gourav washed dishes for Rs 100 a day to prep for The White TigerActor Adarsh Gourav shared his intense preparation for 'The White Tiger', where he worked as a daily wage labourer to deeply understand his character Balram. At the stage of Sahitya Aaj Tak 2025, the actor was joined by Anya Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nepotism-helps-with-entry-not-success-actor-amol-palekar-on-bollywoods-reality-2824421-2025-11-22",
      "headline": "Nepotism helps with entry, not success: Actor Amol Palekar on Bollywood's realityAt Sahitya Aaj Tak 2025, veteran actor and filmmaker Amol Palekar said nepotism may open doors, but only talent and hard work lead to real success. He also urged audiences to measure films beyond box office numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-tribute-26-11-pahalgam-terror-attack-victims-urges-peace-india-2824506-2025-11-22",
      "headline": "SRK honours 26/11, Pahalgam and Delhi blast victims, urges unity. WatchAt the Global Peace Honours 2025 in Mumbai, actor Shah Rukh Khan paid tribute to victims of recent attacks and emphasised the importance of peace and unity in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/surat-woman-jumps-to-her-death-from-rooftop-cafe-two-months-before-wedding-2824498-2025-11-22",
      "headline": "Surat woman jumps to her death from rooftop cafe two months before weddingThe woman was set to get engaged and married in January 2026. She often visited the cafe with her fiance and ended her life by jumping from the same place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/congress-forms-five-member-committee-to-hold-seat-sharing-talks-with-dmk-for-2026-assembly-polls-2824471-2025-11-22",
      "headline": "Congress forms panel to hold seat-sharing talks with DMK for 2026 Tamil Nadu pollsThe Congress team tasked with holding talks with the ruling DMK will be led by the party in-charge for Tamil Nadu and Puducherry, Girish Chodankar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-woman-alleges-man-used-marriage-pretext-to-sexually-abuse-her-steal-gold-2824464-2025-11-22",
      "headline": "Woman alleges sex exploitation by partner for 5 years on pretext of marriageA woman from Muzaffarpur has accused her partner of exploiting her for five years under the false promise of marriage, involving sexual abuse and theft of gold jewellery. The case has sparked a police investigation highlighting growing concerns over exploitation via social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/delhi-air-pollution-crisis-worsens-kriti-sanon-calls-urgent-government-action-2824516-2025-11-22",
      "headline": "Kriti Sanon addresses Delhi's air quality: Something needs to be done to stop itAmid persistent hazardous air quality in Delhi, actor Kriti Sanon called for urgent action, describing the situation as deteriorating and potentially dire if measures are not implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-tribute-26-11-pahalgam-terror-attack-victims-urges-peace-india-2824506-2025-11-22",
      "headline": "SRK honours 26/11, Pahalgam and Delhi blast victims, urges unity. WatchAt the Global Peace Honours 2025 in Mumbai, actor Shah Rukh Khan paid tribute to victims of recent attacks and emphasised the importance of peace and unity in India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-guwahati-test-run-deep-ryan-ten-doeschate-press-conference-day-1-2824520-2025-11-23",
      "headline": "Guwahati Test will run deep: India assistant coach Ryan ten Doeschate IND vs SA: India assistant coach Ryan ten Doeschate emphasised that the Guwahati Test against South Africa has shown all the likeliness to run deep, unlike how quickly the first Test panned out in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-palash-muchhal-pre-wedding-cricket-match-celebration-2824519-2025-11-23",
      "headline": "Smriti Mandhana vs Palash Muchhal: Bride and groom clash in pre-wedding cricket match Indian women's cricketer Smriti Mandhana and music director Palash Muchhal played a bride-versus-groom cricket match as part of their pre-wedding celebrations ahead of their November 23 wedding. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ryan-ten-doeschate-pitch-row-guwahati-test-gautam-gambhir-press-conference-2824517-2025-11-22",
      "headline": "After Gambhir and Kotak, India batting coach gives new verdict on IND vs SA pitch row IND vs SA: India's assistant coach Ryan ten Doeschate played down the pitch debate after Guwahati Day 1, insisting performance matters more than conditions. With India fighting back through Kuldeep and resilience, the focus has shifted back to cricket, not controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-ruled-out-odi-series-sources-rishabh-pant-kl-rahul-2824500-2025-11-22",
      "headline": "Shubman Gill ruled out of ODI series vs South Africa due to neck injury: Sources Shubman Gill's neck injury has ruled him out of the ODI series against South Africa, forcing India into a sudden leadership rethink. With the BCCI meeting looming, Rishabh Pant and KL Rahul now lead the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-sri-lanka-tri-series-win-farhan-nawaz-spin-sri-lanka-2824497-2025-11-22",
      "headline": "Farhan, Nawaz star as Pakistan crush listless Sri Lanka in T20I tri-series PAK vs ZIM: Pakistan climbed to the top of the T20I tri-series table with a commanding seven-wicket win over Sri Lanka, powered by Sahibzada Farhan's unbeaten 80 and Mohammad Nawaz's three-wicket haul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-tristan-stubbs-kuldeep-yadav-dismissal-guwahati-test-banter-2824496-2025-11-22",
      "headline": "Tristan Stubbs reveals fun banter with Kuldeep Yadav after Guwahati dismissal IND vs SA: Tristan Stubbs fell one short of a half-century after being undone by a drifting Kuldeep Yadav delivery in Guwahati. His dismissal shifted momentum as India restricted South Africa to 247/6 at stumps on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-squad-selection-south-africa-captaincy-kl-rahul-rishabh-pant-2824482-2025-11-22",
      "headline": "Rishabh Pant or KL Rahul? BCCI set to pick captain for South Africa ODIs on Sunday IND vs SA: BCCI will meet on Sunday to pick India's white-ball squads for the home series against South Africa, with Shubman Gill and Shreyas Iyer unavailable and the captaincy choice likely coming down to KL Rahul or Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-hopeful-for-ashes-comeback-australia-leads-series-2824478-2025-11-22",
      "headline": "Pat Cummins to return for Brisbane Test? Australia captain shares an update Pat Cummins is hopeful of returning for the second Ashes Test at the Gabba, even as Australia await an update on Josh Hazlewood's injury recovery following their dominant win in the Perth opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-unicycle-isl-chaos-leak-national-team-2824372-2025-11-22",
      "headline": "Indian football isn't a unicycle: ISL chaos now leaking into national team Indian football was sold a dream and handed uncertainty instead. As the ISL stumbles and the national team falls, the illusion is fading fast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-ashes-zak-crawley-duck-nasser-hussain-perth-loss-2824477-2025-11-22",
      "headline": "What should England do with Zak Crawley? Nasser Hussain calls it key issue after Perth loss Ashes 2025: Zak Crawley's twin failures in Perth have turned the spotlight on England's fragile top order. With Nasser Hussain urging patience, England now face a crucial call ahead of the Brisbane Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-century-usman-khawaja-australia-ashes-steve-smith-perth-test-2824473-2025-11-22",
      "headline": "Smith reveals how injured Khawaja sensed Head's heroics: One of the best back spasms Ashes: Australia benefited from an unexpected change at the top after Usman Khawaja's back spasm opened the door for Travis Head, whose blistering 123 powered them to an eight-wicket win in the Perth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-squad-selection-south-africa-captaincy-kl-rahul-rishabh-pant-2824482-2025-11-22",
      "headline": "Rishabh Pant or KL Rahul? BCCI set to pick captain for South Africa ODIs on Sunday IND vs SA: BCCI will meet on Sunday to pick India's white-ball squads for the home series against South Africa, with Shubman Gill and Shreyas Iyer unavailable and the captaincy choice likely coming down to KL Rahul or Rishabh Pant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-hopeful-for-ashes-comeback-australia-leads-series-2824478-2025-11-22",
      "headline": "Pat Cummins to return for Brisbane Test? Australia captain shares an update Pat Cummins is hopeful of returning for the second Ashes Test at the Gabba, even as Australia await an update on Josh Hazlewood's injury recovery following their dominant win in the Perth opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-unicycle-isl-chaos-leak-national-team-2824372-2025-11-22",
      "headline": "Indian football isn't a unicycle: ISL chaos now leaking into national team Indian football was sold a dream and handed uncertainty instead. As the ISL stumbles and the national team falls, the illusion is fading fast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-ashes-zak-crawley-duck-nasser-hussain-perth-loss-2824477-2025-11-22",
      "headline": "What should England do with Zak Crawley? Nasser Hussain calls it key issue after Perth loss Ashes 2025: Zak Crawley's twin failures in Perth have turned the spotlight on England's fragile top order. With Nasser Hussain urging patience, England now face a crucial call ahead of the Brisbane Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-century-usman-khawaja-australia-ashes-steve-smith-perth-test-2824473-2025-11-22",
      "headline": "Smith reveals how injured Khawaja sensed Head's heroics: One of the best back spasms Ashes: Australia benefited from an unexpected change at the top after Usman Khawaja's back spasm opened the door for Travis Head, whose blistering 123 powered them to an eight-wicket win in the Perth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravindra-jadeja-rajasthan-royals-homecoming-rockstar-vaibhav-suryavanshi-shane-warne-2824467-2025-11-22",
      "headline": "Returning where I started my journey: Ravindra Jadeja on Rajasthan Royals homecomingRavindra Jadeja says his return to Rajasthan Royals after fifteen years feels like a full-circle moment, taking him back to the franchise where he began his IPL journey and earned the nickname \"Rockstar.\" He discussed his bond with Shane Warne, working with RR's young core and how the trade back to Jaipur unfolded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-century-leads-australia-eight-wicket-ashes-win-perth-brendon-mccullum-2824455-2025-11-22",
      "headline": "Head's knock one of the best I've seen: McCullum stunned by batter's Perth heroicsAshes: Travis Head's extraordinary 123 off 83 balls earned high praise from England coach Brendon McCullum, who called it one of the best pressure innings he has ever seen after Australia cruised to an eight-wicket win in the Perth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-kuldeep-yadav-x-factor-pitch-ryan-ten-doeschate-press-conference-2824454-2025-11-22",
      "headline": "Kuldeep Yadav is India's X-factor on lifeless Guwahati pitch: Assistant coachIND vs SA: Kuldeep Yadav's three-wicket burst on a largely unresponsive Guwahati pitch kept India in control on Day 1 of the second Test. His strikes stalled South Africa's momentum and underlined his growing importance in India's red-ball plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-perth-test-michael-vaughan-slams-ben-stokes-bazball-competitive-without-brains-2824450-2025-11-22",
      "headline": "Vaughan rips into Bazball after Perth Test: Can't be competitive without brainsMichael Vaughan blasted England's approach after their Perth defeat, questioning their shot selection against Mitchell Starc and warning they \"can't be competitive without brains.\" The former captain said England must adapt their aggressive style or risk being \"hammered\" as the Ashes series moves to Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taijul-islam-bangladesh-test-wicket-record-ireland-mirpur-2824434-2025-11-22",
      "headline": "Taijul Islam scripts history as Bangladesh on cusp of series win over IrelandBAN vs IRE: Bangladesh tightened their grip on the Mirpur Test as Taijul Islam became the country's leading Test wicket-taker and reduced Ireland to 176/6, still 333 runs from their target of 509."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-ashes-perth-test-travis-head-reactions-indian-fans-2824429-2025-11-22",
      "headline": "Ashes: England have a Travis Head-ache and Indian fans aren't complainingAshes 2025: Whether in Ahmedabad or Perth, Travis Head has a habit of lighting up November. India exhaled this time — and England got a taste of the chaos he can create."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-travis-head-123-stuns-england-ben-stokes-perth-test-2824428-2025-11-22",
      "headline": "The Ashes: Ben Stokes left shell-shocked by Travis Head masterclass in Perth TestTravis Head blasted a stunning 123 off 83 balls to lead Australia to an eight-wicket win over England in the first Ashes Test in Perth. Ben Stokes admitted he was left \"shell-shocked\" by the innings as Australia chased 205 with ease to take a 1–0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-perth-test-michael-vaughan-slams-ben-stokes-bazball-competitive-without-brains-2824450-2025-11-22",
      "headline": "Vaughan rips into Bazball after Perth Test: Can't be competitive without brainsMichael Vaughan blasted England's approach after their Perth defeat, questioning their shot selection against Mitchell Starc and warning they \"can't be competitive without brains.\" The former captain said England must adapt their aggressive style or risk being \"hammered\" as the Ashes series moves to Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/taijul-islam-bangladesh-test-wicket-record-ireland-mirpur-2824434-2025-11-22",
      "headline": "Taijul Islam scripts history as Bangladesh on cusp of series win over IrelandBAN vs IRE: Bangladesh tightened their grip on the Mirpur Test as Taijul Islam became the country's leading Test wicket-taker and reduced Ireland to 176/6, still 333 runs from their target of 509."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-ashes-perth-test-travis-head-reactions-indian-fans-2824429-2025-11-22",
      "headline": "Ashes: England have a Travis Head-ache and Indian fans aren't complainingAshes 2025: Whether in Ahmedabad or Perth, Travis Head has a habit of lighting up November. India exhaled this time — and England got a taste of the chaos he can create."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-travis-head-123-stuns-england-ben-stokes-perth-test-2824428-2025-11-22",
      "headline": "The Ashes: Ben Stokes left shell-shocked by Travis Head masterclass in Perth TestTravis Head blasted a stunning 123 off 83 balls to lead Australia to an eight-wicket win over England in the first Ashes Test in Perth. Ben Stokes admitted he was left \"shell-shocked\" by the innings as Australia chased 205 with ease to take a 1–0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-travis-head-stats-records-perth-test-2824426-2025-11-22",
      "headline": "Shortest Ashes Test in 137 years. Head's rapid ton: Unmissable stats from PerthTravis Head's blistering 123 off 83 balls powered Australia to a dominant two-day, eight-wicket win in Perth to take a 1–0 lead in the Ashes. The Perth Test was also a witness to several records being broken. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-guwahati-test-day-1-match-report-kuldeep-siraj-2824386-2025-11-22",
      "headline": "IND v SA 2nd Test: After Kolkata chaos, Kuldeep drags India ahead in Guwahati slugfestKuldeep Yadav's three-wicket haul helped India inch ahead on Day 1 of the Guwahati Test. South Africa batters got starts but failed to capitalise on a track that looks to be in stark contrast to the one on offer at the Eden Gardens during the first Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-ashes-perth-test-travis-head-special-two-days-records-2824371-2025-11-22",
      "headline": "Travis Head grabs Bazball by the scruff, stuns England in 2-day Perth TestAustralia vs England, 1st Test: As wickets tumbled and chaos reigned in the first five sessions in Perth, Travis Head rose above the rubble, delivering a knock for the ages that turned a frantic two-day contest into Australia's emphatic opening statement of the Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-1st-ashes-test-perth-travis-head-opening-masterstroke-2nd-fastest-hundred-2824351-2025-11-22",
      "headline": "Perth masterstroke: Sent to open, Travis Head smashes 2nd fastest Ashes hundredTravis Head smashed the second-fastest century in Ashes history after being promoted to open the batting, igniting widespread debate over whether Australia have discovered their next Test opener. His dominant display triggered a wave of social media reactions praising his big-match temperament and ability to dismantle England's Bazball approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-clinches-3-0-odi-series-sweep-over-west-indies-2824317-2025-11-22",
      "headline": "NZ vs WI: Henry, Chapman star as New Zealand complete whitewash in HamiltonNew Zealand defeated West Indies by four wickets in Hamilton, sealing a 3–0 sweep. Standout bowling from Matt Henry and a steady partnership between Mark Chapman and Michael Bracewell were key to the result."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-advances-australian-open-super-500-mens-singles-final-2824300-2025-11-22",
      "headline": "Resurgent Lakshya Sen wins 86-minute marathon to storm into finalLakshya Sen reached the Australian Open final with a dramatic comeback win over second seed Chou Tien Chen. Sen prevailed 17-21, 24-22, 21-16 in a tense semifinal, booking his place in the title match after 86 minutes of high-intensity badminton on Saturday in Sydney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-ashes-2025-26-mitchell-starc-creates-history-first-pacer-12-years-10-wicket-haul-2824280-2025-11-22",
      "headline": "The Ashes: Mitchell Starc becomes first pacer in 12 years to take a 10-wicket haulMitchell Starc delivered a sensational ten-wicket match haul in Perth, becoming the first pacer in 12 years to achieve the feat in the Ashes. His dismissals of Crawley, Root and Stokes powered Australia to control as he also crossed 200 World Test Championship wickets, joining an elite bowling group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rising-stars-asia-cup-vaibhav-suryvanshi-super-ove-blunder-sunil-joshi-2824265-2025-11-22",
      "headline": "Coach Sunil Joshi faces heat over Vaibhav Suryavanshi Super Over blunderIndia A suffered a semi-final loss to Bangladesh A in the Asia Cup Rising Stars 2025 on Friday. The omission of star batter Vaibhav Suryavanshi in the Super Over has sparked widespread criticism and debate."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}