{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/prosenjit-chatterjee-on-sitaare-zameen-pars-cinema-only-move-aamir-can-take-risk-2743891-2025-06-20",
      "headline": "Prosenjit Chatterjee on Sitaare Zameen Par's cinema-only move: Aamir can take riskActor Prosenjit Chatterjee, in an exclusive interaction, reacted to Aamir Khan's decision to ditch OTT and release 'Sitaare Zameen Par' in theatres. He said that such kind of changes are important. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-takes-jibe-at-john-abraham-goal-slams-stardom-system-in-bollywood-2743844-2025-06-20",
      "headline": "Vivek Agnihotri takes jibe at John Abraham's Goal, slams stardom system in BollywoodDirector Vivek Agnihotri opened up about the challenges he faced during the shoot of John Abraham's 'Dhan Dhana Dhan Goal'. While criticising Bollywood's stardom system, he also slammed the stardom system of Bollywood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshaye-khannas-ott-film-revamped-for-theatres-as-akshardham-operation-vajra-shakti-2743879-2025-06-20",
      "headline": "Akshaye Khanna's OTT film revamped for theatres as Akshardham Operation Vajra ShaktiActor Akshaye Khanna's action drama 'State of Siege: Temple Attack' is set for a theatrical release on July 4, 2025, under a new title - 'Akshardham: Operation Vajra Shakti'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/elio-review-sweet-funny-pixar-film-lacks-emotional-depth-2743874-2025-06-20",
      "headline": "Elio review: Pixar's new offering is sweet and funny but lacks sparkReleased-Fri Jun 13, 2025Elio movie review: Pixar's Elio is a heartwarming story about an orphaned boy turned cosmic ambassador. Despite its charm, the film misses the emotional depth expected from Pixar's best works."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-returns-mumbai-saif-ali-khan-kareena-kapoor-sunjay-kapur-funeral-2743878-2025-06-20",
      "headline": "Karisma Kapoor returns to Mumbai with Saif Ali Khan and Kareena Kapoor. WatchKarisma Kapoor, along with sister Kareena Kapoor and Saif Ali Khan, returned to Mumbai after Sunjay Kapur's funeral in Delhi. A video of them leaving Delhi has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diana-penty-was-initial-choice-for-rockstar-was-dropped-after-2-3-weeks-2743812-2025-06-20",
      "headline": "Diana Penty says she was dropped from Rockstar after workshops, later bagged CocktailActor Diana Penty said in an interview that she was rejected for Ranbir Kapoor-starrer 'Rockstar' before she made her debut with 'Cocktail.' She was dropped from the film after two to three weeks of workshops. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-dances-to-katrina-kaif-chikni-chameli-during-india-visit-2743850-2025-06-20",
      "headline": "Jackson Wang dances to Katrina Kaif's Chikni Chameli during India visit. WatchK-pop star Jackson Wang visited India to promote his upcoming album 'Magic Man 2'. In one of the viral moments from his trip, Wang was seen dancing to Katrina Kaif's 'Chikni Chameli'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/veteran-pakistani-actor-ayesha-khan-dies-at-76-body-discovered-after-a-week-2743855-2025-06-20",
      "headline": "Veteran Pakistani actor Ayesha Khan dies at 76, body discovered after a weekVeteran Pakistani actor Ayesha Khan was found dead in her apartment in Karachi, Pakistan. She was 76. Her body was discovered in a decomposed state nearly a week after her death.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boman-irani-recalls-sunil-dutt-camaraderie-munna-bhai-set-2743851-2025-06-20",
      "headline": "Boman Irani recalls Sunil Dutt ordering 23 umbrellas so crew could eat togetherActor Boman Irani shares a nostalgic memory of Sunil Dutt bringing the crew together on Munna Bhai MBBS set. He highlights how film-set camaraderie has changed and praises the new generation's preparation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-loses-part-of-her-eyebrow-during-action-scene-in-heads-of-state-2743795-2025-06-20",
      "headline": "Priyanka Chopra recalls losing part of her eyebrow during Heads of State shootPriyanka Chopra revealed she lost a chunk of her eyebrow while filming an action scene in her upcoming film, 'Heads of State', narrowly avoiding a serious eye injury. Despite the mishap, she patched it up with surgical glue and continued shooting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lizzo-on-weight-loss-journey-admits-using-ozempic-transformation-2743790-2025-06-20",
      "headline": "Lizzo opens up about her weight-loss journey, admits to using OzempicPop star Lizzo broke her silence on the rumours surrounding her weight-loss journey. She admitted to using Ozempic and other drugs to reduce weight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chunky-pandey-changing-times-in-bollywood-golden-period-indian-cinema-2743819-2025-06-20",
      "headline": "This is golden time of cinema: Chunky Pandey on changing times in film industryVeteran actor Chunky Pandey reflected on the shift towards detailed preparation and scientific approach in filmmaking. He called it the golden era of cinema with diverse platforms offering new opportunities for actors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jennie-cries-for-help-on-hotones-hot-wings-2743749-2025-06-20",
      "headline": "BLACKPINK's Jennie cries for help on HotOnes, says Jisoo should've done itK-pop star Jennie recently appeared on the popular YouTube show 'HotOnes' by First We Feast. During the episode, she was seen calling for help and joking that Jisoo should have taken her place instead.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-dilwale-dulhania-le-jayenge-2025-release-evolving-love-portrayal-indian-films-2743753-2025-06-20",
      "headline": "Anupam Kher says DDLJ wouldn't work if released in 2025Actor Anupam Kher shares his views on how love stories in films have changed over time. He believes 'Dilwale Dulhania Le Jayenge' would not resonate if released for the first time in 2025 due to shifting societal values."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/detective-sherdill-movie-review-no-mystery-in-this-murder-mystery-led-by-diljit-dosanjh-2743796-2025-06-20",
      "headline": "Detective Sherdil review: No mystery in this murder mystery led by Diljit DosanjhReleased-Thu Jun 19, 2025Detective Sherdil movie review: A charming Diljit Dosanjh closes the murder case, and also your curiosity - long before the credits roll. The film is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/miley-cyrus-says-she-was-blamed-for-father-billy-smoking-pot-on-hannah-montana-set-2743787-2025-06-20",
      "headline": "Miley Cyrus says she was blamed for father Billy smoking pot on Hannah Montana setMiley Cyrus has opened up about the real reason behind the marijuana use on the Hannah Montana set. She revealed that it was her father, Billy Ray Cyrus, who smoked pot, not her as many believed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maltis-schedule-is-crazy-priyanka-chopra-on-school-and-her-travel-to-india-2743702-2025-06-20",
      "headline": "Maltie's schedule is crazier: Priyanka Chopra on daughter's school lifePriyanka Chopra recently opened up about her daughter Malti's school routine and how she juggles parenting while traveling for her professional commitments in India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/johnny-depp-visited-madrid-children-hospital-as-jack-sparrow-melts-internet-2743713-2025-06-20",
      "headline": "Johnny Depp surprises children as Captain Jack Sparrow in Madrid hospitalJohnny Depp returned to his iconic role as Captain Jack Sparrow to visit terminally ill children at a hospital in Madrid. The actor's selfless act has won hearts worldwide, showcasing his kindness beyond the screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sudhanshu-pandey-on-apoorva-mukhija-disrespecting-ashish-vidyarthi-is-this-gen-z-2743621-2025-06-20",
      "headline": "Is this Gen Z: Sudhanshu Pandey on Apoorva Mukhija disrespecting Ashish VidyarthiActor Sudhanshu Pandey called out Apoorva Mukhija for disrespecting Ashish Vidyarthi on 'The Traitors'. He mentioned the lack of respect among the younger generation towards elders. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/thank-you-but-what-pm-said-on-turning-down-trump-us-visit-invite-2743843-2025-06-20",
      "headline": "Thank you, but...: What PM said on turning down Trump's US visit invitePrime Minister Narendra Modi said that he received a dinner invite from US President Donald Trump while he was attending the G7 Summit in Canada, but he kindly declined the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-asim-munir-pakistan-white-house-meeting-defence-secretary-rajesh-singh-2743150-2025-06-20",
      "headline": "Trump-Munir meet embarrassing for Pak, its PM wasn't invited: Defence SecretaryThe rare meeting between US President Donald Trump and Pakistan Army chief General Asim Munir at the White House on Wednesday was strange and embarrassing for the country as its Prime Minister wasn't invited, Defence Secretary Rajesh Kumar Singh said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-1-leeds-updates-2743615-2025-06-20",
      "headline": "1st Test Day 1 LIVE: Gill gets hundred as visitors continue to dominateEngland (ENG) vs India (IND), 1st Test Day 1 Live Score and Updates from Leeds: Shubman Gill has got to his first hundred as the new India Test captain as the visitors continue to dominate in Headingley. He and Rishabh Pant have got their hundred partnership up and the visitors are in control. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/france-emmanuel-macron-rafale-jet-post-europe-reliance-us-military-hardware-2743802-2025-06-20",
      "headline": "Atmanirbhar Europe? France's Macron pushes for Rafale as alternative to US jetsWhile Macron did not elaborate on the post, it is being viewed as an outreach to European countries to strengthen collective defence by buying European military hardware and reducing dependence on US tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-iran-israel-conflict-pak-asim-munir-iran-axis-of-resistance-ukraine-war-2743868-2025-06-20",
      "headline": "Trump wants a 'Mission Accomplished' in IranSix months into his presidency and no conflict solved, US President Donald Trump might just leap into another conflict for a big win."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/uk-f35-fighter-jet-stuck-in-kerala-after-emergency-landing-hydraulic-fault-british-repair-team-to-arrive-2743884-2025-06-20",
      "headline": "British F-35 fighter jet still grounded in Kerala 6 days after emergency landingA Royal Navy F-35B stealth fighter jet remains grounded at Thiruvananthapuram airport in Kerala six days after making an emergency landing. A team from the United Kingdom is expected to arrive soon as local repair efforts failed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Israel tells UN it won't stop Iran strikes, Tehran raises alarm over US roleIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other as their conflict stretched into its eighth day. Israel claims it conducted overnight airstrikes in Tehran, targeting missile production sites and Iran's alleged nuclear weapons research headquarters. The attack comes as Iran appoints a new intelligence chief for the Revolutionary Guards following the killing of his predecessor in a strike last week, according to state media. Meanwhile, the White House said Trump will decide within two weeks on possible US military action against Iran, indicating that diplomacy remains an option for now. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-shubman-gill-century-test-captaincy-virat-kohli-2743933-2025-06-20",
      "headline": "ENG vs IND: Shubman Gill echoes Virat Kohli with century on Test captaincy debutShubman Gill silenced critics of his overseas Test record with a composed 140-ball century on his captaincy debut in the Headingley Test on June 20, matching Virat Kohli's feat and starting India's new era strongly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/khamenei-fatwa-against-nukes-rouhani-iran-sell-lie-israel-attacks-iraq-war-2003-what-happened-history-nuclear-weapons-2743381-2025-06-20",
      "headline": "Khamenei's fatwa against nukes: Did Iran sell a lie to the world?More than two decades ago, Hassan Rouhani, a top Iranian negotiator, told global powers that Iran's Supreme Leader, Ayatollah Ali Khamenei, had issued a fatwa against nuclear weapons. Rouhani later admitted that the idea came to him during the 2004 talks. Amid the Israel-Iran conflict over nukes, a look at if the fatwa exists or is a bid at deception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-debut-india-showroom-mumbai-july-china-made-model-y-ev-suvs-report-2743896-2025-06-20",
      "headline": "Tesla to open first showroom in Mumbai next month, sell China-made EVs: ReportTesla is set to open its first showroom in Mumbai next month and sell Model Y rear-wheel-drive SUVs shipped from Tesla's China factory as the company seeks expansion in the world's third-biggest automobile market, Bloomberg News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iran-opens-airspace-to-allow-indian-evacuation-around-1000-nationals-to-land-in-delhi-tonight-2743770-2025-06-20",
      "headline": "Iran reopens skies for Indian evacuation; 1,000 nationals to land in Delhi tonightIran, which has closed its airspace amid ongoing cross-border strikes with Israel, has opened the same to allow evacuations of Indian nationals. With this, around 1000 Indian nationals are expected to arrive in New Delhi tonight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-cooler-than-srinagar-temperature-weather-2743887-2025-06-20",
      "headline": "Delhi cooler than Srinagar as maximum temperature stays below 35°CDelhi recorded cooler temperatures than Srinagar on Friday, with all stations staying below 35 degrees Celsius. The Indian Meteorological Department has issued a yellow alert for rain till June 24.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sitaare-zameen-par-movie-review-aamir-khan-film-is-a-warm-hug-laughter-pill-for-soul-2743490-2025-06-20",
      "headline": "Sitaare Zameen Par review: Aamir Khan's film is a warm hug, laughter pill for soulReleased-Fri Jun 20, 2025Sitaare Zameen Par movie review: With 'Sitaare Zameen Par', Aamir Khan doesn't just return to the screens, he returns you to yourself, one heartfelt laugh at a time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-passenger-offloaded-from-bengaluru-surat-flight-before-takeoff-over-luggage-ruckus-2743284-2025-06-19",
      "headline": "Will crash plane, Bengaluru woman warns Air India Express crew over baggage fightA woman was removed from an Air India Express flight from Bengaluru to Surat after she allegedly refused to move her luggage and threatened to crash the plane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/president-murmu-moved-to-tears-as-visually-impaired-students-wish-her-on-birthday-2743828-2025-06-20",
      "headline": "President Murmu moved to tears as visually impaired students wish her on birthdayPresident Droupadi Murmu was moved to tears when students from the National Institute of the Empowerment of Persons with Visual Disabilities sang a song to wish her on her birthday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/lalu-yadav-dig-pm-modi-visit-bihar-rjd-congress-attack-bjp-bihar-elections-2743766-2025-06-20",
      "headline": "Rain of lies, hail of false promises: Lalu Yadav's weather forecast on PM's visitAs Prime Minister Narendra Modi attacked the RJD-Congress combine during his visit to Bihar, RJD chief Lalu Yadav jabbed at the former, saying there was a \"rain of lies\" and a \"hail of false promises\" in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-virat-kohli-2743326-2025-06-20",
      "headline": "Gavaskar, Sachin, Dravid or Kohli: Who's India's best? Sherlock Holmes investigatesCricket meets mystery in this puzzle for the ages. Virat Kohli has just retired from Test cricket and touched off a debate on who's the best Test batter ever from the short list of Gavaskar, Tendulkar, Dravid and Kohli. It's a debate wrapped inside a mystery that has layers and layers of facts, data and emotions. So, the writer summons the Sherlock Holmes inside him to crack Open the case of the #FabFourDebate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-jammu-and-kashmir-water-proposed-canal-punjab-indus-water-system-divert-pakistan-2743699-2025-06-20",
      "headline": "Did they give us water? Omar Abdullah rejects canal idea to divert water to PunjabSpeaking about India reportedly constructing a canal to divert excess water from three western rivers of the Indus system in J&K to Haryana, Punjab and Rajasthan, Chief Minister Omar Abdullah cited the 45-year-old Shahpur Kandi barrage dispute with Punjab and asked, \"Did they give us water?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kpcc-chief-sunny-joseph-says-shashi-tharoor-on-star-campaigner-list-for-nilambur-bypoll-after-wasnt-invited-revelation-2743566-2025-06-20",
      "headline": "Shashi Tharoor a no-show: Kerala Congress rejects 'not invited to campaign' claimKerala Pradesh Congress Committee chief Sunny Joseph said Shashi Tharoor was included in the party's star campaigner list for the Nilambur bypoll and blamed his absence on other commitments abroad. This comes a day after Tharoor claimed he wasn't invited to campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/indias-cinema-halls-struggle-with-dwindling-footfalls-2743219-2025-06-19",
      "headline": "India's cinema halls struggle with dwindling footfallsAs movie theatre audiences shrink and content struggles to connect, questions mount over what Indian viewers truly want from the big screen.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/united-states-military-build-up-israel-iran-conflict-donald-trump-2743859-2025-06-20",
      "headline": "Mapping US military posture in West Asia as Trump mulls Iran attackAs President Donald Trump decides whether to join Israel's attack on Iran, the American armed forces have made a series of manoeuvres to adjust the US defence posture in West Asia amid the ongoing conflict between Tehran and Tel Aviv.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-jibe-at-rjd-congress-in-poll-bound-bihar-parivar-ka-saath-parivar-ka-vikas-2743640-2025-06-20",
      "headline": "Nurturers of mafia raj, gunda raj: PM's all-out attack on RJD-Congress in BiharIn his fifth visit to the state in the past five months, PM Modi appealed to the public to vote out those who brought 'jungle raj' to Bihar and looted the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/brad-pitt-in-shirt-indian-designer-tangaliya-shirt-f1-movie-2743687-2025-06-20",
      "headline": "Brad Pitt wears India on his sleeve, literallyIn a behind-the-scenes photo from the F1 shoot, Brad Pitt is seen effortlessly pulling off a Tangaliya shirt by Indian label 11.11/Eleven Eleven."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/detective-sherdill-movie-review-no-mystery-in-this-murder-mystery-led-by-diljit-dosanjh-2743796-2025-06-20",
      "headline": "Detective Sherdil review: No mystery in this murder mystery led by Diljit DosanjhReleased-Thu Jun 19, 2025Detective Sherdil movie review: A charming Diljit Dosanjh closes the murder case, and also your curiosity - long before the credits roll. The film is streaming on Zee5. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-shubman-gill-century-test-captaincy-virat-kohli-2743933-2025-06-20",
      "headline": "ENG vs IND: Shubman Gill echoes Virat Kohli with century on Test captaincy debutShubman Gill silenced critics of his overseas Test record with a composed 140-ball century on his captaincy debut in the Headingley Test on June 20, matching Virat Kohli's feat and starting India's new era strongly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-viral-video-rishabh-pant-ben-stokes-banter-leeds-2743928-2025-06-20",
      "headline": "Watch: Rishabh Pant, Ben Stokes exchange words after India star's signature shotEngland vs India, 1st Test: Vice-captain Rishabh Pant and England captain Ben Stokes were involved in a friendly exchange in the final session of the opening day in Leeds. Pant played a restrained knock after walking into bat at No. 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-kalyan-chaubey-statement-reply-bhaichung-bhutia-allegations-corruption-2743915-2025-06-20",
      "headline": "AIFF Chief Kalyan Chaubey hits back at Bhutia, urges unity in football rowAIFF President Kalyan Chaubey responded to Bhaichung Bhutia's corruption claims, calling them baseless and urging constructive input instead. The exchange comes ahead of a key Executive Committee meeting on Indian football's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-yashasvi-jaiswal-shubman-gill-stump-mic-leeds-2743910-2025-06-20",
      "headline": "Watch: Yashasvi Jaiswal reminds Shubman Gill of his shaky running habit in viral videoYashasvi Jaiswal reminded Shubman Gill about his shaky running habit in a viral video during their partnership against England on Day 1 of the first Test in Leeds. Jaiswal scored a brilliant hundred and created a few records along the way.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-yashasvi-jaiswal-roars-in-celebration-after-century-in-leeds-2743903-2025-06-20",
      "headline": "Watch: Jaiswal roars in celebration after record-shattering century in LeedsIndia opener Yashasvi Jaiswal roared in celebration after his record-shattering century on Day 1 of the first Test against England at Headingley, Leeds. Jaiswal hit 101 with the help of 16 fours and a six."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-yashasvi-jaiswal-hundred-historic-double-leeds-2743898-2025-06-20",
      "headline": "With Leeds Test ton, Yashasvi Jaiswal completes historic England-Australia doubleYashasvi Jaiswal completed a historic Australia-England double as he got to his fifth Test hundred on Day 1 of the Leeds Test on Friday, June 20. Jaiswal continued his fine run of form in overseas Tests with the knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-hundred-leeds-test-2743894-2025-06-20",
      "headline": "Yashasvi Jaiswal scripts Indian record with classy hundred in Leeds TestEngland vs India, Leeds Test: Yashasvi Jaiswal became the first Indian opener to hit a hundred at Headingley in Leeds in a Test match. The young left-hander continued his dream run against England in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-1st-test-day-4-report-shadman-islam-nayeem-hasan-galle-2743893-2025-06-20",
      "headline": "SL vs BAN: Shanto, Shadman heroics help Bangladesh stretch lead in 1st TestBangladesh claimed a 187-run lead on Day 4 against Sri Lanka with strong batting and bowling performances. The match is poised for a tense finish as both teams battle for dominance heading into Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-emulates-virat-kohli-with-fifty-on-test-captaincy-debut-2743888-2025-06-20",
      "headline": "ENG vs IND: Shubman Gill emulates Virat Kohli with fifty on Test captaincy debutShubman Gill brought up a brilliant half-century on Day 1 of the first Test against England at Headingley, Leeds and became the first India skipper to achieve the feat on captaincy debut after Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sanjay-manjrekar-virat-kohli-dig-leeds-test-commentary-2743867-2025-06-20",
      "headline": "Did Sanjay Manjrekar take a dig at Virat Kohli during Leeds Test? Fans think soENG vs IND, 1st Test: Sanjay Manjrekar appeared to subtly criticise Virat Kohli's Test batting struggles during commentary on Day 1 of the Leeds Test. Kohli retired from the longest format of the game weeks before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-cristiano-ronaldo-rivalry-no-friendship-mutual-respect-2743866-2025-06-20",
      "headline": "Messi opens up on Ronaldo rivalry: No friendship, but mutual respectLionel Messi reflected on his iconic rivalry with Cristiano Ronaldo, stressing there's mutual respect despite limited personal interaction. Both legends continue to shine at club and national level, proving their enduring class beyond Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-hundred-leeds-test-2743894-2025-06-20",
      "headline": "Yashasvi Jaiswal scripts Indian record with classy hundred in Leeds TestEngland vs India, Leeds Test: Yashasvi Jaiswal became the first Indian opener to hit a hundred at Headingley in Leeds in a Test match. The young left-hander continued his dream run against England in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-1st-test-day-4-report-shadman-islam-nayeem-hasan-galle-2743893-2025-06-20",
      "headline": "SL vs BAN: Shanto, Shadman heroics help Bangladesh stretch lead in 1st TestBangladesh claimed a 187-run lead on Day 4 against Sri Lanka with strong batting and bowling performances. The match is poised for a tense finish as both teams battle for dominance heading into Day 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-emulates-virat-kohli-with-fifty-on-test-captaincy-debut-2743888-2025-06-20",
      "headline": "ENG vs IND: Shubman Gill emulates Virat Kohli with fifty on Test captaincy debutShubman Gill brought up a brilliant half-century on Day 1 of the first Test against England at Headingley, Leeds and became the first India skipper to achieve the feat on captaincy debut after Virat Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sanjay-manjrekar-virat-kohli-dig-leeds-test-commentary-2743867-2025-06-20",
      "headline": "Did Sanjay Manjrekar take a dig at Virat Kohli during Leeds Test? Fans think soENG vs IND, 1st Test: Sanjay Manjrekar appeared to subtly criticise Virat Kohli's Test batting struggles during commentary on Day 1 of the Leeds Test. Kohli retired from the longest format of the game weeks before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-cristiano-ronaldo-rivalry-no-friendship-mutual-respect-2743866-2025-06-20",
      "headline": "Messi opens up on Ronaldo rivalry: No friendship, but mutual respectLionel Messi reflected on his iconic rivalry with Cristiano Ronaldo, stressing there's mutual respect despite limited personal interaction. Both legends continue to shine at club and national level, proving their enduring class beyond Europe."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}