{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-predictions-what-to-expect-from-sensex-nifty-today-march-26-nse-bse-2699156-2025-03-26",
      "headline": "Sensex, Nifty opening predictions on March 26: What to expect today?Over the last seven sessions, the Nifty and Sensex have risen 5.7%, turning positive for the year so far. This rally has been supported by foreign capital inflows and expectations of stronger domestic economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byd-overtakes-tesla-in-2024-revenue-becomes-worlds-top-ev-maker-glbs-2698977-2025-03-25",
      "headline": "BYD overtakes Tesla in 2024 revenue, becomes World's top EV makerBYD surpassed Tesla in revenue, reporting $107 billion in 2024. The Chinese EV giant leads China's auto market, while Tesla faces declining sales, boycotts, and a falling valuation amid industry challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-ahead-of-report-on-us-consumer-confidence-glbs-2698969-2025-03-25",
      "headline": "Wall Street drifts ahead of report on US consumer confidenceWall Street saw marginal gains on Tuesday after making gains a day earlier in hopes of the Trump administration potentially softening its next set of tariffs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-cost-to-go-up-for-customers-rbi-higher-interchange-fee-approved-2698951-2025-03-25",
      "headline": "ATM cash withdrawals to get costlier from May 1. Here's whyThe Reserve Bank of India has approved a hike in ATM interchange fees, raising cash withdrawal costs for customers from May 1, 2025.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ev-battery-phone-parts-import-duty-removed-finance-minister-nirmala-sitharaman-2698859-2025-03-25",
      "headline": "Government drops import duty on key parts for EV batteries, phonesFinance Minister Nirmala Sitharaman said that the government will exempt import duty on 35 items used to make EV batteries and 28 items used in mobile phone manufacturing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-steam-to-close-flat-nifty-down-50-points-zomato-plunges-6-percent-2698801-2025-03-25",
      "headline": "Sensex, Nifty erase gains to close flat amid tariff uncertainty; Zomato down 6%The S&P BSE Sensex closed just 32.81 points above at 78,017.19 after having gained nearly 700 points in the day. Nifty also followed a similar pattern as it ended with just a 10.30 point gain at 23,668.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-tightens-travel-policy-for-employees-to-fly-economy-by-default-from-april-1-2698768-2025-03-25",
      "headline": "Air India staff to fly economy as airline tackles passenger concerns: ReportThe move is part of Air India's effort to improve its service and customer experience, following criticism over frequent flight delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slash-tariff-cut-plan-more-than-half-of-us-imports-worth-23-usd-billion-first-phase-trade-deal-2698727-2025-03-25",
      "headline": "India open to tariff cuts on US imports worth $23 billion: ReportThe government is trying to reduce the impact of US President Donald Trump's global reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-google-tax-removal-government-meta-x-to-benefit-india-us-trade-trump-tariff-threat-2698715-2025-03-25",
      "headline": "What is Google tax that India is likely to scrap from April 1?The tax is expected to be scrapped from April 1, 2025, as part of amendments to the Finance Bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-volatility-explained-why-sensex-nifty-gave-up-early-gains-2698670-2025-03-25",
      "headline": "Sensex down over 700 points from day's high. Why stock market turned volatile?Stock market today: At around 11:45 am, the S&P BSE Sensex was down 51.05 points to 77,933.33 and the NSE Nifty50 declined 17.85 points to trade at 23,640.50.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-remove-6-percent-google-tax-what-is-it-how-does-it-impact-tech-giants-2698623-2025-03-25",
      "headline": "India likely to remove 6% Google tax from April 1, tech giants to benefitThe Equalisation Levy know as 'Google Tax' was introduced in 2016 to tax payments made by Indian businesses to foreign companies for digital advertising services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ultratech-cement-share-price-sharp-gain-4-percent-ubs-upgrade-2698618-2025-03-25",
      "headline": "UltraTech Cement shares surge 4% in early trade today. Here's whyGlobal brokerage firm UBS has shared a fresh view on India's cement sector and upgraded stocks such as UltraTech Cement and Ambuja Cement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-700-points-in-early-trade-nifty-rise-bull-run-stock-market-5-things-to-know-investors-today-2698597-2025-03-25",
      "headline": "Sensex jumps 700 points in early trade. 5 key things to know todayThe S&P BSE was up 739.51 points to 78,723.89 at 10.01 am, while the NSE Nifty50 rose 196 points to 23,854.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-hcltech-infosys-wipro-why-it-stocks-are-rising-today-explained-2698584-2025-03-25",
      "headline": "TCS, HCLTech, Infosys, Wipro: Why IT stocks are rising todayShares of IT major Infosys jumped over 2%, while Tata Consultancy Services (TCS) shares were trading over 1.5% higher on the Bombay Stock Exchange (BSE). HCLTech shares were also up over 2% and Wipro shares rose over 1.3%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-bull-run-continues-dalal-street-ola-electric-hcltech-tcs-2698569-2025-03-25",
      "headline": "Sensex, Nifty open in green as FIIs return on Dalal Street; IT stocks gainStock market opening on March 25: The S&P BSE Sensex gained over 350 points higher to open over 78,000, while the NSE Nifty50 gained nearly 100 points to trade above 23,750. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-upward-rally-to-continue-sensex-nifty-key-levels-strategies-sectors-to-watch-risks-2698562-2025-03-25",
      "headline": "Sensex, Nifty set to extend rally: Key sectors to watch, strategies and risksStock market today: For those looking to invest, selective stock picking is key. With Nifty50 trading below its long-term valuation averages, investors may find value in largecap and midcap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-in-focus-insolvency-plea-dues-clear-rosmerta-group-nclt-2698555-2025-03-25",
      "headline": "Ola Electric shares to be in focus today. Here's whyIn an early morning exchange filing, Ola Electric Technologies announced that it has \"amicably settled all outstanding dues\" with Rosmerta Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-25-wipro-hcltech-rvnl-britannia-swiggy-and-more-2698553-2025-03-25",
      "headline": "Stocks to watch today: Ola Electric, Wipro, HCLTech, RVNL, Britannia and moreStocks to watch on March 25: With the stock market set to continue its positive run, here are the top stocks to watch out for during today's trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-what-to-expect-from-sensex-nifty-on-march-25-dalal-street-bse-nse-prediction-2698547-2025-03-25",
      "headline": "Market opening predictions on March 25: What to expect from Sensex, Nifty todayForeign portfolio investors bought shares worth Rs 3,056 corer on Monday, marking their third consecutive day of buying. This trend has helped boost market confidence after a period of significant selling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/han-jong-hee-dies-co-ceo-samsung-electronics-cardiac-arrest-tech-2698540-2025-03-25",
      "headline": "Samsung Electronics co-CEO Han Jong-hee dies of cardiac arrest at 63Samsung Electronics' co-CEO Han Jong-hee passed away at 63 due to cardiac arrest; he led the consumer electronics division and recently faced shareholder scrutiny over AI market struggles.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-gains-ground-after-shaking-off-four-week-losing-streak-glbs-2698435-2025-03-24",
      "headline": "Wall Street gains ground after shaking off four-week losing streakThe New York Stock Exchange showed positive signs on Monday after weeks of decline ahead of a potentially softening stance on tariffs by the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-jump-as-investors-eye-possible-tariff-leeway-lower-price-2698414-2025-03-24",
      "headline": "Tesla shares jump 10% as investors eye possible tariff leeway, lower priceTesla shares surged 10% on Monday amid reports of tariff exclusions under the Trump administration. Investors saw an opportunity after a steep decline this year. The rally lifted Wall Street, with tech stocks pushing indexes to two-week highs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-dalal-street-green-flags-what-investors-should-know-2698127-2025-03-24",
      "headline": "Red flags turn green on Dalal Street: Will the stock market bull run continue?Stock market rally today: With today's rebound, both indices have nearly erased most of the losses suffered in the first two months of 2025. It may be noted that the total market capitalisation of all BSE-listed firms swelled by over Rs 5 lakh crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/volkswagen-tax-case-why-government-doesnt-want-to-quash-14-billion-demand-2698086-2025-03-24",
      "headline": "Volkswagen tax case: Why government stands firm on $1.4 billion demandThe government's tax demand is against Skoda Auto Volkswagen India, which is accused of wrongly classifying imported parts for some Audi, VW and Skoda cars to avoid paying higher import taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bull-run-continues-on-dalal-street-as-sensex-surges-1000-points-2698085-2025-03-24",
      "headline": "Sensex surges 1,000 points as FIIs chase Dalal Street rallyBull run on Dalal Street: The S&P BSE Senses added 1,003.06 points to 77,908.57, while the NSE Nifty50 gained 286.95 points to 23,637.35 as of 12:37 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-under-pressure-cautions-saurabh-mukherjea-what-are-its-key-challenges-2698060-2025-03-24",
      "headline": "Is India's middle class losing momentum? See what this expert saysThe rise of automation is a growing threat to jobs. Machines are replacing traditional roles in both factories and offices. The next phase of automation, powered by generative AI, is expected to accelerate job displacement across multiple sectors, Saurabh Mukherjea said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fii-selling-stop-return-to-dalal-street-why-comeback-on-sensex-nifty-key-reasons-2698064-2025-03-24",
      "headline": "Why foreign investors are rushing back to bet on Dalal Street FIIs returning to Dalal Street has given a sharp boost to domestic investors, with the main indices extending gains for the sixth consecutive session. The S&P BSE Sensex was up 950 points and Nifty rose 273 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-loser-stocks-on-sensex-and-nifty-stock-market-today-titan-kotak-bank-bhel-infosys-ntpc-lt-2698016-2025-03-24",
      "headline": "Stock market rally: Check top gainers and losers on Dalal StreetSensex surged over 800 points to surpass the 77,700 mark, and Nifty jumped over 200 points to trade above the 23,500 level as Dalal Street continued its winning streak.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-gains-dalal-street-no-impact-of-reciprocal-tariffs-explained-2698012-2025-03-24",
      "headline": "Why Trump's tariffs aren't spooking Dalal Street investors anymoreForeign investors are back, and markets are rallying. But with Trump's reciprocal tariffs set for April 2, will the optimism last, or is another sell-off on the way?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-rising-today-sensex-jumps-500-points-nifty-up-key-reasons-fii-selling-stop-good-marco-expert-view-2697999-2025-03-24",
      "headline": "Sensex jumps over 1,000 points, extends rally: 5 things to knowStock Market Today: As of 11:06 am, the S&P BSE Sensex went up by 1000.10 points to reach 77,905.61. At the same time, the NSE Nifty50 increased by 289.85 points to 23,640.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ncc-share-price-today-jhunjhunwala-backsed-stock-jumps-5-percent-major-deal-win-2697994-2025-03-24",
      "headline": "NCC share price jumps 5% after Rs 1,480 crore hospital redevelopment orderNCC Ltd's stock price jumped in early trade after the company secured a contract worth Rs 1,480 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-rising-again-is-bhel-a-good-share-buy-after-recent-order-wins-2697978-2025-03-24",
      "headline": "Defence stocks are rising again. Is BHEL a good buy after recent order wins?Having declined over 24% in the past six months and over 9% in 2025, the stock has finally started showing signs of recovery. In the past month it has gained 11% and nearly 8% in the past five trading sessions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-over-500-points-nifty-surges-150-points-lt-gains-2-percent-2697976-2025-03-24",
      "headline": "Sensex, Nifty gain as energy stocks rally and foreign inflows surgeThe S&P BSE Sensex was up 579.88 points to 77,485.39, while the NSE Nifty50 jumped 160.85 points to 23,511.25 as of 9:26 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-likely-to-open-higher-how-to-trade-on-dalal-street-today-stock-market-expectations-2697953-2025-03-24",
      "headline": "Sensex, Nifty likely to open higher: How to trade on Dalal Street today?Dalal Street is expected to open higher as the overall market sentiment remains positive, with traders watching key levels for further movement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-march-24-bse-nse-what-to-expect-from-sensex-nifty-today-2697941-2025-03-24",
      "headline": "Sensex, Nifty opening prediction on March 24: What to expect from D-Street todayNifty50 posted its biggest weekly gain in over four years, driven by renewed interest from foreign investors and expectations that the recent market decline has come to an end."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nick-jonas-says-daughter-malti-is-unaware-of-his-fame-calls-band-donut-brothers-2699168-2025-03-26",
      "headline": "Nick Jonas says daughter Malti is unaware of his fame, calls band 'Donut Brothers'Nick Jonas said daughter Malti is unaware of his stardom and just wants to play 'Moana and Maui' with him. He embraced being a 'girl dad' while Kevin Jonas shared how his daughter is realising the popularity of her father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-wife-sonali-sood-car-accident-hospital-update-2699153-2025-03-26",
      "headline": "Sonu Sood's wife sustained multiple bruises, under observation: HospitalActor Sonu Sood's wife, Sonali Sood, was involved in a car accident along with her sister and nephew. According to the hospital statement, she suffered multiple bruises and is currently stable under observation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-manoj-bharathiraja-death-pawan-kalyan-condolences-2699136-2025-03-26",
      "headline": "Kamal Haasan shocked as his dear friend Bharathiraja grieves loss of son ManojKamal Haasan offered condolences to director Bharathiraja and family after Manoj Bharathiraja's passing. Manoj died of heart attack on March 25. He was 48."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/final-destination-bloodlines-trailer-out-tony-todd-richard-harmon-release-on-may-14-2699101-2025-03-25",
      "headline": "Final Destination Bloodlines trailer: Death is back to claim lives once againThe Final Destination saga will continue with Bloodlines, the trailer of which was released today, March 25. The film will once again bring back Death and his inventive ways of killing people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pedro-pascal-on-5-year-leap-in-the-last-of-us-season-2-incredibly-comforting-2699075-2025-03-25",
      "headline": "Pedro Pascal on a 5-year leap in The Last of Us Season 2: Incredibly comfortingDuring a press conference, Pedro Pascal shared insights on the emotional challenges of returning to The Last of Us for its second season. He discussed his mindset and the evolving relationship with co-star Bella Ramsey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-saerons-ex-boyfriend-denies-kim-soohyuns-involvement-in-her-death-2699033-2025-03-25",
      "headline": "Kim Sae-ron's ex-boyfriend denies Kim Soo-hyun's involvement in her deathKim Sae-ron's ex-boyfriend has denied Kim Soo-hyun's involvement in her death, alleging abuse in her marriage. The actress's secret marriage and alleged emotional distress are under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-remembers-mother-mona-kapoor-on-death-anniversary-2699018-2025-03-25",
      "headline": "Arjun Kapoor remembers mother Mona on 13th death anniversary: Love you, alwaysActor Arjun Kapoor remembers his mother, Mona Shourie Kapoor, on the 13th anniversary of her passing. He shares an emotional tribute, reflecting on her enduring influence and the pain of her absence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-bharathiraja-dies-at-48-chennai-2698999-2025-03-25",
      "headline": "Tamil actor-director Manoj Bharathiraja dies at 48 in ChennaiTamil actor and director Manoj Bharathiraja, son of legendary director Bharathiraja, died of heart attack at his Chetpet residence in Chennai on March 25. He was 48 years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-is-done-with-romantic-films-2698963-2025-03-25",
      "headline": "George Clooney is done with romantic filmsHollywood star George Clooney is no longer in the mood to make any romantic films. The veteran actor said he doesn't want to compete with younger actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tony-kakkar-defends-neha-kakkar-after-melbourne-concert-delay-shares-statement-instagram-2698966-2025-03-25",
      "headline": "Tony Kakkar defends Neha Kakkar after Melbourne concert delaySinger Tony Kakkar defended sister Neha Kakkar after she arrived three hours late to her Melbourne concert. He blamed the organisers for the delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/solo-leveling-2-episode-12-review-sung-jinwoo-vs-ant-king-beru-epic-animation-2698947-2025-03-25",
      "headline": "Solo Leveling 2: Sung Jinwoo-Ant King Beru clash makes episode 12 a visual treatThe 12th episode of Solo Leveling aired on Saturday, thrilling fans with an intense battle scene as Sung Jinwoo clashed with Ant King Beru on Jeju Island. Was it the best Solo Leveling episode so far? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/reema-kagti-on-rising-star-salaries-pressure-on-budgets-is-ridiculous-2698903-2025-03-25",
      "headline": "Reema Kagti on rising star salaries: Pressure on budgets is ridiculousReema Kagti spoke out about the unsustainable pressure rising star salaries are placing on film budgets, while also highlighting the issue of pay disparity between male and female actors.\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-brilliance-of-british-crime-shows-and-why-us-is-losing-the-genre-war-2698873-2025-03-25",
      "headline": "Adolescence, brilliance of British crime shows, and why US is losing the genre warWith 'Adolescence' winning all over, it is the right time to discuss why British crime dramas are built to last as compared to the ones made in the US in the same genre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/test-trailer-nayanthara-r-madhavans-dreams-get-intertwined-in-upcoming-thriller-2698910-2025-03-25",
      "headline": "Test trailer: Nayanthara, R Madhavan's dreams get intertwined in upcoming thrillerNetflix has unveiled the trailer for 'Test', a Tamil film directed by S Sashikanth. The film follows a cricketer, scientist, and teacher as they face personal and professional challenges, premiering on Netflix April 4."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pooja-hegde-on-pr-and-online-hate-people-are-spending-lakhs-to-troll-me-2698864-2025-03-25",
      "headline": "Pooja Hegde on PR and online hate: People are spending lakhs to troll meActor Pooja Hegde opened up about being targeted by online trolls, revealing that paid campaigns were run against her. She called the extent of trolling 'bizarre', and shared how it affected her family.        "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-the-yellow-diarys-himonshu-parikh-on-solo-ep-circles-band-members-2698852-2025-03-25",
      "headline": "Exclusive: The Yellow Diary's Himonshu Parikh on solo EP Circles, band membersHimonshu Parikh of The Yellow Diary steps into solo territory with his debut EP Circles, capturing the essence of love's cyclical journey. Supported by his bandmates, the EP blends personal experiences with a collaborative spirit, resonating deeply with listeners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-faces-stone-pelting-during-delhi-university-performance-2698867-2025-03-25",
      "headline": "Sonu Nigam faces stone pelting during Delhi University performanceSinger Sonu Nigam's performance at the Delhi Technological University was recently disrupted after he was attacked with stones and bottles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/comedienne-nikki-glaser-weighs-in-on-ozempic-usage-says-no-judgement-2698861-2025-03-25",
      "headline": "Comedienne Nikki Glaser weighs in on Ozempic usageComedienne Nikki Glaser has voiced her support for Ozempic as a weight-loss aid, challenging the stigma surrounding its use."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aarya-babbar-reacts-prateik-babbar-smita-patil-dropping-surname-2698839-2025-03-25",
      "headline": "Aarya Babbar reacts to Prateik dropping his surname: You can't change your identityPrateik Babbar's half-brother Aarya Babbar spoke about the actor dropping his father's legacy and adopting his mother's name. Aarya stated that one cannot erase their identity. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhupesh-baghel-ips-officer-cbi-raids-chhattisgarh-2017-sleaze-cd-scandal-case-bhilai-raipur-2699149-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBI raids Bhupesh Baghel in Chhattisgarh in Mahadev betting app case, he reactsDays after the ED conducted searches, the CBI today raided the residences of Congress General Secretary and former Chhattisgarh Chief Minister Bhupesh Baghel in Raipur and Bhilai in connection with the Mahadev betting app case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-us-election-integrity-executive-order-citizenship-ballots-united-states-2699128-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump orders major overhaul of US elections, mandates citizenship proofDonald Trump has signed a sweeping executive order will drastically alter American voter registration processes, imposing stringent measures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/aiadmk-edappadi-eps-amit-shah-delhi-meeting-speculation-bjp-alliance-back-on-cards-2026-tn-assembly-polls-2699009-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AIADMK leader, Amit Shah meet: Patch-up with BJP ahead of 2026 Tamil Nadu polls?Union Home Minister Amit Shah met Tamil Nadu leader of Opposition and AIADMK general secretary Edappadi K Palaniswami in Delhi on Tuesday. Their meeting has sparked speculation of the BJP reuniting with AIADMK ahead of the 2026 Tamil Nadu elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-allahabad-high-court-grabbing-breasts-breaking-pyjama-string-not-rape-ruling-2699002-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court takes note of 'grabbing breasts isn't rape' ruling, hearing todayThe Supreme Court will on Wednesday hear the matter of Allahabad High Court's recent ruling that grabbing breasts and breaking pyjama strings wasn't an attempt to rape."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-california-couple-deportation-colombia-35-years-immigrants-migrants-donald-trump-2699122-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Couple deported after 35 years in California, their 3 US-born daughters in shockA couple who had been living in the US for 35 years, with no criminal history after coming to America and having three US-born children, have been deported to their native Colombia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-yoga-teacher-buried-alive-over-alleged-affair-body-found-after-3-months-2699115-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man accuses yoga teacher of affair with wife, buries him alive in 7-foot pitJagdeep, a yoga teacher at a private university in Rohtak, was kidnapped in December 2024 and buried alive in a pit that was seven feet deep. His body was recovered on March 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-adviser-michael-waltz-us-yemen-strike-chat-leak-journalist-2699150-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's adviser admits Yemen strikes chat leak, President downplays breachUS National Security Adviser, Michael Waltz, admitted to mistakenly adding journalist Jeffrey Goldberg to a chat regarding Yemen military actions, while Donald Trump downplayed the incident, deflecting the blame to one of his White House staffers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-hold-talks-discuss-early-resumption-of-cross-border-cooperation-kailash-mansarovar-yatra-2699047-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, China discuss cross-border cooperation, Kailash-Mansarovar YatraA key focus of the India-China talks in Beijing was restarting cross-border cooperation, particularly on trans-border rivers and the Kailash-Mansarovar Yatra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harbhajan-singh-hindi-commentary-quality-2699159-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fan rants about quality of Hindi commentary, Harbhajan Singh respondsIPL 2025: Former spinner Harbhajan Singh took a feedback positively after a fan commented on the deteriorating quality of Hindi commentary during the tournament. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-bharathiraja-dies-at-48-chennai-2698999-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil actor-director Manoj Bharathiraja dies at 48 in ChennaiTamil actor and director Manoj Bharathiraja, son of legendary director Bharathiraja, died of heart attack at his Chetpet residence in Chennai on March 25. He was 48 years old."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/ahmedabad-police-sleeping-pcr-vehicle-murder-case-investigation-gujarat-2699093-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cops sleep near PCR vehicle as man murdered metres away in AhmedabadA viral video from Ahmedabad shows policemen sleeping in a parked PCR vehicle while a murder was taking place nearby. A probe has been launched against the cops. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fir-punjab-pastor-bajinder-singh-thrashes-man-and-woman-viral-video-2698984-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Another case against 'Yashu Yashu' pastor, this time over thrashing man, womanSelf-styled Christian prophet Bajinder Singh, who is accused of sexual harassment, is in fresh trouble over a video of him thrashing two people. An assault and criminal intimidation case has been filed against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-wife-sonali-sood-car-accident-hospital-update-2699153-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sonu Sood's wife sustained multiple bruises, under observation: HospitalActor Sonu Sood's wife, Sonali Sood, was involved in a car accident along with her sister and nephew. According to the hospital statement, she suffered multiple bruises and is currently stable under observation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/muhammad-yunus-attempts-to-destabilize-country-remarks-bangladesh-coup-buzz-2698993-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Festival of rumours, says Muhammad Yunus amid Bangladesh coup buzzMuhammad Yunus said that attempts are being made to \"destabilise the country\". His remarks came as reports of a probable coup in Bangaldesh emerged. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-gt-shreyas-iyer-ricky-ponting-vijay-vyshak-2699087-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer special ensures perfect start to Project PunjabPunjab Kings were off to a sensational start in the new regime of Ricky Ponting and Shreyas Iyer. The captain starred with 97* as PBKS beat GT by 11 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/argentina-brazil-qualifiers-fifa-world-cup-2026-2699139-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Argentina hammer Brazil 4-1, qualify for FIFA World Cup 2026Enzo Fernandez, Alexis Mac Alister and Giuliano Simeone and Julian Alvarez scored as Brazil beat Argentina 4-1. Earlier, they became the first South American team to qualify for the FIFA World Cup 2026. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-a-biopic-gave-debate-over-aurangzebs-legacy-a-violent-turn-in-nagpur-2698793-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How a biopic gave debate over Aurangzeb's legacy a violent turn in Nagpur'Chhaava', the biopic on Chhatrapati Shivaji Maharaj's elder son, has exposed the deep fissures in Maharashtra's socio-political landscape\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-russia-agreed-ensure-safe-navigation-black-sea-white-house-2698997-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ukraine, Russia have agreed on Black Sea ceasefire: White HouseIn parallel statements, the White House said that Ukraine and Russia \"agreed to ensure safe navigation, eliminate the use of force and prevent the use of commercial vessels for military purposes in the Black Sea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-divorce-cruelty-husband-wife-suicide-threat-maharashtra-2699126-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Threatening to commit suicide amounts to cruelty on spouse: Bombay High CourtThe Bombay High Court upheld a husband's divorce on grounds of cruelty, ruling that a spouse threatening or attempting suicide to implicate their partner and family constitutes cruelty. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-congress-quit-politics-change-constitution-muslim-reservation-2699123-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will quit politics if I ever said will change Constitution: DK ShivakumarThe BJP held protests across Karnataka on Tuesday against Deputy Chief Minister DK Shivakumar's purported comments regarding changing the Constitution to accommodate four per cent reservation for Muslims in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-brilliance-of-british-crime-shows-and-why-us-is-losing-the-genre-war-2698873-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adolescence, brilliance of British crime shows, and why US is losing the genre warWith 'Adolescence' winning all over, it is the right time to discuss why British crime dramas are built to last as compared to the ones made in the US in the same genre. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/political-storm-brewing-bangladesh-yunus-dhaka-explained-5-points-coup-radical-rise-army-control-military-2698832-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is a political storm brewing in Bangladesh? Explained in 5 pointsProtesting students who ousted PM Sheikh Hasina from power have formed a political party, radical extremists are marching on the streets, the Yunus government seems to have lost the plot, and there are reports of heightened military activity. Is a political storm brewing in Bangladesh? These five points will provide clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-afc-asian-cup-qualifiers-draw-sunil-chhetri-hamza-chowdhury-2699003-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India held to frustrating goalless draw by BangladeshAFC Asian Cup Qualifiers: India were held to a frustrating goalless draw by Bangladesh in their AFC Asian Cup Qualifiers third round clash in Shillong, which saw both headline names Sunil Chhetri and Hamza Chowdhury fail to live up to their expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/only-one-family-controlled-pm-relief-fund-under-upa-amit-shah-attacks-congress-2699127-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Only one family controlled PM relief fund under UPA, Amit Shah slams CongressAmit Shah attacked the Congress over alleged mismanagement of the Prime Minister's Relief Fund during the UPA era and defended the transparency of the PM-Cares Fund. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonali-bendre-fractures-hand-fans-wish-her-speedy-recovery-watch-2699161-2025-03-26",
      "headline": "Sonali Bendre fractures hand after a fall, concerned fans wish her speedy recoveryActor Sonali Bendre was seen at Mumbai airport with a fractured hand but cheerfully interacted with paparazzi. Fans wished her speedy recovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-wife-sonali-sood-car-accident-hospital-update-2699153-2025-03-26",
      "headline": "Sonu Sood's wife sustained multiple bruises, under observation: HospitalActor Sonu Sood's wife, Sonali Sood, was involved in a car accident along with her sister and nephew. According to the hospital statement, she suffered multiple bruises and is currently stable under observation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-manoj-bharathiraja-death-pawan-kalyan-condolences-2699136-2025-03-26",
      "headline": "Kamal Haasan shocked as his dear friend Bharathiraja grieves loss of son ManojKamal Haasan offered condolences to director Bharathiraja and family after Manoj Bharathiraja's passing. Manoj died of heart attack on March 25. He was 48."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-bond-franchise-gets-new-producers-amy-pascal-david-heyman-take-charge-glbs-2699102-2025-03-26",
      "headline": "James Bond franchise gets new producers: Amy Pascal & David Heyman take chargeAmazon MGM has appointed Amy Pascal and David Heyman as the next James Bond film's producers, marking a major shift from the Broccoli family's decades-long leadership. Their blockbuster experience promises a fresh creative direction.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gukesh-chess-interview-ms-dhoni-chennai-super-kings-2699160-2025-03-26",
      "headline": "D Gukesh draws from MS Dhoni: Chess, pressure, and the art of staying coolWorld chess champion D Gukesh reflected on how MS Dhoni has influenced his approach to handling pressure. Speaking to Chennai Super Kings from Chepauk, the 18-year-old Grandmaster shared insights on the art of staying composed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harbhajan-singh-hindi-commentary-quality-2699159-2025-03-26",
      "headline": "Fan rants about quality of Hindi commentary, Harbhajan Singh respondsIPL 2025: Former spinner Harbhajan Singh took a feedback positively after a fan commented on the deteriorating quality of Hindi commentary during the tournament. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ambati-rayudu-shreyas-iyer-bombay-2699146-2025-03-26",
      "headline": "Rayudu's Bombay quip goes viral after Shreyas Iyer's selfless 97Shreyas Iyer's selfless 97-run knock and bold leadership helped Punjab Kings secure an 11-run victory over Gujarat Titans, marking a strong start to their IPL 2025 campaign under Ricky Ponting's guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/argentina-brazil-qualifiers-fifa-world-cup-2026-2699139-2025-03-26",
      "headline": "Argentina hammer Brazil 4-1, qualify for FIFA World Cup 2026Enzo Fernandez, Alexis Mac Alister and Giuliano Simeone and Julian Alvarez scored as Brazil beat Argentina 4-1. Earlier, they became the first South American team to qualify for the FIFA World Cup 2026. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rr-vs-kkr-guwahati-weather-report-ipl-2025-2699120-2025-03-26",
      "headline": "RR vs KKR pitch report, weather forecast: Will dew affect match in Guwahati?RR vs KKR, Guwahati pitch report, weather forecast: The Kolkata Knight Riders travel to Guwahati to play Rajasthan Royals in their second match of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-team-rankings-march-26-orange-cap-leaderboard-2699121-2025-03-26",
      "headline": "IPL 2025 Points Table: SunRisers top standings after first round of matchesIPL Points Table Update, March 26: SunRisers Hyderabad, Royal Challengers Bengaluru, Punjab Kings and Chennai Super Kings are in the top four after the first round of matches in the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vyshak-vijaykumar-impact-sub-punjab-kings-fans-rcb-troll-2699119-2025-03-26",
      "headline": "RCB trolled after Vyshak Vijaykumar shines as Impact Sub for Punjab KingsIPL 2025, GT vs PBKS: A section of Royal Challengers Bengaluru fans lamented the team's decision to release Vijaykumar Vyshak ahead of the 2025 season. Making his debut for Punjab Kings, the Karnataka pacer delivered a standout performance, executing the team's death-over plans to perfection. PBKS secured an 11-run victory over Gujarat Titans in a high-scoring thriller on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-gt-shreyas-iyer-arshdeep-singh-vyshak-wide-yorker-2699118-2025-03-26",
      "headline": "Arshdeep's plan, saliva and Vyshak impact: How PBKS won death overs battle vs GTIPL 2025: Punjab Kings bowled exceptionally well in the final 6 overs to clinch their first match in the tournament against GT. After the victory, Shreyas Iyer credited Arshdeep Singh for executing a perfect plan in the death overs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-gt-shreyas-iyer-ricky-ponting-vijay-vyshak-2699087-2025-03-25",
      "headline": "Shreyas Iyer special ensures perfect start to Project PunjabPunjab Kings were off to a sensational start in the new regime of Ricky Ponting and Shreyas Iyer. The captain starred with 97* as PBKS beat GT by 11 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-shreyas-iyer-t20-world-cup-return-fans-praise-2699073-2025-03-25",
      "headline": "Shreyas Iyer for T20 World Cup 2026? Fans in awe of PBKS captain's Ahmedabad blitzIPL 2025, GT vs PBKS: Shreyas Iyer smashed 97 off just 42 balls, hitting nine sixes against the Gujarat Titans in Ahmedabad. Iyer has been in golden run with the bat across all forms of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/red-wings-aim-to-halt-avalanches-surge-and-revive-playoff-aspirations-glbs-2699059-2025-03-25",
      "headline": "Red Wings aim to halt Avalanche's surge and revive playoff aspirationsDetroit Red Wings aim for back-to-back wins to stay in the playoff hunt as they face a surging Colorado Avalanche."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vyshak-vijaykumar-impact-sub-punjab-kings-fans-rcb-troll-2699119-2025-03-26",
      "headline": "RCB trolled after Vyshak Vijaykumar shines as Impact Sub for Punjab KingsIPL 2025, GT vs PBKS: A section of Royal Challengers Bengaluru fans lamented the team's decision to release Vijaykumar Vyshak ahead of the 2025 season. Making his debut for Punjab Kings, the Karnataka pacer delivered a standout performance, executing the team's death-over plans to perfection. PBKS secured an 11-run victory over Gujarat Titans in a high-scoring thriller on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-gt-shreyas-iyer-arshdeep-singh-vyshak-wide-yorker-2699118-2025-03-26",
      "headline": "Arshdeep's plan, saliva and Vyshak impact: How PBKS won death overs battle vs GTIPL 2025: Punjab Kings bowled exceptionally well in the final 6 overs to clinch their first match in the tournament against GT. After the victory, Shreyas Iyer credited Arshdeep Singh for executing a perfect plan in the death overs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-gt-shreyas-iyer-ricky-ponting-vijay-vyshak-2699087-2025-03-25",
      "headline": "Shreyas Iyer special ensures perfect start to Project PunjabPunjab Kings were off to a sensational start in the new regime of Ricky Ponting and Shreyas Iyer. The captain starred with 97* as PBKS beat GT by 11 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-shreyas-iyer-t20-world-cup-return-fans-praise-2699073-2025-03-25",
      "headline": "Shreyas Iyer for T20 World Cup 2026? Fans in awe of PBKS captain's Ahmedabad blitzIPL 2025, GT vs PBKS: Shreyas Iyer smashed 97 off just 42 balls, hitting nine sixes against the Gujarat Titans in Ahmedabad. Iyer has been in golden run with the bat across all forms of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/red-wings-aim-to-halt-avalanches-surge-and-revive-playoff-aspirations-glbs-2699059-2025-03-25",
      "headline": "Red Wings aim to halt Avalanche's surge and revive playoff aspirationsDetroit Red Wings aim for back-to-back wins to stay in the playoff hunt as they face a surging Colorado Avalanche."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-womens-tournament-expansion-faces-competitive-financial-hurdles-glbs-2699055-2025-03-25",
      "headline": "NCAA Women's Tournament expansion faces competitive, financial hurdlesCompetitive balance and financial sustainability remain key concerns as NCAA officials debate potential tournament expansion, with many arguing the current format best serves the sport's growth and integrity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nfl-seahawks-add-veteran-depth-at-tight-end-glbs-2699042-2025-03-25",
      "headline": "NFL: Seahawks add veteran depth at tight endSeattle signs Eric Saubert, an experienced TE with blocking and receiving skills, bolstering their roster ahead of the season. The move strengthens their offensive depth and versatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-top-10-best-playoff-records-in-history-glbs-2699035-2025-03-25",
      "headline": "NBA: Top 10 best playoff records in historyOver the years, several teams have made their mark in NBA history with some truly impressive winning streaks. In 2001, the Los Angeles Lakers powered through the playoffs with a remarkable 15-1 record, courtesy of the dynamic duo of Shaquille O'Neal and Kobe Bryant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-shreyas-iyer-97-not-out-shashank-singh-selfless-message-2699011-2025-03-25",
      "headline": "Shreyas Iyer selfless on PBKS captaincy debut, sacrifices hundred to boost totalIPL 2025, GT vs PBKS: Shreyas iyer was unbeaten on 97 off 42 balls. He did not get strike in the final over of their innings. Shashank Singh took Mohammed Siraj apart, adding 24 runs in the final over as Punjab posted 243 for 5 in 20 overs on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-afc-asian-cup-qualifiers-draw-sunil-chhetri-hamza-chowdhury-2699003-2025-03-25",
      "headline": "India held to frustrating goalless draw by BangladeshAFC Asian Cup Qualifiers: India were held to a frustrating goalless draw by Bangladesh in their AFC Asian Cup Qualifiers third round clash in Shillong, which saw both headline names Sunil Chhetri and Hamza Chowdhury fail to live up to their expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-saeed-ajmal-meme-drop-catch-priyansh-arya-2698998-2025-03-25",
      "headline": "Punjab Kings use Saeed Ajmal meme template to Gujarat for drop catchIPl 2025, GT vs PBKS: Punjab Kings took a cheeky dig at the sloppy fielding effort by referring to Saeed Ajmal's infamous drop catch from a game in 2009. Rashid Khan and Arshad Khan handed Priyansh Arya a lifeline in the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/usc-battles-to-keep-march-madness-hopes-alive-without-star-juju-watkins-glbs-2698988-2025-03-25",
      "headline": "USC battles to keep March Madness hopes alive without star JuJu WatkinsUSC fights to keep March Madness dreams alive despite missing generational star JuJu Watkins, facing a tough test as they push forward without their leading scorer in a high-stakes tournament battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-i-wouldnt-wish-injury-on-anyone-says-sabonis-as-jayson-tatum-injury-shakes-celtics-glbs-2698985-2025-03-25",
      "headline": "NBA: I wouldn't wish injury on anyone, says Sabonis as Jayson Tatum injury shakes CelticsThe Boston Celtics defeated the Sacramento Kings for their sixth consecutive win in a thrilling NBA regular game, 113-95, at Golden 1 Center on Monday, March 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-afc-asian-cup-qualifiers-draw-sunil-chhetri-hamza-chowdhury-2699003-2025-03-25",
      "headline": "India held to frustrating goalless draw by BangladeshAFC Asian Cup Qualifiers: India were held to a frustrating goalless draw by Bangladesh in their AFC Asian Cup Qualifiers third round clash in Shillong, which saw both headline names Sunil Chhetri and Hamza Chowdhury fail to live up to their expectations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-pbks-saeed-ajmal-meme-drop-catch-priyansh-arya-2698998-2025-03-25",
      "headline": "Punjab Kings use Saeed Ajmal meme template to Gujarat for drop catchIPl 2025, GT vs PBKS: Punjab Kings took a cheeky dig at the sloppy fielding effort by referring to Saeed Ajmal's infamous drop catch from a game in 2009. Rashid Khan and Arshad Khan handed Priyansh Arya a lifeline in the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/usc-battles-to-keep-march-madness-hopes-alive-without-star-juju-watkins-glbs-2698988-2025-03-25",
      "headline": "USC battles to keep March Madness hopes alive without star JuJu WatkinsUSC fights to keep March Madness dreams alive despite missing generational star JuJu Watkins, facing a tough test as they push forward without their leading scorer in a high-stakes tournament battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-i-wouldnt-wish-injury-on-anyone-says-sabonis-as-jayson-tatum-injury-shakes-celtics-glbs-2698985-2025-03-25",
      "headline": "NBA: I wouldn't wish injury on anyone, says Sabonis as Jayson Tatum injury shakes CelticsThe Boston Celtics defeated the Sacramento Kings for their sixth consecutive win in a thrilling NBA regular game, 113-95, at Golden 1 Center on Monday, March 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-a-tour-squad-prediction-virat-kohli-rohit-sharma-karun-nair-2698961-2025-03-25",
      "headline": "Leading Test players, Karun Nair to be part of India A squad for England tourIndia A team will play two four-day matches against Lions during the May-June window to prepare for the five-Test series against England, starting June 20. Some of the prominent Test players are set to be part of the 'A' squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-luka-doncic-and-former-mavericks-coach-share-special-moment-after-lakers-loss-to-magic-glbs-2698934-2025-03-25",
      "headline": "Watch: Luka Doncic and former Mavericks coach share special moment after Lakers' loss to MagicThe Orlando Magic defeated the Los Angeles Lakers 118-106 in a thrilling NBA regular game on Monday, March 24, at the Kia Center. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-andre-russell-prove-himself-vs-rr-bharat-arun-bowling-coach-2698916-2025-03-25",
      "headline": "Russell will be out to prove himself vs RR: KKR bowling coach Bharat ArunKolkata Knight Riders bowling coach Bharat Arun remains confident in Andre Russell's ability to bounce back as KKR prepare for a crucial battle against Rajasthan Royals in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitin-menon-icc-elite-panel-umpires-full-list-2698909-2025-03-25",
      "headline": "Umpire Nitin Menon retained in ICC Elite Panel, Michael Gough and Joel Wilson outNitin Menon enters his sixth year as an ICC Elite Panel umpire. Joel Wilson and Michael Gough, two of the finest umpires, made way for two new entrants in the panel, updated on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gt-vs-pbks-live-score-updates-ipl-2025-gujarat-titans-vs-punjab-kings-shreya-shubman-2698900-2025-03-25",
      "headline": "GT vs PBKS Highlights: Punjab beat Gujarat by 11 runsGujarat Titans (GT) vs Punjab Kings (PBKS) Highlights, IPL 2025: A brilliant start for Shreyas Iyer led  Punjab Kings after they beat Gujarat Titans by 11 runs, in what was yet another thrilling clash. Despite the best efforts from the likes of Sai Sudarshan, Gujarat lacked the finishing depth for the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishan-kishan-was-overshadowed-in-mumbai-indians-says-sanjay-bangar-2698891-2025-03-25",
      "headline": "Ishan Kishan was overshadowed in MI but he's his own man in SRH: Sanjay BangarFormer India cricketer turned commentator Sanjay Bangar has said that wicketkeeper-batter Ishan Kishan was overshadowed during his time in the Mumbai Indians (MI) and has got the much-needed space in Sunrisers Hyderabad (SRH)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-ashutosh-sharma-finger-injury-hemang-badani-dressing-room-2698871-2025-03-25",
      "headline": "How Ashutosh Sharma braved injury for Vizag heist: DC coach Hemang Badani revealsIPL 2025: Delhi Capitals head coach Hemang Badani revealed Ashutosh Sharma was in danger of missing their first match against Lucknow Super Giants, revealing he suffered a cut on his finger two days before the game. Ashutosh hit 66 off 31, helping Delhi Capitals recover from 65 for 5 to successfully chase 210."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-i-think-we-just-got-a-little-bit-satisfied-says-luka-doncic-as-lakers-suffer-another-setback-glbs-2698869-2025-03-25",
      "headline": "NBA: I think we just got a little bit satisfied, says Luka Doncic as Lakers suffer another setbackThe Los Angeles Lakers lost to the Orlando Magic 118-106 on Monday night, resulting in yet another defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-bangladesh-afc-asian-cup-qualifier-live-streaming-channel-sunil-chhetri-2698860-2025-03-25",
      "headline": "India vs Bangladesh, AFC Asian Cup Qualifier, Live streaming: Hamza Choudhary, Sunil Chhetri in focusAfter making a retirement U-turn, Sunil Chhetri is set to play his first competitive fixture. India take on Bangladesh in the AFC Asian Cup Qualifier on Tuesday, March 25.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-kevin-pietersen-ahsutosh-sharma-mindset-2698856-2025-03-25",
      "headline": "Game isn't over till Ashutosh is batting: Pietersen on DC batter's LSG knockIPL 2025: Kevin Pietersen praised Ashutosh Sharma's fearless mindset as Delhi Capitals pulled off an thrilling one-wicket win, marking their first points of the season in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-baby-tribute-delhi-capitals-dressing-room-axar-patel-2698829-2025-03-25",
      "headline": "Watch: New parents KL Rahul, Athiya Shetty get special tribute from Delhi CapitalsDelhi Capitals made their thrilling win even more special by honoring KL Rahul and Athiya Shetty, celebrating their baby girl's birth with a touching tribute."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}