{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": "No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-cops-say-similar-train-names-with-prayagraj-led-to-mayhem-railways-disputes-2680835-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi cops say similar train names caused confusion, led to deadly stampedeThe Delhi Police said similar train names - both having the name 'Prayagraj' - and the announcement of one of its trains arriving at a different platform instead of a designated one led to the stampede at New Delhi station, which killed 18 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-dead-injured-rush-passengers-police-chaos-2680820-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chaos at Delhi station day after stampede: Unruly passengers, mad rush on trainsA mad rush of passengers continues at the New Delhi railway station, where 18 people were killed in a stampede, with unruly passengers running and shoving others to get inside the compartments of a Bihar-bound train."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-migrant-flight-illegal-indian-immigrants-deportee-claims-legs-chained-hands-cuffed-military-plane-amrtisar-2680787-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Legs chained, hands cuffed: Indian deportee on 2nd US flight recounts ordealThe US military C-17 aircraft, that landed in Amritsar late Saturday night, carried the second batch of illegal Indian immigrants as part of President Donald Trump's massive crackdown against undocumented aliens in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-states-cancels-21m-funding-for-voter-turnout-in-india-29m-for-bangladesh-2680727-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's DOGE cancels $21 million US funding for voter turnout in IndiaElon Musk's Department of Government Efficiency (DOGE) has announced a decision to cut $723 million in foreign aid funding as part of its broader budget overhaul plans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ranveer-allahbadia-indias-got-latent-controversy-samay-raina-profanity-vulgarity-expletives-part-of-indian-culture-bihar-up-2680365-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Our sanskari swear words, profanity paramparaFrom abuses in Gaari Geet and Holi meetings, to profanities hurled at the deity at a temple fest in Kerala and expletives being used as conjunctions in everyday life, Indians need no primer on bawdy jokes and cuss words. And that's culture too. A look at that culture even as Indians outrage over Ranveer Allahbadia and Samay Raina."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/new-delhi-train-station-stampede-indian-railways-probe-report-special-maha-kumbh-train-ticket-sale-surge-2680715-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Special Kumbh train, ticket sale surge led to Delhi stampede: Probe reportDelhi railway station stampede: At least 18 people, including children and women, were killed in a stampede in the New Delhi Railway Station due to overcrowding of passengers waiting to board trains for the Maha Kumbh Mela."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-reacts-to-x-post-about-ashley-st-clair-claim-of-having-his-13th-child-2680751-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk reacts after influencer claims she gave birth to his 13th childElon Musk, a day after influencer Ashley St. Clair claimed she had given birth to his 13th child, has reacted to one of the posts that said St. Clair had been trying to \"ensnare\" the Tesla CEO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-accessible-is-quality-elder-care-in-india-2680097-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How accessible is quality elder care in India?Accessibility of Elder Care in India: A 2023 report states that the elderly population in India is projected to increase from 10.1 per cent in 2021 to 20.8 per cent by 2050. Are we ready for it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-high-alert-sounded-enquiry-ordered-10-points-2680741-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18 killed in Delhi stampede, high alert sounded, inquiry ordered Live UpdatesA high alert has been sounded at all railway stations across Uttar Pradesh in view of the stampede at the New Delhi Railway station which claimed 18 lives on Saturday. A two-member committee has also been formed to probe the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/youtuber-lakshay-chaudhary-says-rivals-rammed-his-car-to-kill-him-shares-shocking-videos-2680804-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "YouTuber claims rivals rammed his car to kill him, shares shocking videosA YouTuber has claimed that he was attacked by his rivals who rammed his car and broke its windows to kill him. He shared shocking videos of the incident on social media. Nodia Police has reacted to it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-dead-injured-huge-crowds-belongings-videos-compensation-2680700-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aftermath of Delhi station stampede: Shoes, belongings strewn, cops nowhereSeveral videos of the aftermath of the stampede at the New Delhi railway station, which killed 18 people, show massive crowds jostling through the station with their luggage. Several pairs of shoes and other belongings were found strewn on an escalator."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-car-drags-man-50-metres-alleged-altercation-toll-booth-caught-on-cctv-2680735-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Car drags man for 50 metres after spat for 'overtaking' in BengaluruThe incident took place in Bengaluru's Nelamangala highway toll booth, and according to information, the argument broke out as soon as the vehicles approached the booth, which escalated into a physical confrontation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-dead-injured-maha-kumbh-rush-rahul-gandhi-opposition-atishi-lalu-yadav-bjp-centre-2680736-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi stampede: Opposition's 'negligence' jab, BJP calls out 'political vultures'The Opposition accused the Centre of \"mismanagement\" after 18 people died in a stampede at the New Delhi railway station. The incident occurred due to a sudden rush of devotees boarding trains to Prayagraj for the Kumbh Mela."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-napoleon-bonaparte-quote-he-who-saves-his-country-does-not-violate-any-law-2680712-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says no laws broken if he 'saves his country', quotes NapoleonDozens of lawsuits currently challenge Donald Trump's executive orders, including the ongoing crackdown against illegal immigration, attempts to ban transgender people from serving in the US military and efforts to overhaul the federal workforce. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/madhya-pradesh/story/madhya-pradesh-sheopur-groom-dies-collapse-horseback-wedding-procession-2680756-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Madhya Pradesh groom collapses on horseback in wedding procession, diesThe incident, which took place in Sheopur city on Friday night, was caught on CCTV. Footage shows the victim on horseback, entering the venue with many people accompanying him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-ashley-st-clair-columnist-claims-she-is-mother-of-elon-musks-13th-child-2680759-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Ashley St Clair? Columnist claims she is mother of Elon Musk's 13th childAshley St Clair, a columnist and conservative author, claimed that she gave birth to Elon Musk's 13th child five months ago but kept it a secret for the child's safety and privacy. Musk has not responded to the claim yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-huge-crowd-lack-of-police-presence-behind-ruckus-eyewitnesses-2680683-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "People crossed tracks, barged into train: Eyewitnesses on Delhi stampede horrorEyewitnesses of the stampede at the New Delhi railway station that killed 18 said there was a huge rush as several people were heading towards Prayagraj for the Maha Kumbh. They alleged that there were no police personnel to manage the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-deputy-chief-minister-dk-shivakumar-silent-pressure-mounts-replace-state-congress-president-2680748-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DK Shivakumar silent as clamour to replace him as Karnataka Congress chief growsDespite being at the centre of these developments, Shivakumar has maintained his silence and refrained from publicly commenting on the ongoing controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/maharashtra-student-paraglides-to-college-to-beat-traffic-viral-video-2680777-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maharashtra student, running late for exam, paraglides to college. Video goes viralA video of a student from Maharashtra paragliding his way to college has gone viral. Running late for his exam, the student decided to take an unconventional route to beat the traffic. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-given-hiv-infected-injection-by-in-laws-over-dowry-case-registered-saharanpur-2680684-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP woman injected with HIV-infected needle by in-laws over unmet dowry demandThe woman's father alleged that his daughter had been subjected to constant torture by her in-laws over dowry demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-first-openly-gay-imam-muhsin-hendricks-shot-dead-in-south-africa-2680778-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World's first openly gay imam, Muhsin Hendricks, shot dead in South AfricaHendricks, who is involved in various LGBTQ+ advocacy groups, came out as gay in 1996. Two years later he started hosting meetings in his home city for LGBTQ+ Muslims, who treated him like their community imam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-historic-record-most-wins-by-a-team-vs-pakistan-bangladesh-2680716-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India set for historic Champions Trophy record with wins vs PAK, BANIndia stand on the verge of a historic Champions Trophy record, needing just two more wins to cement themselves as the most successful team in tournament history while aiming to end their 12-year ODI title drought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-vicky-kaushal-period-drama-audience-in-tears-akshaye-khanna-rashmika-mandanna-2680845-2025-02-16",
      "headline": "Chhaava: Audience in tears after watching Vicky Kaushal's period drama. WatchVicky Kaushal's period drama, Chhaava, has earned appreciation from all quarters. A video of fans getting emotional after watching the film has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/c-krishnaveni-telugu-producer-actor-launched-ntr-dies-102-pawan-kalyan-vishnu-manchu-mourn-2680832-2025-02-16",
      "headline": "Veteran Telugu producer C Krishnaveni who launched NTR dies at 102Veteran Telugu producer and actor C Krishnaveni died on February 16 due to age-related ailments. She was 102. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/uyare-on-ott-when-and-where-to-watch-asif-alis-malayalam-film-2680807-2025-02-16",
      "headline": "Uyare on OTT: When and where to watch Asif Ali's Malayalam filmTovino Thomas and Asif Ali's Malayalam thriller is currently streaming on OTT. The 2019 drama was a major box office success of the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-i-am-from-hyderabad-comment-internet-divided-2680808-2025-02-16",
      "headline": "Rashmika Mandanna leaves internet divided with 'I am from Hyderabad' commentRashmika Mandanna's recent statement about being from Hyderabad has sparked online debate, as some believe she's trying to win over the Telugu audience while others defend her remark given her current residence in the city."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-doping-ban-daniil-medvedev-wada-2680847-2025-02-16",
      "headline": "Jannik Sinner doping ban: Daniil Medvedev hopes everyone can negotiate dealDaniil Medvedev is hoping that Jannik Sinner's deal with the World Anti-Doping Agency will set a precedent going forward. Medvedev hopes that other players will be given the chance to negotiate similar deals. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-son-zorovar-divorce-wife-aesha-blocked-2680836-2025-02-16",
      "headline": "Blocked from speaking to my son, haven't seen him in 2 years: Shikhar DhawanFormer India cricketer Shikhar Dhawan expressed his longing to meet and embrace his son. The Champions Trophy winner said it has been two years since he last saw Zoravar and a year since they last spoke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-ruled-out-ranji-trophy-semi-final-mumbai-vs-vidarbha-injury-2680819-2025-02-16",
      "headline": "Yashasvi Jaiswal ruled out of Mumbai's Ranji semi-final due to injuryYashasvi Jaiswal faces a double setback as an ankle injury ruled him out of Mumbai's Ranji Trophy semi-final against Vidarbha, days after his exclusion from India's Champions Trophy squad in a last-minute selection change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-haris-rauf-injury-pakistan-squad-mohammad-amir-new-zealand-game-2680813-2025-02-16",
      "headline": "If Haris Rauf has a side strain, he cannot play Champions Trophy: Mohammad AmirFormer pacer Mohammad Amir has expressed his doubts about Haris Rauf's fitness and feels he may not be able to play the Champions Trophy if he has got a side strain. Rauf got injured during the opening match of the tri-series but was deemed to be fit in time for the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-jude-bellingham-red-card-real-madrid-vs-osasuna-explained-2680806-2025-02-16",
      "headline": "What went wrong in Bellingham's red card in Madrid vs Osasuna: ExplainedJude Bellingham faces a potential lengthy ban after receiving a controversial red card against Osasuna, with Real Madrid boss Carlo Ancelotti insisting it was a misunderstanding and criticising referee José Luis Munuera's officiating decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-sign-mujeeb-ur-rahman-allah-ghazanfar-replacement-2680796-2025-02-16",
      "headline": "IPL 2025: Mumbai Indians sign Mujeeb Ur Rahman as Allah Ghazanfar replacementMumbai Indians have announced the signing of Mujeeb ur Rahman as the replacement for the injured Allah Ghazanfar for the upcoming IPL 2025 season on Sunday, February 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-additional-tickets-india-matches-semifinal-one-go-on-sale-dubai-2680780-2025-02-16",
      "headline": "Champions Trophy: Additional tickets for India matches in Dubai to go on saleAdditional tickets for India's matches in Dubai during the ICC Champions Trophy will go on sale on Sunday, February 16. Apart from the India matches, semi-final 1 will also be played in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-classics-hardik-pandya-india-vs-pakistan-2017-final-ravindra-jadeja-run-out-2680779-2025-02-16",
      "headline": "Champions Trophy Classics: When Hardik Pandya's flair couldn't stop PakistanWhen Hardik Pandya's fiery knock in the 2017 Champions Trophy final gave India hope, only for a mix-up with Ravindra Jadeja to cut it short, leaving fans wondering what could have been."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rashid-khan-bigger-cricketer-than-wasim-akram-afghanistan-rashid-latif-2680760-2025-02-16",
      "headline": "Rashid Khan bigger cricketer than Wasim Akram: Rashid Latif makes bold claimFormer Pakistan skipper Rashid Latif has made a huge statement that Rashid Khan is a bigger cricketer than Wasim Akram. Rashid has been one of the star players for Afghanistan in the last decade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-alexandra-andrea-botez-sisters-hostage-picture-fun-post-freestyle-grand-slam-2680747-2025-02-16",
      "headline": "First Vishy Anand, now Botez sisters take Gukesh 'hostage' in funny postCanadian chess stars Alexandra and Andrea Botez shared a hilarious \"hostage\" photo with Indian world champion D Gukesh, delighting fans with their trademark humour after a similar viral post featuring Viswanathan Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/fih-pro-league-india-vs-spain-harmanpreet-singh-reaction-kalinga-stadium-2680744-2025-02-16",
      "headline": "Harmanpreet Singh not 'too disappointed' with Spain loss, eyes finishing improvementIndia captain Harmanpreet Singh said that he wasn't too disappointed with the loss to Spain in the FIH Pro League on Saturday, February 15. India lost the match 1-3 despite taking the lead in the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-additional-tickets-india-matches-semifinal-one-go-on-sale-dubai-2680780-2025-02-16",
      "headline": "Champions Trophy: Additional tickets for India matches in Dubai to go on saleAdditional tickets for India's matches in Dubai during the ICC Champions Trophy will go on sale on Sunday, February 16. Apart from the India matches, semi-final 1 will also be played in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-classics-hardik-pandya-india-vs-pakistan-2017-final-ravindra-jadeja-run-out-2680779-2025-02-16",
      "headline": "Champions Trophy Classics: When Hardik Pandya's flair couldn't stop PakistanWhen Hardik Pandya's fiery knock in the 2017 Champions Trophy final gave India hope, only for a mix-up with Ravindra Jadeja to cut it short, leaving fans wondering what could have been."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rashid-khan-bigger-cricketer-than-wasim-akram-afghanistan-rashid-latif-2680760-2025-02-16",
      "headline": "Rashid Khan bigger cricketer than Wasim Akram: Rashid Latif makes bold claimFormer Pakistan skipper Rashid Latif has made a huge statement that Rashid Khan is a bigger cricketer than Wasim Akram. Rashid has been one of the star players for Afghanistan in the last decade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-alexandra-andrea-botez-sisters-hostage-picture-fun-post-freestyle-grand-slam-2680747-2025-02-16",
      "headline": "First Vishy Anand, now Botez sisters take Gukesh 'hostage' in funny postCanadian chess stars Alexandra and Andrea Botez shared a hilarious \"hostage\" photo with Indian world champion D Gukesh, delighting fans with their trademark humour after a similar viral post featuring Viswanathan Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/fih-pro-league-india-vs-spain-harmanpreet-singh-reaction-kalinga-stadium-2680744-2025-02-16",
      "headline": "Harmanpreet Singh not 'too disappointed' with Spain loss, eyes finishing improvementIndia captain Harmanpreet Singh said that he wasn't too disappointed with the loss to Spain in the FIH Pro League on Saturday, February 15. India lost the match 1-3 despite taking the lead in the match. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}