{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-meets-google-ceo-sundar-pichai-discusses-deeper-ai-collaboration-2870269-2026-02-18",
      "headline": "PM Modi meets Google CEO Sundar Pichai, discusses deeper AI collaborationPrime Minister Narendra Modi met with Google CEO Sundar Pichai on the sidelines of the India AI Impact Summit and said the discussion centred on strengthening AI cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-jumps-over-rs-8000-will-prices-rise-again-or-fade-soon-gold-prices-bullion-2870270-2026-02-18",
      "headline": "Silver jumps over Rs 8,000: Will prices rise again or fade soon?A strong surge in silver has put the metal back in focus. With prices climbing rapidly in a single session, the big question for investors is whether this rise signals a fresh trend or a pause ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/bubble-or-boom-experts-discuss-ais-returns-and-real-world-impact-2870250-2026-02-18",
      "headline": "Bubble or boom? Experts discuss AI's returns and real-world impactInvestment in artificial intelligence is accelerating rapidly, with billions being poured into data centres and advanced AI models. But as spending rises, one question is gaining attention: how soon will investors begin to see meaningful returns?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-the-ai-surge-a-bubble-or-a-breakthrough-experts-discuss-roi-and-impact-2870236-2026-02-18",
      "headline": "Is the AI surge a bubble or a breakthrough? Experts discuss impact and investmentMoney is pouring into artificial intelligence at an unprecedented pace, especially into data centres and large language models. Yet amid the surge in funding, investors are increasingly asking when real financial rewards will follow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/is-ai-reinforcing-gender-inequality-more-than-we-realise-2870227-2026-02-18",
      "headline": "Is AI reinforcing gender inequality more than expected?Ivana Bartoletti, Global Chief Privacy & AI Governance Officer, Wipro, who is also the founder of Women Leading Artificial Intelligence, said the concern goes beyond participation in coding roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-down-over-21-percent-in-a-month-what-should-investors-do-2870216-2026-02-18",
      "headline": "Ola Electric share price down over 21% in a month: What should investors do?Currently trading near the Rs 28 mark, the counter is hovering close to its recent lows, leaving retail investors wondering whether this is a buying opportunity or a signal to stay away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-should-india-build-its-ai-governance-framework-ivana-bartoletti-wipro-ai-summit-2026-2870213-2026-02-18",
      "headline": "How should India build its AI governance? Wipro's AI officer answersDuring a session at India Today AI Summit, Ivana Bartoletti, Global Chief Privacy and AI Governance Officer at Wipro, said governance should not be misunderstood as heavy state control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/qualcomm-bets-big-on-indias-ai-future-with-150-million-strategic-venture-fund-2870204-2026-02-18",
      "headline": "Qualcomm bets big on India's AI future with $150 million strategic venture fundWith $150 million on the table, Qualcomm is betting that India's edge AI startups will help define the next global technology cycle, moving intelligence from distant clouds directly into everyday devices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-not-processed-here-is-what-could-have-gone-wrong-2870168-2026-02-18",
      "headline": "Still waiting for your income tax refund? Here's what could be holding it upIncome tax refund not credited yet? Before you panic, check the latest processing data and the common reasons that may be holding up your money this assessment season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pf-interest-rate-increase-this-year-or-remain-at-825-check-here-2870134-2026-02-18",
      "headline": "Will your PF interest rate increase this year or remain at 8.25%? Check hereFor lakhs of salaried employees, the annual PF interest rate is more than just a number; it shapes long-term savings. With expectations building around this year's decision, many are wondering whether returns will rise or stay unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-must-lean-into-ai-to-stay-competitive-hemant-taneja-india-today-ai-summit-2026-2870116-2026-02-18",
      "headline": "India must lean into AI to stay competitive: Hemant TanejaTaneja drew a sharp line between foundational AI research and applied AI. According to him, 2025 was the year AI \"diffusion started,\" with enterprises using AI to boost productivity across departments, from coding to customer support and sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/general-catalyst-ceo-hemant-taneja-ai-opportunities-india-today-ai-summit-2026-2870090-2026-02-18",
      "headline": "Businesses won't be competitive if they don't lean into AI: Hemant TanejaSpeaking at the India Today AI Summit 2026, General Catalyst CEO Hemant Taneja described AI as a \"transformative force\" and argued that even if the current moment carries elements of hype, it is laying the groundwork for long-term change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-flat-it-stocks-down-infosys-wipro-tcs-2870067-2026-02-18",
      "headline": "Sensex, Nifty open flat as IT stocks tumble in early trade; Infosys down 2%The S&P BSE Sensex was up 19.33 points to 83,470.29, while the NSE Nifty50 added 12.50 points to 25,737.90 as of 9:41 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/dda-removes-parking-charges-from-flat-prices-mig-hig-karmayogi-awas-yojana-towering-heights-2025-2870058-2026-02-18",
      "headline": "Big relief for homebuyers as DDA removes parking charges from flat pricesThe authority has discontinued the levy of parking charges, including covered parking, in the overall cost of flats. This change is expected to reduce flat prices by Rs 5 lakh to Rs 12 lakh, depending on the category of the flat and the size of the parking space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-interest-rate-fy26-8-25-percent-what-it-means-for-pf-subscribers-2870036-2026-02-18",
      "headline": "EPFO may keep PF interest rate at 8.25% for FY26. What it means for your savingsThe EPFO is also working on creating an interest stabilisation reserve fund. The aim is to provide a stable and consistent interest rate to subscribers, even if markets are volatile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dnpa-hosts-key-ai-and-journalism-dialogue-at-indiaai-impact-summit-2026-2869708-2026-02-17",
      "headline": "DNPA hosts key AI and journalism dialogue at IndiaAI Impact Summit 2026The session brought together senior leaders from India's most influential news organisations along with global publishing representation to examine how artificial intelligence is transforming journalism, and how India must shape that transformation responsibly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-income-tax-rules-2026-could-change-your-tax-forms-what-it-means-for-you-2869689-2026-02-17",
      "headline": "Draft income tax rules 2026 could change your tax forms: What it means for you?Under the draft new law, statutory forms such as Form 26AS, Form 16 and Form 13 will be issued with new numbers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-close-higher-it-psu-bank-rally-infosys-anthropic-reliance-fall-2869668-2026-02-17",
      "headline": "Sensex, Nifty close higher as IT and PSU banking stocks rally; Infosys up 2%The IT sector played a key role in lifting the markets. The Nifty IT index, which is the second-heaviest sector on the benchmarks, climbed 1%. Shares of Infosys rose 1.9% after the company announced a partnership with US-based artificial intelligence firm Anthropic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/are-millennials-and-gen-z-behind-90-95-of-indias-home-purchases-2869594-2026-02-17",
      "headline": "Are millennials and Gen Z behind 90–95% of India's home purchases?For many borrowers under 40, applying for a home loan online is no longer optional, it is the preferred way. Around 72% of borrowers in this age group choose digital applications, and nearly half of borrowers above 60 are also getting comfortable with online processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hal-bel-bharat-forge-bel-cochin-shipyard-defence-stocks-comeback-2869577-2026-02-17",
      "headline": "Cochin Shipyard, HAL, BEL: Are defence stocks set for a strong comeback?The defence theme is back on screens. Now it needs breadth, sustained volumes and follow-through to turn early strength into a lasting rally."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-praised-by-vin-diesel-the-bluff-los-angeles-premiere-2870212-2026-02-18",
      "headline": "Why Vin Diesel compared Priyanka Chopra to Nelson Mandela at The Bluff premiere At the Los Angeles premiere of The Bluff, Vin Diesel praised Priyanka Chopra's performance and compared her to Nelson Mandela. He highlighted how she is committed to making the world a better place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kohrra-actor-barun-sobti-calls-out-discomfort-around-strong-women-in-power-2870209-2026-02-18",
      "headline": "Kohrra actor Barun Sobti calls out discomfort around strong women in power Kohrra 2 actor Barun Sobti discusses the persistent issue of patriarchy in the film industry, sharing his experience of playing a subordinate to a female superior and the wider impact of strong female leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-joins-ss-rajamouli-varanasi-film-mahesh-babu-priyanka-chopra-2870201-2026-02-18",
      "headline": "Kichcha Sudeep to reunite with SS Rajamouli in Varanasi: Report Kichcha Sudeep is reportedly cast in SS Rajamouli's upcoming film Varanasi. The collaboration revives excitement after his roles in Eega and Baahubali, hinting at a significant part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-suffered-minor-brain-haemorrhage-underwent-procedure-doctor-shares-health-update-2870228-2026-02-18",
      "headline": "Salim Khan suffered minor brain haemorrhage, underwent procedure: Doctor Salim Khan has been placed on a ventilator after suffering a minor brain haemorrhage, doctors at Lilavati Hospital have confirmed. A procedure was performed to stabilise his condition, and he is currently under observation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sarvam-maya-succesriya-shibu-sarvam-mayas-ghost-delulu-elated-as-suriya-jyotika-praise-her-acts-riya-shibu-praised-impactful-performance-malayalam-horror-comedy-2870195-2026-02-18",
      "headline": "Riya Shibu, Sarvam Maya's Delulu, elated as Suriya, Jyotika praise her act Actress Riya Shibu expressed her joy at receiving a congratulatory note and gift hamper from Suriya and Jyotika, recognising her memorable performance in the box office hit Sarvam Maya. The couple sent their wishes to the entire team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nishaanchi-special-effects-better-than-sinners-says-anurag-kashyap-2870130-2026-02-18",
      "headline": "Nishaanchi special effects better than Sinners, says Anurag Kashyap Anurag Kashyap has claimed that the special effects in his film Nishaanchi surpassed the Oscar-nominated Sinners. He highlighted debutant Aaishvary Thackeray's dual performance as Babloo and Dabloo, while emphasising the distinct, real-world execution that sets the two-part film series apart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shaktimaan-actor-vaishnavi-macdonald-on-casting-couch-and-why-she-quit-films-early-2870161-2026-02-18",
      "headline": "Shaktimaan actor Vaishnavi MacDonald on casting couch and why she quit films early Actor Vaishnavi MacDonald, known for her role as Geeta Vishwas in the popular series Shaktimaan, has opened up about her early film career struggles and the casting couch incident that influenced her move from films to television."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-greets-namaste-shares-kiss-nick-jonas-the-bluff-premiere-pics-2870188-2026-02-18",
      "headline": "Priyanka Chopra greets with namaste, shares kiss with Nick at The Bluff premiere Priyanka Chopra appeared with Nick Jonas at the Los Angeles premiere of her new film The Bluff on February 17. The couple engaged in PDA apart from posing for photo-ops in coordinated brown outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-tribute-late-father-in-law-sunil-malhotra-death-wedding-pictures-you-welcomed-me-with-open-arms-2870122-2026-02-18",
      "headline": "Kiara Advani pays tribute to late father-in-law: You welcomed me with open arms Actor Kiara Advani paid tribute to her father-in-law, Sunil Malhotra, a day after he died in Delhi. The actor shared wedding photos with actor-husband Sidharth Malhotra and remembered his warmth, wisdom and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-movie-synopsis-action-thriller-colonial-goa-yash-geetu-mohandas-2870114-2026-02-18",
      "headline": "Toxic synopsis out: Yash forges crime empire in dying colonial Goa The synopsis for Geetu Mohandas' upcoming film Toxic: A Fairytale for Grown Ups, starring Yash, was shared by the overseas distributor on their official website. The film is set against a historical backdrop in Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-2-cine-body-seeks-accountability-after-bmc-blacklists-aditya-dhar-studio-2870120-2026-02-18",
      "headline": "Dhurandhar 2: Cine body seeks accountability after BMC blacklists Aditya Dhar studio The president of the All Indian Cine Workers Association (AICWA) has sharply criticised the repeated safety lapses by the Dhurandhar 2 crew and demanded stringent action against those found responsible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/muay-thai-training-actor-babil-khan-speculation-new-role-fitness-journey-2870113-2026-02-18",
      "headline": "Babil Khan trains in Muay Thai in Thailand Actor Babil Khan's recent Muay Thai training in Thailand has sparked speculation about a possible new role, though he has not confirmed any project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-cheque-bounce-case-lender-says-he-cried-for-repayment-calls-it-loan-not-investment-2870115-2026-02-18",
      "headline": "Rajpal Yadav case: Lender says he cried for repayment; calls it loan, not investment Businessman Madhav Gopal Agrawal opened up about his financial dispute with Rajpal Yadav, claiming the money given for the actor's directorial debut was a loan, not an investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyan-41st-birthday-celebration-family-friends-tamil-film-seyon-2870076-2026-02-18",
      "headline": "Inside Sivakarthikeyan's 41st birthday celebration with family and friends Tamil actor Sivakarthikeyan celebrated his 41st birthday with family and friends in Chennai. Videos from the birthday bash have been widely circulated on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shia-labeouf-arrested-mardi-gras-fight-new-orleans-2870089-2026-02-18",
      "headline": "Actor Shia LaBeouf arrested after alleged Mardi Gras fight in New Orleans Actor Shia LaBeouf was arrested after allegedly assaulting two men during Mardi Gras celebrations in New Orleans. The incident adds to his history of legal troubles and public controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/miley-cyrus-announces-homecoming-as-hannah-montana-returns-in-march-2870081-2026-02-18",
      "headline": "Miley Cyrus announces homecoming as Hannah Montana returns in March Miley Cyrus is set to celebrate 20 years of Hannah Montana with a special premiere this March on Disney+. The anniversary event will feature a live conversation, recreated sets and unseen archival footage from the iconic series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-review-animated-sports-drama-female-underdog-story-inspires-2870065-2026-02-18",
      "headline": "GOAT review: This heartfelt animated sports drama works as much for kids as adultsRelease Date:Fri Feb 20, 2026 GOAT movie review: Animated film GOAT tells the inspiring story of a young goat chasing his sports dreams. The film explores themes of resilience, community, and breaking gender norms in a vibrant fantasy world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/o-romeo-box-office-collection-day-5-detailed-report-shahid-kapoor-film-steady-nears-rs-50-crore-2870061-2026-02-18",
      "headline": "O' Romeo box office Day 5: Shahid Kapoor's film steady, nears Rs 50 crore Vishal Bhardwaj's O' Romeo, starring Shahid Kapoor and Triptii Dimri, continued a steady box office run after a decent opening weekend. Here's the day-wise breakup and how it compares to Shahid's recent releases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-speaks-out-on-health-scare-sensory-loss-that-paused-his-career-in-2025-2870047-2026-02-18",
      "headline": "Mammootty speaks out on health scare, sensory loss that paused his career in 2025 Malayalam actor Mammootty has revealed that he lost his sense of smell and taste during a health issue in 2025, sharing details of his experience and recovery process. He has since returned to acting, resuming work on major film projects."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galgotias-university-asked-to-vacate-india-ai-summit-after-china-made-robodog-fiasco-sources-2870105-2026-02-18",
      "headline": "Galgotias University asked to vacate AI Summit after Chinese robodog fiascoGalgotias University, located in Noida, was directed to pull out of the AI Summit after facing massive backlash on social media over the robodog row. Even its statement that it never claimed to have built the device was fact-checked on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/ammnad-shakeel-butt-australia-tour-controversy-lie-protect-pakistan-2870181-2026-02-18",
      "headline": "Pak hockey captain admits lying about Sydney horror after videos surfaced in IndiaPakistan hockey captain Ammad Shakeel Butt has admitted he lieed about the recent Australia tour fiasco, during which players were made to do daily chores and left without proper hotel accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ca-husband-kills-pregnant-bank-manager-wife-stages-robbery-valentines-day-affair-suspicion-haryana-2870023-2026-02-18",
      "headline": "Gurugram CA kills pregnant banker wife day after celebrating Valentine's DayThe victim, Mehak, a bank manager from Haryana, who had been married for four months, was found dead near a canal after the accused called Dial 112 claiming unidentified men had attacked them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-ias-officer-chartered-flight-nilesh-ramchandra-deore-rjd-congress-bjp-nitish-kumar-2870124-2026-02-18",
      "headline": "Can't a Dalit fly? Bihar IAS officer's charter flight for family sparks rowA chartered flight from Delhi to Patna taken by a Bihar-cadre IAS officer and his family has triggered a political storm over privilege and propriety. After a Congress MLA raised questions over who paid for the trip, a BJP minister invoked the officer's Dalit identity to defend him. He turned the row into a slugfest charged with caste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/galgotias-university-ai-summit-row-timeline-rs-350-crore-ai-bet-to-robodog-fraud-2870198-2026-02-18",
      "headline": "From Rs 350 crore AI bet to robodog row: The 12-day Galgotias AI spiralGalgotias University announced a Rs 350+ crore AI push days before the AI Impact Summit 2026. At the summit, a Chinese robodog was presented as campus-developed, triggering backlash, late-night clarifications, and reports of eviction. In less than two weeks, a flagship AI showcase turned into a credibility crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-uae-sohaib-khan-story-bihar-dubai-jamia-delhi-2870205-2026-02-18",
      "headline": "Bihar to Dubai via Delhi: UAE star Sohaib Khan's long road to the T20 World CupAfter years of trying to break into India's domestic circuit, Bihar-born Sohaib Khan has finally found his stage. Now a core member of the UAE cricket team, the 27-year-old returned to Delhi and made a mark in the T20 World Cup. Here's his story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-protests-imran-khan-eyesight-sisters-asim-munir-mohsin-naqvi-threats-2870225-2026-02-18",
      "headline": "Fresh protests rock Pak over Imran Khan, sisters accuse Mohsin Naqvi of threatsThousands of Imran Khan's supporters occupied Pakistan's Attock Bridge on Wednesday, cutting off Khyber Pakhtunkhwa from the rest of the country. The fresh round of protests comes after a Supreme Court-appointed lawyer said Imran, lodged in jail since 2023, was going blind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/disorganised-pr-spectacle-rahul-gandhi-slams-ai-summit-over-glagotias-robodog-row-ai-summit-2870159-2026-02-18",
      "headline": "Disorganised PR spectacle: Rahul Gandhi slams AI Summit over Galgotias robodog rowFollowing the robodog controversy, Rahul Gandhi slammed the Narendra Modi government and the AI summit on X, calling it a disorganised PR spectacle that showcased Chinese products instead of leveraging India's talent and data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/punjab-bride-showered-with-rs-85-crore-at-wedding-groom-family-denies-claim-tarn-taran-video-2870100-2026-02-18",
      "headline": "Punjab bride showered with Rs 8.5 crore at wedding? Groom's family denies claimA video from the ceremony in Tarn Taran, which has gone viral, shows the bride standing at the venue as currency notes are showered on her - a customary gesture at many Punjabi weddings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-extends-ai-summit-by-a-day-due-to-overwhelming-response-exhibition-to-continue-till-feb-21-2870200-2026-02-18",
      "headline": "AI Summit extended by a day; event to continue till February 21The government has extended the India AI Impact Summit 2026 by a day until February 21, citing an overwhelming response from visitors and exhibitors. So far, over 2.5 lakh visitors have visited the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-today-ai-summit-2026-vishal-sikka-says-talk-of-agi-is-nonsense-because-ai-is-just-a-tool-2870127-2026-02-18",
      "headline": "Vishal Sikka says talk of AGI is nonsense because AI is just a toolAt India Today AI Summit 2026, Vishal Sikka, founder and CEO of Vianai, discussed how the AI landscape has changed over the years. Sikka also talked about the need for government regulation in AI. He was also part of Infosys' initial AI plans a decade ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ceos-of-chanel-alphabet-adobe-all-indian-emmanuel-macron-big-praise-for-india-2870041-2026-02-18",
      "headline": "CEOs of Chanel, Alphabet, Adobe all Indian: Macron's big praise for IndiaEmmanuel Macron praised India's rising global influence in innovation at the India–France Innovation Forum in Mumbai, citing Indian-origin CEOs at IBM and Microsoft. He also noted that Chanel's CEO is from Kolhapur, Maharashtra, where he was delivering his address."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/surprise-shark-caught-on-camera-for-the-first-time-in-antarcticas-freezing-waters-2870244-2026-02-18",
      "headline": "Watch: Shark caught on camera for the first time in AntarcticaThe shark, estimated to be 3 to 4 meters long, appeared at a depth of about 490 meters, where water temperatures hovered just above freezing at 1.27°C."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/untying-pyjama-strings-counts-as-rape-attempt-says-supreme-court-junks-allahabad-high-court-remark-2870102-2026-02-18",
      "headline": "Untying pyjama strings counts as rape attempt, says SC, junks high court remarkThe Supreme Court disagreed with the High Court's view that the accused grabbing the breasts of an 11-year-old girl, breaking the string of her pyjamas, and trying to drag her beneath a culvert amounted only to preparation and not attempted rape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-t20-world-cup-2026-super-8-redemption-story-2870059-2026-02-18",
      "headline": "Muqaddar ka Sikandar: How Raza turned heartbreak into happiness for ZimbabweT20 World Cup: Zimbabwe missed out on qualifying for the tournament in 2024, but this time around, Sikandar Raza's men have secured their berth in the Super 8. It was Raza, with his inspirational leadership and attitude, aims to keep his side grounded and continue their journey towards bigger goals at the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-suffered-minor-brain-haemorrhage-underwent-procedure-doctor-shares-health-update-2870228-2026-02-18",
      "headline": "Salim Khan suffered minor brain haemorrhage, underwent procedure: DoctorSalim Khan has been placed on a ventilator after suffering a minor brain haemorrhage, doctors at Lilavati Hospital have confirmed. A procedure was performed to stabilise his condition, and he is currently under observation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/goat-review-animated-sports-drama-female-underdog-story-inspires-2870065-2026-02-18",
      "headline": "GOAT review: This heartfelt animated sports drama works as much for kids as adultsRelease Date:Fri Feb 20, 2026GOAT movie review: Animated film GOAT tells the inspiring story of a young goat chasing his sports dreams. The film explores themes of resilience, community, and breaking gender norms in a vibrant fantasy world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/metallica-nothing-else-matters-uttar-pradesh-akhilesh-yadav-samajwadi-party-sp-chief-reel-amuses-puzzles-metalheads-2869641-2026-02-18",
      "headline": "Akhilesh uses Metallica to boast of metalled highway, Reel baffles metalheadsSP chief Akhilesh Yadav's use of Metallica's Nothing Else Matters to counter Chief Minister Yogi Adityanath's development pitch amused many on the internet. Did the soundtrack carry an optics, or was it just a random choice for an Instagram Reel by Akhilesh, whose musical taste inclines toward rock and metal?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/blinkit-faces-police-action-after-knives-sold-on-app-used-in-two-delhi-murders-2870173-2026-02-18",
      "headline": "Blinkit faces police action after knives sold on app used in two Delhi murdersPolice verified the claim by posing as customers and successfully ordering similar prohibited knives. Subsequent raids at multiple Blinkit stores led to the recovery of over 50 button-operated knives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-2026-must-win-clash-colombo-2870028-2026-02-18",
      "headline": "PAK vs NAM weather forecast: Will Pakistan suffer Australia's fate?Pakistan takes on Namibia in a crucial Group A fixture at the Sinhalese Sports Club in Colombo, needing a win to stay alive in the T20 World Cup 2026. But will the weather play spoilsport during the contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-tribute-late-father-in-law-sunil-malhotra-death-wedding-pictures-you-welcomed-me-with-open-arms-2870122-2026-02-18",
      "headline": "Kiara Advani pays tribute to late father-in-law: You welcomed me with open armsActor Kiara Advani paid tribute to her father-in-law, Sunil Malhotra, a day after he died in Delhi. The actor shared wedding photos with actor-husband Sidharth Malhotra and remembered his warmth, wisdom and love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/ai-job-insecurity-among-indian-millennials-rises-amid-automation-2870103-2026-02-18",
      "headline": "The disposable worker syndrome: Why 'millennials' fear becoming replaceableMillennials in India are increasingly anxious about AI replacing their jobs. It's not about layoffs. It's about relevance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/what-happend-happened-indore-man-smiles-when-asked-motive-for-girlfriend-murder-2870066-2026-02-18",
      "headline": "What happened, happened: Indore man smiles when asked motive for girlfriend's murderDays after allegedly strangling his 24-year-old girlfriend and violating her body, accused Piyush Dhamnotia showed no remorse. Smiling, he told India Today, \"What had to happen has happened,\" and declined to explain further as police escorted him from a station in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/general-catalyst-ceo-hemant-taneja-ai-opportunities-india-today-ai-summit-2026-2870090-2026-02-18",
      "headline": "Businesses won't be competitive if they don't lean into AI: Hemant TanejaSpeaking at the India Today AI Summit 2026, General Catalyst CEO Hemant Taneja described AI as a \"transformative force\" and argued that even if the current moment carries elements of hype, it is laying the groundwork for long-term change."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-racism-benfica-prestianni-ucl-controversy-2870264-2026-02-18",
      "headline": "Vinicius Jr. racism row: What happened in Lisbon during Real Madrid vs Benfica The Real Madrid-Benfica clash in the UEFA Champions League ended in controversy as Vinicius Jr. alleged that Gianluca Prestianni racially abused him after he got the decisive goal in Lisbon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-uae-sohaib-khan-story-bihar-dubai-jamia-delhi-2870205-2026-02-18",
      "headline": "Bihar to Dubai via Delhi: UAE star Sohaib Khan's long road to the T20 World Cup After years of trying to break into India's domestic circuit, Bihar-born Sohaib Khan has finally found his stage. Now a core member of the UAE cricket team, the 27-year-old returned to Delhi and made a mark in the T20 World Cup. Here's his story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jammu-kashmir-ranji-trophy-finals-2024-nabi-nine-wickets-samad-batting-2870187-2026-02-18",
      "headline": "Ranji Trophy: Jammu and Kashmir script history, stun Bengal to reach maiden final Jammu and Kashmir reached the Ranji Trophy finals for the first time in 67 years after defeating Bengal in the semifinal. Auqib Nabi's stunning nine-wicket match haul and their IPL star Abdul Samad's fearless strokeplay ensured their passage into the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/ammnad-shakeel-butt-australia-tour-controversy-lie-protect-pakistan-2870181-2026-02-18",
      "headline": "Pak hockey captain admits lying about Sydney horror after videos surfaced in India Pakistan hockey captain Ammad Shakeel Butt has admitted he lieed about the recent Australia tour fiasco, during which players were made to do daily chores and left without proper hotel accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-india-boycott-u-turn-naqvi-dissanayake-t20-world-cup-2870101-2026-02-18",
      "headline": "Mohsin Naqvi names real hero behind Pakistan's India match boycott U-turn T20 World Cup: Mohsin Naqvi said that the actual hero behind Pakistan's India match boycott U-turn was Sri Lanka president Anura Kumara Dissanayake and thanked him for his timely intervention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-t20-world-cup-2026-super-8-redemption-story-2870059-2026-02-18",
      "headline": "Muqaddar ka Sikandar: How Raza turned heartbreak into happiness for Zimbabwe T20 World Cup: Zimbabwe missed out on qualifying for the tournament in 2024, but this time around, Sikandar Raza's men have secured their berth in the Super 8. It was Raza, with his inspirational leadership and attitude, aims to keep his side grounded and continue their journey towards bigger goals at the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-namibia-t20-world-cup-2026-must-win-clash-colombo-2870028-2026-02-18",
      "headline": "PAK vs NAM weather forecast: Will Pakistan suffer Australia's fate? Pakistan takes on Namibia in a crucial Group A fixture at the Sinhalese Sports Club in Colombo, needing a win to stay alive in the T20 World Cup 2026. But will the weather play spoilsport during the contest?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-biopic-inspired-usman-tariq-pakistan-t20-world-cup-comeback-2870024-2026-02-18",
      "headline": "How Dhoni's Biopic sparked Usman Tariq's stunning cricket comeback T20 World Cup: Pakistan's Usman Tariq credited MS Dhoni's biopic for inspiring him to make a comeback in cricket and make his bow in the ongoing T20 World Cup 2026. Tariq has been one of Pakistan's main bowlers during the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-preview-ahmedabad-pitch-report-predicted-playing-xi-2869857-2026-02-18",
      "headline": "IND vs NED: India look to enter Super Eight with a perfect group stage record T20 World Cup, India vs Netherlands: Already through to the Super Eights, India will look to extend their unbeaten run and cap off their group-stage campaign on a high when they take on the Netherlands at the Narendra Modi Stadium in Ahmedabad on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-vs-namibia-preview-pitch-report-predicted-xi-2869990-2026-02-18",
      "headline": "Bruised Pakistan hope to avoid Namibian nightmare in must-win game T20 World Cup: Pakistan play their final group-stage game in the T20 World Cup against Namibia. A loss in this match will mean that Pakistan will get knocked out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/usman-tariq-press-conference-pakistan-vs-namibia-t20-world-cup-2869989-2026-02-18",
      "headline": "No panic in Pakistan camp: Usman Tariq on pressure before must-win Namibia clashT20 World Cup 2026, PAK vs NAM: Speaking to the reporters before Pakistan's must-win clash against Namibia, Usman Tariq opened up on the atmosphere inside the dressing room following the 61-run defeat to India on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-tariq-babar-azam-shaheen-afridi-pakistan-press-conference-t20-world-cup-2869987-2026-02-18",
      "headline": "Babar Azam, Shaheen Afridi under pressure after India debacle? Usman Tariq opens upT20 World Cup, PAK vs NAM: Usman Tariq has backed Shaheen Shah Afridi and Babar Azam to bounce back following their disappointing performance against India, which saw Pakistan suffer a 61-run defeat at the R. Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-t20-world-cup-win-scotland-dipendra-airee-mumbai-2869974-2026-02-17",
      "headline": "Nepal end 4352-day long wait to finish T20 World Cup campaign on a highT20 World Cup, SCO vs NEP: Rohit Paudel's Nepal finished their campaign on a positive note after beating Nepal by seven wickets on Tuesday at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-india-australia-t20-world-cup-kaif-comments-2869954-2026-02-17",
      "headline": "India would have beaten Australia had Hardik Pandya played World Cup 2023 final: KaifT20 World Cup: Mohammad Kaif said that Hardik Pandya would have made the difference for India against Australia had he played in the 2023 ODI World Cup. On Tuesday, the Aussies were eliminated at the group stage of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/imran-khan-jail-sourav-ganguly-gavaskar-kapil-letter-2869934-2026-02-17",
      "headline": "Hope Imran Khan gets the right treatment: Sourav GangulyFormer India captain Sourav Ganguly backed the letter signed by 14 former captains to the Pakistan government, seeking fair treatment for Imran Khan. Ganguly said that Imran put Pakistan on the world map and deserved to be treated well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajasthan-royals-indemnity-waiver-jaipur-stadium-safety-concerns-2869875-2026-02-17",
      "headline": "Royals seek waiver from state govt to host IPL in Jaipur after safety concernsRajasthan Royals are racing to get their home ground ready for the Indian Premier League and have sought an indemnity waiver from the state government to host matches in Jaipur. The request follows concerns over the venue's readiness raised by an independent auditor and the Board of Control for Cricket in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-ind-vs-ned-sitanshu-kotak-press-conference-2869879-2026-02-17",
      "headline": "No need to overanalyse Abhishek Sharma's duck against Pakistan: Sitanshu KotakT20 World Cup, IND vs NED: India batting coach Sitanshu Kotak said that there was no need to overanalyse Abhishek Sharma's form in the tournament. Abhishek came back into the line-up after recovering from illness, but got out for a duck against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-semi-final-karnataka-vs-uttarakhand-devdutt-padikkal-2869863-2026-02-17",
      "headline": "Devdutt Padikkal charges towards India spot as Karnataka inch closer to Ranji finalDevdutt Padikkal scored a career-best 232 to help Karnataka to a mammoth total in the Ranji Trophy semi-finals. Should Indian selectors consider him for the No.3 Test spot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-t20-world-cup-predicted-xi-arshdeep-singh-2869865-2026-02-17",
      "headline": "IND vs NED Predicted XI: Will Arshdeep Singh replace Kuldeep Yadav?T20 World Cup, IND vs NED: Suryakumar Yadav's India have qualified for the Super 8 and are favourites to finish at the top of their group. One potential change could be bringing Arshdeep Singh back in place of Kuldeep Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-plan-to-host-one-bbl-game-in-india-tnca-confirms-discussions-2869853-2026-02-17",
      "headline": "Cricket Australia plan to host one BBL game in India, TNCA confirms discussionsCricket Australia is exploring the possibility of staging a Big Bash League match in India next season as part of a broader strategy to tap into the country's vast and lucrative cricket market, according to a report by Sen Cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-netherlands-press-conference-bumrah-abhishek-2869822-2026-02-17",
      "headline": "No rest for Bumrah: India want valuable Ahmedabad experience before Super 8T20 World Cup: India will not be resting Jasprit Bumrah and Abhishek Sharma in their match against the Netherlands, said batting coach Sitanshu Kotak. India are playing their last group-stage game in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-india-vs-netherlands-captain-scott-edwards-pre-match-press-conference-2869814-2026-02-17",
      "headline": "Netherlands urge more bilateral cricket for associates after strong T20 WC showNetherlands captain Scott Edwards said that a string of impressive performances from associate nations in the T20 World Cup should pave the way for more bilateral cricket against Test-playing countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-and-kashmir-near-maiden-final-auqib-nabi-2869777-2026-02-17",
      "headline": "Auqib Nabi outshines Bengal's Mohammed Shami as J&K close in on maiden finalAuqib Nabi claimed a nine-wicket match haul to outshine Mohammed Shami and push Jammu and Kashmir to the brink of a maiden Ranji Trophy final after Bengal were bowled out for 99 on day three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sikandar-raza-zimbabwe-super-8-icc-t20-world-cup-fans-2869775-2026-02-17",
      "headline": "Sikandar Raza revels in emotional celebration with fans after Zimbabwe's Super 8 berthT20 World Cup, IRE vs ZIM: Sikandar Raza and his Zimbabwean teammates celebrated with passionate fans after securing a Super 8 spot. Following the match, Raza thanked the supporters and pledged to keep Zimbabwe's flag flying high."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-scotland-vs-nepal-live-score-today-match-update-mumbai-2869742-2026-02-17",
      "headline": "Scotland vs Nepal Highlights T20 World Cup 2026 updates from MumbaiScotland (SCO) vs Nepal (NEP) Highlights, T20 World Cup: Nepal beat Scotland by 7 wickets after chasing down 171 with three balls to spare at the Wankhede Stadium in Mumbai. Dipendra Singh Airee made an unbeaten 50 off 23 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-australia-crash-out-zimbabwe-super-8-stage-washout-pallekele-2869716-2026-02-17",
      "headline": "Australia out, Zimbabwe reach Super 8 stage after Pallekele washoutT20 World Cup, IRE vs ZIM: Australia have been knocked out of the competition after the clash between Ireland and Zimbabwe in Pallekele on Tuesday was abandoned due to rain. The abandoned fixture sealed Zimbabwe's qualification for the Super 8 stage alongside Sri Lanka from Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-moved-out-of-india-in-future-2869698-2026-02-17",
      "headline": "IND-PAK conflict could force future World Cup out of India: ReportT20 World Cup: The geopolitical conflict between India and Pakistan might force future ICC tournaments outside the subcontinent, Australian media reported on February 16. As per the report, Australia could be the favoured destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lone-female-on-grid-f1-aspirant-atiqa-mir-climbs-higher-on-wsk-ladder-2869597-2026-02-17",
      "headline": "Lone female on grid,  F1 aspirant Atiqa Mir climbs higher on WSK ladderIndian racing prodigy Atiqa has shown skill and maturity beyond her years after making a voluntary switch from the Mini to the far more demanding Junior category, producing standout performances in the early part of her 2026 international karting season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-vs-zimbabwe-t20-world-cup-live-score-today-match-updates-pallekele-2869592-2026-02-17",
      "headline": "IRE vs ZIM highlights : Australia out, Zimbabwe reach Super 8 after washoutIreland (IRE) vs Zimbabwe (ZIM) Highlights, T20 World Cup: The Group clash between Ireland cricket team and Zimbabwe cricket team in Pallekele was washed out due to heavy rain. The shared point confirmed Zimbabwe's place in the Super 8 and knocked out Ireland and 2021 champions Australia national cricket team from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-canada-t20-world-cup-match-report-glenn-phillips-yuvraj-samra-chennai-2869589-2026-02-17",
      "headline": "New Zealand storm into Super 8s, knock Afghanistan out of T20 World CupT20 World Cup: New Zealand stormed into the Super 8s with an eight-wicket win over Canada in Chennai. Glen Phillips and Rachin Ravindra's chase ended Afghanistan's campaign despite Yuvraj Samra's record-breaking century."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}