{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-declines-to-6-year-low-of-316-in-april-2724166-2025-05-13",
      "headline": "Retail inflation declines to 6-year low of 3.16% in AprilRetail inflation dropped to a six-year low of 3.16% in April 2025 from 3.34% in March, thanks to cheaper vegetables, fruits, pulses, and protein-rich food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-should-your-home-loan-decide-for-you-2724141-2025-05-13",
      "headline": "Old vs new tax regime: Should your home loan decide for you?Home loan benefits are important, but they aren't the only ones to think about. Other deductions under the old regime, like Section 80D (health insurance), Section 80G (donations) and HRA (House Rent Allowance), also make a difference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1282-points-lower-nifty-below-24600-infosys-down-nearly-4-percent-2724104-2025-05-13",
      "headline": "Sensex ends 1,282 points lower, Nifty below 24,600; Infosys down nearly 4%The S&P BSE Sensex was down by 1,281.68 points to end at 81,148.22, while the NSE Nifty50 lost 346.35 points to close at 24,578.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nissan-q4-result-loss-usd-45-billion-japan-carmaker-honda-jv-job-cut-2724084-2025-05-13",
      "headline": "Nissan reports loss of $4.5 billion amid financial woesNissan Q4: This is one of the biggest yearly losses in the company's history and a major drop compared to the previous year's net profit of 426.6 billion yen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/staying-invested-and-staying-patient-radhika-gupta-md-and-ceo-of-edelweiss-mutual-fund-advice-after-stock-market-surge-may-12-2724069-2025-05-13",
      "headline": "'Staying invested and staying patient': Radhika Gupta's advice after market surgeIndian stock markets surged over 3.7% on May 12, their strongest performance in nearly a year. The rally came after a ceasefire agreement between India and Pakistan over the weekend, along with positive signals from global markets and strong mutual fund inflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crypto-platforms-asked-to-track-jk-transactions-for-money-laundering-report-2724035-2025-05-13",
      "headline": "Crypto platforms asked to track J&K transactions for money laundering: ReportOver the last year, exchanges have made crypto withdrawals more restrictive, requiring users to provide more information about who is receiving the funds and why. These measures aim to curb misuse, given the anonymous and borderless nature of crypto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-recovers-as-us-china-tariff-truce-spurs-bargain-buying-2724029-2025-05-13",
      "headline": "Gold recovers as US-China tariff truce spurs bargain-buyingSpot gold was up 0.6% at $3,254.39 an ounce, as of 0639 GMT. Bullion recorded a 2.7% decline in the previous session. US gold futures GCcv1 were up 1% at $3,258.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-sensex-nifty-fall-1000-points-investors-not-panic-dalal-street-bullish-experts-stay-calm-2724017-2025-05-13",
      "headline": "Sensex drops over 1,200 points, but here's why you shouldn't panicThe market pulled back from the gains made in the last session. The Sensex dropped over 1,000 points in early trade, and Nifty also slipped as investors booked profits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-shares-continue-to-rally-up-4-percent-today-buy-sell-or-hold-2724013-2025-05-13",
      "headline": "Yes Bank shares continue to rally, up 4% today. Buy, sell or hold?The stock has now climbed nearly 19% in just five trading sessions and 21% in a month, but top brokerages remain unconvinced. Most still have a 'sell' or 'neutral' rating on the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-all-7-forms-out-key-changes-taxpayers-must-know-itr-1-itr-2-itr-3-itr-4-itr-5-itr-6-itr-7-2723975-2025-05-13",
      "headline": "ITR Filing 2025: All 7 forms out, key changes taxpayers must knowOne big change this year affects salaried individuals and small business owners who earn long-term capital gains (LTCG) from listed shares or mutual funds. If the gains are up to Rs 1.25 lakh a year, they can now file returns using ITR-1 or ITR-4 forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/swiggy-share-price-fall-7-percent-all-time-low-52-week-down-why-ipo-lock-in-period-expire-2723951-2025-05-13",
      "headline": "Explained: Why Swiggy shares fell up to 7% to hit 52-week low todaySwiggy shares have fallen around 45% since the beginning of the year. Over the past month, the stock has dropped 10%, and in the last three months, it has declined by 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-announce-q4-results-today-what-to-expect-pat-revenue-profit-2723930-2025-05-13",
      "headline": "Tata Motors to announce Q4 results today. Here's what to expectTata Motors stock: The company's share price fell nearly 1% during morning trade on Tuesday. It opened at Rs 720.55 and dropped to a day's low of Rs 714.35 as investors showed caution ahead of the results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-counter-tariffs-on-us-goods-over-steel-and-aluminium-duties-2723916-2025-05-13",
      "headline": "India proposes retaliatory tariffs on select US goods over steel duties: ReportIndia is mulling retaliatory duties on select US goods exported to the country in response to Washington's tariffs on steel and aluminium products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-fall-after-ceasefire-rally-why-is-dalal-street-declining-today-2723897-2025-05-13",
      "headline": "Sensex sinks over 1,200 points: Why is the stock market falling today?At 1:03 pm, the BSE Sensex had dropped 1150.76 points to 81,285.65, while the NSE Nifty50 slipped 284.80 points to 24,641.65. Most Nifty sectoral indices were mixed, reflecting broader uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-300-points-lower-nifty-above-24800-infosys-falls-1-percent-2723885-2025-05-13",
      "headline": "Sensex, Nifty in red after Monday's rally; IT stocks take biggest hitThe S&P BSE Sensex was down by 1,000.64 points to 81,429.26, while the NSE Nifty50 lost 261.75 points to 24,662.95 as of 10:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-pharma-shares-us-president-donald-trump-order-trading-dalal-street-today-2723881-2025-05-13",
      "headline": "Pharma stocks to be in focus today on Dalal Street. 3 things to knowThe sudden focus on pharmaceutical shares is due to a new executive order signed by US President Donald Trump on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-rally-dalal-street-may-13-trading-setup-2723872-2025-05-13",
      "headline": "Stock market opening: Will Sensex, Nifty continue their rally today?GIFT Nifty on the NSE International Exchange was trading 26 points lower, or 0.10%, at 24,922 as of 8:13 am. This signals a weaker start for domestic markets on Tuesday, following Monday's steep gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-13-nse-bse-trading-tata-steel-hero-motocorp-airtel-tata-motors-2723862-2025-05-13",
      "headline": "Stocks to watch on May 13: Tata Steel, Hero MotoCorp, Airtel, Tata MotorsA ceasefire agreement between India and Pakistan gave a boost to investor confidence on Monday, leading to a sharp rise on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-truce-sparks-wall-street-rally-sp-500-hits-two-month-high-glbs-2723824-2025-05-13",
      "headline": "US-China tariff truce sparks Wall Street rally, S&P 500 hits two-month highWall Street surged Monday as the S&P 500 hit a two-month high, fueled by a temporary US-China tariff truce that eased trade war fears and boosted investor confidence in global markets.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nissan-to-cut-20000-jobs-as-losses-mount-and-sales-drop-2723610-2025-05-12",
      "headline": "Nissan to cut 20,000 jobs as losses mount and sales drop: ReportNissan recently warned that it expects a record net loss of 700-750 billion yen ($4.74–$5.08 billion) for the last financial year, mainly due to impairment charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-6-must-know-tips-before-you-file-your-tax-return-2723569-2025-05-12",
      "headline": "ITR filing 2025: 6 Must-know tips before you file your tax returnBefore you even think about filing your tax return, make sure your Aadhaar is linked to your PAN. Also, choosing the correct ITR form is important. Filing the wrong one may lead to rejection of your return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-jumps-nearly-3000-points-nifty-above-24900-as-india-pakistan-ceasefire-fuels-relief-rally-2723556-2025-05-12",
      "headline": "Sensex jumps nearly 3,000 points as India-Pakistan ceasefire fuels relief rallyThe S&P BSE Sensex jumped 2,975.43 points to close at 82,429.90, while the NSE Nifty50 added 916.70 points to end at 24,924.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-hcltech-tech-mahindra-tcs-why-are-it-stocks-rising-today-2723539-2025-05-12",
      "headline": "Infosys, HCLTech, Tech Mahindra, TCS: Why are IT stocks rising today?The Nifty IT index surged over 6%, emerging as the top sectoral gainer on the NSE. Oracle Financial Services Software (OFSS) led the rally with a nearly 9% jump, followed by Coforge and Persistent Systems, which rose over 8% each. Blue-chip heavyweight Infosys gained close to 8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/interglobe-aviation-ltd-indigo-shares-rise-10-percent-reason-notam-notice-2723531-2025-05-12",
      "headline": "IndiGo takes off on D-Street with 10% jump: What's behind the rally?IndiGo's share price jumped as much as 9.78% to touch a high of Rs 5,599. By noon, the stock was trading 7.45% higher at Rs 5,479.85. With this rise, IndiGo's share price has gone up 19.35% so far in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loses-shine-as-us-china-trade-talks-ease-market-jitters-2723511-2025-05-12",
      "headline": "Gold loses shine as US-China trade talks ease market jittersThe US and China ended high-stakes trade talks on a positive note on Sunday, with US officials touting a \"deal\" to reduce the U.S. trade deficit, while Chinese officials said they had reached an \"important consensus\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-2600-points-to-cross-82000-mark-for-1st-time-in-7-months-2723495-2025-05-12",
      "headline": "Sensex surges over 3,000 points, best rally in a yearThe stock market rally was led by easing geopolitical tensions, supportive global cues, and renewed investor confidence after a sovereign credit upgrade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-fraud-auditors-ask-discrepancy-market-news-report-2723466-2025-05-12",
      "headline": "IndusInd Bank faces tough questions from auditors over possible fraud: ReportSo far, IndusInd Bank has described the issue as a 'discrepancy'. This is the term it has used in its stock exchange notices and in talks with analysts and credit rating firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-opting-for-old-tax-regime-here-is-why-form-10-iea-is-a-must-itr-3-itr-4-2723486-2025-05-12",
      "headline": "ITR Filing 2025: Opting for old tax regime? Here's why Form 10-IEA is a mustForm 10-IEA is a declaration form for those who do not want to follow the new tax regime. If you earn income from a business or profession, and you wish to continue with the old tax regime, this form is essential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/united-states-china-90-day-reciprocal-tariff-pause-slashing-levels-donald-trump-xi-jinping-agreement-deal-consensus-2723464-2025-05-12",
      "headline": "US and China pause tariff war for 90 days, to slash reciprocal duties by 115%Under the agreement, the US will reduce tariffs on Chinese goods from 145% to 30%, while China will slash its tariffs on American imports from 125% to 10%, according to a joint statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-expectations-what-next-for-dalal-street-investors-after-india-pakistan-ceasefire-rally-2723445-2025-05-12",
      "headline": "Dalal Street soars after ceasefire. Should you buy, hold or sell stocks?After today's euphoric rally driven by the ceasefire between India and Pakistan, investors are basking in green screens. But with uncertainty still looming, the big question remains—what should they do next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-rise-9-percent-why-sbmc-stake-sale-sbi-reason-japan-2723439-2025-05-12",
      "headline": "YES Bank share price rises 9%. Here's whyThe stake sale news led to a rise in Yes Bank's stock price, making it one of the top gainers of the day. The share price of Yes Bank went up by as much as 9% during the trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-services-simplified-now-check-your-pf-balance-with-just-a-call-or-sms-2723437-2025-05-12",
      "headline": "EPFO services simplified: Now check your PF balance with just a call or SMSBefore you use these services, make sure your Universal Account Number (UAN) is active and linked to at least one of these: your bank account, Aadhaar number or PAN. Also, your mobile number must be registered with your UAN on the EPFO portal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistans-stock-exchange-halts-trading-for-an-hour-heres-why-2723417-2025-05-12",
      "headline": "Pakistan's stock exchange halts trading for an hour. Here's whyAccording to a notification from the Pakistan Stock Exchange (PSX), all equity and equity-based markets were temporarily suspended after the KSE-30 index rose more than 5% from the previous session's close — the threshold for a market halt under PSX rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-bse-sensex-rises-2000-points-top-stocks-check-list-2723404-2025-05-12",
      "headline": "Eternal, Adani Ports, Infosys: Top stocks as Sensex jumps over 2,000 pointsEternal (Zomato) led the gains, surging nearly 5% to become the top performer on the 30-share BSE Sensex. Other major gainers included Adani Ports, NTPC and HCLTech, all trading up more than 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-india-trade-with-turkey-azerbaijan-suffer-amid-tensions-with-pakistan-2723400-2025-05-12",
      "headline": "Will India's trade with Turkey, Azerbaijan suffer amid tensions with Pakistan?Over the years, the trade between India and Azerbaijan has grown significantly, jumping from $50 million in 2005 to $1.435 billion in 2023. Further, India imported goods worth $1.235 billion and exported products worth $201 million to Azerbaijan, according to the official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-stock-market-rise-9-percent-india-dalal-street-rally-ceasefire-sensex-nifty-2723383-2025-05-12",
      "headline": "Pakistan stock market jumps over 9% as India ceasefire brings calmPakistan's benchmark index surged over 9% on Monday, while Dalal Street also saw gains with Sensex and Nifty jumping 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-strong-rally-investors-celebrate-india-pakistan-ceasefire-what-to-expect-next-on-dalal-street-2723380-2025-05-12",
      "headline": "Sensex, Nifty up 3% after India-Pakistan ceasefire. What should investors do?With tensions easing and markets surging, global cues and earnings looking strong, should investors ride the momentum or wait for clearer signals before taking fresh positions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-bull-run-sensex-nifty-up-3-percent-investor-wealth-rs-11-lakh-crore-stocks-driving-rally-2723370-2025-05-12",
      "headline": "Investors add Rs 11 lakh crore on D-Street: Which stocks are driving the rally?The Sensex jumped over 2,000 points, while the Nifty came close to the 24,700 mark. The overall mood on the street was upbeat, as investors welcomed signs of calm after days of concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-strong-opening-today-india-pakistan-ceasefire-strong-domestic-indicators-2723354-2025-05-12",
      "headline": "Sensex surges over 3,000 points. Why is the stock market rallying today?Stock market rally today: The BSE Sensex was up 2,975.93 points to 82,430.40 at around 3:26 pm, while the NSE Nifty50 climbed 920.50 points to trade at 24,928.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-rallies-1700-points-nifty-above-24500-ril-up-2-2723353-2025-05-12",
      "headline": "Sensex rallies 2,000 points; Nifty above 24,500; RIL up 3%The S&P BSE Sensex jumped 1,915.43 points to 81,369.90, while the NSE Nifty50 soared 572.80 points to 24,580.20 as of 9:30 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-jumps-from-10000-feet-in-mission-impossible-8-stunt-2724275-2025-05-13",
      "headline": "Tom Cruise jumps from 10,000 feet in Mission Impossible 8 stuntTom Cruise shared BTS video from 'Mission: Impossible – The Final Reckoning', showcasing his stunt training for 10,000 feet jump from airplane. The film, releasing on May 23, 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amar-kaushik-to-direct-lust-stories-3-with-vikramaditya-motwane-kiran-rao-2724250-2025-05-13",
      "headline": "Amar Kaushik to direct Lust Stories 3 with Vikramaditya Motwane: ReportDirector Amar Kaushik will join Vikramaditya Motwane, Kiran Rao, and Shakun Batra to direct a short film in Netflix's upcoming 'Lust Stories 3'. This will mark Kaushik's first project outside his usual horror-comedy genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-to-postpone-her-cannes-debut-amid-india-pak-tension-2724260-2025-05-13",
      "headline": "Alia Bhatt to postpone her Cannes debut amid India-Pak tensionActor Alia Bhatt is set to postpone her Cannes debut this year due to tensions between India and Pakistan. The actor was set to attend the festival on its opening day, May 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-sreeleela-pose-together-wrap-schedule-of-anurag-basu-untiled-film-2724241-2025-05-13",
      "headline": "Kartik Aaryan shares pic with Sreeleela as they wrap schedule of Anurag Basu's filmKartik Aaryan shared a picture with Sreeleela from the sets of their upcoming film by Anurag Basu. The two shared their excitement as they wrapped a schedule of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kapil-sharmas-kis-kisko-pyaar-karoon-2-to-release-in-september-2724106-2025-05-13",
      "headline": "Kapil Sharma's Kis Kisko Pyaar Karoon 2 to release in September: ReportKapil Sharma will return with 'Kis Kisko Pyaar Karoon 2', which is likely to release on September 26, 2025. The date will mark exactly 10 years since the release of the original film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rounak-gulia-nikhil-singh-battleground-winners-abhishek-malhan-rubina-dilaik-2724217-2025-05-13",
      "headline": "Battleground: Rounak Gulia, Nikhil Singh emerge winnersThe 'Battleground' finale took place on May 10, where Rounak Gulia and Nikhil Singh were announced as the winners in the female and male categories, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-suniel-shetty-shilpa-shetty-dhadkan-re-release-in-theatres-2724207-2025-05-13",
      "headline": "Akshay Kumar, Suniel Shetty and Shilpa Shetty's Dhadkan to re-release in theatresPopular romantic film 'Dhadkan', starring Akshay Kumar, Suniel Shetty, and Shilpa Shetty, is set to re-release in theatres on May 23 in a digitally remastered format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gerard-depardieu-convicted-sexual-assault-french-cinema-2724189-2025-05-13",
      "headline": "French actor Gerard Depardieu convicted of sexual assaultFrench actor Gerard Depardieu has been convicted of sexually assaulting two women on a film set. The verdict marks a significant moment in addressing misconduct in the French film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-office-spinoff-the-paper-announced-to-premiere-in-september-2724147-2025-05-13",
      "headline": "The Office spinoff The Paper announced, to premiere in September'The Office' fans globally have a reason to rejoice as the new spinoff, 'The Paper', has been officially announced. The series will feature fresh cast members, promising to bring back the beloved humour and charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/simi-garewal-cannes-film-festival-red-carpet-debut-aranyer-din-ratri-screening-2724156-2025-05-13",
      "headline": "Simi Garewal to make Cannes red carpet debut for Aranyer Din Ratri screeningVeteran actor Simi Garewal is set to make her Cannes red carpet debut. She will be attending the screening of the 4K restored version of Satyajit Ray's film 'Aranyer Din Ratri' (1970)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bloodlines-actor-brec-bassinger-favourite-death-sequence-final-destination-franchise-exclusive-2724154-2025-05-13",
      "headline": "Brec Bassinger shares favourite death sequence in Final Destination franchiseFinal Destination: Bloodlines actor Brec Bassinger spoke about her experience of joining the Final Destination franchise, which is making a return after 15 years. The actor also spoke about the massive production scale of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-indian-house-adaptation-passion-driven-acting-2724120-2025-05-13",
      "headline": "Nawazuddin Siddiqui skips watching House before Indian adaptationNawazuddin Siddiqui reveals he hasn't watched the original 'House MD' series before starring in the Indian adaptation. He aims to maintain originality and avoid influences while focusing on his passion-driven career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/tom-cruise-meets-influencers-jannat-zubair-avneet-kaur-in-london-2724128-2025-05-13",
      "headline": "Namaste India! Tom Cruise meets influencers Jannat Zubair, Avneet Kaur in LondonHollywood star Tom Cruise recently met Jannat Zubair and Avneet Kaur in London ahead of 'Mission Impossible- The Final Reckoning'.  The film is set to release in India on May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-do-hyun-military-discharge-new-drama-offers-career-comeback-2724098-2025-05-13",
      "headline": "Lee Do-hyun discharged from military service: What's Next for Korean actor?South Korean actor Lee Do-hyun has been officially discharged from his military service after 21 months. His return to the entertainment industry is expected to bring new projects and rekindle his rising career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-wasted-zeenat-amans-comeback-ishaan-khatter-bhumi-pednekar-2724066-2025-05-13",
      "headline": "All smoke, no screen time: How The Royals wasted Zeenat Aman's comebackVeteran actor Zeenat Aman makes her much-anticipated comeback in Netflix's 'The Royals', but her return leaves fans disheartened. Read to find out how her presence was reduced to ornamental screen time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannes-film-festival-2025-homebound-to-charak-indian-films-set-for-global-spotlight-2724076-2025-05-13",
      "headline": "Cannes 2025: Homebound to Charak, Indian films set for global spotlightIndian films are making a strong mark at the Cannes Film Festival 2025 with films including 'Homebound', 'Aranyer Din Ratri', 'Tanvi The Great' and 'Charak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-tory-lanez-attacked-in-prison-while-serving-time-in-megan-thee-stallion-case-2724065-2025-05-13",
      "headline": "Rapper Tory Lanez attacked in prison while serving time in Megan Thee Stallion caseRapper Tory Lanez was stabbed 14 times while serving his time in California prison for shooting American rapper and songwriter Megan Thee Stallion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-joins-prabhas-in-sandeep-vanga-spirit-2724061-2025-05-13",
      "headline": "Deepika Padukone lands her biggest pay cheque ever for Prabhas's SpiritBollywood actor Deepika Padukone is set to star alongside Telugu superstar Prabhas in the highly-anticipated film 'Spirit'. The film marks her return after motherhood and with a record-breaking remuneration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/lee-min-ho-throws-ahn-hyo-seop-into-sea-in-omniscient-reader-the-prophet-second-trailer-2724060-2025-05-13",
      "headline": "Omniscient Reader 2nd trailer suprises as Lee Min-ho throws Ahn Hyo-seop into seaThe second teaser trailer for 'Omniscient Reader: The Prophet' is out. Ahn Hyo-seop, Lee Min-ho, and Blackpink's Jisoo battle to save humanity as a chaotic web novel world begins to collide with reality."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/action-conventional-domain-nuclear-threat-during-india-pak-conflict-2724213-2025-05-13",
      "headline": "What nuclear, fighting was always conventional: India junks Trump's claimIndia firmly rejected US President Donald Trump's claim of averting a nuclear conflict with Pakistan, asserting that the military action between the neighbours remained strictly conventional. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-place-in-pakistan-where-terrorists-can-hide-ghar-mein-ghus-kar-maarenge-pms-address-at-adampur-airbase-2724117-2025-05-13",
      "headline": "Ghar mein ghus kar maarenge: PM says no place in Pak where terrorists can hideReiterating India's aggressive policy on cross-border terrorism, PM Modi said that \"the Armed Forces will enter the homes of terrorists and strike.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/issue-of-trade-did-not-come-up-government-rejects-trumps-claim-on-india-pak-ceasefire-2724206-2025-05-13",
      "headline": "New Delhi rejects Trump's claim on India-Pak ceasefire, says trade never came upThe Ministry of External Affairs (MEA) clarified that the Indian and US leadership were in touch during the tense standoff with Pakistan, but there was no conversation on trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-tightens-work-visa-citizenship-norms-5-top-points-indian-immmigrants-british-migration-policy-work-student-2724071-2025-05-13",
      "headline": "UK tightens work visa, citizenship norms. 5 top pointsBritish PM Keir Starmer attributed many of the UK's problems to immigration. This was followed by several stringent regulations on study, work and family visas. The policy change will impact Indians applying for work, stay and studies in the UK. Here are the top five points from the new regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-pakistan-crasefire-united-states-strategic-partnership-donald-trump-quad-grouping-2724105-2025-05-13",
      "headline": "Sindoor tests India's ties with Trump's QuadWhile India waged a war on Pakistan-sponsored terror through Operation Sindoor, her so-called Quad allies ghosted her in real time. US President Donald Trump's diplomacy visibly turned the Quad from a strategic alliance into a WhatsApp group chat, leaving messages unread. The Quad's silence is bizarre as Pakistan is nothing more than a frontline Chinese province, and the grouping was formed with an eye on China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indus-waters-treaty-suspended-pakistan-abjures-support-for-terrorism-india-2724203-2025-05-13",
      "headline": "Indus treaty to remain paused until Pak abjures support for terrorism: IndiaIndia has announced several diplomatic offensives, including the suspension of the Indus Waters Treaty, in response to the deadly Pahalgam terror attack in April, which killed 22 civilians, mostly tourists. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-former-president-abdul-hamid-fled-thailand-controversy-interim-muhammad-yunus-awami-league-ban-2724025-2025-05-13",
      "headline": "Storm in Bangladesh as ex-President leaves for Thailand in lungi on 3 am flight  Former President Abdul Hamid left Bangladesh for Thailand in the wee hours last week, becoming the latest Awami League leader to slip out of the country after the fall of the Sheikh Hasina regime. A high-level probe has been constituted as to how Hamid was allowed to leave as he was an accused in at least one murder case. His exit coincides with the interim government of Muhammad Yunus banning the Awami League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-adampur-airbase-visit-message-importance-pakistan-s400-operation-sindoor-2724041-2025-05-13",
      "headline": "With S-400 in backdrop, how PM Modi fact-checked PakistanDuring PM Modi's visit to Adampur, an image of an MiG-29 jet and an intact S-400 air defence system was visible in the background. It debunked Pakistan's claim that its jets destroyed the S-400 air defence system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/kailash-mansarovar-pilgrimage-264-13-05-2025",
      "headline": "There's life before Kailash Mansarovar and there's life after. What's yours?As the unmissable pilgrimage to the Tibet region resumes this year, here's an experiential piece from a pilgrim setting out what this year's probable yatris will see and the consolation for those who have missed applying.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tension-live-updates-operation-sindoor-ceasefire-india-pak-conflict-news-drone-attack-2723850-2025-05-13",
      "headline": "Claiming win an old habit: Government's riposte to Pak on 'Indian bases damaged' claimIndia Pakistan News Live Updates: Prime Minister Narendra Modi, in a strong and assertive speech on Monday, stated that Operation Sindoor has established a \"new normal\" in relations with neighbouring Pakistan. The sentiment was reiterated by the Ministry of External Affairs as it urged Pakistan to get used to the \"new normal\" at the soonest. The government also said that the Indus Waters Treaty, suspended by India after the deadly April 22 Pahalgam terror attack, will remain in abeyance until Pakistan credibly and irrevocably abjures its support for cross-border terrorism. Meanwhile, three days after India and Pakistan reached an understanding to halt military action, the situation along the border remains largely calm, barring a few instances of drone sightings on Monday night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pakistan-china-pl-15-missiles-shredded-india-made-indegenous-brahmos-akashteer-weapons-2724052-2025-05-13",
      "headline": "China's ace PL-15 missile shredded; India-made weapons deliver killer punchOperation Sindoor exposed the limits of China-made war tech as Indian forces, backed by indigenous weapons, not only blunted Pakistan's attack but delivered pinpoint retaliatory strikes. From Akashteer to BrahMos, indigenous weapons platforms proved a super hit. Op Sindoor proved that India's defence industry is battle-ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/from-dhonis-bystanders-to-virats-warriors-how-indias-greatest-revived-test-fortunes-2723592-2025-05-13",
      "headline": "From Dhoni's bystanders to Virat's warriors: How India's greatest revived Test fortunesAs the sun sets on Kohli's Test empire, we look back on how his resolve to make India the most formidable Test team in the world turned their fortunes in whites and brought a cultural shift for the generations to follow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-to-postpone-her-cannes-debut-amid-india-pak-tension-2724260-2025-05-13",
      "headline": "Alia Bhatt to postpone her Cannes debut amid India-Pak tensionActor Alia Bhatt is set to postpone her Cannes debut this year due to tensions between India and Pakistan. The actor was set to attend the festival on its opening day, May 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorist-killed-in-gunfight-with-security-forces-in-jks-shopian-two-more-suspected-to-be-trapped-2723938-2025-05-13",
      "headline": "3 Lashkar terrorists killed in gunfight with security forces in J&K, AK-47s seizedThe Army launched Operation Keller -- named after the encounter site -- after it received \"specific intelligence\" from the Rashtriya Rifles unit. Of the three, the two slain terrorists were identified as Shahid Kuttay and Adnan Shafi, both residents of Shopian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-400-missile-defence-systems-india-russia-operation-sindoor-pakistan-drones-2724090-2025-05-13",
      "headline": "India seeks additional S-400 missile defence systems from Russia: SourcesAfter the S-400's successful performance during Operation Sindoor, India has reportedly requested more such units from Russia to bolster its air defence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-admits-paf-air-force-officials-killed-india-strikes-operation-sindoor-2723994-2025-05-13",
      "headline": "Pak air force chief technician among 11 soldiers killed in Indian strikesThis is the first time Pakistan has confirmed that it lost air force personnel during India's 'Operation Sindoor', giving credence to the Indian Air Force's claim that it shot down 'a few planes' of the PAF."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/cannes-2025-new-decent-fashion-rules-to-shift-focus-on-films-nudity-voluminous-outfit-2724121-2025-05-13",
      "headline": "The Can'ts at Cannes 2025: New 'decent' fashion rules to shift focus on films?Is the new move of banning voluminous outfits and naked dressing on the Cannes Film Festival red carpet a move to shift focus on films from fashion?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-adampur-visit-terror-nuclear-blackmail-operation-sindoor-pakistan-conflict-2724163-2025-05-13",
      "headline": "PM outlines 'Laxman Rekha': No tolerance for terror, sponsors, nuclear blackmailSpeaking at the Adampur Air Force Station, PM Modi unveiled India's new three-point doctrine on terrorism — vowing asymmetric retaliation, rejecting nuclear blackmail, and equating terror states with terror masterminds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-indias-akash-missile-hunts-locks-and-destroys-operation-sindoor-2724102-2025-05-13",
      "headline": "How India's Akash missile hunts, locks, and destroysIts success in neutralising the targets during Operation Sindoor showed its advanced capabilities, high success rate in defending Indian assets and why it needs to be celebrated more. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-declares-emergency-after-indian-strikes-cripple-vital-airstrips-2723969-2025-05-13",
      "headline": "Pakistan to revalidate emergency airstrips after Indian strikes cripple basesSources confirm that revalidation exercises for the M1 and M2 emergency airstrips - located on the Islamabad-Peshawar and Islamabad-Lahore motorways - are scheduled for this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/remembering-rk-narayan-swami-malgudi-and-the-magic-of-everyday-india-2724226-2025-05-13",
      "headline": "Why RK Narayan's Malgudi Days still feels like a slice of real IndiaOn RK Narayan's death anniversary, we look back at the quiet genius who gave us Malgudi, a town that may not be on the map, but still lives in the hearts of readers everywhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retiremen-career-leadership-nonchalance-2723853-2025-05-13",
      "headline": "The nonchalance of Rohit, the intensity of Virat: Oh, what a jodi!More than any other batters in the post-Tendulkar era, stories of triumph and failure of Rohit and Virat became pivotal sub-plots. These narratives shaped the larger story of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/satellite-images-pakistan-air-bases-nur-khan-india-operation-sindoor-2723934-2025-05-13",
      "headline": "Clear satellite pics show extensive damage to Pak bases after Indian strikesThe post-strike satellite images of the highest quality released by Maxar Technologies offer clear evidence of India's precision airstrikes on key military facilities in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mystery-over-the-death-of-padma-shri-scientist-subbanna-ayyappan-suicide-died-cauvery-river-found-body-2724039-2025-05-13",
      "headline": "Mystery over drowning death of scientist who spearheaded India's Blue RevolutionPadma Shri awardee and aquaculture pioneer scientist Subbanna Ayyappan, who had been missing for several days, was found dead on May 10. His body was recovered from the Cauvery River at Srirangapatna and later identified by police. Though initial findings point to a possible suicide, authorities aren't ruling out other angles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/payal-kapadia-returns-to-cannes-film-festival-as-jury-member-2724274-2025-05-13",
      "headline": "Filmmaker Payal Kapadia returns to Cannes Film Festival as jury memberFilmmaker Payal Kapadia returned to the Cannes Film Festival this year as a jury member. She made an appearance for a photocall at the opening ceremony of the festival as part of the prestigious gala's jury panel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-jumps-from-10000-feet-in-mission-impossible-8-stunt-2724275-2025-05-13",
      "headline": "Tom Cruise jumps from 10,000 feet in Mission Impossible 8 stuntTom Cruise shared BTS video from 'Mission: Impossible – The Final Reckoning', showcasing his stunt training for 10,000 feet jump from airplane. The film, releasing on May 23, 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-to-postpone-her-cannes-debut-amid-india-pak-tension-2724260-2025-05-13",
      "headline": "Alia Bhatt to postpone her Cannes debut amid India-Pak tensionActor Alia Bhatt is set to postpone her Cannes debut this year due to tensions between India and Pakistan. The actor was set to attend the festival on its opening day, May 13.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-sreeleela-pose-together-wrap-schedule-of-anurag-basu-untiled-film-2724241-2025-05-13",
      "headline": "Kartik Aaryan shares pic with Sreeleela as they wrap schedule of Anurag Basu's filmKartik Aaryan shared a picture with Sreeleela from the sets of their upcoming film by Anurag Basu. The two shared their excitement as they wrapped a schedule of the film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-has-good-brain-moeen-ali-backs-gt-skipper-to-lead-indian-test-side-2724249-2025-05-13",
      "headline": "Shubman Gill has good brain: Moeen Ali backs GT skipper to lead Indian Test sideFormer England all-rounder Moeen Ali has backed Shubman Gill to captain India in the upcoming Test series in England beginning from June 20. Rohit Sharma's retirement has left India's Test captaincy spot vacant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chamari-athapaththu-fined-10-percent-match-fee-for-breaching-icc-code-of-conduct-2724220-2025-05-13",
      "headline": "Chamari Athapaththu fined 10 percent match fee for breaching ICC Code of ConductSri Lanka women's cricket team captain Chamari Athapaththu has been fined ten per cent of her match fee for breaching Level 1 of the ICC Code of Conduct during tri-series fixture against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-confirm-vinicius-jr-lucas-vazquez-out-with-injuries-2724216-2025-05-13",
      "headline": "Real Madrid confirm Vinicius Jr, Lucas Vazquez out with injuriesReal Madrid have confirmed that forward Vinicius Junior and defender Lucas Vázquez are injury doubts about the final stretch of the LaLiga season after both players were forced off during Sunday's 4-3 Clasico defeat to Barcelona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-absence-will-give-a-massive-boost-to-england-moeen-ali-2724210-2025-05-13",
      "headline": "Rohit Sharma, Virat Kohli's absence will give a massive boost to England: Moeen AliFormer all-rounder Moeen Ali believes the absence of Rohit Sharma and Virat Kohli eases the pressure on England's bowlers and gives the hosts a clear psychological edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-jacks-returns-in-england-squads-for-white-ball-series-vs-west-indies-2724191-2025-05-13",
      "headline": "Will Jacks returns in England squad for white-ball series vs West IndiesEngland all-rounder Will Jacks marked his return to the national side after November 2024 as they announced their squad for the white-ball series against West Indies beginning from June 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-boucher-recalls-how-he-motivated-virat-kohli-to-be-next-sachin-tendulkar-2724157-2025-05-13",
      "headline": "Mark Boucher recalls how he motivated Virat Kohli to be next Sachin TendulkarLegendary South Africa wicketkeeper Mark Boucher recently revealed how he motivated star India batter Virat Kohli quite early in his career to be the next Sachin Tendulkar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-r-ashwin-reaction-2724137-2025-05-13",
      "headline": "Virat Kohli had one or two more years of Test cricket left in him: R AshwinFormer India spinner R Ashwin said he couldn't shake the feeling that Virat Kohli still had one or two more years of red-ball cricket left in him. Kohli retired from Test cricket on Monday, drawing the curtain on a stellar red-ball career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-appointed-pakistans-white-ball-head-coach-2724118-2025-05-13",
      "headline": "Mike Hesson appointed Pakistan's white-ball head coachNew Zealand's Mike Hesson has been appointed Pakistan's new white-ball head coach. He brings global experience and stability to a role frequently changed by PCB amid recent turbulence in team management and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/from-dhonis-bystanders-to-virats-warriors-how-indias-greatest-revived-test-fortunes-2723592-2025-05-13",
      "headline": "From Dhoni's bystanders to Virat's warriors: How India's greatest revived Test fortunesAs the sun sets on Kohli's Test empire, we look back on how his resolve to make India the most formidable Test team in the world turned their fortunes in whites and brought a cultural shift for the generations to follow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-virat-kohli-test-retirement-gautam-gambhir-era-england-vs-india-2724124-2025-05-13",
      "headline": "Start of Gambhir era: R Ashwin on Tests post Rohit, Kohli retirementsWith Rohit Sharma and Virat Kohli retiring from Tests, R Ashwin believes Indian cricket is now firmly entering the Gautam Gambhir era, as the team prepares for a tough five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-wtc-final-squad-temba-bavuma-video-2724114-2025-05-13",
      "headline": "Watch: Temba Bavuma unveils South Africa's WTC 2025 Final squad in fiery videoWorld Test Championship final: South Africa announced their 15-man squad for the summit clash against Australia in London. Fast bowler Lungi Ngidi returned to the Test set-up for the first time since October 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-r-ashwin-reaction-2724137-2025-05-13",
      "headline": "Virat Kohli had one or two more years of Test cricket left in him: R AshwinFormer India spinner R Ashwin said he couldn't shake the feeling that Virat Kohli still had one or two more years of red-ball cricket left in him. Kohli retired from Test cricket on Monday, drawing the curtain on a stellar red-ball career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-appointed-pakistans-white-ball-head-coach-2724118-2025-05-13",
      "headline": "Mike Hesson appointed Pakistan's white-ball head coachNew Zealand's Mike Hesson has been appointed Pakistan's new white-ball head coach. He brings global experience and stability to a role frequently changed by PCB amid recent turbulence in team management and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/from-dhonis-bystanders-to-virats-warriors-how-indias-greatest-revived-test-fortunes-2723592-2025-05-13",
      "headline": "From Dhoni's bystanders to Virat's warriors: How India's greatest revived Test fortunesAs the sun sets on Kohli's Test empire, we look back on how his resolve to make India the most formidable Test team in the world turned their fortunes in whites and brought a cultural shift for the generations to follow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-virat-kohli-test-retirement-gautam-gambhir-era-england-vs-india-2724124-2025-05-13",
      "headline": "Start of Gambhir era: R Ashwin on Tests post Rohit, Kohli retirementsWith Rohit Sharma and Virat Kohli retiring from Tests, R Ashwin believes Indian cricket is now firmly entering the Gautam Gambhir era, as the team prepares for a tough five-match series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-wtc-final-squad-temba-bavuma-video-2724114-2025-05-13",
      "headline": "Watch: Temba Bavuma unveils South Africa's WTC 2025 Final squad in fiery videoWorld Test Championship final: South Africa announced their 15-man squad for the summit clash against Australia in London. Fast bowler Lungi Ngidi returned to the Test set-up for the first time since October 2024. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}