{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/less-than-40-percent-itrs-processed-as-government-pushes-deadline-to-september-15-2774766-2025-08-21",
      "headline": "Less than 40% ITRs processed as government pushes deadline to September 15The Finance Ministry has pushed the ITR deadline to 15 September citing extensive changes in forms and utilities. But three months in, processing is still crawling at under 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-143-points-higher-nifty-above-25000-pharma-stocks-gain-2774715-2025-08-21",
      "headline": "Sensex, Nifty gain for 6th straight session on GST reforms optimismThe S&P BSE Sensex was up 142.87 points to 82,000.71 at the closing bell, while the NSE Nifty50 rose 33.20 points to settle at 25,083.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/group-of-ministers-on-gst-approves-scrapping-of-12-28-slabs-2774697-2025-08-21",
      "headline": "Ministers' panel approves scrapping of 12%, 28% GST slabs; 90% goods may get cheaperIn a key meeting held on Thursday, the panel of state ministers accepted the Centre's plan to reduce the four-rate system to two main slabs of 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-can-retirees-stay-safe-from-risky-too-good-to-be-true-schemes-safe-investments-for-retirees-2774609-2025-08-21",
      "headline": "How can retirees stay safe from risky 'too good to be true' schemes?Many retirees fall prey to schemes that seem too good to be true, chasing high returns without understanding the risks. Protecting your savings requires caution, awareness, and smart investment choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-zero-percent-insurance-premium-costly-cheap-input-tax-credit-policyholders-personal-finance-2774569-2025-08-21",
      "headline": "Why zero GST on insurance premiums doesn't mean cheaper policies for youOn the surface, removing GST on insurance premiums seems like a big relief, but experts caution that the outcome may not be what many are expecting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-claims-how-to-select-right-epfo-form-for-withdrawal-pension-or-transfer-2774560-2025-08-21",
      "headline": "EPFO withdrawal, pension or transfer: How to choose the right PF formEPFO members often get confused about which form to fill for withdrawals, transfers, or pension claims. Using the right form not only saves time but also avoids delays or rejection of your application."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/80-percent-of-emergency-funds-dont-work-when-needed-ca-explains-why-2774526-2025-08-21",
      "headline": "CA explains why 80% of emergency funds don't work when neededMost people believe they are financially prepared for tough times, but when a real crisis hits, their so-called emergency funds often fall short. A chartered accountant explains why this happens and how to fix it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-bill-2025-fine-penalty-explained-lok-sabha-betting-apps-money-based-2774515-2025-08-21",
      "headline": "Online Gaming Bill 2025: What are the different penalties in it?The Bill, which was passed in the Lok Sabha soon after it was introduced, focusses on reducing risks linked to addiction, money laundering, and misleading advertising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-on-life-and-health-insurance-may-soon-be-exempt-what-it-means-for-you-2774508-2025-08-21",
      "headline": "No GST on life, health insurance premiums soon? Here's what it means for youA proposal has been made to exempt premiums for life and health insurance from Goods and Services Tax (GST), a move that could bring down costs and boost insurance penetration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-150-points-higher-nifty-above-25000-ril-shares-gains-1-percent-2774468-2025-08-21",
      "headline": "Sensex opens 150 points higher, Nifty above 25,000; RIL gains 1%The S&P BSE Sensex added 122.01 points to 81,979.85, while the NSE Nifty50 gained 20.45 points to 25,071.00 as of 9:23 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-patel-retail-vikram-solar-gem-aromatics-shreeji-shipping-global-close-bidding-today-listing-gains-more-best-profit-2774451-2025-08-21",
      "headline": "4 IPOs to close for bidding today: Which one will give you best listing gains?All four IPOs opened for subscription on August 19 and will complete allotment on August 22. The listing of these companies is scheduled for August 26 on the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zepto-allows-you-to-buy-land-as-fast-as-groceries-check-details-house-of-abhinandan-lodha-hoabl-2774247-2025-08-20",
      "headline": "Now you can buy land via a mobile app in minutes. Here's howThe initiative is intended to make land purchases easier, quicker and more transparent by using a platform that millions already rely on for daily shopping."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-monday-fasting-for-energy-better-health-fitness-2774809-2025-08-21",
      "headline": "Akshay Kumar says he fasts on Monday for energy and better healthActor Akshay Kumar revealed his weekly fasting ritual and early dinner habit at a book launch. He emphasised on digestion and balanced health over extreme diets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-bigg-boss-contestants-their-journey-post-show-shehnaaz-gill-asim-riaz-nora-fatehi-sunny-leone-2774655-2025-08-21",
      "headline": "Most memorable Bigg Boss contestants and what they are doing now'Bigg Boss' has proved to be a game-changer for many celebrities, including Shehnaaz Gill, Nora Fatehi and Sunny Leone, amongst many others. Ahead of 'Bigg Boss 19', here is a look at the show's most memorable contestants and what they are doing now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhaskar-bisexuality-views-and-crush-on-dimple-yadav-spark-debate-2774791-2025-08-21",
      "headline": "Swara Bhaskar says everyone is bisexual, reveals having crush on Dimple YadavSwara Bhaskar named Dimple Yadav as her crush during an interview. Bhaskar shared her views on bisexuality and heterosexuality as cultural ideologies. The actor also talked about the potential impact on her husband's political career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mbc-apologises-racist-undertones-to-the-moon-drama-teaser-2774784-2025-08-21",
      "headline": "MBC apologises for racist undertones in To The Moon teaserSouth Korean broadcaster MBC apologised after backlash over racist undertones in its drama teaser. The network admitted oversight and promised more cultural sensitivity in future content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-phenomenon-parody-salman-khan-season-19-iconic-moments-2774605-2025-08-21",
      "headline": "From phenomenon to parody: What happened to Bigg Boss?'Bigg Boss', once a beloved reality show that captivated Indian audiences with its raw drama and iconic moments, has seen its charm fade over the years due to scripted content and repetitive antics. Despite occasional genuine moments, the show now struggles to recreate the magic that once made it a cultural phenomenon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-mrs-haathi-ambika-ranjankar-exit-buzz-needed-time-for-myself-2774755-2025-08-21",
      "headline": "Taarak Mehta's Mrs Haathi, Ambika Ranjankar, on exit buzz: Needed time for myself'Taarak Mehta Ka Ooltah Chashmah' actor Ambika Ranjankar, known for playing Mrs Hathi in the show, addressed her exit rumours. The actor stated that she just wanted time for herself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khans-bads-of-bollywood-tracing-the-launch-of-star-kids-in-hindi-cinema-2774708-2025-08-21",
      "headline": "Aryan Khan's Bads of Bollywood: Tracing the launch of star kids in Hindi cinemaAs Aryan Khan, son of Bollywood superstar Shah Rukh Khan, makes his debut with 'The Bads of Bollywood', a glimpse at the launch of other star kids in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-jokes-about-his-flop-film-zero-at-bads-of-bollywood-preview-event-2774555-2025-08-21",
      "headline": "Shah Rukh Khan jokes about his flop film Zero at Bads of Bollywood preview eventShah Rukh Khan attended the preview of Aryan Khan's directorial debut 'Bads of Bollywood', where he humorously took a dig at his 2018 flop 'Zero'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-family-jet-off-from-hyderabad-ahead-of-70th-birthday-2774750-2025-08-21",
      "headline": "Chiranjeevi and family jet off from Hyderabad ahead of Megastar's 70th birthdayMegastar Chiranjeevi will turn 70 on August 22. He, along with his family members, were seen at the Hyderabad airport as they jetted off to an undisclosed location."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-chatur-naar-teaser-neil-nitin-mukesh-divya-khossla-try-to-outsmart-each-other-2774705-2025-08-21",
      "headline": "Ek Chatur Naar teaser: Neil Nitin Mukesh, Divya Khossla try to outsmart each otherThe makers of the upcoming film 'Ek Chatur Naar' released its teaser on Wednesday. Starring Divya Khossla and Neil Nitin Mukesh, the film will release in theatres on September 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-debut-the-bads-of-bollywood-whats-at-stake-beyond-the-hype-shah-rukh-khan-gauri-khan-2774714-2025-08-21",
      "headline": "Aryan Khan's debut with The Bads of Bollywood: What's at stake beyond the hype?Shah Rukh Khan's son Aryan Khan's directorial debut with Netflix's 'The Bads of Bollywood' is one of the most anticipated launches in recent times. He chooses the path of filmmaking over acting, and his debut is being closely watched as it carries heavy expectations, the weight of the Khan legacy, and the inevitable nepotism debate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-shares-bts-prep-from-cocktail-2-says-one-step-at-a-time-2774663-2025-08-21",
      "headline": "Kriti Sanon shares BTS prep from Cocktail 2, says one step at a timeDirector Homi Adajania teased fans with a \"work in progress\" glimpse of Kriti Sanon from his upcoming sequel Cocktail 2. The BTS (behind-the-scenes) post, later re-shared by Kriti, sparked excitement as she called it \"one step at a time.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-how-aryan-khan-prepared-for-his-speech-at-the-bads-of-bollywood-launch-2774716-2025-08-21",
      "headline": "Exclusive: How Aryan Khan prepared for his speech at The Bads of Bollywood launchAryan Khan's debut speech at 'The Bads of Bollywood' preview wasn't just effortless charm - it was hours of preparation, fatherly guidance, and a moment of pride that lit up social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-maa-mythological-horror-thriller-netflix-premiere-august-2774701-2025-08-21",
      "headline": "Maa OTT release: When and where to watch Kajol's mythological horror dramaKajol's mythological horror film 'Maa' to soon premiere on Netflix. Backed by Jyoti Deshpande and Ajay Devgn, among others, the film was directed by Vishal Furia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadhi-pinisetty-villain-role-akhanda-2-freedom-challenge-balakrishna-boyapati-srinu-2774640-2025-08-21",
      "headline": "Nandamuri Balakrishna is a grounded man, says Akhanda 2 co-star Aadhi PinisettyActor Aadhi Pinisetty takes on a villainous role in 'Akhanda 2', marking a bold shift in his career. He highlights the freedom in playing darker characters and praises his collaborators Nandamuri Balakrishna and Boyapati Srinu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/indra-movie-review-vasanth-ravi-basic-thriller-mehreen-pirzada-sumesh-moor-2774672-2025-08-21",
      "headline": "Indra review: Vasanth Ravi's thriller is too basic to be the thriller it promisedRelease Date:Fri Aug 22, 2025Indra movie review: Directed by Sabarish Nanda, 'Indra' is a crime thriller starring Vasanth Ravi, Mehreen Pirzada, and Sumesh Moor. The film is too basic to make a significant impact, which a crime thriller demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vivek-agnihotri-calls-himself-voice-of-hindus-a-cinematic-psychiatrist-exclusive-interview-2774680-2025-08-21",
      "headline": "Exclusive: Vivek Agnihotri calls himself voice of Hindus, a cinematic psychiatristIn an exclusive interview with IndiaToday.in, Vivek Agnihotri spoke about 'The Bengal Files', describing himself as the \"voice of Hindus\" and the \"psychiatrist of Indian society.\" The director of 'The Kashmir Files' and 'The Vaccine War' said his new film highlights Bengal's \"untold history.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-thanks-tom-cruise-for-going-shirtless-in-mission-impossible-bts-clip-2774627-2025-08-21",
      "headline": "Farah Khan gushes over shirtless Tom Cruise in BTS clip: Eternally grateful!Tom Cruise's behind-the-scenes video from 'Mission: Impossible – The Final Reckoning' went viral, not just for his daring stunts but also for a shirtless moment that caught everyone's eye. Filmmaker Farah Khan joined the fun with a cheeky comment, thanking the Hollywood actor for removing his shirt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/your-time-has-come-srks-friend-mushtaq-sheikhs-emotional-letter-for-aryan-2774639-2025-08-21",
      "headline": "Your time has come: SRK's friend Mushtaq Sheikh's emotional letter for AryanShah Rukh Khan's friend, Mustaq Sheikh, dedicated a letter to Aryan Khan amid his directorial debut 'The Bads of Bollywood' launch on August 20. The show will premiere on Netflix on September 18. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/lion-is-always-a-lion-actor-vijay-at-madurai-rally-tn-polls-2026-2774770-2025-08-21",
      "headline": "Lion is always a lion: Vijay rules out alliance with DMK, BJP in 2026 pollsSpeaking at his party's second state-level conference in Madurai, actor Vijay declared that there would be no alliance between his party and BJP or DMK in 2026 Tamil Nadu polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/senior-cop-satish-golcha-appointed-new-commissioner-of-delhi-police-2774789-2025-08-21",
      "headline": "Satish Golcha appointed new Delhi Police chief day after attack on Rekha GuptaSatish Golcha replaces Shashi Bhushan Kumar Singh, who was holding the additional charge of Delhi Police Commissioner. The leadership change comes a day after an attack on Chief Minister Rekha Gupta at her Civil Lines residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/group-of-ministers-on-gst-approves-scrapping-of-12-28-slabs-2774697-2025-08-21",
      "headline": "Ministers' panel approves scrapping of 12%, 28% GST slabs; 90% goods may get cheaperIn a key meeting held on Thursday, the panel of state ministers accepted the Centre's plan to reduce the four-rate system to two main slabs of 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-double-dance-cpec-2-afghanistan-pakistan-meet-india-outreach-wang-yi-jaishankar-modi-visit-sco-tianjin-2774703-2025-08-21",
      "headline": "What China's double dance amid India outreach revealsRight after his India visit, Chinese Foreign Minister Wang Yi headed to Kabul where it was agreed that China, Pakistan and Afghanistan would extend the CPEC to the Afghan capital. Wang is now in Pakistan. What does China's tango in Af-Pak reveal even as it moves for better ties with Delhi?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-raj-thackeray-reunite-after-twenty-years-score-zero-best-elections-2774630-2025-08-21",
      "headline": "Not the BEST start: Thackeray brothers reunite after 20 years, score a big zeroAfter two decades of rivalry, Uddhav and Raj Thackeray reunited, but their much-hyped alliance crashed spectacularly in its very first test, failing to secure even a single seat in the BEST Credit Society elections. The defeat exposed not just the hollowness of their combined strength but also how far the Thackeray legacy has drifted from Bal Thackeray's once unshakable political command."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-frances-emmanuel-macron-discuss-peaceful-end-of-conflict-in-ukraine-west-asia-2774834-2025-08-21",
      "headline": "PM Modi, Emmanuel Macron discuss peaceful end of conflict in Ukraine, West AsiaPM Modi mentioned that he and the French President exchanged views on efforts for the peaceful resolution of conflicts in Ukraine and West Asia and reaffirmed their commitment to further strengthening the India–France strategic partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-to-stop-issuing-new-aadhaar-cards-to-adults-exception-for-sc-st-says-chief-minister-himanta-sarma-2774757-2025-08-21",
      "headline": "Assam to stop issuing new Aadhaar cards to adults except SC, ST communitiesAssam Chief Minister Himanta Biswa Sarma said that the state cabinet had decided not to issue new Aadhaar cards to people above 18 years of age for another year, except for Scheduled Castes, Scheduled Tribes, and tea garden workers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/masood-azhars-jaish-dodging-fatf-to-rebuild-terror-bases-razed-in-operation-sindoor-2774725-2025-08-21",
      "headline": "Masood Azhar's Jaish dodging FATF to rebuild terror bases razed in Op SindoorThe Jaish-e-Mohammed, which plans to build 313 new terror camps, has shifted fundraising to the digital realm, exposing Pakistan's hollow claims to the Financial Action Task Force"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-phenomenon-parody-salman-khan-season-19-iconic-moments-2774605-2025-08-21",
      "headline": "From phenomenon to parody: What happened to Bigg Boss?'Bigg Boss', once a beloved reality show that captivated Indian audiences with its raw drama and iconic moments, has seen its charm fade over the years due to scripted content and repetitive antics. Despite occasional genuine moments, the show now struggles to recreate the magic that once made it a cultural phenomenon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-refuses-to-wear-muslim-headgear-madrassa-event-bihar-elections-2774806-2025-08-21",
      "headline": "Paltu moment? Nitish Kumar declines to wear 'topi' at madrasa eventThe incident has stirred a political row ahead of the Bihar elections as Nitish Kumar has previously been seen donning a skull cap at Iftar parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-see-relation-with-india-as-special-strategic-partnership-russian-foreign-minister-as-he-meets-jaishankar-2774718-2025-08-21",
      "headline": "India-Russia ties steadiest since World War II, says Jaishankar in MoscowJaishankar, who is in Moscow, said his meeting with Russian Foreign Minister Sergey Lavrov was an opportunity to review both the political relationship and bilateral cooperation between India and Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rainbows-are-changing-they-could-soon-disappear-from-india-2774740-2025-08-21",
      "headline": "Rainbows are changing. They could soon disappear from IndiaScientists created a global database of rainbow photos submitted by people around the world. They then trained a computer model to predict rainbow occurrences based on climate and weather conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/indian-school-student-problem-knives-guns-schoolbags-2774647-2025-08-21",
      "headline": "Knives in school bags, Katta in lunch boxes: A new worry in Indian classroomsThe recent disturbing incidents in Indian schools, from students carrying knives in their bags to one reportedly bringing a kata(country-made pistol) in a lunch box, have raised serious concerns. The question now is whether this trend could pave the way for a gun culture in India, akin to the United States, where firearms in schools have become a grim reality. Here's what experts have to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wink-supreme-court-ex-judge-markandey-katju-woman-lawyer-problematic-sexism-fairness-judiciary-heres-how-2774730-2025-08-21",
      "headline": "Wink at judge: Ex-SC judge Katju's advice to woman lawyer is problematicFormer Supreme Court Judge Markandey Katju advised a woman lawyer to wink at judges. \"All the lady lawyers who winked at me in court got favourable orders,\" he said. Katju is not an uncle on a family WhatsApp group but a retired judge and this casual sexist remarks damages the image of jurists and of the institution itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-debut-the-bads-of-bollywood-whats-at-stake-beyond-the-hype-shah-rukh-khan-gauri-khan-2774714-2025-08-21",
      "headline": "Aryan Khan's debut with The Bads of Bollywood: What's at stake beyond the hype?Shah Rukh Khan's son Aryan Khan's directorial debut with Netflix's 'The Bads of Bollywood' is one of the most anticipated launches in recent times. He chooses the path of filmmaking over acting, and his debut is being closely watched as it carries heavy expectations, the weight of the Khan legacy, and the inevitable nepotism debate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-defence-ministry-test-post-operation-sindoor-arms-weapons-acquisition-delay-2774666-2025-08-21",
      "headline": "The Defence Ministry's biggest test after Operation SindoorA flurry of defence procurement announcements, a tortoise-paced acquisition process, and a chance to fix the system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/from-mario-to-snake-why-non-monetary-online-games-are-the-reset-we-need-2774723-2025-08-21",
      "headline": "From Mario to Snake: Why non-monetary online games are the reset we needKids today spend money on virtual items and fancy skins, often for social approval, not pure fun. It's time to remember old-school games that brought us simple pleasure, no price tag attached."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-next-for-uddhav-raj-thackeray-alliance-plans-after-best-poll-rout-2774707-2025-08-21",
      "headline": "What next for Uddhav-Raj Thackeray alliance plans after BEST poll rout?The results are being seen as a verdict on whether the Marathi manoos in and around Mumbai would back the Shiv Sena (UBT) and Maharashtra Navnirman Sena should they join forces"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-bilateral-ties-asia-cup-participation-sports-ministry-2774733-2025-08-21",
      "headline": "No bilaterals with Pak, says government; green light for Asia CupThe government on Thursday, August 21, said India will not engage in bilateral sporting ties with Pakistan. However, a Sports Ministry source confirmed that Indian men's cricket team will not be stopped from playing against Pakistan in the Asia Cup, starting September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/chinese-foreign-minister-wang-yi-says-china-would-continue-safeguarding-pakistans-sovereignty-and-give-priority-to-pakistan-2774821-2025-08-21",
      "headline": "China says will continue safeguarding Pak, prioritise it in regional diplomacyChinese Foreign Minister said that Beijing would continue to support Pakistan in safeguarding its national independence, sovereignty and territorial integrity and combating terrorism, Wang said, adding that China would continue to give priority to Pakistan in its regional diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/your-best-friend-is-flirting-with-your-partner-what-should-you-do-2774681-2025-08-21",
      "headline": "Your best friend is flirting with your partner — what should you do?Think your best friend is getting a little too close to your partner? It's awkward, messy, and hard to tell if it's one-sided or something more. Here's how to deal with it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-bills-passed-bihar-sir-protest-dhankhar-resignation-2774745-2025-08-21",
      "headline": "Bill against 'tainted' netas, SIR protest, a shock exit: Parliament takeawaysParliament Monsoon session: Overall, 12 bills were passed by the Lok Sabha and 15 by the Rajya Sabha during the month-long session, including the legislation to regulate online gaming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/young-congress-leaders-afraid-to-speak-make-rahul-gandhi-insecure-pm-told-nda-say-sources-2774624-2025-08-21",
      "headline": "Young Congress leaders talented, making Rahul Gandhi insecure: PM to NDA leadersSources added that no opposition leader attended the meeting, which was limited to the ruling alliance. PM Modi, they said, described the recently concluded Parliament session as a good one because important bills were passed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-president-xi-jinping-rare-visit-tibet-talks-buddhism-dalai-lama-china-autonomous-region-60-anniversary-2774622-2025-08-21",
      "headline": "China's Xi makes rare visit to Tibet, says Tibetan Buddhism needs to changeChinese President Xi Jinping's rare visit to Tibet has underscored Beijing's push to tighten control over the region, marking the 60th anniversary of its designation as a Chinese autonomous region. Xi, while skirting any mention of the Dalai Lama, said there was a need to \"guide Tibetan Buddhism to adapt to socialist society\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-monday-fasting-for-energy-better-health-fitness-2774809-2025-08-21",
      "headline": "Akshay Kumar says he fasts on Monday for energy and better healthActor Akshay Kumar revealed his weekly fasting ritual and early dinner habit at a book launch. He emphasised on digestion and balanced health over extreme diets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhaskar-bisexuality-views-and-crush-on-dimple-yadav-spark-debate-2774791-2025-08-21",
      "headline": "Swara Bhaskar says everyone is bisexual, reveals having crush on Dimple YadavSwara Bhaskar named Dimple Yadav as her crush during an interview. Bhaskar shared her views on bisexuality and heterosexuality as cultural ideologies. The actor also talked about the potential impact on her husband's political career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khans-bads-of-bollywood-tracing-the-launch-of-star-kids-in-hindi-cinema-2774708-2025-08-21",
      "headline": "Aryan Khan's Bads of Bollywood: Tracing the launch of star kids in Hindi cinemaAs Aryan Khan, son of Bollywood superstar Shah Rukh Khan, makes his debut with 'The Bads of Bollywood', a glimpse at the launch of other star kids in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-jokes-about-his-flop-film-zero-at-bads-of-bollywood-preview-event-2774555-2025-08-21",
      "headline": "Shah Rukh Khan jokes about his flop film Zero at Bads of Bollywood preview eventShah Rukh Khan attended the preview of Aryan Khan's directorial debut 'Bads of Bollywood', where he humorously took a dig at his 2018 flop 'Zero'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/online-gaming-bill-benefit-e-sports-mainstream-2774837-2025-08-21",
      "headline": "New Online Gaming Bill lifts Esports to mainstream sporting statusThe new Online Gaming Bill brings relief to millions of gamers and aspiring esports athletes in the country. There is now a clear differentiation between esports and Real Money Gaming and ambitious plans to promote and expand esports nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-ranji-trophy-saurashtra-2774832-2025-08-21",
      "headline": "Cheteshwar Pujara available to play Ranji Trophy 2025-26 for Saurashtra: ReportSenior batter Cheteshwar Pujara has signalled his intent to play the upcoming Ranji Trophy season for Saurashtra. Pujara last featured in competitive cricket in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-squad-announcement-heather-knight-return-2774788-2025-08-21",
      "headline": "Heather Knight back as England name spin-heavy squad for 2025 Women's World CupEngland have named a spin-heavy squad for the 2025 Women's World Cup with Heather Knight returning from injury, Nat Sciver-Brunt leading for the first time, and Sarah Glenn and Danni Wyatt-Hodge also making comebacks for the subcontinental challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-diamond-harbour-fc-who-are-they-east-bengal-defeated-2774738-2025-08-21",
      "headline": "Who are Diamond Harbour FC? 3-year-old club aiming for Durand Cup gloryIn just three years, Diamond Harbour FC have surged from district football to the Durand Cup final, stunning East Bengal on debut and standing one win away from completing Indian football's most remarkable underdog story in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/online-gaming-bill-2025-esports-ban-real-money-games-india-cricket-sponsorship-2774735-2025-08-21",
      "headline": "Online gaming bill: What does it mean for sports and sports enthusiasts?India's Online Gaming Bill 2025 boosts esports but bans real money games, gambling and betting. Here's all you need to know about the new bill that was passed in the Cabinet on Tuesday, August 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-bilateral-ties-asia-cup-participation-sports-ministry-2774733-2025-08-21",
      "headline": "No bilaterals with Pak, says government; green light for Asia CupThe government on Thursday, August 21, said India will not engage in bilateral sporting ties with Pakistan. However, a Sports Ministry source confirmed that Indian men's cricket team will not be stopped from playing against Pakistan in the Asia Cup, starting September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-snub-father-santosh-2774694-2025-08-21",
      "headline": "Shreyas Iyer's father on Asia Cup snub: Not asking for captaincy, at least select himAsia Cup 2025: Shreyas Iyer's father, Santosh, has urged the selectors to give his son an opportunity in the T20I format. He revealed that Shreyas was gutted after missing out on a place in the Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-india-asia-cup-spot-uncertain-mohammed-kaif-2774693-2025-08-21",
      "headline": "Sanju Samson's Asia Cup spot under threat after Shubman Gill's inclusion: KaifMohammad Kaif has said it will be tough for Sanju Samson to secure a spot in India's playing XI for the Asia Cup. Kaif believes Shubman Gill, who is now the vice-captain, will open the innings alongside Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bronco-test-indian-cricket-fitness-yo-yo-2-km-trials-2774674-2025-08-21",
      "headline": "What is Bronco test? BCCI's new fitness benchmark and how it differs from Yo-YoThe BCCI has reportedly introduced a rugby-centric Bronco fitness test for Indian players in an effort to ensure consistently high fitness standards. It will now be used alongside the established Yo-Yo test and 2-kilometer time trial to assess players' readiness for international competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-2025-vice-captain-badrinath-jaiswal-sudharsan-2774657-2025-08-21",
      "headline": "No issue backing Gill, but what about Jaiswal? Ex- IND batter on Asia Cup squadFormer India batter S. Badrinath has questioned the decision to snub Yashasvi Jaiswal and Sai Sudharsan from the Asia Cup 2025 squad in favour of Shubman Gill. The 25-year-old comes into the team as the vice-captain of the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jake-paul-vs-gervonta-davis-netflix-fight-2025-2774632-2025-08-21",
      "headline": "Paul vs Davis confirmed, Netflix superfight set despite 60-pound gapJake Paul vs. Gervonta Davis is set for Nov 14, 2025, in Atlanta, with the event all set to be streamed exclusively by NetFlix. With a 60+ pound weight gap, the fight will see Paul try to end his feud with Davis inside the ring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-snub-father-santosh-2774694-2025-08-21",
      "headline": "Shreyas Iyer's father on Asia Cup snub: Not asking for captaincy, at least select himAsia Cup 2025: Shreyas Iyer's father, Santosh, has urged the selectors to give his son an opportunity in the T20I format. He revealed that Shreyas was gutted after missing out on a place in the Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-india-asia-cup-spot-uncertain-mohammed-kaif-2774693-2025-08-21",
      "headline": "Sanju Samson's Asia Cup spot under threat after Shubman Gill's inclusion: KaifMohammad Kaif has said it will be tough for Sanju Samson to secure a spot in India's playing XI for the Asia Cup. Kaif believes Shubman Gill, who is now the vice-captain, will open the innings alongside Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bronco-test-indian-cricket-fitness-yo-yo-2-km-trials-2774674-2025-08-21",
      "headline": "What is Bronco test? BCCI's new fitness benchmark and how it differs from Yo-YoThe BCCI has reportedly introduced a rugby-centric Bronco fitness test for Indian players in an effort to ensure consistently high fitness standards. It will now be used alongside the established Yo-Yo test and 2-kilometer time trial to assess players' readiness for international competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-2025-vice-captain-badrinath-jaiswal-sudharsan-2774657-2025-08-21",
      "headline": "No issue backing Gill, but what about Jaiswal? Ex- IND batter on Asia Cup squadFormer India batter S. Badrinath has questioned the decision to snub Yashasvi Jaiswal and Sai Sudharsan from the Asia Cup 2025 squad in favour of Shubman Gill. The 25-year-old comes into the team as the vice-captain of the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jake-paul-vs-gervonta-davis-netflix-fight-2025-2774632-2025-08-21",
      "headline": "Paul vs Davis confirmed, Netflix superfight set despite 60-pound gapJake Paul vs. Gervonta Davis is set for Nov 14, 2025, in Atlanta, with the event all set to be streamed exclusively by NetFlix. With a 60+ pound weight gap, the fight will see Paul try to end his feud with Davis inside the ring. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}