{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-become-fourth-largest-economy-by-end-of-2025-niti-member-arvind-virmani-2731002-2025-05-26",
      "headline": "India to become 4th largest economy by end of 2025: NITI Aayog memberIn April, the IMF had said that India is expected to be the fourth-largest economy in the world with a GDP of USD 4.19 trillion in 2025, ahead of Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rent-vs-buy-why-young-indians-are-rethinking-homeownership-is-it-better-to-rent-or-buy-in-india-real-estate-trends-india-2730761-2025-05-26",
      "headline": "Rent vs buy? Why young Indians are rethinking homeownershipNot long ago, a house was more than just a home—it was a badge of honour in Indian families. Parents encouraged early buying, regardless of the financial strain. Today, however, younger Indians are rethinking this dream, looking for new paths to stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-455-points-higher-nifty-settles-above-25000-eternal-tanks-5-2730715-2025-05-26",
      "headline": "Sensex ends 455 points higher, Nifty settles above 25,000; Eternal tanks 5%At the closing bell, the BSE Sensex was up 455.37 points to 82,176.45, while the NSE Nifty50 settled 148 points higher at 25,001.15. The broader markets also performed well during the session, extending the rally in mid-cap and small-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-lta-exempt-under-the-new-tax-regime-what-you-should-know-2730656-2025-05-26",
      "headline": "Is LTA exempt under the New Tax Regime? What you should knowLeave Travel Allowance (LTA) is a common perk in many salary packages, yet with two tax regimes in place, people often ask if the exemption holds true in the new tax regime. Let's find out in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/2025-amas-full-performer-lineup-nominees-and-ticket-info-glbs-2731037-2025-05-27",
      "headline": "2025 AMAs: Full performer lineup, nominees, and ticket infoThe 2025 AMAs air May 26 from Las Vegas, hosted by Jennifer Lopez. With major performances, big-name nominees, and honors for Janet Jackson and Rod Stewart, it promises a star-studded celebration.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/captain-america-brave-new-world-streaming-on-disney-starting-may-28-glbs-2731036-2025-05-27",
      "headline": "Captain America: Brave new world streaming on Disney+ starting May 28Captain America: Brave New World begins streaming on Disney+ May 28. Already a box office success, the Marvel blockbuster stars Anthony Mackie and features a star-studded cast in key roles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saif-ali-khan-deepika-padukone-diana-pentys-cocktail-set-for-re-release-in-may-2730935-2025-05-26",
      "headline": "Saif Ali Khan, Deepika Padukone, Diana Penty's Cocktail set for re-release in May'Cocktail,' featuring Saif Ali Khan, Diana Penty and Deepika Padukone in lead roles, is all set to return to the big screens. The film is directed by Homi Adajania."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-anistons-sunday-photo-dump-features-hindu-goddesses-lakshmi-and-durga-2730923-2025-05-26",
      "headline": "Jennifer Aniston's 'sunday photo dump' features Hindu Goddesses Lakshmi and Durga'FRIENDS' star Jennifer Aniston uploaded multiple pictures on Sunday, one of which has grabbed the attention of her fans in India. The particular picture features idols of Hindu Goddesses Lakshmi and Durga, next to an idol of Laughing Buddha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/actor-abhishek-banerjees-award-winning-crime-drama-stolen-to-release-in-june-2025-2730906-2025-05-26",
      "headline": "Abhishek Banerjee's award-winning crime-drama Stolen to release in June 2025Actor Abhishek Banerjee's film 'Stolen' is all set to release on Prime Video, two years after its debut at the Venice Film Festival. Anurag Kashyap, Kiran Rao, Nikkhil Advani and Vikramaditya Motwane have executive produced the crime-thriller."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naveen-polishettys-anaganaga-oka-raju-set-for-sankranthi-2026-release-2730908-2025-05-26",
      "headline": "Naveen Polishetty's Anaganaga Oka Raju set for Sankranthi 2026 release After multiple delays, the makers of 'Anaganaga Oka Raju' finally confirmed its release for Sankranthi 2026. The family entertainer stars Naveen Polishetty and Meenakshi Chaudhary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-release-date-siddhant-chaturvedi-triptii-dimri-love-story-in-august-2730907-2025-05-26",
      "headline": "Dhadak 2 release date out: Siddhant-Triptii's film to hit cinemas in AugustAfter facing many delays, 'Dhadak 2', starring Siddhant Chaturvedi and Triptii Dimri, is set to hit theatres. The film will be released in August this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simbu-manchu-manoj-are-bromance-goal-bhairavam-2730801-2025-05-26",
      "headline": "Actor Simbu on Manchu Manoj: He's like a small kid, show him love, not angerAt the pre-release event of Bhairavam, Manchu Manoj called his friend, actor Simbu, during a live segment, leading to a candid and cheerful exchange. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-aravind-extends-support-to-pawan-kalyan-distances-from-exhibitors-strike-2730796-2025-05-26",
      "headline": "Allu Aravind extends support to Pawan Kalyan, distances from exhibitors strikePushpa star Allu Arjun's father and producer Allu Aravind addressed speculations regarding his involvement in the ongoing exhibitor's strike in Telangana and Andhra Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-raveena-tandon-recalls-reason-behind-fight-with-karisma-kapoor-shared-non-veg-jokes-2730838-2025-05-26",
      "headline": "Raveena Tandon on alleged feud with Karisma Kapoor: It was classroom politicsActor Raveena Tandon recently recalled her catfight with Karisma Kapoor in the 90s on film sets. In a conversation with Farah Khan on her Vlog, Raveena called it, 'classroom politics.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/singer-demi-lovato-marries-jordan-jutes-in-la-wears-vivienne-westwood-corset-gown-2730770-2025-05-26",
      "headline": "Singer Demi Lovato marries Jordan Jutes in LA, wears Vivienne Westwood corset gownSinger and actor Demi Lovato on Sunday got married to her fiancé, Jordan Jutes Lutes, in California. The bride wore a custom Vivienne Westwood corset dress for the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-chhavi-mittal-on-tahira-kashyaps-advice-during-cancer-diagnosis-gave-me-confidence-2730714-2025-05-26",
      "headline": "Actor Chhavi Mittal says Tahira Kashyap gave her 'confidence' during cancer battleActor Chhavi Mittal said that Tahira Kashyap was the first person she had a long conversation with during her breast cancer diagnosis. Chhavi shared how Tahira's advice gave her clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/sunny-leone-wraps-shoot-for-her-first-hollywood-film-leaked-photos-2730731-2025-05-26",
      "headline": "Sunny Leone wraps shoot for her first independent Hollywood film. See picsSunny Leone is set to make her debut in an independent Hollywood film, playing a United Nations peacekeeping soldier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-switches-to-hulk-mode-at-75-with-heavy-workout-son-hrithik-roshan-goes-uff-watch-viral-video-2730739-2025-05-26",
      "headline": "Rakesh Roshan switches to Hulk mode at 75 with heavy workout, Hrithik commentsFilmmaker Rakesh Roshan shared an inspiring video on social media. The 'Krrish' director could be seen working out dedicatedly in a gym, trying to make the 'best' of every day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-releases-happy-burstday-album-on-10th-anniversary-with-solo-tracks-2730713-2025-05-26",
      "headline": "SEVENTEEN releases Happy Burstday album on 10th anniversary with solo tracksSEVENTEEN commemorated their 10th anniversary by releasing their fifth studio album, 'Happy Burstday'. The album highlights individual member projects and features global artists Pharrell Williams and Timbaland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-glimpse-out-adivi-sesh-mrunal-thakurs-film-for-christmas-release-2730689-2025-05-26",
      "headline": "Dacoit glimpse out: Adivi Sesh-Mrunal Thakur's film for Christmas releaseThe makers of Adivi Sesh's much-awaited bilingual 'Dacoit' have unveiled a fiery glimpse video. The film is releasing on December 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-expresses-admiration-for-fahadh-faasil-at-cannes-aavesham-is-my-favourite-2730682-2025-05-26",
      "headline": "Alia Bhatt expresses admiration for Fahadh Faasil: Aavesham is my favouriteAlia Bhatt, who made her debut at Cannes, recently expressed her admiration for Malayalam actor Fahadh Faasil and said that she would definitely be interested in working with him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ishaan-khatter-on-feeling-safe-shooting-intimate-scenes-with-naughty-tabu-2730675-2025-05-26",
      "headline": "Ishaan Khatter on 'feeling safe' shooting intimate scenes with 'naughty' TabuActor Ishaan Khatter recently recalled her 'A Suitable Boy' days with co-star Tabu. The actor appreciated Tabu for being supportive while filming intense scenes. He will next be seen in Neeraj Ghaywan's 'Homebound.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/crpf-jawan-arrested-for-spying-for-pak-moti-ram-jat-pahalgam-posting-terror-attack-2730963-2025-05-26",
      "headline": "'Pak spy' CRPF jawan's Pahalgam posting ended 6 days before terror attackMoti Ram Jat was actively involved in espionage activity and had been sharing classified information related to national security with Pakistani intelligence officers (PIOs) since 2023."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-weather-update-heavy-rain-lashes-city-again-after-brief-respite-red-alert-till-830-am-2731018-2025-05-26",
      "headline": "Heavy rain lashes Mumbai again after brief respite, red alert till 8:30 amThe amount of rainfall that Mumbai received in the last 24 hours broke a 107-year record for the month of May."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/car-hits-crowd-during-liverpool-premier-league-parade-several-injured-glbs-2731027-2025-05-27",
      "headline": "Car hits crowd at Liverpool Premier League victory parade, suspect arrestedA man was arrested after a car struck pedestrians during Liverpool's title celebrations. Several were injured. Prime Minister Starmer called the incident \"appalling\" and praised emergency services for their quick response.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-governor-airlifted-to-raj-bhawan-to-dodge-protest-over-bus-name-row-2730964-2025-05-26",
      "headline": "Manipur Governor airlifted to Raj Bhawan to dodge protest over bus name rowThe Coordinating Committee on Manipur Integrity (COCOMI) observed a 48-hour strike across Manipur last week to protest against the alleged concealing of the state's name from a government bus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-cannes-gucci-gown-saree-lehenga-debate-2730777-2025-05-26",
      "headline": "No Gucci, that Alia Bhatt outfit was not a gownIn a noteworthy fashion moment, Alia Bhatt attended the Cannes Film Festival closing ceremony in a custom-made Gucci outfit. But was it really a gown, as the brand labelled it in an Instagram post? Not quite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-considers-redirecting-3-billion-in-harvard-grants-to-us-trade-schools-glbs-2731025-2025-05-27",
      "headline": "Trump considers redirecting $3 billion in Harvard grants to US trade schoolsPresident Trump said he may pull $3 billion in federal grants from Harvard University and reallocate the funds to trade schools, citing the need for practical education and concerns over antisemitism.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-jaishankar-us-mediation-claim-trump-operation-sindooor-2730785-2025-05-26",
      "headline": "US warned about big Pak attack, we said we'll hit harder: Jaishankar to MPs panelChairing a meeting of MPs, External Affairs Minister (EAM) S Jaishankar clarified that the ceasefire was initiated by Pakistan through military channels, dismissing US claims of brokering the de-escalation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/video-moment-when-car-rams-liverpool-fans-during-victory-parade-glbs-2731034-2025-05-27",
      "headline": "Video: Moment when car rams Liverpool fans during victory paradeA speeding car drove into crowds celebrating Liverpool's Premier League win. A video has captured the moment of impact. The incident injured several people. A British man has been arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-yadav-politician-turned-social-media-influencer-son-of-rjd-chief-lalu-prasad-yadav-2730920-2025-05-26",
      "headline": "Tej Pratap Yadav: Politician, lover, influencerTej Pratap's social media reveals how the eldest of the Yadav clan lives in his own world, divided between his deities and his group of supporters, some of whom call him Teju Bhaiya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/illegal-bangladeshi-from-india-push-ins-unacceptable-ready-to-step-in-if-needed-bangladesh-army-2730909-2025-05-26",
      "headline": "Push-ins from India unacceptable, ready to step in if needed: Bangladesh ArmyA top officer of the Bangladesh Army termed India's handing over of Bangladeshi illegal immigrants a \"push in\" and said it was \"unacceptable\". Brigadier General Md Nazim-ud-Daula said the army was ready to step in if needed and instructed by the government. India has been handing over Bangladeshi illegal immigrants to Border Guard Bangladesh personnel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-report-josh-inglis-priyansh-arya-shreyas-iyer-jaipur-2731003-2025-05-26",
      "headline": "PBKS vs MI: Punjab secure top two spot after 11 years, send Mumbai to EliminatorJosh Inglis and Priyansh Arya were the stars of the show as Punjab Kings secured their first top-two finish in 11 years in Jaipur on Monday, May 26. This meant that MI will play in the Eliminator of IPL 2025. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/french-president-emmanuel-macron-wife-brigitte-smack-his-face-viral-video-2730701-2025-05-26",
      "headline": "Did Macron's wife smack him in the face? Here's what we know about viral videoA video of French President Emmanuel Macron arriving in Vietnam has gone viral. It shows his wife, Brigitte, seemingly smacking him in the face just as he stepped off an aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-booklet-tri-service-chief-command-centre-may-7-india-pak-conflict-2730945-2025-05-26",
      "headline": "Three service chiefs monitored Op Sindoor in real-time, show new picsThe Indian Army released a detailed booklet on Operation Sindoor, showcasing the command centre and leadership during precision strikes on terror infrastructure across Pakistan and POK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-defeats-d-gukesh-norway-chess-classical-round-2731035-2025-05-27",
      "headline": "D Gukesh loses to Magnus Carlsen in thriller in Norway Chess openerNorway Chess 2025: World No. 1 Magnus Carlsen defeated world champion D Gukesh in a thrilling opening-round game on Monday. Arjun Erigaisi, meanwhile, began his campaign with a win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1-b-visa-blamed-for-walmart-layoff-speculation-lacks-evidence-tech-workers-in-us-tech-cto-suresh-kumar-2730710-2025-05-26",
      "headline": "H-1 B visa blamed as Walmart lays off 1,500, MAGA links it to Indian-origin CTOWalmart's decision to lay off over 1,500 employees in the US has triggered a backlash from the MAGA faithful, who claim the company is replacing American workers with foreign nationals on H-1B visas. Without a shred of evidence, the MAGA crowd is linking the move to a top Indian-origin executive at Walmart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/they-are-in-cahoots-tej-prataps-estranged-wife-aishwarya-rejects-lalu-yadavs-action-against-him-as-poll-season-drama-2730774-2025-05-26",
      "headline": "As Lalu Yadav expels son over sanskar, daughter-in-law shreds it as poll dramaAishwarya Roy rejected the action against Tej Pratap as a mere eyewash to mislead people ahead of Bihar Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-asks-couple-fighting-for-childs-custody-to-talk-out-issues-over-coffee-and-dinner-2730883-2025-05-26",
      "headline": "Talk it out over coffee: Court to 'high-society' couple in child's custody battleThe couple is in the middle of divorce proceedings filed by the wife, who wants court's permission to travel to Europe with their 3-year-old daughter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-closes-sexual-harassment-case-under-pocso-against-former-wrestling-body-chief-brij-bhushan-singh-2730895-2025-05-26",
      "headline": "Delhi court closes POCSO case against ex-wrestling body chief Brij BhushanThe Delhi Police submitted a report under Section 173 CrPC, requesting the cancellation of the case based on the statements of the minor complainant and her father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-inspiration-rafael-nadal-naomi-osaka-french-open-2025-2730934-2025-05-26",
      "headline": "How Rafael Nadal's footprint inspired Paula Badosa in comeback win vs Naomi OsakaFrench Open 2025: World No.1 Paula Badosa drew inspiration from Rafael Nadal's bronze footprint on Court Philippe-Chatrier to secure a hard-fought win over Naomi Osaka in the first round of the Roland Garros."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-foreign-wife-shopping-china-warns-against-marriage-scams-in-bangladesh-2730474-2025-05-26",
      "headline": "No 'foreign wife' shopping: China warns against marriage scams in BangladeshThe Chinese embassy in Bangladesh warned its citizens not to fall for deceptive \"cross-border dating\" content on short video platforms or seek out so-called \"foreign wives\" through informal networks or commercial matchmaking agencies,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-army-says-no-differences-with-the-yunus-government-pressure-elections-2730872-2025-05-26",
      "headline": "No differences with government: Top Bangladesh Army officer amid reports of riftCalling the Army and Bangladesh government \"parts of the same family\", Brigadier General Md Nazim-ud-Daula said that any minor differences should be viewed in context."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-politics-kabhi-khushi-kabhie-gham-moment-lalu-prasad-yadav-disowns-son-tej-pratap-2730819-2025-05-26",
      "headline": "K3G moment in Bihar politics: Lalu disowns son Tej Pratap over 'love confession'What the Yadav family experienced felt straight out of a Bollywood drama, as Lalu Prasad Yadav expelled his son Tej Pratap not just from the RJD but from the family itself, citing \"irresponsible behaviour.\" The dramatic turn of events drew uncanny parallels to Yashvardhan Raichand disowning his son Rahul over a love affair in Kabhi Khushi Kabhie Gham."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-defeats-d-gukesh-norway-chess-classical-round-2731035-2025-05-27",
      "headline": "D Gukesh loses to Magnus Carlsen in thriller in Norway Chess openerNorway Chess 2025: World No. 1 Magnus Carlsen defeated world champion D Gukesh in a thrilling opening-round game on Monday. Arjun Erigaisi, meanwhile, began his campaign with a win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-rcb-akash-deep-press-conference-pant-injury-2731031-2025-05-27",
      "headline": "Akash Deep blames pacers' injuries for LSG's failure to reach playoffsLucknow Super Giants pacer Akash Deep said that all four of LSG's main fast bowlers were sidelined before the tournament started, which affected the team's rhythm and bowling strength. LSG were marred by injuries ahead of IPL 2025, with the four main pacers, Mayank Yadav, Avesh Khan, Mohsin Khan, and Akash Deep, all unavailable for the first few games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-spin-bowling-coach-malolan-rangarajan-press-conference-2731024-2025-05-27",
      "headline": "RCB spin bowling coach slams IPL title drought talks ahead of LSG clashRoyal Challengers Bengaluru (RCB) spin bowling coach Malolan Rangarajan has dismissed criticism over the franchise's title drought and comparisons with England's underperforming men's football team. Speaking ahead of RCB's final IPL 2025 group match against Lucknow Super Giants, Rangarajan insisted that the team's past doesn't weigh on the current squad, which he believes is far more balanced and focused than previous line-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-preity-zinta-celebration-punjab-kings-reach-qualifier-1-2731021-2025-05-27",
      "headline": "Preity Zinta celebrates in stands as Punjab end 11-year wait for top 2 finishPunjab Kings co-owner Preity Zinta jumped in celebration after captain Shreyas Iyer sealed a seven-wicket win over Mumbai Indians with a match-winning six, securing PBKS's spot in Qualifier 1 of the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-shreyas-iyer-ricky-ponting-bond-jaipur-2731022-2025-05-27",
      "headline": "Shreyas Iyer explains secret to Punjab's success, reveals Ricky Ponting camaraderieShreyas Iyer revealed the secret behind Punjab Kings' success this season and opened up on his bond with Ricky Ponting. PBKS secured a top-two finish for the first time in 11 years as they beat MI in Jaipur on Monday, May 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-report-josh-inglis-priyansh-arya-shreyas-iyer-jaipur-2731003-2025-05-26",
      "headline": "PBKS vs MI: Punjab secure top two spot after 11 years, send Mumbai to EliminatorJosh Inglis and Priyansh Arya were the stars of the show as Punjab Kings secured their first top-two finish in 11 years in Jaipur on Monday, May 26. This meant that MI will play in the Eliminator of IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-14-titles-record-broken-footprint-centre-court-2730999-2025-05-26",
      "headline": "My Roland Garros record may fall, but it will take at least 30 years: Rafael NadalFrench Open 2025: Speaking after receiving a glorious tribute at Roland Garros on Sunday, legendary Rafael Nadal said it will need at least three decades for anyone to emulate his record of 14 titles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-live-streaming-d-gukesh-vs-magnus-carlsen-round-1-match-2730957-2025-05-26",
      "headline": "D Gukesh vs Magnus Carlsen at Norway Chess: When and where to watchNorway Chess 2025: D Gukesh will take on world No.1 Carlsen in the opening round in what should be one of the most keenly-contested matches in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-breaks-mumbai-indians-ipl-season-runs-record-2730946-2025-05-26",
      "headline": "Suryakumar Yadav breaks Sachin Tendulkar's Mumbai Indians record in IPLSuryakumar Yadav has gone past Sachin Tendulkar's long-standing record for the most runs scored by a Mumbai Indians batter in a single season of the Indian Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-andy-murray-banter-champions-league-real-madrid-vs-arsenal-2730948-2025-05-26",
      "headline": "Rafael Nadal reveals Andy Murray banter after Arsenal beat Real Madrid in UCLRafael Nadal revealed the fun banter he had with Andy Murray after Arsenal defeated Real Madrid in the Champions League quarterfinals this season. Nadal revealed it during the press conference after his tribute at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-taylor-fritz-shocked-paula-badosa-beats-naomi-osaka-2730940-2025-05-26",
      "headline": "Upset in Round 1 as 4th seed Fritz ousted, Badosa knocks out OsakaFrench Open 2025: Fourth seed Taylor Fritz crashed out in the first round after losing in four sets to World No. 66 Daniel Altmaier. Meanwhile, Naomi Osaka lost her women's singles first-round match to 10th seed Paula Badosa on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-14-titles-record-broken-footprint-centre-court-2730999-2025-05-26",
      "headline": "My Roland Garros record may fall, but it will take at least 30 years: Rafael NadalFrench Open 2025: Speaking after receiving a glorious tribute at Roland Garros on Sunday, legendary Rafael Nadal said it will need at least three decades for anyone to emulate his record of 14 titles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-live-streaming-d-gukesh-vs-magnus-carlsen-round-1-match-2730957-2025-05-26",
      "headline": "D Gukesh vs Magnus Carlsen at Norway Chess: When and where to watchNorway Chess 2025: D Gukesh will take on world No.1 Carlsen in the opening round in what should be one of the most keenly-contested matches in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-breaks-mumbai-indians-ipl-season-runs-record-2730946-2025-05-26",
      "headline": "Suryakumar Yadav breaks Sachin Tendulkar's Mumbai Indians record in IPLSuryakumar Yadav has gone past Sachin Tendulkar's long-standing record for the most runs scored by a Mumbai Indians batter in a single season of the Indian Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-andy-murray-banter-champions-league-real-madrid-vs-arsenal-2730948-2025-05-26",
      "headline": "Rafael Nadal reveals Andy Murray banter after Arsenal beat Real Madrid in UCLRafael Nadal revealed the fun banter he had with Andy Murray after Arsenal defeated Real Madrid in the Champions League quarterfinals this season. Nadal revealed it during the press conference after his tribute at Roland Garros. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-taylor-fritz-shocked-paula-badosa-beats-naomi-osaka-2730940-2025-05-26",
      "headline": "Upset in Round 1 as 4th seed Fritz ousted, Badosa knocks out OsakaFrench Open 2025: Fourth seed Taylor Fritz crashed out in the first round after losing in four sets to World No. 66 Daniel Altmaier. Meanwhile, Naomi Osaka lost her women's singles first-round match to 10th seed Paula Badosa on Monday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}