{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-all-time-high-after-early-dip-ola-electric-shares-up-4-percent-2601842-2024-09-18",
      "headline": "Sensex, Nifty hit all-time high after early dip; Ola Electric shares up 4%The S&P BSE Sensex added 188.33 points to 83,267.99, while the NSE Nifty50 gained 46.90 points to 25,465.45"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-yet-to-pay-rs-350-crore-in-tds-pf-of-employees-2601826-2024-09-18",
      "headline": "SpiceJet yet to pay Rs 350 crore in TDS, PF of employeesSpiceJet has not paid Rs 220 crore in TDS deductions from employees' salaries between April 2020 and August 2023 to tax authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-richest-and-poorest-states-south-leads-gdp-race-west-bengal-stumbles-2601807-2024-09-18",
      "headline": "India's richest and poorest states: South leads GDP race, West Bengal stumblesWhile the southern states have emerged as major contributors to India's GDP, states like West Bengal, once economically strong, have witnessed a puzzling decline, according to a working paper released by the Economic Advisory Council to the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-to-be-introduced-today-check-scheme-details-benefits-and-more-2601793-2024-09-18",
      "headline": "NPS Vatsalya to be introduced today: Check scheme details, benefits and moreThe scheme, announced during the Budget in July 2024, is designed for parents and guardians to make long-term investments for their minor children.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/centre-asks-edible-oil-industry-to-maintain-prices-amid-duty-hike-on-imports-2601782-2024-09-18",
      "headline": "Centre asks edible oil industry to maintain prices amid duty hike on importsThe leading edible oil associations were advised to ensure that the MRP of each type of oil is maintained until stocks imported at 0% and 12.5% BCD are exhausted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-ahead-of-us-feds-rate-decision-bajaj-finance-jumps-2601780-2024-09-18",
      "headline": "Sensex, Nifty open flat ahead of US Fed's rate decision; Bajaj Finance jumps The S&P BSE Sensex was up 27.55 points to 83,107.21 at 10:23 am, while the NSE Nifty50 rose 0.90 points to trade at 25,419.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-18-2024-yellow-metal-trades-higher-silver-records-dip-mcx-latest-rates-2601767-2024-09-18",
      "headline": "Gold, silver price today, September 18, 2024: Yellow metal trades higher, silver records dip on MCXGold Price Today 18 September 2024: Gold is trading on the higher side while silver rates have recorded a dip on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-guardian-in-talks-to-sell-observer-newspaper-to-tortoise-media-2601546-2024-09-17",
      "headline": "UK's Guardian in talks to sell Observer newspaper to Tortoise Media: ReportTortoise said negotiations include a commitment from it to invest more than 25 million pounds ($33 million) over the next five years in the editorial and commercial renewal of the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smriti-irani-discusses-gender-parity-with-world-bank-leaders-highlights-indias-progress-2601374-2024-09-17",
      "headline": "Smriti Irani discusses gender parity with World Bank leaders, highlights India's progressDuring her meeting in Washington, Smriti Irani highlighted the need for effective implementation of gender equity policies to ensure that women, especially in developing regions, can contribute to both government and industry while realising their full potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-stock-market-closing-us-federal-reserve-rate-decision-2601322-2024-09-17",
      "headline": "Sensex, Nifty rise ahead of US Fed rate decision; Ola Electric shares surgeThe S&P BSE Sensex was up 90.88 points at 83,079.66 at the closing bell, while the NSE Nifty50 gained 34.80 points to settle at 25,418.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-launches-alert-trigger-orders-on-kite-mobile-what-you-need-to-know-2601286-2024-09-17",
      "headline": "Zerodha to bring 'Alert Trigger Orders' on Kite mobile: What you need to knowUnlike standard alerts that only notify traders when certain market conditions are met, ATOs take it a step further by automatically executing a basket of orders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-rally-160-percent-post-ipo-book-profits-or-hold-explained-2601219-2024-09-17",
      "headline": "Bajaj Housing Finance shares rally 160% post-IPO: Book profits or hold?Bajaj Housing Finance share price: On Tuesday, the stock hit its 10% upper circuit at Rs 181.50 on the National Stock Exchange (NSE), continuing its upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-25-or-50-bps-how-will-it-impact-global-market-explained-2601209-2024-09-17",
      "headline": "Will US Fed cut rates by 25 bps or 50 bps? Here's all you need to knowA 25 bps rate cut could calm markets, but a deeper one may raise economic alarm.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-25-or-50-bps-this-week-why-is-it-important-explained-2601192-2024-09-17",
      "headline": "US Fed likely to cut key rates this week. Why is it a big deal?The US central bank is likely to cut interest rates for the first time in more than four years, with experts predicting a 0.25 percentage point reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-50-percent-upside-goldman-sachs-price-target-rs-160-2601154-2024-09-17",
      "headline": "Ola Electric set for 50% upside? Here's why Goldman Sachs is bullishGoldman Sachs has projected a 50% upside for the Ola Electric stock, setting a target price of Rs 160. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-on-a-roll-after-bumper-ipo-listing-is-there-more-upside-2601135-2024-09-17",
      "headline": "Bajaj Housing Finance shares continue post-IPO rally. More upside left?Bajaj Housing Finance share price: The sharp rise in the company's share price comes a day after the company's stellar IPO debut and indicates continued bullish momentum in the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-jumped-over-6-percent-today-explained-2601100-2024-09-17",
      "headline": "Explained: Why Ola Electric shares jumped over 6% todayOla Electric shares rebound sharply after a month-long slump. Read on to know what fuelled today's surge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-makes-bumper-debut-book-profit-now-or-stay-invested-2601087-2024-09-17",
      "headline": "PN Gadgil Jewellers makes bumper debut: Book profit now or stay invested?PN Gadgil Jewellers share price: Market experts see the sharp premium at listing as a signal of investor confidence in PN Gadgil's strong growth trajectory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-shares-make-bumper-debut-with-73-premium-over-ipo-price-2601082-2024-09-17",
      "headline": "PN Gadgil Jewellers shares make bumper debut with 73% premium over IPO pricePN Gadgil Jewellers listing: The Maharashtra-based jewellery retail chain saw a strong listing on the Bombay Stock Exchange (BSE), where its shares opened at Rs 834, marking a 73.75% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-flat-us-federal-reserve-interest-rate-cut-decision-2601070-2024-09-17",
      "headline": "Sensex, Nifty open flat near all-time highs ahead of US Fed's rate decisionThe S&P BSE Sensex was down 23.7 points at 82,965.08, while the NSE Nifty50 fell 3.25% to 25,380.50."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-pager-explosions-israel-supply-chain-attacks-2601838-2024-09-18",
      "headline": "Supply chain attack turned pagers into killer devices in Lebanon?Lebanon pager blasts: What led to the pagers in Lebanon, which became obsolete in the early 2000s, to explode? Experts have called it a prime example of a supply chain attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-planted-explosives-hezbollah-lebanon-taiwan-made-pagera-explosion-2601695-2024-09-18",
      "headline": "Israel's Mossad planted explosives in Hezbollah's Taiwan-made pagers: ReportsIsrael's Mossad planted explosives inside 5,000 Taiwan-made pagers ordered by Hezbollah, months ahead of the mass detonations across Lebanon that killed nine people and injured nearly 3,000 on Tuesday.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-pm-narendra-modi-us-visit-quad-summit-import-tariffs-2601819-2024-09-18",
      "headline": "Trump says India abuser of import tariffs, calls PM Modi fantastic ahead of meetFormer US President Donald Trump stated that he will be meeting with PM Modi next week during his three-day visit to the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ernst-and-young-pune-employee-26-dies-work-pressure-mother-heartbreaking-letter-2601811-2024-09-18",
      "headline": "A mother's powerful letter to EY India on 'work culture' after daughter's deathAnna Sebastian Perayil, a chartered accountant from Kerala, joined Ernst & Young in March as her mother blamed \"four months of EY's callous attitude\" for her death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/kate-winslet-got-testosterone-therapy-to-feel-sexy-what-does-it-do-to-your-body-2601232-2024-09-18",
      "headline": "Kate Winslet got testosterone therapy to 'feel sexy'. What does it do to your body?Hollywood actor Kate Winslet has sparked curiosity among many women about the connection between testosterone and sex drive. If you are considering opting for testosterone replacement therapy, take a moment to fully understand it first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-richest-and-poorest-states-south-leads-gdp-race-west-bengal-stumbles-2601807-2024-09-18",
      "headline": "India's richest and poorest states: South leads GDP race, West Bengal stumblesWhile the southern states have emerged as major contributors to India's GDP, states like West Bengal, once economically strong, have witnessed a puzzling decline, according to a working paper released by the Economic Advisory Council to the Prime Minister."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-to-vacate-delhi-chief-minister-residence-in-one-week-sanjay-singh-aap-liquor-policy-scam-2601831-2024-09-18",
      "headline": "Arvind Kejriwal to vacate Delhi chief minister's residence in few weeks: AAPAam Aadmi Party (AAP) Rajya Sabha MP Sanjay Singh said that Arvind Kejriwal will vacate the Delhi Chief Minister's official residence in a few weeks and a search for suitable accommodation for him and his family is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/satirist-bassem-youssef-israel-mossad-lebanon-pager-attacks-hezbollah-2601729-2024-09-18",
      "headline": "You win Israel: Satirist Bassem Youssef as reports link Mossad to pager attacksAt least nine people were killed and nearly 3,000 others injured after thousands of pagers used by Hezbollah members detonated across Lebanon. Reports said Israel's Mossad spy agency planted explosives inside the Taiwan-made pagers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/political-entry-bollywood-politics-nepotism-restriction-outsider-entry-gatekeeping-lok-sabha-shah-rukh-khan-kashmir-election-2601083-2024-09-18",
      "headline": "Why Lok Sabha doesn't have many Shah Rukh KhansIf there's any profession that can match Bollywood in restricting smooth entry of outsiders, it is politics. Even as Iltija Mufti, daughter of former J&K Chief Minister Mehbooba Mufti, makes her electoral debut, here's a study that reveals how 32% of MPs in the current Lok Sabha are political dynasts. Shah Rukh Khans are rare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-multiple-drone-attacks-ukraine-russia-tver-force-evacuation-2601821-2024-09-18",
      "headline": "Video: Multiple Ukrainian drone attacks force evacuation in Russian townThe video of the drone attack shows thick smoke billowing from the attack site. However, no information is currently available regarding the number of casualties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-pager-explosions-taiwan-company-gold-apollo-denies-making-devices-2601762-2024-09-18",
      "headline": "Taiwan firm denies making pagers that detonated in LebanonMedia reports said Israel's Mossad spy agency planted explosives inside the Taiwan-made pagers. The explosions in Lebanon killed nine people and injured nearly 3,000 others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-karol-bagh-portion-building-collapse-several-feared-trapped-fire-tenders-2601778-2024-09-18",
      "headline": "Portion of building collapses in Delhi's Karol Bagh, 12 rescuedA senior police officer has confirmed that there were no reports of any casualties and the search and rescue operations are being carried out by the Delhi Fire Service, police and personnel from the National Disaster Response Force."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/delhi-groundwater-very-high-salt-content-saline-kidneys-problems-report-2601805-2024-09-18",
      "headline": "How bad is the high salt content in Delhi's groundwater for kidneys?One out of four groundwater samples in Delhi had a very high salt content. Doctors advise on how excessive salt could threaten the kidneys. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-assembly-election-first-phase-constituencies-voting-2601684-2024-09-18",
      "headline": "Polls largely peaceful in J&K, Omar Abdullah warns against division of votes Live UpdatesThe first phase of the Jammu and Kashmir Assembly elections on Wednesday will see 24 constituencies across seven districts voting for the first time in 10 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-masala-interview-india-vs-bangladesh-test-series-2601751-2024-09-18",
      "headline": "Watch: Kohli interviews Gambhir, puts end to 'masala' in crackling chatWatch: Star batter Virat Kohli and head coach Gautam Gambhir sat down for an engaging interview, putting an end to years of rumors about the reported tension between the two."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udhayanidhi-stalin-tamil-nadu-deputy-chief-minister-dmk-mk-stalin-son-2601789-2024-09-18",
      "headline": "Udhayanidhi Stalin likely to be Tamil Nadu Deputy Chief Minister: SourcesUdhayanidhi Stalin, son of Tamil Nadu Chief Minister MK Stalin, is currently the Sports Minister of the state and his possible elevation to deputy chief minister's post is expected in the next 24 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/reviews/story/2024-hyundai-alcazar-2600823-2024-09-18",
      "headline": "2024 Hyundai Alcazar first drive, review: More luxury, better valueThe Tata Safari, Mahindra Scorpio N and the MG Hector are good six and seven-seat options. But Hyundai has now revamped the Alcazar to take on the challengers. Here is what it offers and how it drives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/titan-submersible-ill-fated-journey-first-picture-released-hearing-final-message-revealed-titanic-wreck-2601675-2024-09-18",
      "headline": "Image of Titan sub, chilling 3-word message before implosion revealedThe first photo of the Titan sub, which suffered a catastrophic implosion last year, killing five people onboard, was released during a public hearing. A chilling three-word text by the Titan's crew revealed that \"all was good\" even as the sub descended further."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-fighters-injured-lebanon-pagers-explode-in-biggest-security-breach-2601482-2024-09-17",
      "headline": "9 killed, 2,750 injured in Lebanon pager blasts, Hezbollah vows to punish Israel Live Updates According to Reuters, a Hezbollah official said the detonation of the pagers was the \"biggest security breach\" the group had been subjected to in nearly a year of war with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-rg-kar-doctors-seek-fresh-talks-with-mamata-banerjee-government-continue-protest-2601686-2024-09-18",
      "headline": "Kolkata doctors to continue cease-work protest, seek fresh talks with governmentSeeking a new round of talks, the protesting doctors said that the West Bengal government should provide them with a \"democratic environment\" and also listed fresh demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-virat-kohli-gautam-gambhir-interview-rohit-sharma-chennai-2601836-2024-09-18",
      "headline": "Do you eat soaked almonds? Virat Kohli tells Gautam Gambhir to ask Rohit SharmaVirat Kohli told India coach Gautam Gambhir to ask a hilarious question to Rohit Sharma when he gets to interview the captain next time. Kohli and Gambhir interacted in a fine interview which was released by the BCCI on September 18, Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/partial-lunar-eclipse-september-harvest-moon-supermoon-2601797-2024-09-18",
      "headline": "Partial lunar eclipse darkens supermoon in rare celestial eventThe partial lunar eclipse, visible in many parts of the world but India, was the last lunar eclipse of 2024. It coincided with the September full moon, known as the Harvest Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-to-be-introduced-today-check-scheme-details-benefits-and-more-2601793-2024-09-18",
      "headline": "NPS Vatsalya to be introduced today: Check scheme details, benefits and moreThe scheme, announced during the Budget in July 2024, is designed for parents and guardians to make long-term investments for their minor children.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/kempegowda-international-airport-bengaluru-karnataka-kannada-sahitya-parishad-culture-art-2601766-2024-09-18",
      "headline": "Karnataka literary body calls for flight announcements in Kannada  The Bengaluru airport is collaborating with the Kannada Sahitya Parishad for the 87th edition of the Akhila Bharatha Kannada Saahitya Sammelana in Mandya, scheduled to take place from December 20-22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/great-indian-kapil-show-teases-a-gala-time-with-alia-bhatt-and-karan-johar-2601848-2024-09-18",
      "headline": "Great Indian Kapil Show teases a gala time with Alia Bhatt and Karan JoharThe teaser of the second season of Great Indian Kapil Show is here. The first episode will feature guests from the upcoming release Jigra -- Karan Johar, Alia Bhatt, Vedang Raina and director Vasan Bala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-not-having-children-javed-akhtar-society-makes-you-feel-incomplete-2601825-2024-09-18",
      "headline": "Shabana Azmi on not having children: Society makes you feel incompleteShabana Azmi recently opened up on being unable to bear children. The actor, who is celebrating her 74th birthday today, discussed the challenges she faced in accepting this reality and how societal pressures made her feel incomplete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/miley-cyrus-sued-flowers-alleged-bruno-mars-when-i-was-your-man-copy-2601817-2024-09-18",
      "headline": "Singer Miley Cyrus sued for allegedly copying Bruno Mars for FlowersSinger Miley Cyrus is being sued for allegedly copying Bruno Mars' song When I Was Your Man for her Grammy-winning hit Flowers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mickey-17-trailer-robert-pattinson-dies-for-a-living-in-bong-joon-ho-sci-fi-film-steven-yeun-naomi-ackie-2601815-2024-09-18",
      "headline": "Mickey 17 trailer: Robert Pattinson dies for a living in Bong Joon-ho sci-fi filmThe first trailer for Bong Joon-ho's highly anticipated sci-fi thriller Mickey 17 was released on September 18. Starring Robert Pattinson, the film will explore themes of identity, mortality, and survival."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-virat-kohli-gautam-gambhir-interview-rohit-sharma-chennai-2601836-2024-09-18",
      "headline": "Do you eat soaked almonds? Virat Kohli tells Gautam Gambhir to ask Rohit SharmaVirat Kohli told India coach Gautam Gambhir to ask a hilarious question to Rohit Sharma when he gets to interview the captain next time. Kohli and Gambhir interacted in a fine interview which was released by the BCCI on September 18, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/shooting-manu-bhaker-los-angeles-olympics-gold-medal-jaspal-rana-2601801-2024-09-18",
      "headline": "'Golden girl' Manu Bhaker eyes hitting bullseye at Los Angeles OlympicsManu Bhaker has claimed that her aim at the Los Angeles Olympics would be to ensure that she would change the colour of her medal from bronze to gold. Manu was one of the stars for India in the Paris Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-icc-delegation-to-review-security-arrangements-in-pakistan-2601786-2024-09-18",
      "headline": "Champions Trophy: ICC delegation to review security arrangements in PakistanA five-member ICC delegation visited Pakistan to inspect venues for the 2024 Champions Trophy. Discussions included the tentative schedule and the possibility of the Indian team playing in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-stuttgart-endrick-goal-carlo-ancelotti-2601773-2024-09-18",
      "headline": "Endrick has the gift that strikers dreams of: Real Madrid boss Carlo AncelottiReal Madrid boss Carlo Ancelotti was in awe of Endrick after the Brazilian forward's incredible goal against Stuttgart in the Champions League on September 17, Tuesday. Endrick's goal helped Los Blancos seal a win on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-virat-kohli-gautam-gambhir-interview-chennai-2601764-2024-09-18",
      "headline": "You've had more altercations, Gambhir tells Virat Kohli in special interviewGautam Gambhir and Virat Kohli showed their light-hearted side as the Indian coach had a cheeky response to the star batter's question about how he managed his on-field chatter with the opposition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-masala-interview-india-vs-bangladesh-test-series-2601751-2024-09-18",
      "headline": "Watch: Kohli interviews Gambhir, puts end to 'masala' in crackling chatWatch: Star batter Virat Kohli and head coach Gautam Gambhir sat down for an engaging interview, putting an end to years of rumors about the reported tension between the two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-zampa-accepts-slim-ashes-hopes-as-milestone-100th-odi-nears-2601737-2024-09-18",
      "headline": "Adam Zampa accepts slim Ashes hopes as milestone 100th ODI nearsEngland vs Australia: Star leg-spinner Adam Zampa acknowledged that he might never play in an Ashes Test match as he prepares for his milestone 100th one-day international (ODI).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-players-will-enjoy-coach-gautam-gambhirs-aggression-dinesh-karthik-2601734-2024-09-18",
      "headline": "Indian players will enjoy coach Gambhir's aggression: Dinesh KarthikFormer India wicketkeeper-batter Dinesh Karthik on Tuesday said head coach Gautam Gambhir's display of aggression in the past has generally come out in \"protection of his players\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saqib-mahmood-added-to-england-squad-for-odi-series-vs-australia-2601728-2024-09-18",
      "headline": "Saqib Mahmood added to England squad for ODI series vs AustraliaEngland vs Australia: The England and Wales Cricket Board (ECB) added right-arm pacer Saqib Mahmood to their squad for the five-match ODI series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-manchester-united-beat-3rd-division-barnsley-7-0-2601718-2024-09-18",
      "headline": "Manchester United rout 3rd-division Barnsley 7-0 to progress ahead Manchester United delivered an outstanding performance at Old Trafford, defeating Barnsley 7-0 in the Carabao Cup third round. Key players Rashford, Garnacho, and Eriksen shone as United secured their biggest victory under Erik ten Hag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-masala-interview-india-vs-bangladesh-test-series-2601751-2024-09-18",
      "headline": "Watch: Kohli interviews Gambhir, puts end to 'masala' in crackling chatWatch: Star batter Virat Kohli and head coach Gautam Gambhir sat down for an engaging interview, putting an end to years of rumors about the reported tension between the two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-zampa-accepts-slim-ashes-hopes-as-milestone-100th-odi-nears-2601737-2024-09-18",
      "headline": "Adam Zampa accepts slim Ashes hopes as milestone 100th ODI nearsEngland vs Australia: Star leg-spinner Adam Zampa acknowledged that he might never play in an Ashes Test match as he prepares for his milestone 100th one-day international (ODI).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-players-will-enjoy-coach-gautam-gambhirs-aggression-dinesh-karthik-2601734-2024-09-18",
      "headline": "Indian players will enjoy coach Gambhir's aggression: Dinesh KarthikFormer India wicketkeeper-batter Dinesh Karthik on Tuesday said head coach Gautam Gambhir's display of aggression in the past has generally come out in \"protection of his players\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saqib-mahmood-added-to-england-squad-for-odi-series-vs-australia-2601728-2024-09-18",
      "headline": "Saqib Mahmood added to England squad for ODI series vs AustraliaEngland vs Australia: The England and Wales Cricket Board (ECB) added right-arm pacer Saqib Mahmood to their squad for the five-match ODI series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-manchester-united-beat-3rd-division-barnsley-7-0-2601718-2024-09-18",
      "headline": "Manchester United rout 3rd-division Barnsley 7-0 to progress ahead Manchester United delivered an outstanding performance at Old Trafford, defeating Barnsley 7-0 in the Carabao Cup third round. Key players Rashford, Garnacho, and Eriksen shone as United secured their biggest victory under Erik ten Hag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-wrap-bayern-score-9-zagreb-liverpool-madrid-juventus-win-new-era-2601704-2024-09-18",
      "headline": "Bayern hit nine past Zagreb, Mbappe-led Madrid win as new era kicks offBayern Munich completed a 9-2 demolition of visitors Dinamo Zagreb on Tuesday and a record for the most goals by one team in a Champions League match after a scintillating performance. Real Madrid, Liverpool, and Juventus also won their group matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-rapport-rohit-sharma-gautam-gambhir-sanjay-manjrekar-2601697-2024-09-18",
      "headline": "Team combinations will reveal rapport between Rohit and Gambhir: Sanjay ManjrekarIndia vs Bangladesh: Former India cricketer Sanjay Manjrekar believes Indian team combinations for the first Test will reveal the rapport between India captain Rohit Sharma and head coach Gautam Gambhir. Manjrekar said that Rohit and Rahul Dravid clicked instantly and he is eager to see if the same happens with Rohit and Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-to-expect-from-bumrahs-return-on-spin-friendly-chepauk-vs-bangladesh-2601538-2024-09-18",
      "headline": "What to expect from Bumrah's return on 'spin-friendly' Chepauk vs BangladeshJasprit Bumrah will return to whites for India in the 2-match Test series against Bangladesh. Let us try and understand if Bumrah was needed for the series or not, knowing his big role coming up in the Test matches against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-suresh-raina-warns-india-to-not-take-bangladesh-lightly-2601649-2024-09-17",
      "headline": "IND vs BAN: Suresh Raina warns India not to take Bangladesh lightlyFormer India cricketer Suresh Raina has asked India not to take Bangladesh lightly in their 2-match Test series. Speaking to PTI, Raina reminded that Bangladesh just cleansweeped Pakistan in their recent Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nahid-rana-bangladesh-andre-adams-india-tests-2601646-2024-09-17",
      "headline": "Nahid Rana is always trying to get better: Andre AdamsIND vs BAN: Fast bowler Nahid Rana has impressed Bangladesh bowling coach Andre Adams with his ability to generate pace and hunger to get better. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-south-africa-temba-bavuma-aiden-markram-odi-series-2601635-2024-09-17",
      "headline": "Temba Bavuma ruled out of 1st ODI, Aiden Markram to stand in AFG vs SA: Aiden Markram will lead South Africa in the first ODI against Afghanistan after Temba Bavuma was ruled out due to illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramesh-mendis-sri-lanka-playing-xi-galle-test-2601598-2024-09-17",
      "headline": "Ramesh Mendis returns as Sri Lanka name playing XI for opening TestSL vs NZ: Sri Lanka named their playing XI for their opening Test against New Zealand to be held from September 18 at the Galle Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-refused-to-play-for-country-in-davis-cup-aita-slams-india-star-2601592-2024-09-17",
      "headline": "Sumit Nagal refused to play for country in Davis Cup: AITA Davis Cup: AITA said that Sumit Nagal might have intentionally pulled out of the tournament. India lost to Sweden 4-0 in the World Group 1 tie earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nahid-rana-bangladesh-andre-adams-india-tests-2601646-2024-09-17",
      "headline": "Nahid Rana is always trying to get better: Andre AdamsIND vs BAN: Fast bowler Nahid Rana has impressed Bangladesh bowling coach Andre Adams with his ability to generate pace and hunger to get better. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-south-africa-temba-bavuma-aiden-markram-odi-series-2601635-2024-09-17",
      "headline": "Temba Bavuma ruled out of 1st ODI, Aiden Markram to stand in AFG vs SA: Aiden Markram will lead South Africa in the first ODI against Afghanistan after Temba Bavuma was ruled out due to illness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramesh-mendis-sri-lanka-playing-xi-galle-test-2601598-2024-09-17",
      "headline": "Ramesh Mendis returns as Sri Lanka name playing XI for opening TestSL vs NZ: Sri Lanka named their playing XI for their opening Test against New Zealand to be held from September 18 at the Galle Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-refused-to-play-for-country-in-davis-cup-aita-slams-india-star-2601592-2024-09-17",
      "headline": "Sumit Nagal refused to play for country in Davis Cup: AITA Davis Cup: AITA said that Sumit Nagal might have intentionally pulled out of the tournament. India lost to Sweden 4-0 in the World Group 1 tie earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/hope-it-does-not-rain-in-the-1st-test-between-india-and-bangladesh-raina-2601545-2024-09-17",
      "headline": "Hope it does not rain in the 1st Test between India and Bangladesh: RainaFormer India cricketer Suresh Raina has hoped that it does not rain in the first Test match between India and Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-nz-tim-southee-banking-on-rangana-hearths-inputs-for-galle-test-2601540-2024-09-17",
      "headline": "SL vs NZ: Tim Southee banking on Rangana Hearth's inputs for Galle TestNew Zealand Test captain Tim Southee said that they are backing on Rangana Hearth's inputs for their Test series against Sri Lanka. Herath, NZ's spin bowling coach is Sri Lanka's second-best spinner behind Muttiah Muralitharan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/craig-fulton-credits-china-good-fight-india-win-asian-champions-trophy-2601524-2024-09-17",
      "headline": "Craig Fulton credits China for 'good fight' after India win title Asian Champions Trophy: Coach Craig Fulton was happy after India won the title, but also admitted that China made it tough for them in the final on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-president-urges-commonwealth-games-to-not-drop-wrestling-in-2026-2601511-2024-09-17",
      "headline": "WFI president urges Commonwealth Games to not drop wrestling in 2026The WFI president Sanjay Singh has urged the Commonwealth Games to not drop wrestling as a sport from the next edition of the competition. Scotland is set to host the next CWG after Australia backed out as hosts.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}