{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-extends-duty-free-cotton-imports-to-shield-textile-sector-from-us-tariffs-2778283-2025-08-28",
      "headline": "India extends duty-free cotton imports to shield textile sector from US tariffsFor mills, the duty-free extension offers much-needed relief. The earlier exemption, ending in September, was too short to allow large imports, as shipments from exporting nations often take more than a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-how-to-improve-grievance-loan-approval-emis-personal-finance-2778278-2025-08-28",
      "headline": "CIBIL Decoded: How delayed credit score updates can hit your loans and ratesA delay of even a few weeks in updating information with the credit bureau can decide whether a person gets a loan, how much interest they pay, or if they are denied altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/more-taxes-coming-from-people-than-companies-finds-report-2778219-2025-08-28",
      "headline": "More taxes coming from people than companies, finds reportFor the first time, personal income tax collections in India have overtaken corporate tax, signalling a major shift in the country's tax landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-0-tax-slabs-reduction-state-revenue-loss-decoded-2778191-2025-08-28",
      "headline": "GST 2.0: Which states will take the biggest hit if taxes drop?GST 2.0 promises lower taxes and cheaper goods, but the real challenge looms for revenue-dependent states. The question is, who absorbs the shortfall when the proposals come into effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-closes-706-points-lower-nifty-below-24600-hcltech-down-3-percent-2778184-2025-08-28",
      "headline": "Sensex closes 706 points lower; Nifty below 24,600; HCLTech down 3%The S&P BSE Sensex was down by 706 points to close at 80,080.57, while the NSE Nifty50 lost 211.15 points to end at 24,500.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dont-miss-this-step-after-filing-itr-here-what-to-do-2778053-2025-08-28",
      "headline": "Don't miss this step after filing ITR: Here's what to doSimply filing your ITR is not enough. You must verify it within 30 days, else, missing this important step could mean delays, penalties, and even your return being declared invalid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-textile-fertiliser-us-tariff-rate-rationalisation-low-cost-tax-free-nil-slab-festive-season-2778026-2025-08-28",
      "headline": "GST 2.0 boost for textile, fertiliser sectors as Trump's 50% tariff kicks inThe textile and fertiliser industries are expected to be among the biggest beneficiaries of the upcoming GST 2.0 rationalisation amid US President Donald Trump's 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dividend-mismatch-with-ais-here-is-how-taxpayers-should-report-it-2778019-2025-08-28",
      "headline": "Dividend mismatch with AIS? Here's how taxpayers should report itFiling ITR often becomes confusing when dividend income in your personal records doesn't match what appears in AIS. Here's how to handle it while filing ITR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-tax-cuts-updates-milk-chocolates-textiles-fertilizers-2778009-2025-08-28",
      "headline": "Cheaper milk, chocolates, clothes and more: How GST 2.0 could slash your billsThe proposed changes, to be discussed at the Council's meeting on September 3–4 in New Delhi, focus on widening the nil rate, scrapping the 12% slab, and reducing rates on selected 18% goods."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sidharth-malhotra-fatherhood-diaper-duties-great-indian-kapil-show-param-sundari-janhvi-kapoor-2778265-2025-08-28",
      "headline": "Sidharth Malhotra shares fatherhood tales on The Great Indian Kapil ShowSidharth Malhotra appeared on The Great Indian Kapil Show to promote his film Param Sundari. He shared heartfelt stories about his new role as a father, bringing warmth and laughter to the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-engagement-post-travis-kelce-becomes-most-reposted-instagram-2778121-2025-08-28",
      "headline": "Taylor Swift's engagement post with Kelce becomes most reposted on InstagramPop star Taylor Swift and athlete Travis Kelce's engagement post amassed over 1 million reposts in just six hours. While in the first hour alone, it received 14 million likes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-ashnoor-kaur-fears-abuse-ready-show-real-self-set-rules-2778242-2025-08-28",
      "headline": "Exclusive: Ashnoor Kaur fears abuse but ready for Bigg Boss 19 challengesAshnoor Kaur steps into Bigg Boss 19 with excitement and apprehension about the show's controversies. She aims to reveal her true self while advocating for respect and boundaries inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kingdom-ott-release-vijay-deverakonda-fans-disapointed-over-deleted-romantic-song-2778128-2025-08-28",
      "headline": "Kingdom OTT release: Vijay Deverakonda fans disappointed over deleted romantic songActor Vijay Deverakonda's 'Kingdom' recently disappointed fans after its OTT release as the the popular song 'Hridayam Laopala' and key fight scenes were edited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-shares-wife-akanksha-chamola-doesnt-want-kids-2778183-2025-08-28",
      "headline": "Gaurav Khanna shares wife Akanksha Chamola doesn't want kids: I have to stand by itBigg Boss 19 contestant Gaurav Khanna shared that while he wants to become a father, his wife Akanksha Chamola does not wish to have kids. Although he respected Akanksha's decision, he hasn't ruled out parenthood in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bon-appetit-your-majesty-review-yoona-lee-chae-min-royal-kitchen-comedy-netflix-2778224-2025-08-28",
      "headline": "Bon Appetit review: YoonA, Lee Chae-min's Kdrama is messy but flavourfulRelease Date:Sun Aug 24, 2025Bon Appetit, Your Majesty series review: Netflix's 'Bon Appetit, Your Majesty' follows a French chef transported to the Joseon dynasty. The show blends cooking, comedy, and time-travel but struggles with effects and pacing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mohanlal-hridayapoorvam-heartfelt-drama-grief-second-chances-2778187-2025-08-28",
      "headline": "Hridayapoorvam review: Mohanlal film is heartfelt take on grief and second chancesRelease Date:Thu Aug 28, 2025Hridayapoorvam movie review: Director Sathyan Anthikad's 'Hridayapoorvam' starring Mohanlal, Malavika Mohanan and Sangeeth Prathap, tells a touching story of loss and renewal. The film combines humour and emotion to explore family bonds and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-says-dancing-with-shahid-kapoor-kunal-kemmu-was-stressful-for-her-2778182-2025-08-28",
      "headline": "Exclusive: Soha Ali Khan says dancing with Shahid, Kunal was stressful for herActor Soha Ali Khan, in an exclusive interview with India Today, spoke about the struggles of grooving to 'Gustakh Dil' alongside Shahid Kapoor. She is currently waiting for her podcast, 'All About Her,' to launch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-seeks-canada-visa-help-gandhi-premiere-toronto-film-festival-pratik-gandhi-2778201-2025-08-28",
      "headline": "Hansal Mehta seeks help for Canadian visa for Gandhi premiere in TorontoDirector Hansal Mehta shared a post on X and expressed his ordeal of not getting a Canada visa before his upcoming series 'Gandhi' premiere at the Toronto International Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-summoned-court-controverdial-song-newborns-2778173-2025-08-28",
      "headline": "Court summons Guru Randhawa over controversial song about newbornsSinger Guru Randhawa has been summoned by the Samrala court for controversial lyrics referencing opium given to newborns. The summons on September 2 raises questions about artistic freedom and cultural sensitivities in music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-aamir-khan-kajol-twinkle-khanna-chat-show-two-much-launch-exclusive-2778176-2025-08-28",
      "headline": "Salman and Aamir to open Kajol and Twinkle Khanna's chat show Two MuchSalman Khan and Aamir Khan will kick off the new chat show 'Two Much' hosted by Kajol and Twinkle Khanna. The show promises candid celebrity conversations filled with humour and surprises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-opens-up-on-offering-nishaanchi-to-late-sushant-singh-rajput-actor-stopped-responding-after-signing-big-dharma-films-2778140-2025-08-28",
      "headline": "Anurag Kashyap says Sushant Singh Rajput was first choice for NishaanchiFilmmaker Anurag Kashyap shares that he had planned to cast Sushant Singh Rajput in his film 'Nishaanchi', but the actor stopped responding after landing two major films with Dharma Productions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/monster-the-ed-gein-story-release-date-out-charlie-hunnam-new-face-of-evil-2778147-2025-08-28",
      "headline": "Monster: The Ed Gein Story release date out, Charlie Hunnam is the new face of evilHere's everything you need to know about the forthcoming third series of 'Monster', which will centre on the life and crimes of Ed Gein. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-clean-shaven-band-baaja-baraat-deepika-padukone-ganpati-darshan-watch-dua-2778139-2025-08-28",
      "headline": "Ranveer Singh goes clean-shaven, joins Deepika Padukone for Ganpati darshan. WatchDeepika Padukone and Ranveer Singh recently participated in Ganpati celebrations hosted by the Ambanis. A video of the couple offering prayers has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-on-rough-marriage-patch-with-husband-parmeet-sethi-2778129-2025-08-28",
      "headline": "Archana Puran Singh on rough marriage patch with Parmeet Sethi: Ego got in the wayArchana Puran Singh shared that her marriage with Parmeet Sethi once went through a rough patch due to ego clashes, but meditation helped them rediscover their love. She shared that despite frequent fights, they cannot live without each other and remain strong partners after over three decades together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/special-ops-2-director-neeraj-pandey-prefers-subtle-patriotism-to-chest-thumping-2778066-2025-08-28",
      "headline": "Special Ops 2 director Neeraj Pandey prefers subtle patriotism to chest thumpingDirector Neeraj Pandey spoke about his subtle approach to patriotism in films and his experience making 'Special Ops'. In an exclusive with India Today, he also highlighted the importance of clarity in storytelling."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-stuck-leh-amid-rains-recalls-similar-ordeal-3-idiots-shoot-2778102-2025-08-28",
      "headline": "R Madhavan stuck in Leh amid rains, recalls similar ordeal during 3 Idiots shootR Madhavan shared a view from his hotel room window, capturing snow-clad mountain peaks under cloudy skies, while also speaking about the weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-do-patti-raanjhan-song-plagiarism-claims-kmkz-t-series-2778083-2025-08-28",
      "headline": "Kriti Sanon's Do Patti song Raanjhan faces plagiarism rowKriti Sanon's song 'Raanjhan' from the film Do Patti, which enjoyed immense popularity, is now embroiled in a plagiarism controversy involving an international music producer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lavanya-tripathi-flaunts-baby-bump-ganesh-chaturthi-varun-tej-2778065-2025-08-28",
      "headline": "Actor Lavanya Tripathi flaunts baby bump at Ganpati celebrations with Varun TejTelugu actors Varun Tej and Lavanya Tripathi, who are soon to be parents shared photos of themselves offering prayers to Lord Ganesha, and fans were quick to respond."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mood-of-the-nation-survey-2025-pm-modi-performance-operation-sindoor-pakistan-trump-tariffs-2778143-2025-08-28",
      "headline": "Op Sindoor, Trump tariffs: A year into Modi 3.0, find out the Mood of the NationIs PM Modi still the unparalleled choice of the nation if elections are held today, or has the opposition gained ground? All these questions and more will be answered this evening as we present the findings of the India Today Group's Mood of the Nation (MOTN) survey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-meet-chinese-president-xi-jinping-on-august-31-on-sidelines-of-sco-summit-in-china-2778082-2025-08-28",
      "headline": "PM Modi set for key huddles with Xi, Putin in China amid Trump tariff rowPrime Minister Narendra Modi will meet Chinese President Xi Jinping and Russian President Vladimir Putin in Tianjin during the SCO summit, his first visit to China in over seven years. The talks come as India faces US President Donald Trump's tariff hikes on key exports amid mounting American pressure to curb purchases of Russian oil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-europe-germany-military-conscription-france-baltic-poland-russia-threat-defence-spending-nato-2778072-2025-08-28",
      "headline": "Trump has spooked Europe, reveals Germany's move on military recruitsFor decades, Europe entrusted the US with its defence, but an unreliable Donald Trump in the White House is making it do a rethink. From Berlin to the Baltics, a new era of military self-reliance is taking shape. Germany is moving towards conscription and France and Poland are ramping up defence budgets, amid Trump's demands and Russian threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-war-trump-delulu-peter-navarro-russian-oil-remark-india-china-tariff-2778228-2025-08-28",
      "headline": "Modi's war is Trump's deluluPeter Navarro, once an economist, now parrots Donald Trump's whims, absurdly blaming India for Russia's war over discounted oil purchases. India's crime isn't war, but survival by securing energy for its millions. And Trump's tariff madness isn't strategy, but delulu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-mother-abused-rahul-gandhi-bihar-rally-bjp-apology-2778056-2025-08-28",
      "headline": "PM Modi, mother abused during Rahul Gandhi's Bihar rally, BJP seeks apologyThe video shows Congress workers using derogatory language against PM Modi from the stage that was set up for the 'Voter Adhikar Yatra'. However, Rahul Gandhi was not present during the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-administration-h1b-student-visa-green-card-new-front-against-india-howard-lutnick-governor-ron-desantis-2778078-2025-08-28",
      "headline": "Is Trump now targeting India's soft exports with H-1B, student visa crackdown?The H-1B visa, which has got the US some of its top engineers and CEOs, is now being branded a \"scam\" by the Trump administration. After the 50% tariffs on Indian products, is President Donald Trump now targeting India's soft exports with a crackdown on H-1B, student visas and Green Cards?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/trump-tariffs-will-india-merely-absorb-its-harshest-trade-shock-or-emerge-stronger-2778272-2025-08-28",
      "headline": "Trump tariffs: Will India merely absorb its harshest trade shock or emerge stronger?As the US doubles down with duties, the Modi government will try to cushion exporters in the immediate while exploring new, long-term markets in an increasingly protectionist world"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/heart-health-india-rising-attacks-early-detection-lifestyle-changes-2778039-2025-08-28",
      "headline": "I am a doctor and here's why I think seemingly fit people collapse in gymsIndia faces a sharp rise in heart attacks among younger adults, with many undiagnosed conditions. Early detection and consistent lifestyle habits are important improving cardiac health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: PV Sindhu showed glimpses of her vintage attacking game as she decimated World No. 2 Wang Zhi Yi of China 21-17, 21-15. Sindhu is a win away from securing her sixth world meet medal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-hindu-population-dropped-15-riots-since-1947-2778218-2025-08-28",
      "headline": "Hindu population dropped to 15%, 15 riots since 1947: Report on Sambhal violenceThe panel report on 2024 Sambhal violence points to a significant demographic shift in the area. At the time of Independence, Hindus made up 45% of the Sambhal municipal area, a share that has now dropped to 15–20%, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-0-tax-slabs-reduction-state-revenue-loss-decoded-2778191-2025-08-28",
      "headline": "GST 2.0: Which states will take the biggest hit if taxes drop?GST 2.0 promises lower taxes and cheaper goods, but the real challenge looms for revenue-dependent states. The question is, who absorbs the shortfall when the proposals come into effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-georgina-rodriguez-big-rocks-rings-jewellery-trend-2778058-2025-08-28",
      "headline": "Big rocks, bigger statements: The rise of supersized engagement ringsJust as everyone was still swooning over Georgina Rodriguez's stunning engagement ring, Taylor Swift treated us to her dreamy proposal photos, giving us yet another supersized ring to admire. Oversized rings have officially become the hottest trend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dubai-princess-sheikha-mahra-engaged-to-rapper-french-montana-instagram-divorce-post-2778101-2025-08-28",
      "headline": "Dubai princess, who divorced husband on Instagram, engaged to rapper French MontanaDubai princess Sheikha Mahra Mohammed Rashed Al Maktoum is engaged to Moroccan-American rapper French Montana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/j-and-k-flash-flood-update-death-toll-reaches-45-chief-minister-omar-abdullah-says-cant-live-in-fear-2778249-2025-08-28",
      "headline": "J&K flash flood toll reaches 45, Omar Abdullah says can't live in fearOn Thursday, authorities sped up rescue efforts as water levels in major rivers like Jhelum and Chenab receded after weather conditions improved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/1-in-4-iit-admissions-linked-to-kota-coaching-iit-kanpur-jee-report-2778241-2025-08-28",
      "headline": "Kota dominates JEE success, half of top-100 IIT rankers trained thereIIT Kanpur's JEE Advanced 2025 report revealed Kota's dominance, with every fourth IIT admission and half of the top-100 rankers coming from the Rajasthan coaching hub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/massive-russian-drone-missile-attack-kyiv-kills-14-injures-stalls-peace-talks-eu-2778178-2025-08-28",
      "headline": "Russian missile strike in Kyiv kills 14; world leaders condemn 'senseless' attackPowerful Russian missile strikes rocked Kyiv, lighting up the sky and leaving behind columns of smoke as an overnight attack damaged and destroyed buildings in several districts of the city. The Russian Defence Ministry said it deployed hypersonic 'Kinzhal' missiles, drones and high-precision air-launched munitions in the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mohanlal-hridayapoorvam-heartfelt-drama-grief-second-chances-2778187-2025-08-28",
      "headline": "Hridayapoorvam review: Mohanlal film is heartfelt take on grief and second chancesRelease Date:Thu Aug 28, 2025Hridayapoorvam movie review: Director Sathyan Anthikad's 'Hridayapoorvam' starring Mohanlal, Malavika Mohanan and Sangeeth Prathap, tells a touching story of loss and renewal. The film combines humour and emotion to explore family bonds and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-cancer-staging-helps-oncologists-personalise-treatment-plans-2778261-2025-08-28",
      "headline": "How cancer staging helps oncologists personalise treatment plansThrough cancer staging, patients and healthcare providers can work together effectively, matching treatment strategies with achievable objectives"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-final-zurich-indian-title-world-championship-showdown-2778067-2025-08-28",
      "headline": "Ever-improving Neeraj eyes Diamond Trophy before World Championship showdownIndia's javelin ace Neeraj Chopra returns to the Diamond League Final in Zurich, chasing a second Diamond Trophy. With Julian Weber and Anderson Peters in the fray, the meet serves as the perfect prelude to next month's World Championships."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-air-force-f35-crash-frozen-hydraulics-water-contamination-alaska-2778120-2025-08-28",
      "headline": "F-35 pilot's 50-minute call with engineers mid-air. Then jet fell out of the skyThe F-35 pilot spent nearly an hour on a conference call with engineers from Lockheed Martin to troubleshoot the issue with the jet. But they were unable to rectify the issue, and the aircraft went into freefall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/argentina-relaxes-visa-rules-welcomes-indian-tourists-holding-valid-us-visas-glbs-2777905-2025-08-28",
      "headline": "Argentina relaxes visa rules, welcomes Indian tourists holding valid US visasArgentina has eased entry for Indian citizens holding valid US visas, allowing visa-free travel and aiming to boost tourism and strengthen bilateral cultural and economic ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/udise-2024-25-report-india-crosses-1-crore-teachers-internet-access-in-schools-rises-2778259-2025-08-28",
      "headline": "Number of teachers crosses 1 crore mark in 2024-25: Education ministryThe Ministry of Education has released UDISE+ 2024-25 and has shown major gains across school education. The report has recorded teacher numbers crossing one crore, improved student-teacher ratios and falling dropouts. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-rajat-patidar-central-zone-century-mohammad-shami-bowling-east-zone-2778284-2025-08-28",
      "headline": "Duleep Trophy: Rajat Patidar hits quickfire ton, Mohammed Shami puts solid shiftRajat Patidar smashed a 96-ball century and Danish Malewar struck an unbeaten 198 to put Central Zone on top against North East Zone in the Duleep Trophy. Mohammed Shami also returned with a wicket for the East Zone against the North Zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: Vintage PV Sindhu storms into quarters after stunning World No. 2 Wang 21-19, 21-15"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-cheteshwar-pujara-test-retirement-kris-srikkanth-bcci-2778234-2025-08-28",
      "headline": "Virat Kohli, Rohit and Pujara deserved better send-offs: Srikkanth slams BCCIFormer India chief selector Kris Srikkanth has voiced his disappointment over the manner in which Virat Kohli, Rohit Sharma, and Cheteshwar Pujara bid farewell to Test cricket. He criticised the BCCI for lapses in communication, saying that the lack of proper coordination overshadowed the send-offs of these stalwarts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-names-abhishek-bumrah-chakravarthy-asia-cup-2778209-2025-08-28",
      "headline": "Asia Cup: Sehwag picks Abhishek, Bumrah and Chakravarthy as India's match-winnersFormer India opener Virendra Sehwag has picked his three game-changers for India in the upcoming Asia Cup 2025. He has picked left-hander Abhishek Sharma, pacer Jasprit Bumrah and mystery spinner Varun Chakaravarthy for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-aakash-chopra-ipl-t20-leagues-2778202-2025-08-28",
      "headline": "Could Ashwin set a trend of Indians skipping IPL for foreign T20s? Aakash Chopra opinesFormer India cricketer Aakash Chopra is of the opinion that Ashwin's IPL retirement decision could pave a new way for other Indian cricketers too. He has said that it is a massive decision from Ashwin's end to let go of a Rs. 9.75 crore contract."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-afghanistan-vs-uae-t20i-tri-series-schedule-squads-streaming-2778185-2025-08-28",
      "headline": "UAE T20I tri-series 2025 Live Streaming: Squads, schedule and all you need to knowThe UAE T20I Tri-Series 2025, featuring Pakistan, Afghanistan, and UAE, runs from August 29 to September 7 in Sharjah, serving as key preparation for the Asia Cup 2025. Teams aim to fine-tune strategies and assess combinations ahead of the continental tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaryavir-sehwag-dpl-debut-aggressive-batting-central-delhi-kings-2778172-2025-08-28",
      "headline": "Watch: Aaryavir Sehwag channels father's flair with boundary blitz in T20 leagueAaryavir Sehwag made a striking debut in the 2025 Delhi Premier League with an aggressive 22-run cameo. The 17-year-old reminded fans of his father's flair with his boundary-hitting blitz."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-bcci-india-broadcasting-backlash-reactions-2778163-2025-08-28",
      "headline": "Outrageous: BCCI draws backlash for not broadcasting Duleep Trophy quarterfinalThe BCCI has faced widespread criticism for not broadcasting the 2025 Duleep Trophy quarterfinals. Fans have expressed frustration over the lack of live coverage, with uncertainty still surrounding the semi-finals and final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/royal-challengers-bangalore-breaks-silence-on-bengaluru-stampede-chinnaswamy-stadium-2778106-2025-08-28",
      "headline": "RCB breaks silence on Bengaluru stampede: We were grievingRoyal Challengers Bangalore (RCB) has ended its silence following the deadly stampede in Bengaluru on the 4th of June. The incident occurred during the team's victory celebrations at Chinnaswamy Stadium. In its first communication on the matter, which came after a period of silence that led to speculation, the franchise issued an emotional appeal to fans. Stating why the organisation had not commented earlier, an official statement said, \"we were grieving.\" RCB also announced a new initiative called 'RCB Cares'. This new program is intended to support people, especially during times of emergency. The team has asked people to wait for more details on the new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dismisses-retirement-rumours-asia-cup-2025-2778138-2025-08-28",
      "headline": "Why do you want me to retire? Shami says fire burning despite selection snubsMohammed Shami has dismissed retirement rumours, reaffirming his commitment to competitive cricket. The 34-year-old fast bowler returned to action for the first time since the IPL 2025, representing East Zone in the Duleep Trophy quarter-final, which began on 28 August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-zimbabwe-vs-sri-lanka-t20is-asia-cup-2778127-2025-08-28",
      "headline": "Wanindu Hasaranga out of Zimbabwe T20Is, Sri Lanka face injury scare before Asia CupSri Lanka's Asia Cup preparations have been hit with Wanindu Hasaranga sidelined due to a hamstring injury, ruling him out of the Zimbabwe T20I series. With key fixtures in Harare from August 29 to September 7, the team will rely on youngsters to fill the all-rounder's void.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaryavir-sehwag-dpl-debut-aggressive-batting-central-delhi-kings-2778172-2025-08-28",
      "headline": "Watch: Aaryavir Sehwag channels father's flair with boundary blitz in T20 leagueAaryavir Sehwag made a striking debut in the 2025 Delhi Premier League with an aggressive 22-run cameo. The 17-year-old reminded fans of his father's flair with his boundary-hitting blitz."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-bcci-india-broadcasting-backlash-reactions-2778163-2025-08-28",
      "headline": "Outrageous: BCCI draws backlash for not broadcasting Duleep Trophy quarterfinalThe BCCI has faced widespread criticism for not broadcasting the 2025 Duleep Trophy quarterfinals. Fans have expressed frustration over the lack of live coverage, with uncertainty still surrounding the semi-finals and final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/royal-challengers-bangalore-breaks-silence-on-bengaluru-stampede-chinnaswamy-stadium-2778106-2025-08-28",
      "headline": "RCB breaks silence on Bengaluru stampede: We were grievingRoyal Challengers Bangalore (RCB) has ended its silence following the deadly stampede in Bengaluru on the 4th of June. The incident occurred during the team's victory celebrations at Chinnaswamy Stadium. In its first communication on the matter, which came after a period of silence that led to speculation, the franchise issued an emotional appeal to fans. Stating why the organisation had not commented earlier, an official statement said, \"we were grieving.\" RCB also announced a new initiative called 'RCB Cares'. This new program is intended to support people, especially during times of emergency. The team has asked people to wait for more details on the new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dismisses-retirement-rumours-asia-cup-2025-2778138-2025-08-28",
      "headline": "Why do you want me to retire? Shami says fire burning despite selection snubsMohammed Shami has dismissed retirement rumours, reaffirming his commitment to competitive cricket. The 34-year-old fast bowler returned to action for the first time since the IPL 2025, representing East Zone in the Duleep Trophy quarter-final, which began on 28 August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-zimbabwe-vs-sri-lanka-t20is-asia-cup-2778127-2025-08-28",
      "headline": "Wanindu Hasaranga out of Zimbabwe T20Is, Sri Lanka face injury scare before Asia CupSri Lanka's Asia Cup preparations have been hit with Wanindu Hasaranga sidelined due to a hamstring injury, ruling him out of the Zimbabwe T20I series. With key fixtures in Harare from August 29 to September 7, the team will rely on youngsters to fill the all-rounder's void.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}