{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to be simpler and clearer, likely to be presented tomorrow When the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-bloodbath-on-dalal-street-us-trade-tariffs-weak-q3-earnings-2678603-2025-02-12",
      "headline": "Sensex tumbles over 850 points as US tariff fears spook Dalal StreetThe S&P BSE Sensex nosedived 834.39 points to 75,459.21 at 10 am, while the NSE Nifty50 fell 251.95  points to trade at 22,819.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-chief-minister-mohan-yadav-rs-1553-crore-for-ladli-behna-yojana-released-check-eligibility-2678366-2025-02-11",
      "headline": "Madhya Pradesh: Rs 1,553 crore for Ladli Behna Yojana released. Check eligibilityLadli Behna Yojana aims to improve women's well-being, health, nutrition and economic independence. Presently, Rs 1,250 per month is given to all the eligible women under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-will-its-implementation-face-delays-time-salary-hike-for-central-government-employee-2678368-2025-02-11",
      "headline": "8th Pay Commission: Will its implementation face delays?Despite several measures announced for taxpayers in the Union Budget 2025, there was no mention of the financial impact of implementing the 8th Pay Commission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-you-eligible-for-fixed-medical-allowance-under-nps-check-details-2678298-2025-02-11",
      "headline": "Are you eligible for fixed medical allowance under NPS? Check details Retired central government civilian employees who are covered under the National Pension System will now be eligible for fixed medical allowance, announced the Department of Pension & Pensioners' Welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reason-behind-stock-market-crash-sensex-ends-1000-points-lower-tariff-threat-weak-rupee-fii-selling-2678293-2025-02-11",
      "headline": "Sensex ends 1,000 points lower: 5 factors behind today's stock market crashInvestors lost nearly Rs 10 lakh crore as selling pressure intensified across sectors due to various factors that dampened investor sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-bears-feast-on-dalal-street-as-stock-markets-decline-for-5th-straight-session-trump-tariff-2678247-2025-02-11",
      "headline": "Sensex falls 1,000 points, investors lose Rs 10 lakh crore on Dalal StreetThe S&P BSE Sensex tanked by 1,1018.20 points to end at 76,293.60, while the NSE Nifty50 fell by 309.80 points to close at 23,071.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-inflation-likely-to-dip-to-a-five-month-low-of-460-percent-in-january-report-2678212-2025-02-11",
      "headline": "India's inflation likely to dip to a 5-month low of 4.60% in January: ReportThe country's consumer inflation is expected to fall to a five-month low of 4.60% in January 2025, as compared to 5.22% which was recorded in December last year, as per Reuters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-keep-ban-on-chinese-investments-for-now-says-chief-economic-adviser-v-anantha-nageswaran-2678213-2025-02-11",
      "headline": "India to keep ban on Chinese investments for now, says Chief Economic AdviserSpeaking at an event in Mumbai on Tuesday, Chief Economic Adviser (CEA) V. Anantha Nageswaran said that any changes to the current restrictions would take time and require a deeper understanding between both countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coimbatore-company-rewards-employees-with-rs-145-crore-bonus-here-is-why-2677783-2025-02-11",
      "headline": "Coimbatore company rewards employees with Rs 14.5 crore bonus. Here's whyA few days ago, the CEO, Saravana Kumar, formally announced the release of the bonus. He shared that he deliberately did not choose to offer employee stock options (ESOPS) or performance-based incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hotmail-co-founder-sabeer-bhatia-critisises-aadhaar-and-upi-in-a-podcast-2678145-2025-02-11",
      "headline": "Hotmail co-founder Sabeer Bhatia critisises Aadhaar and UPI in a podcast Sabeer Bhatia mentioned that the use of video and voiceprint technology for the Aadhaar project, which is already embedded in smartphones, could have been a better approach which could have achieved the same results at much lower costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-mumbai-bengaluru-this-indian-city-tops-luxury-home-price-surge-delhi-knight-frank-prime-global-cities-index-q4-2024-2678161-2025-02-11",
      "headline": "Not Mumbai or Bengaluru, this Indian city leads in luxury home price surgeMumbai, traditionally known for its expensive real estate, was placed seventh in the global rankings for luxury home price surge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-key-reasons-behind-bloodbath-dalal-street-2678153-2025-02-11",
      "headline": "Sensex crashes over 1,000 points: What's behind today's stock market bloodbath?Stock market crash: At 1:12 pm, the Sensex was down 1051.88 points to 76,261.90, and the Nifty fell 321.15 points to 23,060.45. Most broader market indices were also in the red as volatility spiked sharply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-expected-soon-table-parliament-heres-what-taxpayers-can-expect-2678132-2025-02-11",
      "headline": "New Income Tax Bill expected soon: Here's what taxpayers can expect The new bill aims to make direct tax laws simpler, reduce litigation, and remove ambiguities in the current system. Experts believe it will be easier to understand, more user-friendly, and free of unnecessary complexities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/infosys-layoffs-fired-trainee-employees-share-ordeal-after-mass-termination-this-is-inhumane-2678097-2025-02-11",
      "headline": "Sacked Infosys trainees share ordeal after mass termination: 'This is inhumane'The sacked trainee employees, who were onboarded after 2.5 years of wait, were called in batches of 50 starting from 9.30 am on February 7. They were escorted to a room guarded by security and bouncers where they were made to sign a mutual separation letter."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-opens-up-on-being-colour-blind-on-celebrity-masterchef-2678744-2025-02-12",
      "headline": "Anupamaa actor Gaurav Khanna opens up on being colour-blind on Celebrity MasterchefTV actor Gaurav Khanna appeared on Celebrity MasterChef where he opened up about being colour-blind. He participated on the show along with Ayesha Jhulka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-named-world-most-handsome-man-hrithik-roshan-brad-pitt-tom-cruise-2678685-2025-02-12",
      "headline": "BTS' V named world's most handsome man. Hrithik Roshan, Brad Pitt also on listBTS singer V aka Kim Taehyung has been named as the world's most handsome man. The list also features Indian actor Hrithik Roshan, Hollywood stars Brad Pitt, Tom Cruise, Bradley Cooper, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/picture-this-trailer-simone-ashley-hero-fiennes-to-headline-new-romantic-comedy-2678670-2025-02-12",
      "headline": "Picture This trailer: Simone Ashley, Hero Fiennes to headline new romantic comedyThe trailer for Simone Ashley and Hero Fiennes Tiffin's film, Picture This, has been unveiled. It will release on Prime Video on March 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-announces-magic-man-2-a-raw-and-vulnerable-chapter-2678617-2025-02-12",
      "headline": "Jackson Wang announces MAGIC MAN 2 – A raw and vulnerable chapterJackson Wang is set to release MAGIC MAN 2, an album that delves into the stages of grief and personal growth. After a year of introspection, he presents a raw and authentic portrayal of his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-pop-girl-group-xg-take-their-the-first-howl-world-tour-to-latin-america-2678589-2025-02-12",
      "headline": "Pop girl group XG take their 'The first HOWL' World Tour to Latin-America  XG, a dynamic hip-hop/R&B-inspired girl group, is set to captivate audiences in Latin America with their inaugural concerts in Brazil and Mexico. As they continue their world tour, XG unveils a groundbreaking project, 'XDM Unidentified Waves,' that redefines their music and solidifies their global appeal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/one-direction-liam-payne-sexuality-struggle-made-girlfriend-maya-abort-child-2678510-2025-02-11",
      "headline": "Singer Liam Payne was struggling with sexuality, coerced ex to abort: ReportA new report reveals late One Direction star Liam Payne struggled with his sexuality and allegedly pressured ex-fiancée Maya Henry to terminate a pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mukesh-khanna-criticises-ranveer-allahbadia-india-got-latent-remark-parents-2678477-2025-02-11",
      "headline": "Mukesh Khanna on Ranveer Allahbadia row: Blacken his faceActor Mukesh Khanna has criticised YouTuber Ranveer Allahbadia for making explicit remarks on Samay Raina's show, calling for strict punishment to deter such behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-india-got-lalent-samay-raina-comedians-who-landed-in-trouble-for-inappropriate-jokes-2678254-2025-02-11",
      "headline": "Munawar Faruqui to Vir Das, comedians who landed in trouble for inappropriate jokesAs podcaster Ranveer Allahbadia faces backlash for his obscene jokes on an episode of India's Got Latent, here's a look at other stand-up comedians who have found themselves in trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-combs-allegedly-drugged-and-raped-a-man-claims-new-lawsuit-2678219-2025-02-11",
      "headline": "Diddy allegedly 'drugged and raped' a man, claims new lawsuitMusic mogul Sean Combs is embroiled in fresh legal trouble as an anonymous plaintiff files a sexual assault lawsuit against him in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-phone-dropped-story-of-jeetendra-kumars-humility-and-unassuming-success-2678203-2025-02-11",
      "headline": "The phone dropped...: Story of Jitendra Kumar's humility and unassuming successActor Jitendra Kumar, popularly known as Jeetu Bhaiya, says the bigger thing is not to decide whether to take a risk in life or not, but to know what is at stake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/arunachal-pradesh-women-panel-condemns-elvish-yadav-racist-remarks-against-chum-darang-2678209-2025-02-11",
      "headline": "Arunachal women panel condemns Elvish Yadav's 'racist' remarks against Chum DarangThe Arunachal Pradesh State Commission for Women has condemned Elvish Yadav's derogatory remarks against Chum Darang and has demanded strict action. The comments have sparked backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-ott-nithya-menen-ravi-mohan-streaming-on-netflix-2678160-2025-02-11",
      "headline": "Kadhalikka Neramillai: Nithya Menen, Ravi Mohan's rom-com now streaming on NetflixKadhalikka Neramillai, the heartfelt romantic film, starring Nithya Menen and Ravi Mohan is streaming on OTT. The Tamil film had its theatrical release on January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suzhal-the-vortex-season-2-to-premiere-on-prime-video-this-month-2678131-2025-02-11",
      "headline": "Suzhal The Vortex Season 2 to premiere on Prime Video this monthA brand-new season of the Tamil Prime Video series, Suzhal: The Vortex, was announced on Tuesday. The show will begin streaming on the OTT platform from this month itself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-to-have-just-6-episodes-fans-disappointed-2678115-2025-02-11",
      "headline": "Squid Game 3 to have 6 episodes. Fans say 'they better be 2 hours long'Fans of Squid Game are eagerly awaiting the third season. However, the revelation of the season having only six episodes has left many fans disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/solo-leveling-season-2-episode-6-sung-jinwo-superior-animation-fight-sequence-2677946-2025-02-11",
      "headline": "Solo Leveling Season 2: Animation peaks as Jinwoo defeats dungeon bossThe latest episode of Solo Leveling peaked with its brilliantly animated fight sequence. In the episode, titled Don't Look Down on My Guys, Sung Jinwoo clashed with Karlgargan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/uorfi-javed-defends-friend-samay-raina-calls-his-arrest-ranveer-allahbadia-indias-got-latent-2678111-2025-02-11",
      "headline": "Uorfi Javed defends friend Samay Raina amid calls for his arrestUorfi Javed slammed people demanding jail time for YouTuber Ranveer Allahbadia and comedian Samay Raina after Allahbadia's obscene joke on India's Got Latent went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-seattle-indias-got-latent-and-ranveer-allahbadia-face-backlash-2678078-2025-02-11",
      "headline": "Samay Raina in Seattle as India's Got Latent and Ranveer Allahbadia face backlashIndian stand-up comedian Samay Raina recently performed in Seattle, as controversies surrounding Ranveer Allahbadia and India's Got Latent stirred social media discussions in India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-asks-forgiveness-for-ranveer-allahbadia-he-did-wrong-but-forgive-him-2678050-2025-02-11",
      "headline": "Rakhi Sawant asks forgiveness for Ranveer AllahbadiaActor Rakhi Sawant shared a message for fans amid the Ranveer Allahbadia controversy. She requested all to 'forgive' the YouTuber for his recent crass jokes on Samay Raina's show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotra-mrs-women-patriarchy-zee5-ott-men-arranged-marriage-nishant-dahiya-kanwaljit-singh-social-media-debate-reddit-2677949-2025-02-11",
      "headline": "Why Sanya Malhotra's Mrs should come with a trigger warningMrs, starring Sanya Malhotra, explores patriarchal society and the struggles of women in arranged marriages. Here's why this movie should come with a trigger warning and must be on your watchlist."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/charlie-puth-begs-kanye-west-stop-sold-swastika-t-shirts-nazi-x-account-2678004-2025-02-11",
      "headline": "Singer Charlie Puth to Kanye West for selling Swastika T-shirts: I beg you to stopSinger Charlie Puth 'begged' Kanye West to stop after he sold Swastika T-shirts on his website. Kanye's move sparked concern about his 'incredibly dangerous' claims. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/people-not-willing-to-work-because-of-freebies-supreme-court-2678742-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court criticises freebies culture during polls: People not willing to workThe observations came from a bench of Justices B R Gavai and Augustine George Masih which was hearing a matter concerning the right to shelter of homeless persons in urban areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/former-congress-mp-sajjan-kumar-convicted-mob-burnt-2-sikhs-alive-1984-riots-case-rouse-avenue-court-saraswati-vihar-november-2678754-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-MP Sajjan Kumar convicted in 1984 riots case related to murder of 2 SikhsSajjan Kumar was accused of leading a mob and instigating it to kill Jaswant Singh and his son in Saraswati Vihar area in Delhi during the 1984 anti-Sikh riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-eknath-shinde-praise-award-feliciation-uddhav-thackeray-mva-cracks-2678690-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rift in MVA? Sharad Pawar's rare praise for Eknath Shinde draws Uddhav Sena's ireNCP founder Sharad Pawar had a rare praise for Maharashtra Deputy Chief Minister and Shiv Sena chief Eknath Shinde, complimenting his inclusive approach to governance. However, the Shiv Sena (UBT) is said to be upset over Pawar's gesture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-ragging-horror-students-stripped-dumbbells-hung-from-genitals-five-arrested-2678701-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala ragging horror: Beaten for months, dumbbells hung from private partsFive third-year students of a nursing college in Kottayam, Kerala, were arrested after a formal police complaint was filed against them, detailing a series of violent acts of ragging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/jail-for-a-joke-why-ranveer-allahbadia-and-his-remark-are-best-left-with-sip-of-beer-2678403-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jail for a joke? Why Ranveer Allahbadia and his remark are best left with sip of beerPodcaster Ranveer Allahbadia and comedian Samay Raina are facing backlash for a joke on India's Got Latent. While outrage is fine, should there be legal ramifications of their 'joke'?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-today-ahmedabad-odi-virat-kohli-rohit-sharma-2678689-2025-02-12?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "3rd ODI LIVE: Virat Kohli, Shubman Gill take India past 50 India (IND) vs England (ENG), 3rd ODI Live updates from Ahmedabad: Virat Kohli and Shubman Gill have added 50-plus for the second wicket. Both the batters are looking set, but England have not allowed India to run away with it. It's an interesting phase as spin will come into the attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-emmanuel-macron-france-visit-ai-summit-paris-bilateral-talks-meeting-2678109-2025-02-11?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "PM, Macron honour Indian soldiers killed in World War at Marseille cemeteryPM Modi In France Live Updates: Today is the third day of Prime Minister Narendra Modi's visit to France. He arrived in Marseille, in southern France, and paid homage to freedom fighter VD Savarkar, who attempted an escape from a British ship there. The Prime Minister also interacted with members of the Indian community. Later, he visited the Mazargues War Cemetery to honour the sacrifice of Indian soldiers who died fighting in the World Wars.  The PM will be inaugurating a new Consulate General of India in Marseille Stay tuned to IndiaToday.in for the latest updates on PM Modi's visit to France."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/mumtaz-hotel-tirumala-hindu-seers-up-in-arms-controversy-tirupati-devasthanam-owner-news-protest-2678677-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is Mumtaz Hotel that Tirumala seers are up in arms against Seers of Tirumala Tirupati have gone on hunger strike to protest against the Mumtaz Hotel project near the sacred seven hills. They say it will violate the sanctity of the shrine. This is more about the 5-star hotel project and why it has kicked up a storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-sexist-comment-scared-ram-charan-might-have-another-girl-controversy-2678600-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Scared Ram Charan may have a girl again: Chiranjeevi slammed for sexist remarksActor Chiranjeevi drew criticism over his 'sexist' remark about wanting a grandson to continue his family's legacy. The South megastar said he is scared his son Ram Charan might have a daughter again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/vir-das-discusses-good-comedy-vs-good-journalism-amid-ranveer-allahbadia-row-2678626-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vir Das discusses good comedy vs good journalism amid Ranveer Allahbadia rowComedian Vir Das criticised Indian newsrooms and asked people to encourage the new media amid the backlash that podcaster Ranveer Allahbadia and comedian Samay Raina are facing for a 'joke' on India's Got Latent. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/sheikh-hasina-government-bangladesh-protests-united-nations-crimes-against-humanity-possible-2678727-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sheikh Hasina regime behind possible 'crimes against humanity' during protests: UNThe United Nations report, which is based on an inquiry into the unrest in Bangladesh last year, estimated that around 1,400 protesters were killed, while thousands were injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/volodymyr-zelenskyy-ukraine-swap-territory-russia-conflict-vladimir-putin-donald-trump-us-peace-negotiations-2678614-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zelenskyy says Ukraine ready to swap territory with Russia but on one conditionUkraine's President Volodymyr Zelenskyy said his country is ready to give Ukrainian-held Kursk in exchange for the Russian-occupied territories in Ukraine if US President Donald Trump is able to strike a deal to end the nearly three-year conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-son-x-delights-trump-with-his-cute-antics-at-oval-office-video-pics-2678730-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Elon Musk's son X delights Trump with his cute antics at Oval OfficeThe White House has shared a video wherein little X was seen standing beside US President Donald Trump's Resolute Desk as Elon Musk fixed his son's coat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2017-modi-trump-friends-with-benefits-2678297-2025-02-11?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From the India Today archives (2017) | Modi-Trump: Friends with benefits?With PM Narendra Modi and US president Donald Trump set to meet, it's time to re-evaluate their 'jhappi' in 2017 and the diplomatic give-and-take that happened\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fir-against-ranveer-allahbadia-samay-raina-28-others-what-are-the-charges-2678757-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "FIR against Ranveer Allahbadia, Samay Raina, 28 others: What are the charges?The Maharashtra cyber department registered an FIR against all guests on the reality show India's Got Latent, which is facing criticism over crude comments made by influencer Ranveer Allahbadia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/salman-rushdie-veteran-author-recalls-stabbing-at-trial-case-attacker-eye-injuries-2678748-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Rushdie recalls 2022 stabbing at trial: Occurred to me I was dyingWriter Salman Rushdie recalled the horrific moments when he was stabbed brutally by an attacker in August 2022, saying he thought he would die. He said the assault left him less energetic and not as strong as he used to be earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bjp-end-delhi-split-voting-trend-2025-polls-aap-arvind-kejriwal-opinion-2678323-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How did BJP end Delhi's split-voting trend in the 2025 polls?After 10 years, Delhi has voted out the AAP as voters backed the BJP's double-engine government narrative. Here's how a decade of split-voting came to an end. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-to-come-home-earlier-than-expected-nasa-reveals-dates-2678726-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams to come home earlier than expected, Nasa reveals datesThe return of two astronauts, Butch Wilmore and Suni Williams, who flew to the International Space Station on Boeing's faulty Starliner capsule last summer, has hinged on the arrival of the Crew-10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-indian-couples-are-hiring-wedding-social-media-managers-band-baaja-instagram-viral-brides-chaudhary-dance-couple-2678339-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Indian couples are hiring wedding social media managersIndia is witnessing a rising trend of hiring social media managers, the digital ninjas who not only help couples go viral but also capture precious moments that might otherwise be missed, and then turn it all into a stunning digital wedding diary and engaging social media content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/facebook-ceo-mark-zuckerberg-claim-almost-sentenced-to-death-in-pakistan-blasphemy-content-2678706-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mark Zuckerberg claims he was 'almost sentenced to death' in Pak over blasphemyMark Zuckerberg made the claim during a recent interview with podcaster Joe Rogan while discussing challenges to social media platforms posed by different frameworks across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-mumbai-police-terror-threat-call-attack-aircraft-ahead-of-united-states-trip-man-detained-chembur-2678652-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai cops get terror threat to PM's plane before US trip, man detained: ReportThe Mumbai Police arrested the person behind the threat call, and it was found that the suspect was mentally ill, news agency ANI quoted Mumbai Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/eat-found-in-hyderabad-temple-bjp-rejects-polices-an-animal-brought-it-theory-2678716-2025-02-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meat found in Hyderabad temple triggers outrage, BJP questions police probeMeat found inside a temple in Hyderabad sparked outrage among devotees. While the police suspected an animal could have brought it, BJP MLA Raja Singh dismissed the explanation and demanded action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/jail-for-a-joke-why-ranveer-allahbadia-and-his-remark-are-best-left-with-sip-of-beer-2678403-2025-02-12",
      "headline": "Jail for a joke? Why Ranveer Allahbadia and his remark are best left with sip of beerPodcaster Ranveer Allahbadia and comedian Samay Raina are facing backlash for a joke on India's Got Latent. While outrage is fine, should there be legal ramifications of their 'joke'?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-on-career-choices-chasing-characters-not-solo-lead-roles-2678747-2025-02-12",
      "headline": "Chasing characters, not solo lead roles: Yami Gautam on career choicesActor Yami Gautam, in an interview with India Today Digital, talked about making interesting career choices and meeting directors who were ready to do 'anti-casting'. She also commented on the role of her PR and how she looks at her career now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-opens-up-on-being-colour-blind-on-celebrity-masterchef-2678744-2025-02-12",
      "headline": "Anupamaa actor Gaurav Khanna opens up on being colour-blind on Celebrity MasterchefTV actor Gaurav Khanna appeared on Celebrity MasterChef where he opened up about being colour-blind. He participated on the show along with Ayesha Jhulka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-returns-to-mumbai-to-wrap-toxic-final-schedule-2678743-2025-02-12",
      "headline": "Yash returns to Mumbai to wrap Toxic's final scheduleActor Yash is presently in the Maximum City to complete the final leg of Toxic. The Geetu Mohandas directorial will release in both English and Kannada. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-rohit-sharma-failure-mark-wood-ahmedabad-2678749-2025-02-12",
      "headline": "IND vs ENG: Rohit Sharma fails in Ahmedabad ODI after hundred in CuttackRohit Sharma's hopes of carrying his form from the Cuttack ODI was ended by Mark Wood as the England pacer dismissed the Indian captain for just 1 run in Ahmedabad on February 12. Rohit scored a hundred in the second ODI in Cuttack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-rankings-shubman-gill-odi-rohit-sharma-virat-kohli-2678745-2025-02-12",
      "headline": "In-form Shubman Gill closes in on No.1 ODI spot, Virat slips to No.6The latest ICC Rankings saw four India batters make their way into the top 10 in the ODI rankings. India vice-captain Shubman Gill closed in on the No.1 spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-playing-xi-vs-england-3rd-odi-varun-kuldeep-shami-arshdeep-washington-2678725-2025-02-12",
      "headline": "Varun Chakravarthy out with niggle as India rest Shami and Ravindra JadejaIndia vs England: India made three changes to their playing XI for the final ODI of the series against England. India rested Ravindra Jadeja and Mohammed Shami, and were forced to leave out Varun Chakravarthy due to an injury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-ben-duckett-series-loss-remark-kevin-pietersen-2678711-2025-02-12",
      "headline": "Kevin Pietersen slams Ben Duckett for bizarre India series remark: Don't seem to careKevin Pietersen has slammed the bizarre remark made by Ben Duckett after their series loss to India. Duckett claimed that he doesn't care about the series loss as long as England goes on to win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-today-ahmedabad-odi-virat-kohli-rohit-sharma-2678689-2025-02-12",
      "headline": "3rd ODI LIVE: Virat Kohli, Shubman Gill take India past 50 India (IND) vs England (ENG), 3rd ODI Live updates from Ahmedabad: Virat Kohli and Shubman Gill have added 50-plus for the second wicket. Both the batters are looking set, but England have not allowed India to run away with it. It's an interesting phase as spin will come into the attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-marcus-stoinis-odi-retirement-aaron-finch-australia-squad-2678680-2025-02-12",
      "headline": "Marcus Stoinis slammed by Aaron Finch after shock ODI retirement: Maybe a heads up?Aaron Finch has slammed the decision by Marcus Stoinis to announce his shock retirement from ODIs, just days before the Champions Trophy 2025. Stoinis was initially part of the Australia squad for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-royal-challengers-bengaluru-rcb-defend-crown-smriti-mandhana-2677927-2025-02-12",
      "headline": "Are depleted RCB equipped enough to defend crown? WPL 2025: Smriti Mandhana's Royal Challengers Bengaluru (RCB) are the defending champions, but are a tad unsettled due to players pulling out of the competition for various reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-karachi-stadium-chants-emotional-video-2678665-2025-02-12",
      "headline": "Watch: 'Babar, Babar' chants echo at Karachi stadium, leave Pakistan star emotionalFormer captain Babar Azam was met with loud cheers as he spoke during the inaugural ceremony of the newly renovated National Stadium in Karachi. Pakistan will begin their Champions Trophy campaign at this venue on February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-2025-kuldeep-yadav-varun-chakravarthy-india-squad-aakash-chopra-2678637-2025-02-12",
      "headline": "Don't bench Kuldeep for Varun in Champions Trophy: Aakash ChopraAakash Chopra has urged the Indian team management not to drop Kuldeep Yadav for Varun Chakravarthy during the ICC Champions Trophy 2025. Kuldeep has been India's main spinner in the last 2 ICC events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-today-ahmedabad-odi-virat-kohli-rohit-sharma-2678689-2025-02-12",
      "headline": "3rd ODI LIVE: Virat Kohli, Shubman Gill take India past 50 India (IND) vs England (ENG), 3rd ODI Live updates from Ahmedabad: Virat Kohli and Shubman Gill have added 50-plus for the second wicket. Both the batters are looking set, but England have not allowed India to run away with it. It's an interesting phase as spin will come into the attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-marcus-stoinis-odi-retirement-aaron-finch-australia-squad-2678680-2025-02-12",
      "headline": "Marcus Stoinis slammed by Aaron Finch after shock ODI retirement: Maybe a heads up?Aaron Finch has slammed the decision by Marcus Stoinis to announce his shock retirement from ODIs, just days before the Champions Trophy 2025. Stoinis was initially part of the Australia squad for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-royal-challengers-bengaluru-rcb-defend-crown-smriti-mandhana-2677927-2025-02-12",
      "headline": "Are depleted RCB equipped enough to defend crown? WPL 2025: Smriti Mandhana's Royal Challengers Bengaluru (RCB) are the defending champions, but are a tad unsettled due to players pulling out of the competition for various reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-babar-azam-karachi-stadium-chants-emotional-video-2678665-2025-02-12",
      "headline": "Watch: 'Babar, Babar' chants echo at Karachi stadium, leave Pakistan star emotionalFormer captain Babar Azam was met with loud cheers as he spoke during the inaugural ceremony of the newly renovated National Stadium in Karachi. Pakistan will begin their Champions Trophy campaign at this venue on February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-2025-kuldeep-yadav-varun-chakravarthy-india-squad-aakash-chopra-2678637-2025-02-12",
      "headline": "Don't bench Kuldeep for Varun in Champions Trophy: Aakash ChopraAakash Chopra has urged the Indian team management not to drop Kuldeep Yadav for Varun Chakravarthy during the ICC Champions Trophy 2025. Kuldeep has been India's main spinner in the last 2 ICC events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-kuhnemann-illegal-bowling-action-report-australia-sri-lanka-tests-2678621-2025-02-12",
      "headline": "Australian spinner reported for suspected illegal bowling action Australia's left-arm spinner Matthew Kuhnemann was reported for suspected illegal bowling action after his series-winning performance in Sri Lanka. If found illegal, Kuhnemann will be banned from bowling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-2025-allah-ghazanfar-injury-afghanistan-squad-nangyal-kharoti-2678610-2025-02-12",
      "headline": "Afghanistan's Allah Ghazanfar set to miss Champions Trophy 2025 and IPL due to injuryAfghanistan suffered a big blow ahead of the Champions Trophy 2025 as the young spinner was ruled out of the tournament due to an injury. Ghazanfar will miss the IPL 2025 season due to the injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-squad-analysis-jasprit-bumrah-injury-varun-chakravarthy-harshit-rana-selection-2678605-2025-02-12",
      "headline": "Champions Trophy squad analysis: Smart Bumrah call, baffling spin obsessionA smart decision and quite a few baffling calls contribute to the story of India's team selection for Champions Trophy 2025. Five of their 15 players are spinners while a young Yashasvi Jaiswal was left out after a failed experiment in the ongoing ODI series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-manchester-city-boss-guardiola-struggles-to-explain-late-collapse-vs-real-madrid-2678586-2025-02-12",
      "headline": "Manchester City boss Guardiola struggles to explain late collapse vs Real MadridManchester City boss Pep Guardiola struggled to find words to explain his side's late collapse against Real Madrid in the Round Of 16 qualifier of the UEFA Champions League on February 11. City let a 2-1 lead slip to lose the match 2-3 and hand the advantage to Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-fitness-nca-ajit-agarkar-bcci-selection-committee-2678574-2025-02-12",
      "headline": "Jasprit Bumrah was 'okay' for Champions Trophy, but selectors didn't want to take riskJasprit Bumrah was reportedly deemed 'okay' by the National Cricket Academy, but the BCCI selection committee decided not to take a risk with the star pacer for the upcoming Champions Trophy. Bumrah was omitted frpm the squad for the tournament on Tuesday, February 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-arshdeep-singh-champions-trophy-predicted-xi-ahmedabad-2678490-2025-02-12",
      "headline": "IND vs ENG, 3rd ODI: Will Arshdeep get a chance before Champions Trophy?IND vs ENG: India might want to have a look at fast bowlers Arshdeep Singh and all-rounder Washington Sundar in the third ODI against England before heading to Dubai for the Champions Trophy. This will be the final chance for India to test their bench strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-preview-champions-trophy-virat-kohli-gautam-gambhir-ahmedabad-2678555-2025-02-12",
      "headline": "IND vs ENG, 3rd ODI: India's final chance to fine-tune side before Champions TrophyIndia will play one last game against England before flying out for the Champions Trophy. With Jasprit Bumrah being ruled out of the upcoming ICC event, the final match of the series is the last opportunity for the Indian team to get their house in order before flying out to Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-manchester-city-boss-guardiola-struggles-to-explain-late-collapse-vs-real-madrid-2678586-2025-02-12",
      "headline": "Manchester City boss Guardiola struggles to explain late collapse vs Real MadridManchester City boss Pep Guardiola struggled to find words to explain his side's late collapse against Real Madrid in the Round Of 16 qualifier of the UEFA Champions League on February 11. City let a 2-1 lead slip to lose the match 2-3 and hand the advantage to Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jasprit-bumrah-fitness-nca-ajit-agarkar-bcci-selection-committee-2678574-2025-02-12",
      "headline": "Jasprit Bumrah was 'okay' for Champions Trophy, but selectors didn't want to take riskJasprit Bumrah was reportedly deemed 'okay' by the National Cricket Academy, but the BCCI selection committee decided not to take a risk with the star pacer for the upcoming Champions Trophy. Bumrah was omitted frpm the squad for the tournament on Tuesday, February 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-arshdeep-singh-champions-trophy-predicted-xi-ahmedabad-2678490-2025-02-12",
      "headline": "IND vs ENG, 3rd ODI: Will Arshdeep get a chance before Champions Trophy?IND vs ENG: India might want to have a look at fast bowlers Arshdeep Singh and all-rounder Washington Sundar in the third ODI against England before heading to Dubai for the Champions Trophy. This will be the final chance for India to test their bench strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-odi-preview-champions-trophy-virat-kohli-gautam-gambhir-ahmedabad-2678555-2025-02-12",
      "headline": "IND vs ENG, 3rd ODI: India's final chance to fine-tune side before Champions TrophyIndia will play one last game against England before flying out for the Champions Trophy. With Jasprit Bumrah being ruled out of the upcoming ICC event, the final match of the series is the last opportunity for the Indian team to get their house in order before flying out to Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-mohammed-siraj-india-champions-trophy-squad-gautam-gambhir-slammed-2678519-2025-02-12",
      "headline": "No place for Siraj? Gambhir slammed for big call in Champions Trophy squadIndian cricket fans were seen going after head coach Gautam Gambhir-led team management for not selecting Mohammed Siraj in the final squad for ICC Champions Trophy 2025. Siraj was named as a non-travelling reserve for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-mitchell-starc-withdraws-steve-smith-captain-australia-champions-trophy-squad-2678541-2025-02-12",
      "headline": "Champions Trophy 2025: Mitchell Starc pulls out, Steve Smith to lead AustraliaMitchell Starc has decided to withdraw from the Champions Trophy 2025 as Australia announced their squad for the event on Wednesday, February 12. Steve Smith will be leading the Aussies in the event as they will miss their big 3 pacers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-yashasvi-jaiswal-india-squad-reactions-fans-2678512-2025-02-12",
      "headline": "Fans question Yashasvi Jaiswal's omission from India squad Champions Trophy: Fans weren't happy after Yashasvi Jaiswal was left out of the Indian squad after being given a chance in only a solitary ODI against England at the VCA Stadium in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-in-champions-trophy-2025-squad-yashasvi-siraj-and-dube-in-reserves-2678502-2025-02-11",
      "headline": "Varun Chakravarthy in Champions Trophy squad, Yashasvi, Siraj and Dube in reservesIndia wrist spinner Varun Chakravarthy has been selected in India's final squad for the ICC Champions Trophy 2025, replacing Yashasvi Jaiswal, who has been moved to reserves."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}