{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Big GST relief likely as government considers rate cut on common goods: SourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/business/personal-finance/story/19700101-wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-allows-cab-aggregators-to-double-peak-hour-fares-under-new-guidelines-2749292-2025-07-02",
      "headline": "Ola, Uber get government okay for surge pricing, can charge double the base fareStates have been advised to implement the updated guidelines within the next three months. The revised fare structure is aimed at giving platforms flexibility during high-demand periods, while maintaining an overall regulatory framework for pricing and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-200-points-higher-nifty-above-25600-infosys-up-2-percent-us-india-trade-deal-it-shares-2749287-2025-07-02",
      "headline": "Sensex, Nifty open higher as IT stocks rally on hopes of US-India trade dealThe S&P BSE Sensex was up 103.13 points to 83,800.42, while the NSE Nifty50 added 21 points to 25,562.80 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financials-listing-share-price-gmp-signals-premium-market-debut-emkay-global-coverage-buy-rating-2749278-2025-07-02",
      "headline": "HDB Financials listing: GMP signals premium on market debut. Check hereThe company's shares will be listed on both the BSE and NSE. HDB Financial Services is a subsidiary of HDFC Bank and its IPO closed on June 27 with nearly 27 times the subscription."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-us-india-trade-deal-trading-setup-nse-bse-2749266-2025-07-02",
      "headline": "Stock market opening: Sensex, Nifty to rally over US-India trade deal?Gift Nifty futures, which are seen as an early indicator for Indian market openings, traded at 25,686.50 points at 8:24 am. This suggests that the Nifty 50 index could open higher than its previous closing level of 25,541.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-july-2-nse-bse-trading-hal-hyundai-maruti-suzuki-ril-rites-v-mart-2749258-2025-07-02",
      "headline": "Stocks to watch on July 2: HAL, Hyundai, Maruti Suzuki, RIL, RITES, V-MartHero MotoCorp reported a year-on-year rise in total sales by 10% to 5.54 lakh units in June, compared to 5.03 lakh units last year. Domestic sales rose by 6.9% to 5.25 lakh units. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-july-usd-24-billion-lg-hdb-reason-bse-nse-trading-upcoming-public-listings-2749017-2025-07-01",
      "headline": "July turns hot for IPOs as firms race to raise $2.4 billionFirms are gearing up to raise around $2.4 billion through initial public offerings (IPOs) in July. If this target is reached, it will mark the strongest IPO month since December 2023, following a solid $2 billion raised in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-blog-digital-india-10-years-linkedin-people-movement-2748806-2025-07-01",
      "headline": "Digital India turns 10, PM Modi says it's become a people's movementIn the blog titled 'A Decade of Digital India', on LinkedIn, PM Modi said the Digital India initiative is no longer just a government programme but a 'people's movement.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-forbes-list-2025-new-york-mumbai-billionaires-top-10-cities-wealth-ultra-rich-mukesh-ambani-2748773-2025-07-01",
      "headline": "New York tops billionaire list. Which Indian city made it to the top 10?Globally, nearly a quarter of the world's 3,028 billionaires live in just 10 cities across six countries. These cities continue to attract wealth due to strong business ecosystems, investor-friendly policies, and thriving industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25500-asian-paints-up-2-percent-2748711-2025-07-01",
      "headline": "Sensex opens flat, Nifty above 25,500; Asian Paints up 2%The S&P BSE Sensex was up 186.04 points to 83,792.50, while the NSE Nifty50 added 56.35 points to 25,573.40 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-70-years-when-start-why-year-history-customer-share-price-imperial-bank-of-calcutta-2748710-2025-07-01",
      "headline": "SBI turns 70: Why bank's blue keyhole has stood the test of timeAfter independence, under the first 5-year plan's push for rural development, the government nationalised the Imperial Bank. On July 1, 1955, the State Bank of India was born under the State Bank of India Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/look-rich-or-be-rich-startup-founder-on-middle-class-dilemma-2748370-2025-06-30",
      "headline": "Look rich or be rich: Startup founder on middle class dilemmaToday, many people in the middle class are busy trying to look rich, rather than actually becoming rich. Costly gadgets, fancy brunches and trendy holidays are often paid for with loans and EMIs, says founder and CEO, Shyam Achuthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8-years-of-gst-top-5-achievements-you-should-know-2748325-2025-06-30",
      "headline": "8 years of GST: Top 5 achievements you should knowSince its launch, GST has strengthened India's revenue and expanded the taxpayer base, with collections reaching a record Rs 22.08 lakh crore in 2024–25, as per PIB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-down-slightly-jio-financial-rises-1-2748161-2025-06-30",
      "headline": "Sensex falls over 100 points, Nifty down slightly; Jio Financial rises 1%The BSE Sensex was trading 56.62 points lower at 84,002.28 around 9:24 am. It had fallen over 100 points right after opening. The NSE Nifty50 also fell and was trading 10.55 points lower at 25,627.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gautam-adani-celebrates-three-birthdays-every-year-2748051-2025-06-29",
      "headline": "Why Gautam Adani celebrates three birthdays every yearBaffling as it may seem, apart from the day he was born, Adani celebrates two other dates. They are dates when he actually snatched life from the jaws of death. These were times when he repeatedly stared down the abyss and emerged unscathed, yet profoundly transformed. Here then is the story of Adani's three birthdays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fx-the-bear-gets-renewed-for-season-5-jeremy-allen-white-2749339-2025-07-02",
      "headline": "The Bear gets renewed for Season 5, fans reactFX has renewed the critically acclaimed series 'The Bear' for a fifth season, following the widespread praise for its fourth season streaming on Hulu. Season 4 premiered on June 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-kapoor-emotional-tearful-at-daughter-shanaya-kapoor-debut-film-aankhon-ki-gustaakhiyan-trailer-launch-watch-viral-video-2749308-2025-07-02",
      "headline": "Sanjay Kapoor fights tears at trailer launch of daughter Shanaya's filmActor Sanjay Kapoor was visibly emotional at the trailer launch of his daughter Shanaya Kapoor's upcoming film 'Aankhon Ki Gustaakhiyan'. The film is set to release on July 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-failing-at-pr-attended-parties-spent-rs-60k-on-designer-clothes-2749295-2025-07-02",
      "headline": "Vikrant Massey on failing at PR: Attended parties, spent Rs 60k on designer clothesActor Vikrant Massey recently spoke about the challenges one faces when it comes to PR tactics in Bollywood. He reflected on staying authentic amid industry expectations and costly publicity efforts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-minu-muneer-granted-bail-in-actor-balachandra-menon-defamation-case-2749313-2025-07-02",
      "headline": "Malayalam actor Minu Muneer granted bail in actor Balachandra Menon defamation caseMalayalam actor Minu Muneer was granted bail on Tuesday in an old case involving actor-director Balachandra Menon. She was accused of defaming him through her social media posts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-cause-of-death-undetermined-histopathology-2749299-2025-07-02",
      "headline": "Shefali Jeriwala death: More samples sent for testing, cause of death still unclearActor Shefali Jariwala's cause of death still remains unclear as forensic experts await detailed histopathology and chemical analysis reports. Police investigations reveal no foul play, suspecting cardiac arrest linked to fasting and self-medication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-flexes-his-muscles-in-new-post-shares-message-on-self-care-2749300-2025-07-02",
      "headline": "Salman Khan flexes his muscles in new post, shares message on self-careBollywood icon Salman Khan recently shared inspiring post-workout photos highlighting his dedication to fitness and self-care. At 59, he continues to motivate with his strong physique and candid reflections on personal growth and mindfulness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-breaks-down-on-stage-amid-split-rumours-with-orlando-bloom-2749279-2025-07-02",
      "headline": "Singer Katy Perry breaks down on stage amid split rumours with Orlando BloomSinger Katy Perry broke down on stage during her tour in Australia, just weeks after news of her split from partner Orlando Bloom surfaced. Later, she thanked her fans for their unwavering support and for always standing by her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhon-ki-gustaakhiyan-trailer-vikrant-massey-shanaya-kapoor-in-a-tale-of-love-longing-2749282-2025-07-02",
      "headline": "Aankhon Ki Gustaakhiyan trailer: Vikrant, Shanaya in a tale of love, longingThe trailer for 'Aankhon Ki Gustakhiyan' introduces a heartfelt love story marking Shanaya Kapoor's Bollywood debut alongside Vikrant Massey. Set for a monsoon release, the film is set to hit theatres on July 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-exclusive-action-tom-cruise-akshay-kumar-heads-of-state-2749273-2025-07-02",
      "headline": "Love Tom Cruise, Akshay, but can't hang off a plane: Priyanka Chopra | ExclusiveAt the London premiere of 'Heads of State', Priyanka Chopra, in an exclusive conversation with India Today, expressed admiration for Tom Cruise and Akshay Kumar's daring stunts. She also revealed her love for action films and appreciation for the stunt teams that make such feats possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-beats-samay-raina-in-chess-gets-roasted-over-laal-singh-chaddha-2749255-2025-07-02",
      "headline": "Aamir Khan beats Samay Raina in Chess, gets roasted over Laal Singh ChaddhaAamir Khan showcased his witty and competitive side in a light-hearted chess match with comedian Samay Raina. This playful interaction, shared on social media, offered a refreshing break amid the promotions of his latest film 'Sitaare Zameen Par'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-priyanka-chopra-hugs-impromptu-dance-heads-of-state-premiere-2749246-2025-07-02",
      "headline": "Nick hugs Priyanka Chopra after her impromptu dance ahead of Heads of State premiereNick Jonas supported Priyanka Chopra at the 'Heads of State' premiere in London. He shared a cute video of their perfect moment ahead of the film's premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-announces-full-group-album-release-in-spring-2026-and-global-world-tour-plans-after-completing-military-service-recording-to-begin-in-the-united-states-this-july-2749114-2025-07-01",
      "headline": "BTS announces 2026 comeback album and world tour on Weverse live with all 7 membersBTS members revealed exciting plans during a Weverse live broadcast, confirming their first full group album in four years and a global world tour starting next spring. Recording will begin in the United States from July as the group reunites after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-recalls-being-shunned-at-school-after-father-boney-married-sridevi-2749113-2025-07-01",
      "headline": "Anshula Kapoor recalls being shunned at school after father Boney married SrideviSocial media influencer Anshula Kapoor shared that she was cornered by her classmates after her father, Boney Kapoor, married Sridevi. She said divorces were not common back in the 90s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-admitted-she-is-pro-botox-everybody-wants-to-look-good-2749118-2025-07-01",
      "headline": "When Shefali Jariwala admitted she is pro Botox: Everybody wants to look goodBefore her sudden death, Shefali Jariwala had said she supports Botox and skin treatments to look good. An old interview where she spoke about fitness, beauty, and self-care is now going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-ex-wife-seema-sajdeh-london-family-holiday-co-parenting-2749083-2025-07-01",
      "headline": "Sohail Khan, ex-wife Seema Sajdeh enjoy London holiday with sonsSohail Khan and ex-wife Seema Sajdeh reunited in London for a family holiday with their sons. Despite their divorce, they continue to co-parent, bringing the family together for special occasions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dilip-joshi-to-quit-taarak-mehta-ka-ooltah-chashmah-creator-clarifies-2749098-2025-07-01",
      "headline": "Dilip Joshi to quit Taarak Mehta Ka Ooltah Chashmah? Creator clarifiesAmid strong speculation about Dilip Joshi's exit from Taarak Mehta Ka Ooltah Chashmah, the show's creator Asit Kumarr Modi, has addressed the rumours and shared his perspective.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-calls-horror-emotionally-draining-says-she-misunderstood-the-genre-before-maa-2749092-2025-07-01",
      "headline": "Kajol calls horror emotionally draining, says she misunderstood the genre before MaaKajol, who stars in her first horror film 'Maa', shared she isn't a fan of the genre and will watch the movie only for professional reasons. She described the experience as emotionally draining and admitted horror required a completely different acting approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-reunite-sasural-simar-ka-shweta-sinha-snehal-sahay-2749021-2025-07-01",
      "headline": "Dipika Kakar-Shoaib Ibrahim reunite with Sasural Simar Ka co-starsActor Dipika Kakar, who recently underwent surgery for a liver tumour, reunited with her 'Sasural Simar Ka' co-stars Shweta Sinha and Snehal Sahay during her recovery. The emotional reunion  brought back fond memories, and the friends even planned a future trip together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cid-hrishikesh-pandey-talks-about-career-struggles-says-success-is-about-timing-2749037-2025-07-01",
      "headline": "CID actor Hrishikesh Pandey on career struggles: Success is all about timing'CID' actor Hrishikesh Pandey discussed the importance of timing in the entertainment industry. He shared his insights on the importance of being at the right place and at the right time. The actor also noted that the role of competition and character choice are very important in acting."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Big GST relief likely as government considers rate cut on common goods: SourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-plane-crash-pilots-simulate-accident-technical-flaw-2749357-2025-07-02",
      "headline": "What led to Air India crash? Pilots simulate accident, find key flaw, says reportAir India crash: As part of the simulation, the Air India pilots kept the landing gear deployed and the wing flaps retracted. It was found that these configurations alone would not have resulted in a crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dalai-lama-reveals-when-his-successor-will-be-chosen-shuts-out-chinas-participation-2749311-2025-07-02",
      "headline": "Dalai Lama shuts out China, reveals when his successor will be chosenThe Dalai Lama has reaffirmed that only his official office will choose his successor, rejecting any Chinese claim over selecting the next spiritual leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-warms-up-us-president-donald-trump-after-deportation-threat-lauds-global-peace-efforts-2749345-2025-07-02",
      "headline": "Elon Musk warms up to Trump after deportation threatPosting Donald Trump's Truth Social post claiming that Israel has agreed to a 60-day ceasefire in Gaza, Elon Musk credited Trump for resolving global conflicts, saying, 'Credit where credit is due.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/dubai-dark-secret-sexual-abuse-behind-porta-potty-parties-ultra-rich-influencers-social-media-racial-profile-2748912-2025-07-02",
      "headline": "Dubai's dark secret: Sexual extremities in Porta-Potty parties of the ultrarichDubai's ultrarich lure women into secret Porta-Potty parties with luxury gifts, only to exploit them through degrading sexual acts. The recent death of a Ukrainian model in Dubai has been linked to sexual extremities at a Porta-Potty party. Experts are now warning young female tourists against such private events that have legal risks too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/post-covid-deaths-not-related-to-vaccines-pre-existing-conditions-among-key-factors-study-by-icmr-aiims-2749289-2025-07-02",
      "headline": "'Sudden deaths' after pandemic not linked to Covid vaccines, studies findThe Union Health Ministry also clarified that there was no link between Covid-19 vaccines and heart attacks in young adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-cm-siddaramaiah-45-year-old-record-congress-devaraj-urs-life-parallels-power-tussle-2749100-2025-07-02",
      "headline": "Siddaramaiah, 45-year-old CM record of Devaraj Urs, and life parallelsKarnataka Chief Minister Siddaramaiah's desire to be Karnataka's longest-serving CM is partly behind his power tussle with DK Shivakumar. To fulfil his desire, Siddaramaiah will have to break D Devaraj Urs' record. There are interesting parallels between the life of Siddaramaiah and that of Urs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-2nd-test-preview-selection-headache-bumrah-kuldeep-edgbaston-2749170-2025-07-02",
      "headline": "In hostile Edgbaston, India eye equaliser, look to crack selection puzzleEngland vs India, 2nd Test Preview: Trailing 0-1 in the five-match Test series, the Shubman Gill-led India will need to give themselves the best chance of taking 20 wickets to level the series on a batting-friendly Edgbaston pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/cardiac-surgeon-ramakanta-panda-flags-rising-heart-issues-in-young-indians-in-karnataka-hassan-2749188-2025-07-02",
      "headline": "Top cardiac surgeon flags rising heart issues in young IndiansFour sudden heart attack deaths in Hassan district have alarmed the community. Dr. Ramakanta Panda talks about deadly lifestyle habits that have increased cardiovascular issues in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/meet-anil-menon-the-next-indian-american-set-to-go-to-space-after-sunita-williams-2749367-2025-07-02",
      "headline": "Surgeon, pilot, astronaut: This Indian-American will go to space in 2026Selected as part of Nasa's 23rd astronaut class in 2021, Menon graduated as an astronaut in 2024. Since then, he has been preparing intensively for his first spaceflight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-reacts-to-trump-arrest-threat-says-will-not-accept-this-intimidation-glbs-2749232-2025-07-02",
      "headline": "Won't accept this intimidation: Zohran Mamdani slams Trump over arrest threatNew York lawmaker Zohran Mamdani accused Trump of threatening his arrest and deportation over his anti-immigration stance, vowing resistance and warning that such intimidation targets all vocal New Yorkers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-allows-cab-aggregators-to-double-peak-hour-fares-under-new-guidelines-2749292-2025-07-02",
      "headline": "Ola, Uber get government okay for surge pricing, can charge double the base fareStates have been advised to implement the updated guidelines within the next three months. The revised fare structure is aimed at giving platforms flexibility during high-demand periods, while maintaining an overall regulatory framework for pricing and operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-no-more-mr-nice-guy-ruthless-edgbaston-test-2749340-2025-07-02",
      "headline": "No more Mr Nice Guy: Gill needs to show his ruthless self in BirminghamIndia's chances of winning the second Test in Birmingham boil down to whether Shubman Gill is able to establish his vision and bring out his style of cricket in the team. This includes picking more attacking options in the bowling unit and being more demanding of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gangrape-scratches-on-accused-cited-evidence-custody-of-3-extended-2749190-2025-07-02",
      "headline": "Scratches found on Kolkata rape prime accused imply woman fought back: CopsA court on Tuesday extended the police custody of the three main accused - Manojit Mishra, a former student and a Trinamool Congress Chhatra Parishad leader; and Zaib Ahmed and Pramit Mukherjee - by eight more days, until July 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-grants-bail-to-accused-in-2023-parliament-breach-case-bars-them-from-commenting-on-incident-2749323-2025-07-02",
      "headline": "Parliament breach accused get bail, barred from posting on social media on caseThe court has barred the accused from giving interviews or making any public statements related to the case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-man-ties-beats-burns-daughter-5-with-cigarette-for-not-sleeping-on-time-2749274-2025-07-02",
      "headline": "Girl, 5, tied, thrashed, burnt with cigarette by father for not sleeping on timeThe case came to light when the complainant received a disturbing video from the man's wife around 2:45 pm, showing the accused brutally assaulting their daughter. The father could be seen tying the girl's legs, assaulting her and burning her cheek with a cigarette. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-exclusive-action-tom-cruise-akshay-kumar-heads-of-state-2749273-2025-07-02",
      "headline": "Love Tom Cruise, Akshay, but can't hang off a plane: Priyanka Chopra | ExclusiveAt the London premiere of 'Heads of State', Priyanka Chopra, in an exclusive conversation with India Today, expressed admiration for Tom Cruise and Akshay Kumar's daring stunts. She also revealed her love for action films and appreciation for the stunt teams that make such feats possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-to-speak-with-students-explain-how-digestion-system-adapts-to-space-2749350-2025-07-02",
      "headline": "Shux to speak with students, explain how digestion system adapts to spaceFluid shifts toward the upper body also impact digestive function, sometimes causing discomfort and changes in nutrient absorption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-are-going-to-have-a-deal-says-trump-amid-india-us-trade-deadlock-glbs-2749231-2025-07-02",
      "headline": "There will be a deal with much less tariffs: Trump on US-India trade talksPresident Donald Trump said India may lower tariffs to seal a trade deal with the United States as talks remain stuck over agricultural demands, with a 26% duty hike looming if negotiations fail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/kpcc-showcause-notice-to-congress-mla-iqbal-hussain-reiterates-call-for-dk-shivakumar-as-ktaka-cm-2749362-2025-07-02",
      "headline": "Despite Congress notice, MLA continues 'DK Shivakumar for Chief Minister' callDespite being served a show-cause notice by the Karnataka Pradesh Congress Committee, MLA Iqbal Hussain reiterated his demand that Deputy Chief Minister DK Shivakumar be made Karnataka Chief Minister. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-interview-16-year-old-park-tae-sang-2749329-2025-07-02",
      "headline": "Part Saina, part Sindhu, 16-year-old Tanvi Sharma sets sights on Olympic glorySpeaking to IndiaToday.in, 16-year-old Tanvi Sharma and her coach, Park Tae Sang, reflect on the run to the US Open final. A true PV Sindhu fan, Tanvi based her game on India's double Olympic medalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/indian-astronaut-shubhanshu-shukla-diabetes-research-on-axiom-space-mission-glucose-metabolism-study-2749087-2025-07-02",
      "headline": "Shubhanshu Shukla's space mission could rewrite the rules of diabetes careIndian astronaut Shubhanshu Shukla is part of the Ax-4 mission studying diabetes in space. This research could transform diabetes care on Earth and enable diabetics to travel safely in space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-trump-calls-biden-son-of-a-bh-while-touring-newly-opened-migrant-camp-2749243-2025-07-02",
      "headline": "Video: Trump calls Biden 'son of a b***h' while touring newly opened migrant campTrump veered off-script several times and was caught in hot mic moments during his tour of the newly opened escape-proof migrant detention center in Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mark-zuckerberg-has-reportedly-been-paying-up-to-300-million-paychecks-to-build-his-ai-dream-team-2749298-2025-07-02",
      "headline": "Meta reportedly paid up to $300 million paychecks to hire its AI dream teamMark Zuckerberg is reportedly offering up to $300 million pay packages to top AI researchers, particularly from OpenAI, to build Meta's new superintelligence team. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-origin-players-abroad-represent-india-new-national-sports-policy-2749358-2025-07-02",
      "headline": "Indian-origin players abroad may now represent India under new National Sports PolicyThe new National Sports Policy allows Indian-origin players living abroad to represent India internationally. This shift aims to strengthen India's sports ecosystem and enhance global sporting ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-no-more-mr-nice-guy-ruthless-edgbaston-test-2749340-2025-07-02",
      "headline": "No more Mr Nice Guy: Gill needs to show his ruthless self in BirminghamIndia's chances of winning the second Test in Birmingham boil down to whether Shubman Gill is able to establish his vision and bring out his style of cricket in the team. This includes picking more attacking options in the bowling unit and being more demanding of his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tanvi-sharma-interview-16-year-old-park-tae-sang-2749329-2025-07-02",
      "headline": "Part Saina, part Sindhu, 16-year-old Tanvi Sharma sets sights on Olympic glorySpeaking to IndiaToday.in, 16-year-old Tanvi Sharma and her coach, Park Tae Sang, reflect on the run to the US Open final. A true PV Sindhu fan, Tanvi based her game on India's double Olympic medalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-birmingham-test-weather-forecast-rain-prediction-pitch-report-edgbaston-2749305-2025-07-02",
      "headline": "ENG vs IND, Birmingham weather forecast: Will rain douse India's comeback?ENG vs IND: India's push to level the series at Edgbaston may be dictated more by Birmingham's skies than the scorecard, as unpredictable weather and a seam-friendly pitch threaten to take centre stage in the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-sammy-calls-for-justice-rape-allegations-west-indies-player-2749301-2025-07-02",
      "headline": "West Indies cricketer faces rape allegations: We believe in justice, says coachWest Indies head coach Darren Sammy expressed confidence that the proper processes would be followed in the investigation into rape allegations against a current cricketer. Sammy said he had worked to maintain morale in the dressing room ahead of the second Test against Australia, starting on 3 June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-birmingham-ian-bell-2749290-2025-07-02",
      "headline": "England great surprised by India's Jasprit Bumrah plans in Test seriesFormer England batter Ian Bell believes that India should not limit Jasprit Bumrah to just three Tests for workload management if he is fit, especially given the high-profile nature of the five-match Anderson-Tendulkar series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-juventus-club-world-cup-score-kylian-mbappe-return-2749267-2025-07-02",
      "headline": "Kylian Mbappe returns as Real Madrid outclass Juventus to reach quartersReal Madrid secured a narrow 1-0 win over Juventus in the Club World Cup round of 16. Gonzalo García's header sealed the deal following which Kylian Mbappe's return gave the Spanish side a big boost. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-cricket-t20i-series-england-defeat-amanjot-kaur-jemimah-rodrigues-bristol-2749251-2025-07-02",
      "headline": "All-round Amanjot fires as India hammer England again, seal 2-0 leadENG vs IND, 2nd Women's T20I: India came up with an all-round show to hand England their first-ever T20I loss in Bristol. India took a 2-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-beats-alexandre-muller-critics-message-2749240-2025-07-02",
      "headline": "After shaky 1st-round win, Novak Djokovic sends strong message to doubtersNovak Djokovic overcame a stomach bug to win his opening-round match against unseeded Alexandre Muller on Monday. The seven-time champion dismissed doubts over his chances at the grass-court Grand Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-2nd-test-preview-selection-headache-bumrah-kuldeep-edgbaston-2749170-2025-07-02",
      "headline": "In hostile Edgbaston, India eye equaliser, look to crack selection puzzleEngland vs India, 2nd Test Preview: Trailing 0-1 in the five-match Test series, the Shubman Gill-led India will need to give themselves the best chance of taking 20 wickets to level the series on a batting-friendly Edgbaston pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-alexander-zverev-coco-gauff-mirra-andreeva-2749216-2025-07-02",
      "headline": "Zverev, Gauff make shock R1 exit, Andreeva, Rybakina advanceWimbledon 2025: Alexander Zverev and Coco Gauff crashed out in the opening round after losing to Arthur Rinderknech and Dayana Yastremska respectively. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-juventus-club-world-cup-score-kylian-mbappe-return-2749267-2025-07-02",
      "headline": "Kylian Mbappe returns as Real Madrid outclass Juventus to reach quartersReal Madrid secured a narrow 1-0 win over Juventus in the Club World Cup round of 16. Gonzalo García's header sealed the deal following which Kylian Mbappe's return gave the Spanish side a big boost. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-cricket-t20i-series-england-defeat-amanjot-kaur-jemimah-rodrigues-bristol-2749251-2025-07-02",
      "headline": "All-round Amanjot fires as India hammer England again, seal 2-0 leadENG vs IND, 2nd Women's T20I: India came up with an all-round show to hand England their first-ever T20I loss in Bristol. India took a 2-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-beats-alexandre-muller-critics-message-2749240-2025-07-02",
      "headline": "After shaky 1st-round win, Novak Djokovic sends strong message to doubtersNovak Djokovic overcame a stomach bug to win his opening-round match against unseeded Alexandre Muller on Monday. The seven-time champion dismissed doubts over his chances at the grass-court Grand Slam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-2nd-test-preview-selection-headache-bumrah-kuldeep-edgbaston-2749170-2025-07-02",
      "headline": "In hostile Edgbaston, India eye equaliser, look to crack selection puzzleEngland vs India, 2nd Test Preview: Trailing 0-1 in the five-match Test series, the Shubman Gill-led India will need to give themselves the best chance of taking 20 wickets to level the series on a batting-friendly Edgbaston pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-alexander-zverev-coco-gauff-mirra-andreeva-2749216-2025-07-02",
      "headline": "Zverev, Gauff make shock R1 exit, Andreeva, Rybakina advanceWimbledon 2025: Alexander Zverev and Coco Gauff crashed out in the opening round after losing to Arthur Rinderknech and Dayana Yastremska respectively. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}