{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-some-ipo-stocks-keep-running-for-days-after-listing-explains-zerodhas-nithin-kamath-2838054-2025-12-18",
      "headline": "Why some IPO stocks keep running for days after listing, explains Nithin KamathIPO stocks continuing to rise after listing may seem puzzling.  Nithin Kamath breaks down a technical reason that is often overlooked by retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-chaos-competition-commission-of-india-reviews-antitrust-violations-airline-crisis-2838022-2025-12-18",
      "headline": "IndiGo chaos: Competition regulator reviews 'antitrust violations' by airlineIndiGo cancelled about 4,500 flights earlier this month due to poor pilot roster planning, stranding tens of thousands of passengers, triggering a major aviation crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-lower-as-global-cues-remain-weak-it-stocks-limit-losses-2837954-2025-12-18",
      "headline": "Sensex, Nifty close lower as global cues remain weak, IT stocks limit lossesThe S&P BSE Sensex lost 77.84 points to close at 84,481.81, while the NSE Nifty50 was down by 3 points to end at 25,815.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-gets-rs-1500-crore-boost-as-apple-manufacturing-expands-in-india-2837871-2025-12-18",
      "headline": "Tata Electronics gets Rs 1,500 crore boost as Apple manufacturing expands in IndiaThe fresh funding underlines Tata Group's continued support for expanding capacity at Tata Electronics, which has emerged as one of Apple's largest iPhone manufacturing partners in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-the-demand-to-raise-the-minimum-eps-pension-to-rs-7500-still-stuck-at-rs-1000-2837808-2025-12-18",
      "headline": "Why hasn't the minimum EPS pension been raised from Rs 1,000 to Rs 7,500?The government has reiterated financial and actuarial constraints in response to renewed calls for an increase in the minimum EPS-95 pension, but no timeline or policy decision has been announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-to-lay-off-370-staff-in-luxembourg-whats-driving-the-job-cuts-2837784-2025-12-18",
      "headline": "Amazon to lay off 370 staff in Luxembourg. What's driving the job cuts?Amazon employs about 4,370 people in Luxembourg, and the planned cuts will affect nearly 8.5% of its workforce there. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/worst-behind-us-indigo-ceo-tells-staff-blames-compounding-effect-of-several-factors-for-cancellations-2837780-2025-12-18",
      "headline": "Worst behind us, IndiGo CEO tells staff after days of flight cancellations chaosAfter days of cancellation chaos, IndiGo said it has stabilised operations and restored its network to about 2,200 flights a day. Meanwhile, CEO Pieter Elbers has blamed the disruption on a compounding effect of several factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-founder-bhavish-aggarwal-is-selling-ola-electric-stake-shares-fall-all-time-low-promoter-sell-2837776-2025-12-18",
      "headline": "Why Ola Electric's Bhavish Aggarwal is selling stake as shares hit 52-week lowThe immediate reason for the latest fall of Ola Electric has been Bhavish Aggarwal's back‑to‑back selling of the stock in the open market over two days, worth well over Rs 200 crore in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-fall-52-week-low-stake-sale-bhavish-aggarwal-offloading-promoter-2837729-2025-12-18",
      "headline": "Explained: Why Ola Electric shares fell 4% to hit 52-week low todayOla Electric share price: The stock hit a low of Rs 31.54 on December 18, marking its weakest level since listing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rrp-semiconductor-ltd-best-performing-stock-ai-bubble-concern-report-2837713-2025-12-18",
      "headline": "55,000% rally in Indian AI stock triggers bubble concerns: ReportA little-known Indian company has delivered a stunning 55,000% rise in just under two years, raising serious questions about hype, regulation and investor risk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-189-points-lower-nifty-below-25800-infosys-up-1-percent-2837708-2025-12-18",
      "headline": "Sensex opens 189 points lower, Nifty below 25,800; Infosys up 1%The S&P BSE Sensex was down by 87.06 points to 84,472.59, while the NSE Nifty50 lost 24.30 points to 25,794.25 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gmp-icici-prudential-amc-expected-profit-share-price-listing-date-details-allotment-check-bse-kfin-2837690-2025-12-18",
      "headline": "ICICI Prudential AMC IPO GMP today: Is market hinting at listing gains tomorrow?The IPO allotment was finalised on Wednesday, following heavy demand from institutional investors over the three-day subscription window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eb4-visa-process-for-foreign-technical-experts-glbs-2837630-2025-12-18",
      "headline": "India eases visa process for foreign professionals, engineers hired by firmsIndia has introduced a simplified e-B-4 visa process to facilitate foreign experts' entry for manufacturing projects. The move aims to reduce visa processing time and support faster industrial execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poses-risks-warner-bros-discovery-board-rejects-108-billion-rival-bid-from-paramount-netflix-in-race-2837474-2025-12-17",
      "headline": "Warner Bros rejects Paramount's $108-billion hostile bid, Netflix in raceThe board said Netflix's $27.75-per-share binding merger offers greater certainty, stronger finances and lower risk for shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-walmart-to-reliance-meet-the-worlds-10-richest-families-2837436-2025-12-17",
      "headline": "From Walmart to Reliance: Meet the world's 10 richest familiesFrom retail giants to oil empires, the world's richest families control businesses that shape global markets. Let's look at the 10 richest families globally, with the Ambani family representing India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-nse-bse-rupee-gain-fii-selling-sbi-psu-bank-shares-2837335-2025-12-17",
      "headline": "Sensex ends 120 points lower, Nifty below 25,900; SBI gains 2%The S&P BSE Sensex was down 120.21 points to close at 84,559.65, while the NSE Nifty50 lost 41.55 points to end at 25,818.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-tax-gst-on-health-insurance-will-premium-come-down-low-cost-or-not-insurer-personal-finance-2837317-2025-12-17",
      "headline": "Zero GST on health insurance: What it means for your premium and your pocketFrom September 22, individual health and life insurance policies have become free from Goods and Services Tax, removing the 18% tax that policyholders were paying earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-it-be-implemented-and-how-much-can-you-expect-2837249-2025-12-17",
      "headline": "8th Pay Commission: When will it be implemented and how much can you expect?The 8th Pay Commission has officially been set up, but the big questions remain unanswered. When will the new pay structure be implemented, and how much of a salary hike can central government employees realistically expect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-hit-record-high-gold-rate-today-mcx-should-you-invest-outshining-yellow-metal-2837224-2025-12-17",
      "headline": "Silver rates reach new high: Why is it beating gold prices, and should you buy?On the Multi Commodity Exchange (MCX), silver jumped over 4% during early trade. Around 9:20 am, MCX silver was trading 3.38% higher at Rs 2,04,445 per kg, touching a lifetime high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-70-salary-rule-and-where-the-other-30-should-go-2837215-2025-12-17",
      "headline": "What is the 70% salary rule and where the other 30% should go?Abhishek Walia urges individuals to base their spending only on verified take-home pay, warning that relying on bonuses or predicted increments leads to financial stress."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adivi-sesh-on-dacoit-clash-with-ranveer-singh-dhurandhar-2-yash-toxic-we-are-goldfish-among-big-fish-2838057-2025-12-18",
      "headline": "Adivi Sesh on Dacoit clash with Dhurandhar 2, Toxic: We are goldfish among big fish Telugu actor Adivi Sesh reacted to the high-profile release clash between his film 'Dacoit', Ranveer Singh's 'Dhurandhar 2', and Yash's 'Toxic' on March 19. He expressed confidence by citing experiences with similar competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-december-25-release-tu-meri-main-tera-festive-box-office-competition-2838052-2025-12-18",
      "headline": "KJo confirms Christmas release for Tu Meri Main... amid Dhurandhar, Avatar storm Karan Johar stands by the planned December 25 release of his film Tu Meri Main Tera Main Tera Tu Meri, addressing the strong box office presence of Dhurandhar and the upcoming Avatar Fire and Ash, and expresses both confidence in his project and appreciation for competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nidhhi-agerwal-mob-incident-case-filed-against-hyderabad-mall-event-organisers-2837993-2025-12-18",
      "headline": "Nidhhi Agerwal mob incident: Case filed against Hyderabad mall, event organisers The police have taken action against Hyderabad's Lulu Mall management and event organisers following an incident where actor Nidhhi Agerwal was mobbed by a large crowd during a song launch. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-draws-the-line-between-criticism-and-trolling-i-choose-pity-2838056-2025-12-18",
      "headline": "Karan Johar draws the line between criticism and trolling: I choose pity Karan Johar shared his experience and approach to criticism and online trolling. In a public discussion, he explained how he differentiates between genuine criticism and negative trolling, especially when it affects his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/andrea-jeremiah-confirms-return-as-chandra-in-vetri-maarans-arasan-film-2837960-2025-12-18",
      "headline": "Andrea Jeremiah hints at returning as Chandra in Vetri Maaran's Arasan A recent social media post by Andrea Jeremiah has reignited speculation about her return as Chandra from Vada Chennai in Vetrimaaran's Arasan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoh-pahwa-admits-he-hesitated-to-call-shah-rukh-khan-ghante-ka-baadshah-in-the-bads-of-bollywood-2837947-2025-12-18",
      "headline": "Manoj Pahwa: Was hesitant to call SRK ghante ka baadshah in Ba***ds of Bollywood Actor Manoj Pahwa has revealed that he had several disagreements with director Aryan Khan regarding the use of abusive language in 'The Ba****ds of Bollywood'. He also admitted to being hesitant to call SRK 'Ghante Ka Badshah' in one of the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-motorsport-journey-al-vijay-documents-racing-passion-dedication-2838034-2025-12-18",
      "headline": "Ajith Kumar's racing film is in the works, confirms director AL Vijay A special project by filmmaker AL Vijay is documenting actor Ajith Kumar's enduring passion for motorsport. The director confirmed the film in a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vaa-vaathiyaar-release-barred-supreme-court-dues-dispute-2837919-2025-12-18",
      "headline": "Karthi's Vaa Vaathiyaar release remains on hold following Supreme Court order The Supreme Court has maintained the Madras High Court's order to halt the release of Karthi's upcoming film Vaa Vaathiyaar over unpaid financial obligations, preventing the movie from hitting cinemas as initially planned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saumya-tandon-shares-behind-the-scenes-dhurandhar-shoot-amritsar-2837872-2025-12-18",
      "headline": "Saumya Tandon shares her 1st Dhurandhar shot with Akshaye Khanna: We barely spoke Saumya Tandon has offered a glimpse into her experience working on the film Dhurandhar, recalling her first day on set and the professional relationship with co-actor Akshaye Khanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-vidya-balan-reunite-on-screen-after-6-years-for-aneez-bazmee-film-2837938-2025-12-18",
      "headline": "Akshay Kumar, Vidya Balan reunite on screen after 6 years for Aneez Bazmee film Akshay Kumar and Vidya Balan are confirmed to work together in Anees Bazmee's next untitled film. Akshay and Vidya are reuniting six years after 'Mission Mangal' (2019)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/basil-joseph-almost-joined-lokah-chapter-one-reveals-kalyani-priyadarshan-2837966-2025-12-18",
      "headline": "Basil Joseph almost joined Lokah Chapter One, reveals Kalyani Priyadarshan Actor Basil Joseph was initially considered for Lokah Chapter One: Chandra but had to opt out due to scheduling conflicts. The film became a major success, marking Kalyani Priyadarshan's debut as a superhero. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-sanu-files-defamation-suit-against-ex-wife-rita-bhattacharya-seeks-rs-50-crore-damages-2837988-2025-12-18",
      "headline": "Kumar Sanu files defamation suit against ex-wife, seeks Rs 50 crore in damages Kumar Sanu has filed a defamation suit seeking an apology from his ex-wife Rita Bhattacharya and has also sought Rs 50 crore damages charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-launches-ammakai-south-indian-restaurant-bandra-rs-60-crore-fraud-case-2837945-2025-12-18",
      "headline": "Shilpa Shetty announces launch of new restaurant Ammakai amid fraud case probe Shilpa Shetty is set to open a new South Indian restaurant, Ammakai, at the Bandra, Mumbai, site of her original Bastian outlet. This comes as she and her husband, Raj Kundra, continue to face allegations in a Rs 60 crore fraud case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-mourns-death-of-kgf-assistant-directors-4-year-old-son-in-lift-mishap-2837964-2025-12-18",
      "headline": "Pawan Kalyan mourns death of KGF assistant director's 4-year-old son in lift mishap Sonarsh K Nadagouda, the young son of filmmaker Kirtan Nadagouda, died in a lift accident. Pawan Kalyan wrote a long post on X offering his condolences to the family and wishing them strength in difficult times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-shortlisted-best-international-feature-film-98th-academy-awards-2837934-2025-12-18",
      "headline": "We seek your prayers: Karan Johar on Homebound's Oscar journey 'Homebound', produced by Karan Johar and directed by Neeraj Ghaywan, has secured a place among the 15 films shortlisted for Best International Feature Film at the 98th Academy Awards, marking a significant achievement for Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dileep-bha-bha-ba-review-meta-comedy-fails-logic-madness-2837908-2025-12-18",
      "headline": "Bha Bha Ba review: No logic, no madness in Dileep's vile attempt at meta filmRelease Date:Thu Dec 18, 2025 Bha Bha Ba movie review: Directed by Dhananjay Shankar, Bha Bha Ba, starring Dileep and Vineeth Sreenivasan, is an attempt at madcap comedy with numerous meta references. The film, however, feels more like Dileep asserting his innocence in the wake of his recent acquittal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/malti-chahar-recalls-casting-couch-experiences-a-director-tried-to-kiss-me-2837929-2025-12-18",
      "headline": "Malti Chahar recalls casting couch experiences: A director tried to kiss me Bigg Boss 19 contestant Malti Chahar has spoken about facing uncomfortable situations in the film industry, including casting couch incidents, and the need for women to assert strong boundaries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-deewane-ki-deewaniyat-harshvardhan-rane-sonam-bajwa-on-ott-when-where-to-watch-romantic-drama-2837917-2025-12-18",
      "headline": "Ek Deewane Ki Deewaniyat on OTT: When and where to watch romantic film online The romantic drama 'Ek Deewane Ki Deewaniyat' is set to stream on OTT. The film stars Harshvardhan Rane and Sonam Bajwa in leading roles and is directed by Milap Zaveri."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-crushes-baahubali-at-box-office-in-13-days-eyes-rs-1000-crore-2837896-2025-12-18",
      "headline": "Dhurandhar crushes Baahubali at global box office in 13 days, eyes Rs 1,000 crore Dhurandhar beat Baahubali's lifetime India and worldwide run in just 13 days. The A-rated spy thriller eyes the Rs 1,000-crore club amid a historic box office run. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bondi-beach-shooting-terrorist-attack-sydney-police-heavily-armed-operation-detained-handcuffed-2837998-2025-12-18",
      "headline": "Police ram car in dramatic operation near Sydney 4 days after Bondi attackHeavily armed Australian police personnel rammed a white Hyundai hatchback in a dramatic operation in a Sydney suburb just days after the Bondi Beach shooting, the worst terror attack in Australia in 30 years that saw 15 deaths. The vehicle occupants, headed for Sydney's Bondi, were handcuffed and detained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-severe-plus-aqi-data-contradicts-bhupendra-yadav-claim-2838009-2025-12-18",
      "headline": "Delhi-NCR saw 2 days of severe+ AQI in 2025, data contradicts minister's claimGovernment data from NCR monitoring stations shows that parts of Delhi-NCR, including Delhi and Noida, recorded \"severe+\" air pollution days in December 2025, contradicting Union Environment Minister Bhupendra Yadav's claim in Parliament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/quick-look-bharat-taxi-is-here-and-it-is-already-very-different-from-uber-ola-rapido-2837913-2025-12-18",
      "headline": "Bharat Taxi is here, and it is already very different from Uber, Ola, RapidoBharat Taxi is a new entrant in India's burgeoning ride-hailing space. In the coming days, it will take on Uber and Ola, with some unique feature-set and strong backing from the government of India. India Today Tech takes a look."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/sourav-ganguly-files-rs-50-crore-defamation-suit-over-messi-event-chaos-kolkata-2838062-2025-12-18",
      "headline": "Sourav Ganguly files Rs 50 crore defamation suit over Messi's Kolkata event claimsSourav Ganguly has taken legal action against Uttam Saha, president of the Argentina Fan Club of Kolkata, for allegedly making false and damaging statements about his involvement in the controversial Lionel Messi event at Yuva Bharati Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-part5-Name-Games-The-Dazzling-Dance-of-Definitions-323-18-12-2025",
      "headline": "Name Games: The Dazzling Dance of DefinitionsWhat's in a name? Just another word if it sits lonely inside a dusty dictionary. A little more when it functions as a noun or adjective in a dry document."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-india-news-us-visa-crisis-worsens-some-appointments-postponed-october-2026-deferred-america-h4-interview-2837806-2025-12-18",
      "headline": "US visa crisis worsens, H-1B interviews in India postponed to October 2026The crisis could deepen for hundreds of Indians with jobs in the US, with H-1B visa interviews postponed further to October 2026. Scores of Indians, some separated from their families, are stranded with jobs hanging by a thread. The US had earlier postponed H-1B interviews from December 2025 to March 2026 even as it expanded social media scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladeshis-threaten-bloodshed-clash-with-security-as-india-shuts-visa-operations-rajshahi-2838030-2025-12-18",
      "headline": "Bangladeshis threaten bloodshed, clash with security forces as India shuts visa opsAs India shut its Indian Visa Application Centres (IVACs) in Khulna and Rajshahi over security concerns, protesters warned of \"bloodshed\" to wash away what they described as injustice and said they would take up swords or other arms if necessary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/seagull-chinese-gps-tracker-karnataka-karwar-coast-ins-kadamba-naval-base-2837663-2025-12-18",
      "headline": "Seagull with Chinese GPS tracker found near key naval base in KarnatakaOfficials found that the GPS tracker, which was attached to the seagull's back, belonged to a research centre under the Chinese Academy of Sciences. The bird was found along the Karwar coast, close to the INS Kadamba naval base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-a-doctor-and-this-is-what-i-think-is-the-biggest-mistake-after-dinner-2837732-2025-12-18",
      "headline": "I am a doctor, and this is what I think is the biggest mistake people make after dinnerAfter years of seeing the same complaint repeat itself in clinics, one overlooked habit stands out more than diet or spice. Here's why I think it deserves attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/united-states-us-embassy-visa-expiry-date-duration-of-stay-length-donald-trump-immigration-migrants-homeland-i-94-forms-customs-officer-2837867-2025-12-18",
      "headline": "How long can visitors stay in US? Embassy clarifies on visa expiry dateThe US Embassy in India has reiterated how long international visitors heading to the country will be allowed to stay, clarifying that it's not as per their visa expiry date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahatma-gandhis-name-was-added-to-nrega-with-eye-on-2009-polls-shivraj-singh-chouhan-in-lok-sabha-2837836-2025-12-18",
      "headline": "G RAM G Bill that will replace MNREGA clears Lok Sabha amid Opposition protestsThe G RAM G Bill guarantees 125 days of rural employment per household and mandates state-level alignment within six months, with the Opposition accusing Centre of mistreating Mahatma Gandhi's legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-2025-live-updates-lok-sabha-rajya-sabha-discussions-pollution-delhi-air-quality-crisis-g-ram-g-bill-2837764-2025-12-18",
      "headline": "Live: SHANTI Bill is passed in Rajya Sabha, VB-G RAM G Bill tabled next in Upper HouseParliament Winter Session Live Updates: The Parliament has seen a hectic day so far, with the G RAM G bill getting the Lok Sabha nod before the House got adjourned for the day. The Rajya Sabha, meanwhile, remains functional for Day 14. This potentially means that a discussion on Delhi-NCR's worsening air quality that was scheduled to take place in Lok Sabha has been cancelled. It is not yet known whether it will happen tomorrow, which is also the final day of this year's winter session. Stay tuned and keep checking indiatoday.in for live updates on Parliament Winter Session 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/inside-philippines-hotel-room-bondi-beach-massacre-gunmen-holed-up-sajid-akram-naveed-sydney-mass-shooting-hanukkah-2837759-2025-12-18",
      "headline": "Room 315, fast food: What Bondi terrorists did in Philippines hotel for a monthThe two terrorists who killed 15 civilians at Australia's Bondi Beach travelled to the Philippines in November. For almost a month, Sajid Akram and his son Naveed spent most of the time in room 315 of GV Hotel in Davao city in southern Philippines. The room was sparsely furnished and hotel staff recount a quiet routine of the duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/dileep-bha-bha-ba-review-meta-comedy-fails-logic-madness-2837908-2025-12-18",
      "headline": "Bha Bha Ba review: No logic, no madness in Dileep's vile attempt at meta filmRelease Date:Thu Dec 18, 2025Bha Bha Ba movie review: Directed by Dhananjay Shankar, Bha Bha Ba, starring Dileep and Vineeth Sreenivasan, is an attempt at madcap comedy with numerous meta references. The film, however, feels more like Dileep asserting his innocence in the wake of his recent acquittal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-village-yavatmal-record-number-births-cyber-fraud-2837779-2025-12-18",
      "headline": "27,000 'births' in 3 months in this Maharashtra village of 1,500An investigation found that the birth and death registration system of the village in Maharashtra's Yavatmal had been compromised. The BJP said 99% of the names found in the entries belong to people from Bengal and Uttar Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/3-maoists-having-collective-reward-of-rs-7-lakh-gunned-down-in-encounter-in-chhattisgarhs-sukma-2838053-2025-12-18",
      "headline": "3 Maoists with Rs 7 lakh bounty gunned down in encounter in ChhattisgarhArms, explosives and Naxalite material were recovered, as police said sustained operations have weakened the Maoist network in Chhattisgarh. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nidhhi-agerwal-mobbed-the-raja-saab-song-launch-hyderabad-celebrity-safety-concerns-2837667-2025-12-18",
      "headline": "Worse than hyenas: Actor Nidhhi Agerwal swarmed by vulture-like crowd at eventActress Nidhhi Agerwal was mobbed while exiting The Raja Saab song launch in Hyderabad, leading to concern among fans and netizens about safety and event management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/over-2-lakh-giving-up-indian-citizenship-each-year-what-is-behind-the-exodus-to-usa-uk-canada-australia-explained-why-2837119-2025-12-18",
      "headline": "Over 2 lakh Indians giving up citizenship each year. What's behind the exodus?The Ministry of External Affairs told the Parliament that over nine lakh Indians have given up their citizenship in the last 5 years, with over 2 lakh per year since 2022. Why are Indians renouncing citizenship in record numbers?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-india-tour-unites-top-indian-athletes-memorable-sports-exchange-2837902-2025-12-18",
      "headline": "Watch: Messi rocks India cricket jersey, leaves fanboy Kuldeep Yadav star struckLionel Messi, donning the Indian cricket jersey, met some of the country's top athletes, including Kuldeep Yadav, Renuka Singh Thakur, Nikhat Zareen and para stars Sumit Antil and Nishad Kumar. Messi visited India on a much-publicised four-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/vineeth-sendilraj-mocked-for-how-he-drank-water-now-joining-musks-new-company-2838071-2025-12-18",
      "headline": "Mocked in smelly Indian meme, Vineeth Sendilraj now joins Musk's new AI ventureIndian-origin techie Vineeth Sendilraj, recently mocked online for how he drank water at a hackathon, has now joined Elon Musk's AI company xAI — a moment he calls \"full circle\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-beggars-news-deported-56000-menace-use-visa-restriction-islamabad-66000-stopped-from-flying-2837868-2025-12-18",
      "headline": "Saudi deports 56,000 Pak beggars as Pakistanis defy no-fly list to beg abroadDespite no-fly lists, deportations and visa curbs, Pakistani beggars have continued to fly to and attempt to, fly to Gulf nations, just to beg. Recently, Saudi Arabia has deported as many as 56,000 beggars, while authorities in Pakistan offloaded more than 66,000 passengers in 2025 to curb the organised begging gangs from immigrating abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/clat-2026-inside-the-strategy-that-helped-twin-brothers-get-air-2-and-8-2837891-2025-12-18",
      "headline": "Studied together, not competing: How twin brothers cracked CLAT 2026 with AIR 2, 8Twin brothers Argh and Parv Jain have emerged as standout performers in CLAT 2026, clinching AIR 8 and AIR 2 in one of the country's toughest law entrance exams. In an exclusive conversation with India Today, they share how collaboration, consistent reading, and calm decision-making shaped their journey to the top.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/condoms-to-make-pakistanis-sweat-as-imf-international-monetary-fund-rejects-gst-cut-plan-fiscal-budget-loan-2837923-2025-12-18",
      "headline": "Condoms to make Pakistanis sweat as IMF rejects GST-cut planThe IMF has rejected Pakistan's plea to cut the 18% GST on condoms and other contraceptives, saying tax relief can only be considered in the next budget. It has linked loans that Pakistan desperately needs to financial reforms.  But the GST decision keeps birth-control supplies expensive in a country battling high population growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-conferred-with-order-of-oman-by-sultan-haitham-bin-tarik-for-his-contributions-to-boosting-bilateral-ties-2837951-2025-12-18",
      "headline": "PM conferred with Oman's highest honour for his contributions to boosting tiesThis is the latest addition to PM Modi's distinguished list of over 28 highest civilian awards from foreign nations, including recent honours such as Ethiopia's Great Honour Nishan of Ethiopia and Kuwait's Order of Mubarak Al-Kabeer."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/sourav-ganguly-files-rs-50-crore-defamation-suit-over-messi-event-chaos-kolkata-2838062-2025-12-18",
      "headline": "Sourav Ganguly files Rs 50 crore defamation suit over Messi's Kolkata event claims Sourav Ganguly has taken legal action against Uttam Saha, president of the Argentina Fan Club of Kolkata, for allegedly making false and damaging statements about his involvement in the controversial Lionel Messi event at Yuva Bharati Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-nathan-lyon-reaction-surpasses-glenn-mcgrath-test-wickets-2838058-2025-12-18",
      "headline": "Nathan Lyon proud after surpassing childhood hero McGrath's Test wicket tally Australian off-spinner Nathan Lyon said he felt both humbled and proud after surpassing childhood hero Glenn McGrath's Test wicket tally during the ongoing Adelaide Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-creates-history-first-captain-to-hit-century-syed-mushtaq-ali-trophy-final-2838051-2025-12-18",
      "headline": "Ishan Kishan scripts history, becomes first captain to hit a century in SMAT final SMAT 2025 final: Ishan Kishan's blistering century lit up the SMAT 2025 final, powering a record stand with Kumar Kushagra and leaving Haryana's bowlers stunned in a high-octane title clash in Pune."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/pakistani-kabaddi-player-disciplinary-action-indian-team-bahrain-tournament-2838027-2025-12-18",
      "headline": "Pakistani kabaddi player faces disciplinary action for representing Indian team Pakistani international kabaddi player Ubaidullah Rajput has come under scrutiny after appearing for a team labelled as India at a private tournament in Bahrain, prompting the Pakistan Kabaddi Federation to call an emergency meeting to consider disciplinary action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-spotlight-isl-struggles-survival-indian-football-2838005-2025-12-18",
      "headline": "India celebrates Lionel Messi, but Indian football struggles for survival Messi's grand visit only underscored the harsh truth: India cheers for icons, not the sport itself, as domestic football crumbles under neglect, stalled leagues, and a system unwilling to reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-2025-final-live-score-haryana-vs-jharkhand-ishan-kishan-ankit-kumar-2837921-2025-12-18",
      "headline": "SMAT Live: Haryana (16/2 in 3 ov), Vikash's gives Jharkhand perfect start Syed Mushtaq Ali Trophy final, Haryana vs Jharkhand live score: Ishan Kishan's Jharkhand have set the biggest ever total in the history of SMAT Finals. Two blistering innings from Anukul Roy and Robin Minz take Jharkhand to 262/3 in 20 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-india-tour-unites-top-indian-athletes-memorable-sports-exchange-2837902-2025-12-18",
      "headline": "Watch: Messi rocks India cricket jersey, leaves fanboy Kuldeep Yadav star struck Lionel Messi, donning the Indian cricket jersey, met some of the country's top athletes, including Kuldeep Yadav, Renuka Singh Thakur, Nikhat Zareen and para stars Sumit Antil and Nishad Kumar. Messi visited India on a much-publicised four-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australias-disciplined-bowling-dominates-englands-ashes-hopes-fade-adelaide-test-2837870-2025-12-18",
      "headline": "Ashes slipping away after Australia give England a bowling masterclass: Hussain Nasser Hussain believes England's Ashes campaign is effectively over after a challenging second day at Adelaide, citing relentless Australian bowling and a lack of resilience from England's top order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-openers-tom-latham-devon-conway-record-partnership-third-test-2837873-2025-12-18",
      "headline": "NZ vs WI: New Zealand seize control as Latham and Conway produce record opening stand New Zealand finished the opening day of the third Test against West Indies at Bay Oval on 334-1, with Devon Conway unbeaten on 178 and Tom Latham making 137 in a stand that broke records and set the tone for the series decider."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/india-vs-sa-4th-t20i-abandoned-in-lucknow-fog-or-smog-ytvd-2837860-2025-12-18",
      "headline": "India vs SA 4th T20I Abandoned in Lucknow: Fog or Smog? In this special report, India Today Principal Correspondent Samarth Srivastava investigates the cancellation of the 4th T20I between India and South Africa in Lucknow. While the BCCI and UP government cited fog as the reason, opposition parties claim smog caused the poor visibility. Reporting from the Ekana Stadium, Srivastava demonstrates the low visibility conditions faced by players, highlighting the risks of injury. The report also touches on the political blame game and the disappointment of fans as the match was abandoned without a toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-review-kolkata-knight-riders-clarity-big-buys-problems-solved-cameron-green-matheesha-pathirana-2837854-2025-12-18",
      "headline": "KKR IPL 2026 auction: Kolkata get clarity, but are issues solved after big buys? IPL 2026 auction: KKR spent almost all of their purse and secured big buys in the form of Cameron Green and Matheesha Pathirana to emerge as potential title contenders for IPL 2026. But have the three-time champions really solved all their issues during the mini-auction?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-lucknow-t20i-fog-abandoned-rajiv-shukla-weather-concerns-future-scheduling-2837837-2025-12-18",
      "headline": "BCCI to factor in weather when scheduling: Rajiv Shukla amid backlash on Lucknow T20IIND vs SA: The Lucknow T20I washout triggered widespread fan anger over scheduling in winter conditions. BCCI vice-president Rajiv Shukla assured weather and pollution will be key factors in future planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-snicko-row-stokes-keeps-england-in-contest-2837834-2025-12-18",
      "headline": "Snicko row leaves England clinging on in Ashes contest despite Stokes' lone chargeThe Ashes, 3rd Test Day 2: Australia's dominance grew as Lyon's landmark double strike and a fragile English batting effort left Stokes fighting the lone fight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-jofra-archer-heated-exchange-ashes-test-adelaide-oval-2837803-2025-12-18",
      "headline": "Ben Stokes' heated exchange with Jofra Archer goes viral: Just bowl at stumpsA tense moment unfolded between England captain Ben Stokes and star bowler Jofra Archer during Day 2 of the third Ashes Test in Adelaide, as the pair engaged in a fiery exchange amidst a challenging start to the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-intercontinental-cup-matvey-safonov-super-sub-penalties-psg-vs-flamengo-2837815-2025-12-18",
      "headline": "Super sub Matvey Safonov shines as PSG goalkeeper seals Intercontinental Cup winBack-up goalkeeper Matvey Safonov delivered a night to remember for PSG. His penalty heroics sealed the Intercontinental Cup and crowned a historic season for the French champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-meets-india-womens-blind-cricket-team-world-cup-2837777-2025-12-18",
      "headline": "Sachin Tendulkar honours India's World Cup winning women's blind cricket teamLegendary cricketer Sachin Tendulkar met India's women's blind cricket team to honour their historic World Cup victory. India beat Nepal to clinch the inaugural women's world cup for the blind in Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-burns-dropped-internal-dispute-italy-cricket-axed-t20-world-cup-2026-2837766-2025-12-18",
      "headline": "Joe Burns axed from Italy's maiden T20 World Cup after internal dispute: ReportJoe Burns' shock omission from Italy's T20 World Cup 2026 squad has sparked controversy, with the former captain claiming he was pushed out after challenging cricket standards and off-field processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-snicko-controversy-jamie-smith-dismissal-ben-stokes-fuming-adelaide-test-2837756-2025-12-18",
      "headline": "Ashes Snicko controversy erupts again: Stokes left fuming at Jamie Smith's dismissalEngland were left fuming in Adelaide after Jamie Smith was controversially given out despite replays showing daylight between bat and ball, putting the Snicko technology under scrutiny in the third Ashes Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-pat-cummins-dismisses-joe-root-adelaide-test-record-overtakes-jasprit-bumrah-2837742-2025-12-18",
      "headline": "Pat Cummins scalps Joe Root again: Australia skipper goes past Bumrah in key battleAustralia skipper Pat Cummins struck early to dismiss England's Joe Root again in the Ashes. The Adelaide wicket took Cummins clear as the bowler to have removed England's batting star most times in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/monty-panesar-interview-on-steve-smith-ashes-2025-ben-stokes-2837726-2025-12-18",
      "headline": "Thanks to Steve Smith, he made me famous: Monty PanesarFormer England spinner Monty Panesar has taken another swipe at Australian batter Steve Smith, saying that Smith helped make him famous through their banter ahead of the Ashes 2025–26. Panesar had earlier suggested that the English media and fans should target Smith and remind him of his involvement in the Cape Town ball-tampering scandal. However, Smith responded by digging out an embarrassing video of Panesar's appearance on a quiz show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-on-ashes-2025-26-steve-smith-ben-stokes-shoaib-bashir-2837702-2025-12-18",
      "headline": "Winning Test series in Australia harder than getting Olympic gold: Monty PanesarMonty Panesar recently caught up with India Today.in to discuss what all has gone wrong for Ben Stokes and his men in the ongoing Ashes. He also touched upon his banter with Steve Smith and revealed why he feels winning in Australia is far more difficult than winning an Olympic Gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-nathan-lyon-test-wickets-record-glenn-mcgrath-throws-chair-reaction-adelaide-2837704-2025-12-18",
      "headline": "Watch: Glenn McGrath jokingly throws chair as Nathan Lyon surpasses his Test recordAustralia spinner Nathan Lyon moved past Glenn McGrath on the Test wickets list during the Ashes, Adelaide Test. McGrath's light-hearted reaction summed up the moment as Lyon climbed to sixth all-time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/smog-crisis-in-lucknow-t20-cricket-match-abandoned-due-to-poor-visibility-ytvd-2837700-2025-12-18",
      "headline": "India vs South Africa T20 Abandoned in Lucknow Due to Smog, Sparks Political RowA scheduled T20 cricket match between India and South Africa in Lucknow was abandoned without a ball being bowled due to excessive smog. The toss was delayed multiple times before officials called off the game citing poor visibility. The incident has sparked a political row, with opposition leaders criticizing the administration for the worsening air quality and suggesting alternative venues. The event highlights the growing environmental crisis affecting major cities beyond the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mushtaq-ali-trophy-2025-final-haryana-vs-jharkhand-live-streaming-2837687-2025-12-18",
      "headline": "SMAT 2025 final live streaming: All you need to know about Haryana vs JharkhandAfter a three-week contest, Haryana and Jharkhand will face off in the SMAT 2025 final in Pune. The summit clash will be played from 4:30 PM IST. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-alex-carey-snicko-controversy-bgg-statement-admits-technology-error-icc-reinstates-review-2837669-2025-12-18",
      "headline": "ICC reinstates England review after Alex Carey snicko controversy in Ashes: ExplainedA Snicko error turned day one of the Ashes Test into a technology debate. After England's protest, the ICC stepped in, reinstating a review and reopening questions over cricket's reliance on technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-handles-csk-auction-leak-accusations-humour-rebuttal-2837632-2025-12-18",
      "headline": "Ashwin accused of leaking CSK's IPL auction picks, spinner has a funny responseIPL auction 2026: Former spinner R Ashwin responded to trolls in his inimitable style after a few on social media accused him of leaking Chennai Super Kings auction picks before the five-time champions bought those players in Abu Dhabi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/video/lionel-messi-in-india-vantara-wildlife-centre-visit-anand-ambani-watch-video-2837665-2025-12-18",
      "headline": "Will surely visit again: Watch Lionel Messi's day at Anant Ambani's VantaraLionel Messi's India tour found a soulful pause at Vantara, where football met conservation. Guided by Anant Ambani, the global icon explored India's blend of tradition and modern wildlife care. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-copa-del-rey-vs-talavera-xabi-alonso-consistency-problem-2837662-2025-12-18",
      "headline": "Real Madrid still lacking consistency: coach Xabi Alonso after narrow Talavera winReal Madrid scraped past Talavera in the Copa del Rey but looked far from convincing. Xabi Alonso admitted his side still lack control and consistency despite progressing to the next round."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-injured-or-dropped-fans-reaction-troll-vice-captain-poor-form-2837659-2025-12-18",
      "headline": "Injured or dropped? Fans speculate broader reason for Shubman Gill's T20I absenceShubman Gill's injury ruled him out of the Lucknow T20I, but questions around his form lingered. With India hit by injuries, selection debates intensified as the series entered a decisive phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-lucknow-t20i-fog-smog-match-cancelled-2837637-2025-12-18",
      "headline": "What the smog! Visibility low, common sense lower in Lucknow T20I fiascoIND vs SA: Fans waited more than three hours during the India vs South Africa 4th T20I for a toss that never came. In Lucknow, the BCCI once again left spectators aggrieved in what many saw as a shameful handling of the situation."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}