{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-decision-live-news-updates-today-at-1130-pm-5-things-to-watch-out-2602214-2024-09-18",
      "headline": "US Fed rate decision today at 11:30 pm – 5 things to watch outMarkets are widely expecting a 25-basis-point cut in the key interest rate, marking the first reduction in four years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tupperware-files-for-bankruptcy-chapter-11-once-household-name-struggles-to-stay-afloat-2602163-2024-09-18",
      "headline": "Tupperware, once a household name, files for bankruptcyTupperware Brands and some of its subsidiaries filed for Chapter 11 bankruptcy protection on Tuesday. The company, widely known for its food storage containers, has been struggling with falling sales in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-details-how-to-invest-eligibility-criteria-online-buying-guide-2602103-2024-09-18",
      "headline": " NPS Vatsalya: How to invest, eligibility criteria, and online buying guideNPS Vatsalya enables parents or guardians to open a pension account for minors and contribute as little as Rs 1,000 annually, making it accessible to families from various economic backgrounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-profit-booking-us-fed-rate-cut-decision-explained-2602086-2024-09-18",
      "headline": "Explained: Why IT stocks faced profit booking ahead of US Fed rate decisionMphasiS led the decline, dropping 5.6%, followed by L&T Technology Services, Persistent Systems, Tata Consultancy Services, HCL Technologies, and Tech Mahindra, which saw losses ranging from 3% to 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-profit-booking-in-it-stocks-tcs-shares-fall-4-percent-2602047-2024-09-18",
      "headline": "Sensex, Nifty fall amid profit booking in IT stocks; TCS falls 4%The S&P BSE Sensex closed 131.43 points down at 82,948.23, whille the NSE Nifty50 lost 41 points to end at 25,377.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-shares-hit-20-upper-circuit-whats-next-2602045-2024-09-18",
      "headline": "Reliance Infra shares hit 20% upper circuit. What's next? The sharp uptick in Reliance Infra's share price followed the company's announcement of a significant reduction in its standalone external debt, from Rs 3,831 crore to Rs 475 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-cross-rs-700-for-the-first-time-since-january-more-room-to-rise-2602021-2024-09-18",
      "headline": "Paytm shares cross Rs 700 for the first time since January. More room to rise?\tBefore today, the last time Paytm traded above Rs 700 was in late January, closing at Rs 761."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-calls-sips-new-status-symbol-for-delhis-young-investors-2602010-2024-09-18",
      "headline": "Radhika Gupta calls SIPs the new status symbol for Delhi's young investorsRadhika Gupta, MD and CEO of Edelweiss Mutual Fund, believes that the true indicator of success in today's financial landscape should be how much one invests in Systematic Investment Plans (SIPs), not the number of real estate holdings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-assures-no-price-hikes-for-essential-commodities-wheat-rice-sugar-edible-oils-festive-season-2601992-2024-09-18",
      "headline": "Government assures no price hikes for essential commodities this festive seasonThe Ministry of Food and Consumer Affairs has highlighted that, as of now, there are no plans to allow any increase in prices for essentials items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-dip-after-multibagger-rally-buy-hold-or-sell-2601951-2024-09-18",
      "headline": "Bajaj Housing Finance shares dip after multibagger rally: Buy, hold, or sell?After a stellar market debut, Bajaj Housing Finance shares have dipped today—should investors be concerned or hold steady?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/west-bengal-gdp-decline-per-capita-income-eac-pm-working-paper-2601914-2024-09-18",
      "headline": "How West Bengal lost its crown as India's financial hubFrom economic powerhouse to struggling state, West Bengal's fall from its prime spot in India's financial scene tells a story of lost opportunity and shifting fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-likely-to-cut-it-sector-effect-key-stocks-to-watch-infosys-tech-mahindra-wipro-2601908-2024-09-18",
      "headline": "Infosys, TCS, Wipro: Key stocks to watch as US Fed gets ready to cut ratesHistorically, a Fed rate cut cycle has often signalled the end of a period of high demand for IT services exports, leading to an economic slowdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-all-time-high-after-early-dip-ola-electric-shares-up-4-percent-2601842-2024-09-18",
      "headline": "Sensex, Nifty hit all-time high after early dip; Ola Electric shares up 4%The S&P BSE Sensex added 188.33 points to 83,267.99, while the NSE Nifty50 gained 46.90 points to 25,465.45"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-yet-to-pay-rs-350-crore-in-tds-pf-of-employees-2601826-2024-09-18",
      "headline": "SpiceJet yet to pay Rs 350 crore in TDS, PF of employeesSpiceJet has not paid Rs 220 crore in TDS deductions from employees' salaries between April 2020 and August 2023 to tax authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-richest-and-poorest-states-south-leads-gdp-race-west-bengal-stumbles-2601807-2024-09-18",
      "headline": "India's richest and poorest states: South leads GDP race, West Bengal stumblesWhile the southern states have emerged as major contributors to India's GDP, states like West Bengal, once economically strong, have witnessed a puzzling decline, according to a working paper released by the Economic Advisory Council to the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-to-be-introduced-today-check-scheme-details-benefits-and-more-2601793-2024-09-18",
      "headline": "NPS Vatsalya to be introduced today: Check scheme details, benefits and moreThe scheme, announced during the Budget in July 2024, is designed for parents and guardians to make long-term investments for their minor children.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/centre-asks-edible-oil-industry-to-maintain-prices-amid-duty-hike-on-imports-2601782-2024-09-18",
      "headline": "Centre asks edible oil industry to maintain prices amid duty hike on importsThe leading edible oil associations were advised to ensure that the MRP of each type of oil is maintained until stocks imported at 0% and 12.5% BCD are exhausted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-ahead-of-us-feds-rate-decision-bajaj-finance-jumps-2601780-2024-09-18",
      "headline": "Sensex, Nifty open flat ahead of US Fed's rate decision; Bajaj Finance jumps The S&P BSE Sensex was up 27.55 points to 83,107.21 at 10:23 am, while the NSE Nifty50 rose 0.90 points to trade at 25,419.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-18-2024-yellow-metal-trades-higher-silver-records-dip-mcx-latest-rates-2601767-2024-09-18",
      "headline": "Gold, silver price today, September 18, 2024: Yellow metal trades higher, silver records dip on MCXGold Price Today 18 September 2024: Gold is trading on the higher side while silver rates have recorded a dip on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-guardian-in-talks-to-sell-observer-newspaper-to-tortoise-media-2601546-2024-09-17",
      "headline": "UK's Guardian in talks to sell Observer newspaper to Tortoise Media: ReportTortoise said negotiations include a commitment from it to invest more than 25 million pounds ($33 million) over the next five years in the editorial and commercial renewal of the title."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-devices-explode-lebanon-pager-blasts-beirut-israel-2602266-2024-09-18",
      "headline": "Hezbollah walkie-talkies explode in Lebanon day after pager blasts, 3 killedWalkie-talkie explosion In Lebanon: A day after the pager blasts sent Iran-backed Hezbollah into a disarray, hand-held radios used by the armed group exploded today. The radios were purchased by Hezbollah around the same time the pagers were bought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ernst-young-ey-employee-death-excessive-workload-anna-sebastian-perayil-2602217-2024-09-18",
      "headline": "EY India's 'healthy workplace' assurance after employee's death due to 'workload'Ernst & Young India reacted to the death of its 26-year-old employee due to \"excessive workload\" and said it would continue to find ways to provide a healthy workplace for its staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-nation-one-election-proposal-approved-cabinet-ram-nath-kovind-panel-narendra-modi-2601984-2024-09-18",
      "headline": "One Nation One Election cleared by Cabinet, bill in winter session likelyOne Nation One Election: The bill for holding simultaneous polls is likely to be introduced in the upcoming winter session of Parliament, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-assembly-election-first-phase-constituencies-voting-2601684-2024-09-18",
      "headline": "J&K Assembly polls see over 58% turnout, healthy voting in South Kashmir  Live UpdatesThe first phase of the Jammu and Kashmir Assembly elections on Wednesday saw 24 constituencies across seven districts voting for the first time in 10 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/acid-condoms-sunglass-bombs-story-of-israel-worst-intelligence-failure-mossad-aman-operation-suzanna-2601994-2024-09-18",
      "headline": "Acid condoms, sunglass-case bombs, and Israel's worst intelligence failureIsrael's famed intelligence agencies are synonymous with slick executions, under-the-radar operations, and a legendary spy network. But even Israel messes up sometimes. Like Egypt 1954."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tupperware-files-for-bankruptcy-chapter-11-once-household-name-struggles-to-stay-afloat-2602163-2024-09-18",
      "headline": "Tupperware, once a household name, files for bankruptcyTupperware Brands and some of its subsidiaries filed for Chapter 11 bankruptcy protection on Tuesday. The company, widely known for its food storage containers, has been struggling with falling sales in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-anwar-ali-ban-east-bengal-delhi-sc-high-court-verdict-future-2602269-2024-09-18",
      "headline": "What the future of Anwar Ali is after the latest Delhi HC verdict: ExplainedAnwar Ali's football future faces uncertainty as a legal battle unfolds over his controversial move from Mohun Bagan to East Bengal. With the Kolkata Derby approaching, his potential involvement now hinges on the AIFF's next steps and a crucial NOC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/mpox-case-in-kerala-malappuram-health-minister-2602179-2024-09-18",
      "headline": "Mpox case confirmed in Kerala, man who returned from UAE tests positiveKerala Health Minister Veena George said that the 38-year-old man, who returned from the UAE, is undergoing treatment in Malappuram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/ernst-and-young-india-pune-employee-death-social-media-outrage-big-4-culture-2602162-2024-09-18",
      "headline": "EY India employee's death unleashes social media storm over 'Big 4 culture'In a letter addressed to the head of EY India, Anna Sebastian Perayil's mother blamed \"excessive workload\" for her daughter's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/how-remnants-of-typhoon-yagi-are-raining-over-north-india-2602203-2024-09-18",
      "headline": "How remnants of Typhoon Yagi have travelled far to rain over IndiaThis rare occurrence has resulted in significant rainfall across Uttar Pradesh, Delhi, Haryana, and Uttarakhand, providing these regions with unexpected late monsoon showers.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-steals-brass-pot-from-shiva-temple-in-uttar-pradesh-kanpur-caught-on-cctv-footage-probe-on-2602167-2024-09-18",
      "headline": "On camera: Man offers prayers at Kanpur temple, then steals holy brass potIn Kanpur, a man was caught on CCTV stealing a brass pot from a Shiva temple after offering water. Police are investigating the matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-hezbollah-pagers-rigged-exploded-details-israel-mossad-lebanon-explainer-3-steps-detail-mossad-spy-agency-petn-explosive-2601913-2024-09-18",
      "headline": "How thousands of pagers were rigged, exploded: Decoded in 3 easy pointsThere was a possible supply chain poisoning in Europe whereby a tiny amount of explosive PETN was placed in around 5,000 pagers. They were remotely detonated in a synchronised attack. Here's the whole operation explained in three easy points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-opens-up-about-how-vicky-kaushal-helps-her-cope-with-insecurity-2602186-2024-09-18",
      "headline": "Katrina Kaif opens up about how Vicky Kaushal helps her cope with insecurityKatrina Kaif opened up about her husband's support during moments of self-doubt regarding her looks. She highlighted Vicky Kaushal's role in reminding her of self-acceptance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pagers-in-indian-movies-from-pappu-pager-to-gangs-of-wasseypur-to-pushpa-how-bollywood-had-blast-lebanon-hezbollah-2601935-2024-09-18",
      "headline": "From Pappu Pager to Pushpa, how India had a blast with pagersPagers, which connected the landline era to the cellphone age, were a blip in India's technology radar in the 90s. However, Bollywood had a blast with pagers, right from Satish Kaushik AKA Pappu Pager to Faizal Khan of Gangs of Wassepur and Allu Arjun of Pushpa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/woman-lawyer-train-ticket-attacks-tt-2602215-2024-09-18",
      "headline": "Video: Woman without train ticket attacks TTE after being forced to deboard, fleesVisuals from the train show the woman seated on a berth, responding evasively and giving nonsensical answers when asked for her ticket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashwini-vaishnaw-india-today-reporter-rohit-sharma-assault-rahul-gandhi-team-us-sam-pitroda-2602064-2024-09-18",
      "headline": "Congress needs to act: Centre on India Today reporter's assault in USMinister of Information and Broadcasting Ashwini Vaishnaw said he had received a memorandum from journalists seeking action over the assault on India Today's reporter Rohit Sharma in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/caught-by-taliban-iron-ore-train-ride-why-travellers-love-extreme-travel-2601089-2024-09-18",
      "headline": "Caught by Taliban, iron ore train ride: Why travellers love extreme travelFrom swimming with sharks to exploring remote parts of the Earth, experts have noted a clear rise in extreme travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-parties-union-cabinet-approval-one-nation-one-election-reactions-2602122-2024-09-18",
      "headline": "Political stunt, flop: Opposition after One Nation One Election gets Cabinet nodThe Opposition hit out at the BJP-led government over the Union Cabinet's approval of One Nation, One Election, accusing it of hatching a conspiracy to finish off regional parties and called the move a \"political stunt\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chandrayaan-4-isro-gets-cabinet-nod-to-go-to-moon-and-return-with-lunar-soil-rocks-2602026-2024-09-18",
      "headline": "Chandrayaan-4, Venus mission get Cabinet nod; big boost for GaganyaanChandrayaan-4 will build upon the success of Chandrayaan-3, which achieved a historic soft landing on the lunar surface. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/rapper-sean-diddy-combs-home-raided-1000-bottles-of-baby-oil-lubricants-seized-2601924-2024-09-18",
      "headline": "Rapper Sean 'Diddy' Combs's home raided: 1,000 bottles of baby oil seizedLegal documents have surfaced detailing serious allegations against Sean 'Diddy' Combs. The indictment stated that 1,000 bottles of baby oil were found in his home and it also accused him of maintaining a system of coercion, abuse, and violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-india-tour-2025-watch-teaser-2602170-2024-09-18",
      "headline": "Coldplay confirms India tour in 2025. Watch teaserColdplay has officially announced their India tour for 2025, marking their second performance in the country after 2016."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lt-governor-vk-saxena-atishi-delhi-chief-minister-swearing-in-ceremony-arvind-kejriwal-resign-2602057-2024-09-18",
      "headline": "Delhi Lt Governor proposes September 21 for Atishi's swearing-in as Chief MinisterAfter Arvind Kejriwal tendered his resignation as the Delhi Chief Minister, Lt Governor VK Saxena proposed September 21 as the date for the swearing-in of Chief Minister-designate Atishi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pagers-lebanon-hezbollah-exploded-killed-nine-people-which-countries-still-use-pagers-why-september-17-2601981-2024-09-18",
      "headline": "Which countries still use pagers and why?Thousands of pagers used by members of the Lebanon-based terrorist group Hezbollah exploded on September 17, killing nine people and injuring nearly 3,000. Pagers are obsolete devices but were used by Hezbollah to evade detection by Israeli agencies. However, several countries across the world still use pagers. Here's why."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/video-canadian-mp-jagmeet-singh-confronts-protesters-after-being-heckled-2601941-2024-09-18",
      "headline": "Video: Canadian MP Jagmeet Singh confronts protesters after being heckledNDP leader Jagmeet Singh confronted protesters outside the Canadian Parliament after someone accused him of being corrupted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/actor-colin-farrell-on-his-transformation-into-penguin-my-eyes-were-there-but-2602271-2024-09-18",
      "headline": "Actor Colin Farrell on his transformation into Penguin: My eyes were there, but…Colin Farrell's portrayal of Penguin in the upcoming HBO series on JioCinema Premium has fans buzzing. The series, set to premiere on 20 September, delves into the complex psychology of the iconic Gotham villain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/international-shows/story/shin-min-ah-no-gain-no-love-tops-ratings-chart-during-holiday-season-2602265-2024-09-18",
      "headline": "Shin Min-ah's No Gain No Love tops ratings chart during holiday seasonShin Min-ah and Kim Young-dae's No Gain No Love has topped ratings chart amid holiday season. The show is available to stream on Prime Video for Indian viewers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajendra-kumar-sabotaged-his-son-kumar-gaurav-career-and-mine-love-story-actor-vijayta-2602264-2024-09-18",
      "headline": "Rajendra Kumar sabotaged his son Kumar Gaurav's career: Love Story actor VijaytaActor Vijayta Pandit reflects on her career post-Love Story, the 1981 film starring Kumar Gaurav. She claims Rajendra Kumar had her removed from films, impacting both her and Kumar Gaurav's chances for success in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/prime-video-greenlights-ananya-pandays-call-me-bae-for-a-second-season-2602251-2024-09-18",
      "headline": "Ananya Panday's Call Me Bae renewed for a second seasonPrime Video renewed Ananya Panday's hit series Call Me Bae for a second season, promising more humour and emotional depth."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-coaching-musical-chair-continues-as-ricky-ponting-appointed-as-head-coach-2602275-2024-09-18",
      "headline": "PBKS coaching musical chair continues as Ricky Ponting appointed as head coachPBKS appointed Ricky Ponting as their head coach on a 4-year contract till 2028. He became the franchise's 6th head coach in last seven seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-anwar-ali-ban-east-bengal-delhi-sc-high-court-verdict-future-2602269-2024-09-18",
      "headline": "What the future of Anwar Ali is after the latest Delhi HC verdict: ExplainedAnwar Ali's football future faces uncertainty as a legal battle unfolds over his controversial move from Mohun Bagan to East Bengal. With the Kolkata Derby approaching, his potential involvement now hinges on the AIFF's next steps and a crucial NOC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-najmul-shanto-comments-2602253-2024-09-18",
      "headline": "Experienced Bangladesh do not get too emotional anymore: ShantoBangladesh captain Najmul Shanto said that his side are now a lot more mature and do not let emotions get the best of them. Shanto spoke in the press conference and said that his team believed that they can play good cricket in India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-live-streaming-when-and-where-to-watch-live-2602234-2024-09-18",
      "headline": "India vs Bangladesh 1st Test live streaming: When and where to watch liveIndia and Bangladesh for the 1st Test match at the MA Chidambaram Stadium in Chennai on September 19, Thursday. Find out all the live-streaming details of the much-anticipated contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-galle-test-day-1-kamindu-mendis-william-orourke-2602216-2024-09-18",
      "headline": "Record-breaker Kamindu Mendis steers Sri Lanka vs New Zealand on opening daySri Lanka (SL) vs New Zealand (NZ), 1st Test Day 1: Kamindu Mendis hit his fourth Test hundred, first in Sri Lanka, as the hosts went past 300 on a hard-fought day of Test cricket in Galle. Fast bowler William O'Rourke was the pick of the BlackCaps bowling unit on a spin-friendly surface. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-mehidy-hassan-shakib-al-hassan-taijul-islam-spinners-fare-2602202-2024-09-18",
      "headline": "Mehidy, Shakib, Taijul: How have Bangladeshi spinners fared in India in Tests?Bangladesh spinners Mehidy Hasan, Taijul Islam and veteran Shakib Al Hasan will be key if the visitors want to pose a challenge against India in the upcoming 2-match Test series. Here's a look at how the trio has fared so far in the subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-narrow-win-2022-kl-rahul-ravichandran-ashwin-shreyas-iyer-2602201-2024-09-18",
      "headline": "When India survived a massive Test scare against Bangladesh back in 2022As India prepares for their upcoming Test series against Bangladesh, Rohit Sharma's side will remember their narrow escape in the last encounter. A crucial partnership between R. Ashwin and Shreyas Iyer saved India from an unexpected defeat in Dhaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-predicted-playing-xi-axar-patel-kuldeep-yadav-chennai-2602192-2024-09-18",
      "headline": "India vs Bangladesh, 1st Test Predicted XI: Axar vs Kuldeep for 3rd spinner's spotIndia is all set to begin their new season with the first Test against Bangladesh in Chennai on September 19, Thursday. The Indian team is settled at the moment with the only point of discussion being the inclusion of a third spinner in the form of either Axar Patel or Kuldeep Yadav. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-head-to-head-hosts-aim-to-maintain-spotless-record-at-home-2602169-2024-09-18",
      "headline": "India vs Bangladesh head-to-head: Hosts aim to maintain spotless record at homeIndia vs Bangladesh: The 1st Test between the two nations will take place on September 19, Thursday. Let us have a look at the head-to-head record between the two teams in red-ball cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-stuttgart-antiono-rudiger-interrupts-bobby-endrick-2602156-2024-09-18",
      "headline": "Watch: Real Madrid's Rudiger interrputs 'Bobby' Endrick's interviewReal Madrid defender Antonio Rudiger playfully interrupted teammate Endrick's post-match interview, calling him \"Bobby\" after the 18-year-old scored his first UEFA Champions League goal in a 3-1 victory against Stuttgart, sealing a dream debut for the young forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-vs-bangladesh-press-conference-key-talking-points-2602151-2024-09-18",
      "headline": "Gautam Gambhir thoughtful and straightforward in first presser as Test coachSpeaking to the press in Chennai on Wednesday, India head coach Gautam Gambhir emphasised the importance of adaptability in Test cricket, cautioning against sticking to one playing style. He backed senior players like Rishabh Pant and KL Rahul while assuring young talents, Dhruv Jurel and Sarfaraz Khan, of continued opportunities in a long Test season. Gambhir also praised the impact of bowlers like Jasprit Bumrah and India's spin-bowling all-rounders, highlighting their crucial roles in the team's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-narrow-win-2022-kl-rahul-ravichandran-ashwin-shreyas-iyer-2602201-2024-09-18",
      "headline": "When India survived a massive Test scare against Bangladesh back in 2022As India prepares for their upcoming Test series against Bangladesh, Rohit Sharma's side will remember their narrow escape in the last encounter. A crucial partnership between R. Ashwin and Shreyas Iyer saved India from an unexpected defeat in Dhaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-predicted-playing-xi-axar-patel-kuldeep-yadav-chennai-2602192-2024-09-18",
      "headline": "India vs Bangladesh, 1st Test Predicted XI: Axar vs Kuldeep for 3rd spinner's spotIndia is all set to begin their new season with the first Test against Bangladesh in Chennai on September 19, Thursday. The Indian team is settled at the moment with the only point of discussion being the inclusion of a third spinner in the form of either Axar Patel or Kuldeep Yadav. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-head-to-head-hosts-aim-to-maintain-spotless-record-at-home-2602169-2024-09-18",
      "headline": "India vs Bangladesh head-to-head: Hosts aim to maintain spotless record at homeIndia vs Bangladesh: The 1st Test between the two nations will take place on September 19, Thursday. Let us have a look at the head-to-head record between the two teams in red-ball cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-stuttgart-antiono-rudiger-interrupts-bobby-endrick-2602156-2024-09-18",
      "headline": "Watch: Real Madrid's Rudiger interrputs 'Bobby' Endrick's interviewReal Madrid defender Antonio Rudiger playfully interrupted teammate Endrick's post-match interview, calling him \"Bobby\" after the 18-year-old scored his first UEFA Champions League goal in a 3-1 victory against Stuttgart, sealing a dream debut for the young forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-india-vs-bangladesh-press-conference-key-talking-points-2602151-2024-09-18",
      "headline": "Gautam Gambhir thoughtful and straightforward in first presser as Test coachSpeaking to the press in Chennai on Wednesday, India head coach Gautam Gambhir emphasised the importance of adaptability in Test cricket, cautioning against sticking to one playing style. He backed senior players like Rishabh Pant and KL Rahul while assuring young talents, Dhruv Jurel and Sarfaraz Khan, of continued opportunities in a long Test season. Gambhir also praised the impact of bowlers like Jasprit Bumrah and India's spin-bowling all-rounders, highlighting their crucial roles in the team's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-kamindu-mendis-continues-sensational-run-in-tests-scores-maiden-hundred-at-home-2602117-2024-09-18",
      "headline": "Kamindu Mendis continues sensational run in Tests, scores maiden hundred at homeKamindu Mendis continued with his impressive run in Tests as he notched up his 4th ton in red-ball cricket. He became the quickest to four centuries for Sri Lanka in Tests, within 11 innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-gautam-gambhir-bazball-dig-cricket-style-winning-2602112-2024-09-18",
      "headline": "Dig at Bazball? Gambhir says no one particular style of Test cricketIndia head coach Gautam Gambhir took a subtle swipe at England's aggressive \"Bazball\" approach, emphasizing that his team will focus on adaptability and winning, as they prepare for the two-match Test series against Bangladesh starting September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-chennai-pitch-weather-team-news-head-to-head-2602061-2024-09-18",
      "headline": "1st Test All you need to know: Chennai pitch, weather and team newsIndia vs Bangladesh 1st Test: India will kick off a long Test season as overwhelming favorites against Bangladesh in the first Test in Chennai, despite facing an improved and confident opposition. Bangladesh, buoyed by their recent 2–0 series win against Pakistan, is expected to provide a tougher challenge than usual for the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-appoint-ricky-ponting-as-head-coach-reaction-mohali-2602070-2024-09-18",
      "headline": "Coach Ricky Ponting says fans will see a much different PBKS going forwardCoach Ricky Ponting has promised that the fans will see a much different PBKS after taking charge of the franchise on September 18, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-carlos-alcaraz-alexander-zverev-team-europe-revenge-watch-2602052-2024-09-18",
      "headline": "Watch: Alcaraz, Zverev starring Team Europe eye 'revenge' in Laver CupTeam Europe stars like Carlos Alcaraz, Alexander Zverev, Stefanos Tsitsipas, and Daniil Medvedev starred in a special video for their Laver Cup campaign, announcing their aim to script revenge against Team World.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ricky-ponting-joins-punjab-kings-as-head-coach-2601979-2024-09-18",
      "headline": "Australia legend Ricky Ponting joins Punjab Kings as head coachIPL 2025: Ricky Ponting has been named head coach of the Punjab Kings (PBKS) ahead of the IPL 2025 season, just over two months after leaving the Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-final-india-vs-china-harmanpreet-singh-reaction-2602046-2024-09-18",
      "headline": "Harmanpreet Singh says 'sense of unity' helped in Asian Champions Trophy winHarmanpreet Singh has claimed that a sense of unity and deep camaraderie helped India win the Asian Champions Trophy final against China on September 17, Tuesday. India were able to retain their crown with the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-appoint-ricky-ponting-as-head-coach-reaction-mohali-2602070-2024-09-18",
      "headline": "Coach Ricky Ponting says fans will see a much different PBKS going forwardCoach Ricky Ponting has promised that the fans will see a much different PBKS after taking charge of the franchise on September 18, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-carlos-alcaraz-alexander-zverev-team-europe-revenge-watch-2602052-2024-09-18",
      "headline": "Watch: Alcaraz, Zverev starring Team Europe eye 'revenge' in Laver CupTeam Europe stars like Carlos Alcaraz, Alexander Zverev, Stefanos Tsitsipas, and Daniil Medvedev starred in a special video for their Laver Cup campaign, announcing their aim to script revenge against Team World.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ricky-ponting-joins-punjab-kings-as-head-coach-2601979-2024-09-18",
      "headline": "Australia legend Ricky Ponting joins Punjab Kings as head coachIPL 2025: Ricky Ponting has been named head coach of the Punjab Kings (PBKS) ahead of the IPL 2025 season, just over two months after leaving the Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-final-india-vs-china-harmanpreet-singh-reaction-2602046-2024-09-18",
      "headline": "Harmanpreet Singh says 'sense of unity' helped in Asian Champions Trophy winHarmanpreet Singh has claimed that a sense of unity and deep camaraderie helped India win the Asian Champions Trophy final against China on September 17, Tuesday. India were able to retain their crown with the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-training-reflects-his-ongoing-hunger-to-be-best-in-world-gambhir-2602017-2024-09-18",
      "headline": "Virat Kohli's training reflects his hunger to be best in world: Gautam GambhirGautam Gambhir hailed Virat Kohli's ongoing hunger to be the best in the world. The star batter will be back in red-ball action for the two-match Test series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/learn-and-adapt-theres-no-one-style-of-playing-test-cricket-gautam-gambhir-2602008-2024-09-18",
      "headline": "Learn and adapt, there's no one style of playing Test cricket: Gautam GambhirIndia vs Bangladesh: Speaking to the press on the eve of the first Test in Chennai, head coach Gautam Gambhir opened up about his style of coaching the Test team, the workload management issues and their road to the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-livingstone-becomes-iccs-no1-ranked-t20i-all-rounder-after-heroics-vs-aus-2601991-2024-09-18",
      "headline": "Liam Livingstone becomes ICC's No.1 ranked T20I all-rounder after heroics vs AUSLiam Livingstone's explosive all-round performance has propelled him to the top of the ICC Men's T20I all-rounder rankings. His consistent heroics with both bat and ball in the series against Australia secured him Player of the Series honours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-t20i-retirement-joke-world-cricket-candid-interview-2601999-2024-09-18",
      "headline": "Rohit Sharma firm on T20I decision: 'Retirement has become a joke in cricket'Rohit Sharma ruled out any chance of returning to T20I cricket, stating that his decision to retire from the format after the T20 World Cup triumph is final. However, he continues to play in both ODI and Test cricket."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}