{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-ceo-elon-musk-warns-microsoft-bill-gates-tesla-could-bankrupt-microsoft-ceo-if-2649458-2024-12-13",
      "headline": "Bill Gates to go bankrupt? Tesla CEO Elon Musk explains howElon Musk claims Bill Gates could face bankruptcy over his alleged Tesla short position if the company dominates globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uncovered-network-suspected-scam-sites-lure-dabba-traders-2649508-2024-12-13",
      "headline": "Uncovered: Network of suspected scam sites lure 'dabba' tradersIndia Today uncovers a web of suspected scammer sites posing as platforms for the \"dabba\" stock trade, an illegal practice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-mocks-us-securities-exchange-commission-sec-chair-gary-gensler-neuralink-twitter-stock-deals-2649382-2024-12-13",
      "headline": "Oh Gary, how could you: Elon Musk mocks US body amid Twitter stock probeA letter from Elon Musk's attorney, Alex Spiro, addressed to outgoing US Securities and Exchange Commission (SEC) Chair Gary Gensler, alleged that the agency gave Musk a 48-hour ultimatum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-stock-market-update-sensex-nifty-rebound-to-end-higher-fmcg-it-stocks-lead-recovery-2649434-2024-12-13",
      "headline": "Sensex, Nifty rebound to end higher; FMCG and IT stocks lead recoveryThe S&P BSE Sensex gained 843.16 points to close at 82,133.12, while the NSE Nifty50 added 219.60 points to end at 24,768.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-key-amendments-now-faster-claims-and-more-interest-benefits-for-members-2649307-2024-12-13",
      "headline": "EPFO key amendments: Now faster claims and more interest benefits for membersEPFO's amendments focus on reducing delays, quicker claims, and better interest benefits for its members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-700-points-3-reasons-behind-todays-market-volatility-market-crash-2649394-2024-12-13",
      "headline": "Sensex gains 700 points: 3 reasons behind stock market volatility todayStock market rebound: The S&P BSE Sensex was up 730.39 points to 82,020.35, while the NSE Nifty50 gained 192.70 points to 24,741.40, as of 3 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-ipo-listing-date-share-price-latest-gmp-suggest-strong-market-debut-amid-heavy-demand-2649376-2024-12-13",
      "headline": "Mobikwik IPO listing: Does GMP suggest strong market debut amid heavy demand?Mobikwik IPO has seen very strong demand among investors and was fully booked within the first hour of opening for subscription. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-back-in-green-airtel-hul-it-stocks-tcs-lead-market-rebound-nifty-market-update-2649289-2024-12-13",
      "headline": "Sensex back in green: Airtel, HUL, and IT stocks lead market rebound As of 12:52 PM, Sensex was up by 111.46 points to 81,401.42, while Nifty50 gained 12.75 points to 24,561.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-last-day-to-apply-check-latest-gmp-subscription-status-shoud-you-subscribe-2649260-2024-12-13",
      "headline": "Vishal Mega Mart IPO last day: Check gmp, subscription. Shoud you subscribe?Vishal Mega Mart IPO has set a price range of Rs 74 to Rs 78 per share. Retail investors need to purchase a minimum of 190 shares in a single lot, requiring an initial investment of Rs 14,820."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/akasa-air-minority-stake-azim-premji-ranjan-pai-in-talks-business-deal-aviation-report-2649237-2024-12-13",
      "headline": "Azim Premji, Ranjan Pai to buy a minority stake in Akasa Air: ReportAzim Premji and Ranjan Pai family offices acquired a minority stake in Akasa Air as part of a $130-140 million fundraising round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-a-credit-score-over-800-matters-personal-finance-cheaper-insurance-premium-lower-loan-interest-rate-better-credit-card-offers-2649226-2024-12-13",
      "headline": "Explained: Why a credit score over 800 mattersHigh credit scores boost financial health by offering cheaper loans, and better insurance discounts, amongst others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-december-13-2024-precious-metals-witness-dip-on-mcx-latest-rates-2649221-2024-12-13",
      "headline": "Gold, silver price today, December 13, 2024: Precious metals witness dip on MCXGold Price Today December 13, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-reason-key-factors-behind-stock-market-weakness-crash-fii-selling-weak-rupee-2649209-2024-12-13",
      "headline": "Sensex falls 1,000 points: Key factors behind stock market weaknessStock market crash: As of 10:37 AM, the Sensex was down 1,064.37 points to 80,225.59, while Nifty was also struggling below 24,300 losing 332.10 points to 24,216.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-tank-crash-in-early-trade-inflation-relief-fails-to-lift-market-mood-steel-baking-stocks-2649199-2024-12-13",
      "headline": "Sensex, Nifty tank in early trade; inflation relief fails to lift market moodThe S&P BSE Sensex was down 540.09 points to 80,749.87, while the NSE Nifty50 lost 160.35 points to 24,388.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahila-samman-yojana-all-you-need-to-know-about-delhi-rs-1000-scheme-2648850-2024-12-12",
      "headline": "Mahila Samman Yojana: Key details about Rs 1000 schemeThe AAP government announced Mahila Samman Yojana, offering Rs 1000 monthly to women in Delhi, with a rise to Rs 2100 if it wins in the upcoming elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-cools-to-548-in-november-from-621-in-october-2648835-2024-12-12",
      "headline": "Retail inflation cools to 5.48% in November from 6.21% in OctoberHouseholds across the world's most populous country are likely to welcome the inflation relief, given that food expenses dominate many family budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-dip-ahead-of-inflation-data-bearish-trend-persists-fmcg-banking-stocks-decline-2648821-2024-12-12",
      "headline": "Sensex, Nifty end lower ahead of inflation data; bearish trend persistsThe S&P BSE Sensex lost 236.18 points to close at 81,289.96, while the Nifty50 was down 93.10 points to end at 24,548.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/advance-tax-deadline-on-december-15-sunday-what-happens-if-you-miss-third-instalment-2648773-2024-12-12",
      "headline": "December 15 advance tax deadline: What you need to knowTaxpayers with liabilities exceeding Rs 10,000 are required to make quarterly advance tax payments to avoid penalties and interest charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/corporate-private-sector-companies-4x-profit-salaries-wages-stagnant-inflation-high-cea-nageswaran-2648775-2024-12-12",
      "headline": "Corporates see 4x profit but keep salaries stagnant: ReportPrivate companies in India have seen their profits hit a 15-year high but failed to give wages that could even beat inflation, shows a report. Despite making 4X profits in four years, the lower spending on wages is not just adding pressure on households, but hitting India's economic growth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-high-court-grants-interim-bail-to-allu-arjun-hours-after-local-court-sends-him-to-14-day-jail-in-stampede-case-2649471-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun gets interim bail, High Court says an actor too has right to life Live UpdatesAllu Arjun case: Allu Arjun has been granted interim bail for a period of four weeks. The Telangana High Court said Arjun, despite being an actor, had the right to life and liberty as a citizen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/centre-raises-concern-with-canada-over-murders-of-3-indian-students-2649492-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre raises concern with Canada over murders of 3 Indian studentsThe government called the murders of three Indian students in Canada \"unfortunate tragedies\" and extended condolences to the victims' families."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-atul-subhash-suicide-wife-nikita-singhania-police-notice-2649459-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru techie's wife gets police notice, asked to record statement in 3 daysBengaluru police have issued a notice to the wife of the Bengaluru-based techie, Atul Subhash, who died by suicide earlier this week alleging harassment by his in-laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/pushpa-2-allu-arjun-arrest-stampede-sandhya-70-mm-theatre-why-crowd-hyderabad-history-2649390-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Hyderabad's Sandhya 70MM Theatre is iconic, attracted Allu Arjun for Pushpa2Telugu star Allu Arjun was on Friday arrested over a stampede at Hyderabad's Sandhya 70 MM theatre on December 4. A woman was killed in the stampede as stars arrived for Pushpa 2.0 premiere. This is what makes Hyderabad's Sandhya theatre, which carries a legacy of drawing large crowds and celebrities, special."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/jeff-bezos-visits-vikas-khanna-new-york-restaurant-bungalow-was-like-a-pilgrimage-2649512-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jeff Bezos describes visit to Vikas Khanna's US restaurant Bungalow as a 'pilgrimage'Amazon founder Jeff Bezos visited celebrated chef Vikas Khanna's restaurant Bungalow in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/agenda-aaj-tak-kalli-puri-welcome-address-aaj-tak-peoples-lives-platform-2649235-2024-12-13?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Aaj Tak is part of people's lives, platform for all: Kalli Purie\"Being a leader means always doing something new, envisioning new dreams, and taking new leaps. We strive not just to present the news but also to bring forth stories that can make our country and society better,\" Kalli Purie said during. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/syria-assad-regime-isis-threat-kerala-syrian-christians-hundu-customs-st-thomas-sindoor-mangalsutra-aramaic-2649291-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Kerala's Syrian Christians melded sindoor, mangalsutra with Syria's customsIn contrast to Christians in Syria facing existential fear after the fall of the Bashar al-Assad regime, the Syrian Christians of Kerala, one of the oldest Christian communities in India, have thrived. The Syrian Christians, who came to India 1,300 years before the Portuguese and British, blended Hindu customs with Christian rituals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allu-arjun-arrested-stampede-victim-husband-says-ready-to-withdraw-case-sandhya-theatre-incident-pushpa-2-2649453-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun not at fault for stampede, ready to withdraw case: Victim's husbandFollowing Allu Arjun's arrest, the stampede victim's husband said he was ready to take back the case. The victim's husband said he didn't hold the actor responsible for the December 4 stampede that killed his wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-did-everything-for-me-ready-to-undergo-rehab-vinod-kambli-2649426-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vinod Kambli on relationship with Sachin: 'I felt he didn't help me, truth is...'Former India batter Vinod Kambli revealed how Sachin Tendulkar has been a pillar of support during his toughest times, addressing misconceptions about their relationship.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/emmanuel-macron-announces-francois-bayrou-new-prime-minister-of-france-2649467-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Emmanuel Macron announces Francois Bayrou as new Prime Minister of FranceFrench President Emmanuel Macron on Friday named Francois Bayrou his third Prime Minister of 2024, tasking the veteran centrist with steering the country out of its second major political crisis in the last six months."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-reacts-allu-arjun-sandhya-theatre-stampede-arrest-interim-bail-2649478-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pushpa 2 co-star Rashmika Mandanna's first reaction to Allu Arjun's arrestRashmika Mandanna reacted to Allu Arjun's arrest, expressing her disappointment. She wrote, \"Can't believe what I am seeing.\" Meanwhile, Allu Arjun has been granted interim bail in the Sandhya Theatre stampede case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tamil-or-telugu-gukesh-dommaraju-claimed-as-own-by-tn-chief-minister-mk-stalin-andhra-pradesh-cm-chandrababu-naidu-2649257-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil or Telugu? A tug-of-war over Gukesh, the new world chess championGukesh Dommaraju's historic World Chess Championship win ignited a fierce debate over his Tamil-Telugu origins, with Andhra Pradesh and Tamil Nadu chief ministers vying to claim the 18-year-old prodigy as their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-on-taking-break-from-work-2649420-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vikrant Massey on taking break from work: Wanted to live my lifeActor Vikrant Massey recently opened up about taking a break from movies. Vikrant said he decided to share that viral social media post as he wanted to focus on his personal life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allu-arjuns-lawyer-draws-parallel-to-shah-rukh-khans-raees-stampede-case-2649465-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun's lawyer draws parallel to Shah Rukh Khan's Raees stampede caseIn a court hearing on Allu Arjun's interim bail, his counsel defended him against culpable homicide charges related to the 'Pushpa 2' stampede, citing unclear police instructions and a precedent from Shah Rukh Khan's case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/allu-arjun-arrest-pushpa-2-premiere-sandhya-theatre-70-mm-hyderabad-telangana-police-lapse-overapplying-law-2649415-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun arrest: Is police overapplying law to cover up own lapses?Actor Allu Arjun was arrested by the Telangana Police on Friday over the stampede during the premiere of Pushpa 2: The Rise on December 4. Sandhya 70 MM Theatre had informed police in advance about his visit. He was arrested, remanded in judicial custody, and provided relief in 5 hours. Is this a case of overapplication of law by police to cover up their own lapses?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/how-can-india-battle-with-travis-head-ache-at-gabba-adam-gilchrist-reveals-2649457-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How India can battle Travis Head-ache at Gabba? What Adam Gilchrist saysAdam Gilchrist revealed how India can deal with the Travis Head threat at the Gabba. The Australian boasts of a great record at The Gabba, but scored three ducks in his last outing.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/mismatched-3-review-prajakta-koli-rohit-saraf-netflix-2649423-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mismatched 3 review: No surprises, just feel-good vibesReleased-Fri Dec 13, 2024Mismatched season 3 delivers the same feel-good charm with romantic clichés, warm moments, and character growth. While predictable, it's soothing and bingeworthy, though the soundtrack disappoints."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-sp-leaders-discordant-note-on-uddhav-sena-is-fresh-sign-of-fissures-in-mva-2648673-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why SP leader's discordant note on Uddhav Sena is fresh sign of fissures in MVAAbu Asim Azmi, the Samajwadi Party's Maharashtra president, doubts his party's continuance in the MVA should the Sena (UBT) return to hardline Hindutva after electoral reverses\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-allu-arjun-heard-telling-cops-during-arrest-pushpa-2-screening-stampede-hyderabad-theatre-2649412-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Wanted to change my clothes, but...': Allu Arjun to cops during arrestTelugu actor Allu Arjun was arrested on Friday from his residence in connection with the stampede at the premiere of his film 'Pushpa 2: The Rule'. A video of him talking to police during the arrest surfaced."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-arrested-in-pushpa-2-stampede-case-will-it-affect-pushpa-2-record-breaking-run-2649357-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Allu Arjun arrested in stampede case: Will it affect Pushpa 2's smashing run?Actor Allu Arjun was arrested in connection with the Sandhya Theatre stampede case, which claimed the life of a 39-year-old woman named Revathi. Will the actor's arrest affect the record-breaking run of Pushpa 2?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/bandish-bandits-2-review-ritwik-bhowmik-shreya-chaudhry-anand-tiwari-2649192-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bandish Bandits 2 review: A perfect symphony of drama and musicReleased-Fri Dec 13, 2024Anand Tiwari's series, Bandish Bandits 2, featuring Ritwik Bhowmik and Shreya Chaudhry is now streaming on Prime Video. With a compelling narrative and enriched character arcs, it offers fans a gratifying sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-mocks-us-securities-exchange-commission-sec-chair-gary-gensler-neuralink-twitter-stock-deals-2649382-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oh Gary, how could you: Elon Musk mocks US body amid Twitter stock probeA letter from Elon Musk's attorney, Alex Spiro, addressed to outgoing US Securities and Exchange Commission (SEC) Chair Gary Gensler, alleged that the agency gave Musk a 48-hour ultimatum. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-immigration-customs-enforcement-ice-deportation-list-donald-trump-indians-list-around-18000-undocumented-immigrants-2649243-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18,000 Indians on first deportation list as Trump vows tough actionThe US Immigration and Customs Enforcement (ICE) has compiled a list of approximately 1.5 million individuals marked for deportation, including nearly 18,000 undocumented Indian nationals, as part of US President-elect Donald Trump's plan to carry out the largest deportation in American history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-revanth-reddy-on-allu-arjun-arrest-pushpa-2-screening-hyderabad-sandhya-theatre-2649402-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nobody will intervene in this matter: Revanth Reddy on Allu Arjun's arrestTelangana Chief Minister Revanth Reddy assured a fair investigation after Telugu superstar Allu Arjun was arrested over a stampede at the 'Pushpa 2' premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-urges-fans-to-watch-raj-kapoors-films-in-theatres-dont-miss-the-opportunity-2649480-2024-12-13",
      "headline": "Big B urges fans to watch Raj Kapoor's films in theatres: Don't miss the opportunityAmitabh Bachchan remembered Raj Kapoor on the occasion of his 100th birth anniversary. He also urged fans to watch Raj Kapoor's films during the ongoing Raj Kapoor film festival. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-reacts-allu-arjun-sandhya-theatre-stampede-arrest-interim-bail-2649478-2024-12-13",
      "headline": "Pushpa 2 co-star Rashmika Mandanna's first reaction to Allu Arjun's arrestRashmika Mandanna reacted to Allu Arjun's arrest, expressing her disappointment. She wrote, \"Can't believe what I am seeing.\" Meanwhile, Allu Arjun has been granted interim bail in the Sandhya Theatre stampede case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-shares-how-priyanka-chopras-bollywood-journey-captivated-him-2649295-2024-12-13",
      "headline": "Nick Jonas shares how Priyanka Chopra's Bollywood journey captivated him Nick Jonas expressed his admiration for Priyanka Chopra's Bollywood legacy during the Red Sea Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/pushpa-2-allu-arjun-arrest-stampede-sandhya-70-mm-theatre-why-crowd-hyderabad-history-2649390-2024-12-13",
      "headline": "Why Hyderabad's Sandhya 70MM Theatre is iconic, attracted Allu Arjun for Pushpa2Telugu star Allu Arjun was on Friday arrested over a stampede at Hyderabad's Sandhya 70 MM theatre on December 4. A woman was killed in the stampede as stars arrived for Pushpa 2.0 premiere. This is what makes Hyderabad's Sandhya theatre, which carries a legacy of drawing large crowds and celebrities, special."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rahane-revives-t20-career-with-smat-performance-makes-kkr-selection-a-steal-2649522-2024-12-13",
      "headline": "Rahane revives T20 career with SMAT performance, makes KKR selection a steal Ajinkya Rahane has been in red-hot form in the ongoing Sayed Mushtaq Ali Trophy for Mumbai. The top run-scorer in the domestic tournament might have made KKR's selection a steal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-gukesh-dommaraju-viswanathan-anand-chess-capital-chennai-system-2649485-2024-12-13",
      "headline": "D Gukesh: How chess capital Chennai gifted India another world chess championD Gukesh's 2024 World Chess Championship victory underscores the flourishing chess culture in Chennai, driven by passionate institutions and Grandmasters who are willing to give back to the community. The city's rich chess legacy, enhanced by modern academies and initiatives like the Westbridge Anand Chess Academy, has positioned Tamil Nadu as a powerhouse of Indian chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/meet-83-year-old-dr-ramesh-50-marathons-done-aims-to-run-till-age-of-100-2649475-2024-12-13",
      "headline": "Fifty races done, 83-year-old marathoner Ramesh aims to run till age of 100Dr. Ramesh, at the age of 83, has completed 50 marathons and continues to inspire with his dedication to fitness and holistic living. His daily routine, which includes yoga, spiritual practices, and teaching wellness, motivates others to lead a healthy lifestyle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-magnus-carlsen-d-gukesh-title-clash-circus-2649472-2024-12-13",
      "headline": "Not part of this circus anymore: Carlsen rules out title clash with GukeshMagnus Carlsen, the five-time champion, said that he would not be a part of the world chess championships. The Norwegian star also praised D Gukesh for becoming the youngest world champion at the age of 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-3rd-test-live-streaming-when-and-where-to-watch-live-2649474-2024-12-13",
      "headline": "Australia vs India 3rd Test: When and where to watch live, India timingsIndia and Australia will clash in the 3rd Test at The Gabba in Brisbane on December 14, Saturday. Find out the live-streaming details of the high-octane clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-mumbai-indians-appoint-new-fielding-coach-carl-hopkinson-2649314-2024-12-13",
      "headline": "Mumbai Indians hire World Cup-winning fielding coach Carl HopkinsonIPL 2025: Mumbai Indians announced the appointment of fielding coach Carl Hopkinson on December 13. Hopkinson was part of the England men's team, which won the ODI World Cup in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/how-can-india-battle-with-travis-head-ache-at-gabba-adam-gilchrist-reveals-2649457-2024-12-13",
      "headline": "How India can battle Travis Head-ache at Gabba? What Adam Gilchrist saysAdam Gilchrist revealed how India can deal with the Travis Head threat at the Gabba. The Australian boasts of a great record at The Gabba, but scored three ducks in his last outing.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-promise-trophy-video-2649452-2024-12-13",
      "headline": "Watch: Gukesh lifts Championship trophy after fulfilling photoshoot promise India's D Gukesh fulfilled his promise of lifting the World Chess Championship trophy at the closing ceremony in Singapore. On Thursday, Gukesh beat Ding Liren 7.5-6.5 to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marnus-labuschagne-hits-back-david-warner-australia-vs-india-gabba-2649446-2024-12-13",
      "headline": "Marnus Labuschagne hits back at David Warner: Everyone's here to write articlesBorder-Gavaskar Trophy: Australia batter Marnus Labuschagne has responded after David Warner questioned the 30-year-old's return to form following his half-century in Adelaide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-ding-liren-vs-gukesh-russia-federation-chief-accusation-2649441-2024-12-13",
      "headline": "Did Ding Liren lose World Championship on purpose? Russia demands FIDE probeChess World Championship 2024: Russian Chess Federation chief Andrei Filatov accused Ding Liren of losing the title match deliberately and called an investigation into the decisive moments of Game 14 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/how-can-india-battle-with-travis-head-ache-at-gabba-adam-gilchrist-reveals-2649457-2024-12-13",
      "headline": "How India can battle Travis Head-ache at Gabba? What Adam Gilchrist saysAdam Gilchrist revealed how India can deal with the Travis Head threat at the Gabba. The Australian boasts of a great record at The Gabba, but scored three ducks in his last outing.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-promise-trophy-video-2649452-2024-12-13",
      "headline": "Watch: Gukesh lifts Championship trophy after fulfilling photoshoot promise India's D Gukesh fulfilled his promise of lifting the World Chess Championship trophy at the closing ceremony in Singapore. On Thursday, Gukesh beat Ding Liren 7.5-6.5 to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marnus-labuschagne-hits-back-david-warner-australia-vs-india-gabba-2649446-2024-12-13",
      "headline": "Marnus Labuschagne hits back at David Warner: Everyone's here to write articlesBorder-Gavaskar Trophy: Australia batter Marnus Labuschagne has responded after David Warner questioned the 30-year-old's return to form following his half-century in Adelaide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-ding-liren-vs-gukesh-russia-federation-chief-accusation-2649441-2024-12-13",
      "headline": "Did Ding Liren lose World Championship on purpose? Russia demands FIDE probeChess World Championship 2024: Russian Chess Federation chief Andrei Filatov accused Ding Liren of losing the title match deliberately and called an investigation into the decisive moments of Game 14 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-hardik-asks-security-to-treat-intruders-kindly-in-smat-crowd-cheers-2649429-2024-12-13",
      "headline": "Watch: Hardik asks security to treat intruders kindly in SMAT, crowd cheersDuring the Sayed Mushtaq Ali semifinal, Hardik Pandya's compassionate gesture stole the show. He asked security to handle pitch invaders gently, earning cheers from the crowd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-did-everything-for-me-ready-to-undergo-rehab-vinod-kambli-2649426-2024-12-13",
      "headline": "Vinod Kambli on relationship with Sachin: 'I felt he didn't help me, truth is...'Former India batter Vinod Kambli revealed how Sachin Tendulkar has been a pillar of support during his toughest times, addressing misconceptions about their relationship.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-imad-wasim-pakistan-cricket-retirement-2649425-2024-12-13",
      "headline": "Pakistan's Imad Wasim retires from international cricket, againPakistan all-rounder Imad Wasim pulled the curtains down on his international career. The 35-year-old last represented Pakistan in the Men's T20 World Cup clash against Ireland back in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ajinkya-rahane-98-mumbai-beat-baroda-to-reach-smat-final-2649406-2024-12-13",
      "headline": "Run machine Ajinkya Rahane decimates Baroda, powers Mumbai to finalAjinkya Rahane continued his stellar form in the Syed Mushtaq Ali Trophy semifinals, smashing a brilliant 98 off 55 balls to lead Mumbai to the final. Mumbai comfortably chased down Baroda's 158/7 with 16 balls and six wickets in hand.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ding-liren-bug-house-chess-unwind-world-chess-championship-loss-d-gukesh-2649400-2024-12-13",
      "headline": "How did Ding Liren unwind after heartbreaking loss to D GukeshDing Liren found solace in Bughouse Chess, a team-based variation, shortly after his World Chess Championship loss to D Gukesh, showcasing his enduring love for the game and resilience despite the heartbreaking defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-brisbane-test-prediction-rohit-sharma-tough-call-gabba-pitch-2649381-2024-12-13",
      "headline": "Under-fire Rohit Sharma in focus as Australia aim to reclaim fortress GabbaBorder-Gavaskar Trophy 2024: Captain Rohit Sharma will aim to silence his critics as India return to the Gabba, the venue of their iconic 2021 triumph. Meanwhile, Australia, buoyed by their dominant 10-wicket victory in Adelaide, will look to secure the series lead in Brisbane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mk-stalin-tamil-nadu-du-gukesh-cash-prize-five-crore-world-chess-championship-ding-liren-2649370-2024-12-13",
      "headline": "Tamil Nadu announces Rs 5 crore cash prize for World Champion D GukeshTamil Nadu Chief Minister MK Stalin announced a Rs 5 crore reward for D Gukesh for his World Chess Championship triumph. The 18-year-old defeated China's Ding Liren to become the youngest world champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-mother-padmakumari-reaction-chess-world-championship-title-2649365-2024-12-13",
      "headline": "Cried for 10 minutes after Gukesh won World Championship: Chess star's motherNew World Chess Champion D. Gukesh's mother, J. Padmakumari, revealed she could not control her tears after learning that her son had defeated Ding Liren to win the title in Singapore on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ding-liren-bug-house-chess-unwind-world-chess-championship-loss-d-gukesh-2649400-2024-12-13",
      "headline": "How did Ding Liren unwind after heartbreaking loss to D GukeshDing Liren found solace in Bughouse Chess, a team-based variation, shortly after his World Chess Championship loss to D Gukesh, showcasing his enduring love for the game and resilience despite the heartbreaking defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-brisbane-test-prediction-rohit-sharma-tough-call-gabba-pitch-2649381-2024-12-13",
      "headline": "Under-fire Rohit Sharma in focus as Australia aim to reclaim fortress GabbaBorder-Gavaskar Trophy 2024: Captain Rohit Sharma will aim to silence his critics as India return to the Gabba, the venue of their iconic 2021 triumph. Meanwhile, Australia, buoyed by their dominant 10-wicket victory in Adelaide, will look to secure the series lead in Brisbane. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mk-stalin-tamil-nadu-du-gukesh-cash-prize-five-crore-world-chess-championship-ding-liren-2649370-2024-12-13",
      "headline": "Tamil Nadu announces Rs 5 crore cash prize for World Champion D GukeshTamil Nadu Chief Minister MK Stalin announced a Rs 5 crore reward for D Gukesh for his World Chess Championship triumph. The 18-year-old defeated China's Ding Liren to become the youngest world champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-mother-padmakumari-reaction-chess-world-championship-title-2649365-2024-12-13",
      "headline": "Cried for 10 minutes after Gukesh won World Championship: Chess star's motherNew World Chess Champion D. Gukesh's mother, J. Padmakumari, revealed she could not control her tears after learning that her son had defeated Ding Liren to win the title in Singapore on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-predicted-xi-gabba-test-harshit-akash-deep-ashwin-jadeja-2649333-2024-12-13",
      "headline": "India predicted XI for Gabba Test: Will Harshit make way for Akash Deep?Border-Gavaskar Trophy, Gabba Test: India are likely to make a couple of changes in the bowling department for the third Test after the crushing 10-wicket loss to Australia in the Pink-ball Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-anniversary-post-ritika-sajdeh-best-husband-australia-vs-india-brisbane-test-2649338-2024-12-13",
      "headline": "Ritika Sajdeh shares special post for 'best husband' Rohit Sharma on anniversaryRohit Sharma's wife, Ritika Sajdeh, shared a special anniversary post for the India skipper, hailing him as the \"best dad, husband, and friend\". Rohit Sharma-led India prepare to turn their fortunes around in their crucial Brisbane Test against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-brisbane-shubman-gill-nostalgic-gabba-2649279-2024-12-13",
      "headline": "India treating Australia tour as 3-match series from Brisbane Test: Shubman GillBorder-Gavaskar Trophy: Shubman Gill said India is hurt by the loss in Adelaide, but the team is not carrying any baggage into the third Test, starting December 14 at the Gabba, Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-shubman-gill-on-pat-cummins-bouncer-tactic-brisbane-test-2649276-2024-12-13",
      "headline": "Shubman Gill shrugs off Cummins's 'bouncer barrage' ploy ahead of 3rd TestBorder-Gavaskar Trophy: Shubman Gill confidently shrugged off Pat Cummins's 'bouncer barrage' strategy ahead of the third Test, taking a subtle dig at the Australian captain's reliance on short balls against Indian batters.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}