{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-stocks-jump-after-sebi-clean-chit-in-hindenburg-case-check-details-2789807-2025-09-19",
      "headline": "Adani stocks jump up to 10 % after Sebi clean chit in Hindenburg caseThe gains were broad-based across the group's listed entities. Adani Total Gas led the rally, soaring 10% on the BSE. Adani Power climbed 7%, while flagship Adani Enterprises advanced nearly 5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-150-points-nifty-below-25400-adani-group-stocks-jump-2789793-2025-09-19",
      "headline": "Sensex down over 150 points, Nifty below 25,400; Adani Group stocks jumpThe S&P BSE Sensex was down by 260.39 points to 82,753.5, while the NSE Nifty50 lost 56.95 points to 25,366.65 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-new-features-launched-pf-transfers-made-easier-passbook-lite-key-details-2789790-2025-09-19",
      "headline": "PF transfers to become easier: Here's what's changing for employeesThe Employees' Provident Fund Organisation (EPFO) has now introduced two reforms aimed at tackling these bottlenecks. First, it has launched a Passbook Lite feature within the Member Sewa portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-launches-passbook-lite-big-changes-in-pf-portal-check-features-how-it-helps-members-2789787-2025-09-19",
      "headline": "EPFO launches Passbook Lite: Check features, how it helps membersUntil now, employees had to log in to a separate Passbook Portal to see details of contributions and withdrawals. With the launch of Passbook Lite, members can now access this information directly on the EPFO Member Portal, using just one login."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-dismisses-hindenburgs-allegations-against-adani-group-chairman-gautam-adani-news-agency-pti-2789559-2025-09-18",
      "headline": "Adani Group gets clean chit from Sebi over Hindenburg claimsHindenburg Research had alleged that four Adani group companies lent Rs 6.2 billion ($87.4 million) in 2020, without properly disclosing it in financial statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-own-a-credit-card-without-a-bank-account-find-out-2789413-2025-09-18",
      "headline": "Can you own a credit card without a bank account? Find outYou don't always need a savings account to apply for a credit card; new digital options are changing the rules. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-fed-rate-cut-and-tariff-relief-setting-up-a-market-rally-2789488-2025-09-18",
      "headline": "Are Fed rate cut and tariff relief setting up a market rally?A softer stance from the US Federal Reserve and the possibility of reduced reciprocal tariffs have lifted investor mood. The big question now: are these triggers enough to set off a sustained rally in Indian markets?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-nifty-us-india-trade-talk-optimism-2789454-2025-09-18",
      "headline": "Sensex, Nifty extend rally on US-India trade talk optimismThe S&P BSE Sensex rose 318.97 points to finish at 83,012.68, while the NSE Nifty50 advanced 93.35 points to settle at 25,423.60. Broader markets, however, displayed mixed momentum, with several indices ending weaker as profit-booking set in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-may-soon-scrap-25-penal-tariffs-on-indian-goods-lower-reciprocal-duty-to-10-15-economic-adviser-2789428-2025-09-18",
      "headline": "US may scrap 25% penal duty on India, cut reciprocal tariffs to 10–15%: CEAChief Economic Adviser V. Anantha Nageswaran indicated that the US reciprocal tariff on Indian goods, currently at 25%, may be reduced to 10–15%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-your-itr-deadline-3-filing-options-you-can-still-use-2789352-2025-09-18",
      "headline": "Missed your ITR deadline? 3 filing options you can still useIf you missed the Income Tax Return (ITR) deadline, don't panic. Taxpayers still have ways to stay compliant and avoid penalties, with three key filing options available even after the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-get-a-loan-this-festive-season-here-is-what-you-can-do-2789313-2025-09-18",
      "headline": "Want to get a loan this festive season? Here's what you can doFrom new clothes and jewellery to family trips and home makeovers, festivals often come with added costs. A personal loan can help bridge the gap, here's a simple guide to getting one this festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ivalue-infosolutions-ipo-opens-subscription-gmp-price-band-key-details-2789308-2025-09-18",
      "headline": "iValue Infosolutions IPO opens: Should you consider subscribing?iValue Infosolutions plans to Rs 560 crore through an offer-for-sale of 1.87 crore shares. The price band is set at Rs 284–299 per share, with a minimum investment of 50 shares. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/robo-shankar-dies-at-46-udhayanidhi-vijay-sethupathi-and-celebs-remember-actor-2789794-2025-09-19",
      "headline": "Robo Shankar dies at 46: Udhayanidhi, Vijay Sethupathi and celebs remember actorTamil comedy actor Robo Shankar died at the age of 46, a day after collapsing on the film set. Udhayanidhi Stalin, Vijay Sethupathi, Karthi and many actors offered condolences to his family. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-recalls-early-acting-days-says-wore-film-costumes-to-promotions-rwdy-apparel-2789779-2025-09-19",
      "headline": "Vijay Deverakonda recalls early acting days, says wore film costumes to promotionsVijay Deverakonda reflected on his humble beginnings at the 'Little Hearts' success meet, sharing how he once struggled to afford basic clothes. The actor expressed pride in the film's success at the bash on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-75th-birthday-bollywood-dance-party-2789780-2025-09-19",
      "headline": "Rekha, Madhuri, Vidya groove to Kaisi Paheli with Shabana Azmi on her birthdayActors Rekha, Madhuri Dixit and Vidya Balan set the dance floor on fire at Shabana Azmi's 75th birthday celebration. Videos of the event, including stars congratulating Azmi, have gone viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-kalki-2-dropped-role-reduced-to-a-cameo-2789764-2025-09-19",
      "headline": "Deepika Padukone quit Kalki 2 after her role was reduced to a cameo: SourceDeepika Padukone exited 'Kalki 2898 AD's sequel after her role was reduced significantly. On September 18, the makers, in an X post, wrote that a project like 'Kalki' requires a certain level of commitment and announced that they had parted ways with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-reasons-why-they-call-him-og-became-pawan-kalyans-most-anticipated-film-2789301-2025-09-19",
      "headline": "OG fever: How Pawan Kalyan's film created real buzz in era of fake hypeFrom a viral teaser to stylish stunts and Thaman's music, 'They Call Him OG' has created genuine excitement that goes beyond fan hype, positioning Pawan Kalyan for a big-screen comeback this September 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-review-kajol-courtroom-drama-legal-cases-political-conflict-2789636-2025-09-19",
      "headline": "The Trial Season 2 review: Kajol's legal drama settles out of courtroomRelease Date:Fri Sep 19, 2025The Trial Season 2 series review: The Trial Season 2, starring Kajol, attempts to continue the courtroom drama but largely avoids intense legal battles, focusing more on emotional and political conflicts. The series is currently streaming on JioHotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/busan-film-fest-day-2-humas-bayaan-park-chan-wooks-thriller-and-candid-conversations-2789686-2025-09-18",
      "headline": "BIFF Day 2: Huma's Bayaan, Park Chan-wook's thriller and candid conversationsDay 2 of BIFF 2025 blended star-studded appearances, film premieres, and inclusive community initiatives, reinforcing its status as Asia's premier cinema festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajnikanth-daughter-soundarya-calls-him-powerhouse-appa-after-coolie-success-2789467-2025-09-18",
      "headline": "Rajnikanth's daughter Soundarya calls him Powerhouse Appa after Coolie successSoundaryaa Rajinikanth praised her father as 'Powerhouse Appa' as 'Coolie' trended in Amazon Prime's global top 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/robo-shankar-dies-at-46-days-after-collapsing-on-set-kamal-haasan-pays-tribute-2789661-2025-09-18",
      "headline": "Actor Robo Shankar, 46, dies day after on-set collapse. Kamal Haasan pays tributeTamil actor Robo Shankar died at a private hospital in Chennai on September 18, a day after collapsing on set. Kamal Haasan shared a heartfelt tribute on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/luca-guadagnino-backs-his-metoo-themed-after-the-hunt-amid-anti-feminist-criticism-2789641-2025-09-18",
      "headline": "Luca Guadagnino backs his MeToo-themed After the Hunt amid anti-feminist criticismDirector Luca Guadagnino responded to anti-feminist criticism of his MeToo-themed film 'After the Hunt'. He urged viewers to appreciate the powerful female characters and enjoy the story without generic labels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mahavatar-narsimha-ott-release-when-where-to-watch-the-animation-blockbuster-2789608-2025-09-18",
      "headline": "Mahavatar Narsimha OTT release: When and where to watch the animation blockbusterDirector Ashwin Kumar's animated film 'Mahavatar Narsimha' is all set for its OTT release. The mystical action-drama based on ancient texts was released in theatres on July 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/himani-shivpuri-recalls-superstitious-govinda-refused-to-board-a-flight-2789562-2025-09-18",
      "headline": "Himani Shivpuri recalls when superstitious Govinda refused to board a flightActor Himani Shivpuri opened up about Govinda's shifting work habits and belief in mahurats. She added how such beliefs have led to delays and confusion on various film sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vrusshabha-teaser-mohanlal-transforms-into-fierce-warrior-period-drama-2789590-2025-09-18",
      "headline": "Vrusshabha teaser: Mohanlal transforms into a fierce warrior in this period dramaThe wait is finally over. After treating fans with the first-look poster, Mohanlal unveiled the teaser of his upcoming film, 'Vrusshabha.'  The film marks the veteran actor's third foray into the period action genre in recent years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-gets-trolled-for-interrupting-janhvi-kapoor-ai-remark-2789575-2025-09-18",
      "headline": "Varun Dhawan gets trolled for interrupting Janhvi Kapoor's AI remark: DisrespectfulAt the trailer launch of 'Sunny Sanskari Ki Tulsi Kumari', Janhvi Kapoor spoke about the misuse of AI-generated images, but Varun Dhawan interrupted her with a joke, sparking backlash online. Social media users criticised Varun for being \"disrespectful\" and diverting attention from a serious issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urmila-matondkar-birthday-wish-for-shabana-azmi-has-nostalgic-masoom-throwback-2789432-2025-09-18",
      "headline": "Urmila Matondkar's birthday wish for Shabana Azmi has nostalgic Masoom throwbackOn Shabana Azmi's birthday, actor Urmila Matondkar shared a heartfelt note and nostalgic photos from her debut film 'Masoom', recalling their decades-long bond. Urmila praised Azmi for inspiring her both on and off-screen, calling her \"Queen\" at 75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-is-jimmy-kimmel-television-host-faces-suspension-after-controversial-remarks-on-charlie-kirk-2789515-2025-09-18",
      "headline": "Who is Jimmy Kimmel? TV host faces suspension after controversial remarks on Charlie KirkABC has stopped airing 'Jimmy Kimmel Live!' after the host made \"offensive\" remarks about the death of conservative leader Charlie Kirk. The show has been taken off-air indefinitely, ending Kimmel's long late-night run for the time being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-review-aryan-khan-debut-is-witty-chaotic-riot-of-drama-2789560-2025-09-18",
      "headline": "The Ba***ds of Bollywood review: It's Aryan's love letter to the filmy chaos, dramaRelease Date:Thu Sep 18, 2025Aryan Khan's directorial debut, 'The Ba***ds of Bollywood' premiered on September 18. The show isn't about exposing Bollywood, it's about embracing its madness. With wit, cameos, and chaos, the Netflix show is messy, filmy, and oh-so-fun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/huma-qureshi-wins-face-of-asia-award-in-busan-dedicates-to-women-dreamers-2789531-2025-09-18",
      "headline": "Huma Qureshi wins Face of Asia Award in Busan, dedicates it to women dreamersActor Huma Qureshi was presented the Face of Asia Award at the Busan International Film Festival (BIFF). She dedicated her win to young girls who dared to dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/bollywoods-big-deja-vu-same-stories-new-faces-zero-shame-2789507-2025-09-18",
      "headline": "Bollywood's big deja vu: Same stories, new faces, zero shameBollywood keeps serving recycled plots driven by glamour and hype. Here's exploring why stories are missing in today's big-budget films and what audiences really want."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/telangana-techie-shgot-dead-by-us-police-family-seeks-government-help-glbs-2789746-2025-09-19",
      "headline": "Telangana techie shot dead by US cops, family seeks help to bring back bodyTelangana techie Mohammed Nizamuddin was shot dead by US police after allegedly stabbing his roommate. His family, however, has disputed the police's version and has sought the government's help to bring back his body home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-chief-of-defence-staff-general-anil-chauhan-reveals-timing-prevent-civilian-casualties-2789775-2025-09-19",
      "headline": "Why was Op Sindoor planned at 1 am, CDS Anil Chauhan revealsThe first strikes under Operation Sindoor took place between 1-1.30 am on May 7 on nine identified terrorist targets in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/i-am-very-close-to-india-and-modi-weve-very-good-friendship-trump-after-repeated-rant-over-russia-oil-trade-2789626-2025-09-18",
      "headline": "I am very close to India and Modi: Trump after repeated rant over Russia oil tradeUS President Donald Trump, while addressing reporters during his UK visit, said that he is very close to India and Prime Minister Narendra Modi. His remarks come after his repeated rants over India's Russian oil trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/missing-head-lord-vishnu-idol-khajuraho-javari-temple-debate-2789763-2025-09-19",
      "headline": "CJI comment row sparks question: Was Vishnu idol's head destroyed or unfinished?Following Chief Justice of India BR Gavai's remark, the missing head of Lord Vishnu at the Javari temple in Khajuraho, Madhya Pradesh, has raised a new question: was it destroyed by foreign invaders or left unfinished?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-mumbaikars-cheer-as-they-grab-their-iphone-17s-after-queuing-up-since-1-am-2789788-2025-09-19",
      "headline": "Watch: Mumbaikars cheer as they grab their iPhone 17s after queuing up since 1 amApple has officially kicked off the sale of its latest iPhone 17 series in India, drawing massive crowds at its Mumbai BKC store. Excitement around the new launch was so high that people started lining up outside the store from Thursday evening itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/in-pics-new-flyover-in-nagpur-cuts-through-houses-balcony-2789716-2025-09-19",
      "headline": "In pics: New flyover in Nagpur cuts through house's balconyThe flyover in question is part of the Indora-Dighori corridor in Nagpur's Ashok Nagar area, currently being developed by the National Highways Authority of India (NHAI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-revokes-2018-sanctions-waiver-for-india-others-countries-at-irans-chabahar-port-effective-from-sept-29-2789639-2025-09-18",
      "headline": "US revokes sanctions waiver for India, other countries at Iran's Chabahar portThe waiver had allowed India and other countries to continue work on the port without facing US penalties. The US has now revoked the sanction exemption, and it will come into effect from September 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-injury-ends-33-tournament-medal-streak-tokyo-world-championships-final-2789607-2025-09-18",
      "headline": "What went wrong for Neeraj Chopra in World Championships finalWorld Athletics Championships 2025: Neeraj Chopra admitted he was not in peak physical condition ahead of his title defence, revealing that he suffered a back injury while training in the Czech Republic earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-review-kajol-courtroom-drama-legal-cases-political-conflict-2789636-2025-09-19",
      "headline": "The Trial Season 2 review: Kajol's legal drama settles out of courtroomRelease Date:Fri Sep 19, 2025The Trial Season 2 series review: The Trial Season 2, starring Kajol, attempts to continue the courtroom drama but largely avoids intense legal battles, focusing more on emotional and political conflicts. The series is currently streaming on JioHotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/ktaka-deputy-cm-dk-shivakumar-on-bengaluru-firms-leaving-ktaka-government-least-bothered-2789714-2025-09-18",
      "headline": "Least bothered: DK Shivakumar shrugs off threats by firms to exit BengaluruKarnataka Deputy Chief Minister DK Shivakumar hit back at criticism over Bengaluru's infrastructure, dismissing threats of companies leaving the city while accusing Union Minister HD Kumaraswamy of political posturing with pothole remarks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-kalki-2-dropped-role-reduced-to-a-cameo-2789764-2025-09-19",
      "headline": "Deepika Padukone quit Kalki 2 after her role was reduced to a cameo: SourceDeepika Padukone exited 'Kalki 2898 AD's sequel after her role was reduced significantly. On September 18, the makers, in an X post, wrote that a project like 'Kalki' requires a certain level of commitment and announced that they had parted ways with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-tariff-threats-against-india-wont-work-says-lavrov-trump-softens-rhetoric-glbs-2789747-2025-09-19",
      "headline": "US tariff threats against India won't work, says Lavrov as Trump softens rhetoricLavrov's comments come amid months of repeated warnings from US President Donald Trump, who has criticised India's oil trade with Russia and threatened tariffs. In recent weeks, Trump has taken a noticeably softer approach towards India despite his rhetoric."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-launches-passbook-lite-big-changes-in-pf-portal-check-features-how-it-helps-members-2789787-2025-09-19",
      "headline": "EPFO launches Passbook Lite: Check features, how it helps membersUntil now, employees had to log in to a separate Passbook Portal to see details of contributions and withdrawals. With the launch of Passbook Lite, members can now access this information directly on the EPFO Member Portal, using just one login."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-oman-preview-abu-dhabi-pitch-report-livestreaming-2789730-2025-09-19",
      "headline": "Asia Cup: India eye clinical show against Oman before rematch vs PakistanHaving sealed their spot in the Super 4 stages, India might look to test their bench strength in the last group fixture against Oman. The match will also serve as an opportunity to fine-tune their preparations ahead of another blockbuster clash against arch-rivals Pakistan in the Super 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-rashid-khan-on-afghanistan-asia-cup-exit-2789729-2025-09-19",
      "headline": "Afghanistan see Asia Cup early exit as pause, not halt, in T20 surgeAfghanistan got knocked out of the Asia Cup 2025 after their six-wicket loss against Sri Lanka in their last Group B fixture in Abu Dhabi. The Rashid Khan-led side was touted as the second-best team of the tournament after India but failed to live up to the expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/gurugram-firing-mnr-builder-office-security-concerns-police-investigation-2789762-2025-09-19",
      "headline": "Armed assailants fire 25-30 rounds on builder's office in GurugramAccording to initial reports, the five attackers on Thursday night opened fire indiscriminately inside the MNR Buildmark office, targeting vehicles parked inside and leaving visible bullet marks throughout the premises."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-man-phone-number-displayed-rahul-gandhi-vote-chori-presser-2789532-2025-09-18",
      "headline": "UP man's number shown at Rahul Gandhi press meet. He gets bombarded with callsAnjani Mishra, who lives in Prayagraj, said he was surprised to see his number mentioned by Rahul Gandhi at the September 18 press briefing. He complained that he was getting a barrage of calls after his number was shown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-icc-action-pakistan-violation-rules-filming-video-uae-match-2789681-2025-09-18",
      "headline": "ICC weighs action against PCB for filming meeting with referee in restricted areaAsia Cup: The International Cricket Committee is considering action against Pakistan for violation of multiple rules, including filming of restricted areas, before their match against the UAE on Wednesday. Pakistan released a video of their team's discussion with match referee Andy Pycroft, claiming he apologised for miscommunication during the handshake snub on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-world-athletics-championships-javelin-setback-sitting-silence-watch-video-2789773-2025-09-19",
      "headline": "Watch: Dejected Neeraj Chopra sits in silence after World Championships setbackNeeraj Chopra sat dejected and silent in the dugout after finishing eighth in the men's javelin final at the World Championships 2025 in Tokyo. The result ended his remarkable seven-year medal streak."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-kp-sharma-oli-demand-helicopter-to-flee-gen-z-protests-nepo-kids-army-chief-sigdel-resignation-condition-kathmandu-2789332-2025-09-18",
      "headline": "Helicopter only after you resign: What Nepal Army chief told Oli amid Gen Z protestsAs violent Gen Z-led protests engulfed Nepal, including the capital Kathmandu, then PM KP Sharma Oli's plea for a helicopter for a safe exit was met with army chief Ashok Raj Sigdel's condition. He asked Oli to resign first, says a report. This sealed the fate of the Oli regime, which faced heat over corruption and authoritarianism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/robo-shankar-dies-at-46-days-after-collapsing-on-set-kamal-haasan-pays-tribute-2789661-2025-09-18",
      "headline": "Actor Robo Shankar, 46, dies day after on-set collapse. Kamal Haasan pays tributeTamil actor Robo Shankar died at a private hospital in Chennai on September 18, a day after collapsing on set. Kamal Haasan shared a heartfelt tribute on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/french-president-macron-brigitte-macron-refute-transgender-claims-defamation-lawsuit-glbs-2789752-2025-09-19",
      "headline": "France's Macron to offer scientific proof in US court to prove his wife is a womanFrench President Emmanuel Macron and wife Brigitte plan to present evidence in a US court to counter transgender claims. Owens has repeatedly alleged that Brigitte Macron was born male and transitioned before marrying Emmanuel Macron."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-rest-vs-oman-pakistan-sunil-gavaskar-test-bench-strength-2789813-2025-09-19",
      "headline": "Rest Jasprit Bumrah vs Oman and Pakistan: Sunil Gavaskar wants India to plan aheadSunil Gavaskar suggests India rest Jasprit Bumrah against Oman and Pakistan in Asia Cup to keep him fresh for the Super 4s, while giving key batters like Sanju Samson and Tilak Verma valuable practice time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-marcus-rashford-redemption-fc-barcleona-vs-newcastle-united-erling-haaland-fifty-goals-2789781-2025-09-19",
      "headline": "Marcus Rashford redemption in Barcelona win as Erling Haaland nets 50th UCL goalMarcus Rashford scored twice on his Barcelona Champions League debut to stun Newcastle, while Erling Haaland became the fastest to 50 goals as Manchester City cruised past Napoli. Frankfurt and Sporting impressed, Leverkusen survived a scare in Denmark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-fastest-200m-semifinal-world-athletics-tokyo-2789719-2025-09-19",
      "headline": "Noah Lyles targets Usain Bolt's record after fastest-ever 200m semifinalWorld Athletics Championships: Noah Lyles set a blistering 19.51 seconds to qualify for the 200m final at Tokyo. He promised a magical final as he aims to win his fourth successive gold medal in the event in the world meet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-world-athletics-championships-javelin-setback-sitting-silence-watch-video-2789773-2025-09-19",
      "headline": "Watch: Dejected Neeraj Chopra sits in silence after World Championships setbackNeeraj Chopra sat dejected and silent in the dugout after finishing eighth in the men's javelin final at the World Championships 2025 in Tokyo. The result ended his remarkable seven-year medal streak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-oman-preview-abu-dhabi-pitch-report-livestreaming-2789730-2025-09-19",
      "headline": "Asia Cup: India eye clinical show against Oman before rematch vs PakistanHaving sealed their spot in the Super 4 stages, India might look to test their bench strength in the last group fixture against Oman. The match will also serve as an opportunity to fine-tune their preparations ahead of another blockbuster clash against arch-rivals Pakistan in the Super 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-rashid-khan-on-afghanistan-asia-cup-exit-2789729-2025-09-19",
      "headline": "Afghanistan see Asia Cup early exit as pause, not halt, in T20 surgeAfghanistan got knocked out of the Asia Cup 2025 after their six-wicket loss against Sri Lanka in their last Group B fixture in Abu Dhabi. The Rashid Khan-led side was touted as the second-best team of the tournament after India but failed to live up to the expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-predicted-xi-asia-cup-clash-oman-jasprit-bumrah-arshdeep-singh-harshit-2789668-2025-09-19",
      "headline": "India predicted XI for Asia Cup clash vs Oman: Will Jasprit Bumrah be rested?Asia Cup, India predicted XI for Oman clash: India are unlikely to make changes for their final Asia Cup group game against Oman, apart from possibly resting their pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sri-lanka-dunith-wellalage-father-dies-heart-attack-afghanistan-game-2789725-2025-09-19",
      "headline": "Sri Lanka cricketer learns of father's death after Asia Cup matchSri Lanka spinner Dunith Wellalage was informed of his father Suranga's death after the team's Asia Cup match against Afghanistan in Abu Dhabi. Suranga, who also played cricket, captained one of Sri Lanka's leading school sides, according to former all-rounder Russell Arnold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-bangladesh-qualify-super-4-afghanistan-crash-out-asia-cup-2789713-2025-09-18",
      "headline": "Asia Cup: Sri Lanka knock Afghanistan out, take Bangladesh into Super 4Asia Cup 2025: Kusal Mendis struck an unbeaten 74 off 52 balls to power Sri Lanka to a six-wicket win over Afghanistan in their final group match, securing a place in the Asia Cup Super Four alongside Bangladesh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-nabi-five-sixes-dunith-wellalage-asia-cup-2025-sri-lanka-afghanistan-2789679-2025-09-18",
      "headline": "Watch: Mohammad Nabi smashes 5 consecutive sixes against Wellalage in Asia CupMohammad Nabi unleashed a stunning display by hitting five consecutive sixes against Sri Lanka in the Asia Cup 2025. He brought up his half-century off just 20 balls, the joint fastest by an Afghanistan batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-kuldeep-yadav-full-press-conference-india-vs-oman-pakistan-2789684-2025-09-18",
      "headline": "Asia Cup: Kuldeep Yadav reveals his success mantra against PakistanIndia spinner Kuldeep Yadav remains unfazed by the noise surrounding the controversy ahead of the high-voltage Asia Cup Super 4 clash against Pakistan. The left-arm wrist-spinner also outlined his success mantra, saying he treats every batter the same, regardless of the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-predicted-xi-asia-cup-clash-oman-jasprit-bumrah-arshdeep-singh-harshit-2789668-2025-09-19",
      "headline": "India predicted XI for Asia Cup clash vs Oman: Will Jasprit Bumrah be rested?Asia Cup, India predicted XI for Oman clash: India are unlikely to make changes for their final Asia Cup group game against Oman, apart from possibly resting their pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sri-lanka-dunith-wellalage-father-dies-heart-attack-afghanistan-game-2789725-2025-09-19",
      "headline": "Sri Lanka cricketer learns of father's death after Asia Cup matchSri Lanka spinner Dunith Wellalage was informed of his father Suranga's death after the team's Asia Cup match against Afghanistan in Abu Dhabi. Suranga, who also played cricket, captained one of Sri Lanka's leading school sides, according to former all-rounder Russell Arnold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-bangladesh-qualify-super-4-afghanistan-crash-out-asia-cup-2789713-2025-09-18",
      "headline": "Asia Cup: Sri Lanka knock Afghanistan out, take Bangladesh into Super 4Asia Cup 2025: Kusal Mendis struck an unbeaten 74 off 52 balls to power Sri Lanka to a six-wicket win over Afghanistan in their final group match, securing a place in the Asia Cup Super Four alongside Bangladesh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-nabi-five-sixes-dunith-wellalage-asia-cup-2025-sri-lanka-afghanistan-2789679-2025-09-18",
      "headline": "Watch: Mohammad Nabi smashes 5 consecutive sixes against Wellalage in Asia CupMohammad Nabi unleashed a stunning display by hitting five consecutive sixes against Sri Lanka in the Asia Cup 2025. He brought up his half-century off just 20 balls, the joint fastest by an Afghanistan batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-kuldeep-yadav-full-press-conference-india-vs-oman-pakistan-2789684-2025-09-18",
      "headline": "Asia Cup: Kuldeep Yadav reveals his success mantra against PakistanIndia spinner Kuldeep Yadav remains unfazed by the noise surrounding the controversy ahead of the high-voltage Asia Cup Super 4 clash against Pakistan. The left-arm wrist-spinner also outlined his success mantra, saying he treats every batter the same, regardless of the opposition."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}