{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirav-modis-brother-in-law-maiank-mehta-pardoned-in-rs-13000-crore-pnb-scam-case-2794352-2025-09-27",
      "headline": "Nirav Modi's brother-in-law Maiank Mehta pardoned in Rs 13,000 crore PNB scam caseA special CBI court granted pardon to Maiank Mehta, brother-in-law of fugitive diamantaire Nirav Modi, in the Rs 13,000 crore Punjab National Bank fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-733-points-nifty-below-24700-pharma-it-stocks-hit-hard-2793901-2025-09-26",
      "headline": "Sensex tumbles 733 points as pharma, IT stocks hitThe sell-off came after the United States announced a steep 100% tariff on imports of branded and patented pharmaceutical products, effective October 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-air-passengers-rise-to-1317-lakh-in-august-2025-amid-rising-costs-icra-report-2793857-2025-09-26",
      "headline": "Indian air passengers rise to 131.7 lakh in August 2025 amid rising costs: ReportIndia's aviation sector is bouncing back, but the journey isn't without turbulence. Rising fuel costs, operational challenges, and financial pressures are testing airlines, even as passenger traffic shows steady growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-down-800-points-nifty-fall-pharma-it-auto-fmcg-shares-trump-announcement-2793865-2025-09-26",
      "headline": "Sensex tanks 800 points: Why is stock market falling today?By 2:37 pm, the S&P BSE Sensex had lost 782.71 points to trade at 80,376.97, while the NSE Nifty50 slipped 247.10 points to 24,643.75. Both indices were on track to end the week in negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/18-upcoming-ipos-next-week-glottis-fabtech-om-freight-advance-agrolife-sme-public-listings-2793844-2025-09-26",
      "headline": "Investors brace for IPO wave as 18 public listings hit Dalal Street next weekThe four mainboard IPOs opening next week together aim to raise over Rs 850 crore. Apart from them, 14 SME IPOs will also open for bidding next week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-policy-private-grievance-platforms-claim-denied-2793797-2025-09-26",
      "headline": "Why more insurance policyholders are turning to private grievance platformsAs claim rejections soar and official channels frustrate, policyholders turn to private grievance platforms. Experts warn regulatory reform and competent brokers could restore trust in India's struggling insurance system."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-in-sanjay-leela-bhansali-film-actor-visits-filmmaker-sparks-buzz-2794461-2025-09-27",
      "headline": "Ahaan Panday in Sanjay Leela Bhansali film? Actor visits filmmaker, sparks buzz Bollywood's rising star Ahaan Panday was seen at Sanjay Leela Bhansali's office on Saturday, sparking widespread speculation about a potential collaboration between the two. Fans are eagerly awaiting an official announcement as excitement builds over this possible new project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varalaxmi-sarathkumar-makes-directorial-debut-saraswathi-prakash-raj-priyamani-2794442-2025-09-27",
      "headline": "Varalaxmi Sarathkumar's directorial debut Saraswathi to star Priyamani, Prakash Raj Varalaxmi Sarathkumar is making her directorial debut with 'Saraswathi', produced under the new banner Dosa Diaries launched with her sister Pooja. The actor shared the announcement post on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-dream-formula-one-hollywood-film-racing-passion-2794437-2025-09-27",
      "headline": "Ajith Kumar talks about dream F1 film collaboration and his racing passion Tamil superstar Ajith Kumar hinted at the possibility of making a Formula One film, blending his passion for racing with cinema. In an interview with India Today, he also expressed hope for an Indian driver to become a Formula One World Champion in his lifetime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-wedding-taylor-swift-santa-barbara-date-guest-list-what-we-know-so-far-2794385-2025-09-27",
      "headline": "Selena Gomez and Benny Blanco's wedding: Date, guest list, what we know so far Set against the scenic backdrop of Santa Barbara, Selena Gomez and Benny Blanco are set for a secret, celebrity-filled wedding that promises to be intimate, unforgettable, and all that one can talk about. Here's all we know about D-Day so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-gets-scolded-by-salman-khan-and-gauahar-khan-in-bigg-boss-19-promo-2794393-2025-09-27",
      "headline": "Bigg Boss 19: Amaal Mallik is scolded by Salman Khan and Gauahar; watch promo In the upcoming 'Bigg Boss 19' Weekend Ka Vaar, Salman Khan scolded Amaal Mallik for his abusive behaviour and urged him to focus on his talent. Former winner Gauahar Khan also entered the house to give Amaal and Awez Darbar a reality check."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/pvr-aamer-bijli-on-bringing-shin-chan-to-india-nostalgia-and-anime-obsession-2794376-2025-09-27",
      "headline": "PVR's Aamer Bijli on bringing Shin-Chan to India, nostalgia, and anime obsession PVR Inox Pictures is bringing the beloved anime 'Shin-Chan' to Indian cinemas with 'Kasukabe Dancers'. The film's extensive localisation and nostalgic appeal aim to capture audiences across tier 2 and 3 cities, signalling growing anime popularity in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shraddha-kapoor-announces-choti-stree-animated-spin-off-from-horror-comedy-saga-2794351-2025-09-27",
      "headline": "Shraddha Kapoor announces Choti Stree, animated spin-off from horror-comedy saga Shraddha Kapoor announced 'Choti Stree', an animated film from Maddock's horror-comedy universe that will explore the backstory of her iconic character. Producer Dinesh Vijan shared it will connect directly to 'Stree 3', releasing six months before the live-action sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-devara-2-announced-koratala-siva-2794343-2025-09-27",
      "headline": "Jr NTR's Devara 2 announced on first film's anniversary On the first anniversary of 'Devara', the makers have confirmed the much-awaited sequel, 'Devara 2', thrilling fans across the nation. The original film's gripping storyline and Jr NTR's powerful dual roles have set high expectations for the upcoming action-packed continuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-episode-34-farrhana-bhatt-becomes-captain-gaurav-khanna-lashes-out-over-fair-play-2794342-2025-09-27",
      "headline": "Bigg Boss 19 episode 34: Farrhana wins captaincy, Gaurav fumes over unfair decision In the latest episode of 'Bigg Boss 19', Farrhana Bhatt defeated Gaurav Khanna to become the new captain of the house. The loss didn't sit well with Gaurav, who lashed out at the opposition team, demanding fair play and transparency in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-2-first-look-tovino-thomas-dulquer-salmaan-charlie-michael-malayalam-superhero-saga-2794331-2025-09-27",
      "headline": "Lokah 2 first look: Tovino Thomas takes superhero saga ahead, Dulquer Salmaan joins The Lokah universe is set to expand with the official announcement of 'Lokah Chapter 2', featuring Tovino Thomas and Dulquer Salmaan in a darker, thrilling sequel. Following the massive success of 'Lokah Chapter 1: Chandra', fans can expect an ambitious continuation of India's biggest Malayalam superhero saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-namashi-chakraborty-feels-bollywood-needs-talent-not-surnames-2793577-2025-09-27",
      "headline": "Exclusive: Namashi Chakraborty feels Bollywood needs talent, not surnames Actor Namashi Chakraborty, who recently featured in director Vivek Agnihotri's 'The Bengal Files', shared his views on opportunities for young talent, in an interview with IndiaToday.in. He also spoke about his actor father Mithun Chakraborty, films based on real events and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-the-paradise-mohan-babu-is-fierce-in-first-look-as-shikanja-maalik-2794309-2025-09-27",
      "headline": "Nani's The Paradise: Mohan Babu is fierce in first look as Shikanja Maalik Mohan Babu is making a powerful comeback as the menacing villain Shikanja Maalik in Nani's upcoming multi-language film 'The Paradise'. The film, directed by Srikanth Odela, is set for a global release in March 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-celebrates-partner-michael-polansky-42nd-birthday-with-romantic-tribute-2794311-2025-09-27",
      "headline": "Lady Gaga celebrates partner Michael Polansky's 42nd birthday with romantic tribute Lady Gaga celebrated her partner Michael Polansky's 42nd birthday with heartfelt post, calling it her favourite day of the year and praising his achievements. She also expressed gratitude for his support in her personal life and career, including their shared journey with her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-social-reckoning-the-social-network-sequel-announced-releases-in-october-2026-2794294-2025-09-27",
      "headline": "The Social Reckoning: The Social Network sequel set to open on October 9, 2026 Aaron Sorkin is making a comeback with 'The Social Reckoning', a sequel to his 2010 hit 'The Social Network', exploring Facebook's recent turbulent history. The film will spotlight whistleblower Frances Haugen and the controversies that have shaped the social media giant in the last decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/are-thursday-film-premieres-shaking-up-indian-cinema-old-rulebook-pawan-kalyan-og-sunny-sanskari-ki-tulsi-kumari-2792834-2025-09-27",
      "headline": "Are Thursday film premieres shaking up Indian cinema's old rulebook? Indian cinema is shifting gears as Thursday premieres rise alongside the classic Friday release, giving films a longer weekend run. Fuelled by fan frenzy and box office strategy, the trend signals flexibility, but without erasing Friday's cultural pull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-remembers-late-zubeen-garg-with-throwback-photo-urges-for-fast-investigation-2794287-2025-09-27",
      "headline": "Papon remembers late Zubeen Garg with throwback photo, urges for fast investigation Papon paid tribute to late singer Zubeen Garg, sharing memories and calling for a swift investigation into his death. Meanwhile, manager Siddhartha Sharma clarified the ownership of Garg's songs, confirming that earnings from his later works will go to his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-giddhs-radhika-lavu-on-national-award-cinema-survival-sanjay-mishra-2793958-2025-09-27",
      "headline": "Exclusive: Giddh's Radhika Lavu on National Award, cinema, survival, Sanjay Mishra National Award-winning filmmaker Radhika Lavu opens up about her short film 'Giddh - The Scavenger', starring Sanjay Mishra. In an exclusive interview, she reflects on cinema, survival, the female gaze, and what her win means for independent and regional storytellers in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-cites-deepika-padukones-schedule-as-cook-dilip-wants-to-invite-star-2794073-2025-09-27",
      "headline": "Farah Khan cites Deepika Padukone's schedule as cook Dilip wants to invite star Farah Khan, who directed Deepika Padukone in her debut film 'Om Shanti Om', recently spoke about the actor's busy schedule. She was responding to her cook, Dilip, who wanted to invite the star for a vlog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-recalls-earning-rs-1000-a-week-with-unusual-demand-from-producer-2794246-2025-09-27",
      "headline": "Saif recalls earning Rs 1,000 a week with unusual demand from female producer Saif Ali Khan shared that during his early Bollywood days he earned just Rs 1,000 a week, with the unusual condition of kissing the producer on the cheek ten times. He describes the 1990s as a \"net practice\" era of trial and error, before breaking through with films like 'Dil Chahta Hai' and 'Omkara'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/one-nation-openly-declares-terror-as-state-policy-s-jaishankar-tears-into-pak-at-un-general-assembly-2794513-2025-09-27",
      "headline": "One nation openly declares terror as state policy: S Jaishankar tears into Pak at UN At the UN, India's S Jaishankar called Pakistan an \"epicentre of global terrorism,\" cited the Pahalgam attack, and urged global action to choke terror financing, condemn state-backed terror, and uphold shared security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-sri-lanka-super-4-dew-dubai-heat-pakistan-2794228-2025-09-27",
      "headline": "Cramps and dew: India vs Pakistan final could turn out to be very differentAsia Cup 2025: India brushed aside Pakistan in two back-to-back matches in the Asia Cup. But if Friday's game against Sri Lanka is any indication, the final could turn out to be far trickier than expected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/karur-stampede-k-annamalai-bjp-dmk-government-over-security-lapses-demands-compensation-2794496-2025-09-27",
      "headline": "Gross negligence: Annamalai slams DMK government over Vijay rally stampedeThe former Tamil Nadu BJP chief demanded a fair and thorough investigation into the causes of the stampede, and sought compensation for the families of the victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bareilly-i-love-muhammad-row-controversy-protest-violent-clashes-police-action-internet-suspended-2794406-2025-09-27",
      "headline": "Bareilly tense after cleric's arrest over 'I Love Muhammad' clash, internet shutTauqeer Raza, a local cleric and chief of the Ittehad-e-Millat Council, was arrested on Saturday after his call to protest in support of the 'I Love Muhammad' campaign sparked unrest in Bareilly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-round-of-applause-at-unga-as-s-jaishakar-slams-pakistan-as-terror-epicentre-glbs-2794528-2025-09-28",
      "headline": "Watch: Round of applause at UNGA as S Jaishakar slams Pakistan as terror epicentreExternal Affairs Minister S. Jaishankar addressed the 80th UNGA in New York, referring to India as Bharat and earning thunderous applause for calling Pakistan the \"epicentre of global terrorism.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/most-recent-example-of-cross-border-barbarism-was-murder-of-innocent-tourists-in-pahalagam-in-april-this-year-eam-jaishankar-at-unga-2794518-2025-09-27",
      "headline": "Pahalgam attack is recent example of cross-border barbarism, says Jaishankar in UNSpeaking at UNGA, EAM S Jaishankar stressed that countering terrorism remains a global priority. He referred to the Pahalgam attack as a recent example of cross-border barbarism.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-no-handshake-controversy-salman-agha-comments-2794451-2025-09-27",
      "headline": "Asia Cup final: Pakistan captain breaks silence on no handshake saga vs IndiaAsia Cup final, India vs Pakistan: Pakistan captain Salman Ali Agha has broken his silence on the 'no handshake' controversy against India ahead of the Asia Cup final in Dubai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/handcuffed-feet-tied-71-year-old-punjab-grandmother-deported-from-us-recounts-ordeal-watch-video-2794358-2025-09-27",
      "headline": "Handcuffed, feet tied: Punjab grandmother, 71, deported from US recounts ordealSpeaking to reporters, Kaur said she has been under deportation proceedings since 2012 due to not having a passport, although she held a valid work permit and other identification documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mig-21-retires-women-fighter-pilots-indian-air-force-who-flew-the-soviet-era-jet-bison-variant-rafale-su-30-mki-lca-tejas-2794350-2025-09-27",
      "headline": "MiG-21 retires: A look at the women who tamed the BisonFor decades, women were barred from becoming fighter pilots in the IAF, but when the opportunity came, they took the reins and tamed the MiG-21 Bison. Like generations of their male counterparts, India's women fighter pilots also cut their teeth on the MiG-21s. They did it so fittingly that its final flypast was led by Squadron Leader Priya Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonam-wanghchuk-was-in-touch-with-pak-intel-visited-bangladesh-ladakh-top-cop-2794374-2025-09-27",
      "headline": "Sonam Wangchuk was in touch with arrested Pak intel operative: Ladakh top copLadakh DGP SD Singh Jamwal accused Wangchuk of instigating violence in Leh during the events of September 24, when at least four people died and nearly 80 others were injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-2025-abhishek-sharma-fails-no-panic-gavaskar-2794293-2025-09-27",
      "headline": "What if Abhishek Sharma fails in Asia Cup final? No need to panic, says GavaskarSunil Gavaskar has claimed that India doesn't need to panic in the Asia Cup final even if Abhishek Sharma suffers a rare failure. Gavaskar backed the rest of the batters to step up in such a situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-durga-puja-idol-trump-demon-trade-tariffs-india-2794419-2025-09-27",
      "headline": "Trump as demon idol steals spotlight at Bengal puja pandal amid trade disputeThe portrayal reflects grievances over trade policies, including tariffs imposed on India, which the committee views as detrimental to the country's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-dream-formula-one-hollywood-film-racing-passion-2794437-2025-09-27",
      "headline": "Ajith Kumar talks about dream F1 film collaboration and his racing passionTamil superstar Ajith Kumar hinted at the possibility of making a Formula One film, blending his passion for racing with cinema. In an interview with India Today, he also expressed hope for an Indian driver to become a Formula One World Champion in his lifetime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/daughter-in-law-elopes-with-husbands-cousin-jabalpur-police-investigation-2794441-2025-09-27",
      "headline": "Madhya Pradesh woman elopes with sister-in-law, WhatsApp chats expose affairThe incident came to light after the husband discovered mobile chats confirming a romantic relationship between the two women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sheetal-devi-wins-gold-para-world-archery-championship-gwangju-2794377-2025-09-27",
      "headline": "Sheetal Devi crowned world champion, bags historic gold at Para World Archery C'shipSheetal Devi won gold in the women's compound individual event at the Para World Archery Championship. Her victory over Turkiye's top-ranked archer highlights India's rising strength in para-archery."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-court-grants-bail-to-gaganpreet-kaur-accused-in-bmw-crash-that-killed-senior-finance-ministry-official-2794389-2025-09-27",
      "headline": "Delhi BMW crash accused gets bail in Finance Ministry official's death caseA Delhi court granted bail to BMW crash accused Gaganpreet Kaur on a Rs 1 lakh bond with strict conditions, while also questioning the ambulance's negligence at the accident site. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/daughters-chaudhary-dance-video-shows-why-girl-dads-are-the-luckiest-2794357-2025-09-27",
      "headline": "Daughters' Chaudhary dance video shows why girl-dads are the luckiestIn a now-viral video, two daughters welcome their father as they dance to 'Chaudhary'. The clip has made the internet realise why girl-dads are the luckiest. Scroll down to watch the video.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-528-26-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-acc-chief-mohsin-naqvi-to-present-trophy-india-stance-unclear-2794416-2025-09-27",
      "headline": "Asia Cup: ACC chief Mohsin Naqvi to present trophy, India's stance remains unclearAsia Cup 2025: ACC chairman Mohsin Naqvi is set to present the Asia Cup 2025 trophy in the final between India and Pakistan. His presence raises questions over India's response amid ongoing tensions and past controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/criminal-unjustifiable-brics-nations-joint-statement-condemn-pahalgam-attack-strongest-terms-2794415-2025-09-27",
      "headline": "Criminal, unjustifiable: Brics nations condemn Pahalgam attack in strongest termsBrics nations strongly condemned the April 22 Pahalgam terror attack in Jammu & Kashmir that killed 26, calling terrorism \"criminal and unjustifiable.\" The joint statement urged zero tolerance, accountability, and concerted global action against terror."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kajol-rani-mukerji-inaugurate-north-bombay-sarbojanin-durga-puja-2794498-2025-09-27",
      "headline": "Kajol, Rani Mukerji come together to inaugurate North Bombay Sarbojanin Durga PujaCousins Kajol and Rani Mukerji reunited for the inaugural ceremony of their family's annual Durga Puja. The North Bombay Sarbojanin Durga Puja began with the unveiling of Maa Durga's idol and a tribute to the Pashupatinath Temple."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-student-assault-mangolpuri-police-investigation-2794383-2025-09-27",
      "headline": "15-year-old student beaten to death by group of boys in Delhi over verbal disputeThe incident began with a quarrel among schoolchildren, after which the victim was assaulted by outsiders and suffered serious injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-tears-into-pakistan-at-un-pakistan-prime-minister-shehbaz-sharif-operation-sindoor-unga-session-petal-gahlot-2794279-2025-09-27",
      "headline": "If destroyed runways look like victory...: India tears into Pakistan at UNIndia hit back at Pakistan Prime Minister Shehbaz Sharif's UNGA speech, mocking his \"victory\" claim in the May 7-10 conflict and blasting Islamabad for glorifying terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/barack-obama-donald-trump-old-men-white-house-dictator-autism-paracetamol-link-claims-2794326-2025-09-27",
      "headline": "Did Obama troll Trump? Ex-US President says 80% of world's problems involve old menIn remarks seen as a barb at US President Donald Trump, former President Barack Obama said \"80 per cent of the world's problems involved old men hanging on, building pyramids and putting their names on everything\"."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-first-t20i-win-west-indies-historic-victory-sharjah-2794520-2025-09-27",
      "headline": "Nepal stun West Indies in 1st T20I, register first-ever win over full-member side Nepal recorded their first-ever international win against an ICC full-member side as they beat West Indies by 19 runs in the first T20I at Sharjah. Rohit Paudel was adjudged Player of the Match for his innings of 38 off 35 and figures of 1/20 with the ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/julian-alvarez-brace-atletico-madrid-5-2-derby-win-real-madrid-2794521-2025-09-27",
      "headline": "Julian Alvarez stars as Atletico Madrid thrash Real Madrid 5-2 in derby Julian Alvarez scored twice as Atletico Madrid triumphed 5-2 over Real Madrid in a thrilling Madrid derby. The result ended Real's perfect start to the season and gave Atletico a major boost in their LaLiga campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-leads-india-to-win-over-new-zealand-womens-world-cup-warmup-2794519-2025-09-27",
      "headline": "INDW vs NZW: Harmanpreet helps India secure comfortable win in warm-up clash Harleen Deol and captain Harmanpreet Kaur both scored half-centuries as India Women comfortably chased down the target to secure a four-wicket victory (DLS) over New Zealand in their second and final Women's World Cup warm-up match in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-chelsea-lose-manchester-city-cruises-2794514-2025-09-27",
      "headline": "Liverpool suffer their first loss, Chelsea fall while Manchester City cruises Premier League champions Liverpool suffered their first loss of the season, going down 2-1 to Crystal Palace in the eighth minute of added time, while Manchester United and Chelsea also fell 3-1 on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-pakistan-saved-best-for-final-vs-india-salman-agha-2794507-2025-09-27",
      "headline": "Pakistan have saved their best for Asia Cup final: Salman Agha warns India Pakistan captain Salman Ali Agha believes his team has \"saved their best\" for Sunday's Asia Cup final against India. Despite losing their previous two encounters against India in Dubai, Salman expressed confidence that Pakistan could turn the tide in the high-pressure clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/shailesh-kumar-gold-world-para-athletics-championships-new-delhi-india-2794471-2025-09-27",
      "headline": "Shailesh Kumar wins gold as India shines at World Para Athletics in New Delhi Shailesh Kumar and Varun Singh Bhati opened India's medal account at the World Para Athletics Championships on Saturday, claiming gold and bronze respectively in the men's high jump T63 event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-final-india-vs-pakistan-wasim-akram-upset-chance-shaheen-afridi-abhishek-sharma-2794467-2025-09-27",
      "headline": "One good innings or spell can change course: Wasim Akram hopes for an upset vs India Asia Cup 2025: Wasim Akram believes India remain favourites, but Pakistan could cause an upset in the Asia Cup 2025 final. The high-stakes India-Pakistan clash in Dubai could turn into a classic T20 battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-final-india-vs-pakistan-salman-ali-agha-pre-match-press-conference-2794470-2025-09-27",
      "headline": "Pakistan's Salman Agha confident of best show vs India in Asia Cup final Pakistan captain Salman Ali Agha was confident that his side would rise to the occasion and deliver their best performance against arch-rivals India in the high-pressure Asia Cup final in Dubai. \"We can't control what's happening outside; we can only control the controllables. And that is winning the Asia Cup,\" he added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-salman-ali-agha-aggression-final-dubai-2794453-2025-09-27",
      "headline": "If someone wants to be aggressive, why not? Salman Agha gives free hand vs India Asia Cup 2025: Pakistan captain, Salman Ali Agha, revealed that he will give his players a free hand to showcase aggression when on the field. This sparks concerns, considering his side will meet India in the title clash on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-no-handshake-controversy-salman-agha-comments-2794451-2025-09-27",
      "headline": "Asia Cup final: Pakistan captain breaks silence on no handshake saga vs India Asia Cup final, India vs Pakistan: Pakistan captain Salman Ali Agha has broken his silence on the 'no handshake' controversy against India ahead of the Asia Cup final in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-final-india-vs-pakistan-sunil-gavaskar-reaction-2794448-2025-09-27",
      "headline": "SL thriller good wake-up call for India before Asia Cup final vs Pakistan: Gavaskar Batting great Sunil Gavaskar, while speaking to India Today, said that playing a high-intensity thriller against Sri Lanka just a day before the Asia Cup final against Pakistan could serve as a valuable wake-up call for India. The Men in Blue will face their arch-rivals in what promises to be a high-stakes encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-final-india-vs-pakistan-wasim-akram-upset-chance-shaheen-afridi-abhishek-sharma-2794467-2025-09-27",
      "headline": "One good innings or spell can change course: Wasim Akram hopes for an upset vs India Asia Cup 2025: Wasim Akram believes India remain favourites, but Pakistan could cause an upset in the Asia Cup 2025 final. The high-stakes India-Pakistan clash in Dubai could turn into a classic T20 battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-final-india-vs-pakistan-salman-ali-agha-pre-match-press-conference-2794470-2025-09-27",
      "headline": "Pakistan's Salman Agha confident of best show vs India in Asia Cup final Pakistan captain Salman Ali Agha was confident that his side would rise to the occasion and deliver their best performance against arch-rivals India in the high-pressure Asia Cup final in Dubai. \"We can't control what's happening outside; we can only control the controllables. And that is winning the Asia Cup,\" he added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-salman-ali-agha-aggression-final-dubai-2794453-2025-09-27",
      "headline": "If someone wants to be aggressive, why not? Salman Agha gives free hand vs India Asia Cup 2025: Pakistan captain, Salman Ali Agha, revealed that he will give his players a free hand to showcase aggression when on the field. This sparks concerns, considering his side will meet India in the title clash on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-no-handshake-controversy-salman-agha-comments-2794451-2025-09-27",
      "headline": "Asia Cup final: Pakistan captain breaks silence on no handshake saga vs India Asia Cup final, India vs Pakistan: Pakistan captain Salman Ali Agha has broken his silence on the 'no handshake' controversy against India ahead of the Asia Cup final in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-final-india-vs-pakistan-sunil-gavaskar-reaction-2794448-2025-09-27",
      "headline": "SL thriller good wake-up call for India before Asia Cup final vs Pakistan: Gavaskar Batting great Sunil Gavaskar, while speaking to India Today, said that playing a high-intensity thriller against Sri Lanka just a day before the Asia Cup final against Pakistan could serve as a valuable wake-up call for India. The Men in Blue will face their arch-rivals in what promises to be a high-stakes encounter."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}