{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-bank-shares-jump-21-percent-in-5-days-what-investors-need-to-know-2725245-2025-05-15",
      "headline": "YES Bank shares jump 21% in 5 days. What investors need to knowSMBC, a part of the Sumitomo Mitsui Financial Group (SMFG), plans to buy the 20% stake from State Bank of India (SBI) and seven private banks, HDFC Bank, ICICI Bank, Kotak Mahindra Bank, Axis Bank, IDFC First Bank, Federal Bank, and Bandhan Bank. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1200-points-higher-nifty-above-25000-tata-motors-surges-4-percent-2725220-2025-05-15",
      "headline": "Sensex ends 1,200 points higher, Nifty above 25,000; Tata Motors surges 4%The S&P BSE Sensex surged 1,200.18 points to end at 82,530.74, while the NSE Nifty50 gained 395.60 points to close at 25,062.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-claims-india-offered-zero-tariff-deal-in-trade-talks-2725187-2025-05-15",
      "headline": "Donald Trump claims India has offered zero-tariff deal in trade talksSpeaking at a business forum in Qatar, Trump said, \"India has offered us a deal where basically they are willing to literally charge us no tariff.\" He didn't provide further details, and there was no immediate response from the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-7-hidden-charges-you-must-know-about-processing-fee-late-payment-fee-emi-bounce-charges-2725178-2025-05-15",
      "headline": "Planning a personal loan? 7 hidden charges you must know aboutMany people only look at the interest rate when taking a personal loan. But there are several other costs that can add up. Knowing these charges helps you plan better, avoid surprises, and even negotiate some of them with the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-rally-sensex-jumps-1300-points-over-reports-of-india-offering-no-tariff-deal-to-us-nifty-gain-2725179-2025-05-15",
      "headline": "Sensex jumps 1,300 points: Why is stock market rising today?As of 2:38 p.m., the S&P BSE Sensex had gained 1,217.88 points to reach 82,548.44, and the NSE Nifty50 had climbed 410.57 points to 25,077.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fds-vs-ppf-which-investment-option-should-you-choose-and-why-2725126-2025-05-15",
      "headline": "FDs vs PPF: Which investment option should you choose and why?By investing in PPF, you can claim a tax exemption of up to Rs 1.5 lakh under Section 80C in a financial year, under the old tax regime. Moreover, the interest you earn from a PPF account is also tax-free. FDs, however, do not offer any tax deduction unless it's a 5-year tax-saving FD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-dont-want-you-to-build-in-india-they-can-take-care-of-themselves-trump-told-apple-ceo-tim-cook-report-2725124-2025-05-15",
      "headline": "Don't want you building in India, Trump tells Apple CEO Tim CookTrump's remarks came just days after India threatened to impose retaliatory tariffs on the US. This was in response to the US raising duties on Indian steel and aluminium exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-funds-load-up-on-it-cut-fmcg-and-telecom-stakes-in-april-report-2725083-2025-05-15",
      "headline": "Mutual funds load up on IT, cut FMCG and telecom stakes in April: ReportKotak Mahindra Bank attracted the highest MF investment in the financial sector, with Rs 1,586 crore. IDFC First Bank and HDFC Bank followed, drawing Rs 1,150 crore and Rs 1,026 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-rise-3-percent-why-reason-curvv-tiago-rashtrapati-bhavan-clsa-rating-2725044-2025-05-15",
      "headline": "Tata Motors shares rise 4% today. Here's whyThe rise in Tata Motors' share price comes even after the company reported a 51% fall in its consolidated net profit to Rs 8,470 crore for the quarter ending March 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/travel-sites-see-spike-in-turkey-azerbaijan-cancellations-over-pakistan-support-makemytrip-ixigo-report-major-cancellations-2725041-2025-05-15",
      "headline": "Travel sites see spike in Turkey, Azerbaijan cancellations over Pakistan supportBoycott calls grow as Turkey and Azerbaijan back Pakistan. Travel sites like MakeMyTrip and ixigo report major cancellations and suspended bookings to these destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-share-price-jumps-5-percent-as-technical-realty-demerger-confusion-fades-2724985-2025-05-15",
      "headline": "Raymond shares jump 5%. Why stock hit upper circuit today?At the Bombay Stock Exchange, Raymond shares were locked at Rs 578.70 in early trade, up 4.99%. The buying comes a day after the stock appeared to lose more than 60% of its value, a fall that was not driven by weak fundamentals or selling pressure but by a mechanical price adjustment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/virtual-galaxy-infotech-ipo-gmp-listing-gains-rs-87000-stock-market-debut-may-19-sme-2724983-2025-05-15",
      "headline": "Rs 87,000 profit on listing? This IPO's GMP suggests bonanza for investorsVirtual Galaxy Infotech IPO: The IPO received a strong response from all categories of investors as it was subscribed 231.45 times overall."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-to-screen-in-theatres-skipping-direct-ott-release-report-2725207-2025-05-15",
      "headline": "Bhool Chuk Maaf to screen in theatres, skipping direct OTT release: ReportRajkummar Rao and Wamiqa Gabbi's 'Bhool Chuk Maaf' will now release in theatres on May 23, 2025, after resolving a legal dispute with PVRInox over its initially planned direct OTT debut. The film will stream on Prime Video two weeks later, on June 6, as per a court directive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-gives-a-clap-for-vijay-deverakonda-brother-anand-deverakonda-new-film-2725222-2025-05-15",
      "headline": "Rashmika Mandanna gives a clap for Vijay Deverakonda's brother, Anand's new filmThe upcoming Anand Deverakonda–Vaishnavi Chaitanya-starrer was officially launched with a puja ceremony on May 15. Marking the reunion of the 'Baby' pair, the event was made special with Rashmika Mandanna giving the ceremonial first clap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-teaser-kay-kay-menon-fights-global-terrorism-in-new-spy-thriller-2725228-2025-05-15",
      "headline": "Special Ops 2 teaser: Kay Kay Menon fights global terrorism in new spy-thrillerThe makers of 'Special Ops 2' released a teaser of the show which is going to stream on JioHotstar. The series features Kay Kay Menon, Karan Tacker, Tahir Raj Bhasin and Prakash Raj, among others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-hc-stops-coercive-action-against-sonu-nigam-in-case-over-pahalgam-remark-during-bengaluru-concert-2725225-2025-05-15",
      "headline": "Court's relief to Sonu Nigam over controversial remarks at Bengaluru concertThe Karnataka High Court granted interim relief to singer Sonu Nigam in the case filed against him over his alleged remarks about Kannadigas during a concert in Bengaluru. The court ordered that no coercive action be taken against him, but told him to fully cooperate with the inquiry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-admits-kenishaa-is-companion-in-4-page-note-against-wife-aarti-2725188-2025-05-15",
      "headline": "Actor Ravi Mohan admits Kenishaa is 'companion' in 4-page note against wife AartiTamil actor Ravi Mohan shared a long statement on social media after his estranged wife accused him of being an absentee father. He also referred to his rumoured partner, singer Kenishaa, as his 'beautiful companion' in the same post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rrr-actor-jr-ntr-to-star-in-dadasaheb-phalke-biopic-made-in-india-reports-2725125-2025-05-15",
      "headline": "RRR actor Jr NTR to star in Dadasaheb Phalke biopic, Made in India: ReportsReports suggest that Jr NTR was impressed with the rich detailing in National Award-winner Nitin Kakkar's script, and has decided to play the role of \"Father of Indian Cinema\". \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-rajkumar-hirani-dadasaheb-phalke-biopic-indian-cinema-2725146-2025-05-15",
      "headline": "Aamir Khan, Rajkumar Hirani reunite for Dadasaheb Phalke biopicAamir Khan and Rajkumar Hirani are reuniting to make a biopic on Dadasaheb Phalke, the father of Indian cinema. The film will highlight Phalke's journey and legacy during India's independence era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-accuses-wife-aarti-of-physical-financial-abuse-denies-claims-about-children-in-new-statement-my-silence-was-survival-2725139-2025-05-15",
      "headline": "My silence was survival: Actor Ravi Mohan accuses wife Aarti of abuse, denies claimsTamil actor Ravi Mohan released a four-page statement after his estranged wife, Aarti, accused him of being an absentee father. The actor called his 'silence' on the matter a tactic to 'survive.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-becomes-the-honorary-ambassador-of-korea-tourism-in-india-2725084-2025-05-15",
      "headline": "Hina Khan becomes the honorary ambassador of Korea Tourism in India Actor Hina Khan has been named the Honorary Ambassador of Korea Tourism in India. She will promote South Korea's travel destinations to Indian audiences, inspiring more cultural and tourism exchanges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/amelie-bonnin-makes-history-as-first-female-director-to-open-cannes-since-1987-reacts-2725078-2025-05-15",
      "headline": "French filmmaker Amelie Bonnin's 'Leave One Day' scripts history at CannesFrench filmmaker Amelie Bonnin made history at the Cannes International Film Festival 2025. Her romantic dramedy 'Leave One Day' got a five-minute-plus ovation from the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-hangs-out-with-apoorva-mukhija-tanmay-bhatt-was-feeling-really-suffocated-2725131-2025-05-15",
      "headline": "Samay Raina hangs out with Apoorva Mukhija, Tanmay Bhatt: Was feeling really suffocatedComedian Samay Raina shared photos with Tanmay Bhat and Apoorva Mukhija in the wake of the India's Got Latent controversy. In a separate post, he reflected on his journey since the incident and expressed heartfelt gratitude to his fans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pakistani-songs-pulled-down-from-spotify-after-indian-government-advisory-2725114-2025-05-15",
      "headline": "Pakistani songs pulled down from Spotify after Indian government advisoryPakistani songs like 'Jhol', 'Maand' and others have been removed from Spotify after the Indian government's advisory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-sanu-daughter-shannon-k-attends-mission-impossible-premiere-cannes-film-festival-2025-2725088-2025-05-15",
      "headline": "Singer Shannon K attends Mission Impossible 8 premiere at Cannes Film FestivalSinger Shannon K dazzled at the Cannes Film Festival in a custom red gown by British designer Josh Birch Jones. She appeared at the 'Mission: Impossible 8' premiere and will also make an appearance with the cast and crew of 'Tanvi The Great'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/park-bo-young-got7-jinyoung-our-unwritten-soul-trailer-unveiled-2725052-2025-05-15",
      "headline": "Our Unwritten Seoul trailer out: Park Bo-young plays dual roles in emotional dramaThe upcoming Korean drama Our Unwritten Seoul stars Melo Movie's actor Park Bo-young and GOT7's Jinyoung as leads. Park Bo-young will have a dual role, playing opposite personas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-vijay-deverakonda-to-join-suriya-in-director-venky-atluris-suriya-46-2725054-2025-05-15",
      "headline": "Actor Vijay Deverakonda to join Suriya in director Venky Atluri's Suriya 46?Reportedly, Vijay Deverakonda will be collaborating on-screen with Retro actor Suriya in Venky Atluri's upcoming project, tentatively titled 'Suriya 46'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/director-raj-nidimoru-wife-shhyamali-shares-note-after-his-new-pic-with-samantha-goes-viral-2725069-2025-05-15",
      "headline": "Director Raj Nidimoru's wife shares note after his new pic with Samantha goes viralDirector Raj Nidimoru is rumoured to be dating actor Samantha. A new picture of the two is now doing the rounds, while his wife shared what looked like a cryptic note on her Instagram stories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-viral-pic-with-the-bads-of-bollywood-team-fans-demand-release-date-2725061-2025-05-15",
      "headline": "Aryan Khan's viral pic with The Bads of Bollywood team, fans demand release dateAryan Khan's picture with The Bads of Bollywood team has gone viral. Excited fans demanded release date of the upcoming Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-exits-no-entry-2-over-creative-differences-2725053-2025-05-15",
      "headline": "Diljit Dosanjh exits No Entry 2 over creative differences: ReportDiljit Dosanjh has reportedly stepped out of Varun Dhawan and Arjun Kapoor's 'No Entry 2', citing creative differences. Directed by Anees Bazmee, the film is backed by Boney Kapoor and Zee Studios. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-makes-a-dramatic-motorcycle-entry-at-cannes-film-festival-2025-2725023-2025-05-15",
      "headline": "Tom Cruise makes a dramatic motorcycle entry at Cannes Film Festival 2025Actor Tom Cruise made a grand motorcycle entry at Cannes 2025 for the premiere of 'Mission: Impossible – The Final Reckoning'. The film received a five-minute standing ovation for its intense action and Cruise's powerful performance."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-rejects-donald-trump-zero-tariff-offer-s-jaishankar-us-trade-deal-2725263-2025-05-15",
      "headline": "Nothing is decided: Jaishankar after Trump's 'zero tariffs' offer by India claimCalling India's trade talks with the US complicated, S Jaishankar said that the deal has to be mutually beneficial and work for both countries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-armed-forces-alert-operation-sindoor-china-turkey-pakistan-drone-missile-link-2725152-2025-05-15",
      "headline": "Operation Sindoor: Depth of Chinese involvement keeps India on 'hot standby'Indian armed forces remain on high alert as fragile peace continues along the Line of Control. India Today TV has learnt how the aftermath of Operation Sindoor exposed a complex China-Turkey-Pakistan collaboration in drone and missile attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-nations-one-future-aroon-purie-at-india-todays-india-uae-conclave-2725028-2025-05-15",
      "headline": "Two nations, one future: Aroon Purie at India Today's Indo-UAE ConclaveIndia Today Group's Chairman and Editor-in-Chief Aroon Purie highlighted how India-UAE ties go beyond economics. While speaking at India Today's Indo-UAE conclave, he said the partnership between the two countries is time-tested, multi-dimensional, and future-ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-dont-want-you-to-build-in-india-they-can-take-care-of-themselves-trump-told-apple-ceo-tim-cook-report-2725124-2025-05-15",
      "headline": "Don't want you building in India, Trump tells Apple CEO Tim CookTrump's remarks came just days after India threatened to impose retaliatory tariffs on the US. This was in response to the US raising duties on Indian steel and aluminium exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/boycott-turkey-calls-india-turkiye-president-recep-tayyip-erdogan-unmoved-support-true-brother-pakistan-2725186-2025-05-15",
      "headline": "Erdogan unmoved by boycott-Turkey calls, backs true brother PakistanEven as Indians and businesses expressed outrage over Turkey's military support to Pakistan during its armed confrontation with India, Turkish President Erdogan doubled down on backing Islamabad. He assured Pakistani PM Sharif that Turkey would stand by Pakistan in good times and bad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indus-treaty-to-remain-paused-s-jaishankar-day-after-pak-urges-reconsideration-2725264-2025-05-15",
      "headline": "Indus treaty to remain paused: S Jaishankar day after Pak urges reconsiderationS Jaishankar said that the only conversation India is willing to have on Kashmir is about the return of areas under Pakistan's illegal occupation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-encounter-amir-nazir-wani-mother-begs-terrorist-to-surrender-video-call-2725203-2025-05-15",
      "headline": "Mother begs terrorist to surrender in final video call before encounter in J&KThe terrorist, Amir Nazir Wani, can be seen holding an AK-47 while speaking to his mother on video call. He was amoung the three terrorists killed in encounter with security forces today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-claims-india-offered-zero-tariff-deal-in-trade-talks-2725187-2025-05-15",
      "headline": "Donald Trump claims India has offered zero-tariff deal in trade talksSpeaking at a business forum in Qatar, Trump said, \"India has offered us a deal where basically they are willing to literally charge us no tariff.\" He didn't provide further details, and there was no immediate response from the Indian government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-tral-encounter-drone-footage-jaish-terrorists-hiding-army-2725155-2025-05-15",
      "headline": "Drone footage shows Jaish terrorists taking cover before being killed in J&KThe videos show the terrorists, cornered by the security forces, hiding in the basement of what seems like an under-construction building in Tral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-radiation-leak-kirana-hills-india-global-nuclear-watchdog-report-iaea-2725089-2025-05-15",
      "headline": "What global nuclear watchdog said on 'radiation leak' at Pakistan facilitySocial media have been abuzz with speculation about a possible nuclear leak at Pakistan's Kirana Hills, which is believed to be a storage facility for nuclear warheads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/delhi-ncr-covered-in-gloomy-dusty-haze-its-coming-from-pakistan-2725099-2025-05-15",
      "headline": "Delhi-NCR covered in gloomy dusty haze: It's coming from PakistanThis sudden drop in air quality was due to a combination of gusty winds and an overnight dust surge that swept fine particles into the lower atmosphere."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-hc-stops-coercive-action-against-sonu-nigam-in-case-over-pahalgam-remark-during-bengaluru-concert-2725225-2025-05-15",
      "headline": "Court's relief to Sonu Nigam over controversial remarks at Bengaluru concertThe Karnataka High Court granted interim relief to singer Sonu Nigam in the case filed against him over his alleged remarks about Kannadigas during a concert in Bengaluru. The court ordered that no coercive action be taken against him, but told him to fully cooperate with the inquiry. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/man-strangled-to-death-electrocuted-by-son-to-stage-fake-accident-karnataka-2725185-2025-05-15",
      "headline": "Son strangles father, then electrocutes him to stage 'fake accident' in KarnatakaA 58-year-old Karnataka man was murdered by his son and friend who tried to cover up the crime as an accident. Police are investigating possible motives including harassment and property disputes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/boycott-turkey-azerbaijan-india-make-my-trip-business-trade-boycott-ankara-supported-pakistan-drone-personnel-2724723-2025-05-15",
      "headline": "Indians launch Track-II offensive as Turkey repays Op Dost with dronesIndians are anguished and hurt by Turkey's all-out military backing to Pakistan during its attacks on Indian civilians and soldiers despite India rushing in aid after a deadly earthquake in 2023. Indian traders are boycotting Turkish products while trip cancellations have risen 250%. JNU has suspended an MoU with a Turkish university and the Indian film industry has vowed not to shoot films in Turkey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-rajnath-singh-srinagar-five-days-after-india-pak-ceasefire-2725012-2025-05-15",
      "headline": "Are nukes safe in hands of rogue nation Pak? Rajnath Singh calls for supervisionDefence Minister slammed Pakistan's ability to handle nuclear weapons and questioned the global world if the nuclear weapons are safe in the hands of such a \"rogue\" nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/is-this-appropriate-top-court-raps-madhya-pradesh-minister-over-remarks-on-colonel-sofiya-qureshi-2725001-2025-05-15",
      "headline": "Just because you're a minister...: Top court's rebuke over remark on Col QureshiA day after the Madhya Pradesh High Court ordered an FIR against BJP Minister Kunwar Vijay Shah for \"hate speech\" against Army's Colonel Sofiya Qureshi, the minister had approached the Supreme Court for relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/haryana-man-takes-grandson-mustang-for-a-spin-viral-video-has-52-million-views-2725182-2025-05-15",
      "headline": "Haryana man takes grandson's Mustang for a spin. Viral video has 52 million viewsThe viral video was shared by a Haryana-based Instagram user who handed over the keys of his Mustang to his grandfather. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-mk-stalin-centre-president-supreme-court-reference-on-governor-rn-ravi-bills-deadlines-2725138-2025-05-15",
      "headline": "Sinister intent: MK Stalin slams Centre's Supreme Court move on governor's powersTamil Nadu Chief Minister MK Stalin slammed the Centre for seeking the Supreme Court's opinion on governor deadlines, calling it a threat to state autonomy. He urged non-BJP states to join the legal fight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-chief-minister-rekha-gupta-delay-bureaucratic-reshuffle-three-months-in-power-2725202-2025-05-15",
      "headline": "What's holding up Rekha Gupta from carrying out bureaucratic rejig in Delhi?According to sources, a BJP government in Delhi after 26 years has sparked a renewed interest among many senior bureaucrats to return to the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/clear-overreach-president-asks-chief-justice-to-clarify-14-questions-of-law-on-top-courts-tamil-nadu-ruling-2724937-2025-05-15",
      "headline": "How can you...: President's 14 questions to Supreme Court on deadline rulingThe newly sworn-in Chief Justice of India (CJI), BR Gavai, faces his first challenge in addressing the President's question on whether the Supreme Court can set a timeline for governors and the President, as observed by a two-judge bench in a landmark judgment in the Tamil Nadu Governor case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/photo/delhi-dust-pollution-visibility-drops-grey-skies-2725213-2025-05-15",
      "headline": "Delhi chokes under dust blanket as visibility drops, skies turn greyFrom historic landmarks like India Gate and Humayun's Tomb to busy intersections at Vijay Chowk and Film City, a thick layer of dust engulfed the capital on Thursday, May 15. Visibility plummeted, commuters shielded their faces, and metro trains cut through a haze that turned the city into a ghostly silhouette."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-purnam-shaw-abused-deprived-of-sleep-pakistan-custody-2724987-2025-05-15",
      "headline": "Verbally abused, blindfolded: How BSF jawan was treated in Pakistani custodyBSF jawan PK Shaw was handed over to Indian authorities by Pakistan after he was arrested on April 23 along the International Border in Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-lawyers-entry-india-new-strict-rules-2725217-2025-05-15",
      "headline": "No stay after 60 days: India issue stricter rules for foreign lawyers' entryForeign lawyers must now notify the Bar Council of India before arrival and disclose client details, as part of stricter rules despite India's 2023 decision to open its legal market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/crpf-sniffer-dog-rolo-dies-after-stung-200-times-in-bee-attack-during-anti-naxal-operation-2725204-2025-05-15",
      "headline": "CRPF sniffer dog stung by bees 200 times during anti-Naxal op, diesRolo, a two-year-old female sniffer dog of the CRPF, was the only casualty suffered by the security forces during their biggest anti-Naxal operation at the Korgotalu hills as the four-legged soldier was attacked and stung around 200 times by a swarm of bees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-to-screen-in-theatres-skipping-direct-ott-release-report-2725207-2025-05-15",
      "headline": "Bhool Chuk Maaf to screen in theatres, skipping direct OTT release: ReportRajkummar Rao and Wamiqa Gabbi's 'Bhool Chuk Maaf' will now release in theatres on May 23, 2025, after resolving a legal dispute with PVRInox over its initially planned direct OTT debut. The film will stream on Prime Video two weeks later, on June 6, as per a court directive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-gives-a-clap-for-vijay-deverakonda-brother-anand-deverakonda-new-film-2725222-2025-05-15",
      "headline": "Rashmika Mandanna gives a clap for Vijay Deverakonda's brother, Anand's new filmThe upcoming Anand Deverakonda–Vaishnavi Chaitanya-starrer was officially launched with a puja ceremony on May 15. Marking the reunion of the 'Baby' pair, the event was made special with Rashmika Mandanna giving the ceremonial first clap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-teaser-kay-kay-menon-fights-global-terrorism-in-new-spy-thriller-2725228-2025-05-15",
      "headline": "Special Ops 2 teaser: Kay Kay Menon fights global terrorism in new spy-thrillerThe makers of 'Special Ops 2' released a teaser of the show which is going to stream on JioHotstar. The series features Kay Kay Menon, Karan Tacker, Tahir Raj Bhasin and Prakash Raj, among others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-hc-stops-coercive-action-against-sonu-nigam-in-case-over-pahalgam-remark-during-bengaluru-concert-2725225-2025-05-15",
      "headline": "Court's relief to Sonu Nigam over controversial remarks at Bengaluru concertThe Karnataka High Court granted interim relief to singer Sonu Nigam in the case filed against him over his alleged remarks about Kannadigas during a concert in Bengaluru. The court ordered that no coercive action be taken against him, but told him to fully cooperate with the inquiry. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-southee-brendon-mccullum-england-men-coaching-2725227-2025-05-15",
      "headline": "Southee joins McCullum in England men's coaching staffEngland have roped in former New Zealand pacer Tim Southee in their coaching staff. He will join the team before the Test against Zimbabwe and will stay until the end of the Test series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-anaya-bangar-tips-training-2725211-2025-05-15",
      "headline": "Virat Kohli has given me tips, I have trained with him: Anaya BangarAnaya Bangar, daughter of Sanjay Bangar, revealed that Virat Kohli once shared batting tips with her and that she had the opportunity to train with the veteran Indian cricketer alongside her father.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-gautam-gambhir-siddhivinayak-temple-visit-bcci-2725153-2025-05-15",
      "headline": "Gautam Gambhir visits Siddhivinayak temple ahead of England tour selection meetingIndia coach Gautam Gambhir visited the Siddhivinayak temple in Mumbai on Thursday, May 15 to seek blessings ahead of the BCCI selection meeting for the upcoming England tour. India will face England in 5 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mitchell-owen-psl-punjab-kings-2725149-2025-05-15",
      "headline": "Mitchell Owen links up with Punjab Kings, leaves PSL midwayMitchell Owen has joined the Punjab Kings for the Indian Premier League in 2025 after leaving the Pakistan Super League midway, where he played for the Peshawar Zalmi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rcb-all-white-tribute-harsha-bhogle-bengaluru-2725127-2025-05-15",
      "headline": "RCB fans plan all-white tribute to Virat Kohli in Bengaluru, Harsha Bhogle respondsThe RCB fans are planning an all-white tribute for Virat Kohli during the IPL 2025 match against KKR on May 17 and Harsha Bhogle has responded to the initiative. Kohli retired from Test cricket on May 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-ab-de-villiers-test-retirement-2725103-2025-05-15",
      "headline": "He's an absolute pain to play against: De Villiers on disliking Kohli earlierAB de Villiers said that he started developing his liking for Virat Kohli after meeting him at the Royal Challengers Bengaluru (RCB) in the Indian Premier League. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-india-vs-england-sanjay-manjrekar-2725063-2025-05-15",
      "headline": "Virat Kohli, Rohit Sharma retirements: No need to panic, says Sanjay ManjrekarSanjay Manjrekar feels that there is no need to panic about the Indian Test team, despite the surprise retirements of Virat Kohli and Rohit Sharma. Manjrekar feels that India will continue to be a top Test team despite Kohli and Rohit leaving the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-punam-raut-india-history-womens-odis-on-this-day-2725047-2025-05-15",
      "headline": "On This Day: Deepti Sharma, India rewrite history in Women's ODIsOn This Day: Deepti Sharma and Punam Raut rewrote history books with their incredible performances in India's 249-run win over Ireland at Senwes Park in Potchefstroom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-liam-livingstone-aakash-chopra-2725013-2025-05-15",
      "headline": "RCB may have to play Liam Livingstone with doubt over major stars: Aakash ChopraAakash Chopra feels that RCB may need to turn to the underperforming Liam Livingstone for the remainder of the IPL 2025 season if their big names may not be available once the season restarts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jack-draper-italian-open-quarterfinal-2725006-2025-05-15",
      "headline": "Didn't let him dominate: Alcaraz says aggression helped him vs DraperItalian Open 2025: Carlos Alcaraz advanced to the semi-final of the men's singles in Rome after beating Jack Draper 6-3, 6-4 in an hour and 37 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-football-team-carlo-ancelotti-new-manager-dunga-felipe-melo-2724994-2025-05-15",
      "headline": "Carlo Ancelotti was brought in to get results: Brazil legends hail appointmentBrazil legends Dunga, Felipe Melo and Mauro Silva have hailed the appointment of Carlo Ancelotti as the new coach of the national team. The legends are hoping Ancelotti can bring about a change in fortunes for Brazil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-india-vs-england-sanjay-manjrekar-2725063-2025-05-15",
      "headline": "Virat Kohli, Rohit Sharma retirements: No need to panic, says Sanjay ManjrekarSanjay Manjrekar feels that there is no need to panic about the Indian Test team, despite the surprise retirements of Virat Kohli and Rohit Sharma. Manjrekar feels that India will continue to be a top Test team despite Kohli and Rohit leaving the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/deepti-sharma-punam-raut-india-history-womens-odis-on-this-day-2725047-2025-05-15",
      "headline": "On This Day: Deepti Sharma, India rewrite history in Women's ODIsOn This Day: Deepti Sharma and Punam Raut rewrote history books with their incredible performances in India's 249-run win over Ireland at Senwes Park in Potchefstroom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-liam-livingstone-aakash-chopra-2725013-2025-05-15",
      "headline": "RCB may have to play Liam Livingstone with doubt over major stars: Aakash ChopraAakash Chopra feels that RCB may need to turn to the underperforming Liam Livingstone for the remainder of the IPL 2025 season if their big names may not be available once the season restarts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jack-draper-italian-open-quarterfinal-2725006-2025-05-15",
      "headline": "Didn't let him dominate: Alcaraz says aggression helped him vs DraperItalian Open 2025: Carlos Alcaraz advanced to the semi-final of the men's singles in Rome after beating Jack Draper 6-3, 6-4 in an hour and 37 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-football-team-carlo-ancelotti-new-manager-dunga-felipe-melo-2724994-2025-05-15",
      "headline": "Carlo Ancelotti was brought in to get results: Brazil legends hail appointmentBrazil legends Dunga, Felipe Melo and Mauro Silva have hailed the appointment of Carlo Ancelotti as the new coach of the national team. The legends are hoping Ancelotti can bring about a change in fortunes for Brazil. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}