{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-your-itr-deadline-3-filing-options-you-can-still-use-2789352-2025-09-18",
      "headline": "Missed your ITR deadline? 3 filing options you can still useIf you missed the Income Tax Return (ITR) deadline, don't panic. Taxpayers still have ways to stay compliant and avoid penalties, with three key filing options available even after the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-get-a-loan-this-festive-season-here-is-what-you-can-do-2789313-2025-09-18",
      "headline": "Want to get a loan this festive season? Here's what you can doFrom new clothes and jewellery to family trips and home makeovers, festivals often come with added costs. A personal loan can help bridge the gap, here's a simple guide to getting one this festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ivalue-infosolutions-ipo-opens-subscription-gmp-price-band-key-details-2789308-2025-09-18",
      "headline": "iValue Infosolutions IPO opens: Should you consider subscribing?iValue Infosolutions plans to Rs 560 crore through an offer-for-sale of 1.87 crore shares. The price band is set at Rs 284–299 per share, with a minimum investment of 50 shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-2025-how-long-will-it-take-to-reach-you-2789265-2025-09-18",
      "headline": "ITR refund 2025: How long will it take to reach you?Millions of taxpayers who filed their returns by the September 16 deadline are now waiting for the next big step, i.e., getting their refunds. But how long does it actually take for the money to land in your bank account?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-loans-rising-demand-india-explained-2789242-2025-09-18",
      "headline": "Why gold loans are no longer just a last resort for borrowersGold loans are shedding their emergency-only image, becoming a mainstream credit choice for urban, semi-urban, and rural India, driven by gold prices, regulation, digital access, and flexible borrowing solutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/should-investors-buy-it-stocks-right-now-heres-what-ventura-securities-says-2789216-2025-09-18",
      "headline": "Should investors buy IT stocks right now? Here's what Ventura Securities saysVentura Securities warns of a shift, with US-driven risks mounting, domestic sectors like banking and NBFCs offer a safer path, leaving IT investors to weigh growth against growing uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-350-points-higher-nifty-above-25400-infosys-wipro-lead-gains-2789196-2025-09-18",
      "headline": "Sensex, Nifty rise on US Fed rate cut; Infosys, Wipro gainThe S&P BSE Sensex gained over 350 points to trade above the 83,000 mark, while the NSE Nifty50 crossed 25,400 in early trade. Broader market indices also saw gains, with volatility remaining stable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dreamfolks-crisis-explained-what-is-going-on-and-what-it-means-for-investors-2789185-2025-09-18",
      "headline": "DreamFolks crisis explained: What's going on and what it means for investorsFounded in 2013, DreamFolks acted as a platform connecting banks, credit card companies, and passengers to airport lounges, food services, baggage handling, and other airport amenities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-cuts-rates-for-1st-time-this-year-will-it-give-a-boost-to-dalal-street-2789174-2025-09-18",
      "headline": "US Fed cuts rates for 1st time this year. Will it give a boost to Dalal Street?Lower US interest rates tend to make emerging markets like India more attractive to foreign portfolio investors (FPIs), as dollar assets lose some shine and Treasury yields ease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/urban-company-share-price-blockbuster-stock-market-listing-debut-decoding-rally-what-next-2789167-2025-09-18",
      "headline": "Urban Company shares register bumper debut on Dalal Street, but what's next?Urban Company's shares, issued at Rs 103, opened at Rs 162.25 and surged as much as 74% during the day. For those who got shares in the IPO, that meant instant profits and a near $3 billion market value for the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ben-and-jerrys-co-founder-jerry-greenfield-quits-accuses-unilever-of-silencing-brands-activism-2788978-2025-09-17",
      "headline": "Ben & Jerry's co-founder quits, accuses Unilever of silencing brand's activismBen & Jerry's co-founder Jerry Greenfield has stepped down from the company after 47 years, saying its independence to speak on social issues has been eroded under Unilever's ownership. Unilever, which is spinning off its ice cream business, thanked Greenfield for his service but disagreed with his claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-it-defence-psu-banking-sector-likely-to-see-growth-on-dalal-street-expert-advice-2788858-2025-09-17",
      "headline": "IT, defence or PSU banking: Which sector is likely to see growth on D-Street?PSU banking stocks have started gaining attention after a long period of underperformance, while the IT sector remains in a state of uncertainty. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/akshay-kumar-sujoy-ghosh-shower-praise-on-aryan-khan-the-bads-of-bollywood-2789350-2025-09-18",
      "headline": "Akshay Kumar, Sujoy Ghosh shower praise on Aryan Khan's The B***ds of BollywoodActor Akshay Kumar, producer Guneet Monga and other celebrities congratulated Aryan Khan on his \"incredible\" debut with 'The B***ds of Bollywood'. Director Sujoy Ghosh also praised Aryan's directorial series for its humour'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/visually-impaired-ias-officer-ayushi-quits-kbc-17-with-rs-25-lakh-prize-2789351-2025-09-18",
      "headline": "KBC 17: Visually-impaired IAS officer fails to answer Rs 50 lakh question. Can you?Visually-impaired IAS officer Ayushi participates in 'Kaun Banega Crorepati 17'. She decides to quit at the Rs 50 lakh question, securing Rs 25 lakh . The question involved a rock band honouring Columbia astronauts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-anurag-kashyap-chose-aaishvary-thackeray-for-nishaanchi-hunger-over-surname-2788717-2025-09-18",
      "headline": "Why Anurag Kashyap chose Aaishvary Thackeray for Nishaanchi: Hunger over surnameFilmmaker Anurag Kashyap opens up on why debutant Aaishvary Thackeray was the perfect choice for 'Nishaanchi', praising his hunger, risk-taking, and debut in a challenging double role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-25-mass-nominations-after-rule-break-shake-up-the-house-2789354-2025-09-18",
      "headline": "Bigg Boss 19 episode 25: Mass nominations after rule break shake up the houseIn 'Bigg Boss 19' episode 25, housemates were punished with mass nominations after breaking the rules, leading to heated confrontations, emotional breakdowns, and shifting alliances. The captaincy task further fuelled chaos with physical tussles, insults, and high drama inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-finale-had-the-most-bollywood-desi-ending-ever-2789368-2025-09-18",
      "headline": "The Summer I Turned Pretty finale had the most Bollywood, desi ending ever'The Summer I Turned Pretty' finale gave fans the ultimate Bollywood-style ending. From Belly and Conrad's dreamy Paris train reunion to echoes of 'DDLJ' and Yash Raj romances, here's why the show's last episode felt like pure desi cinema magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raghava-lawrence-opens-meal-center-benz-actor-2789345-2025-09-18",
      "headline": "Actor Raghava Lawrence opens meal center, calls it a venture close to his heartTamil actor-director Raghava Lawrence named the meal center after his mother, and shared that the initiative aims to make food varieties that are usually consumed by the wealthy accessible to people with lower economic backgrounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-larissa-bonesi-aryan-khan-rumoured-partner-stole-the-show-at-his-premiere-2789330-2025-09-18",
      "headline": "Who is Larissa Bonesi, Aryan Khan's rumoured girlfriend, at Ba***ds premiere?Brazilian model-actor Larissa Bonesi, rumoured to be Aryan Khan's girlfriend, stole the spotlight at the premiere of his Netflix debut 'The Ba***ds of Bollywood' in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mohali-court-quashes-fir-yo-yo-honey-singh-makhna-song-case-2789320-2025-09-18",
      "headline": "Court quashes FIR against Yo Yo Honey Singh in 'Makhna' song caseA Mohali court has quashed the FIR against singer Yo Yo Honey Singh regarding alleged objectionable lyrics in his 2018 song 'Makhna' after both complainants stated they had no objection to closure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-beep-beeps-of-bollywood-joke-cracks-up-shah-rukh-khan-and-ajay-devgn-bads-of-bollywood-premiere-2789307-2025-09-18",
      "headline": "Kajol's 'beep beeps of Bollywood' joke cracks up SRK and Ajay Devgn'The Bads of Bollywood', rolled out its red carpet with a premiere that was equal parts glitz and giggles. Kajol shared a clip where her quick-witted humour stole the spotlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-exits-kalki-part-2-producers-say-sequel-deserves-commitment-2789310-2025-09-18",
      "headline": "Deepika Padukone dropped from Kalki 2, producers say sequel deserves commitmentDeepika Paudkone will not be a part of the sequel to director Nag Ashwin's 'Kalki 2898 AD', production house Vyjayanthi Movies announced. A film like 'Kalki' deserves commitment and much more, the official statement read."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-next-period-film-fauji-to-feature-abhishek-bachchan-in-key-role-2789281-2025-09-18",
      "headline": "Prabhas' next period film Fauji to feature Abhishek Bachchan in key role: ReportActor Prabhas is currently working on 'Fauji', a pre-Independence love story directed by Hanu Raghavapudi. Reports suggest that Abhishek Bachchan has been roped in for a key role in the project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/son-ye-jin-praises-park-chan-wooks-precise-direction-no-other-choice-biff-2024-2789246-2025-09-18",
      "headline": "Exclusive: Son Ye-jin praises Park Chan-wook's eye for awkward momentsSon Ye-jin shares her experience working with Park Chan-wook on 'No Other Choice' in an exclusive interaction with India Today at BIFF. The actor highlights the director's meticulous approach, offering new insights into performance and filmmaking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/harshvardhan-rane-supports-aamir-khan-pledges-to-bear-his-own-entourage-expenses-2789252-2025-09-18",
      "headline": "Harshvardhan Rane supports Aamir Khan, pledges to bear his own entourage expensesActor Harshvardhan Rane has pledged to pay for his own entourage expenses, supporting producers amid the ongoing debate on soaring star costs in Bollywood. His statement comes after Aamir Khan, Varun Dhawan, and other industry voices raised concerns over the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sweet-moment-with-paparazzi-clicked-by-aryan-khan-the-bads-of-bollywood-screening-wins-the-internet-2789272-2025-09-18",
      "headline": "SRK's adorable photo-op with media, shot by Aryan, wins internetShah Rukh Khan, joined by Gauri Khan, daughter Suhana, and son AbRam, attended the screening of Aryan Khan's debut series 'The B***ds of Bollywood'. Among the many viral moments from the event, one clip of SRK striking poses with the paparazzi has particularly captured attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-og-tickets-special-show-priced-1000-andhra-pradesh-2789243-2025-09-18",
      "headline": "Pawan Kalyan's OG tickets for special show priced at Rs 1,000 in Andhra PradeshThe Andhra Pradesh government has allowed special benefit shows for Pawan Kalyan's 'They Call Him OG' with tickets priced at Rs 1,000. The ticket prices have been increased for both single screens and multiplexes for the first ten days after release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lee-byung-hun-praises-park-chan-wook-detailed-direction-no-other-choice-2789235-2025-09-18",
      "headline": "Exclusive: Lee Byung-hun credits Park Chan-wook's precision for his toughest roleIn an exclusive chat with India Today in Busan, actor Lee Byung-hun opened up about how Park Chan-wook's razor-sharp direction shaped his challenging role in 'No Other Choice'. The film, which had the honour of opening the Busan International Film Festival, also marks Son Ye-jin's much-awaited return to the screen after seven years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-box-office-japanese-anime-stirs-storm-in-india-crosses-rs-50-crore-2789219-2025-09-18",
      "headline": "Demon Slayer Infinity Castle storms Indian box office, races past Bollywood hits'Demon Slayer: Kimetsu no Yaiba – Infinity Castle' has taken the Indian box office by storm, earning Rs 51.20 crore in six days and outpacing many Bollywood and Hollywood releases. The movie is currently running in theatres worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/ranbir-kapoor-alia-bhatt-madhuri-dixit-the-bads-of-bollywood-premiere-2789199-2025-09-18",
      "headline": "Ranbir-Alia, Madhuri Dixit and celebs shine at The Ba***ds of Bollywood premiereMadhuri Dixit, Ranbir Kapoor, Alia Bhatt, and Bollywood's biggest stars lit up The 'Ba***ds of Bollywood' premiere with glamour, style, and star power.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-renews-we-were-liars-second-season-new-mysteries-2789188-2025-09-18",
      "headline": "Prime Video renews We Were Liars for a darker, twistier Season 2Prime Video has greenlit a second season of the hit thriller 'We Were Liars', after a debut that enthralled audiences with its intoxicating blend of privilege, secrets, and betrayal. The new chapter promises sharper twists and a darker dive into the Sinclair family's haunting past. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/software-used-fake-applications-filed-rahul-gandhi-cites-karnataka-as-example-alleges-voter-names-deleted-2789274-2025-09-18",
      "headline": "6,000 voter names deleted in Karnataka's Aland: Rahul Gandhi presents 'proof'Congress leader Rahul Gandhi on Thursday sharpened his 'vote chori' attack on the BJP and the Election Commission as he came armed with proof of systemic voter fraud, with Karnataka's Aland constituency as the prime example."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/respect-all-religions-chief-justice-br-gavai-clarifies-after-go-ask-deity-remark-on-vishnu-idol-plea-stirs-2789415-2025-09-18",
      "headline": "Under fire for deity remark, what Chief Justice Gavai said in own defenceThe Chief Justice made the remarks on Tuesday while hearing a petition to restore a damaged Vishnu idol in Madhya Pradesh. While dismissing the plea, the court asked the petition to \"go and ask the deity itself to do something\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/baseless-and-incorrect-election-commission-junks-rahul-gandhis-big-vote-chori-charge-2789335-2025-09-18",
      "headline": "Baseless: Election Commission on Rahul Gandhi's charge against CEC Gyanesh KumarThe poll body acknowledged that certain unsuccessful attempts were made to delete electors in Karnataka's Aland Assembly Constituency, and an FIR was filed by the Election Commission of India to investigate the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-pakistan-defence-pact-joint-response-to-attack-what-it-means-india-2789321-2025-09-18",
      "headline": "Will Saudi involve itself if India, Pak go to war again? What the deal meansSaudi Arabia has signed a defence pact with nuclear-armed Pakistan, vowing that any attack on either nation will be considered an attack on both. Analysts have called the pact nothing but posturing. What does it mean for India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-exits-kalki-part-2-producers-say-sequel-deserves-commitment-2789310-2025-09-18",
      "headline": "Deepika Padukone dropped from Kalki 2, producers say sequel deserves commitmentDeepika Paudkone will not be a part of the sequel to director Nag Ashwin's 'Kalki 2898 AD', production house Vyjayanthi Movies announced. A film like 'Kalki' deserves commitment and much more, the official statement read."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-election-commission-vote-chori-hydrogen-bomb-proof-karnataka-godabai-2789363-2025-09-18",
      "headline": "Godabai, Suryakant, Nagaraj: The 'proof' in Rahul Gandhi's new voter fraud bombRahul Gandhi presented three case studies while accusing the Election Commission of mass deletion of voters from Congress strongholds ahead of the 2023 Karnataka election. Let's have a look at the evidence presented by Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/maruti-suzuki-cars-gst-reduction-eyes-higher-motorisation-in-india-2789408-2025-09-18",
      "headline": "Maruti Suzuki slashes prices post-GST cut, eyes higher motorisation in IndiaMaruti Suzuki has slashed car prices across its lineup after the GST cut, aiming to boost demand, expand affordability, and drive higher car ownership in India where penetration remains low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/opposition-jds-hd-kumaraswamy-bengaluru-city-of-potholes-blames-ktaka-government-failure-poor-roads-blackbuck-orr-office-exit-2789399-2025-09-18",
      "headline": "City of potholes: Opposition slams Congress as Bengaluru firm's CEO flags bad roadsA Bengaluru logistics firm's exit from its Bellandur office over poor roads has sparked a political storm in Karnataka, with the Opposition slamming the government's handling of civic infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nuclear-power-and-islamic-how-pakistan-has-become-self-appointed-ummah-champion-asim-munir-arab-nato-2788972-2025-09-18",
      "headline": "How Pakistan uses just two cards to tap the Islamic ummahPakistan, the only Muslim nuclear-powered country, pitched for an Islamic NATO. It has signed a defence pact with Saudi Arabia, legitimising its nuclear weapons for Riyadh's use if attacked. Pakistan has used just two cards—nuclear and Islamic—to tap the ummah, with the ulterior motive of seeking aid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/71-year-old-us-woman-travelled-punjab-marry-uk-based-nri-75-found-dead-2789384-2025-09-18",
      "headline": "67-year-old US woman travelled to Punjab to marry UK-based NRI, 75; found deadThe incident dates back to July when Rupinder Kaur Pandher, an American citizen based in Seattle, arrived in Ludhiana at the invitation of Charanjit Singh Grewal, the 75-year-old would-be groom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-finale-had-the-most-bollywood-desi-ending-ever-2789368-2025-09-18",
      "headline": "The Summer I Turned Pretty finale had the most Bollywood, desi ending ever'The Summer I Turned Pretty' finale gave fans the ultimate Bollywood-style ending. From Belly and Conrad's dreamy Paris train reunion to echoes of 'DDLJ' and Yash Raj romances, here's why the show's last episode felt like pure desi cinema magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cec-gyanesh-kumar-press-conference-congress-needed-smiling-buddha-rahul-gandhi-hydrogen-bomb-allegations-vote-chori-2789381-2025-09-18",
      "headline": "Needed: A Smiling Buddha for Rahul Gandhi's Hydrogen BombRahul Gandhi, the Leader of Opposition in the Lok Sabha, has alleged manipulation of the election process with a second media meet in less than two months. Chief Election Commissioner Gyanesh Kumar earlier aggressively countered Rahul, seeking an affidavit. The EC needs to probe and assure people that polls in India are free and fair. And this, CEC Kumar must do calmly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-wants-to-create-bangladesh-nepal-like-situation-in-india-bjp-slams-new-vote-chori-charge-2789378-2025-09-18",
      "headline": "Rahul Gandhi wants to create Nepal-like unrest in India: BJP on vote chori chargeRahul Gandhi wants to create Bangladesh and Nepal-like situation in India, BJP's Anurag Thaku said while slamming his 'vote chori' charge against the Centre and Election Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-vote-chori-hydrogen-bomb-press-conference-live-updates-congress-mp-2789207-2025-09-18",
      "headline": "Live: Allegation is Rahul Gandhi's 'ornament', habitually makes false claims, says BJPRahul Gandhi vote chori press meeting Live: Congress MP and Lok Sabha LoP Rahul Gandhi steps up attack on the Election Commission, alleging large-scale voter deletions through software-driven fraud; presents 'evidence' from Karnataka to back claims. Rahul Gandhi said he would soon come out with a \"hydrogen bomb\" of revelations about \"vote chori\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-neeraj-chopra-vs-arshad-nadeem-final-javelin-2789334-2025-09-18",
      "headline": "Neeraj vs Arshad: Why India vs Pakistan in the javelin final is only a subplotWorld Athletics Championships 2025: Neeraj Chopra and Arshad Nadeem's rivalry will grab subcontinental headlines, but the men's javelin final in Tokyo is stacked with world-class talent. From Germany's Julian Weber to former champions Anderson Peters and Julius Yego, the contest promises far more than just an India-Pakistan subplot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/iron-beam-israel-deploys-star-wars-inspired-worlds-first-laser-interceptor-2789382-2025-09-18",
      "headline": "Iron Beam: Israel unveils Star Wars-style laser defence systemRafael Advanced Defence Systems officially released the Iron Beam laser system this week that could change modern military warfare forever."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-kp-sharma-oli-demand-helicopter-to-flee-gen-z-protests-nepo-kids-army-chief-sigdel-resignation-condition-kathmandu-2789332-2025-09-18",
      "headline": "Helicopter only after you resign: What Nepal Army chief told Oli amid Gen Z protestsAs violent Gen Z-led protests engulfed Nepal, including the capital Kathmandu, then PM KP Sharma Oli's plea for a helicopter for a safe exit was met with army chief Ashok Raj Sigdel's condition. He asked Oli to resign first, says a report. This sealed the fate of the Oli regime, which faced heat over corruption and authoritarianism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/the-perfect-protein-supplement-for-your-diet-2788800-2025-09-18",
      "headline": "The smart guide to choosing the right protein supplement for your dietProtein plays a crucial role in your fitness and wellness, but choosing the right supplement can be confusing. This simple guide breaks it down for you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/as-nano-banana-becomes-a-viral-hit-in-india-google-tells-how-you-can-spot-ai-images-on-social-media-2789386-2025-09-18",
      "headline": "As Nano Banana becomes a hit in India, Google tells how you can spot AI imagesNano Banana AI images have quickly taken over social media, with India becoming the largest market for the new Google Gemini feature. If you find the swarm of AI images on the internet, a bit much, or just happen to care about your privacy, Google has a few pointers for you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/no-sex-for-life-scientists-decode-why-some-adults-never-want-to-have-sex-2789333-2025-09-18",
      "headline": "Why some adults never want to have sex? Science decodedUsing one of the largest datasets of its kind, the research analysed responses from more than 4,00,000 UK adults and 13,500 Australians to understand why some people never engage in sexual activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-a-hydrogen-bomb-not-rahul-gandhis-vote-chori-the-real-one-2789251-2025-09-18",
      "headline": "What is a hydrogen bomb? Not Rahul Gandhi's, the real oneWhile Rahul used the metaphor to describe a political-cum-electoral expose, the phrase has drawn attention to the terrifying reality of the actual hydrogen bomb."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/upsc-iit-prep-destroy-indias-brightest-talent-startup-founder-viral-post-2789328-2025-09-18",
      "headline": "UPSC, IIT prep waste '8 prime years' of India's brightest minds: Startup founderStartup founder Akhil Suhag has sparked debate by criticising India's obsession with entrance exams, claiming they waste \"8 prime years\" of students' lives and kill raw talent before it reaches global potential."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-townsend-chinese-cuisine-controversy-billie-jean-king-cup-shenzhen-apology-2789137-2025-09-18",
      "headline": "Zheng Qinwen slams Taylor Townsend after Chinese cuisine comments spark backlashAmerican tennis player Taylor Townsend sparked controversy with remarks on Chinese cuisine during the Billie Jean King Cup finals in Shenzhen. The incident highlighted the importance of cultural respect in global sports and led to a public apology from Townsend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-kapil-dev-india-vs-pakistan-handshake-row-focus-on-playing-cricket-2789402-2025-09-18",
      "headline": "Focus on playing cricket: Kapil Dev's take on Pakistan's Asia Cup handshake rowKapil Dev has urged Pakistan to shift focus back to cricket, downplaying the handshake controversy from their Asia Cup clash with India. The World Cup legend stressed that performances matter more than symbolic gestures or off-field disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-future-roles-retirement-wrestling-wrestlepalooza-2025-2789124-2025-09-18",
      "headline": "CM Punk comments on future after WWE retirement: There's 1000 hats I could wearCM Punk has spoken about his WWE future after retirement, revealing he could take up roles like commentary, producing, or creative work. Ahead of WrestlePalooza 2025, Punk also teased he still has plenty left in the tank."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-cricket-team-unity-indo-pak-tensions-asia-cup-2025-2789383-2025-09-18",
      "headline": "UAE play as a family: Waseem dismisses rift in camp amid India-Pakistan tensionsUAE captain Muhammad Waseem highlights unity within the team despite Indo-Pak political tensions. The squad remains focused on cricket as India and Pakistan prepare to face each other again in the Super Four stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-contract-extension-major-league-soccer-reports-2789356-2025-09-18",
      "headline": "Lionel Messi and Inter Miami enter discussions for contract extension: ReportsLionel Messi is set to extend his Inter Miami stay, with reports indicating a deal until 2027. His stunning impact on MLS has transformed the club and boosted American soccer's global profile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-injury-withdrawal-china-open-boosts-iga-swiatek-wta-ranking-race-2025-2789342-2025-09-18",
      "headline": "Swiatek to become No.1? Sabalenka's China Open pullout spices up raceAryna Sabalenka's withdrawal from the China Open opens the door for Iga Swiatek to close the gap in the race for the WTA No.1 ranking. A strong run in Seoul and Beijing could bring Swiatek within striking distance of the top spot.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-6-live-results-neeraj-chopra-arshad-nadeem-pooja-olla-2789346-2025-09-18",
      "headline": "Day 6 Live Updates: Neeraj Chopra aims to defend crown in javelin finalWorld Athletics Championships Day 6 Live: The spotlight will be on Neeraj Chopra as he aims to defend his crown at the World Athletics Championships on Thursday, September 18. Neeraj will be up against a strong field that includes compatriot Sachin Yadav and arch-rival and Olympic champion, Arshad Nadeem. Apart from this, India's Pooja Olla will be in action in the 800m heats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-neeraj-chopra-vs-arshad-nadeem-final-javelin-2789334-2025-09-18",
      "headline": "Neeraj vs Arshad: Why India vs Pakistan in the javelin final is only a subplotWorld Athletics Championships 2025: Neeraj Chopra and Arshad Nadeem's rivalry will grab subcontinental headlines, but the men's javelin final in Tokyo is stacked with world-class talent. From Germany's Julian Weber to former champions Anderson Peters and Julius Yego, the contest promises far more than just an India-Pakistan subplot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-nepal-t20i-series-2025-squads-uncapped-players-2789331-2025-09-18",
      "headline": "Akeal Hosein captain, 5 uncapped players in as West Indies reveal Nepal series squadWest Indies have announced their squad for the upcoming historic series against Nepal with five uncapped players included in the mix. Akeal Hosein will be leading the team in the absence of many senior players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/won-myong-gyong-wins-50kg-wrestling-gold-2025-world-championships-zagreb-video-2789309-2025-09-18",
      "headline": "Watch: Won Myong-gyong hugs referee in joy after World Wrestling Championships goldWon Myong-gyong clinched the women's 50 kg gold at the 2025 World Wrestling Championships, defeating China's Yu Zhang in the final. Her victory, highlighted by a heartfelt hug with the referee, marked only her country's third women's world title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-yashasvi-jaiswal-india-white-ball-team-2026-world-cup-2789293-2025-09-18",
      "headline": "Yashasvi Jaiswal's white-ball format absence seems like a travesty: Aakash ChopraFormer cricketer Aakash Chopra feels that Yashasvi Jaiswal not being part of India's white-ball setup seems like a travesty. Jaiswal has played just 23 T20Is and one ODI for India during his career so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-6-live-results-neeraj-chopra-arshad-nadeem-pooja-olla-2789346-2025-09-18",
      "headline": "Day 6 Live Updates: Neeraj Chopra aims to defend crown in javelin finalWorld Athletics Championships Day 6 Live: The spotlight will be on Neeraj Chopra as he aims to defend his crown at the World Athletics Championships on Thursday, September 18. Neeraj will be up against a strong field that includes compatriot Sachin Yadav and arch-rival and Olympic champion, Arshad Nadeem. Apart from this, India's Pooja Olla will be in action in the 800m heats. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-neeraj-chopra-vs-arshad-nadeem-final-javelin-2789334-2025-09-18",
      "headline": "Neeraj vs Arshad: Why India vs Pakistan in the javelin final is only a subplotWorld Athletics Championships 2025: Neeraj Chopra and Arshad Nadeem's rivalry will grab subcontinental headlines, but the men's javelin final in Tokyo is stacked with world-class talent. From Germany's Julian Weber to former champions Anderson Peters and Julius Yego, the contest promises far more than just an India-Pakistan subplot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-nepal-t20i-series-2025-squads-uncapped-players-2789331-2025-09-18",
      "headline": "Akeal Hosein captain, 5 uncapped players in as West Indies reveal Nepal series squadWest Indies have announced their squad for the upcoming historic series against Nepal with five uncapped players included in the mix. Akeal Hosein will be leading the team in the absence of many senior players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/won-myong-gyong-wins-50kg-wrestling-gold-2025-world-championships-zagreb-video-2789309-2025-09-18",
      "headline": "Watch: Won Myong-gyong hugs referee in joy after World Wrestling Championships goldWon Myong-gyong clinched the women's 50 kg gold at the 2025 World Wrestling Championships, defeating China's Yu Zhang in the final. Her victory, highlighted by a heartfelt hug with the referee, marked only her country's third women's world title.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-yashasvi-jaiswal-india-white-ball-team-2026-world-cup-2789293-2025-09-18",
      "headline": "Yashasvi Jaiswal's white-ball format absence seems like a travesty: Aakash ChopraFormer cricketer Aakash Chopra feels that Yashasvi Jaiswal not being part of India's white-ball setup seems like a travesty. Jaiswal has played just 23 T20Is and one ODI for India during his career so far. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}