{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-youngest-billionaire-razorpay-founders-harshil-mathur-shashank-kumar-age-34-2700382-2025-03-28",
      "headline": "Razorpay's Shashank Kumar, Harshil Mathur become India's youngest billionairesHarshil Mathur and Shashank Kumar met at IIT Roorkee, where they shared an interest in technology and problem-solving. Their journey into fintech began in 2014 when they launched Razorpay to simplify digital payments in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-30-points-lower-nifty-flat-in-early-trade-infosys-mahindra-down-up-to-3-percent-2700328-2025-03-28",
      "headline": "Sensex, Nifty fall in early trade over Trump tariff threats; Infosys down 2%The S&P BSE Sensex lost 282.59 points to 77,323.84, while the NSE Nifty50 was down 84.70 points to 23,507.25 as of 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-services-unavailable-on-march-31-fund-transfer-cash-deposit-withdrawal-rtgs-neft-financial-year-end-2700325-2025-03-28",
      "headline": "Planning a bank transfer on March 31? Here's why it may not workWhile banks will remain open, transactions like fund transfers, cash deposits, and withdrawals may not go through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-28-infosys-tata-motors-bel-adani-power-hcltech-and-more-2700293-2025-03-28",
      "headline": "Stocks to watch today: Infosys, Tata Motors, BEL, Adani Power, HCLTech and moreMarkets are set for a strong start on March 6 as key stocks like Infosys, Tata Motors, and Adani Power grab attention. Trade talks, global deals, and company moves could shape today's trading session. Here's what investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-on-march-28-sensex-nifty-trends-expert-view-key-factors-2700290-2025-03-28",
      "headline": "Sensex, Nifty today: Will positive run continue on stock market?Stock market opening today: The Sensex and Nifty gained in the previous session amid reports of positive talks between Indian and US officials about a trade deal. Analysts have noted that the focus during today's trading session will be on upcoming tariff developments and the India-US trade deal outcome.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-wto-financial-contributions-report-glbs-2700200-2025-03-27",
      "headline": "US suspends WTO financial contributions: ReportThe Trump administration has reportedly suspended financial contributions to The World Trade Organisation amid efforts to cut back government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-as-auto-tariffs-hurt-gm-help-tesla-and-others-glbs-2700188-2025-03-27",
      "headline": "Wall Street drifts as auto tariffs hurt GM, help Tesla and othersDonald Trump's auto tariffs impacted Wall Street on Thursday morning, with autogiant General Motors falling by 6.8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-losers-bse-nse-sensex-nifty-shares-2699443-2025-03-26",
      "headline": "Stock market closing: Top gainers and losers on Sensex, NiftyBenchmark indices snapped their seven-day winning streak, as investors turned cautious ahead of the monthly expiry. The S&P BSE Sensex dropped 728.69 points to close at 77,288.50, while the NSE Nifty50 fell 181.80 points, ending the session at 23,486.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-may-lower-duties-on-harley-davidson-bikes-bourbon-whiskey-sources-2699423-2025-03-26",
      "headline": "India may lower duties on Harley-Davidson bikes, bourbon whiskey: SourcesIndia may further reduce import duties on Harley-Davidson motorcycles, US wines, and bourbon whiskey as part of ongoing India-US trade talks, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-tumbles-over-700-points-nifty-settles-below-23500-indusind-bank-jumps-3-percent-2699400-2025-03-26",
      "headline": "Sensex tumbles over 700 points, Nifty settles below 23,500; IndusInd Bank up 3%Stock market closing bell: The S&P BSE Sensex ended 728.69 points lower to 77,288.50,  while the NSE Nifty50 declined 181.80 points to settle at 23,486.85."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sikandar-review-ode-to-salman-khan-stardom-rashmika-mandanna-2701267-2025-03-30",
      "headline": "Sikandar review: An ode to Salman Khan's stardom that's devoid of funReleased-Sun Mar 30, 2025Salman Khan-starrer Sikandar has released with a bang, with the promise of entertaining Khan's die-hard fans. Directed by AR Murugadoss, the film also stars Rashmika Mandanna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-chief-minister-pinarayi-vijayan-watches-empuraan-amid-row-over-its-themes-2701264-2025-03-30",
      "headline": "Kerala Chief Minister Pinarayi Vijayan watches Empuraan amid row over its themesA photo of Kerala Chief Minister Pinarayi Vijayan watching Prithviraj's L2: Empuraan is being widely circulated on the internet. The film has been caught in the middle of a controversy over its allusion to the Gujarat riots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-x-reviews-salman-khan-entry-say-goosebumps-guaranteed-rashmika-mandanna-2701239-2025-03-30",
      "headline": "Sikandar X reviews: Fans praise Salman Khan's entry, say 'goosebumps guaranteed' Live Updates Salman Khan's much-awaited movie Sikandar has finally been released in theatres today, March 30. Fans showered their love on the film and praised Salman's return to the big screen. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-leaked-online-hours-before-theatrical-release-2701223-2025-03-30",
      "headline": "Salman Khan's Sikandar leaked online hours before theatrical releaseSalman Khan's Sikandar was leaked online hours before its release on March 30. The movie was available on various pirated sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-akshay-kumar-prabhas-kannappa-release-postponed-vfx-2701206-2025-03-30",
      "headline": "Vishnu Manchu, Akshay Kumar's Kannappa release postponedVishnu Manchu's upcoming film, Kannappa, has been delayed. The actor shared a statement on social media and addressed the reason behind the delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jewel-thief-jaideep-ahlawat-nikita-dutta-heist-to-win-hearts-2701194-2025-03-30",
      "headline": "Jewel Thief stars Jaideep Ahlawat, Nikita Dutta on a heist to win hearts. WatchJaideep Ahlawat and his Jewel Thief co-star Nikita Dutta won hearts with their adorable video on the song 'Price Tag'. Their upcoming film is slated to release on Netflix on April 25. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-melbourne-event-organisers-deny-claim-of-mismanagement-2701132-2025-03-29",
      "headline": "Neha Kakkar's Melbourne event organisers deny claim of mismanagement: We're in debtSinger Neha Kakkar's Melbourne concert organisers have denied her claims of mismanagement and said that in fact after the event, they are the ones in debt.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-empuraan-to-have-17-cuts-after-row-over-riot-depiction-2701066-2025-03-29",
      "headline": "17 cuts in Mohanlal's Empuraan after row over Gujarat riots depiction: SourcesPrithviraj Sukumaran's directorial, Empuraan, will have 17 cuts in the film after protests erupted online over the film's indirect depiction of the Gujarat riots. It is reported that the edited version will be screened from April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-nigam-visits-lk-advani-and-his-daughter-calls-them-extended-family-2701100-2025-03-29",
      "headline": "Sonu Nigam visits LK Advani and his daughter, calls them his 'extended family'Singer Sonu Nigam recently visited the residence of veteran BJP leader LK Advani in New Delhi. The artiste shared a post highlighting the same on his social media handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-bhootnii-trailer-sanjay-dutt-takes-on-palak-tiwari-and-mouni-roy-ghost-2701062-2025-03-29",
      "headline": "The Bhootnii trailer: Sanjay Dutt takes on Palak Tiwari and Mouni Roy's ghostsThe first full trailer of Sanjay Dutt's upcoming horror-comedy, Bhootnii, is here. Apart from Dutt, the film also features Sunny Singh, Palak Tiwari and Mouni Roy in pivotal roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shreyas-talpade-denies-involvement-in-multi-crore-scam-releases-statement-2701051-2025-03-29",
      "headline": "Shreyas Talpade denies involvement in multi-crore scam, releases statementActor Shreyas Talpade has released a statement after it was alleged that he was involved in a multi-crore chit fund scam. Talpade has denied the allegations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-creators-finalise-dayaben-mock-shoots-underway-2701053-2025-03-29",
      "headline": "Taarak Mehta creators finalise Dayaben, mock shoots underway: ReportTaarak Mehta Ka Ooltah Chashmah makers have finally found their Dayaben, which was originally played by Disha Vakani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-ex-wife-sussannes-birthday-wish-for-son-hrehaan-on-19th-birthday-2701042-2025-03-29",
      "headline": "Hrithik Roshan, ex-wife Sussanne's birthday wish for son Hrehaan on 19th birthdayHrithik Roshan and Sussanne Khan extended their wishes to their elder son, Hrehaan, on his 19th birthday. The two shared adorable posts on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hollywood-stars-slam-academy-reaction-to-no-other-land-director-attack-2701032-2025-03-29",
      "headline": "Hollywood stars slam Academy's reaction to No Other Land director's attackHollywood stars such as Mark Ruffalo, Olivia Colman and Javier Bardem, among over 600 members of the Academy, have signed an open letter criticising its lack of response to Oscar-winning director Hamdan Ballal's attack by the Israeli military. The Academy has since apologised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-superman-has-a-cameo-by-bradley-cooper-tom-cruise-2701022-2025-03-29",
      "headline": "James Gunn's Superman has a cameo by a big Hollywood star: ReportFilmmaker James Gunn's Superman will feature a surprise cameo by a major Hollywood star. Earlier, it was being speculated that Hollywood superstar Tom Cruise would star in it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-directed-to-make-changes-in-empuraan-after-claims-of-hurting-sentiments-2701008-2025-03-29",
      "headline": "Prithviraj directed to make changes to Empuraan after claims of hurting sentimentsL2: Empuraan producer Gokulam Gopalan has said that he has asked director-actor Prithviraj to make changes to the film after it was claimed that it hurt the sentiments of a certain section of the audience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-zahan-kapoor-aditya-rawal-not-nepo-kids-but-talented-actors-cinematic-saturday-2700994-2025-03-29",
      "headline": "Not all nepos: Rising above the 'nepo kid' tag with talentThe debate around 'nepo kids' in Bollywood continues, with new generations facing sharper scrutiny. Actors like Babil Khan, Zahan Kapoor, and Aditya Rawal are quietly sidestepping the hype by focusing on content-driven cinema, proving their talent beyond their familial connections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-citadel-season-2-postponed-2026-amazon-mgm-2700989-2025-03-29",
      "headline": "Priyanka Chopra's Citadel Season 2 postponed to 2026: ReportAll Citadel spinoff series have been put on hold until Season 2 premieres. The shooting for the second season wrapped in November 2024.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-praises-rashmika-mandanna-shot-for-sikandar-pushpa-2-together-2700972-2025-03-29",
      "headline": "Salman Khan praises Rashmika, shares how she shot for Sikandar, Pushpa 2 togetherBollywood superstar Salman Khan heaped praise on his Sikandar co-star Rashmika Mandanna and said that the actor's dedication to her craft was inspiring. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-death-toll-injured-rescue-operation-thiland-tremors-2701250-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar quake: Rescuers race against time, aftershocks keep survivors on edgeRescue operations in Myanmar are currently concentrated in Mandalay, the country's second-largest city, and the capital, Naypyitaw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-step-down-doge-quit-trump-administration-us-tesla-protests-2701210-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Elon Musk planning to quit DOGE amid Tesla crisis? Here's what he saidElon Musk is planning to step down from the Department of Government Efficiency by late May, citing progress in deficit reduction, as Tesla faces protests, stock declines, and legal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/sam-altman-asks-chatgpt-users-to-slow-down-as-ghibli-trend-floods-internet-2701266-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Team needs sleep: Sam Altman urges ChatGPT users to slow down amid Ghibli frenzyIn a post on X, OpenAI CEO Sam Altman urged ChatGPT users to slow down as the Ghibli trend has overwhelmed the internet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/roblox-and-adolescence-video-games-bring-devil-into-childs-room-netflix-roblox-fortnite-addiction-know-more-2700709-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Roblox and Adolescence: How video games bring the devil into a child's roomNetflix's Adolescence has sparked discussions about the impact of social media on teens and early teens. Beyond social media, many children immerse themselves in online video games — a world that parents are largely unfamiliar with. Platforms like Roblox and Fortnite expose young players to strangers. There are chances of cyberbullying and exposure to adult content. Here's all about the dark world and how to keep children safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-x-reviews-salman-khan-entry-say-goosebumps-guaranteed-rashmika-mandanna-2701239-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar X reviews: Fans praise Salman Khan's entry, say 'goosebumps guaranteed'  Live Updates Salman Khan's much-awaited movie Sikandar has finally been released in theatres today, March 30. Fans showered their love on the film and praised Salman's return to the big screen. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/neet-exam-aspirant-dies-suicide-chennai-tamil-nadu-2701138-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blood on MK Stalin's hands: Chennai NEET aspirant's suicide sparks political rowAIADMK chief, Edappadi K Palaniswami, while blasting Chief Minister MK Stalin over 'NEET deaths' in Tamil Nadu, said that the blood of these aspirants is in the hands of the ruling dispensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-leaves-handwritten-note-at-nagpurs-rss-smruti-mandir-2701227-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi's handwritten note at Nagpur's RSS Smruti Mandir: This place inspires usPM Modi, in his handwritten note, paid tribute to Keshav Baliram Hedgewar and other revered leaders of the Rashtriya Swayamsevak Sangh (RSS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-death-toll-injured-334-atomic-bombs-aftershocks-rescue-ops-2701196-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar quake released power of '334 atomic bombs', expert warns of aftershocksMyanmar's deadly 7.7 earthquake unleashed the force of 334 atomic bombs, with experts warning of months-long aftershocks. A communication blackout and civil war obscure the true scale of the devastation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-hostage-elkana-bohbot-cries-pleads-for-freedom-in-new-hamas-video-get-me-out-of-here-2701214-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israeli hostage cries, pleads for freedom in new Hamas video: Get me out of hereIn the second video released in just five days, Israeli hostage Elkana Bohbot was seen crying and pleading for his freedom from Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trumps-definition-of-woman-sparks-laughter-somebody-who-can-have-baby-2701238-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Somebody who can have baby: Trump's definition of woman sparks laughterDuring a press meet, US President Trump defined a woman with a mix of humour and seriousness, stating that women are smart, capable of childbirth, and have faced unfair treatment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/limousine-from-vladimir-putins-fleet-explodes-in-moscow-catches-fire-report-2701228-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "$3,55,796 limo from Putin's fleet explodes into fireball on Moscow street: ReportThe vehicle reportedly belonged to the Kremlin's Presidential Property Management Department, but it remains unclear who was inside it or what caused the sudden blaze. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-empuraan-to-have-17-cuts-after-row-over-riot-depiction-2701066-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "17 cuts in Mohanlal's Empuraan after row over Gujarat riots depiction: SourcesPrithviraj Sukumaran's directorial, Empuraan, will have 17 cuts in the film after protests erupted online over the film's indirect depiction of the Gujarat riots. It is reported that the edited version will be screened from April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/american-woman-explains-raising-children-in-india-is-better-than-us-kristen-fischer-viral-video-2701248-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "American woman explains why she prefers raising her children in India over USIn a now-viral video post shared on Instagram, an American woman explained why she believes raising her children in India is better than in the US.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-teacher-beats-autistic-child-arrested-after-parents-take-video-to-cops-2701249-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "On camera, Noida teacher beats autistic child, arrested after parents go to copsThe boy's family learnt of the alleged assault when a video of it was mistakenly shared on the WhatsApp group of parents and the school authorities on Friday. Shortly after, the boy's family lodged a police complaint against the accused special educator, school principal, vice-principal and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spicejet-flight-emergency-landing-chennai-airport-technical-snag-wheel-found-damaged-2701209-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SpiceJet plane lands in Chennai after mid-air emergency, wheel found damagedUpon landing, a preliminary investigation revealed that a wheel was damaged. All passengers and crew aboard SG9046 were declared safe and were subsequently deplaned safely, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-rahul-dravid-leg-injury-press-conference-2701251-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "At my age, playing cricket wasn't a great idea: Rahul Dravid on leg injuryRajasthan Royals coach Rahul Dravid joked about his leg injury and said he should refrain from playing cricket now given his age. Dravid suffered the injury ahead of the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-womans-appreciation-post-for-indigo-sparks-discussion-on-inclusive-air-travel-2701052-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai woman's appreciation post for IndiGo sparks discussion on inclusive air travelIn a now-viral post on LinkedIn, a specially abled woman from Mumbai shared her flying experience with IndiGo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-468-28-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-admits-killing-civilians-in-anti-militant-operation-vows-probe-2701256-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan admits killing 10 civilians in anti-militant operation, vows probeAccording to provincial government spokesman Muhammad Ali Saif, reports indicated the location was being used as a \"hideout and transit point for terrorist\" elements. Subsequent information revealed that some unarmed civilians were present in the vicinity of the site, Saif added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-murder-day-after-womans-body-found-in-bed-box-delhi-flat-owner-arrested-husband-on-run-2701202-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi flat owner arrested after woman's body found in bed box, husband on the runThe police stated that both arrested accused are trying to mislead the investigation, adding that the motive for the murder will only become clear after the husband is caught."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/myanmar-earthquake-death-thailand-bangkok-india-assistance-operation-brahma-pm-modi-s-jaishankr-ndrf-2701120-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Operation Brahma: India airlifts aid, deploys rescuers, medics to quake-hit MyanmarIndia, acting as the first responder, has announced immediate assistance for Myanmar following the deadly earthquake. Under Operation Brahma, over 55 tonnes of relief materials, along with two NDRF teams and a medical crew, have been dispatched to support post-earthquake operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-leaked-online-hours-before-theatrical-release-2701223-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's Sikandar leaked online hours before theatrical releaseSalman Khan's Sikandar was leaked online hours before its release on March 30. The movie was available on various pirated sites. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-woman-humbled-noise-complaint-napkin-stranger-cafe-viral-x-post-2701229-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengaluru woman gets noise complaint on napkin from stranger at cafe, sparks debateIn a post on X, a Bengaluru-based woman shared a picture of a handwritten note a stranger left at her table in a cafe. It was actually a noise complaint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-open-to-military-force-to-take-over-greenland-after-danish-ministers-rebuke-2701222-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump open to military force to take over Greenland after Danish minister's rebukeAfter the Danish foreign minister criticised the Trump administration for its \"tone\" in criticizing Denmark and Greenland, the US President, in an interview with Fox News, hinted at the possibility of using military force to annex Greenland if necessary."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shane-warne-death-report-reveals-shocking-item-removed-from-hotel-after-demise-2701269-2025-03-30",
      "headline": "Shane Warne death: Report reveals shocking item removed from hotel after demiseThe investigation into Shane Warne's death has taken a shocking turn as a report states that an item was removed from the villa in Thailand where Shane Warne was found dead in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-rahul-dravid-leg-injury-press-conference-2701251-2025-03-30",
      "headline": "At my age, playing cricket wasn't a great idea: Rahul Dravid on leg injuryRajasthan Royals coach Rahul Dravid joked about his leg injury and said he should refrain from playing cricket now given his age. Dravid suffered the injury ahead of the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-hardik-pandya-fined-code-of-conduct-breach-2701240-2025-03-30",
      "headline": "MI captain Hardik Pandya fined 12 lakh rupees for code of conduct breach vs GTMumbai Indians captain Hardik Pandya was fined 12 lakh rupees for a code of conduct breach during the clash against Gujarat Titans on Saturday, March 29. Hardik's return to Ahmedabad ended on a sour note as GT defeated MI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-weather-forecast-pitch-report-vizag-2701237-2025-03-30",
      "headline": "DC vs SRH, pitch, weather report IPL 2025: Sunny conditions for high-scoring contestDelhi (DC) vs Hyderabad (SRH) Match Pitch Report, Weather forecast: Delhi and Hyderabad will lock horns in Vizag for a thrilling contest in IPL 2025 on Sunday, March 30. How will the pitch and weather behave for the clash?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-vaibhav-suryavanshi-debut-rahul-dravid-2701226-2025-03-30",
      "headline": "Dravid on 14-year old Vaibhav Suryavanshi: RR won't be scared to play himRajasthan Royals head coach Rahul Dravid remains cautious about fielding 14-year-old sensation Vaibhav Suryavanshi, opting to give him time to adjust to the pressure of playing in the IPL. Meanwhile, Dravid also backed Riyan Parag at number three despite his struggles as they face CSK next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-mi-trent-boult-press-conference-ahmedabad-2701220-2025-03-30",
      "headline": "MI's batting woes: Trent Boult unfazed by rocky start for batters after GT lossMumbai Indians pacer Trent Boult is unfazed by the rocky start made by the batters after their loss to Gujarat Titans in Ahmedabad on Saturday, March 29. The MI batters have struggled to make an impact so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-mi-shubman-gill-press-conference-2701208-2025-03-30",
      "headline": "Shubman Gill in awe of Prasidh Krishna after MI win: Did a pretty amazing jobGujarat Titans captain Shubman Gill was in awe of Prasidh Krishna's performance against Mumbai Indians on Saturday, March 29. Prasidh picked up the key wickets of Tilak Verma and Suryakumar Yadav and was adjudged as the Player Of The Match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-predicted-playing-11-top-fantas-picks-2701129-2025-03-30",
      "headline": "RR vs CSK predicted XI: Will desperate CSK make wholesale changes?Chennai Super Kings are set to face Rajasthan Royals on Sunday, April 30 in Guwahati. Both teams are expected to make changes to their line-ups after heavy losses in their previous games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-rashid-khan-full-quota-ahmedabad-2701207-2025-03-30",
      "headline": "1st time in history: Rashid Khan does not bowl full quota of overs in IPLGujarat Titans beat Mumbai Indians comprehensively on Saturday, March 29. GT restricted MI to 160/6 after putting up a total up a total of 196 runs. Interestingly, Rashid Khan did not bowl his full quota of overs today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-ahmedabad-black-soil-pitch-trent-boult-2701204-2025-03-30",
      "headline": "Ahmedabad black soil pitch not an excuse for MI's loss vs GT: Trent BoultMumbai Indians pacer Trent Boult said that the black soil pitch used in Ahmedabad can't be used as an excuse for their loss to Gujarat Titans on Saturday, March 29. GT used their advantage to hand MI their second loss of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-rohit-sharma-form-michael-vaughan-2701201-2025-03-30",
      "headline": "Rohit must pretend he's playing IPL in India blue, not MI blue: VaughanMichael Vaughan joked that Rohit Sharma should imagine himself in an India jersey to find his form for Mumbai Indians. With two losses already, MI desperately need Rohit to fire as they face KKR at the Wankhede next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-mi-shubman-gill-press-conference-2701208-2025-03-30",
      "headline": "Shubman Gill in awe of Prasidh Krishna after MI win: Did a pretty amazing jobGujarat Titans captain Shubman Gill was in awe of Prasidh Krishna's performance against Mumbai Indians on Saturday, March 29. Prasidh picked up the key wickets of Tilak Verma and Suryakumar Yadav and was adjudged as the Player Of The Match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-predicted-playing-11-top-fantas-picks-2701129-2025-03-30",
      "headline": "RR vs CSK predicted XI: Will desperate CSK make wholesale changes?Chennai Super Kings are set to face Rajasthan Royals on Sunday, April 30 in Guwahati. Both teams are expected to make changes to their line-ups after heavy losses in their previous games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-rashid-khan-full-quota-ahmedabad-2701207-2025-03-30",
      "headline": "1st time in history: Rashid Khan does not bowl full quota of overs in IPLGujarat Titans beat Mumbai Indians comprehensively on Saturday, March 29. GT restricted MI to 160/6 after putting up a total up a total of 196 runs. Interestingly, Rashid Khan did not bowl his full quota of overs today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-ahmedabad-black-soil-pitch-trent-boult-2701204-2025-03-30",
      "headline": "Ahmedabad black soil pitch not an excuse for MI's loss vs GT: Trent BoultMumbai Indians pacer Trent Boult said that the black soil pitch used in Ahmedabad can't be used as an excuse for their loss to Gujarat Titans on Saturday, March 29. GT used their advantage to hand MI their second loss of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-mi-rohit-sharma-form-michael-vaughan-2701201-2025-03-30",
      "headline": "Rohit must pretend he's playing IPL in India blue, not MI blue: VaughanMichael Vaughan joked that Rohit Sharma should imagine himself in an India jersey to find his form for Mumbai Indians. With two losses already, MI desperately need Rohit to fire as they face KKR at the Wankhede next."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}