{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-alert-first-instalment-due-by-june-15-find-out-if-you-are-liable-2740396-2025-06-13",
      "headline": "Advance tax alert: First instalment due by June 15, find out if you are liableAdvance tax simply means paying your income tax in parts throughout the year, instead of waiting till the end. If your total tax due for the year is more than Rs 10,000, then you must pay it in advance in four instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-573-points-lower-nifty-below-24800-adani-ports-falls-3-percent-iran-israel-war-2740342-2025-06-13",
      "headline": "Sensex settles 573 points lower, Nifty below 24,800; Adani Ports falls 3%The S&P BSE Sensex was down by 573.38 points to end at 81,118.60, while the NSE Nifty50 lost 169.60 points to close at 24,718.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-surge-india-israel-iran-conflict-geopolitical-tensions-2740330-2025-06-13",
      "headline": "Gold prices rise sharply amid Israel-Iran tensions in IndiaThe rise in gold prices is being linked to worries over a possible wider conflict in the Middle East, which has made investors turn to gold as a safe place to park money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-subscription-june-13-to-17-rs-1387-crore-issue-strong-brokerage-ratings-2740309-2025-06-13",
      "headline": "Oswal Pumps opens Rs 1,387 crore IPO with strong brokerage backingOswal Pumps targets Rs 1,387.34 crore from IPO. Experts recommend subscribing due to strong fundamentals. IPO open until June 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sardaar-ji-3-teaser-diljit-dosanjh-returns-ghost-hunter-in-hilarious-avatar-2740997-2025-06-15",
      "headline": "Sardaar Ji 3 teaser: Diljit Dosanjh returns as ghost hunter in hilarious avatarThe teaser of 'Sardaar Ji 3' starring Diljit Dosanjh and Neeru Bajwa is out. The film will release in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pakeezah-a-poignant-reminder-of-meena-kumari-india-poetic-past-ashok-kumar-raaj-kumar-2740977-2025-06-15",
      "headline": "Pakeezah: A poignant reminder of Meena Kumari and India's poetic pastPakeezah (1972) is a nostalgic journey into a bygone India of thumris, shayari, and Nawabi grace. The film stars Meena Kumari as the eponymous lead, alongside Ashok Kumar and Raaj Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankit-gupta-addresses-dating-rumours-priyanka-chahar-chaudhary-threatens-legal-action-2740968-2025-06-15",
      "headline": "Actor Ankit Gupta addresses dating rumours, threatens legal actionActor Ankit Gupta recently addressed his link-up rumours amid breakup with Priyanka Chahar Choudhary. Gupta even vowed to take legal action against those spreading defamatory content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-comedy-holds-strong-in-theatres-2740960-2025-06-15",
      "headline": "Housefull 5 Box Office Day 9: Akshay Kumar's comedy holds strong in theatresAkshay Kumar's 'Housefull 5', which hit theatres on June 6, continues to perform well at the box office in its second week. The film has raked in an estimated Rs 142.25 crore in India so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-honorary-doctorate-from-sathyabama-university-gives-emotional-speech-allu-arjun-2740956-2025-06-15",
      "headline": "Atlee gets honorary doctorate from Sathyabama University, gives emotional speechDirector Atlee recently received an honorary doctorate from Sathyabama Institute of Science and Technology. He was recognised for his valuable contributions to Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-trailer-vishnu-manchu-akshay-kumar-prabhas-moahanlal-powerful-tale-of-devotion-kajal-aggarwal-2740945-2025-06-15",
      "headline": "'Kannappa' trailer: Vishnu Manchu, Akshay Kumar bring powerful tale of devotionThe trailer of 'Kannappa' starring Vishnu Manchu, Akshay Kumar, Prabhas, and Mohanlal is out. The film is slated to hit the big screen on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-quashes-wedding-reports-with-kavya-maran-stop-spreading-rumours-2740824-2025-06-14",
      "headline": "Anirudh Ravichander quashes wedding reports: Stop spreading rumoursComposer Anirudh Ravichander has finally addressed the speculations about his alleged wedding with Sunrisers Hyderabad (SRH) owner Kavya Maran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-suggested-big-b-for-sholay-convinced-ramesh-sippy-he-would-be-perfect-2740767-2025-06-14",
      "headline": "Dharmendra suggested Big B for Sholay, convinced Ramesh Sippy he'd be perfectVeteran actor Dharmendra opened up about recommending Amitabh Bachchan for the role of Jai in 'Sholay'. He reflected on Big B's impressive quality as a young actor in the 70s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-imtiaz-ali-reunite-untitled-film-sharvari-vedang-raina-naseeruddin-shah-2740794-2025-06-14",
      "headline": "Diljit Dosanjh, Imtiaz Ali reunite for untitled film with Sharvari and Vedang RainaFilmmaker Imtiaz Ali is set to reunite with Diljit Dosanjh for their upcoming film. Set to begin filming in August 2025, this untitled film will hit theatres on Baisakhi 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-surprises-young-fans-at-florida-hospital-with-gifts-see-pics-2740776-2025-06-14",
      "headline": "Taylor Swift surprises young fans at Florida hospital with gifts. See picsTaylor Swift paid a surprise visit to a children's hospital in the US shortly after attending boyfriend Travis Kelce's Stanley Cup finals game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dakota-johnson-slams-hollywood-remakes-mess-materialist-2740734-2025-06-14",
      "headline": "Dakota Johnson slams Hollywood remakes, says its all a messActor Dakota Johnson recently criticised Hollywood's obsession with remakes. She reflected on the risk-averse nature of the entertainment industry, while highlighting the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/jackson-wang-on-magic-man-2-love-and-trust-bond-with-rm-diljit-dosanjh-mm-india-tour-exclusive-2740753-2025-06-14",
      "headline": "Jackson Wang on Magic Man 2, Love and Trust, bond with RM, Diljit Dosanjh, MM India Tour | ExclusiveIn an exclusive interview with India Today's Bhavna Agarwal, global star Jackson Wang opens up about his upcoming album Magic Man 2, second visit to India, his collaboration with Diljit Dosanjh, the emotional and creative process behind it, and what turning 31 has meant for him. Jackson speaks candidly about navigating life without a label, how he still approaches trust with caution, and what vulnerability with fans truly looks like for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-trailer-lee-jung-jae-faces-his-toughest-opponents-in-epic-finale-2740693-2025-06-14",
      "headline": "Squid Game 3 trailer: Lee Jung-jae faces his toughest opponents in epic finaleThe new trailer for 'Squid Game Season 3' was released on June 14. The show featuring actor Lee Jung-jae is all set for its finale and will premiere on June 27 on Netflix. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-heated-clash-with-paparazzi-viral-video-2740715-2025-06-14",
      "headline": "Who's paying you to provoke me? Justin Bieber in heated clash with paparazziSinger Justin Bieber got into a heated clash with the paparazzi outside the Soho House in Malibu. Bieber was protecting himself from the flashing cameras before delivering a firm and expletive-filled message to the photographers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-day-9-kamal-haasan-film-crawls-towards-rs-50-crore-2740678-2025-06-14",
      "headline": "Thug Life box office Day 9: Kamal Haasan's film crawls towards Rs 50 croreActor Kamal Haasan and filmmaker Mani Ratnam's 'Thug Life' saw a massive decline in the box office collection on day nine. The film is still far behind the Rs 50 crore-mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushant-singh-rajput-sister-shweta-singh-kirti-emotional-video-death-anniversary-2740676-2025-06-14",
      "headline": "Bhai is still with us: Sushant Singh Rajput's sister shares emotional videoSushant Singh Rajput's sister, Shweta, remembered her brother on his fifth death anniversary today, June 14. In an emotional video, she discussed missing her late actor-brother while also explaining what he stood for. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-festa-2025-blood-sweat-and-tears-the-7-are-back-and-so-is-the-magic-2740668-2025-06-14",
      "headline": "BTS FESTA 2025: Blood, Sweat, and Tears- The 7 are back and so is the magicBTS FESTA 2025 saw an emotional reunion of all seven members during J-hope's concert, thrilling fans across the globe. The event was a perfect blend of nostalgia, joy, and promise of a bright future for the band and ARMY alike."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-makers-slam-karnataka-government-over-threats-fir-was-registered-2740660-2025-06-14",
      "headline": "Thug Life makers slam Karnataka government over threats: No FIR was registeredThug Life makers slammed the Karnataka government for not protecting them against threats following Kamal Haasan's 'Kannada born out of Tamil' remark. They claimed that no FIR was registered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-entertainer-eyes-rs-150-crore-mark-2740625-2025-06-14",
      "headline": "Housefull 5 box office Day 8: Akshay Kumar's entertainer eyes Rs 150 crore-markAkshay Kumar's 'Housefull 5' is witnessing a dip in box office numbers. On its eighth day, the film collected Rs 6 crore, bringing its total India earnings to over Rs 133 crore. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/helicopter-uttarakhand-guptkashi-kedarnath-dham-jungles-of-gaurikund-2740931-2025-06-15",
      "headline": "7 killed in helicopter crash in Uttarakhand, 5th such incident in last 6 weeksA helicopter belonging to Aryan Aviation, carrying 7 people, flying from Guptkashi to Kedarnath Dham crashed in the jungles of Gaurikund. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-warns-iran-full-strength-us-military-israel-2740978-2025-06-15",
      "headline": "If attacked, full strength of US forces will come down on you, Trump warns IranUS President Donald Trump on Sunday warned Iran against any retaliation on US assets, saying, 'If we are attacked in any way, shape or form by Iran, the full strength and might of the US armed forces will come down on you at levels never seen before.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/asim-munir-us-military-parade-invite-congress-claims-white-house-rejects-2740965-2025-06-15",
      "headline": "Did US invite Pak Army chief to its military parade? White House clarifiesThe White House denied inviting Pakistan Army Chief General Asim Munir to its military parade, calling reports 'false' amid political backlash in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-visit-china-shanghai-cooperation-organisation-defence-minister-meet-galwan-clash-2740970-2025-06-15",
      "headline": "Rajnath Singh likely to visit China for SCO defence meet, first since Galwan clashDefence Minister Rajnath Singh is likely to visit Qingdao, China, for the SCO Defence Ministers' meeting later this month. The visit would mark the first ministerial-level engagement since the October 2024 India-China border agreement.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/teach-learn-sanskrit-delhi-samskrit-bharati-india-language-world-shloka-mantra-world-spread-bengaluru-2736706-2025-06-15",
      "headline": "Vadaami Sanskritam Sadaa, Do You? Start speaking the language of GodsSamskrita Bharati has taught spoken Sanskrit to millions of people through workshops in India and abroad, introducing it as an everyday language. Its innovative approach avoids rote grammar, using natural, immersive methods with storytelling, dialogue, and songs. The movement began in 1981 in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/british-fighter-jet-makes-emergency-landing-in-keralas-thiruvananthapuram-after-fuel-shortage-2740983-2025-06-15",
      "headline": "British jet makes emergency landing in Kerala over fuel shortageA British fighter jet made a safe emergency landing at Trivandrum airport due to low fuel. Refuelling clearance from the Central government is still awaited.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-claim-rafale-jets-loss-during-op-sindoor-inaccurate-says-dassault-chief-eric-trappier-2740913-2025-06-15",
      "headline": "Pak's claim of Rafale jets loss during Op Sindoor inaccurate, says Dassault chiefDassault Aviation CEO Eric Trappier rejects Pakistan's claims of shooting down Indian Rafale jets during Operation Sindoor, calling them inaccurate and urging caution until facts emerge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-g7-summit-invitation-canada-cyprus-croatia-foreign-visit-op-sindoor-2740935-2025-06-15",
      "headline": "PM Modi leaves for Cyprus, to attend G7 Summit in Canada on TuesdayPM Modi's first overseas trip after Operation Sindoor includes stops in Cyprus, Canada and Croatia, with a focus on counter-terror diplomacy and expanding ties in the areas of trade, investment, security, technology. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/south-africa-wtc-rcb-ipl-psg-ucl-tottenham-uel-2025-long-awaited-firsts-2740918-2025-06-15",
      "headline": "South Africa win WTC, RCB win IPL, PSG get UCL: 2025's year of iconic firstsFrom Lord's to Ahmedabad and Wembley to Munich, unforgettable finals saw dreams fulfilled - South Africa's WTC chase, RCB's IPL breakthrough, PSG's UCL rout - each match rewrote decades of sporting pain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/galwan-5-years-how-india-fortified-border-with-reforms-roads-2740912-2025-06-15",
      "headline": "5 years since Galwan, how India has fortified border with reforms and roadsFive years since the Galwan clash in 2020 in which 20 Indian soldiers were killed, India has fortified its border defences, overhauled military preparedness, and stepped up diplomacy with China along the Line of Actual Control (LAC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/boeing-787-dreamliners-quality-issues-flaws-whistleblower-air-india-flight-171-crash-ahmedabad-report-2740554-2025-06-14",
      "headline": "Whistleblower flagged flaws in Boeing 787s sent to Air India a decade ago: ReportAccording to the report, two individuals with past ties to Boeing's Charleston plant described persistent quality issues with the aircraft dating back more than a decade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-pushes-for-kuldeep-yadav-to-start-in-england-series-2740809-2025-06-15",
      "headline": "IND vs ENG: Ashwin pushes for Yadav to start in England seriesRavichandran Ashwin is confident that India's bowling attack is equipped to succeed in any conditions. Yet, he has strongly backed Kuldeep Yadav to feature in the playing XI throughout the upcoming Test series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pakeezah-a-poignant-reminder-of-meena-kumari-india-poetic-past-ashok-kumar-raaj-kumar-2740977-2025-06-15",
      "headline": "Pakeezah: A poignant reminder of Meena Kumari and India's poetic pastPakeezah (1972) is a nostalgic journey into a bygone India of thumris, shayari, and Nawabi grace. The film stars Meena Kumari as the eponymous lead, alongside Ashok Kumar and Raaj Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-latest-updates-several-killed-injured-in-israel-tehran-under-attack-operation-rising-lion-netanyahu-khomeini-2740933-2025-06-15",
      "headline": "Live: Israel asks Iranians living near nuclear reactors to evacuate immediatelyIran and Israel exchanged airstrikes early Sunday. In a fresh wave of Israeli airstrikes on Tehran, at least 60 people, including 29 children, were killed after a housing complex was struck.\r\n\r\nIn the early hours of Friday, Israel launched Operation Rising Lion as it targeted what it called Iran's nuclear facilities, resulting in a direct confrontation between the two regional powers in the Middle East. \r\n\r\nIn total, 78 deaths were reported in the first two days of Israeli strikes in Iran as Israel said it targeted more than 150 sites inside Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-batting-sourav-ganguly-2740975-2025-06-15",
      "headline": "What should India captain Shubman Gill improve in England? Sourav Ganguly revealsSourav Ganguly shared key advice for Shubman Gill ahead of his first Test captaincy assignment. The former captain emphasises the need for Gill to adapt his batting technique in challenging English conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/thrust-not-achieved-falling-mayday-air-india-pilots-last-messages-before-crash-in-ahmedabad-2740790-2025-06-14",
      "headline": "Thrust not achieved, falling, Mayday: Air India pilot's last messages before crashThe Air India pilot of the London-Ahmedabad flight sent distress messages to Ahmedabad Air Traffic Control (ATC) before the crash, sources said. Messages like \"thrust not achieved\", \"falling\", and \"Mayday\" were sent by the Air India pilot as the flight crashed into a medical hostel minutes after takeoff, sources told India Today TV. The flight took off at 1.37 pm and crashed minutes later, killing at least 270 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-power-infrastructure-rocked-as-israel-ramps-up-aerial-blitz-amid-conflict-2740874-2025-06-14",
      "headline": "Over 60 killed in Tehran as Israel launches fresh wave of strikes, Iran hits back  Live UpdatesIn a fresh wave of attacks, Israel bombed Iran's largest gas field and a residential tower in Tehran, killing over 60 people. Meanwhile, Iran retaliated with 200 missiles, suspended nuclear talks, and accused Israel of pushing the region into a \"dangerous cycle of violence\".  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dubai-building-fire-massive-fire-at-67-storey-dubai-skyscrapper-over-3800-evacuated-2740842-2025-06-14",
      "headline": "Massive fire at 67-storey Dubai skyscrapper, over 3,800 evacuatedSpecialised firefighting and rescue units successfully evacuated all 3,820 residents from 764 apartments in the high-rise, ensuring that every individual was safely escorted out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/neet-ug-2025-1237-lakh-qualify-no-perfect-720-scores-this-year-2740964-2025-06-15",
      "headline": "NEET UG 2025: 12.37 lakh qualify, no perfect 720 scores this yearThe NEET UG 2025 results are out, with over 12.37 lakh candidates qualifying for medical admissions. Notably, no student secured a perfect score this year, and the highest mark dropped to 686.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-turns-79-us-army-250-washington-dc-cheers-la-sees-troops-unrest-2740916-2025-06-15",
      "headline": "Trump turns 79, US Army 250: Washington DC cheers, LA sees troops, unrestOn Saturday, the US Army turned 250 and President Donald Trump 79. The double birthday bash energised crowds of well-wishers and military families in the capital while others decried the militarisation of city streets — in Los Angeles, where a federalised National Guard and US Marines remained deployed against unrest, and in Washington for the parade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/in-satellite-images-and-maps-damages-suffered-by-iran-and-israel-in-air-war-2740827-2025-06-14",
      "headline": "In satellite images and maps: Damages suffered by Iran and Israel in air warThe Israeli forces has mounted a spectacular offensive against Iran, decapitating its top military leadership and dealing huge blows to Tehran's operational military capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-title-temba-bavuma-success-south-africa-lords-history-2740940-2025-06-15",
      "headline": "Langa's Sachin conquers Lord's: Temba Bavuma lifts Test mace, unites a nationTemba Bavuma led South Africa to their first World Test Championship title at Lord's, making history as the team's first Black African captain. The inspirational skipper hopes the win over Australia will spark belief in a nation still shaped by its past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-496-13-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zomato-delivery-agent-gets-surprise-birthday-party-from-customers-wholesome-video-viral-2740962-2025-06-15",
      "headline": "Zomato delivery agent gets surprise birthday party from customers. Wholesome videoA Zomato delivery agent received an emotional birthday surprise from customers mid-shift. A video of the wholesome moment has gone viral on social media. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-pushes-for-kuldeep-yadav-to-start-in-england-series-2740809-2025-06-15",
      "headline": "IND vs ENG: Ashwin pushes for Yadav to start in England seriesRavichandran Ashwin is confident that India's bowling attack is equipped to succeed in any conditions. Yet, he has strongly backed Kuldeep Yadav to feature in the playing XI throughout the upcoming Test series in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-halle-open-2025-comeback-after-french-open-final-loss-2740979-2025-06-15",
      "headline": "Sinner admits 'sleepless nights' after French Open heartbreak to AlcarazWorld number one Jannik Sinner admitted to suffering sleepless nights following his agonising loss to rival Carlos Alcaraz in this month's French Open final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-aiden-markram-hundred-kevin-pietersen-lords-2740980-2025-06-15",
      "headline": "Aiden Markram's hundred is the best by a South African batter in Tests: Kevin PietersenKevin Pietersen claimed that the hundred by Aiden Markram in the World Test Championship final was the best knock by a South African batter in Test cricket. Markram was adjudged as the Player Of The Match for his performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-batting-sourav-ganguly-2740975-2025-06-15",
      "headline": "What should India captain Shubman Gill improve in England? Sourav Ganguly revealsSourav Ganguly shared key advice for Shubman Gill ahead of his first Test captaincy assignment. The former captain emphasises the need for Gill to adapt his batting technique in challenging English conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marco-jansen-kagiso-rabada-reaction-south-africa-wtc-win-2740967-2025-06-15",
      "headline": "Un-freaking-believable: Jansen, Rabada sum up South Africa's historic WTC winSouth African pacers Marco Jansen and Kagiso Rabada were visibly elated after the Proteas defeated Australia to secure their first ICC World Test Championship (WTC) title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-temba-bavuma-choke-sledging-australia-lords-2740961-2025-06-15",
      "headline": "WTC Final: Temba Bavuma reveals Australians used 'choke' word to sledge South AfricaSouth Africa captain Temba Bavuma revealed Australian players used the word 'choke' during the WTC final. The Proteas secured a historic win, ending their long wait for an ICC title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-set-to-appoint-gennaro-gattuso-new-national-team-manager-2740957-2025-06-15",
      "headline": "Italy set to appoint Gennaro Gattuso as manager, Gianluigi Buffon confirmsItaly are set to appoint their former midfielder Gennaro Gattuso as manager, replacing the sacked Luciano Spalletti, according to Gianluigi Buffon, head of delegation with the Italian Football Federation (FIGC), who announced on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-lionel-messi-inter-miami-vs-al-ahly-report-hard-rock-stadium-2740949-2025-06-15",
      "headline": "Lionel Messi brilliance not enough as Inter Miami held to draw by Al-AhlyLionel Messi's presence drew a huge crowd at the Club World Cup opener on Saturday, June 14. But despite his best efforts, Inter Miami were held to a 0-0 draw by African giants Al-Ahly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-century-bumrah-india-a-intra-squad-match-england-tests-2740946-2025-06-15",
      "headline": "Sarfaraz Khan hits 76-ball hundred, Bumrah goes wicketless in intra-squad matchSarfaraz Khan made a strong statement on Day 2 of the intra-squad match in Beckenham, smashing a scintillating 101 off just 76 balls for India A. The 27-year-old right-hander took the attack to the bowlers from the outset, striking 15 fours and two sixes in a dominant display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-title-temba-bavuma-success-south-africa-lords-history-2740940-2025-06-15",
      "headline": "Langa's Sachin conquers Lord's: Temba Bavuma lifts Test mace, unites a nationTemba Bavuma led South Africa to their first World Test Championship title at Lord's, making history as the team's first Black African captain. The inspirational skipper hopes the win over Australia will spark belief in a nation still shaped by its past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/srinjoy-bose-appointed-mohun-bagan-secretary-2740932-2025-06-15",
      "headline": "Mohun Bagan gets new leadership as Srinjoy Bose takes over as secretarySrinjoy Bose has officially taken over as the new secretary of Mohun Bagan, one of India's most iconic and storied football clubs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-set-to-appoint-gennaro-gattuso-new-national-team-manager-2740957-2025-06-15",
      "headline": "Italy set to appoint Gennaro Gattuso as manager, Gianluigi Buffon confirmsItaly are set to appoint their former midfielder Gennaro Gattuso as manager, replacing the sacked Luciano Spalletti, according to Gianluigi Buffon, head of delegation with the Italian Football Federation (FIGC), who announced on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-lionel-messi-inter-miami-vs-al-ahly-report-hard-rock-stadium-2740949-2025-06-15",
      "headline": "Lionel Messi brilliance not enough as Inter Miami held to draw by Al-AhlyLionel Messi's presence drew a huge crowd at the Club World Cup opener on Saturday, June 14. But despite his best efforts, Inter Miami were held to a 0-0 draw by African giants Al-Ahly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-century-bumrah-india-a-intra-squad-match-england-tests-2740946-2025-06-15",
      "headline": "Sarfaraz Khan hits 76-ball hundred, Bumrah goes wicketless in intra-squad matchSarfaraz Khan made a strong statement on Day 2 of the intra-squad match in Beckenham, smashing a scintillating 101 off just 76 balls for India A. The 27-year-old right-hander took the attack to the bowlers from the outset, striking 15 fours and two sixes in a dominant display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-title-temba-bavuma-success-south-africa-lords-history-2740940-2025-06-15",
      "headline": "Langa's Sachin conquers Lord's: Temba Bavuma lifts Test mace, unites a nationTemba Bavuma led South Africa to their first World Test Championship title at Lord's, making history as the team's first Black African captain. The inspirational skipper hopes the win over Australia will spark belief in a nation still shaped by its past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/srinjoy-bose-appointed-mohun-bagan-secretary-2740932-2025-06-15",
      "headline": "Mohun Bagan gets new leadership as Srinjoy Bose takes over as secretarySrinjoy Bose has officially taken over as the new secretary of Mohun Bagan, one of India's most iconic and storied football clubs. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}