{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trend-strong-rally-iran-israel-conflict-limited-impact-reason-explained-2741852-2025-06-17",
      "headline": "Explained: Why Dalal Street hasn't panicked amid ongoing Iran–Israel conflictDespite war jitters and foreign outflows, domestic markets held firm. With retail inflows steady and domestic themes strong, is the buy-the-dip playbook still the smartest move?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-titan-tata-motors-down-1-percent-2741849-2025-06-17",
      "headline": "Sensex opens flat, Nifty below 25,000; Titan down 1%The S&P BSE Sensex was down by 194.71 points to 81,601.44, while the NSE Nifty lost 69 points to 24,877.50 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/arisinfra-solutions-ipo-june-2025-price-band-gmp-listing-2741840-2025-06-17",
      "headline": "Arisinfra Solutions IPO to open for bidding: All you need to knowArisinfra Solutions, a tech-driven B2B platform in the construction materials industry, is launching its IPO on June 18, seeking to raise Rs 499.60 crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-17-sensex-nifty-today-trading-setup-nse-bse-iran-israel-war-us-wall-street-2741825-2025-06-17",
      "headline": "Stock market opening: Will Sensex, Nifty rise again today?At 8:12 am, the Gift Nifty futures were trading at 24,957. This points to a likely flat start for the Nifty50, which closed at 24,946.5 on Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-17-nse-bse-trading-market-tcs-hcltech-zee-biocon-hyundai-icici-bank-ntpc-2741817-2025-06-17",
      "headline": "Stocks to watch on June 17: TCS, HCLTech, Zee, Biocon, Hyundai, ICICI Bank, NTPCSeveral stocks will be in focus due to company announcements and other key updates. These include Tata Consultancy Services (TCS), HCL Technologies, Zee Entertainment, Biocon, Hyundai Motor India, ICICI Bank, NTPC, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-678-points-higher-nifty-above-24900-tata-motors-stock-falls-4-percent-2741492-2025-06-16",
      "headline": "Sensex ends 678 points higher, Nifty above 24,900; Tata Motors falls 4%The S&P BSE Sensex added 677.75 points to close at 81,796.15, while the NSE Nifty50 gained 227.90 points to end at 24,946.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/omaxe-shares-surge-new-amritsar-township-project-launch-2741486-2025-06-16",
      "headline": "Omaxe shares jump 14% on launch of New Amritsar township projectThe surge in Omaxe's share price can be attributed to the company's announcement of a new integrated township project named New Amritsar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-flight-crash-impact-aviation-sector-boeing-safety-787-dreamliner-experts-2741445-2025-06-16",
      "headline": "Air India plane crash: Will it have a negative impact on the aviation industry?The crash brought Boeing's safety record back under the scanner. Experts added that this could trigger deeper global regulatory scrutiny of Boeing's production and maintenance standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-finance-share-price-really-down-90-percent-or-not-explained-2741422-2025-06-16",
      "headline": "Are Bajaj Finance shares really down 90% today?Bajaj Finance shares have not crashed. What investors are seeing is a temporary adjustment due to a stock split and bonus issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/think-youre-exempt-from-filing-itr-your-lifestyle-may-say-otherwise-2741372-2025-06-16",
      "headline": "Think you're exempt from filing ITR? Your lifestyle may say otherwiseIt is no longer just about how much you earn. If your lifestyle tells a different story, the taxman is likely paying attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-arun-srinivas-new-meta-head-india-salary-education-work-experience-facebook-2741325-2025-06-16",
      "headline": "Who is Arun Srinivas, new India head of Meta?Arun Srinivas joined Meta (formerly Facebook) in September 2020. Arun Srinivas started his career in the fast-moving consumer goods (FMCG) space, joining Reebok in 1996."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/data-scientist-linkedin-post-on-middle-class-spending-money-management-sparks-debate-2741324-2025-06-16",
      "headline": "We trapped ourselves: Data scientist's post on middle class spending sparks debateIs the middle class a victim of the system or just bad at managing money? A Mumbai-based data scientist sparks debate with a provocative take."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-wishes-son-aryaman-on-24th-birthday-with-rare-selfie-celebs-react-2741857-2025-06-17",
      "headline": "Bobby Deol wishes son Aryaman on 24th birthday with rare selfie, celebs reactBobby Deol's heartwarming post for his son Aryaman's 24th birthday is winning hearts. He marked the occasion by sharing a rare selfie of the two together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasans-film-with-vetri-maaran-goes-on-floors-jailer-director-to-play-cameo-2741824-2025-06-17",
      "headline": "Simbu's film with Vetri Maaran goes on floors, Jailer director to play cameoActor Silambarasan's untitled film with director Vetri Maaran has commenced. A picture of the two and director Nelson Dilipkumar has been leaked on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/matthew-perry-friends-actor-death-ketamine-doctor-california-salvador-plasencia-agree-plead-guilty-moron-2741823-2025-06-17",
      "headline": "Doctor who gave ketamine to Matthew Perry, called actor moron, to plead guiltyDr. Salvador Plasencia, who was charged with supplying 'Friends' actor Matthew Perry with ketamine in the month leading up to his overdose death in 2023, has agreed to plead guilty, according to a signed document filed in federal court in Los Angeles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-cameo-companion-keneeshaa-single-amid-his-divorce-battle-with-aarti-2741804-2025-06-17",
      "headline": "Actor Ravi Mohan stars in companion Keneeshaa's single amid divorce with AartiActor Ravi Mohan played a cameo in his 'companion' Keneeshaa's music video, 'Andrum Indrum'. This video comes amid Ravi's divorce battle with his estranged wife, Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mannara-chopra-father-raman-rai-handa-dies-at-72-2741747-2025-06-17",
      "headline": "Mannara Chopra's father dies at 72, actor shares postActor Mannara Chopra's father, Raman Rai Handa, died on June 16. He was 72. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-responds-to-love-jihad-claims-pk-backlash-2741688-2025-06-16",
      "headline": "Aamir Khan responds to love jihad claims and PK backlashActor Aamir Khan finally addressed the controversy surrounding his 2014 film 'PK'. In an interview, he refuted claims that the film promoted 'love jihad'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-dev-opens-up-about-brother-mukul-dev-death-2741616-2025-06-16",
      "headline": "He felt lonely: Rahul Dev opens up about brother Mukul Dev's deathActor Rahul Dev revealed the reason behind his brother Mukul Dev's untimely death. He stated that he had lost the will to live following the death of their parents, and that his divorce further contributed to his emotional decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-on-loneliness-magic-man-2-and-why-india-on-his-radar-2741610-2025-06-16",
      "headline": "Jackson Wang on loneliness, Magic Man 2, and why India's on his radarJackson Wang, the Hong Kong-born singer and entrepreneur, is set to release his new album 'Magic Man 2' on July 18 and hopes to include India in his upcoming world tour. In an interview with India Today, he shared candid insights on independence, honesty, and his deep connection with fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-to-train-your-dragon-roars-in-india-earns-rs-14-crore-on-opening-weekend-2741597-2025-06-16",
      "headline": "How to Train Your Dragon roars in India, earns Rs 14 crore on opening weekend'How to Train Your Dragon' clocked the biggest opening weekend in India for the franchise to date. The film earned Rs 14 crore in India on its first weekend at the box office. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govindas-wife-sunita-ahuja-visits-kal-bhairav-temple-2741589-2025-06-16",
      "headline": "Govinda's wife Sunita visits Kal Bhairav temple in Ujjain on her 57th birthdayGovinda's wife, Sunita Ahuja, celebrated her 57th birthday by offering prayers at Kal Bhairav temple in Ujjain, Madhya Pradhesh. In the video circulated on the social media Sunita can be seen sitting inside the temple premises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-watches-kannappa-vishnu-manchu-expresses-gratitude-2741581-2025-06-16",
      "headline": "Encouraged, humbled, grateful: Vishnu Manchu on Rajinikanth's reaction to KannappaTamil superstar Rajinikanth was all praise for Vishnu Manchu's 'Kannappa'. The latter shared an emotional post on X, recalling Thalaivar's reaction after watching the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sagarika-ghatge-reveals-sons-face-2741569-2025-06-16",
      "headline": "Actor Sagarika Ghatge reveals son's face in emotional Father's Day postActor Sagarika Ghatge pens a long note for her husband, cricketer Zaheer Khan, on social media to celebrate Father's Day. The actor reveals her son Fatehsinh Khan's face in the post. The couple welcomed their son in April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/first-copy-trailer-munawar-faruqui-plays-piracy-kingpin-in-nostalgic-series-2741553-2025-06-16",
      "headline": "First Copy trailer: Munawar Faruqui plays piracy kingpin in nostalgic seriesThe trailer of Munawar Faruqui-starrer 'First Copy' released on Monday. In the series, the stand-up-comedian-turned-actor plays the role of a piracy kingpin. 'First Copy' will stream on OTT from June 20.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raveena-tandon-boards-air-india-flight-days-after-crash-shares-moving-note-2741535-2025-06-16",
      "headline": "Raveena Tandon boards Air India flight days after crash, shares moving noteActor Raveena Tandon shared her emotional experience on an Air India flight that she boarded days after the tragic plane crash in Ahmedabad. She praised the strength and silent resilience of the crew and passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kamal-haasan-congratulates-abhishek-banerjee-for-stolen-meets-films-team-2741544-2025-06-16",
      "headline": "Kamal Haasan congratulates Abhishek Banerjee for Stolen, meets film's teamActor Abhishek Banerjee is receiving widespread praise for his powerful role in the thriller 'Stolen', which recently earned a special accolade from the legendary Kamal Haasan during a meeting in Chennai. The film premiered on Prime Video on June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-blushes-vijay-deverakonda-viral-video-kuberaa-pre-release-event-2741536-2025-06-16",
      "headline": "Rashmika blushes when asked about Vijay Deverakonda in viral videoActor Rashmika Mandanna was seen blushing when anchor Suma Kanakala said Vijay Deverakonda's name at the pre-release event of her upcoming film, 'Kuberaa'. The video is now going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/adnan-sami-meets-jackson-wang-roshan-residence-2741521-2025-06-16",
      "headline": "Adnan Sami catches up with old pals, meets Jackson Wang at Hrithik Roshan's homeSinger Adnan Sami recently met K-pop star Jackson Wang at a dinner hosted by actor Hrithik Roshan. The singer also met old friends, singer Salim Merchant and music composer Pritam. Jackson Wang is currently in India for the promotion of his latest album, 'MAGIC MAN 2'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-trailer-kay-kay-menon-and-team-to-fight-cyber-terrorism-this-time-2741499-2025-06-16",
      "headline": "Special Ops 2 trailer: Kay Kay Menon and team to fight cyber terrorism this timeThe trailer of Kay Kay Menon-starrer 'Special Ops 2' finally released on Monday. In the latest season, Kay Kay Menon as Himmat Singh will be seen leading the fight against cyberterrorismc and artificial intelligence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-gratitude-note-for-fans-who-visit-him-outside-jalsa-despite-heavy-rain-2741441-2025-06-16",
      "headline": "Big B's gratitude note for fans who visit him outside Jalsa despite heavy rainAmitabh Bachchan expressed gratitude to his fans who gathered outside his residence, Jalsa, braving heavy rain just to catch a glimpse of him. The veteran actor shared emotional words and photos on his blog, humbly stating that he bows down to their unwavering love."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-to-leave-g7-summit-early-amid-escalating-middle-east-crisis-glbs-2741784-2025-06-17",
      "headline": "Trump cuts short G7 visit, urges Iranians to evacuate Tehran immediatelyUS President Trump left the G7 Summit early due to the ongoing crisis in the Middle East. He reiterated that Iran should have signed a nuclear deal with the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-escalate-attacks-on-day-5-of-conflict-donald-trump-proposes-ceasefire-2741822-2025-06-17",
      "headline": "Israel, Iran escalate attacks on Day 5 of conflict, Trump proposes ceasefireWhile Israel's strikes have hit Iran's strategic locations — including missile storage bunkers, launchers, and nuclear facilities — and killed top security and intelligence officials, both sides have caused significant damage to civilians in major cities such as Haifa, Tel Aviv, and Jerusalem in Israel, and Tehran in Iran, as missiles struck residential areas."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-technical-snag-san-francisco-mumbai-boeing-kolkata-airport-2741795-2025-06-17",
      "headline": "Another Air India flight suffers technical snag, passengers deplaned in KolkataPassengers on Air India's San Francisco-Mumbai flight were asked to deplane in Kolkata after a snag was detected in the left engine during a scheduled halt, delaying the onward journey by hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-has-right-to-self-defence-iran-cant-have-nukes-say-g7-leaders-in-draft-statement-sources-2741646-2025-06-16",
      "headline": "G7 leaders say Israel has right to self-defence, Iran can't have nukesAs the Israel-Iran conflict escalates, the G7 leaders have asserted that Tel Aviv has the right to defend itself while Tehran cannot have nuclear weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-israel-bombs-iranian-state-media-headquarters-during-live-broadcast-2741676-2025-06-16",
      "headline": "Video: Israel bombs Iranian state TV headquarters, forces anchor to take coverAn anchor who was reading out news in her live broadcast was forced to run for cover as Israel bombed the headquarters of the IRIB, an Iranian state TV, in Tehran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-day-5-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2741862-2025-06-17",
      "headline": "Live: Trump calls Situation Room meeting with national security staffIsrael-Iran Conflict Live Updates: Both Israel and Iran launched several missiles at each other as the conflict entered its fifth day. Amid the ongoing crisis in the Middle East, G7 leaders gathered in Canada urged an end to hostilities between Iran and Israel, with French President Emmanuel Macron revealing that his US counterpart, Donald Trump, has already initiated a truce deal between the two warring nations. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-arrives-in-canada-to-attend-g7-summit-amid-israel-iran-tensions-2741786-2025-06-17",
      "headline": "PM Modi in Canada for G7 summit dominated by Israel-Iran conflictDuring his stay in Canada, PM Modi is expected to hold bilateral meetings with Canadian Prime Minister Mark Carney and several other leaders from the G7 nations and guest countries. Meanwhile, PM's arrival in Canada coincided with Trump cutting short his G7 trip to attend a National Security Council meeting back home amid the ongoing Iran-Israel crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-seeks-gulf-help-to-urge-trump-on-israel-ceasefire-in-exchange-for-nuclear-flexibility-glbs-2741787-2025-06-17",
      "headline": "Iran sought Gulf states' help to press Trump for Israel ceasefire: ReportIran has asked Qatar, Saudi Arabia, and Oman to urge President Trump to press Israel for a ceasefire, offering nuclear deal flexibility in return, amid frantic Gulf diplomacy to avert war.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/watch-israel-hits-tehran-airport-destroys-two-iranian-f-14-fighter-jets-glbs-2741759-2025-06-17",
      "headline": "Watch: Israel hits Tehran airport, destroys two US-made Iranian F-14 fighter jetsThe Israeli Air Force destroyed two Iranian F-14 fighter jets at a Tehran airport, the IDF said, sharing footage of the strike. The jets were reportedly meant to intercept Israeli aircraft. The IDF also hit Iranian drone units and broadcast facilities amid rising tensions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kedarnath-chopper-crash-felt-like-flying-coffin-eyewitnesses-recall-chaos-2741782-2025-06-17",
      "headline": "Felt like flying coffin: Eyewitnesses recall chaos before Kedarnath chopper crashEyewitnesses recount mismanagement, delays and poor safety in Kedarnath helicopter services after the June 15 crash that killed 7 in the Gaurikund forest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-17-israel-iran-conflict-enters-fifth-day-pm-lands-in-canada-2741812-2025-06-17",
      "headline": "News Menu, June 17: Israel-Iran conflict intensifies; PM in Canada for G7 summitToday's News Menu brings a fiery mix: Tehran reels under Israeli strikes, PM Modi touches down in Canada for G7 Summit, Mumbai battles monsoon mayhem, Bengaluru simmers in stampede protest, and the Air India crash probe deepens.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-doesnt-know-what-it-means-to-be-india-test-captain-dinesh-karthik-2741836-2025-06-17",
      "headline": "Shubman Gill doesn't know what it means to be India Test captain: Dinesh KarthikFormer India cricketer Dinesh Karthik feels Shubman Gill isn't aware of what it means to be India's Test captain and will have a tough time in the upcoming series against England."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-bans-bike-taxis-x-users-joke-rapido-uber-moto-offers-bike-parcel-rides-drivers-urge-siddaramaiah-to-intervene-2741682-2025-06-16",
      "headline": "Become a parcel, get delivered: X users after Karnataka bans bike taxiAfter the ban on bike taxis in the state ordered by the Karnataka High Court came into effect today, X users joked that platforms like Rapido are now offering \"bike parcel\" rides. While the government began cracking down, drivers urged Siddaramaiah, Rahul Gandhi to intervene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-pm-netanyahu-says-killing-irans-supreme-leader-ayotallah-khamenei-would-end-conflict-2741730-2025-06-16",
      "headline": "Netanyahu says killing Iran's Supreme Leader Ayatollah Khamenei would end conflictIsraeli PM Netanyahu defended attacks on Iran and added that killing Iran's Supreme Leader, Ayatollah Ali Khamenei, would end the conflict between the two countries. He warned of the global threat from Iran's nuclear ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-orders-enquiry-child-sex-abuse-pakistan-origin-grooming-gangs-after-audit-2741753-2025-06-17",
      "headline": "UK officials feared racism allegations, skipped ethnicity data on grooming gangsThe UK has launched a national enquiry into child sexual exploitation by Pakistani-heritage gangs after an audit revealed systemic failures and underreporting due to racial sensitivity concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/first-batch-of-indians-to-cross-over-to-armenia-as-evacuation-from-iran-begins-say-government-sourcesglbs-2741741-2025-06-16",
      "headline": "First batch of 100 Indians leaves Iran, heads to Armenia: Government sourcesAmid the Israel-Iran war, India has begun evacuating its citizens from Iran. Government sources say the first group will cross into Armenia tonight. Iran has allowed land travel to nearby countries after shutting down its airspace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/matthew-perry-friends-actor-death-ketamine-doctor-california-salvador-plasencia-agree-plead-guilty-moron-2741823-2025-06-17",
      "headline": "Doctor who gave ketamine to Matthew Perry, called actor moron, to plead guiltyDr. Salvador Plasencia, who was charged with supplying 'Friends' actor Matthew Perry with ketamine in the month leading up to his overdose death in 2023, has agreed to plead guilty, according to a signed document filed in federal court in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-not-winning-this-war-should-talk-before-its-too-late-trump-backs-israel-at-g7-2741691-2025-06-16",
      "headline": "Iran not winning war, should talk before it's too late: Trump backs Israel at G7Ahead of the G7 summit in Canada, Donald Trump refused to back a statement urging Israel-Iran de-escalation, strongly supported Israel's actions, and called for Russia's return to the alliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-family-launches-t1-mobile-with-47-plan-and-maga-branding-glbs-2741772-2025-06-17",
      "headline": "Trump family launches T1 mobile with '47 Plan' and MAGA brandingThe Trump family has launched T1 Mobile, a patriotic-themed phone service featuring the \"47 Plan.\" Priced at $499, the venture raises ethical questions amid Donald Trump's expanding business empire.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/exclusive-cctv-footage-shows-twist-bengaluru-rapido-bike-rider-assaulting-woman-case-complainant-hit-him-first-with-lunch-bag-2741540-2025-06-16",
      "headline": "New CCTV clip shows woman attacking Rapido driver detained for slapping herCCTV footage accessed exclusively by India Today shows that the woman, who was hit by a Rapido bike rider in Bengaluru, hit him first after what looks like an argument. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/third-generation-audi-q3-unveiled-gets-hybrid-powertrains-2741788-2025-06-17",
      "headline": "Third-generation Audi Q3 unveiled, gets hybrid powertrainsAudi has unveiled the third-generation Q3 SUV with a fresh design, hybrid powertrains, advanced lighting, AI tech, and enhanced safety, aiming to redefine the premium compact SUV segment.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/message-turkey-why-pm-modi-first-operation-sindoor-trip-cyprus-eu-trade-cooperation-energy-india-pak-explained-2741434-2025-06-16",
      "headline": "Message for Turkey? Why Modi's first post-Op Sindoor trip is to CyprusPrime Minister Modi's first post-Operation Sindoor visit to Cyprus could be a strategic message amid deepening Turkey-Pakistan ties. After the April 22 terror attack, Cyprus backed India and vowed to raise the issue of cross-border terrorism at the EU level, highlighting a growing alignment which now extends to trade, energy, and EU cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/bali-thailand-vietnam-now-philippines-is-southeast-asia-indias-new-backyard-2739636-2025-06-16",
      "headline": "Bali, Thailand, Vietnam, now Philippines: Is Southeast Asia India's new backyard?Visa relaxations make a destination more attractive for hassle-free travel. With the Philippines now visa-free for Indians, can we expect an influx of Indian tourists to the country?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anti-terror-watchdog-fatf-condemns-pahalgam-attack-says-couldnt-have-happened-without-money-movement-2741590-2025-06-16",
      "headline": "FATF condemns Pahalgam attack, says it couldn't have occurred without moneyStrongly condemning the Pahalgam terror attack, the FATF highlighted Pakistan's terror financing routes and said that such attacks could not have happened without the movement of money."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-suggests-sarfaraz-khan-to-learn-from-karun-nair-2741861-2025-06-17",
      "headline": "Harbhajan Singh suggests Sarfaraz Khan to learn from Karun Nair after India snubFormer India cricketer Harbhajan Singh has suggested Sarfaraz Khan after his team India snub for the upcoming Test series in England. Sarfaraz last played for India during the home Test series against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/club-cricketer-dirdh-patel-dies-air-india-crash-ahmedabad-2741851-2025-06-17",
      "headline": "Air India crash: 23-year-old cricketer among victimsPromising AI graduate and cricketer Dirdh Patel, 23, has been named among the victims of the tragic Air India crash on Thursday. The London-bound flight, carrying 242 people, crashed moments after taking off from Ahmedabad, marking the world's worst aviation disaster in a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-doesnt-know-what-it-means-to-be-india-test-captain-dinesh-karthik-2741836-2025-06-17",
      "headline": "Shubman Gill doesn't know what it means to be India Test captain: Dinesh KarthikFormer India cricketer Dinesh Karthik feels Shubman Gill isn't aware of what it means to be India's Test captain and will have a tough time in the upcoming series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-dindigul-dragons-cleared-ball-tampering-tnpl-probe-2741833-2025-06-17",
      "headline": "Ashwin and Dindigul Dragons cleared of ball-tampering allegationsFormer India off-spinner R Ashwin and Dindigul Dragons, the team he captains in the Tamil Nadu Premier League (TNPL), have been cleared of ball-tampering charges after allegations were levelled against them by Siechem Madurai Panthers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-chelsea-beat-los-angeles-fc-boca-juniors-benfica-draw-2741830-2025-06-17",
      "headline": "Chelsea beat Los Angeles FC; Boca, Benfica serve heated classicChelsea started their 2025 FIFA Club World Cup campaign with a composed 2-0 victory over Los Angeles FC. Boca Juniors and Benfica played a dramatic 2-2 draw featuring three red cards and a late equaliser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/netherlands-beat-nepal-in-thrilling-triple-super-over-clash-2741818-2025-06-17",
      "headline": "Netherlands triumph over Nepal in thrilling triple Super Over clashNetherlands beat Nepal in a thrilling triple Super Over game as Zach Lion Cachet's all-round show helped his team register a memorable win. It was the first time that any game in the history of cricket had gone into a super over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/digvesh-rathi-video-viral-5-wickets-in-5-balls-2741739-2025-06-16",
      "headline": "5 wickets in 5 balls: Digvesh Rathi has Sanjeev Goenka hooked even after IPLDigvesh Rathi took five wickets in five balls in a local game, showcasing his exceptional talent. The owner of Lucknow Super Giants, Sanjeev Goenka, reacted after being mesmerised by Rathi's brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ayan-raj-scores-unbeaten-327-runs-inspired-by-vaibhav-suryavanshi-2741717-2025-06-16",
      "headline": "Inspired by Vaibhav Suryavanshi, his 13-year-old friend smashes 327 in 134 ballsThirteen-year-old Ayan Raj scored an unbeaten 327 runs in a district cricket match. Raj revealed that he used to play with Vaibhav Suryavanshi when he was younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-bowling-virat-kohli-vs-sachin-tendulkar-2741716-2025-06-16",
      "headline": "Virat Kohli or Sachin Tendulkar: Who challenged James Anderson more?James Anderson shared his experiences bowling to Indian legends Virat Kohli and Sachin Tendulkar. The former England pacer highlighted how Kohli's game evolved, making him tougher to dismiss over time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vinicius-jr-racial-abuse-fans-jailed-2741708-2025-06-16",
      "headline": "Madrid court jails 4 radical fans for racially abusing Vinicius JrFour individuals received suspended sentences for a racist hate crime targeting Vinicius Jr. The court imposed fines, bans, and ordered an educational programme to promote equality and prevent discrimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhaka-court-travel-ban-shakib-al-hasan-corruption-stock-market-embezzlement-2741701-2025-06-16",
      "headline": "Dhaka court imposes travel ban on Shakib Al Hasan amid corruption caseA court in Dhaka has imposed a travel ban on former Awami League lawmaker and cricketer-turned-politician Shakib Al Hasan, along with 15 others, in connection with a corruption case. Shakib has not played competitive cricket since the Pakistan Super League in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/digvesh-rathi-video-viral-5-wickets-in-5-balls-2741739-2025-06-16",
      "headline": "5 wickets in 5 balls: Digvesh Rathi has Sanjeev Goenka hooked even after IPLDigvesh Rathi took five wickets in five balls in a local game, showcasing his exceptional talent. The owner of Lucknow Super Giants, Sanjeev Goenka, reacted after being mesmerised by Rathi's brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ayan-raj-scores-unbeaten-327-runs-inspired-by-vaibhav-suryavanshi-2741717-2025-06-16",
      "headline": "Inspired by Vaibhav Suryavanshi, his 13-year-old friend smashes 327 in 134 ballsThirteen-year-old Ayan Raj scored an unbeaten 327 runs in a district cricket match. Raj revealed that he used to play with Vaibhav Suryavanshi when he was younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-bowling-virat-kohli-vs-sachin-tendulkar-2741716-2025-06-16",
      "headline": "Virat Kohli or Sachin Tendulkar: Who challenged James Anderson more?James Anderson shared his experiences bowling to Indian legends Virat Kohli and Sachin Tendulkar. The former England pacer highlighted how Kohli's game evolved, making him tougher to dismiss over time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vinicius-jr-racial-abuse-fans-jailed-2741708-2025-06-16",
      "headline": "Madrid court jails 4 radical fans for racially abusing Vinicius JrFour individuals received suspended sentences for a racist hate crime targeting Vinicius Jr. The court imposed fines, bans, and ordered an educational programme to promote equality and prevent discrimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhaka-court-travel-ban-shakib-al-hasan-corruption-stock-market-embezzlement-2741701-2025-06-16",
      "headline": "Dhaka court imposes travel ban on Shakib Al Hasan amid corruption caseA court in Dhaka has imposed a travel ban on former Awami League lawmaker and cricketer-turned-politician Shakib Al Hasan, along with 15 others, in connection with a corruption case. Shakib has not played competitive cricket since the Pakistan Super League in May. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}