{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-4-tips-to-reduce-premiums-for-senior-citizens-2683576-2025-02-21",
      "headline": "Health insurance: 4 tips to reduce premiums for senior citizens Purchasing a health insurance policy at a younger age can help in securing reduced premium rates. Generally, lower insurance premiums are offered to younger people as they are considered low risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/index-funds-vs-etfs-5-key-things-every-investor-should-know-2683517-2025-02-21",
      "headline": "Index Funds vs. ETFs: 5 key things every investor should know Exchange-Traded Funds are traded like shares on the stock market and can be sold or purchased at existing market prices during the day, while Index Funds are traded only once at the closure of the share market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icmai-seeks-cost-accountant-inclusion-as-accountant-in-income-tax-bill-2683530-2025-02-21",
      "headline": "ICMAI demands 'accountant' status for cost accountants in new Income Tax BillIn its memorandum, ICMAI highlighted the extensive training of Cost and Management Accountants (CMAs), which includes expertise in taxation, finance, auditing, corporate laws, and strategic risk management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-3-deductions-that-can-help-taxpayers-maximise-savings-nps-gratuity-standard-deduction-2683419-2025-02-21",
      "headline": "New tax regime: 3 deductions that can help taxpayers maximise savings  Though the new regime offered concessional tax rates, it reduced several popular deductions and exemptions, like HRA, LTA, interest on home loans, Section 80C, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-to-take-center-stage-at-the-3rd-digital-news-publishers-association-conclave-2683481-2025-02-21",
      "headline": "AI to take centre stage at the 3rd Digital News Publishers Association ConclaveThrough various keynote sessions, panel discussions and expert presentations, this year's DNPA Conclave aims to decode various critical issues, future strategies, opportunities and models that can power an equitable, inclusive and sustainable digital media ecosystem in an era of rapid technological advancement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/association-of-mutual-funds-amfi-launches-chhoti-sip-tarun-yojana-and-mitra-all-you-need-to-know-2683468-2025-02-21",
      "headline": "AMFI launches Chhoti SIP, Tarun Yojana, and MITRA. All you need to knowThe latest initiative by AMFI reinforces its goal of making mutual fund investments accessible to all investors across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-fall-another-session-auto-stocks-tumble-2683435-2025-02-21",
      "headline": "Sensex, Nifty end lower for another session; auto stocks tumbleThe S&P BSE Sensex ended 424.90 points to 75,311.06 at the closing bell, while the NSE Nifty50 fell 117.25 points to settle at 22,795.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/best-high-conviction-stocks-should-you-invest-or-not-explained-2683399-2025-02-21",
      "headline": "Explained: What are 'high-conviction stocks' and why investors should track themHigh-conviction stocks are shares that investors, analysts, or fund managers strongly believe will deliver higher-than-average returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-when-will-it-be-formed-a-look-at-the-past-trends-2683359-2025-02-21",
      "headline": "8th Pay Commission: When will it be formed? A look at the past trendsA Pay Commission recommends changes to the salary structure, allowances and benefits to be offered to employees depending upon the prevailing economic structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-falls-6-percent-today-rights-issue-subsidiaries-explained-2683333-2025-02-21",
      "headline": "Explained: Why M&M share price tumbled 6% todayThe stock tumbled after the company said it will put money into a rights issue for its two subsidiaries—Mahindra & Mahindra Financial Services (MMFSL) and Mahindra Lifespace Developers (MLDL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-about-volatile-stock-market-check-these-10-best-multibagger-stocks-investment-2683312-2025-02-21",
      "headline": "Worried about volatile stock market? Check these 10 potential multibagger stocksThe most important factor for determining multibagger stocks is to check earnings and growth potential. Investors should seek stocks that consistently deliver revenue and profit, check metrics like PE ratio and dividend yield, and compare their performance with sectoral or broader market trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/planning-to-start-sip-2-reasons-why-you-should-consider-nps-national-pension-scheme-2683286-2025-02-21",
      "headline": "Planning to start SIP? 2 reasons why you should consider NPSBy investing in NPS, individuals can claim tax benefits of up to Rs 1.5 lakh under Section 80C and an additional Rs 50,000 under Section 80CCD (1B)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/religare-enterprises-stock-price-jump-up-to-9-percent-today-burman-family-takeover-2683282-2025-02-21",
      "headline": "Explained: Why Religare Enterprises share price jumped up to 9% today Soon after the announcement, Religare's stock price climbed 8.52% to hit Rs 242 on the Bombay Stock Exchange. At around 11:24 am, shares of the company were trading 2.31% higher at Rs 228.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-may-let-foreign-electric-vehicle-makers-like-tesla-test-market-before-investing-2683262-2025-02-21",
      "headline": "India may let foreign EV makers like Tesla test market before investing: ReportThe government may let foreign electric vehicle makers like Tesla sell cars first and invest later, with final SMEC guidelines expected soon to kickstart local manufacturing incentives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-the-share-market-falling-today-3-key-reasons-to-know-2683247-2025-02-21",
      "headline": "Sensex tanks nearly 500 points. 3 reasons why stock market is falling todayThe S&P BSE Sensex was down 461.08 points to 75,274.88 at 11:32 am and the NSE Nifty50 fell 144.45 points to trade at 22,768.70. Here are 3 things investors need to know about today's stock market downturn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-fall-as-fii-selling-trumps-tariff-threat-batter-d-street-2683240-2025-02-21",
      "headline": "Sensex, Nifty fall as FII selling, Trump's tariff threat batter D-StreetThe S&P BSE Sensex was down 272.61 points to 75,463.64 at around 9:51 am, while the NSE Nifty50 declined 91.80 points to 22,821.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/punjab-national-bank-interest-rates-pnb-revises-interest-rates-check-new-home-car-and-personal-loan-rates-2683021-2025-02-20",
      "headline": "PNB revises interest rates. Check new home, car and personal loan rates There will be zero processing fees and documentation charges on most of PNB's home loan schemes till March 31, 2025, thereby making housing loans more affordable and more accessible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-smart-pension-plan-check-eligibility-and-other-details-2682975-2025-02-20",
      "headline": "LIC Smart Pension Plan: Check eligibility and other details The Smart Pension Plan requires a minimum investment of Rs 1,00,000, while there is no cap on the maximum purchase limit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-electric-vehicle-set-for-india-entry-with-first-ev-shipment-in-coming-months-report-2682925-2025-02-20",
      "headline": "Tesla set for India entry with first EV shipment in coming months: Report The US carmaker plans to start selling these cars in the three major cities of Mumbai, Delhi, and Bangalore around the third quarter of the year, say reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-200-points-lower-nifty-below-23000-hdfc-falls-over-2-2682897-2025-02-20",
      "headline": "Sensex ends 200 points lower, Nifty below 23,000; HDFC falls over 2%Stock market closing today: The S&P BSE Sensex ended 203.22 points lower at 75,735.96, while the NSE Nifty50 fell 19.75 points to settle at 22,913.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-impact-on-indian-rupee-jefferies-explained-2682872-2025-02-20",
      "headline": "Will Donald Trump's reciprocal tariffs hurt Indian rupee? It may be noted that India was the 10th biggest exporter to the US in 2024, and higher tariffs might make it tougher for Indian businesses to sell their goods there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/supreme-court-gratuity-act-can-employers-deny-gratuity-in-any-situation-check-ruling-2682833-2025-02-20",
      "headline": "Can employers deny gratuity in any situation? Here's all you need to knowWith the latest ruling, the Supreme Court has stated that if an employer dismisses an employee on grounds of moral turpitude, his gratuity can be forfeited without waiting for a court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-continue-to-dump-indian-stocks-which-stocks-are-feeling-the-heat-2682829-2025-02-20",
      "headline": "FIIs continue to dump Indian stocks: Which stocks are feeling the heat? Data from National Securities Depository Limited (NSDL) showed that FPIs have dumped $3.5 billion worth of financial stocks in 2025 so far, accounting for 31% of their total sales of $11.45 billion as of February 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-offer-relief-for-new-india-co-op-bank-depositors-scam-scrutiny-2682825-2025-02-20",
      "headline": "RBI may allow some depositors of New India Co-op Bank to withdraw funds: Report Last week, the RBI took strict action against New India Co-operative bank by suspending deposit withdrawals for six months, stopping the issuance of new loans, and appointing an administrator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uday-kotak-explains-how-fiis-foreign-outflow-are-gaining-at-the-expense-of-domestic-retail-investors-stock-market-2682813-2025-02-20",
      "headline": "Uday Kotak explains how FIIs are gaining at the expense of domestic investorsUday Kotak said that FIIs are benefiting from the investments made by domestic retail investors, who are continuously putting money into the stock market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-pay-new-bill-payment-google-pay-begins-charging-for-bill-payments-what-users-need-to-know-2682787-2025-02-20",
      "headline": "Google Pay begins charging for bill payments. Here's what users need to knowThis is not the first time Google Pay has announced the imposition of fees. Last year, it levied Rs 3 convenience fee for mobile recharges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-threat-indian-exporters-minimal-impact-explained-2682790-2025-02-20",
      "headline": "Indian exporters aren't losing sleep over Donald Trump's tariff threat. Here's whyIndustry executives say US tariff hikes on autos and pharmaceuticals won't hurt Indian exporters much, as competitors from other countries will face the same impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-cuts-budget-2025-rbi-bulletin-consumption-middle-class-2682747-2025-02-20",
      "headline": "Will tax cuts for middle class in budget help boost consumption? RBI says this The RBI bulletin pointed out that the government has given a Rs 1 lakh crore tax break to the middle class, which should leave more money in their pockets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-top-market-investors-lose-over-rs-80000-crore-radhakishan-damani-dmart-jhunjhunwala-2682742-2025-02-20",
      "headline": "Dalal Street carnage: Top market investors lose over Rs 80,000 croreThe recent stock market downturn has wiped out over Rs 80,000 crore from the portfolios of some of India's most renowned investors, such as Radhakishan Damani and the Jhunjhunwala family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-to-roll-out-upi-based-claim-withdrawals-within-3-months-check-details-2682731-2025-02-20",
      "headline": "EPFO to roll out UPI-based EPF claim withdrawals within 3 months. Check detailsOnce integrated, claim amounts can be easily accessed by the subscribers via digital wallets, mention sources. This would minimise the processing time and lead to an enhanced user-friendly experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-rbi-bulletin-key-points-global-challenges-high-frequency-indicators-2682718-2025-02-20",
      "headline": "Is India's economy set for a strong recovery? Here's what RBI saysThe government's push on capital spending, MSMEs, agriculture, and exports is expected to help the economy in the long run while keeping the fiscal deficit in check. A recent repo rate cut might also support domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-godfrey-phillips-share-price-down-today-gst-hike-possiblity-cigarettes-2682709-2025-02-20",
      "headline": "Why shares of cigarette makers ITC, Godfrey Phillips are falling today?ITC's share price was trading 1.44% lower at Rs 400.65 on the Bombay Stock Exchange (BSE) at 11:06 am. Godfrey Phillips shares were down 4.58% to Rs 6,260 and VST Industries stock was down 3% to Rs 290.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vs-epf-which-one-is-better-for-tax-saving-under-new-income-tax-regime-2682697-2025-02-20",
      "headline": "Why NPS is better than EPF for tax saving under new tax regimeNPS vs EPF: In the case of EPF, employee contributions generally qualify for a deduction under Section 80C of the Income Tax Act, capped at Rs 1.5 lakh annually, under the Old Income Tax regime. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-lower-as-fmcg-banking-stocks-drag-market-nse-bse-dalal-street-2682667-2025-02-20",
      "headline": "Sensex, Nifty open lower as FMCG, banking stocks drag marketThe S&P BSE Sensex lost 233.22 points to 75,705.96, while the NSE Nifty50 was down by 75.05 points to 22,857.85 as of 9:38 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-set-to-rise-government-may-hike-gst-on-tobacco-products-cess-tax-2682653-2025-02-20",
      "headline": "Cigarette prices set to rise? Government may hike GST on tobacco productsCurrently, cigarettes and other tobacco products attract a GST of 28% along with various other levies, taking the total tax burden to 53%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-ahead-outlook-dalal-streets-losing-streak-why-the-market-fall-may-not-end-soon-nse-bse-2682632-2025-02-20",
      "headline": "Dalal Street's losing streak: Why the market fall may not end soonStock Market: The earnings growth of Nifty50 companies was 5% in the October-December quarter, marking the third straight quarter of single-digit growth, which is a sharp contrast to the double-digit profit growth seen in the previous two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-flat-in-volatile-session-small-and-midcaps-gain-2682344-2025-02-19",
      "headline": "Sensex, Nifty end marginally lower in volatile session; small and midcaps gainThe S&P BSE Sensex ended 28.21 points lower at 75,939.18, while the NSE Nifty50 settled 12.40 points lower at 22,932.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fiis-fpis-continue-to-dump-indian-stocks-what-it-means-for-your-investment-portfolio-2682292-2025-02-19",
      "headline": "FIIs continue to dump Indian stocks: What it means for your investment portfolioWith FIIs selling aggressively, smallcaps and midcaps bleeding, and China attracting inflows, here's what retail investors should do. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-likely-to-set-up-manufacturing-hub-india-maharashtra-gujarat-2682262-2025-02-19",
      "headline": "Tesla likely to set up shop in India, may invest $3-5 billion: Sources During their visit, Tesla executives are expected to hold meetings with officials from the Prime Minister's Office (PMO) and other key ministries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-sip-big-returns-investment-tip-check-how-rs-250-a-month-can-grow-to-rs-17-lakh-sbi-jannivesh-2682243-2025-02-19",
      "headline": "Small SIP, big returns: Check how Rs 250 a month can grow to Rs 17 lakhSBI Mutual Fund's new JanNivesh SIP is making investing more accessible, letting anyone start with as little as Rs 250 a month."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/robin-tunney-10-years-the-mentalist-finale-simon-baker-2683326-2025-02-21",
      "headline": "Robin Tunney marks 10 years since The Mentalist finale, thanks fan for their loveActor Robin Tunney celebrated the 10th anniversary of The Mentalist finale, expressing gratitude to fans for their unwavering support. She also reflected on the show's impact on her life and career. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-repeats-usaid-india-funding-voter-turnout-charge-bjp-congress-2683817-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump weighs in again on USAID handout to India, BJP gets bragging rightsUS President Donald Trump's latest salvo comes after a report claimed the $21 million grant was sanctioned in 2022 for Bangladesh, and not India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stricter-rules-online-obscene-ott-content-centre-parliament-panel-ranveer-allahbadia-row-2683895-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stricter rules needed for online content, Centre tells House panel amid joke rowThe issue has gained traction amid an uproar over the crass comments of social media influencer Ranveer Allahbadia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/union-minister-shivraj-singh-chouhan-slams-air-india-broken-seat-2683845-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shivraj Chouhan blasts Air India over flight fiasco: Cheating the passengersIn a detailed post on X, Shivraj Chouhan recounted his ordeal while travelling on Air India flight AI436 to Delhi to inaugurate the Kisan Mela in Pusa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/punjab/story/punjab-nri-affairs-minister-kuldeep-singh-dhaliwal-ran-non-existent-department-for-20-months-bjp-roasts-aap-2683843-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab minister ran 'non-existent' department for 20 months, BJP roasts AAPThe Punjab government's decision to scrap the \"non-existent\" Department of Administrative Reforms came as part of a major administrative overhaul, which also saw the transfer of 21 IPS officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-vicky-kaushal-war-scenes-2683832-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Filming war right: What Chhaava could have learnt from Jodhaa Akbar, Bajirao MastaniChhaava, led by Vicky Kaushal, delivers relentless, violent war sequences that lacks emotional depth, making battles exhausting rather than engaging. Unlike Bajirao Mastani and Jodhaa Akbar, which balanced spectacle with storytelling, Chhaava overwhelms with its brutal scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-pcb-logo-name-snub-broadcasters-icc-2683861-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahead of India vs Pakistan, PCB unhappy over name snub in broadcast graphicsThe Pakistan Cricket Board (PCB) raised concerns after Pakistan's name was missing from the broadcast brand band during India's match against Bangladesh in the Champions Trophy. The ICC attributed the issue to a technical glitch and assured the PCB that it would not happen again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mahakumbh-digital-snan-video-viral-prayagraj-man-startup-service-rs-1100-2683860-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prayagraj man offers 'digital photo snan' for Rs 1,100 at Maha Kumbh. Video goes viralThe man claimed that devotees could send him their photographs via WhatsApp, which he will then print and dip into the holy waters of the Sangam on their behalf."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hunter-schafer-us-actor-transgender-euphoria-star-passport-gender-change-tiktok-video-2683841-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trans US actor Hunter Schafer says passport lists her as male, slams TrumpSchafer, known for her role in the HBO hit show 'Euphoria', asserted she was 'never going to stop being trans' while blasting the new Trump policy that recognises only two sexes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/not-just-mahakumbh-how-spiritual-tourism-is-taking-indians-abroad-2683565-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not just Maha Kumbh, how spiritual tourism is taking Indians abroadExperts believe that Maha Kumbh has put India firmly on the global map of spiritual tourism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-playing-xi-vs-pakistan-rishabh-pant-hero-to-zero-atul-wassan-2683863-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rishabh Pant will go from hero to zero: Ex-pacer slams Gambhir's selection callIndia vs Pakistan: Former India pacer Atul Wassan has warned head coach Gautam Gambhir against ruining Rishabh Pant. Wassan said that Pant will go from hero to zero if he warms the bench in the Indian team.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/family-of-israeli-hostage-shiri-bibas-confirms-new-body-handed-over-by-hamas-is-hers-2683867-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israeli hostage Shiri Bibas's family confirm new body returned by Hamas is hersThe development comes amid outrage in Israel after the body returned earlier this week by Hamas, which it claimed to be that of Shiri Bibas, turned out to be someone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-researchers-find-new-bat-coronavirus-hku5-cov-2-human-infection-potential-sars-cov-2-covid-19-2683785-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China discovers new bat coronavirus capable of infecting humansThe study on the new virus was carried out by leading Chinese virologist Shi Zhengli, who is also known as the \"batwoman\" as a result of her extensive research on bat coronaviruses, at the Guangzhou Laboratory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-atul-wassan-prediction-amitabh-bachchan-2683839-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Want Pakistan to win, no fun watching Amitabh punch villains nonstop: Ex-India pacerFormer India pacer Atul Wassan said he wants Pakistan to beat India to make the business end of the Champions Trophy more exciting. Lamenting the lack of competitiveness in their recent encounters, he compared India's dominance to watching Amitabh Bachchan fight villains without a real challenge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bureaucrat-gst-customs-officer-found-dead-jharkhand-native-sister-mother-kerala-home-police-suspect-mass-suicide-2683844-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "GST officer fails to show up at work, found dead with sister, mother at homeA bureaucrat, his sister and mother were found dead inside their residence within the official quarters in Kerala late Thursday night. While the bodies of the officer and his sister were found hanging in two different rooms, their mother was found lying on the bed in another."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-dutta-defends-rashmika-mandanna-chhaava-criticism-not-forget-hits-animal-vicky-kaushal-2683848-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Divya Dutta defends Rashmika amid Chhaava criticism: Let's not forget her hitsActor Divya Dutta, in an exclusive interview with India Today Digital, defended co-star Rashmika Mandanna amid criticism for her role in Chhaava. The film, starring Vicky Kaushal at Chhatrapati Sambhaji Maharaj, was released in theatres on February 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nargis-fakhri-marries-boyfriend-tony-beig-switzerland-honeymoon-stmp-2683870-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nargis Fakhri marries boyfriend Tony Beig in an intimate ceremony: ReportNargis Fakhri has reportedly married her longtime partner, businessman Tony Beig, in a private ceremony in Los Angeles. The couple also shared a photo from their honeymoon in Switzerland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-451-21-02-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-federal-judge-clears-way-donald-trump-usaid-2000-employees-on-leave-lifts-temporary-restraining-order-2683862-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judge paves way for Trump team to pull over 2,000 USAID workers off jobUS District Judge Carl Nichols in Washington lifted a temporary restraining order he had put in place at the outset of the case and declined to issue a longer-term order keeping the employees in their posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/fire-erupts-at-marine-chambers-building-in-mumbai-no-report-of-deaths-2683875-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fire erupts at Marine Chambers building in Mumbai, no report of deathsMumbai Police were informed of the fire at around 12.25 pm. The building is located in the city's Marine Lines area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/iit-madras-developing-metal-foam-to-protect-bharatiya-space-station-2683825-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT-Madras developing metal foam to protect Bharatiya Space StationThe team has developed a Microgravity Drop Tower — the fourth largest globally — to study materials under zero-gravity conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-fires-joint-chiefs-general-cq-brown-dei-crackdown-federal-employees-diversity-pete-hegseth-2683795-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump fires top military general, 2nd Black man to hold post, in diversity purgeUS President Donald Trump announced that five other high-level positions in the US military would also be replaced in the coming days, marking an unprecedented rejig of the leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-georgia-woman-krystena-murray-fertility-ivf-clinic-embryos-mix-up-couple-surrogate-birth-black-boy-2683830-2025-02-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US woman 'unknowingly' becomes couple's surrogate, sues IVF clinic for mix-upKrystena Murray, 38, discovered that her boy was not biologically related to her after an at-home DNA test. When she notified the fertility clinic about the mix-up, they informed the child's parents, and they in turn sued Murray to obtain custody of their son."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mere-husband-ki-biwi-box-office-collection-day-1-arjun-kapoor-bhumi-pednekar-rakul-preet-singh-2683886-2025-02-22",
      "headline": "Mere Husband Ki Biwi box office Day 1: Tough luck for Arjun Kapoor-starrerMere Husband Ki Biwi, starring Arjun Kapoor, Bhumi Pednekar, and Rakul Preet Singh, had a disappointing start at the box office, earning only Rs 1.5 crore on its first day. The film is facing tough competition from Vicky Kaushal's Chhaava, which is currently dominating the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nargis-fakhri-marries-boyfriend-tony-beig-switzerland-honeymoon-stmp-2683870-2025-02-22",
      "headline": "Nargis Fakhri marries boyfriend Tony Beig in an intimate ceremony: ReportNargis Fakhri has reportedly married her longtime partner, businessman Tony Beig, in a private ceremony in Los Angeles. The couple also shared a photo from their honeymoon in Switzerland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/alec-baldwin-diagnosed-with-ptsd-rust-cinematographer-halyna-hutchins-death-2683859-2025-02-22",
      "headline": "Alec Baldwin diagnosed with PTSD after fatal accident on Rust setAlec Baldwin addresses the tragic death of cinematographer Halyna Hutchins for the first time on his reality show. His wife, Hilaria, also spoke about his PTSD diagnosis during the same episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-dutta-defends-rashmika-mandanna-chhaava-criticism-not-forget-hits-animal-vicky-kaushal-2683848-2025-02-22",
      "headline": "Divya Dutta defends Rashmika amid Chhaava criticism: Let's not forget her hitsActor Divya Dutta, in an exclusive interview with India Today Digital, defended co-star Rashmika Mandanna amid criticism for her role in Chhaava. The film, starring Vicky Kaushal at Chhatrapati Sambhaji Maharaj, was released in theatres on February 14. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-cricket-live-score-today-match-gaddafi-updates-2683894-2025-02-22",
      "headline": "AUS vs ENG Live: Depleted Australia aim to trounce underconfident EnglandAustralia (AUS) vs England (ENG), Champions Trophy Live Score and Updates: Ashes rivals Australia and England are set to play their first match of the Champions Trophy. A depleted Australian side will take Jos Buttler's England, who have been in terrible form coming into the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-playing-xi-vs-pakistan-rishabh-pant-hero-to-zero-atul-wassan-2683863-2025-02-22",
      "headline": "Rishabh Pant will go from hero to zero: Ex-pacer slams Gambhir's selection callIndia vs Pakistan: Former India pacer Atul Wassan has warned head coach Gautam Gambhir against ruining Rishabh Pant. Wassan said that Pant will go from hero to zero if he warms the bench in the Indian team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-pcb-logo-name-snub-broadcasters-icc-2683861-2025-02-22",
      "headline": "Ahead of India vs Pakistan, PCB unhappy over name snub in broadcast graphicsThe Pakistan Cricket Board (PCB) raised concerns after Pakistan's name was missing from the broadcast brand band during India's match against Bangladesh in the Champions Trophy. The ICC attributed the issue to a technical glitch and assured the PCB that it would not happen again."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-afghanistan-vs-south-africa-jonathan-trott-coach-press-conference-2683834-2025-02-22",
      "headline": "Time to pull our socks up: Afghanistan coach after humbling on Champions Trophy debutChampions Trophy 2025: Coach Jonathan Trott did not mince any words as he conceded that Afghanistan were poor in all three departments in their defeat to South Africa in Karachi on Friday. Afghanistan next face England and Australia as their semi-final chances look bleak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-atul-wassan-prediction-amitabh-bachchan-2683839-2025-02-22",
      "headline": "Want Pakistan to win, no fun watching Amitabh punch villains nonstop: Ex-India pacerFormer India pacer Atul Wassan said he wants Pakistan to beat India to make the business end of the Champions Trophy more exciting. Lamenting the lack of competitiveness in their recent encounters, he compared India's dominance to watching Amitabh Bachchan fight villains without a real challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-vs-afghanistan-press-conference-ryan-rickleton-2683837-2025-02-22",
      "headline": "South Africa do not want to burn under the pressure of expectations: RickletonSouth Africa do not want to burn under the pressure of expectation, said Ryan Rickleton after the team's win against Afghanistan. South Africa started their Champions Trophy campaign in style, hammring the Dark Horses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chasing-targets-difficult-ryan-rickleton-2683835-2025-02-22",
      "headline": "Is chasing a target difficult in Champions Trophy 2025?South Africa hammered Afghanistan by 107 runs to win their first match of the Champions Trophy. Chasing a target of 216, Afghanistan folded for 208 runs. After the match, Ryan Rickleton explained why it was difficult to chase targets in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-vs-pakistan-ind-vs-pak-varun-chakravarthy-rohit-sharma-gautam-gambhir-2683736-2025-02-22",
      "headline": "India vs Pakistan: Will Varun Chakravarthy get a chance to heal old wounds?India and Pakistan are set to clash in the Champions Trophy 2025 on Sunday, February 23, in Dubai. Should the Men in Blue tweak their playing XI and bring in Varun Chakravarthy for the blockbuster encounter, given his recent form?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-steve-smith-press-conference-australia-vs-england-2683820-2025-02-22",
      "headline": "People are great, hospitality is very good in Pakistan: Steve SmithChampions Trophy 2025: Australia's stand-in captain Steve Smith fielded tough and quirky questions on the eve of their opener against England in Lahore. Babar was asked to offer a piece of advice to Babar Azam. The superstar batter also praised Pakistan for being a great host. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-age-hard-work-2683804-2025-02-22",
      "headline": "Is playing IPL at 43 tough? MS Dhoni says 6-8 months of hard work is a mustMS Dhoni said playing in the IPL at 43 requires months of hard work to match younger players, but his love for the game keeps him going. Quashing retirement rumours, he confirmed his commitment to Chennai Super Kings for IPL 2025, where he will feature as an uncapped player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-steve-smith-press-conference-babar-azam-advice-aus-vs-eng-2683798-2025-02-22",
      "headline": "Advice for Babar Azam? Steve Smith surprised by question at press conferenceChampions Trophy 2025: Australia captain Steve Smith backed Babar Azam to overcome his poor form but avoided giving direct advice, acknowledging that all players go through tough phases. Smith also dodged a question about predicting the Champions Trophy semi-finalists, emphasising the tournament's competitiveness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chasing-targets-difficult-ryan-rickleton-2683835-2025-02-22",
      "headline": "Is chasing a target difficult in Champions Trophy 2025?South Africa hammered Afghanistan by 107 runs to win their first match of the Champions Trophy. Chasing a target of 216, Afghanistan folded for 208 runs. After the match, Ryan Rickleton explained why it was difficult to chase targets in the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-vs-pakistan-ind-vs-pak-varun-chakravarthy-rohit-sharma-gautam-gambhir-2683736-2025-02-22",
      "headline": "India vs Pakistan: Will Varun Chakravarthy get a chance to heal old wounds?India and Pakistan are set to clash in the Champions Trophy 2025 on Sunday, February 23, in Dubai. Should the Men in Blue tweak their playing XI and bring in Varun Chakravarthy for the blockbuster encounter, given his recent form?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-steve-smith-press-conference-australia-vs-england-2683820-2025-02-22",
      "headline": "People are great, hospitality is very good in Pakistan: Steve SmithChampions Trophy 2025: Australia's stand-in captain Steve Smith fielded tough and quirky questions on the eve of their opener against England in Lahore. Babar was asked to offer a piece of advice to Babar Azam. The superstar batter also praised Pakistan for being a great host. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-age-hard-work-2683804-2025-02-22",
      "headline": "Is playing IPL at 43 tough? MS Dhoni says 6-8 months of hard work is a mustMS Dhoni said playing in the IPL at 43 requires months of hard work to match younger players, but his love for the game keeps him going. Quashing retirement rumours, he confirmed his commitment to Chennai Super Kings for IPL 2025, where he will feature as an uncapped player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-steve-smith-press-conference-babar-azam-advice-aus-vs-eng-2683798-2025-02-22",
      "headline": "Advice for Babar Azam? Steve Smith surprised by question at press conferenceChampions Trophy 2025: Australia captain Steve Smith backed Babar Azam to overcome his poor form but avoided giving direct advice, acknowledging that all players go through tough phases. Smith also dodged a question about predicting the Champions Trophy semi-finalists, emphasising the tournament's competitiveness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-head-to-head-record-dubai-2017-final-2683779-2025-02-22",
      "headline": "Did you know? Pakistan have a better record against India in Champions TrophyIndia and Pakistan are all set to renew their rivalry in the Champions Trophy on Sunday, February 23. Here's a look at what happened when both these teams faced each other in the tournament in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-preview-head-to-head-lahore-pitch-report-2683660-2025-02-22",
      "headline": "Australia vs England: Ashes rivals, in unfamiliar spots, look for early sparkArch-rivals Australia and England are all set to square off in a high-stakes clash, but both sides come into the contest on the back of some poor results. Steve Smith and Jos Buttler will be hoping that their sides can deliver in Lahore on Saturday, February 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-india-might-consider-playing-varun-chakravarthy-against-pakistan-sunil-gavaskar-2683748-2025-02-22",
      "headline": "India might consider playing Varun Chakravarthy against Pakistan: Sunil GavaskarFormer India cricketer Sunil Gavaskar feels India might think about including wrist spinner into their playing XI for the blockbuster clash against Pakistan in the ICC Champions Trophy 2025. Chakravarthy recently made his ODI debut in the second match against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-getting-out-to-spinners-is-a-concern-sunil-gavaskar-2683746-2025-02-22",
      "headline": "Virat Kohli getting out to same type of bowling is a concern: Sunil GavaskarLegendary India cricketer Sunil Gavaskar said that Virat Kohli's continuous dismissals against spin are a concern for team India heading ahead into the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/womens-premier-league-rcb-vs-mi-amanjot-kaur-ellyse-perry-2683740-2025-02-21",
      "headline": "WPL: Ellyse Perry's knock in vain as Mumbai Indians edge past RCB in thrillerEllyse Perry's 81 went in vain as Mumbai Indians edged past Royal Challengers Bengaluru in a last-over thriller at the Chinnaswamy stadium on Friday, February 21. Amanjot was the star of the show as she picked up 2 wickets and scored 34 runs to get her team home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-vs-afghanistan-ryan-rickelton-temba-bavuma-karachi-2683717-2025-02-21",
      "headline": "Who said what after Ryan Rickelton, pacers help South Africa thrash AfghanistanRyan Rickelton admitted that he was a bit nervous ahead of his first match at the Champions Trophy, while Temba Bavuma was happy with his team's clinical performance on the day. Hasmatullah Shahidi rued Afghanistan's batting performance as they were beaten by South Africa on Friday, February 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-steve-smith-wants-australia-switched-on-vs-england-aus-vs-eng-2683713-2025-02-21",
      "headline": "Steve Smith wants Australia to be 'switched on' from 1st game to end win-less runAustralia captain Steve Smith wants his men to be switched on as they begin their campaign in the ICC Champions Trophy 2025 against England in Lahore.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-2683681-2025-02-21",
      "headline": "Champions Trophy: Ryan Rickelton, pacers annihilate Afghanistan in KarachiSouth Africa hammered Afghanistan by 107 runs in their opening fixture of the ICC Champions Trophy 2025 in Karachi. Ryan Rickelton starred for South Africa with a century (103 off 106).                         "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/womens-premier-league-rcb-vs-mi-amanjot-kaur-ellyse-perry-2683740-2025-02-21",
      "headline": "WPL: Ellyse Perry's knock in vain as Mumbai Indians edge past RCB in thrillerEllyse Perry's 81 went in vain as Mumbai Indians edged past Royal Challengers Bengaluru in a last-over thriller at the Chinnaswamy stadium on Friday, February 21. Amanjot was the star of the show as she picked up 2 wickets and scored 34 runs to get her team home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-vs-afghanistan-ryan-rickelton-temba-bavuma-karachi-2683717-2025-02-21",
      "headline": "Who said what after Ryan Rickelton, pacers help South Africa thrash AfghanistanRyan Rickelton admitted that he was a bit nervous ahead of his first match at the Champions Trophy, while Temba Bavuma was happy with his team's clinical performance on the day. Hasmatullah Shahidi rued Afghanistan's batting performance as they were beaten by South Africa on Friday, February 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-steve-smith-wants-australia-switched-on-vs-england-aus-vs-eng-2683713-2025-02-21",
      "headline": "Steve Smith wants Australia to be 'switched on' from 1st game to end win-less runAustralia captain Steve Smith wants his men to be switched on as they begin their campaign in the ICC Champions Trophy 2025 against England in Lahore.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-2683681-2025-02-21",
      "headline": "Champions Trophy: Ryan Rickelton, pacers annihilate Afghanistan in KarachiSouth Africa hammered Afghanistan by 107 runs in their opening fixture of the ICC Champions Trophy 2025 in Karachi. Ryan Rickelton starred for South Africa with a century (103 off 106).                         "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-vs-england-aus-vs-eng-lahore-pitch-report-playing-xi-2683625-2025-02-21",
      "headline": "Australia vs England, all you need to know: Lahore pitch report, playing XIAustralia and England are all set to begin their campaign in the ICC Champions Trophy 2025 as they take on each other on February 22 in Lahore. Both teams are coming on the back of series losses in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-arne-slot-interview-title-race-2683621-2025-02-21",
      "headline": "Arne Slot interview: Liverpool boss reflects on journey, Premier League challengesLiverpool boss Arne Slot is remaining grounded despite his side's incredible season so far in the Premier League. Slot opened up about what drives his team forward amongst a myriad of topics in an interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-prediction-sourav-ganguly-virat-kohli-spin-2683612-2025-02-21",
      "headline": "Sourav Ganguly predicts India vs Pakistan outcome, says spin will be king in DubaiIndia vs Pakistan: Former captain Sourav Ganguly said the defending champions might struggle against India in Dubai. Ganguly also backed Virat Kohli to overcome his struggles against spin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-australia-vs-england-jos-buttler-press-conference-video-lahore-2683596-2025-02-21",
      "headline": "Jos Buttler not taking injury-struck Australia lightly: Expect a tough challengeEngland captain Jos Buttler has claimed that they will not be taking Australia lightly during their Champions Trophy encounter in Lahore on February 22. The Aussies are without the likes of Pat Cummins, Josh Hazlewood, Mitchell Starc and Mitchell Marsh due to injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-jos-buttler-number-six-jamie-smith-2683586-2025-02-21",
      "headline": "Jos Buttler excited for No.6 spot return: Very confident in my own formEngland captain Jos Buttler is excited about making a return to the No.6 spot as they get ready to face off against Australia on February 22. Buttler has demoted himself to No.6 as England will use Jamie Smith as their No.3 batter. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-should-learn-from-rohit-sharma-says-anil-kumble-2683580-2025-02-21",
      "headline": "Out-of-form Kohli should take a leaf out of Rohit Sharma's book: Anil KumbleFormer India cricketer and head coach Anil Kumble has suggested star India batter Virat Kohli to bat with the same freedom as Rohit Sharma in order to return back to form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ryan-rickelton-gets-out-in-bizarre-fashion-after-odi-hundred-2683547-2025-02-21",
      "headline": "Watch: Ryan Rickelton gets out in bizarre fashion after maiden ODI hundredSouth Africa opener Ryan Rickelton got out in a bizarre fashion after scoring his hundred during Match 3 of the ICC Champions Trophy 2025 against Afghanistan in Karachi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-do-or-die-haris-rauf-press-dubai-2683549-2025-02-21",
      "headline": "India vs Pakistan: It's do-or-die, but we feel no added pressure, says Haris RaufChampions Trophy 2025: Fast bowler Haris Rauf acknowledged that Pakistan need nothing less than a win against their arch-rivals on Sunday, but said the team is not taking added pressure before they face India. Pakistan slumped to a 60-run loss in the opener against New Zealand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-round-of-16-draw-real-madrid-liverpool-2683546-2025-02-21",
      "headline": "Champions League Round Of 16: Real Madrid to face Atletico, PSG vs Liverpool setReal Madrid will square off against Atletico Madrid in the Round of 16 of the Champions League while Liverpool will face a tricky test against PSG. Bayern Munich will take on their Bundesliga title rivals Bayer Leverkusen in the Round of 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-kerala-vs-gujarat-semi-final-sanju-samson-2683534-2025-02-21",
      "headline": "Sanju Samson gets emotional as Kerala reach Ranji Trophy final: 1 step awayAn emotional Sanju Samson sent a heartwarming message to the Kerala team as they reached the final of the Ranji Trophy for the first time in their history. Kerala secured a first innings lead against Gujarat to secure their spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-england-steve-smith-approach-lahore-2683488-2025-02-21",
      "headline": "Steve Smith says Australia to have 'flexible' approach during Champions TrophyAustralia captain Steve Smith has said that the team will go for a 'flexible' approach during this year's Champions Trophy. Australia are missing some key players ahead of the start of the tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}