{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-trade-war-fears-spook-markets-sensex-nifty-take-a-hit-as-rupee-weakens-2673983-2025-02-03",
      "headline": "Trade war fears spook markets: Sensex, Nifty take a hit as rupee weakensThe S&P BSE Sensex tanked by 319.22 points to end at 77,186.74, while the NSE Nifty50 lost 128.85 points to close at 23,353.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-reason-why-has-volkswagen-sued-the-indian-authorities-legal-angle-expert-2673959-2025-02-03",
      "headline": "Explained: Why Volkswagen has sued Indian authoritiesAccording to the government, Volkswagen broke down imports of some VW, Skoda, and Audi cars into separate components, instead of declaring them as completely knocked down (CKD) units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-reviewing-crypto-stance-amid-global-policy-shift-us-donald-trump-report-2673919-2025-02-03",
      "headline": "India reviewing crypto stance amid global policy shift: ReportIndians have poured money into cryptocurrencies in recent years despite the country's tough regulatory stance and steep trading taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-regime-annual-salary-more-than-rs-12-lakh-can-you-still-save-tax-explained-deductions-2673868-2025-02-03",
      "headline": "Earn over Rs 12.75 lakh? You can still pay zero tax under new regimeWith a standard deduction of Rs 75,000 under the new regime, salaried taxpayers earning up to Rs 12.75 lakh annually do not need to pay any tax. But what if you have a higher annual income, say Rs 13 lakh or more? You could still end up paying no tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-impact-on-different-salary-levels-calculations-explained-budget-2025-2673906-2025-02-03",
      "headline": "New income tax slabs: Check how much you'll save with these simple calculationsBudget 2025: Tax experts explain how the new income tax changes impact taxpayers across income levels, from Rs 6 lakh to Rs 1 crore, after the fresh proposals in the Union Budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-sues-indian-government-authorities-over-usd-14-billion-crore-tax-notice-report-2673843-2025-02-03",
      "headline": "Volkswagen sues Indian authorities over $1.4 billion tax notice: ReportThe tax dispute began in September 2024, when Indian authorities issued a $1.4 billion tax notice to Volkswagen's Skoda Auto Volkswagen India unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-all-time-low-us-dollar-slumps-past-87-donald-trump-tariffs-2673821-2025-02-03",
      "headline": "Explained: Why rupee fell past 87 against US dollar to a record lowThe Indian rupee (INR) dropped to an all-time low of Rs 87.1450 per dollar, down 0.6% from Friday. It may be noted that the rupee has fallen almost 4% since October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-crashes-700-points-why-is-the-indian-stock-market-falling-today-main-reasons-rupee-us-tariff-2673801-2025-02-03",
      "headline": "Sensex tanks 700 points: Why is the stock market falling today?Stock market crash: Sensex plunged over 700 points and Nifty lost nearly 300 points in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-an-all-time-low-to-go-past-rs-87-against-us-dollar-heres-why-reason-trump-tariff-2673795-2025-02-03",
      "headline": "Rupee hits an all-time low to go past Rs 87 against US dollar. Here's why Rupee hit an all-time low, breaching 87 per US dollar for the first time. The sharp fall was mainly triggered by three executive orders signed by Trump over the weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-today-markets-in-red-sensex-drops-500-points-rupee-hits-record-low-2673786-2025-02-03",
      "headline": "Markets in red: Sensex drops 500 points, rupee hits record lowShare Market Today: The S&P BSE Sensex plunged 516.30 points to 76,989.66, while the NSE Nifty50 fell by 230.90 points to 23,251.25 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-will-sensex-nifty-rally-after-budget-2025-key-stocks-to-buy-fmcg-sector-2673777-2025-02-03",
      "headline": "Stock market today: Will Sensex, Nifty rally after Budget 2025? Stocks to buyShare Market Today: Market experts believe that while the budget had some positive aspects, certain key areas did not meet expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marginal-tax-relief-now-applies-to-income-up-to-rs-12-lakh-what-it-means-for-you-budget-2025-announcements-2673766-2025-02-03",
      "headline": "Zero tax up to income of Rs 12.75 lakh, but what if you earn Rs 12.76 or more?Union Budget 2025: One of the key highlights of Budget 2025 was that individuals earning up to Rs 12 lakh will not have to pay any income tax under the new tax regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-rupee-value-not-falling-us-dollar-rbi-2673597-2025-02-02",
      "headline": "Rupee not falling against any currency other than US dollar: Nirmala SitharamanFinance Minister Nirmala Sitharaman rejected criticism of the rupee's decline, stating it remains stable against most currencies despite a stronger US dollar. She attributed volatility to global factors and highlighted India's strong macroeconomic fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pazhampori-parippu-vada-ada-malayali-tea-stall-snacks-18-percent-gst-rate-2673379-2025-02-02",
      "headline": "Gone bananas! Most Kerala tea-time snacks come under 18% GST From 'pazhampori' to 'ada' and 'undam pori,' beloved Malayali tea-time snacks find themselves caught in the bewildering GST maze. These humble delicacies come with an 18 per cent GST tag, all because they do not have the required 'classification' to be put elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/harley-davidson-import-duty-tax-price-drop-union-budget-imported-bikes-2673462-2025-02-02",
      "headline": "Harley-Davidson bikes to get cheaper as Centre cuts tariff amid Trump threatDonald Trump has consistently pushed for reducing trade barriers, especially on products that the US manufactures, and the high tariff on Harley-Davidson has been a point of contention in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-increased-tds-limit-rs-50000-to-rs-100000-exemption-for-nss-big-relief-for-senior-citizens-2673279-2025-02-01",
      "headline": "Increased TDS limit, exemption for NSS: Big relief for senior citizens Budget 2025 announced major tax reforms for senior citizens, reducing their tax burden and giving a boost to their savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-budget-2025-consumption-growth-investment-savings-investment-praises-tax-relief-nirmala-sitharaman-2673294-2025-02-01",
      "headline": "Will boost savings, investment, consumption, growth: PM on BudgetPrime Minister Narendra Modi praised the Union Budget 2025, calling it a \"force multiplier\" that will boost savings, investment, consumption, and growth. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-tds-reforms-announced-and-limit-for-senior-citizens-doubled-2673246-2025-02-01",
      "headline": "TDS reforms announced, limit for senior citizens doubledBudget 2025: Finance Minister Nirmala Sitharaman announced an increase in the TDS threshold in the Union Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-congratulates-nirmala-sitharaman-finance-minister-everybody-praising-budget-2025-very-good-2673247-2025-02-01",
      "headline": "Everyone's praising you, Budget is very good: PM praises Nirmala SitharamanThe Prime Minister walked up to the bench where Nirmala Sitharaman was seated and expressed his gratitude for presenting her eighth and the Modi 3.0 government's first Budget today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-no-income-tax-payable-up-to-rs-12-lakh-says-nirmala-sitharaman-2673235-2025-02-01",
      "headline": "No tax payable up to Rs 12 lakh income: Budget bonanza for middle classFinance Minister Nirmala Sitharaman announced that taxpayers with salaries up to Rs 12 lakh would not be required to pay tax in the new tax regime. Sitharaman also proposed changes in the slab structure of the new income tax regime. \r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-narendra-modi-congratulates-chandrika-tandon-for-grammy-win-we-take-great-pride-2673932-2025-02-03",
      "headline": "We take great pride: PM Modi congratulates Chandrika Tandon on Grammy winGrammy Awards 2025: Prime Minister Narendra Modi shared a note on social media, congratulating Indian-origin vocalist Chandrika Tandon for winning a Grammy Award on Monday. He talked about her undying passion for Indian culture and her other accomplishments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chandrika-tandon-reflects-on-power-of-music-after-grammy-win-2673920-2025-02-03",
      "headline": "Indian-origin artist Chandrika Tandon reflects on power of music after Grammy winIndian-origin entrepreneur and artist Chandrika Tandon celebrated her Grammy win for the album Triveni, highlighting music's power to unite and inspire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-gets-snubbed-at-the-grammys-fans-call-recording-academy-a-joke-2673918-2025-02-03",
      "headline": "Taylor Swift gets snubbed at the Grammys. Fans call Recording Academy a jokeAt the 67th Grammy Awards, Taylor Swift, Ariana Grande, and Billie Eilish were left empty-handed despite multiple nominations. Beyonce, however, took home the Album of the Year award, adding to her impressive win tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-back-spasm-needle-was-pricking-my-spine-watch-2673905-2025-02-03",
      "headline": "Sonu Nigam performs despite intense pain: Felt needle was pricking my spineSonu Nigam battled excruciating back pain before his Pune show but still delivered a stellar performance. Fans and fellow singers praised his dedication, calling him a true artist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/atif-aslam-honey-singh-and-jason-derulo-in-dubai-pics-2673896-2025-02-03",
      "headline": "'Borderless brothers': Atif Aslam, Honey Singh and Jason Derulo in DubaiIndian rapper Yo Yo Honey Singh, Pakistani singer Atif Aslam and American singer Jason Derulo recently met in Dubai. Jason later shared photos from their gathering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shakira-dedicates-her-grammy-to-immigrant-brothers-sisters-in-us-2673888-2025-02-03",
      "headline": "Shakira dedicates her Grammy to 'immigrant brothers, sisters' in US: You are lovedPop singer Shakira dedicated her Grammy Award to the immigrants in the United States. She won the award for best Latin pop album at the Grammy 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-zakir-hussain-in-memoriam-section-2673881-2025-02-03",
      "headline": "Grammys snub Zakir Hussain in 'In Memoriam' section, fans express disappointmentThe Grammys 2025 omitted tabla maestro Zakir Hussain from its In Memoriam segment, sparking outrage among Indian fans. Hussain, a four-time Grammy winner, died in December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/udit-narayan-seeks-bharat-ratna-like-lata-mangeshkar-has-no-regrets-about-concert-kiss-2673875-2025-02-03",
      "headline": "Udit Narayan seeks Bharat Ratna 'like Lata ji', has no regrets about concert kissUdit Narayan Desires For Bharat Ratna: Singer Udit Narayan said he has 'no regrets' about kissing a woman at his concert. He also shared that he is aspiring to be a recipient of Bharat Ratna 'like Lata Mangeshkar' one day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-sabrina-carpenter-beats-taylor-swift-wins-best-pop-vocal-album-2673807-2025-02-03",
      "headline": "Grammys 2025: Sabrina Carpenter beats Taylor Swift, wins Best Pop Vocal AlbumAt the 67th Annual Grammy Awards, Sabrina Carpenter won Best Pop Vocal Album, surpassing Taylor Swift. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-beyonce-cowboy-carter-first-black-woman-wins-album-of-the-year-2673815-2025-02-03",
      "headline": "Grammys 2025: Beyonce becomes first Black woman to win Album of the YearThe 67th Annual Grammy Awards celebrated music's finest, with Beyonce's Cowboy Carter clinching Album of the Year. This made her the first black woman to win this honour in the 21st century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/who-is-chandrika-tandon-indian-origin-artist-who-won-her-first-grammy-2673812-2025-02-03",
      "headline": "Who is Chandrika Tandon, Indian-origin artist who won her first Grammy?Indian-origin musician and entrepreneur Chandrika Tandon won her first Grammy in the Best New Age, Ambient, or Chant Album category. Here's all you need to know about her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/video/jason-derulo-and-nora-fatehi-most-fun-savage-interview-on-snake-their-bond-collaboration-2673800-2025-02-03",
      "headline": "Jason Derulo and Nora Fatehi MOST fun, savage interview on Snake, their bondJason Derulo and Nora Fatehi spoke to India Today's Bhavna Agarwal about their collaboration, their favourite thing about working with each other, Jason's love for chicken biryani, their bond and more!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-chappell-roan-wins-best-new-artist-calls-out-record-labels-2673799-2025-02-03",
      "headline": "Grammys: Chappell Roan wins Best New Artist, calls out record labelsChappell Roan won the Grammy for Best New Artist. She celebrated her win by advocating fair treatment and benefits for emerging artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indian-origin-chandrika-tandon-wins-grammy-beats-ricky-kej-anoushka-shankar-2673793-2025-02-03",
      "headline": "Indian-origin Chandrika Tandon wins Grammy, beats Ricky Kej, Anoushka ShankarGrammy Awards: Chandrika Tandon wins a Grammy for Triveni in the Best New Age, Ambient, or Chant Album category, beating Ricky Kej and Anoushka Shankar, at the 67th Grammy Awards, being held in Los Angeles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/video/kanye-west-wife-bianca-censoris-nude-outfit-reveal-at-grammys-2025-2673785-2025-02-03",
      "headline": "Video: Kanye West's wife Bianca Censori's nude outfit reveal at Grammys 2025Kanye West and his wife Bianca Censori turned heads at the 67th Grammys with their unexpected appearance. Bianca's almost nude look at the event left everyone shocked. The couple were reportedly escorted out of the Grammys. It is being speculated that Bianca's controversial dress could have been the reason for the couple's ouster from the awards show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-wife-bianca-censori-potential-arrest-legal-repurcussions-due-to-naked-grammys-look-2673778-2025-02-03",
      "headline": "Can Kanye's wife Bianca Censori be arrested because of her 'naked' Grammys look?Kanye West and his wife Bianca Censori made headlines at the 67th Grammys with their unexpected appearance. Bianca's sheer dress, almost giving the illusion of nudity, led to speculation about potential legal issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/67th-grammys-full-winners-list-2025-2673751-2025-02-03",
      "headline": "Grammys full winners list: Beyonce wins Best Album, Kendrick takes home 5 awardsThe 2025 Grammy Awards was held at Crypto.com Arena at Los Angeles. Artistes like Beyonce, Kendrick Lamar, and Sabrina Carpenter took home some of the biggest awards of the night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kanye-west-wife-bianca-censori-escorted-out-of-grammys-report-2673745-2025-02-03",
      "headline": "Grammys: Kanye West, wife Bianca Censori escorted out after 'nude' dress reveal?Grammys Awards 2025: According to reports, Rapper Kanye West and wife Bianca Censori arrived at the Grammys 2025 uninvited and were soon escorted out by security. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/grammys-2025-red-carpet-sabrina-carpenter-a-vision-in-blue-jaden-smith-castle-headpiece-2673744-2025-02-03",
      "headline": "Grammys red carpet: Taylor Swift is a vision in red, Sabrina stuns in baby blueThe 2025 Grammys are officially underway, with stars gracing the red carpet in their most glamorous looks yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/former-us-president-jimmy-carter-wins-posthumous-grammy-for-best-audiobook-2673742-2025-02-03",
      "headline": "Former US President Jimmy Carter wins posthumous Grammy for Best AudiobookFormer US President Jimmy Carter won posthumous Grammy for narrating an audiobook of his Sunday school lessons."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-visit-s-jaishankar-trump-coronation-invite-attack-2673997-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM's invite never discussed: Jaishankar on Rahul Gandhi's 'Trump coronation' jibeRahul Gandhi spoke a falsehood about my US visit: S Jaishankar rebuts 'Trump coronation invite' attack"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/big-post-budget-mood-upswing-48-hours-ahead-of-delhi-polls-shows-c-voter-survey-2673885-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Big post-budget mood upswing 48 hours ahead of Delhi polls, shows C Voter surveyThe massive jump in the exemption limit - from Rs 7 lakh to Rs 12 lakh - shows the political instincts of this regime are very much intact. The happiest lot is the salaried middle class. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kumbh-water-contaminated-bodies-disposed-river-jaya-bachchan-budget-session-parliament-2673985-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumbh water most contaminated as bodies disposed of in river: Jaya BachchanSamajwadi Party MP Jaya Bachchan on Monday alleged that the water at the Maha Kumbh was contaminated because the bodies of those who died in last month's stampede were thrown into the river."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/rasmus-paludan-quran-burning-who-is-he-world-most-hunted-salwan-momika-killing-sweden-denmark-2673897-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rasmus Paludan, world's most-hunted, burns Quran over Salwan Momika's killingDanish-Swedish far-right politician Rasmus Paludan, one of the world's most hunted men, has burnt copies of the Quran outside the Turkish embassy in Denmark. Paludan said that was his way of paying tribute to Quran-burner Salwan Momika, who was shot dead in Sweden. It was Turkey that didn't allow Sweden to join Nato over the Quran-burning incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-tribute-to-boyfriend-travis-kelce-bodychain-letter-charm-at-the-grammys-2025-2673924-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Taylor Swift's fashionable tribute to boyfriend Travis Kelce at the Grammys 2025Taylor Swift looked stunning in a sparkly red dress at the Grammys 2025, but her special jewellery piece stole the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/not-bjp-congress-might-hurt-aap-most-in-12-delhi-seats-in-delhi-assembly-election-2025-heres-why-explained-2673915-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not BJP, Congress might hurt AAP the most in these 12 Delhi seats. Here's whyThe 2025 Delhi Assembly election has turned into a two-way battle between the AAP and the Congress in 12 of the 70 seats. This is why the 12 seats will see an AAP-Congress direct contest, and are among the 30 that the Congress is focusing on to stay relevant in Delhi's politics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-lok-sabha-address-army-contradicted-pm-modi-chinese-intrusion-kiren-rijiju-counters-2673931-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi, BJP clash in Parliament over his 'Trump coronation invite' jibeRahul Gandhi claimed that External Affairs Minister S Jaishankar went to the United States to convince the US to invite PM Modi for Donald Trump's swearing-in ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-lauded-himanshu-sangwan-for-ranji-trophy-wicket-2673951-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kaafi teekhe bowler ho: How Kohli lauded Himanshu Sangwan for Ranji Trophy wicketStar India batter Virat Kohli showered massive praise on Himanshu Sangwan after he dismissed him in the Ranji Trophy 2024-25 match between Delhi and Railways."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/video/kanye-west-wife-bianca-censoris-nude-outfit-reveal-at-grammys-2025-2673785-2025-02-03?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Kanye West's wife Bianca Censori's nude outfit reveal at Grammys 2025Kanye West and his wife Bianca Censori turned heads at the 67th Grammys with their unexpected appearance. Bianca's almost nude look at the event left everyone shocked. The couple were reportedly escorted out of the Grammys. It is being speculated that Bianca's controversial dress could have been the reason for the couple's ouster from the awards show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/a-celebration-of-rohit-bals-legacy-at-blenders-pride-fashion-tour-2025-2673256-2025-02-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Celebration of Rohit Bal's Legacy at Blenders Pride Fashion Tour 2025A grand celebration of Rohit Bal's iconic work at Blenders Pride Fashion Tour brought together his closest friends, industry icons, and admirers in an unforgettable evening honouring his legacy and artistic brilliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/retired-soldier-dies-terrorists-shoot-jammu-and-kashmir-kulgam-2673955-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Retired soldier dies after terrorists fire at him, his family in J&K's KulgamA former soldier was killed and his wife and daughter sustained injuries after terrorists opened fire at their house in Kashmir's Kulgam region. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-lok-sabha-pm-modi-bjp-government-achievement-corruption-boring-remark-president-murmu-address-2673921-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I struggled through President's address: Rahul Gandhi amid 'boring' remark row Live UpdatesAs he replied to the Motion of Thanks today, Rahul Gandhi also said that he struggled through the President's address to \"maintain my attention to what was being said because I had heard pretty much the same last time and the time before that\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/udit-narayan-seeks-bharat-ratna-like-lata-mangeshkar-has-no-regrets-about-concert-kiss-2673875-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Udit Narayan seeks Bharat Ratna 'like Lata ji', has no regrets about concert kissUdit Narayan Desires For Bharat Ratna: Singer Udit Narayan said he has 'no regrets' about kissing a woman at his concert. He also shared that he is aspiring to be a recipient of Bharat Ratna 'like Lata Mangeshkar' one day. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/illegal-migration-delhi-demography-electoral-process-crime-networks-slums-jawaharlal-nehru-university-jnu-report-2673899-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Illegal migration changing Delhi's demography, undermining poll process: JNU reportA JNU report found illegal migration from Bangladesh and Myanmar has reshaped Delhi's social, political, and economic landscape. It highlighted voter registration fraud, economic strain, slum expansion, and links to criminal networks, warning of governance challenges.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/neet-2019-topper-nalin-khandelwal-cracked-neet-on-first-attempt-success-story-stmp-2673870-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "He cracked NEET 2019 on first attempt with 99.9999 percentile. Where is he now?NEET 2019 topper Nalin Khandelwal had cracked the medical entrance exam on his first attempt with an outstanding percentile of 99.9999291. Here's what he is doing now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-reason-why-has-volkswagen-sued-the-indian-authorities-legal-angle-expert-2673959-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why Volkswagen has sued Indian authoritiesAccording to the government, Volkswagen broke down imports of some VW, Skoda, and Audi cars into separate components, instead of declaring them as completely knocked down (CKD) units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/banned-but-thriving-how-loopholes-keep-gutkha-alive-in-india-2673954-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Banned but thriving: How loopholes keep gutkha alive in IndiaIndia's gutkha ban, a public health milestone, has been undermined by industry circumvention, weak enforcement, and systemic corruption. Exploiting legal loopholes, manufacturers thrive through dual packaging and clandestine networks, leaving public health, governance, and anti-tobacco efforts struggling against entrenched societal norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/budget-2025-nirmala-sitharaman-income-tax-rates-indira-gandhi-975-tax-rate-increase-highest-history-2673055-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid Budget relief, a look at when Indira Gandhi taxed income at 97.5%It was under then Prime Minister and Congress leader Indira Gandhi that India saw the highest tax rate of 97.5% in 1973-74. Indira saw taxation as \"a major instrument to achieve greater equality of incomes and wealth\". A look at the high rate of taxation during the Indira era amid major tax relief proposed in Budget 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-trade-war-fears-spook-markets-sensex-nifty-take-a-hit-as-rupee-weakens-2673983-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trade war fears spook markets: Sensex, Nifty take a hit as rupee weakensThe S&P BSE Sensex tanked by 319.22 points to end at 77,186.74, while the NSE Nifty50 lost 128.85 points to close at 23,353.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/aap-bjp-congress-who-will-win-delhi-assembly-election-five-deciding-factors-muslims-dalits-middle-class-tax-2673923-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who will win Delhi? 5 factors that will play deciderDelhi Election 2025: As Delhi votes on February 5, AAP is aiming for a third term while the BJP is hoping to break its 23-year streak of defeats in the national capital. Who will Delhi vote for? A look at five factors that will play the decider."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamta-kulkarni-expelled-from-kinnar-akhara-no-money-2673861-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mamta Kulkarni expelled from Kinnar Akhara, says 'I have no money'Former actor Mamta Kulkarni was appointed as Mahamandaleshwar of the Kinnar Akhara. She has since been expelled. After her expulsion, Mamta opened up about her financial struggles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-regime-annual-salary-more-than-rs-12-lakh-can-you-still-save-tax-explained-deductions-2673868-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Earn over Rs 12.75 lakh? You can still pay zero tax under new regimeWith a standard deduction of Rs 75,000 under the new regime, salaried taxpayers earning up to Rs 12.75 lakh annually do not need to pay any tax. But what if you have a higher annual income, say Rs 13 lakh or more? You could still end up paying no tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anand-reaction-gukesh-vs-praggnanandhaa-tata-steel-chess-2673927-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viswanathan Anand's light-hearted take on Pragg vs Gukesh: Mere pass panch haiTata Steeel Chess Masters 2025: Legendary Viswanathan Anand lauded Praggnanandhaa and Gukesh for battling it out on a tense final day in Wijk aan Zee. Praggnanandhaa defeated the reigning world champion in tie-breakers to win the prestigious title for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammys-2025-zakir-hussain-in-memoriam-section-2673881-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Grammys snub Zakir Hussain in 'In Memoriam' section, fans express disappointmentThe Grammys 2025 omitted tabla maestro Zakir Hussain from its In Memoriam segment, sparking outrage among Indian fans. Hussain, a four-time Grammy winner, died in December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-offers-prayers-baidyanath-jyotirling-deoghar-jharkhand-photos-sky-force-2673982-2025-02-03",
      "headline": "Pics: Sara Ali Khan offers prayers at Baidyanath Jyotirling in JharkhandActor Sara Ali Khan recently visited Baidyanath Jyotirling in Deoghar, Jharkhand. She shared pictures from the holy trip where her friend accompanied her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vidaamuyarchi-to-neek-upcoming-tamil-film-releases-in-february-stmp-2673961-2025-02-03",
      "headline": "Ajith's Vidaamuyarchi to NEEK, upcoming Tamil releases in FebruaryUpcoming Tamil Movies Releasing: February 2025 promises an exciting lineup of Tamil movies with Ajith Kumar's Vidaamuyarchi among the most anticipated releases. Fans are anticipating a cinematic treat with a diverse range of films hitting the screens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sandeep-reddy-vanga-naga-chaitanyas-style-influenced-kabir-singh-and-animal-looks-2673965-2025-02-03",
      "headline": "Sandeep Reddy Vanga: Naga Chaitanya's style influenced Kabir Singh and Animal looksDirector Sandeep Reddy Vanga, during a pre-release event of Thandel, shared how actor Naga Chaitanya's real-life style influenced the looks in his hit films Kabir Singh and Animal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb29-ss-rajamouli-to-recreate-kashi-for-mahesh-babu-priyanka-chopra-film-2673917-2025-02-03",
      "headline": "SSMB29: SS Rajamouli to recreate Kashi for Mahesh Babu, Priyanka Chopra filmThe buzz around SS Rajamouli's upcoming project starring Mahesh Babu, SSMB29, has only been growing since it was announced. Latest reports suggest that Rajamouli plans to recreate Kashi's divine look on the sets of the film. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadavs-best-fielder-of-the-series-medal-dhruv-jurel-t-dilip-2673980-2025-02-03",
      "headline": "Watch: Suryakumar Yadav's playful tease while announcing best fielder of the seriesIndia's T20I captain Suryakumar Yadav had a playful tease with his teammates as he announced the best fielder of the series award after the fifth T20I vs England. India beat England by 4-1 in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-niki-prasad-heartbreak-glory-2673731-2025-02-03",
      "headline": "How Niki Prasad faced heartbreak to bring India World Cup gloryBack in 2023, one of India's youngest scouts, Nisarg Naik, had predicted that Niki Prasad would lead India to victory in the U19 Women's T20 World Cup 2025. On Sunday, under Niki, India successfully defended their crown after beating South Africa in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-mitchell-marsh-jasprit-bumrah-nightmare-2673969-2025-02-03",
      "headline": "Bumrah nightmare continued: Marsh says nephew imitated pacer in backyardMitchell Marsh revealed how the 'Jasprit Bumrah nightmare' continued for him when his nephew imitated the Indian pacer's bowling action during a session of backyard cricket. Marsh was one of the batters Bumrah was able to trouble during the Border-Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-lauded-himanshu-sangwan-for-ranji-trophy-wicket-2673951-2025-02-03",
      "headline": "Kaafi teekhe bowler ho: How Kohli lauded Himanshu Sangwan for Ranji Trophy wicketStar India batter Virat Kohli showered massive praise on Himanshu Sangwan after he dismissed him in the Ranji Trophy 2024-25 match between Delhi and Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-andre-russell-bangladesh-premier-league-ilt20-2673950-2025-02-03",
      "headline": "Andre Russell plays in BPL 2025 less than 24 hours after playing in ILT20In less than 24 hours, Andre Russell played for the Abu Dhabi Knight Riders in the ILT20 after which he turned up for the Rangpur Riders in the Bangladesh Premier League. Russell recently completed 9000 runs in T20s and has over 450 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anand-reaction-gukesh-vs-praggnanandhaa-tata-steel-chess-2673927-2025-02-03",
      "headline": "Viswanathan Anand's light-hearted take on Pragg vs Gukesh: Mere pass panch haiTata Steeel Chess Masters 2025: Legendary Viswanathan Anand lauded Praggnanandhaa and Gukesh for battling it out on a tense final day in Wijk aan Zee. Praggnanandhaa defeated the reigning world champion in tie-breakers to win the prestigious title for the first time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-alyssa-healy-up-warriorz-rcb-replacement-2673914-2025-02-03",
      "headline": "UP Warriorz name Alyssa Healy's replacement, RCB suffer double blowWPL 2025: UP Warriorz have named Chinelle Henry as a replacement for Alyssa Healy. Royal Challengers Bengaluru roped in Heather Graham and Kim Garth after Kate Cross and Sophie Devine opted out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pep-guardiola-manchester-city-fragile-players-arsneal-thrashing-premier-league-2673902-2025-02-03",
      "headline": "Guardiola slams 'fragile' Manchester City players after Arsenal thrashingPep Guardiola slammed his Manchester City squad as \"fragile\" after their humiliating 5-1 defeat to Arsenal, highlighting their lack of discipline and costly mistakes, while Erling Haaland endured mockery from Arsenal players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-pakistan-tickets-details-icc-champions-trophy-2025-2673895-2025-02-03",
      "headline": "How to book tickets for IND vs PAK Champions Trophy 2025 match: Full ProcessIND vs PAK Champions Trophy 2025 Match: The ICC is set to release the tickets for the India vs Pakistan game and all other India matches in the Champions Trophy 2025 on Monday, February 3. Here's the complete guide on how to book tickets for the blockbuster clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gongadi-trisha-kamalini-icc-womens-t20-team-of-tournament-2673876-2025-02-03",
      "headline": "Gongadi Trisha among 4 Indians in team of ICC Women's Under-19 T20 World CupICC Women's T20 World Cup 2025: Four Indians, including Player of the Tournament Gongadi Trisha, were named in the team of the tournament, announced on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-irfan-pathan-takes-a-dig-at-england-after-series-loss-in-mumbai-ind-vs-eng-2673867-2025-02-03",
      "headline": "Pathan takes a dig at England after series loss: Smog & trouble-free for India IND vs ENG: Former India all-rounder Irfan Pathan has taken a dig at England after their T20I series loss against India. India won the fifth and final T20I in Mumbai by 150 runs to clinch the series 1-4."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-alyssa-healy-up-warriorz-rcb-replacement-2673914-2025-02-03",
      "headline": "UP Warriorz name Alyssa Healy's replacement, RCB suffer double blowWPL 2025: UP Warriorz have named Chinelle Henry as a replacement for Alyssa Healy. Royal Challengers Bengaluru roped in Heather Graham and Kim Garth after Kate Cross and Sophie Devine opted out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pep-guardiola-manchester-city-fragile-players-arsneal-thrashing-premier-league-2673902-2025-02-03",
      "headline": "Guardiola slams 'fragile' Manchester City players after Arsenal thrashingPep Guardiola slammed his Manchester City squad as \"fragile\" after their humiliating 5-1 defeat to Arsenal, highlighting their lack of discipline and costly mistakes, while Erling Haaland endured mockery from Arsenal players and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-pakistan-tickets-details-icc-champions-trophy-2025-2673895-2025-02-03",
      "headline": "How to book tickets for IND vs PAK Champions Trophy 2025 match: Full ProcessIND vs PAK Champions Trophy 2025 Match: The ICC is set to release the tickets for the India vs Pakistan game and all other India matches in the Champions Trophy 2025 on Monday, February 3. Here's the complete guide on how to book tickets for the blockbuster clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gongadi-trisha-kamalini-icc-womens-t20-team-of-tournament-2673876-2025-02-03",
      "headline": "Gongadi Trisha among 4 Indians in team of ICC Women's Under-19 T20 World CupICC Women's T20 World Cup 2025: Four Indians, including Player of the Tournament Gongadi Trisha, were named in the team of the tournament, announced on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-irfan-pathan-takes-a-dig-at-england-after-series-loss-in-mumbai-ind-vs-eng-2673867-2025-02-03",
      "headline": "Pathan takes a dig at England after series loss: Smog & trouble-free for India IND vs ENG: Former India all-rounder Irfan Pathan has taken a dig at England after their T20I series loss against India. India won the fifth and final T20I in Mumbai by 150 runs to clinch the series 1-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/marcus-rashford-thanks-manchester-united-aston-villa-loan-deal-premier-league-transfers-2673848-2025-02-03",
      "headline": "Rashford thanks Manchester United for making Aston Villa loan deal happenMarcus Rashford thanked Manchester United after sealing his Aston Villa loan move, calling it an easy choice as he aims to rediscover his best form under Unai Emery in the Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sunil-gavaskar-ind-vs-eng-shivam-dube-harshit-rana-concussion-substitute-controversy-pune-2673832-2025-02-03",
      "headline": "Gavaskar lashes out at India for Shivam Dube controversy: He was not concussedLegendary India cricketer Sunil Gavaskar has shared his views on the concussion substitute controversy during the fourth T20I vs England saying that Shivam Dube was not concussed as he batted till the end."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/manchester-united-ruben-amorim-lisandro-martinez-injury-serious-situation-vs-crystal-palace-2673829-2025-02-03",
      "headline": "United boss Ruben Amorim calls Lisandro Martinez injury 'serious situation'Ruben Amorim expressed concern over Lisandro Martinez's injury, calling it serious, as Manchester United's defensive depth faces a major challenge following the centre-back's stretchered exit in their 2-0 defeat to Crystal Palace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-announces-cash-reward-for-indias-under-19-womens-team-after-world-cup-win-2673808-2025-02-03",
      "headline": "BCCI announces Rs 5 crore reward for India's U-19 women's team after World Cup winThe BCCI announced a cash prize of Rs 5 crore for the Indian team after their triumph in the ICC Women's Under 19 World Cup in Malaysia. India beat South Africa by nine wickets in the final to clinch their second consecutive title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-mohammed-shami-will-get-confidence-odi-cricket-parthiv-patel-2673805-2025-02-03",
      "headline": "Mumbai spell will give Shami confidence for ODI cricket: Parthiv PatelParthiv Patel believes Mohammed Shami's impressive 3/25 spell in Mumbai will boost his confidence for the upcoming England ODIs and Champions Trophy, reinforcing India's pace attack ahead of the crucial 50-over tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-credits-yuvraj-singh-after-century-vs-england-in-mumbai-ind-vs-eng-2673790-2025-02-03",
      "headline": "Yuvraj was the one who believed in me, it's all because of him: Abhishek SharmaIND vs ENG: India's young opening batter Abhishek Sharma credited legendary all-rounder Yuvraj Singh for shaping up his career after his breathtaking century vs England in the fifth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-gautam-gambhir-abhishek-sharma-century-havent-seen-one-like-this-mumbai-2673789-2025-02-03",
      "headline": "Gambhir praises Abhishek's century vs England: Haven't seen one like thisIndia head coach Gautam Gambhir hailed Abhishek Sharma's fearless 135-run knock against England as the best T20I innings he has seen, praising the youngster's aggressive approach against Jofra Archer and Mark Wood in a dominant victory for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-virat-kohli-rohit-sharma-greeted-nagpur-odi-series-opener-2673771-2025-02-03",
      "headline": "Watch: Fans greet Kohli, Rohit as Indian ODI team lands in NagpurIndia stars, led by Rohit Sharma and Virat Kohli, received a grand welcome in Nagpur as they arrived for the ODI series opener against England, aiming to fine-tune preparations ahead of the 2025 ICC Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-mohammed-shami-will-get-confidence-odi-cricket-parthiv-patel-2673805-2025-02-03",
      "headline": "Mumbai spell will give Shami confidence for ODI cricket: Parthiv PatelParthiv Patel believes Mohammed Shami's impressive 3/25 spell in Mumbai will boost his confidence for the upcoming England ODIs and Champions Trophy, reinforcing India's pace attack ahead of the crucial 50-over tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-credits-yuvraj-singh-after-century-vs-england-in-mumbai-ind-vs-eng-2673790-2025-02-03",
      "headline": "Yuvraj was the one who believed in me, it's all because of him: Abhishek SharmaIND vs ENG: India's young opening batter Abhishek Sharma credited legendary all-rounder Yuvraj Singh for shaping up his career after his breathtaking century vs England in the fifth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-gautam-gambhir-abhishek-sharma-century-havent-seen-one-like-this-mumbai-2673789-2025-02-03",
      "headline": "Gambhir praises Abhishek's century vs England: Haven't seen one like thisIndia head coach Gautam Gambhir hailed Abhishek Sharma's fearless 135-run knock against England as the best T20I innings he has seen, praising the youngster's aggressive approach against Jofra Archer and Mark Wood in a dominant victory for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-virat-kohli-rohit-sharma-greeted-nagpur-odi-series-opener-2673771-2025-02-03",
      "headline": "Watch: Fans greet Kohli, Rohit as Indian ODI team lands in NagpurIndia stars, led by Rohit Sharma and Virat Kohli, received a grand welcome in Nagpur as they arrived for the ODI series opener against England, aiming to fine-tune preparations ahead of the 2025 ICC Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rishi-sunak-watches-eng-ind-t20-match-in-mumbai-with-infosys-chief-narayana-murthy-2673763-2025-02-03",
      "headline": "Rishi Sunak at India vs England match in Mumbai with Narayana Murthy, posts picsIndia vs England T20 Final: Former UK Prime Minister Rishi Sunak attended the final T20 match between England and India in Mumbai with his father-in-law, Infosys chief Narayana Murthy. He also visited the Parsee Gymkhana before the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-abhishek-sharma-gautam-gambhir-suryakumar-yadav-rohit-sharma-virat-kohli-2673759-2025-02-03",
      "headline": "India's T20I domination over England shows Gambhir needs transition in Test cricketThe Indian team's transition in T20I cricket has been seamless as they trounced England. The success in the shortest format has been down to the right profiles coming in, something the Test team needs desperately. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-5th-t20i-mumbai-abhishek-sharma-jos-buttler-suryakumar-yadav-gautam-gambhir-2673755-2025-02-03",
      "headline": "IND vs ENG: Who said what as Abhishek Sharma show ruins Bazball's T20I debutIND vs ENG: India registered a comprehensive 150-run victory over England in the fifth and final T20I at Wankhede Stadium in Mumbai. Here's a look at what the players and the captains said after Abhishek Sharma's breathtaking century helped India register a commanding win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/r-praggnanandhaa-thanks-arjun-erigaisi-tata-steel-chess-championship-win-should-buy-something-2673754-2025-02-03",
      "headline": "Praggnanandhaa jokes after Tata Steel win: Should buy Erigaisi somethingR Praggnanandhaa secured the 2025 Tata Steel Chess title after a thrilling tiebreak victory over D Gukesh, crediting Arjun Erigaisi's crucial win and humorously suggesting he should buy him a gift for the assist."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}