{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-baba-siddique-salman-khan-responsibility-2616117-2024-10-13",
      "headline": "Lawrence Bishnoi gang claims Baba Siddique murder, sends Salman Khan a message Live UpdatesThe Lawrence Bishnoi gang claimed responsibility for killing NCP leader Baba Siddique. In a Facebook post, a gang member claimed Siddique's ties to Bollywood actor Salman Khan led to his murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gauri-lankesh-murder-accused-granted-bail-given-heros-welcome-by-pro-hindu-group-bengaluru-court-2616188-2024-10-13",
      "headline": "Gauri Lankesh murder accused get grand welcome from pro-Hindu groupsTwo men accused of murdering journalist Gauri Lankesh received a hero's welcome by pro-Hindu supporters in Vijayapura after being granted bail by a Bengaluru court. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-lawrence-bishnoi-gang-responsibility-jail-phone-faster-salman-khan-2616134-2024-10-13",
      "headline": "Exclusive: Lawrence Bishnoi's video call from jail with Pak gangster resurfacesLawrence Bishnoi, lodged in Sabarmati Central Jail in Ahmedabad, has been on a silent fast for the past nine days. It is believed that the gangster observes this silent fast whenever his gang commits a major crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-spacex-catches-19-storey-super-heavy-rocket-mid-air-2616244-2024-10-13",
      "headline": "Video: SpaceX catches 19-storey Super Heavy rocket mid-airWhile Starship continued its journey towards a controlled splashdown in the Indian Ocean, all eyes turned to the returning booster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/october-heat-like-summer-humidity-resulting-in-fever-cough-flu-delhi-lucknow-kolkata-hospital-monsoon-heatwave-2615111-2024-10-13",
      "headline": "Sweating and sneezing: How October heat is fuelling a health crisis in IndiaEarlier, October marked the transition between seasons, and was a month of mild weather and festivities. However, a rise in global temperatures and a shift in weather patterns have given rise to October heat. And October heat has become a serious health risk, with hospitals in several cities flooded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-live-news-ncp-leader-maharashtra-mumbai-shot-dead-2616043-2024-10-13",
      "headline": "NCP leader Baba Siddique had no categorised security, says Mumbai PoliceBaba Siddique Murder News Live: Former Maharashtra minister and Nationalist Congress Party (NCP) leader Baba Siddique was shot dead by three men in Mumbai's Bandra area on Saturday. Siddique, 66, was attacked outside his son's office, and later succumbed to his injuries at Lilavati Hospital. Two suspects have been arrested, while a third remains at large. The murder of Siddique, a prominent leader who served three terms as the MLA from Bandra (West), comes as the state is likely to hold assembly elections soon. Political leaders across parties expressed shock and condemnation, with NCP chief Ajit Pawar and Chief Minister Eknath Shinde both vowing a thorough investigation. Opposition leaders, including Congress' Balasaheb Thorat and Shiv Sena's Aaditya Thackeray, also voiced concerns about the state's security, calling it a collapse of the administration. Siddique had joined the Ajit Pawar-led NCP faction earlier this year after leaving Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/antonio-guterres-israel-ban-letter-condemnation-india-abstains-p-chidambaram-2616119-2024-10-13",
      "headline": "Inexplicable: Chidambaram as India refuses to condemn Israel's ban on UN chiefCongress leader P Chidambaram said India broke ranks with BRICS partners and allies by not signing the letter condemning Israel's decision to ban UN Secretary General Antonio Guterres from entering the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/baba-siddique-murder-accused-dharam-rajesh-kashyap-juvenility-court-bone-ossification-2616237-2024-10-13",
      "headline": "Baba Siddique murder accused claims he is a minor, court orders bone ossificationThe court ordered that Dharamraj Kashyap, who claimed to be a juvenile, be sent for a bone ossification test. Gurmail Singh, the other accused, was sent to a police custody till October 21."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/salman-khan-pooja-bhatt-to-zaheer-iqbal-celebs-at-baba-siddiques-residence-2616245-2024-10-13",
      "headline": "Pooja Bhatt to Zaheer Iqbal, celebs at Baba Siddique's residenceSeveral celebrities, including Salman Khan and his family, Pooja Bhatt, Karan Singh Grover, Sana Khan, Zaheer Iqbal, and Zareen Khan, arrived at Nationalist Congress Party (NCP) leader Baba Siddique's residence to offer their condolences to the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-death-accused-lawrence-bishnoi-gang-gurmail-singh-dharmaraj-rajesh-kashyap-2616155-2024-10-13",
      "headline": "Baba Siddique murder accused's families claim no contact, one was out on bail Two accused--Gurmail Baljit Singh and Dharmaraj Rajesh Kashyap--have been arrested for the murder of NCP leader Baba Siddique, while the third one--Shiv Kumar--is on the run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-recalls-gautam-gambhirs-old-tweet-on-sanju-samson-best-young-batter-in-india-2616150-2024-10-13",
      "headline": "Chopra recalls Gambhir's old tweet on Samson: Best young batter in IndiaFormer cricketer Aakash Chopra believes that Gautam Gambhir is a big fan of Sanju Samson. Chopra reminded fans of an old tweet from the Indian head coach's account.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/divya-khossla-karan-johar-cryptic-post-jigra-row-alia-bhatt-similarities-savi-2616174-2024-10-13",
      "headline": "Divya Khossla reacts to Karan Johar's cryptic post on Jigra rowActor-director Divya Khossla recently reacted to Karan Johar's cryptic post on Jigra row. Divya had claimed that Alia Bhatt's latest release Jigra is a copy of her film Savi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/starship-super-heavy-launch-live-video-updates-elon-musk-spacex-science-nasa-moon-mission-2616131-2024-10-13",
      "headline": "Starship Super Heavy launch LIVE: SpaceX catches 19-storey rocketStarship Super Heavy launch LIVE: The mission's primary objectives include launching the Starship-Super Heavy combination, guiding the Starship upper stage for a controlled splashdown in the Indian Ocean, and attempting the daring booster catch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-cancels-meetings-family-requests-privacy-baba-siddique-death-killing-lawrence-bishnoi-2616144-2024-10-13",
      "headline": "Salman Khan cancels meetings, family requests privacy after Baba Siddique's deathActor Salman Khan, who has been affected by NCP leader Baba Siddique's death, cancelled all his meetings. The actor's family has requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-3/story/chandrayaan-3s-vikram-closes-ramp-performs-hop-in-new-footage-from-moon-2616228-2024-10-13",
      "headline": "New footage from Chandrayaan-3 shows moment it hopped on the MoonThis newly released footage provides a detailed look at the lander's capabilities and the precision of its operations on the Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-shot-dead-2013-iftar-party-shah-rukh-khan-salman-khan-feud-end-hug-2616051-2024-10-13",
      "headline": "Baba Siddique's iftar and SRK-Salman patch-up: It was Allah, I had no roleBaba Siddique was known for his close ties with Bollywood's biggest stars, including Shah Rukh Khan and Salman Khan. He played a pivotal role in ending the Khans' five-year-long feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-entertainment-sports-425-11-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-takes-virat-kohlis-example-questions-pakistan-on-dropping-babar-azam-2616195-2024-10-13",
      "headline": "India did not drop Virat Kohli: Fakhar Zaman comes in support of Babar AzamPakistan dropped Babar Azam from their Test squad for the 2nd and 3rd matches against England. In the tumultuous times, Fakhar Zaman questioned Pakistan's decision to drop their premier batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mallikarjun-kharge-returns-land-allotted-by-karnataka-amid-muda-scam-probe-2616149-2024-10-13",
      "headline": "Mallikarjun Kharge returns land allotted by Karnataka amid Muda 'scam' probeThe controversy began in March 2024, when the Karnataka Congress government granted land to the Siddhartha Vihar Trust, headed by Rahul Kharge. The BJP was quick to criticise the allotment, accusing the government of \"misuse of power\" and \"nepotism\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/should-you-boil-the-milk-you-get-in-a-packet-2615115-2024-10-13",
      "headline": "Should you boil the milk you get in a packet?When a packet of milk arrives at your home, do you immediately boil it? Find out from experts whether this is a healthy practice or if it compromises milk's nutritional value."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/man-thrashed-hockey-sticks-group-miscreants-kolkata-sskm-hospital-2616159-2024-10-13",
      "headline": "Man thrashed with hockey sticks at Kolkata hospital, left bloodiedHospital sources said Sourav Modak is currently undergoing treatment in critical condition. He sustained serious injuries to his head, face, legs, and wrists, and several bones in his arms and legs were broken."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-killing-accused-found-hiding-bushes-before-arrest-video-gunshot-shot-dead-2616118-2024-10-13",
      "headline": "Video: Baba Siddique murder accused found hiding in bushes before arrestBaba Siddique was shot dead while leaving his office for his residence in Bandra West on Saturday night. A total of six rounds of bullets were fired at Baba Siddique, three of which hit him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-bypolls-by-election-key-bjp-meet-today-delhi-decision-on-seat-sharing-allies-likely-2616100-2024-10-13",
      "headline": "UP bypolls: Key BJP meet today in Delhi, decision on seat-sharing likelyThere is speculation that discussions in the meeting will focus on which seats will be allotted to the BJP's allies. Sources suggest that while the BJP is ready to leave the Mirapur seat for its ally, the RLD, it remains unwilling to concede the Khair seat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/salman-khan-pooja-bhatt-to-zaheer-iqbal-celebs-at-baba-siddiques-residence-2616245-2024-10-13",
      "headline": "Pooja Bhatt to Zaheer Iqbal, celebs at Baba Siddique's residenceSeveral celebrities, including Salman Khan and his family, Pooja Bhatt, Karan Singh Grover, Sana Khan, Zaheer Iqbal, and Zareen Khan, arrived at Nationalist Congress Party (NCP) leader Baba Siddique's residence to offer their condolences to the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-announces-new-film-with-dasara-director-srikanth-odela-2616230-2024-10-13",
      "headline": "Nani announces new film with Dasara director Srikanth OdelaTelugu actor Nani announced his new film with filmmaker Srikanth Odela. The duo previously collaborated for their film Dasara. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/sohail-khan-sister-arpita-and-celebs-at-baba-siddique-residence-2616224-2024-10-13",
      "headline": "Sohail Khan, sister Arpita, and celebs at Baba Siddique's residenceSalman Khan's family, including his brother Sohail Khan, sister Arpita Khan, Iulia Vantur, and Arbaaz Khan's wife Sshura Khan, were seen arriving at the Siddique residence on Sunday evening, October 13. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/salman-khan-arrives-at-baba-siddiques-residence-amid-high-security-2616220-2024-10-13",
      "headline": "Salman Khan arrives at Baba Siddique's residence amid high securitySalman Khan was seen arriving at Baba Siddique's residence on Sunday, October 13. A video of his arrival at the house amidst heightened security surfaced online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-tesla-humanoid-optimus-says-hardest-part-of-being-a-robot-is-trying-to-be-human-2615330-2024-10-11",
      "headline": "Elon Musk's Tesla humanoid Optimus reveals hardest part of being a robotElon Musk unveiled the latest generation of Tesla's humanoid Optimus at the We, Robot event. While according to Musk, the robots can now do anything, Optimus reveals that the hardest part of being a robot is learning how to be human. Read on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/star-health-insurance-hack-led-to-personal-data-of-31-million-customers-being-compromised-story-in-5-points-2615354-2024-10-11",
      "headline": "Star Health hack led to data leak of 31 million customers: Story in 5 pointsIndia's popular health insurers, Star Health insurance, faced a massive data leak this week, which may have led to the data of 31 million customers being compromised. Here is everything that has happened in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/how-to-get-new-siri-with-apple-intelligence-in-india-first-look-at-ios-181-more-features-2615301-2024-10-11",
      "headline": "How to get new Siri with Apple Intelligence in India? First look at iOS 18.1 & more featuresApple has released the latest developer Beta for iOS 18.1, showcasing some new features like the new Siri, Writing Tools and more. Watch the video to know more. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wuhan-open-aryna-sabalenka-qinwen-zheng-final-2616251-2024-10-13",
      "headline": "Sabalenka makes history with Wuhan Open title after beating Zheng Wuhan Open 2024: Aryna Sabalenka claimed the title for the third year in a row after beating China's Qinwen Zheng 6-3, 5-7, 6-3 in the final on Sunday, October 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-hardik-pandya-poses-for-selfie-with-ballboy-2616248-2024-10-13",
      "headline": "Watch: Hardik Pandya poses for selfie with ballboy while fielding vs BangladeshIndia all-rounder Hardik Pandya was seen posing for a selfie with a ballboy during the third T20I against Bangladesh in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-ruturaj-gaikwad-maharastra-india-vs-australia-border-gavaskar-trophy-squad-2616246-2024-10-13",
      "headline": "Gaikwad boosts Australia tour selection chances with 86 in Ranji TrophyRuturaj Gaikwad's crucial knock of 86 in the Ranji Trophy opener showcased his readiness for potential selection in India's Border-Gavaskar Trophy squad, bolstering his bid amidst speculation of Rohit Sharma's rest for the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-scotland-danni-wyatt-hodge-sophie-ecclestone-report-2616236-2024-10-13",
      "headline": "Ecclestone, Bouchier, Wyatt-Hodge shine as England rout Scotland Women's T20 World Cup 2024: England beat Scotland by 10 wickets after Maia Bouchier and Danni Wyatt-Hodge scored unbeaten half-centuries. Heather Knight's women also reclaimed their top spot in the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-impressed-by-hardik-pandyas-swag-in-bangladesh-series-victory-2616231-2024-10-13",
      "headline": "Aakash Chopra impressed by Hardik Pandya's 'swag' in Bangladesh series victoryFormer India cricketer Akash Chopra hailed Hardik Pandya for his exceptional batting in the Bangladesh T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-happy-new-zealand-semi-final-chances-own-hands-2616233-2024-10-13",
      "headline": "Devine happy to have New Zealand's semi-final chances in own handsNew Zealand captain Sophie Devine remains optimistic as her team faces a net run-rate challenge to secure a semi-final spot in the Women's T20 World Cup. New Zealand's match against Pakistan could be pivotal, depending on the outcome of the India-Australia game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-babar-azam-shaheen-afridi-dropped-choas-fans-reaction-2616227-2024-10-13",
      "headline": "Absolute chaos: Fans on Pakistan dropping Babar, Afridi for England TestPakistan cricket fans were left in disbelief as the newly-formed selection committee dropped star players Babar Azam, Naseem Shah, and Shaheen Shah Afridi for the second Test against England, sparking widespread outrage on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-premier-league-mahela-jayawardene-mumbai-indians-comeback-fans-react-2616215-2024-10-13",
      "headline": "He is back to reclaim glory: Fans react to Jayawardene's MI comebackMumbai Indians have reignited hopes of reclaiming their IPL dominance with the return of Mahela Jayawardene as head coach, replacing Mark Boucher. Fans anticipate a resurgence after two disappointing seasons under Boucher's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahela-jaywardane-replaces-mark-boucher-as-mumbai-indians-head-coach-ipl-2025-2616202-2024-10-13",
      "headline": "Mahela Jaywardene replaces Mark Boucher as Mumbai Indians head coachFormer Sri Lanka cricketer Mahela Jayawardene has been appointed as the head coach of the Mumbai Indians for the IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-jannik-sinner-novak-djokovic-atp-title-2616198-2024-10-13",
      "headline": "Sinner becomes youngest to win Shanghai Masters after beating DjokovicShanghai Masters: Jannik Sinner beat Novak Djokovic 7-6 (7-4), 6-3 in the final and won his fourth ATP Masters 1000 title. He became the first Italian and the youngest to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-takes-virat-kohlis-example-questions-pakistan-on-dropping-babar-azam-2616195-2024-10-13",
      "headline": "India did not drop Virat Kohli: Fakhar Zaman comes in support of Babar AzamPakistan dropped Babar Azam from their Test squad for the 2nd and 3rd matches against England. In the tumultuous times, Fakhar Zaman questioned Pakistan's decision to drop their premier batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-babar-azam-shaheen-afridi-dropped-choas-fans-reaction-2616227-2024-10-13",
      "headline": "Absolute chaos: Fans on Pakistan dropping Babar, Afridi for England TestPakistan cricket fans were left in disbelief as the newly-formed selection committee dropped star players Babar Azam, Naseem Shah, and Shaheen Shah Afridi for the second Test against England, sparking widespread outrage on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-premier-league-mahela-jayawardene-mumbai-indians-comeback-fans-react-2616215-2024-10-13",
      "headline": "He is back to reclaim glory: Fans react to Jayawardene's MI comebackMumbai Indians have reignited hopes of reclaiming their IPL dominance with the return of Mahela Jayawardene as head coach, replacing Mark Boucher. Fans anticipate a resurgence after two disappointing seasons under Boucher's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahela-jaywardane-replaces-mark-boucher-as-mumbai-indians-head-coach-ipl-2025-2616202-2024-10-13",
      "headline": "Mahela Jaywardene replaces Mark Boucher as Mumbai Indians head coachFormer Sri Lanka cricketer Mahela Jayawardene has been appointed as the head coach of the Mumbai Indians for the IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-jannik-sinner-novak-djokovic-atp-title-2616198-2024-10-13",
      "headline": "Sinner becomes youngest to win Shanghai Masters after beating DjokovicShanghai Masters: Jannik Sinner beat Novak Djokovic 7-6 (7-4), 6-3 in the final and won his fourth ATP Masters 1000 title. He became the first Italian and the youngest to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-takes-virat-kohlis-example-questions-pakistan-on-dropping-babar-azam-2616195-2024-10-13",
      "headline": "India did not drop Virat Kohli: Fakhar Zaman comes in support of Babar AzamPakistan dropped Babar Azam from their Test squad for the 2nd and 3rd matches against England. In the tumultuous times, Fakhar Zaman questioned Pakistan's decision to drop their premier batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-harmanpreet-singh-soorma-club-punjab-hardik-singh-up-rudras-2616190-2024-10-13",
      "headline": "HIL: Soorma signs Harmanpreet for Rs 78 lakh, Hardik joins UPThe Hockey India League 2024 auction saw record-breaking bids, with Harmanpreet Singh joining Soorma Hockey Club for Rs 78.1 lakhs and Hardik Singh signing with UP Rudras for Rs 70 lakhs, igniting excitement ahead of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-babar-azam-dropped-shaheen-afridi-naseem-shah-2616186-2024-10-13",
      "headline": "Pakistan drop Babar, Shaheen and Naseem for last two Tests against EnglandPakistan Cricket Board has dropped star batter Babar Azam, wicketkeeper Sarfaraz Ahemd and fast bowlers Shaheen Afridi and Naseem Shah for the remaining two Tests against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uruguay-manager-marcelo-bielsa-authority-was-affected-by-suarez-criticism-2616183-2024-10-13",
      "headline": "Uruguay manager Marcelo Bielsa says his authority was affected by Suarez criticismUruguay's national team manager, Marcelo Bielsa, has acknowledged that his authority has been compromised following public criticism from the country's legendary striker, Luis Suárez. Suárez accused Bielsa of dividing the squad and suggested that his coaching style was causing unrest among players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/heather-graham-tayla-vlaeminck-australia-india-replacement-2616184-2024-10-13",
      "headline": "Heather Graham replaces injured Tayla Vlaeminck before India clashWomen's T20 World Cup: Australia have roped in Heather Knight as a replacement for fast bowler Tayla Vlaeminck, who sustained an injury on her right shoulder in the match against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lee-carsley-does-not-want-england-manager-permanent-basis-2616163-2024-10-13",
      "headline": "Interim manager Carsley says he has not formally applied for England jobInterim England manager Lee Carsley has confirmed that he does not seek the role of permanent head coach, despite his ongoing success with the team during his temporary tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-recalls-gautam-gambhirs-old-tweet-on-sanju-samson-best-young-batter-in-india-2616150-2024-10-13",
      "headline": "Chopra recalls Gambhir's old tweet on Samson: Best young batter in IndiaFormer cricketer Aakash Chopra believes that Gautam Gambhir is a big fan of Sanju Samson. Chopra reminded fans of an old tweet from the Indian head coach's account.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-fielder-of-the-series-award-washington-sundar-hardik-pandya-2616148-2024-10-13",
      "headline": "Washington Sundar pips Hardik Pandya to win fielder's medal in Bangladesh T20IsIndian all-rounder Washington Sundar pipped Hardik Pandya for the Impact Fielder of the series award in their 3-T20I outing against Bangladesh, Washington beat Hardik and Riyan Parag to clinch the medal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lee-carsley-does-not-want-england-manager-permanent-basis-2616163-2024-10-13",
      "headline": "Interim manager Carsley says he has not formally applied for England jobInterim England manager Lee Carsley has confirmed that he does not seek the role of permanent head coach, despite his ongoing success with the team during his temporary tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aakash-chopra-recalls-gautam-gambhirs-old-tweet-on-sanju-samson-best-young-batter-in-india-2616150-2024-10-13",
      "headline": "Chopra recalls Gambhir's old tweet on Samson: Best young batter in IndiaFormer cricketer Aakash Chopra believes that Gautam Gambhir is a big fan of Sanju Samson. Chopra reminded fans of an old tweet from the Indian head coach's account.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-fielder-of-the-series-award-washington-sundar-hardik-pandya-2616148-2024-10-13",
      "headline": "Washington Sundar pips Hardik Pandya to win fielder's medal in Bangladesh T20IsIndian all-rounder Washington Sundar pipped Hardik Pandya for the Impact Fielder of the series award in their 3-T20I outing against Bangladesh, Washington beat Hardik and Riyan Parag to clinch the medal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-table-tennis-championships-india-three-medals-women-doubles-bronze-2616143-2024-10-13",
      "headline": "Asian TT Championships: India win three medals, including women's doubles bronzeIndia's table tennis team concluded their campaign at the Asian Championships with three medals. The women's doubles team made history by securing a bronze, marking India's first-ever medal in this category at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-failed-to-bat-bowl-or-field-well-vs-india-towhid-hridoy-2616124-2024-10-13",
      "headline": "Bangladesh failed to bat, bowl or field well: Hridoy on 3-0 series loss to IndiaTowhid Hridoy acknowledged Bangladesh's shortcomings across all departments but emphasized the need for more experience on flat, high-scoring pitches to sharpen their skills and improve performances in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-pak-vs-england-test-series-pcb-meeting-babar-azam-dropped-2616125-2024-10-13",
      "headline": "Big changes on cards? Pakistan board top brass meets after England lossThe Pakistan Cricket Board top brass met for a 2-hour-long meeting after the team's horror loss against England in the 1st Test match. PCB chairman Mohsin Naqvi not only reviewed the recent performances from players but also instructed to make better pitches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tim-southee-test-spot-uncertain-coach-gary-stead-2616112-2024-10-13",
      "headline": "Will Southee lose his spot in New Zealand side on India tour? Coach Stead reactsFormer New Zealand captain Tim Southee's position in the Test squad is under scrutiny as the team prepares for their series against India. With Southee stepping down as captain, New Zealand considers new options for their bowling attack."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}