{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-400-points-nifty-ends-above-26000-amid-volatile-trade-2823801-2025-11-21",
      "headline": "Sensex tumbles 400 points, Nifty ends above 26,000 amid volatile tradeThe S&P BSE Sensex fell more than 400 points to close at 85,231, while the NSE Nifty50 managed to stay above the 26,000 mark despite broad-based weakness across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-implements-four-labour-codes-replacing-29-old-laws-check-details-2823795-2025-11-21",
      "headline": "Government implements four labour codes, replacing 29 old laws. Check detailsThe move brings together decades-old labour rules that were scattered across multiple legislations into a consolidated framework. Many of these older laws date back to the pre-Independence and early post-Independence era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-to-record-low-of-rs-8945-amid-us-india-trade-uncertainty-2823785-2025-11-21",
      "headline": "Rupee slides to record low of Rs 89.45 amid US-India trade uncertaintyThe outlook for the rupee remains uncertain as global risk sentiment stays fragile and investors wait for clearer signals from both the Fed and ongoing trade negotiations between Washington and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-fully-subscribed-on-day-1-check-latest-gmp-and-other-2823780-2025-11-21",
      "headline": "Sudeep Pharma IPO fully subscribed on day 1. Check latest GMP and otherThe issue, priced between Rs 563 and Rs 593, saw a clear surge from retail and high-net-worth investors, allowing the company to cross the one-time subscription mark even though institutional participation remained weak through the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-gmp-social-media-hype-retail-investors-explained-2823730-2025-11-21",
      "headline": "How GMP and social media hype mislead so many first-time investorsThe Great IPO Gamble series ends here, and in part 3, we break down how GMP and social media hype influence first-time investors. A look at the noise behind the numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-customer-data-restaurants-controversy-privacy-concerns-2823623-2025-11-21",
      "headline": "Recipe for trouble? Zomato's customer data move stirs up controversyZomato controversy: Food delivery giant Zomato has decided to share customer data with restaurants after years of tussle. Politicians and marketing gurus have called it a recipe for trouble, expressing concerns about data privacy and spam messages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/reliance-industries-halts-russian-oil-imports-at-jamnagar-refinery-amid-sanctions-ytvd-2823600-2025-11-21",
      "headline": "Russian Oil: Reliance Halts Russian Crude Imports at Jamnagar SEZ RefineryThis report covers Reliance Industries' decision to halt the import of Russian crude oil for its export-oriented refinery in Jamnagar, Gujarat. The move is in compliance with European Union and United States sanctions targeting Russian oil majors Rosneft and Lukoil, with a wind-down period ending November 21. Reliance stated, 'we'll stay aligned with government's policy.' The company will now source crude from other regions, including West Asia and the EU, for its Special Economic Zone (SEZ) refinery, with all exports to be derived from non-Russian oil starting December 1. The decision impacts a long-term deal between Reliance and Rosneft for the supply of crude oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-power-share-price-falls-after-rally-profit-taking-2823589-2025-11-21",
      "headline": "JP Power share price tumbles 7% after strong rally. Why is it down today?The JP Power share price dip reflects profit-taking after a steep run, as the market waits for clearer evidence that the broader group's restructuring will lift the company's long-term fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-rises-after-two-day-fall-q2-results-why-billionbrains-stock-up-2823581-2025-11-21",
      "headline": "Groww shares jump nearly 7% after two-day tumble: What's driving today's rally?Around 10:03 am, the shares of the company were trading 6.30% higher at Rs 166.44 on the Bombay Stock Exchange (BSE). The rebound comes amid growing anticipation around Groww's performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-26200-hindalco-down-nearly-3-2823559-2025-11-21",
      "headline": "Sensex, Nifty fall in early trade as hopes of US rate cut fadeAround 9:23 am, the S&P BSE Sensex was down 131 points at 85,501.03, while the NSE Nifty50 slipped 40.70 points to 26,151.45. Volatility was high in early trade and all major sectoral indices were in the red, reflecting the cautious mood on Dalal Street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-halts-russian-crude-jamnagar-sez-refinery-eu-sanctions-glbs-2823492-2025-11-21",
      "headline": "Reliance ends use of Russian crude for exports to comply with EU sanctionsReliance's decision shows how quickly the global rules around Russian oil are changing, and how Indian refiners are now being pushed to realign their supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-group-says-ed-attached-assets-belong-to-rcom-not-part-of-group-since-2019-2823468-2025-11-20",
      "headline": "Reliance Group says ED-attached assets belong to RCom, not part of group since 2019The ED, meanwhile, detailed its searches across Tamil Nadu in a land-forgery and inflated compensation scam involving forged deeds, dummy buyers and layered transactions, seizing and freezing assets worth Rs 18.10 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-will-you-get-itr-refund-december-2025-cbdt-chairman-ravi-agrawal-delay-reason-2823254-2025-11-20",
      "headline": "Waiting for your tax refund? Here's why it's delayed and when it may arriveAccording to the Income Tax Department, more than 7.57 crore returns were filed by September 23, yet refunds for many taxpayers remain pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-nearly-450-points-higher-nifty-nears-life-time-high-2823139-2025-11-20",
      "headline": "Sensex ends nearly 450 points higher, Nifty nears life-time highThe S&P BSE Sensex rose 446.21 points to close at 85,632.68, while the NSE Nifty50 climbed 139.50 points to finish at 26,192.15. Broader indices were mixed, but the tone across frontline stocks remained firmly positive, led by gains in heavyweight financial counters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-500-points-nifty-nears-life-time-high-whats-driving-the-rally-2823064-2025-11-20",
      "headline": "Sensex surges 500 points, Nifty nears life-time high. What's driving the rally?At 1.58 am, the S&P BSE Sensex was up 526.63 points to 85,713.10, while the NSE Nifty50 hit a fresh 52-week high and was nearing an all-time high of 26,277. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-falls-for-second-day-tumbles-10-post-listing-rally-over-2823020-2025-11-20",
      "headline": "Groww share price falls 10% again: Is the post-listing rally over?Around 1:12 pm, shares of the company were trading 9.18% lower at Rs 154.30. Over the last two sessions, the stock has slipped nearly 18%, a sharp reversal that has investors wondering whether the post-listing rally has already run its course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/leading-e-commerce-platforms-say-they-now-comply-with-anti-dark-pattern-rules-2823001-2025-11-20",
      "headline": "Leading e-commerce platforms say they now comply with anti–dark pattern rulesAmong the 26 companies listed by the CCPA are well-known names such as Flipkart, Myntra, Zomato, Swiggy, Meesho, BigBasket, JioMart and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/the-new-trade-playbook-why-the-world-needs-a-more-distributed-system-2822970-2025-11-20",
      "headline": "The new trade playbook: Why the world needs a more distributed systemThese shifts are not driven by a single factor but by the combined influence of policy changes, supply chain lessons from recent years, and the evolving priorities of businesses and governments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-for-beginners-rs-5000-monthly-investment-tips-how-to-make-1-crore-stock-market-investing-2822963-2025-11-20",
      "headline": "Investing Rs 5,000 every month in SIPs? This is when you can hit Rs 1 crorePeople know SIPs are useful, they hear stories of long-term gains, and they see friends investing every month, but when it comes to choosing where to put a small amount like Rs 5,000, most feel lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ed-attaches-anil-ambani-linked-assets-worth-rs-1400-crore-total-nears-rs-9000-crore-2822929-2025-11-20",
      "headline": "ED attaches Anil Ambani-linked assets worth Rs 1,400 crore; total nears Rs 9,000 croreThe latest attachment has been made under the Prevention of Money Laundering Act (PMLA). The properties are located across Navi Mumbai, Chennai, Pune and Bhubaneswar, the sources said."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/piyush-mishra-to-gen-z-do-your-karma-dont-live-a-second-rate-life-like-a-corpse-2823858-2025-11-21",
      "headline": "Piyush Mishra to Gen Z: Do your Karma, don't live a second rate life like a corpse Piyush Mishra recently appeared on Sahitya Aaj Tak 2025. In an exclusive interview, he spoke about his book 'Tumhari Aukaat Kya Hai Piyush Mishra'. He also opened up on his friendship and commented on Gen Z's obsession with social media likes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/12a-railway-colony-review-weak-writing-turns-a-thriller-into-a-twist-dump-2823908-2025-11-21",
      "headline": "12A Railway Colony review: Weak writing turns thriller into a twist dumpRelease Date:Fri Nov 21, 2025  '12A Railway Colony' starts with a promising setup, but the thriller quickly derails as weak writing, shallow logic and a rush of unearned twists take over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/prithviraj-vilayath-budha-sandalwood-smuggling-kerala-mass-action-thriller-2823912-2025-11-21",
      "headline": "Vilayath Budha review: Prithviraj's action thriller is flawed but entertainingRelease Date:Fri Nov 21, 2025 Vilayath Budha film review: This Prithviraj Sukumaran starrer Malayalam film has been directed by debutant Jayan Nambiar and is an entertaining action thriller that has some plot holes, but Prithvi's swag covers it up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chadwick-boseman-honoured-hollywood-walk-of-fame-star-legacy-impact-2823920-2025-11-21",
      "headline": "Chadwick Boseman honoured with Walk of Fame star, wife Simone breaks down Late actor Chadwick Boseman was posthumously honoured with a star on the Hollywood Walk of Fame, with his wife Simone Ledward-Boseman, family members, and colleagues from the film industry attending an emotional ceremony in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-roses-review-benedict-olivia-are-a-riot-in-fiercely-funny-film-that-cuts-deep-2823931-2025-11-21",
      "headline": "The Roses review: Benedict-Olivia are a riot in fiercely funny film that cuts deepRelease Date:Fri Nov 21, 2025 Benedict Cumberbatch and Olivia Colman shine in 'The Roses', a darkly comic, smartly observed film about modern relationships, ambition, and the messy fallout of love gone sideways. Your absolute weekend watch!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-supports-ex-wife-reena-datta-at-nehru-centre-art-exhibition-2823906-2025-11-21",
      "headline": "Reena Dutta thanks Aamir Khan for visiting her art exhibit Actor Aamir Khan made a public appearance at his former wife Reena Datta's art exhibition in Mumbai, highlighting their amicable relationship years after their divorce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-cha-eun-woo-the-internet-favourite-face-genius-2823716-2025-11-21",
      "headline": "Why Cha Eun-woo is the internet's favourite face genius Cha Eun-woo's rise from Astro idol to global K-drama favourite is unstoppable. A look at his journey, acting highlights and why Gen Z cannot get enough of him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-final-release-date-cast-plot-netflix-split-launch-2823799-2025-11-21",
      "headline": "Stranger Things Season 5: Release date, cast and what's coming next in Hawkins Stranger Things returns with its fifth and final season, premiering November 26 on Netflix after a three-year gap. The new season will be released in three parts and will also receive a limited theatrical release in the US. The cast returns to face a new threat in Hawkins in 1987."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/homeless-kevin-spacey-says-a-call-from-scorsese-or-tarantino-could-end-his-woes-2823804-2025-11-21",
      "headline": "'Homeless' Kevin Spacey says a call from Scorsese or Tarantino could end his woes Kevin Spacey has revealed he is officially homeless, moving between Airbnbs due to astronomical legal costs. The actor, whose home was foreclosed, stated the industry is waiting for \"permission\" from an authority like Martin Scorsese or Quentin Tarantino to hire him for prominent roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-salman-khan-joint-appearances-social-media-buzz-india-2823797-2025-11-21",
      "headline": "SRK and Salman visit Abu Dhabi museum, pose with giant dino fossil Bollywood icons Shah Rukh Khan and Salman Khan have made headlines with a series of high-profile joint appearances, including a recent visit to the Natural History Museum in Abu Dhabi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-watches-baahubali-the-epic-re-edited-film-prasads-multiplex-hyderabad-2823821-2025-11-21",
      "headline": "Prabhas watches Baahubali The Epic at Hyderabad's Prasads Multiplex. Watch Prabhas visited Hyderabad's Prasads Multiplex to watch the re-edited 'Baahubali: The Epic'. The film's re-run has crossed nearly Rs 80 crore, marking a grand celebration of the franchise's 10th anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kavin-mask-film-review-dark-comedy-political-heist-thriller-2823777-2025-11-21",
      "headline": "Mask review: Kavin, Andrea star in intriguing heist drama that doesn't fully deliverRelease Date:Fri Nov 21, 2025 Mask movie review: Directed by Vikarnan Ashok, and starring Kavin and Andrea Jeremiah, 'Mask' is a heist drama that is intriguing. While the film shows a lot of potential with its story, it is bogged down by pacing and editing issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-jokes-about-war-2-failure-admits-his-last-film-bombed-at-box-office-2823770-2025-11-21",
      "headline": "Hrithik Roshan jokes about War 2 failure, admits his last film bombed at box office Hrithik Roshan recently joked about his last film's underperformance, the Spy Universe sequel 'War 2'. Introduced as a \"superstar\" at an event, the actor humorously countered by mentioning that his movie had \"bombed at the box office,\" while appreciating the affection shown by the audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-backs-rajamouli-freedom-of-religion-atheism-controversy-india-2823771-2025-11-21",
      "headline": "Ram Gopal Varma backs Rajamouli amid backlash: Being atheist in India not a crime Filmmaker Ram Gopal Varma defends SS Rajamouli's right to be an atheist amid backlash. The debate raises questions about freedom of belief and artistic expression in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mastiii-4-review-aftab-shivdasani-vivek-oberoi-riteish-deshmukh-tired-franchise-milap-zaveri-2823748-2025-11-21",
      "headline": "Mastiii 4 review: A tired franchise running on loud, lazy and dull jokesRelease Date:Fri Nov 21, 2025 Loud, lewd and painfully lazy, 'Mastiii 4' proves that nostalgia alone can't save a franchise running on fumes. What was once cheeky fun now feels like a forced joke stretched far past its expiry date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dining-with-the-kapoors-review-netflix-bollywood-kapoor-family-food-documentary-2823563-2025-11-21",
      "headline": "Dining With the Kapoors review: A warm, nostalgic look at Bollywood's first familyRelease Date:Fri Nov 21, 2025 Dining With the Kapoors review: 'Dining With the Kapoor' is a nostalgic documentary celebrating Raj Kapoor's centenary. It offers an intimate look at Bollywood's first family, blending food, laughter, and legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrbeast-beast-games-season-2-to-drop-in-january-check-out-the-release-date-2823677-2025-11-21",
      "headline": "MrBeast's Beast Games Season 2 to drop in January. Check out the release date MrBeast's record-breaking 'Beast Games Season 2' debuts January 7, 2026, on Prime Video. The show pits 200 \"Strong vs. Smart\" contestants against each other for a massive $5 million prize, following a debut season watched by 50 million viewers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-deepikas-happy-videos-from-ambanis-shiv-temple-ceremony-go-viral-watch-2823720-2025-11-21",
      "headline": "Ranveer-Deepika's happy videos from Ambanis' Shiv temple ceremony go viral. Watch Mukesh and Nita Ambani, along with their family, performed religious rituals at the new Shiv Mandir in Gir, Saurashtra, with notable Bollywood and cricket personalities in attendance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayesha-khan-shuts-down-troll-calling-her-cheap-woman-with-a-sassy-reply-2823728-2025-11-21",
      "headline": "Ayesha Khan shuts down troll calling her cheap woman with a sassy reply Ayesha Khan responded boldly yet gracefully to a troll who labelled her a \"cheap woman\" during the promotions of 'Kis Kisko Pyaar Karoon 2'. The actor shut down the comment with humour while continuing her promotional run for the December 2025 release."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-hal-tejas-crashes-at-dubai-air-show-during-demonstration-flight-2823818-2025-11-21",
      "headline": "Indian Air Force Tejas jet crashes at Dubai Airshow, pilot diesAn Indian Air Force HAL Tejas combat aircraft crashed during a demonstration at the Dubai Airshow, triggering emergency response and concern among spectators. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejas-indian-fighter-jet-crash-live-updates-dubai-air-show-hindustan-aeronautics-limited-2823883-2025-11-21",
      "headline": "Live: Rahul Gandhi condoles death of Air Force pilot in Tejas crashTejas Fighter Jet Crash Live Updates: An Indian Air Force Tejas fighter jet crashed during a flying display at the Dubai Airshow 2025 on Friday, killing the pilot and sending plumes of smoke over Al Maktoum International Airport. The IAF confirmed the fatality and ordered a court of inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-gives-home-ministry-to-bjps-samrat-choudhary-portfolios-for-18-bihar-ministers-announced-2823888-2025-11-21",
      "headline": "Nitish Kumar gives up Home after 2 decades, hands it to deputy Samrat ChoudharyThe Home Department, which was with Nitish Kumar until now, has been given to Samrat Choudhary, who continues as Bihar's Deputy Chief Minister. Nitish passing on the key portfolio after two decades to his deputy signals a shift in which JD(U)'s ally, the BJP, appears to be moving toward the driving seat in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bihar-election-results-prashant-kishor-jan-suraaj-party-challenges-way-ahead-2823775-2025-11-21",
      "headline": "Prashant Kishor: From hero to zero or not?The political fortunes of Prashant Kishor have been the subject of much media speculation for months. The Bihar voter has delivered a resounding verdict: the Jan Suraaj Party got zero seats. Has Prashant Kishor proven to be a non-starter in the hurly-burly of electoral politics, or is it premature to write him off? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sahitya-aaj-tak-2025-kalli-purie-life-fragile-importance-of-literature-2823743-2025-11-21",
      "headline": "Life is fragile, literature the medium that makes bonds strong: Kalli PurieInaugurating the 8th edition of Sahitya Aaj Tak, India Today Group's Vice Chairperson Kalli Purie spoke on the importance of literature while reflecting on the unpredictability of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejas-jet-indian-air-force-crash-dubai-airshow-final-moments-barrel-roll-video-2823882-2025-11-21",
      "headline": "Why IAF's Tejas fighter jet crashed in Dubai during air showTejas Jet Crash: Experts said the IAF pilot appeared to be executing a manoeuvre known as a barrel roll when it crashed during the Dubai Airshow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-nitish-kumar-ministry-deepak-prakash-son-rlm-upendra-kushwaha-techie-surprise-jeans-shirt-casual-oath-2823717-2025-11-21",
      "headline": "In his jeans? Mother an MLA but unelected techie, 36, gets to be Bihar ministerA techie by training, Deepak Prakash stunned many as he took oath as a minister in the 10th Nitish Kumar government. Deepak, who didn't contest the Bihar assembly election, took oath and met PM Modi in a casual shirt and a pair of jeans. His debut was the result of a last-minute move of his father, RLM chief Upendra Kushwaha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-roses-review-benedict-olivia-are-a-riot-in-fiercely-funny-film-that-cuts-deep-2823931-2025-11-21",
      "headline": "The Roses review: Benedict-Olivia are a riot in fiercely funny film that cuts deepRelease Date:Fri Nov 21, 2025Benedict Cumberbatch and Olivia Colman shine in 'The Roses', a darkly comic, smartly observed film about modern relationships, ambition, and the messy fallout of love gone sideways. Your absolute weekend watch!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-times-jammu-raid-jk-ak47-cartridges-grenade-press-freedom-grievance-economy-debate-anuradha-bhasin-zeba-zoariah-2823914-2025-11-21",
      "headline": "Grievance economy in J&K? Raid on Kashmir Times sparks fierce debateJammu and Kashmir Police's State Investigation Agency (SIA) reportedly recovered AK-47 cartridges, pistol rounds, and hand-grenade pins during a raid at the Jammu office of media outlet Kashmir Times. The episode has exploded into a fierce debate over press freedom, information warfare, and what is now being called Kashmir's \"grievance economy\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-now-talking-like-mahatma-gandhi-when-it-comes-to-money-and-poverty-like-for-real-2823860-2025-11-21",
      "headline": "Elon Musk now talking like Mahatma Gandhi when it comes to money and povertyWhat is common between Mahatma Gandhi and Elon Musk? Apparently, their views on money and wealth. Well, who would have thought?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-issues-show-cause-notice-to-jaipur-school-after-class-4-students-suicide-2823750-2025-11-21",
      "headline": "A Class 4 child died by suicide. CBSE now lists 18 months of ignored warningsCBSE has issued a show cause notice to Neerja Modi School in Jaipur after a Class 4 student died by suicide following alleged bullying and major safety lapses. India Today has accessed the notice, which details 18 months of ignored bullying complaints and how the child's five repeated calls for help went unanswered in the final hour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-proposal-palash-mucchal-video-dy-patil-cricket-stadium-2823695-2025-11-21",
      "headline": "Watch: Palash Muchhal's surprise proposal to Smriti Mandhana at World Cup venueSmriti Mandhana received the surprise of her life at the DY Patil Stadium, where fiance Palash Muchhal proposed in the middle of the pitch. The Indian cricketer was part of the Women's World Cup team, which won the final at the same venue earlier in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/john-kiriakou-cia-pakistan-pti-party-imran-khan-letter-apology-toilet-paper-reply-operation-sindoor-india-superior-war-2823622-2025-11-21",
      "headline": "Told Pakistanis will use letter to wipe my a**: Ex-CIA analyst on India war winFormer CIA officer John Kiriakou has revealed that the President of former PM Imran Khan's PTI tried to strong-arm him into apologising for saying that India would decisively win a conventional war against Pakistan. Kiriakou said he replied by telling the PTI President that he'd use the letter demanding an apology as a toilet paper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-infiltrators-sir-drive-mamata-banerjee-reaction-2823979-2025-11-21",
      "headline": "Amit Shah vows to 'throw out infiltrators' after Mamata Banerjee urges SIR haltUnion Home Minister Amit Shah vowed to \"throw out every infiltrator\" while defending the Special Intensive Revision (SIR) of electoral rolls. His remarks came a day after Bengal CM Mamata Banerjee urged the Election Commission to halt the exercise, calling it chaotic and dangerous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mastiii-4-review-aftab-shivdasani-vivek-oberoi-riteish-deshmukh-tired-franchise-milap-zaveri-2823748-2025-11-21",
      "headline": "Mastiii 4 review: A tired franchise running on loud, lazy and dull jokesRelease Date:Fri Nov 21, 2025Loud, lewd and painfully lazy, 'Mastiii 4' proves that nostalgia alone can't save a franchise running on fumes. What was once cheeky fun now feels like a forced joke stretched far past its expiry date."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/man-wanted-for-murder-in-india-arrested-in-us-after-canada-denies-him-entry-crime-cbp-interpol-notice-2823924-2025-11-21",
      "headline": "Man wanted for murder in India arrested in US as Canada blocks entryA 22-year-old fugitive, wanted for murder in India, was arrested by US border officials after Canada denied him entry. Vishat Kumar had been living in the US illegally under a false identity since 2024. He was detained at the Peace Bridge crossing and is now in ICE custody awaiting removal proceedings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-hal-tejas-india-fighter-jet-that-crashed-during-dubai-air-show-2823836-2025-11-21",
      "headline": "What is HAL Tejas, India's fighter jet that crashed during Dubai air show?The Tejas is India's first home-grown fighter jet albeit with a foreign engine. The Indian Air Force currently operates the Mk1 variety of the Tejas fighter jet and is waiting on deliveries of the Mk1A variant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-shamli-kandhla-doctor-suspended-kandhla-hospital-obscene-dance-video-2823729-2025-11-21",
      "headline": "Video: UP doctor's dance with fiancee at hospital room viral, removed from dutyA doctor at a government hospital in UP was removed from emergency duty and his accommodation vacated after a viral video showed him dancing with his fiancee in a hospital room. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/maharashtrian-woman-cooks-maggi-train-ac-coach-electric-kettle-viral-video-sparks-safety-concerns-2823783-2025-11-21",
      "headline": "Woman cooks Maggi in train using electric kettle, video sparks safety concernsThe viral video shows the woman cooking Maggi in the electric kettle plugged into the coach's power socket that is specifically used as a charging point provided for passengers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-indias-tejas-fighter-jet-crashes-during-dubai-air-show-2823828-2025-11-21",
      "headline": "Video: Tejas fighter jet crashes at Dubai Airshow, engulfed in flamesAn Indian Air Force Tejas fighter jet crashed in the UAE on Friday during its flying display at the Dubai Airshow 2025, resulting in the death of the pilot, the IAF confirmed on X. The aircraft went down around 2:10 pm local time at Al Maktoum International Airport. Video footage showed the jet plunging rapidly before erupting into a fireball, with no sign of the pilot ejecting prior to impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/student-suicide-rewa-alleged-teacher-mistreatment-investigation-2823712-2025-11-21",
      "headline": "Pressed pen between fingers: Class 11 student dies, blames teacher in suicide noteA 17-year-old student, studying in Class 11, allegedly died by suicide in Madhya Pradesh's Rewa. She left a handwritten note, accusing her teacher of torturing her under the pretext of giving punishment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-bike-ride-with-daughter-seated-facing-him-goes-viral-video-triggers-backlash-2823905-2025-11-21",
      "headline": "Man's bike ride with daughter seated facing him goes viral, video triggers backlashThe viral video shows the girl talking to her father throughout the ride. While the man is seen wearing a helmet, the child is not. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/12a-railway-colony-review-weak-writing-turns-a-thriller-into-a-twist-dump-2823908-2025-11-21",
      "headline": "12A Railway Colony review: Weak writing turns thriller into a twist dumpRelease Date:Fri Nov 21, 2025 '12A Railway Colony' starts with a promising setup, but the thriller quickly derails as weak writing, shallow logic and a rush of unearned twists take over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/prithviraj-vilayath-budha-sandalwood-smuggling-kerala-mass-action-thriller-2823912-2025-11-21",
      "headline": "Vilayath Budha review: Prithviraj's action thriller is flawed but entertainingRelease Date:Fri Nov 21, 2025Vilayath Budha film review: This Prithviraj Sukumaran starrer Malayalam film has been directed by debutant Jayan Nambiar and is an entertaining action thriller that has some plot holes, but Prithvi's swag covers it up."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-predicted-11-sai-sudharsan-return-dhruv-jurel-no4-rishabh-pant-captaincy-2823978-2025-11-21",
      "headline": "IND vs SA, 2nd Test Predicted 11: Who replaces Gill, Sundar to continue at No.3? India head into the 2nd Test needing a win to stay alive in the series. With Shubman Gill ruled out, major changes are expected in the batting order, including an end to the Washington Sundar No. 3 experiment. South Africa may consider bringing back Lungi Ngidi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-1st-test-perth-19-wickets-pitch-outrage-criticism-ashwin-karthik-2823953-2025-11-21",
      "headline": "Where's the outrage? Silence over Perth pitch as 19 wickets fall on Day 1 Ashes 2025-26: Mitchell Starc and England pacers dominated on a pace-friendly Perth pitch as 19 wickets fell on day one of the Ashes. Former Indian cricketers highlighted contrasting narratives around pitch criticism, sparking debate on fairness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-full-list-players-mega-auction-base-price-2823961-2025-11-21",
      "headline": "WPL 2026: Full list of players to take part in mega auction The WPL 2026 auction features 277 players competing for 73 slots, with 194 Indians and 83 overseas cricketers. The auction in New Delhi, will see marquee players like Deepti Sharma, Sophie Devine, and Meg Lanning lead a competitive bidding for teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-ajinkya-rahane-on-washington-sundar-sai-sudharsan-guwahati-test-2823889-2025-11-21",
      "headline": "Sundar or Sai deserve long rope at no 3, players should be given security: Rahane Ajinkya Rahane has called on the Indian team management to end the frequent changes at the pivotal No.3 position, suggesting that either Sai Sudharsan or Washington Sundar should be backed with a consistent run and security to settle the batting order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-haldi-dance-india-women-cricketers-wedding-video-2823873-2025-11-21",
      "headline": "Watch: Smriti Mandhana dances with World Cup-winning mates in Haldi ceremony Smriti Mandhana's pre-wedding celebrations lit up with a vibrant, all-yellow dance performance featuring several India teammates. On Thursday, Mandhana confirmed her engagement to music composer Palash Muchhal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-guwahati-barsapara-pitch-preview-2823827-2025-11-21",
      "headline": "Better than Kolkata? How will Guwahati pitch play for the 2nd Test India and South Africa meet for the first Test in Guwahati at Barsapara Stadium. The nature of the pitch and early sunset bring fresh challenges and intrigue to the series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sports-ministry-probe-junior-womens-hockey-coach-allegations-2823824-2025-11-21",
      "headline": "Inquiry ordered into alleged misconduct by junior women's hockey team coach: Report The Sports Ministry has reportedly launched an inquiry into allegations of sexual misconduct involving a coach linked to the Indian junior women's hockey team. The issue is believed to have emerged after the team's foreign tours earlier this year, though no formal complaint has been filed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-five-wicket-haul-leads-england-to-ashes-captain-perth-2823807-2025-11-21",
      "headline": "Ben Stokes rocks Australia, 1st England captain in 43 years with Ashes 5-wicket haul Ashes, 1st Test: Ben Stokes' brilliant five-wicket haul put England in command on Day 1 of the opener in Perth, making him the first England captain in 43 years to achieve the feat. His fiery spell left Australia reeling at 123/9, still 49 runs behind.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-mitchell-starc-ben-stokes-dominate-ashes-day-1-perth-2823796-2025-11-21",
      "headline": "Ashes: Stokes, Starc run riot in Perth as 19 wickets tumble on dramatic Day 1 Mitchell Starc and Ben Stokes put on a remarkable bowling display on Day 1 of the Ashes Test at Perth. Their performances set up a thrilling contest with 19 wickets falling on the opening day — the most on Day 1 of an Ashes Test in the past 100 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/earthquake-halts-dhaka-test-mushfiqur-century-ireland-resilient-2823746-2025-11-21",
      "headline": "Earthquake halts Dhaka Test in Bangladesh, reporters run out of press box Play was briefly halted on day three of the second Test in Mirpur after an earthquake rattled Dhaka on Friday, shaking the commentary box and prompting Ireland's players to rush out of the dressing room and gather near the boundary rope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sports-ministry-probe-junior-womens-hockey-coach-allegations-2823824-2025-11-21",
      "headline": "Inquiry ordered into alleged misconduct by junior women's hockey team coach: Report The Sports Ministry has reportedly launched an inquiry into allegations of sexual misconduct involving a coach linked to the Indian junior women's hockey team. The issue is believed to have emerged after the team's foreign tours earlier this year, though no formal complaint has been filed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-five-wicket-haul-leads-england-to-ashes-captain-perth-2823807-2025-11-21",
      "headline": "Ben Stokes rocks Australia, 1st England captain in 43 years with Ashes 5-wicket haul Ashes, 1st Test: Ben Stokes' brilliant five-wicket haul put England in command on Day 1 of the opener in Perth, making him the first England captain in 43 years to achieve the feat. His fiery spell left Australia reeling at 123/9, still 49 runs behind.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-mitchell-starc-ben-stokes-dominate-ashes-day-1-perth-2823796-2025-11-21",
      "headline": "Ashes: Stokes, Starc run riot in Perth as 19 wickets tumble on dramatic Day 1 Mitchell Starc and Ben Stokes put on a remarkable bowling display on Day 1 of the Ashes Test at Perth. Their performances set up a thrilling contest with 19 wickets falling on the opening day — the most on Day 1 of an Ashes Test in the past 100 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/earthquake-halts-dhaka-test-mushfiqur-century-ireland-resilient-2823746-2025-11-21",
      "headline": "Earthquake halts Dhaka Test in Bangladesh, reporters run out of press box Play was briefly halted on day three of the second Test in Mirpur after an earthquake rattled Dhaka on Friday, shaking the commentary box and prompting Ireland's players to rush out of the dressing room and gather near the boundary rope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-kagiso-rabada-ruled-out-temba-bavuma-confirms-2823734-2025-11-21",
      "headline": "IND vs SA: Kagiso Rabada ruled out of 2nd Test, Temba Bavuma confirmsSouth Africa's captain, Temba Bavuma, has confirmed that their lead pacer, Kagiso Rabada, has been ruled out of the 2nd Test against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-shifts-under-23-knockout-cricket-matches-delhi-mumbai-pollution-2823722-2025-11-21",
      "headline": "Pollution woes: BCCI shifts knockout stages of key tournament from Delhi to MumbaiBCCI has relocated the men's under-23 knockout cricket matches from Delhi to Mumbai due to severe air pollution. This move aims to safeguard players' health and ensure smooth conduct of matches amid worsening smog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-auction-player-list-november-27-marquee-set-announced-2823719-2025-11-21",
      "headline": "WPL 2026 player auction list released: Deepti Sharma, Meg Lanning in marquee setA record 277 players have registered for the WPL 2026 Auction, more than doubling last year's numbers. With 73 slots up for grabs, franchises will look to rebuild as marquee stars including Deepti Sharma, Sophie Ecclestone, Alyssa Healy and Meg Lanning headline the November 27 auction in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-press-conference-captain-india-south-africa-guwahati-test-2823715-2025-11-21",
      "headline": "Rishabh Pant ignores critics, ready to captain India in Guwahati TestIndia vs South Africa: Rishabh Pant, who took charge in Kolkata after Shubman Gill left the game, said he was honoured to lead India in the second Test against South Africa in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-proposal-palash-mucchal-video-dy-patil-cricket-stadium-2823695-2025-11-21",
      "headline": "Watch: Palash Muchhal's surprise proposal to Smriti Mandhana at World Cup venueSmriti Mandhana received the surprise of her life at the DY Patil Stadium, where fiance Palash Muchhal proposed in the middle of the pitch. The Indian cricketer was part of the Women's World Cup team, which won the final at the same venue earlier in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-harry-brook-edge-walks-after-steve-smith-drs-review-perth-test-2823656-2025-11-21",
      "headline": "Watch: Harry Brook tries to get away with edge, walks after Smith's DRS reviewEngland vice-captain Harry Brook tried to get away from the edge but was forced to walk off after Australia's review for a caught-behind decision on the opening day of the Perth Test in the Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-mitchell-starc-seven-wickets-perth-test-record-2823642-2025-11-21",
      "headline": "Mitchell Starc destroys England with 7 wickets after hitting special 100Mitchell Starc starred with a seven-wicket haul to give Australia a strong start in the Ashes series. England were bowled out for 172 after lasting just 32.5 overs in their first innings in Perth on Friday, November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-secures-australian-open-super-500-semifinal-berth-2823628-2025-11-21",
      "headline": "Lakshya Sen overcomes compatriot Ayush Shetty to enter semisLakshya Sen defeated compatriot Ayush Shetty in straight games to advance to the semifinals of the Australian Open Super 500. The seventh seed prevailed 23-21, 21-11 in the quarterfinal and will next face Chou Tien Chen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-proposal-palash-mucchal-video-dy-patil-cricket-stadium-2823695-2025-11-21",
      "headline": "Watch: Palash Muchhal's surprise proposal to Smriti Mandhana at World Cup venueSmriti Mandhana received the surprise of her life at the DY Patil Stadium, where fiance Palash Muchhal proposed in the middle of the pitch. The Indian cricketer was part of the Women's World Cup team, which won the final at the same venue earlier in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-harry-brook-edge-walks-after-steve-smith-drs-review-perth-test-2823656-2025-11-21",
      "headline": "Watch: Harry Brook tries to get away with edge, walks after Smith's DRS reviewEngland vice-captain Harry Brook tried to get away from the edge but was forced to walk off after Australia's review for a caught-behind decision on the opening day of the Perth Test in the Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-mitchell-starc-seven-wickets-perth-test-record-2823642-2025-11-21",
      "headline": "Mitchell Starc destroys England with 7 wickets after hitting special 100Mitchell Starc starred with a seven-wicket haul to give Australia a strong start in the Ashes series. England were bowled out for 172 after lasting just 32.5 overs in their first innings in Perth on Friday, November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-secures-australian-open-super-500-semifinal-berth-2823628-2025-11-21",
      "headline": "Lakshya Sen overcomes compatriot Ayush Shetty to enter semisLakshya Sen defeated compatriot Ayush Shetty in straight games to advance to the semifinals of the Australian Open Super 500. The seventh seed prevailed 23-21, 21-11 in the quarterfinal and will next face Chou Tien Chen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-mitchell-starc-first-over-wicket-perth-england-crawley-james-anderson-record-2823631-2025-11-21",
      "headline": "The Ashes: Mitchell Starc's first-over strike edges him closer to Anderson's recordMitchell Starc produced a blistering first-over spell to remove Zak Crawley and set the tone for Australia in the Ashes opener at Perth. With the wicket, Starc edges closer to James Anderson's record for the most first-over wickets in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-comeback-delayed-bcci-medical-review-2823627-2025-11-21",
      "headline": "Shreyas Iyer to be out of action for 2 more months, cautious rehab plan recommendedShreyas Iyer faces a lengthier spell on the sidelines as fresh medical assessments have advised him to avoid high-intensity training and follow a controlled rehabilitation roadmap. After suffering a spleen laceration during the Sydney ODI, Iyer is progressing well but will require another scan in two months before beginning formal rehab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kolkata-test-ajinkya-rahane-pitch-spin-gautam-gambhir-2823606-2025-11-21",
      "headline": "Don't blame batters: Want spinning pitches? Then train accordingly, says RahaneIndia vs South Africa: Senior batter Ajinkya Rahane contradicted Gautam Gambhir's take on India's loss to South Africa in Kolkata, saying it is unfair to blame the batters for their inability to play on spin-friendly pitches. Rahane added that visiting teams have been preparing better for Tests in India than the home side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-ind-vs-sa-guwahati-test-mumbai-specialist-doctor-neck-injury-2823597-2025-11-21",
      "headline": "Gill ruled out of 2nd Test, to seek specialist's opinion on injury in MumbaiIndia captain Shubman Gill has been ruled out of the second Test against South Africa in Guwahati and left for Mumbai on Friday morning to consult a specialist for further assessment and injury management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sania-mirza-advises-richa-ghosh-ignore-social-media-criticism-world-cup-india-2823570-2025-11-21",
      "headline": "Sania Mirza's advice to Richa Ghosh: Social media can't make or break your daySix-time Grand Slam champion Sania Mirza offered a powerful piece of advice to young Indian cricketer Richa Ghosh, reminding her that online chatter must never define her self-worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-100th-ashes-wicket-joe-root-fails-duck-perth-test-2823550-2025-11-21",
      "headline": "Ashes: Joe Root's Australian nightmare continues, falls for a duck in PerthJoe Root's troubles in Australia resurfaced in the opening session of the Ashes Test in Perth, where the England batter was dismissed for a duck by Mitchell Starc inside the first hour of play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-dream-india-gautam-gambhir-threat-2823530-2025-11-21",
      "headline": "Is the World Test Championship final a distant dream for India in the Gambhir era?Reaching the final of every tournament has long been India's benchmark. But just a few months into Gautam Gambhir's tenure, the World Test Championship dream seems to be drifting further out of reach."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}