{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments continue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-friday-2025-stock-market-holiday-sensex-nifty-closed-no-trading-today-april-18-nse-bse-2710808-2025-04-18",
      "headline": "Good Friday 2025: Are Sensex and Nifty closed for trading today?This week has been a short one for stock market participants. The markets opened only for three days, from April 15 to April 17. They were shut on Monday, April 14, in observance of Dr. Baba Saheb Ambedkar Jayanti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opting-for-new-tax-regime-check-out-these-5-benefits-2710601-2025-04-17",
      "headline": "Opting for new tax regime? Check out these 5 benefitsThe revisions introduced under the new tax regime aim to make the new regime easier, cut down on paperwork, and minimise the confusion many individuals experience in filing their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-net-profit-revenue-final-dividend-rs-22-all-key-details-2710503-2025-04-17",
      "headline": "Infosys Q4 results: Profit drops 12%, final dividend set at Rs 22The IT major clocked revenue of Rs 40,925 crore for the March quarter, up 8% from Rs 37,923 crore a year ago. In constant currency terms, revenue grew 4.8% YoY but declined 3.5% sequentially."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-missing-disappeared-2025-no-public-listing-last-2-months-stock-market-investor-sentiment-2710498-2025-04-17",
      "headline": "No public listing in 2 months: Where have IPOs disappeared?Just nine companies have listed on the mainboard till April this year, compared to 25 in the same period last year, and most didn't even leave a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunscreen-faceoff-honasa-vs-hul-in-court-over-ad-claims-2710432-2025-04-17",
      "headline": "Sunscreen faceoff: Honasa vs HUL in court over ad claimsThe core of the argument is SPF, the sun protection factor which measures how well a sunscreen protects against harmful UV rays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vijay-kedia-10-red-flags-spot-potential-scam-companies-gensol-fraud-blusmart-shuts-down-2710438-2025-04-17",
      "headline": "Vijay Kedia warns of 10 red flags to spot a potential scam amid Gensol fraudInvestor and market expert Vijay Kedia has warned that Gensol is not the only company with problems amid the findings by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-techie-compares-life-with-rs-25-lakh-in-india-vs-100k-dollars-in-us-2710353-2025-04-17",
      "headline": "Rs 25 lakh in India or $100K in US? Bengaluru techie weighs in on what's betterChoosing to stay in India means staying close to family, celebrating festivals, and living within a culture you know well, said the tech professional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phonepe-rolls-out-upi-circle-simplifies-payments-for-family-and-friends-2710392-2025-04-17",
      "headline": "PhonePe rolls out UPI Circle, simplifies payments for family and friendsUPI Circle is a feature by NPCI (National Payments Corporation of India) where a primary user gives permission to a secondary user to make payments from their UPI account, within set limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-tuhin-kanta-pandey-gensol-fraud-job-is-to-find-and-punish-them-2710390-2025-04-17",
      "headline": "Sebi's job is to find and punish them: Tuhin Kanta Pandey on Gensol fraudThe Securities and Exchange Board of India (Sebi) released an interim order on April 15, stating that Gensol Engineering's promoters, brothers Anmol and Puneet Singh Jaggi, had diverted company funds for personal use. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-700-points-nifty-gains-4-things-to-know-2710369-2025-04-17",
      "headline": "Surprise rally lights up Dalal Street, Sensex jumps 1,500 points. Here's whyShare market today: Despite a slight uptick in volatility, sentiment turned decisively positive as fears around global trade tensions began to fade. Broader market indices joined the rally, reflecting widespread optimism among investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-shuts-operations-sebi-expose-gensol-fraud-anmol-puneet-singh-jaggi-2710342-2025-04-17",
      "headline": "End of the road for BluSmart as Sebi exposes Gensol fraudMany users across Delhi-NCR, Bengaluru, and Mumbai reported that they could no longer book rides through the BluSmart app. The company also sent a notification to users stating that bookings were being temporarily closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-expectations-fy26-outlook-dividend-net-profit-revenue-2710323-2025-04-17",
      "headline": "Infosys Q4 results today: All eyes on FY26 outlook, dividend detailsInfosys Q4FY25 results: As the second-largest software services exporter gears up to release its earnings, investors will be watching closely for guidance on FY26 revenue growth, margins, and management's take on business sentiment in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-shares-hit-5-percent-lower-circuit-for-2nd-straight-day-2710312-2025-04-17",
      "headline": "Gensol Engineering shares hit 5% lower circuit for 2nd straight dayGensol Engineering share price: The stock plunged 5% to Rs 117.50 on the Bombay Stock Exchange (BSE), hitting yet another all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-market-value-stock-crash-148-billion-dollars-gone-trump-china-curbs-explained-2710298-2025-04-17",
      "headline": "Explained: Why Nvidia's market value dropped $148 billion overnightNvidia shares were hit hard in the overnight trading session on Wall Street, falling nearly 7% and losing $148 billion in market value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-falls-5-percent-q4-results-weak-revenue-guidance-fy26-2710277-2025-04-17",
      "headline": "Wipro shares tank 6% in early trade despite strong Q4 earnings. Buy or sell?Wipro share price: At 9:20 am, Wipro shares were trading 5.33% lower at Rs 234.30 on the Bombay Stock Exchange. The decline came after the company reported its earnings post-market hours on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-180-points-lower-nifty-below-23400-wipro-down-5-percent-2710274-2025-04-17",
      "headline": "Sensex loses over 300 points in early trade, Nifty below 23,400; Wipro down 5%The S&P BSE Sensex was down by 344.50 points to 76,700.24, while the NSE Nifty50 lost 119.70 points to 23,317.50 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rio-tinto-partners-with-indian-firm-to-explore-low-carbon-aluminium-project-2710270-2025-04-17",
      "headline": "Rio Tinto partners with Indian firm to explore low-carbon aluminium projectThe potential development could see up to 1 million tonnes per annum (mtpa) of primary aluminium smelting and 2 mtpa of alumina production, both energized by renewable wind and solar power, supported by pumped hydro storage, the global miner said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-today-april-17-sensex-nifty-to-open-lower-why-it-stocks-q4-results-2710261-2025-04-17",
      "headline": "Stock market opening today: Sensex, Nifty likely to open lower. Here's whyDespite the weak outlook for Thursday's session, Sensex and Nifty have seen a strong upward trend in the last few days. In the past three sessions, Nifty50 has gone up by 4.6% while Sensex has gained 4.3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-april-17-wipro-gensol-tata-steel-bel-paytm-hero-motocorp-nse-bse-trading-2710251-2025-04-17",
      "headline": "Stocks to watch on April 17: Wipro, Gensol, Tata Steel, BEL, Paytm, Hero MotoCorpSeveral companies will announce their results for Q4 FY25 on Thursday. These include Infosys, HDFC Life Insurance Company, Jio Financial Services, HDFC Asset Management Company, Tata Elxsi, National Standard (India), and E2E Networks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-get-land-99-paise-andhra-pradesh-visakhapatnam-nara-lokesh-it-hub-growth-promotion-2710238-2025-04-17",
      "headline": "21 acres for just 99 paise: Big land allotment to TCS as Andhra bets big on techThe cabinet of Andhra Pradesh cleared the proposal on Tuesday, stating that the project is expected to bring in an investment of around Rs 1,370 crore and create nearly 12,000 jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-or-new-tax-regime-here-how-to-pick-the-right-one-before-filing-itr-2710023-2025-04-16",
      "headline": "Old or New Tax Regime: Here's how to pick the right one before filing ITRUnder the old tax regime, taxpayers can claim various deductions and exemptions, while the new tax regime does not offer much deductions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-how-is-tax-refund-calculated-and-when-will-you-get-it-2709945-2025-04-16",
      "headline": "ITR filing: How is tax refund calculated, and when will you get it?When you file your return, you declare your income, claim deductions, and report taxes already paid. The tax system compares your actual tax due with what you've already paid. If you've paid more, the extra amount is returned to you as a refund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q4-results-net-profit-rises-26-percent-to-rs-3570-crore-revenue-beats-estimates-2709903-2025-04-16",
      "headline": "Wipro Q4 results: Net profit rises 26% to Rs 3,570 croreRevenue from operations saw a modest 1% year-on-year increase, reaching Rs 22,504 crore, compared to Rs 22,208 crore in Q4FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-rebounds-to-close-300-points-higher-nifty-above-23400-banking-stocks-gain-2709897-2025-04-16",
      "headline": "Sensex closes 300 points higher, Nifty above 23,400; banking stocks gainThe S&P BSE Sensex added 309.40 points to close at 77,044.29, while the NSE Nifty50 gained 108.65 points to end at 23,437.20. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sean-diddy-combs-sex-trafficking-trial-to-begin-may-5-judge-denies-delay-glbs-2711289-2025-04-19",
      "headline": "Sean 'Diddy' Combs' trial to begin May 5 despite push for postponementA judge denied Sean \"Diddy\" Combs' request to delay his sex trafficking trial, set for May 5. He faces serious charges spanning two decades, which he denies as consensual encounters.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-issues-apology-after-controversial-remark-on-brahmins-amid-phule-row-2711264-2025-04-18",
      "headline": "Take my apology but let my family be: Anurag Kashyap on row over Brahmin remarkFilmmaker Anurag Kashyap has issued a public apology following a controversial remark about Brahmins in the wake of the ongoing 'Phule' controversy. Late Friday night, Kashyap shared a lengthy note on social media, revealing that his family had been receiving rape and death threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-performs-daring-helicopter-stunt-in-new-mission-impossible-clip-2711227-2025-04-18",
      "headline": "Watch: Tom Cruise performs daring helicopter stunt in new Mission Impossible clipTom Cruise takes on one of his most challenging stunts yet in 'Mission: Impossible – The Final Reckoning'. With no stunt double, Cruise navigates a helicopter through rugged terrain, showcasing his dedication to authentic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyaps-ill-urinate-on-brahmins-comment-sparks-outrage-amid-phule-row-2711226-2025-04-18",
      "headline": "Anurag Kashyap's controversial remark on Brahmins sparks outrage amid Phule rowAmidst the ongoing debates about the upcoming film 'Phule', Anurag Kashyap's provocative comment has sparked outrage. The film, depicting the Phule couple's fight against caste and gender inequality, is now delayed for further dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-enjoys-month-long-vacation-in-italy-set-to-resume-shooting-in-june-2711187-2025-04-18",
      "headline": "Prabhas enjoys month-long vacation in Italy, set to resume shooting in JunePan-India star Prabhas is on a month-long holiday in Italy to recharge after a hectic filming schedule, and will return in June to resume work on his upcoming projects including The Raja Saab and Fauji."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/makers-of-sunny-deol-jaat-controversial-church-scene-christians-demand-ban-on-film-2711188-2025-04-18",
      "headline": "Sunny Deol's 'Jaat' drops controversial scene after Christians demand ban on filmThe makers of Sunny Deol's 'Jaat' have removed a controversial scene depicting Randeep Hooda standing inside a church. This comes after the Christian community said that the scene hurt their religious sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/revisiting-hospital-playlist-why-the-show-still-manages-to-strike-a-chord-2711171-2025-04-18",
      "headline": "Revisiting Hospital Playlist: Why the show still manages to strike a chord'Hospital Playlist' debuted quietly in 2020 but quickly became a beloved series for its authentic portrayal of friendship among five doctors. Created by Shin Won-ho and Lee Woo-jung, it offered a rare glimpse into the emotional resilience of healthcare professionals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-trailer-suriya-goes-on-rampage-in-this-80s-styled-karthik-subbaraj-thriller-2711184-2025-04-18",
      "headline": "Retro trailer: Suriya goes on rampage in this 80s-styled Karthik Subbaraj thrillerThe 'Retro' trailer showcases Suriya in a gritty role, blending action and drama. Directed by Kartik Subbaraj, the film explores themes of love, loyalty, and violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/penn-badgley-on-hollywoods-unrealistic-sex-scenes-theyre-stylised-shallow-2711101-2025-04-18",
      "headline": "Penn Badgley on Hollywood's unrealistic sex scenes: They're stylised, shallowActor Penn Badgley, widely known for his role as Joe Goldberg in 'You', critiqued the media industry for its portrayal of intimacy on screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-chadha-vibes-to-wife-parineeti-chopras-viral-reel-trend-actor-reacts-2711170-2025-04-18",
      "headline": "Raghav Chadha vibes to wife Parineeti Chopra's viral reel trend, actor reactsAAP MP Raghav Chadha recently vibed on wife Parineeti Chopra's viral reel. The actor's comment on the video caught the attention of all. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/veera-dheera-sooran-part-2-ott-release-chiyaan-vikram-film-when-and-where-to-watch-2711140-2025-04-18",
      "headline": "Veera Dheera Sooran Part 2 OTT release: When and where to watch Chiyaan Vikram film'Veera Dheera Sooran: Part 2'  is set to release on Prime Video. The OTT platform announced the release of Chiyaan Vikram's tamil action thriller, which is set to begin streaming from April 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-temple-remark-angers-badrinath-priests-2711102-2025-04-18",
      "headline": "Urvashi Rautela's 'temple in my name' remark angers Badrinath priests, localsA video of actor Urvashi Rautela referring to a temple in Uttarakhand as being made in \"her\" name has gone viral. This has angered local priests, religious officials and residents of the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-you-should-watch-court-state-vs-a-nobody-priyadarshi-pulikonda-nani-2711037-2025-04-18",
      "headline": "Why Telugu courtroom drama 'Court' deserves your undivided attention'Court - State vs. A Nobody' on Netflix is a gripping Telugu film that delves deep into the harsh realities of love and societal biases. It powerfully portrays the misuse of the POCSO Act while highlighting class divides, making it a thought-provoking watch that lingers long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crushology-101-review-roh-jeong-eui-k-drama-is-no-stress-high-flirt-2711096-2025-04-18",
      "headline": "Crushology 101 review: Roh Jeong-eui's K-drama is all flirt, no stressReleased-Mon Apr 14, 2025Crushology 101 review: 'Crushology 101' brings back the classic K-drama rom-com vibe with its light-hearted plot and charming characters, making it a perfect escape from intense drama, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-hero-academia-youre-next-ott-release-when-where-to-watch-upcoming-film-2711064-2025-04-18",
      "headline": "My Hero Academia You're Next OTT release: When, where to watch upcoming film'My Hero Academia: You're Next' hits Netflix India on April 20, 2025. The anime film follows Izuku Midoriya post-UA Traitor arc as he faces a new villain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-enjoy-evening-shikhar-dhawan-and-his-rumoured-girlfriend-2711078-2025-04-18",
      "headline": "Aamir Khan-Gauri enjoy evening with Shikhar Dhawan and his rumoured girlfriendAamir Khan and Gauri Sgirlfind pratt enjoyed an evening with cricketer Shikhar Dhawan and his rumoured girlfriend Sophie Shine. A picture from their outing has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/salman-khan-we-fell-in-love-with-chal-mere-bhai-re-release-2710928-2025-04-18",
      "headline": "The Salman Khan we fell in love with: A rewatch, a reminder, and a quiet longingSalman Khan's re-release of 'Chal Mere Bhai' rekindles nostalgia, showcasing his effortless charm and iconic presence that once captivated audiences. As fans reminisce about the actor's authentic performances, they yearn for a revival of the Salman who connected deeply with viewers, beyond the spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-gosling-led-star-wars-starfighter-set-for-memorial-day-2027-release-glbs-2711068-2025-04-18",
      "headline": "Ryan Gosling-led Star Wars Starfighter set for Memorial Day 2027 releaseRyan Gosling stars in Star Wars: Starfighter, a new standalone film directed by Shawn Levy, set to hit theatres on May 28, 2027. Unveiled at Star Wars Celebration 2025, the movie promises fresh characters and epic adventure beyond the Skywalker saga.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-review-akshay-kumar-leads-indias-humble-roar-for-apology-in-important-film-2711041-2025-04-18",
      "headline": "Kesari 2 review: Akshay Kumar leads India's humble roar for apology in important filmReleased-Fri Apr 18, 2025'Kesari Chapter 2' tells you that you've mourned enough. Set in the aftermath of the Jallianwala Bagh massacre, the Akshay Kumar-led film stirs your emotions by demanding an apology from the British Empire that is due for over 106 years. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/harpreet-singh-happy-passia-fbi-arrest-suspected-links-pakistan-isi-khalistani-terror-group-babbar-khalsa-international-2711148-2025-04-18",
      "headline": "FBI flags terrorist Happy Passia's links to Pak spy agency, Khalistani groupThe Punjab Police called Happy Passia's arrest by the FBI a \"major milestone in the sustained crackdown on ISI-backed terror networks\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/half-of-us-student-visa-cancellations-involve-indians-says-legal-association-2711231-2025-04-18",
      "headline": "Half of US student visa cancellations involve Indians, says legal associationAn increasing number of Indian students in the US have their visas revoked abruptly, causing alarm among family members and education stakeholders. Indian students, as reported by American Immigration Lawyers Association (AILA) policy brief, make up almost half of the total reported student visa revocations.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-fixes-maryland-deportee-kilmar-garcia-headline-us-senator-chris-van-hollen-el-salvador-visit-2711261-2025-04-18",
      "headline": "Not wrongly deported but illegal alien: White House 'fixes' Kilmar Garcia headlineThe White House slammed Democrat Senator Chris Van Hollen for meeting alleged MS-13 member Kilmar Abrego Garcia in El Salvador. The White House also rebranded a New York Times headline with fiery edits of its own."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/seelampur-murder-delhi-teenager-lady-don-zikra-under-probe-2711222-2025-04-18",
      "headline": "Seelampur murder: Who is 'Lady Don' Zikra, prime suspect in 17-year-old's killing?Zikra, the prime suspect in the murder case of a 17-year-old in Delhi's Seelampur, previously worked as a bouncer for jailed gangster Hashim Baba's wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-issues-apology-after-controversial-remark-on-brahmins-amid-phule-row-2711264-2025-04-18",
      "headline": "Take my apology but let my family be: Anurag Kashyap on row over Brahmin remarkFilmmaker Anurag Kashyap has issued a public apology following a controversial remark about Brahmins in the wake of the ongoing 'Phule' controversy. Late Friday night, Kashyap shared a lengthy note on social media, revealing that his family had been receiving rape and death threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-tim-david-bengaluru-highlights-2711288-2025-04-19",
      "headline": "RCB's disastrous home run continues as PBKS triumph in rain-marred gameIPL 2025, RCB vs PBKS: Royal Challengers Bengaluru (RCB) lost their third man in a row at home as Punjab Kings (PBKS) won by five wickets in the rain-marred contest on Friday at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-army-probe-soldiers-manhandle-civilians-jammu-kashmir-search-operation-2711062-2025-04-18",
      "headline": "Army probes 'manhandling' of civilians by jawans, PDP claims professor assaultedThe incident allegedly happened when an Army team was conducting search operations after receiving input on the likely movement of terrorists in a vehicle in Rajouri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-fly-international-space-station-axiom-mission-may-science-minister-jitendra-singh-remark-2711232-2025-04-18",
      "headline": "More than a flight: Science Minister on Shubhanshu Shukla's journey to space in MayShubhanshu Shukla will serve as the pilot aboard the SpaceX Dragon spacecraft, becoming the first Indian to live and work at the International Space Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-fund-cuts-us-harvard-university-striking-very-idea-international-students-american-education-2711045-2025-04-18",
      "headline": "Trump is striking at the very idea of Harvard, its international studentsPresident Donald Trump is out with a sledgehammer and striking at the very core of Harvard University, an institution older than the USA. Harvard has been synonymous with American education, politics and society. The reason why Harvard is world-class is that it attracts the world's best brains. That's what Trump is seeking to pull the plug on.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-badaun-woman-elopes-with-daughter-father-in-law-2711271-2025-04-18",
      "headline": "Mother of four elopes with daughter's father-in-law in UPIn Uttar Pradesh's Badaun, a 43-year-old woman eloped with her daughter's 46-year-old father-in-law. Her husband, a truck driver, used to come home only once or twice a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-cm-mk-stalin-after-aiadmk-bjp-alliance-ahead-of-2026-state-polls-tamil-out-of-reach-for-delhi-2710983-2025-04-18",
      "headline": "Not just Amit Shah, no Shah can rule Tamil Nadu: MK Stalin challenges BJPTamil Nadu Chief Minister MK Stalin issued a bold challenge to the BJP. He asserted the state's defiance against central domination and said the Dravidian model will emerge victorious again in 2026.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kapil-sibal-president-personal-right-jagdeep-dhankhar-judiciary-2711117-2025-04-18",
      "headline": "If executive not doing its job...: Kapil Sibal on Vice President's judiciary remarkKapil Sibal launched a scathing criticism of Vice President Jagdeep Dhankhar over his remark that the judiciary cannot become a 'super parliament' and direct the President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-review-akshay-kumar-leads-indias-humble-roar-for-apology-in-important-film-2711041-2025-04-18",
      "headline": "Kesari 2 review: Akshay Kumar leads India's humble roar for apology in important filmReleased-Fri Apr 18, 2025'Kesari Chapter 2' tells you that you've mourned enough. Set in the aftermath of the Jallianwala Bagh massacre, the Akshay Kumar-led film stirs your emotions by demanding an apology from the British Empire that is due for over 106 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/makers-of-sunny-deol-jaat-controversial-church-scene-christians-demand-ban-on-film-2711188-2025-04-18",
      "headline": "Sunny Deol's 'Jaat' drops controversial scene after Christians demand ban on filmThe makers of Sunny Deol's 'Jaat' have removed a controversial scene depicting Randeep Hooda standing inside a church. This comes after the Christian community said that the scene hurt their religious sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-new-policy-speed-deportations-cannot-be-implemented-us-judge-rules-2711221-2025-04-18",
      "headline": "Blow to Trump's immigration policy as judge halts rapid deportationsA US judge has issued a preliminary injunction stopping the Trump administration from deporting migrants rapidly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-indian-students-harvard-need-not-fear-trump-crack-down-caution-protests-what-to-do-experts-2711127-2025-04-18",
      "headline": "Why Indian students at Harvard needn't fear as Trump cracks downThere are close to 800 Indian students and scholars studying at Harvard University this year. While the Trump administration is warning Harvard that it will cut its foreign students' line, experts suggest it's time to focus, and not fear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-says-raising-daughters-in-india-is-a-revolution-viral-linkedin-post-2711107-2025-04-18",
      "headline": "Raising daughters in India is a revolution: Bengaluru man's powerful post goes viralA Bengaluru man's heartfelt note on parenting his daughters has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-teen-falls-from-rooftop-impaled-iron-grille-bhubaneswar-2711186-2025-04-18",
      "headline": "Odisha teen falls from rooftop, impaled on iron grille, in critical conditionThe 13-year-old had gone to the rooftop to collect his school uniform when he lost his balance and fell, landing on a sharp iron grille. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/four-indians-repatriated-from-myanmar-myawaddy-cyber-scam-thailand-fake-job-2711097-2025-04-18",
      "headline": "India repatriates 4 more victims of cyber gang from MyanmarFour men have been rescued and repatriated back to India, from Myanmar's notorious Myawaddy region, dubbed the \"global capital of scams\". This follows the repatriation of 500 Indians last month, who were forced to work in cyber fraud syndicates after being duped by fake job offers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-elon-musk-donald-trump-collaboration-speaks-technology-innovation-2710965-2025-04-18",
      "headline": "PM speaks to Elon Musk ahead of Tesla's India entry, discusses tech, innovationPM Modi and Elon Musk discussed a wide range of topics, building upon their earlier meeting in Washington DC earlier this year. The conversation highlighted the growing synergy between India's rapidly evolving tech ecosystem and Musk's ventures in cutting-edge innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-temple-remark-angers-badrinath-priests-2711102-2025-04-18",
      "headline": "Urvashi Rautela's 'temple in my name' remark angers Badrinath priests, localsA video of actor Urvashi Rautela referring to a temple in Uttarakhand as being made in \"her\" name has gone viral. This has angered local priests, religious officials and residents of the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-revokes-foreign-international-student-visa-deportation-detention-harvard-stanford-america-universities-legal-status-indians-2711158-2025-04-18",
      "headline": "Over 1,000 international students lose visas, face deportation risk in US: ReportThe Trump administration has revoked visas or legal status of over 1000 international students in recent weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-woman-kills-two-sons-with-coconut-chopping-axe-jumps-to-death-2711067-2025-04-18",
      "headline": "Genetic eye disorder passed to sons, Hyderabad mother kills them, jumps to deathA woman, Tejaswini, killed her two young sons and then jumped to her death in Hyderabad. She also left a suicide note explaining her actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-shrivastava-appointed-revenue-secretary-2711124-2025-04-18",
      "headline": "Bureaucratic reshuffle at government departments, new Revenue Secretary appointedSenior bureaucrat Arvind Shrivastava, a 1994 batch Karnataka cadre Indian Administrative Service (IAS) officer, has been appointed as the new Revenue Secretary."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tim-david-rcb-vs-pbks-bengaluru-2711295-2025-04-19",
      "headline": "Tim David rewarded with POTM award despite RCB's defeat to PBKSIPL 2025, RCB vs PBKS: Despite Bengaluru losing by 5 wickets, Tim David was rewarded with the Player of the Match award for scoring an unbeaten 50 and taking two catches against Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-yuzvendra-chahal-shreyas-iyer-bengaluru-2711292-2025-04-19",
      "headline": "Chahal's IPL 2025 turnaround: Shreyas Iyer reveals chat with PBKS spinnerPBKS skipper Shreyas Iyer revealed the chat he had with Yuzvendra Chahal as the leg-spinner continues his comeback in the IPL 2025 season. Chahal picked up two wickets against RCB on Friday, April 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-tim-david-bengaluru-highlights-2711288-2025-04-19",
      "headline": "RCB's disastrous home run continues as PBKS triumph in rain-marred gameIPL 2025, RCB vs PBKS: Royal Challengers Bengaluru (RCB) lost their third man in a row at home as Punjab Kings (PBKS) won by five wickets in the rain-marred contest on Friday at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-memes-virat-kohli-tim-david-bengaluru-2711277-2025-04-18",
      "headline": "Vintage RCB is back: Memes galore as PBKS run through hosts in BengaluruFans on social media trolled RCB after they crumbled against PBKS at the Chinnaswamy stadium on Friday, April 18. The likes of Virat Kohli, Rajat Patidar and others failed on the night as RCB scored 95 in the 14-over game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-arshdeep-singh-virat-kohli-history-2711259-2025-04-18",
      "headline": "Arshdeep Singh gets Virat Kohli after scripting history for Punjab KingsIPL 2025, RCB vs PBKS: Arshdeep Singh took the wicket of Phil Salt to become the all-time top wicket-taker for the Punjab Kings, after which he also accounted for the wicket of Virat Kohli. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rr-vs-lsg-lance-klusener-press-conference-2711256-2025-04-18",
      "headline": "LSG have the team to win IPL 2025: Assistant coach Klusener makes bold claimLSG assistant coach Lance Klusener feels that Lucknow has the team to go all the way in IPL 2025 and win their first title. LSG have won 4 out of their 7 matches and remain in the hunt for a place in the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-glenn-maxwell-dropped-marcus-stoinis-harpreet-brar-2711230-2025-04-18",
      "headline": "RCB vs PBKS: No Bengaluru return as Maxwell dropped, Stoinis returnsThere will be no Bengaluru return for Glenn Maxwell as the Australian all-rounder was dropped for the clash between RCB and PBKS at the Chinnaswamy stadium on Friday, April 18. Maxwell has been in poor form this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mumbai-t20-league-fixing-banned-owner-2711228-2025-04-18",
      "headline": "BCCI bans former Mumbai T20 League team franchise owner for fixing attemptGurmeet Singh Bhamrah, a former co-owner of a Mumbai T20 League franchise, has been banned for making corrupt approaches to Dhawal Kulkarni and Bhavin Thakkar during the event's 2019 edition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wrestlemania-41-date-schedule-predictions-how-to-watch-john-cena-vs-cody-rhodes-match-glbs-2711225-2025-04-18",
      "headline": "WrestleMania 41: Date, schedule, predictions, how to watch John Cena vs Cody Rhodes matchWrestleMania 41 is expected to bring fans some exciting action. The event on April 19 and 20 will see a showdown between two of the biggest WWE stars, John Cena and Cody Rhodes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-playoffs-ad-debut-kendrick-lamar-luka-doncic-and-gatorade-team-up-for-lose-more-win-more-campaign-glbs-2711224-2025-04-18",
      "headline": "NBA Playoffs Ad debut: Kendrick Lamar, Luka Doncic, and Gatorade team up for \"Lose More. Win More.\" campaignThe NBA playoffs are heating up, and Gatorade has found the right moment to launch its powerful new campaign, \"Lose More. Win More.\"  The campaign features a dynamic cast of athletes and artists, including rapper Kendrick Lamar, L.A. Lakers guard Luka Dončić, and WNBA star Caitlin Clark. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/rahul-dravid-my-inability-to-walk-has-no-effect-on-my-coaching-2711216-2025-04-18",
      "headline": "Rahul Dravid: My inability to walk has no effect on my coachingRajasthan Royals head coach Rahul Dravid has joked that his inability to walk has had no bearing on his coaching this season. Dravid had accepted the mistakes made by Rajasthan and said that they needed to minimise the small mistakes that they were making in all departments of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-glenn-maxwell-dropped-marcus-stoinis-harpreet-brar-2711230-2025-04-18",
      "headline": "RCB vs PBKS: No Bengaluru return as Maxwell dropped, Stoinis returnsThere will be no Bengaluru return for Glenn Maxwell as the Australian all-rounder was dropped for the clash between RCB and PBKS at the Chinnaswamy stadium on Friday, April 18. Maxwell has been in poor form this season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mumbai-t20-league-fixing-banned-owner-2711228-2025-04-18",
      "headline": "BCCI bans former Mumbai T20 League team franchise owner for fixing attemptGurmeet Singh Bhamrah, a former co-owner of a Mumbai T20 League franchise, has been banned for making corrupt approaches to Dhawal Kulkarni and Bhavin Thakkar during the event's 2019 edition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wrestlemania-41-date-schedule-predictions-how-to-watch-john-cena-vs-cody-rhodes-match-glbs-2711225-2025-04-18",
      "headline": "WrestleMania 41: Date, schedule, predictions, how to watch John Cena vs Cody Rhodes matchWrestleMania 41 is expected to bring fans some exciting action. The event on April 19 and 20 will see a showdown between two of the biggest WWE stars, John Cena and Cody Rhodes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-playoffs-ad-debut-kendrick-lamar-luka-doncic-and-gatorade-team-up-for-lose-more-win-more-campaign-glbs-2711224-2025-04-18",
      "headline": "NBA Playoffs Ad debut: Kendrick Lamar, Luka Doncic, and Gatorade team up for \"Lose More. Win More.\" campaignThe NBA playoffs are heating up, and Gatorade has found the right moment to launch its powerful new campaign, \"Lose More. Win More.\"  The campaign features a dynamic cast of athletes and artists, including rapper Kendrick Lamar, L.A. Lakers guard Luka Dončić, and WNBA star Caitlin Clark. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/rahul-dravid-my-inability-to-walk-has-no-effect-on-my-coaching-2711216-2025-04-18",
      "headline": "Rahul Dravid: My inability to walk has no effect on my coachingRajasthan Royals head coach Rahul Dravid has joked that his inability to walk has had no bearing on his coaching this season. Dravid had accepted the mistakes made by Rajasthan and said that they needed to minimise the small mistakes that they were making in all departments of the game."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}