{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05",
      "headline": "Bloodbath on Wall Street: Dow crashes 2,200 points, S&P suffers worst 6% collapse since 2020US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-crashes-2000-points-as-trumps-tariffs-spark-global-market-panic-glbs-2704333-2025-04-05",
      "headline": "Dow crashes 2,000 points as Trump's tariffs spark global market panicGlobal markets plunged as Trump's tariffs triggered a trade war escalation with China. The Dow fell over 2,000 points, crude prices tumbled, and investors feared an impending global recession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-warns-higher-inflation-slower-growth-trump-tariffs-2704280-2025-04-04",
      "headline": "Higher inflation, slower growth: US Federal Reserve chair warns after Trump tariffsUS Federal Reserve chair Jerome Powell spoke as global markets continued a swoon that has wiped some 10 per cent off major US stock indexes since Trump announced a raft of new tariffs on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-opened-sharply-lower-after-chinas-retaliatory-tariff-measure-nasdaq-composite-2704230-2025-04-04",
      "headline": "US stocks plummet after China's retaliatory levies in response to Trump tariffsNasdaq IXIC dropped more than 20 per cent from its all-time closing high touched in December, putting it on course to confirm a bear market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-return-2025-itr-2-filing-now-made-easier-check-latest-updates-2704180-2025-04-04",
      "headline": "Income tax return 2025: ITR-2 filing now made easierITR-2 is meant for individuals whose annual income is above Rs 50 lakh or who earn from sources like rent, capital gains, or other sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-share-price-reliance-industries-stock-fall-4-percent-stock-market-crash-mukesh-ambani-net-worth-2703996-2025-04-04",
      "headline": "RIL share price falls 4% ahead of Q4 results. Should you sell?Reliance Industries stock: RIL shares opened at Rs 1,240 and fell to an intraday low of Rs 1,192.85 in the afternoon session. The stock was close to its 52-week low of Rs 1,156, which it touched on March 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-india-26-percent-clarity-while-house-new-document-trade-2703962-2025-04-04",
      "headline": "US tariffs stay at 26% as White House unveils new trade documentInitially, India's tariff rate was mentioned as 27% in the earlier version of the White House annex. However, the latest revision has adjusted it to 26%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/withdrawing-epf-know-rules-for-marriage-education-home-and-medical-needs-2703935-2025-04-04",
      "headline": "Withdrawing EPF? Know rules for marriage, education, home and medical needsIf you require money out of your EPF for the purposes of marriage or further studies, there are set regulations one needs to adhere to. You must have been an EPF member for at least seven years and must have at least Rs 1,000 in your EPF account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-says-politicians-need-reality-check-after-piyush-goyal-startup-focused-on-food-delivery-remark-2703916-2025-04-04",
      "headline": "Politicians need reality check, says Ashneer Grover on Piyush Goyal's startup remarkAshneer Grover has said that Indian politicians need a reality check after Piyush Goyal criticised startups for being too focused on food delivery apps."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-praises-brother-in-law-narne-nithin-at-mad-square-success-bash-2704324-2025-04-04",
      "headline": "Jr NTR praises brother-in-law Nithin at MAD Square success bashMAD Square has been a hit among audiences, and Jr NTR couldn't be prouder of his brother-in-law Narne Nithin's acting journey. Speaking at the success bash on Friday, he reminisced about his initial reaction when Nithin first approached him to discuss his aspirations of becoming an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-last-five-years-finally-hits-broadway-after-years-of-anticipation-glbs-2704301-2025-04-04",
      "headline": "The Last Five Years finally hits Broadway after years of anticipationNick Jonas and Adrienne Warren bring the beloved musical 'The Last Five Years' to Broadway for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elizabeth-olsen-admits-marvel-films-arent-her-cup-of-tea-not-the-art-i-consume-2704292-2025-04-04",
      "headline": "Elizabeth Olsen admits Marvel films aren't her cup of tea: Not the art I consumeActor Elizabeth Olsen opened up about her personal film preferences and how they differ from her roles in the Marvel Cinematic Universe. Despite her pride in playing Wanda Maximoff, she shared the pressure to choose projects that reflect her true taste.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/new-sex-trafficking-charges-filed-against-sean-diddy-combs-glbs-2704291-2025-04-04",
      "headline": "New sex trafficking charges filed against Sean 'Diddy' CombsSean Diddy Combs faces two additional sex trafficking charges, expanding the federal indictment against him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-trailer-ajith-kumar-adhik-ravichandran-trisha-krishnan-2704271-2025-04-04",
      "headline": "Good Bad Ugly trailer: Ajith Kumar brings mass back in Adhik Ravichandran's nextThe much-anticipated trailer of Ajith Kumar's Good Bad Ugly is finally out. Directed by Adhik Ravichandran, the film is set to hit theatres on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-unveils-avatar-fire-and-ash-trailer-at-cinemacon-glbs-2704261-2025-04-04",
      "headline": "James Cameron unveils Avatar Fire and Ash trailer at CinemaConJames Cameron unveiled his Avatar Fire and Ash movie's first trailer at CinemaCon introducing new Na'vi clans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-comedian-russell-brand-charged-with-rape-sexual-assault-2704238-2025-04-04",
      "headline": "Actor-comedian Russell Brand charged with rapeRenowned actor and comedian Russell Brand has been charged with serious allegations of rape and sexual assault and oral rape. The alleged offences took place between 1999 and 2005. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dan-da-dan-season-2-release-date-platform-watch-it-early-2704233-2025-04-04",
      "headline": "Dan Da Dan Season 2: Release date, platform and how to watch it earlyDan Da Dan fans can rejoice as the release date for the second season has been announced, along with an opportunity to watch the first three episodes before the full season airs. The episodes will be available in theatres outside Japan under the title Dan Da Dan: Evil Eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/palak-tiwari-on-criticism-of-new-gen-actors-well-get-there-but-itll-take-time-2704223-2025-04-04",
      "headline": "Palak Tiwari on criticism of new-gen actors: We'll get there, but it'll take timeActor Palak Tiwari discusses the challenges and criticisms faced by new-generation actors in Bollywood, expressing confidence that they will eventually win over audiences despite the longer time it may take compared to their predecessors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-stuns-in-plunging-gown-at-broadway-premiere-of-george-clooneys-show-glbs-2704200-2025-04-04",
      "headline": "Jennifer Lopez stuns in plunging gown at Broadway premiere of George Clooney's showJennifer Lopez dazzled at the Broadway premiere of Good Night, and Good Luck, supporting George Clooney.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-coolie-to-hit-theatres-ahead-of-independence-day-2704199-2025-04-04",
      "headline": "Rajinikanth's Coolie to hit theatres ahead of Independence DayThe release of Rajinikanth's next film, Coolie, is out. Directed by Lokesh Kanagaraj, it would hit theatres on August 14, ahead of Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mourns-manoj-kumars-loss-says-he-will-always-be-bharat-to-us-2704188-2025-04-04",
      "headline": "SRK mourns Manoj Kumar's loss, says he will always be 'Bharat to us'Veteran Bollywood actor and director Manoj Kumar died at 87, leaving a significant impact on Indian cinema. Bollywood celebrities, including Shah Rukh Khan and Salman Khan, paid heartfelt tributes to the legend known as 'Bharat Kumar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/exploring-lee-dong-wook-range-versatility-true-masterclass-acting-weekly-kfix-2703731-2025-04-04",
      "headline": "From killing to reaping souls, Lee Dong-wook is a true masterclass in actingLee Dong-wook is a versatile actor who seamlessly transforms into any role, from the mysterious Grim Reaper in Goblin to the chilling killer in Strangers from Hell and the compassionate insurance worker in Divorce Insurance. In this week's K-Fix, let us take a look at Lee Dong-wook's range as an artiste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-mother-soni-reminisces-old-holiday-memories-with-cute-throwback-pics-2704183-2025-04-04",
      "headline": "Alia Bhatt's mother Soni reminisces old holiday memories with cute throwback picsActor Alia Bhatt's mother Soni Razdan became nostalgic on Friday, sharing old travel memories with her daughter. Soni shared a bunch of adorable throwback pictures with her 'Aloo', reminiscing about the memories attached to each image.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-poetry-exclusive-interview-on-social-media-digitisation-revival-of-poetry-2704181-2025-04-04",
      "headline": "Digitising emotions: Javed Akhtar on social media's revival of poetry | ExclusiveLyricist and screenwriter Javed Akhtar, in a conversation with India Today, spoke about the revival of poetry through social media, and how digital platforms have made Urdu poetry accessible to a younger audience worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/agnyathavasi-trailer-a-kannada-murder-mystery-around-realm-of-black-magic-2704087-2025-04-04",
      "headline": "Agnyathavasi trailer: A Kannada murder-mystery around realm of black magicProduced by Hemanth Rao, of Sapta Saagaradache Ello fame, Agnyathavasi is directed by Janardhan Chikanna and is scheduled to release in theatres on April 11, 2025. The trailer of the murder mystery was released on April 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shor-to-silence-how-manoj-kumar-carried-india-in-his-cinema-2704116-2025-04-04",
      "headline": "Atlas of Bollywood: How Manoj Kumar carried India in his cinemaManoj Kumar's patriotism in cinema was something else. He didn't believe in the chest-thumping, hand-pump-uprooting or Pakistan-bashing patriotism of quintessential Bollywood. His enemy was the malice within. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravikumar-menon-dies-of-cancer-at-71-on-chennai-2704066-2025-04-04",
      "headline": "Veteran Tamil-Malayalam actor Ravikumar Menon dies of cancer at 71Veteran actor Ravikumar Menon has died at the age of 71 in Chennai. Known for his roles in Tamil and Malayalam cinema, he left behind a legacy of diverse performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-olivia-munn-slams-all-female-blue-origin-space-trip-calls-it-gluttonous-2704090-2025-04-04",
      "headline": "Actor Olivia Munn slams all-female Blue Origin space trip, calls it 'gluttonous'Actor Olivia Munn slammed the all-female Blue Origin space trip.The 44-year0old actor admitted how the upcoming trip seems 'gluttonous' when so many people 'can't even afford eggs.'"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-an-incredible-unifier-of-nations-against-us-ian-bremmer-on-tariff-move-2704316-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump an incredible unifier of nations against US: Ian Bremmer on tariff moveGeopolitical expert Ian Bremmer criticised Donald Trump's new tariff policy, calling it a self-inflicted risk that could trigger a US recession. He warned of global economic fallout, growing opposition to the US, and China's rising influence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-sri-lanka-visit-talks-on-defence-energy-trade-likely-2704262-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM arrives in Sri Lanka, talks on defence pact, trade likely during 3-day visitPrime Minister Narendra Modi arrived in Sri Lanka for a three-day visit to deepen ties in defence, energy, and trade. It's his first trip since President Dissanayake's government took office. Key agreements are expected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-jdu-nda-parliament-support-rift-leaders-quit-2704174-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Bill support triggers rift within JDU, 5th leader quits partySenior JDU leaders resigned over the NDA ally's support for the Waqf (Amendment) Bill. They said the move betrayed Muslim voters and the party's secular values."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-police-suspect-robbery-in-air-force-engineers-murder-kin-alleges-contract-hit-2704294-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Air Force engineer's death: Family claims murder not during robbery but a hit jobA man has been arrested for the killing of IAF chief engineer SN Mishra inside Prayagraj's Central Air Command. Police say it was a botched robbery; the family, however, alleged that it was a contract killing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/what-is-waqf-amendment-bill-key-provisions-controversy-history-explained-2703908-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf amendment bill owned the headlines, what's behind and beyond?After two days of hectic debates in both Houses, stretching well past midnight, the Waqf Amendment Bill passed the Parliament hurdle on Friday. In this article, we dive deep into the history of waqf, the provisions of the bill, and what the controversy is all about."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-rules-himself-out-of-tamil-nadu-bjp-chief-race-2704041-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Wish party good future': Annamalai bows out of Tamil Nadu BJP chief raceK Annamalai on Friday ruled himself out of the BJP's Tamil Nadu presidency race. This could be because the party reportedly plans a leadership change, amid reunion talks with the AIADMK and broader caste-based political strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-slams-china-imposing-additional-tariff-on-us-goods-trade-war-2704193-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China played it wrong, they panicked: Trump slams additional 34% tariff on US goodsPresident Donald Trump criticised China for imposing 34% tariffs on US goods, calling it an overreaction. China said the move was a response to US tariffs. Tensions grew with export controls and business restrictions.\r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-overly-obsessed-jibe-raghav-chadha-trade-debate-rajya-sabha-2704241-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jagdeep Dhankhar's 'overly obsessed' jibe at Raghav Chadha during trade debateWhile speaking in the Rajya Sabha, Raghav Chadha said that India should withhold regulatory approvals for Elon Musk's Starlink and use it as a \"bargaining chip\" to renegotiate tariffs imposed by Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-turkey-hagia-sophia-once-cathedral-mosque-museum-waqf-property-amendment-bill-india-what-happened-2703902-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Turkey's Hagia Sophia, once a cathedral, became Waqf propertyThe Hagia Sophia is at the centre of Turkey's Byzantine, Ottoman and secular history. How did the sixth-century cathedral become a Waqf property, get converted to a museum, and again a mosque? Tracing the history of the Hagia Sophia amid the Waqf Bill debate in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-bangladesh-muhammad-yunus-rhetoric-row-northeast-thailand-meeting-2703983-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Avoid rhetoric that vitiates environment, ensure safety of Hindus: PM to YunusPM Modi's remarks come against the backdrop of Muhammad Yunus inviting China to expand its influence in India's Northeast. The comments were strongly denounced by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-match-report-hardik-pandya-vain-lucknow-2704317-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LSG vs MI: All-round Hardik Pandya show in vain as Lucknow win thriller at homeIPL 2025, LSG vs MI: Lucknow Super Giants piled up the misery on Mumbai Indians, denying them two points on Friday. After posting 203, LSG successfully defended the total, bowling well in the death overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shor-to-silence-how-manoj-kumar-carried-india-in-his-cinema-2704116-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atlas of Bollywood: How Manoj Kumar carried India in his cinemaManoj Kumar's patriotism in cinema was something else. He didn't believe in the chest-thumping, hand-pump-uprooting or Pakistan-bashing patriotism of quintessential Bollywood. His enemy was the malice within. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dugout-tips-hardik-pandya-nicholas-pooran-wicket-2704286-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Out injured, Rohit Sharma masterminds Nicholas Pooran wicket. Watch videoIPL 2025, LSG vs MI: Rohit Sharma did not play Friday's match in Lucknow due to a knee injury. However, he played a key role in Hardik Pandya's dismissal of Nicholas Pooran during the Lucknow Super Giants' innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-poetry-exclusive-interview-on-social-media-digitisation-revival-of-poetry-2704181-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Digitising emotions: Javed Akhtar on social media's revival of poetry | ExclusiveLyricist and screenwriter Javed Akhtar, in a conversation with India Today, spoke about the revival of poetry through social media, and how digital platforms have made Urdu poetry accessible to a younger audience worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/mira-rajput-sobhita-dhulipalas-raw-milk-skincare-hack-is-viral-again-do-experts-approve-2704137-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bollywood, influencers swear by raw milk for skincare. But do experts approve?From celeb routines to Instagram trends, raw milk is the latest age-old skincare obsession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-land-5-per-cent-india-area-more-than-metro-cities-combined-delhi-mumbai-bengaluru-2704143-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf land 5% of India's area, more than big metro cities combinedThe Waqf Amendment Bill, passed by Parliament, aims to make the conversion and management of Waqf properties transparent and efficient. Waqf boards in India collectively hold 39 lakh acres, which is almost 5% of the country's land area and more than the combined land held by the armed forces and the Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-maharashtras-state-fish-silver-pomfret-is-vanishing-from-meals-2703448-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Maharashtra's 'state' fish silver pomfret is vanishing from mealsOver-fishing, pollution and climate change have taken a heavy toll, pulling the annual catch down to 40 tonnes in 2024 from 1,200 tonnes four decades ago"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/four-fram2-astronauts-splashdown-from-space-after-first-pole-to-pole-mission-2704296-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Four astronauts splashdown from space after 1st pole-to-pole missionThe Fram2 crew became the first humans to orbit Earth from pole to pole, completing a four-day mission aboard a SpaceX Dragon capsule. Led by Chun Wang, they conducted 22 microgravity experiments before safely returning to Earth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/martin-luther-king-jr-civil-rights-movement-mission-legacy-assassination-aftermath-2703614-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Martin Luther King Jr.: The man, his mission, and the aftermath of his assassinationOn April 4, 1968, Nobel Peace Prize awardee Martin Luther King Jr. was assassinated in Memphis, triggering riots across the US. His death shook the civil rights movement but also cemented his legacy in the fight for justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gifts-indian-handicrafts-thailand-visit-2025-2704260-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budhha statue from Bihar, brocade shawl from Varanasi: PM's gift to ThailandDuring his official visit to Thailand for the sixth BIMSTEC Summit, Prime Minister Narendra Modi presented a series of traditional Indian handicrafts to the Thai royal family and top dignitaries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/test-review-madhavan-nayanthara-and-siddharth-hit-sixes-but-dont-win-the-match-2703901-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Test review: Madhavan, Nayanthara and Siddharth hit sixes, but don't win the matchReleased-Fri Apr 04, 2025Test movie review: Producer-turned-director Sashikanth's 'Test', starring Madhavan, Siddharth and Nayanthara, is a sports drama about a winner and a loser. The trio's star power failed to deliver an enjoyable innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-900000-olive-ridley-turtles-nesting-in-odisha-is-a-conservation-success-story-2703449-2025-04-03#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why 900,000 Olive Ridley turtles nesting in Odisha is a conservation success storyThe record-breaking mass laying of eggs at Rushikulya beach in February-March has conservationists elated since no turtles arrived here to nest in 2023-24"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-lsg-vs-mi-highlights-orange-purple-cap-2704339-2025-04-05",
      "headline": "Points Table, April 4: MI slide further after LSG defeatIPL Points Table Update, April 4: Mumbai Indians (MI) slumped to a 12-run defeat to the Lucknow Super Giants (LSG) on April 4 at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-rr-sanju-samson-press-conference-yashasvi-jaiswal-2704335-2025-04-05",
      "headline": "Samson backs RR opener Jaiswal to perform after poor IPL 2025 startRR skipper Sanju Samson has backed Yashasvi Jaiswal to perform well after a rocky start to his IPL 2025 campaign. Jaiswal has been short of runs at the top but Samson said that the southpaw is doing everything right and expects him to step up soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-tilak-varma-retire-out-reaction-gavaskar-harbhajan-2704331-2025-04-05",
      "headline": "Retiring Tilak Varma was a mistake: Mumbai Indians slammed after Lucknow lossIPL 2025, LSG vs MI: Former cricketers Sunil Gavaskar and Harbhajan Singh questioned Mumbai Indians' decision to retire out Tilak Varma in their failed chase of 204 in Lucknow. Tilak, batting out of position, hit 28 off 25 balls, struggling for momentum on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-digvesh-rathi-rishabh-pant-sunil-narine-2704332-2025-04-05",
      "headline": "LSG vs MI: Pant turns translator as Digvesh reveals Narine inspirationLSG captain Rishabh Pant turned translator for Digvesh Rathi as the mystery spinner revealed Sunil Narine to be his inspiration. Digvesh was the star of the show as LSG beat MI to secure the second win of their campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tilak-varma-lsg-vs-mi-retire-out-lucknow-2704319-2025-04-04",
      "headline": "Tilak Varma retires out after 23-ball 25, MI coach consoles himIPL 2025, LSG vs MI: Tilak Varma retired out for 25 off 23, but his selfless call went in vain as the Mumbai Indians lost to the Lucknow Super Giants by 12 runs at the Ekana Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-match-report-hardik-pandya-vain-lucknow-2704317-2025-04-04",
      "headline": "LSG vs MI: All-round Hardik Pandya show in vain as Lucknow win thriller at homeIPL 2025, LSG vs MI: Lucknow Super Giants piled up the misery on Mumbai Indians, denying them two points on Friday. After posting 203, LSG successfully defended the total, bowling well in the death overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-csk-vs-dc-noor-ahmad-press-conference-2704251-2025-04-04",
      "headline": "Difficult to read him: Kuldeep Yadav wary of Noor Ahmad threat vs CSKIPL 2025, CSK vs DC: Kuldeep Yadav said that Delhi Capitals (DC) are wary of the threat Noor Ahmad could pose in the upcoming clash against the Chennai Super Kings (CSK) at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dugout-tips-hardik-pandya-nicholas-pooran-wicket-2704286-2025-04-04",
      "headline": "Out injured, Rohit Sharma masterminds Nicholas Pooran wicket. Watch videoIPL 2025, LSG vs MI: Rohit Sharma did not play Friday's match in Lucknow due to a knee injury. However, he played a key role in Hardik Pandya's dismissal of Nicholas Pooran during the Lucknow Super Giants' innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-vs-mi-anil-kumble-record-2704282-2025-04-04",
      "headline": "Hardik Pandya scripts history, breaks Anil Kumble's 16-year-old recordIPL 2025, LSG vs MI: Hardik Pandya broke Anil Kumble's 16-year-old record to register the best bowling figures by a captain in the history of the T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-lsg-vs-mi-captain-reactions-2704269-2025-04-04",
      "headline": "What's wrong with Pant? Fans concerned after LSG captain fails vs MIIPL 2025: Rishabh Pant failed to perform against Mumbai Indians (MI) after scoring only two runs from six balls in the clash on Friday at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-sanju-samson-full-return-impact-sub-2704250-2025-04-04",
      "headline": "No more impact sub! Fit-again Sanju Samson to resume RR captaincyRajasthan Royals captain Sanjus Samson has said that he will be back as the full-time skipper and wicketkeeper for the team ahead of the Punjab Kings clash on Saturday, April 5. Samson played as an impact sub for the first three games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kuldeep-yadav-csk-vs-dc-noor-ahmad-press-conference-2704251-2025-04-04",
      "headline": "Difficult to read him: Kuldeep Yadav wary of Noor Ahmad threat vs CSKIPL 2025, CSK vs DC: Kuldeep Yadav said that Delhi Capitals (DC) are wary of the threat Noor Ahmad could pose in the upcoming clash against the Chennai Super Kings (CSK) at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dugout-tips-hardik-pandya-nicholas-pooran-wicket-2704286-2025-04-04",
      "headline": "Out injured, Rohit Sharma masterminds Nicholas Pooran wicket. Watch videoIPL 2025, LSG vs MI: Rohit Sharma did not play Friday's match in Lucknow due to a knee injury. However, he played a key role in Hardik Pandya's dismissal of Nicholas Pooran during the Lucknow Super Giants' innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-lsg-vs-mi-anil-kumble-record-2704282-2025-04-04",
      "headline": "Hardik Pandya scripts history, breaks Anil Kumble's 16-year-old recordIPL 2025, LSG vs MI: Hardik Pandya broke Anil Kumble's 16-year-old record to register the best bowling figures by a captain in the history of the T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-lsg-vs-mi-captain-reactions-2704269-2025-04-04",
      "headline": "What's wrong with Pant? Fans concerned after LSG captain fails vs MIIPL 2025: Rishabh Pant failed to perform against Mumbai Indians (MI) after scoring only two runs from six balls in the clash on Friday at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rr-sanju-samson-full-return-impact-sub-2704250-2025-04-04",
      "headline": "No more impact sub! Fit-again Sanju Samson to resume RR captaincyRajasthan Royals captain Sanjus Samson has said that he will be back as the full-time skipper and wicketkeeper for the team ahead of the Punjab Kings clash on Saturday, April 5. Samson played as an impact sub for the first three games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-rohit-sharma-dropped-fan-speculation-2704234-2025-04-04",
      "headline": "Rohit Sharma dropped? Fans speculate as MI legend misses LSG clashFans on social media are speculating if Rohit Sharma was dropped by the Mumbai Indians for their clash against Lucknow Super Giants on Friday, April 4 at the Ekana stadium. Rohit hasn't enjoyed the best of times in IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-japanese-grand-prix-carlos-sainz-misses-williams-pit-fp1-2704204-2025-04-04",
      "headline": "Blooper alert! Carlos Sainz misses Williams pit during Japanese GP FP1Carlos Sainz had a moment to forget as the Spaniard missed the Williams pit during the free practice 1 session of the Japanese Grand Prix on Friday, April 4. Sainz has had a rough time since making the switch to Williams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-knee-injury-lsg-vs-mi-2704194-2025-04-04",
      "headline": "Rohit Sharma misses LSG vs MI clash due to knee injuryIPL 2025: Rohit Sharma sustained a knee injury in the nets' session and hence, the 37-year-old failed to make the cut for Lucknow Super Giants' match against Mumbai Indians on Friday at the Ekana Stadium in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-captaincy-ruturaj-gaikwad-injury-2704185-2025-04-04",
      "headline": "MS Dhoni may captain CSK again in home game against Delhi CapitalsIPL 2025, CSK vs DC: Batting coach Michael Hussey said Ruturaj Gaikwad is in doubt to feature in Chennai's home game against Delhi on Saturday. MS Dhoni will lead CSK if Ruturaj isn't fit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-batting-approach-versatile-gt-vs-srh-2704184-2025-04-04",
      "headline": "Flexible Sudharshan opens up about batting mantra in era of fast-paced T20sGujarat Titans opener Sai Sudharsan opened up on the mindset behind his consistent run in IPL 2025, stressing the importance of being versatile with the bat and adapting to different match situations rather than chasing big totals blindly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-jos-buttler-captaincy-number-three-spot-2704175-2025-04-04",
      "headline": "GT's Jos Buttler feeling 'lighter' after quitting England captaincyGujarat Titans star Jos Buttler said that he feels 'lighter' after relinquishing England's white-ball captaincy. Buttler quit the role after England's poor performance in the Champions Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympics-2036-india-training-centre-preparation-2704160-2025-04-04",
      "headline": "India to have training centres for 10 sports as part of preparationIndia are on the way to setting up training centres for 10 sports as a part of preparations for the Olympics 2036. Last year, the Indian Olympic Association submitted India's formal bid to host the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jimmy-butler-is-great-he-adds-a-championship-dna-lebron-james-reacts-to-warriors-bold-trade-glbs-2704149-2025-04-04",
      "headline": "Jimmy Butler is great. He adds a Championship DNA, LeBron James reacts to Warriors' bold tradeLeBron James praises Butler after the Golden State Warriors defeated the Los Angeles Lakers at Crypto.com Arena, on Thursday, April 4, during the NBA regular game in a thriller 123-116."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-batting-approach-versatile-gt-vs-srh-2704184-2025-04-04",
      "headline": "Flexible Sudharshan opens up about batting mantra in era of fast-paced T20sGujarat Titans opener Sai Sudharsan opened up on the mindset behind his consistent run in IPL 2025, stressing the importance of being versatile with the bat and adapting to different match situations rather than chasing big totals blindly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-jos-buttler-captaincy-number-three-spot-2704175-2025-04-04",
      "headline": "GT's Jos Buttler feeling 'lighter' after quitting England captaincyGujarat Titans star Jos Buttler said that he feels 'lighter' after relinquishing England's white-ball captaincy. Buttler quit the role after England's poor performance in the Champions Trophy earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/olympics-2036-india-training-centre-preparation-2704160-2025-04-04",
      "headline": "India to have training centres for 10 sports as part of preparationIndia are on the way to setting up training centres for 10 sports as a part of preparations for the Olympics 2036. Last year, the Indian Olympic Association submitted India's formal bid to host the quadrennial event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jimmy-butler-is-great-he-adds-a-championship-dna-lebron-james-reacts-to-warriors-bold-trade-glbs-2704149-2025-04-04",
      "headline": "Jimmy Butler is great. He adds a Championship DNA, LeBron James reacts to Warriors' bold tradeLeBron James praises Butler after the Golden State Warriors defeated the Los Angeles Lakers at Crypto.com Arena, on Thursday, April 4, during the NBA regular game in a thriller 123-116."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-jimmy-butler-injury-scare-during-warriors-vs-lakers-raises-concern-ahead-of-playoffs-glbs-2704140-2025-04-04",
      "headline": "NBA: Jimmy Butler injury scare during Warriors vs Lakers raises concern ahead of playoffsGolden State Warriors forward Jimmy Butler left the game on Thursday, April 3, during the NBA regular game at Crypto.com Arena with a potential left arm injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-kevin-de-bruyne-manchester-city-exit-pep-guardiola-2704111-2025-04-04",
      "headline": "Kevin de Bruyne announces exit from Manchester City, to leave in summerManchester City's star midfielder Kevin de Bruyne has announced his exit from the club. De Bruyne will be leaving the club as a free agent in the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-shares-postgame-moment-with-david-beckham-after-warriors-defeat-lakers-glbs-2704089-2025-04-04",
      "headline": "NBA: Stephen Curry shares postgame moment with David Beckham after Warriors defeat LakersThe Golden State Warriors secured a crucial 123–116 victory over the Los Angeles Lakers on Thursday night, tightening the race for playoff seeding in the Western Conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-shah-rukh-khan-message-venkatesh-iyer-2704083-2025-04-04",
      "headline": "SRK texts KKR after SRH win, sends special message to Venkatesh IyerShah Rukh Khan sent a personal message to KKR players, including a motivating note to Venkatesh Iyer as vice-captain, silenced his price-tag critics with a crucial knock to beat SRH in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-shakes-off-injury-scare-in-lakers-showdown-against-warriors-glbs-2704073-2025-04-04",
      "headline": "NBA: LeBron James shakes off injury scare in Lakers' showdown against WarriorsLeBron James went down in the first quarter during the NBA regular game between the Los Angeles Lakers and the Golden State Warriors at Crypto.com Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-when-ms-dhoni-turned-astrologer-for-axar-patel-2704069-2025-04-04",
      "headline": "When MS Dhoni turned astrologer for Axar Patel: DC captain recalls old storyDelhi Capitals (DC) captain Axar Patel recently recalled an incident when legendary Chennai Super Kings (CSK) wicketkeeper batter MS Dhoni turned his astrologer during an IPL game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-like-my-father-matheesha-pathirana-csk-vs-dc-2704050-2025-04-04",
      "headline": "MS Dhoni is like my father: Pathirana pays big tribute to CSK iconMatheesha Pathirana credited MS Dhoni as a father figure in his cricketing journey with Chennai Super Kings in the IPL, with heartfelt praise echoed by his parents. The young Sri Lankan pacer has been a key bowling option for CSK since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ai-predicts-winner-of-lsg-vs-mi-match-2703991-2025-04-04",
      "headline": "IPL 2025: AI predicts winner of LSG vs MI clashAs Lucknow Super Giants (LSG) take on Mumbai Indians (MI) in Match 16 of the Indian Premier League 2025 (IPL 2025), we asked AI to predict the winner of the mouth-watering clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-secretary-devajit-saikia-defends-delhi-test-in-november-2703977-2025-04-04",
      "headline": "BCCI defends Delhi Test in November: Pollution issue doesn't happen every yearBoard of Control for Cricket in India (BCCI) secretary Devajit Saikia has come out in defence of their decision to host a Test match in Delhi in the month of November. India are set to play the first Test against South Africa on 18th November at Arun Jaitely Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-javelin-competition-dates-all-you-need-to-know-2703975-2025-04-04",
      "headline": "Neeraj Chopra Classic javelin competition in May 2025: All you need to knowThe Neeraj Chopra Classic javelin throw competition is all set to make its debut on May 24, bringing the Olympic star back to Indian soil after more than a year. With global athletes in attendance, the competition has already received the World Athletics category 'A' recognition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-luka-doncic-gifts-bts-j-hope-unreleased-sneakers-at-lakers-game-glbs-2703949-2025-04-04",
      "headline": "NBA: Luka Doncic gifts BTS' J-Hope unreleased sneakers at Lakers gameDuring the Los Angeles Lakers vs Golden State Warriors NBA regular game on Thursday, April 3, Lakers Guard Luka Doncic had a brief interaction with the BTS member J-Hope, who was on the courtside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kolkata-knight-riders-20-wins-vs-sunrisers-hyderabad-kkr-vs-srh-2703929-2025-04-04",
      "headline": "IPL 2025: Kolkata Knight Riders achieve unprecedented feat after beating SRHKolkata Knight Riders (KKR) achieved an unprecedented feat after beating Sunrisers Hyderabad (SRH) in Match 15 of the Indian Premier League 2025 (IPL 2025). The Ajinkya Rahane-led side won the match by 80 runs at Eden Gardens, Kolkata."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}