{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-shares-slide-up-to-10-percent-after-government-dismisses-mdr-rumours-2739518-2025-06-12",
      "headline": "Paytm shares slide up to 10% after government dismisses MDR rumoursPaytm shares fell sharply in early trade after the government rejected reports suggesting the return of merchant discount rate (MDR) charges on UPI transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tanla-platforms-shares-jump-13-percent-today-check-whats-driving-the-rally-2739510-2025-06-12",
      "headline": "Tanla Platforms shares jump 13% today. Check what's driving the rallyTanla Platforms share price: At around 10:10 am, shares of the company were trading 9.96% higher at Rs 684.20 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-nearly-90-percent-ready-on-market-access-in-fta-talks-says-piyush-goyal-2739489-2025-06-12",
      "headline": "India, EU nearly 90% ready on market access in FTA talks, says Piyush GoyalPiyush Goyal also underlined the political backing behind the deal, referring to the meeting between Prime Minister Narendra Modi and European Commission President Ursula von der Leyen in New Delhi on 28 February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-100-points-lower-nifty-below-25200-infosys-down-1-percent-2739486-2025-06-12",
      "headline": "Sensex, Nifty erase early losses to trade in green; IT stocks limit gainsThe S&P BSE Sensex was up by 89.24 points to 82,604.38, while the NSE Nifty50 added 31.45 points to 25,163.80 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-trading-setup-flat-start-why-us-china-trade-inflation-data-2739476-2025-06-12",
      "headline": "Stock market today: Sensex and Nifty likely to open flat. Here's whyAs of 8:34 am, Gift Nifty futures were trading at 25,236.5, suggesting that the Nifty 50 index will open close to Wednesday's closing level of 25,141.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-on-june-12-nse-bse-trading-wipro-hdfc-bank-ireda-nazara-tech-ntpc-2739463-2025-06-12",
      "headline": "Stocks to watch on June 12: Wipro, HDFC Bank, IREDA, Nazara Tech, NTPCThe Sensex and Nifty closed higher after a rangebound session on Wednesday. While gains in IT stocks supported the indices, profit booking and the absence of strong triggers limited the overall rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-real-estate-middle-class-indian-investors-rental-yields-residency-benefits-2739165-2025-06-11",
      "headline": "Dubai's billionaire realty map: Can India's salaried class invest there?For years, Dubai's skyline has glittered like a dream, much like that tempting NRI cousin who always seemed a step ahead in life. But things are changing as salaried Indians are looking to venture into Dubai's posh real estate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-123-points-higher-nifty-above-25100-hcltech-gains-3-percent-2739147-2025-06-11",
      "headline": "Sensex closes 123 points higher, Nifty above 25,100; HCLTech gains 3%The S&P BSE Sensex added 123.42 points to end at 82,515.14, while the NSE Nifty gained 37.15 points to close at 25,141.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bharat-rising-why-tier-2-cities-drive-job-growth-explains-hireveda-co-founder-saurabh-agarwal-2739099-2025-06-11",
      "headline": "Bharat rising: Why Tier-2 cities drive job growth, explains HireVeda co-founderWhile the metros still lead in the number of jobs, the speed of growth in smaller cities is hard to ignore, noted co-founder of HireVeda and ExecEdge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ultra-rich-india-hnwi-us-china-japan-usd-10-million-report-knight-frank-2739078-2025-06-11",
      "headline": "India now home to over 85,000 millionaires, ranks 4th globally: ReportIndia now trails only the United States, China, and Japan in terms of the number of wealthy individuals, accounting for 3.7% of the global HNWI population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-form-16-step-by-step-guide-to-download-and-use-it-for-easy-itr-filing-income-tax-return-2739064-2025-06-11",
      "headline": "Digital Form 16: Step-by-step guide to download and use it for easy ITR filingWith the advent of digital platforms, accessing and using Form 16 has become more straightforward, making it a vital document for accurate and hassle-free income tax return (ITR) filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/chasing-rs-10-discounts-ca-explains-why-tracking-every-rupee-is-not-making-you-rich-2739016-2025-06-11",
      "headline": "Chasing Rs 10 discounts? CA explains why tracking every rupee isn't making you richIt's a common belief that managing every rupee wisely equals financial discipline. People cut back on little indulgences and chase discounts, feeling financially in control, yet, their money may be slipping away in unnoticed ways."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-hera-pheri-3-dont-quit-tshirt-akshay-kumar-2739513-2025-06-12",
      "headline": "Paresh Rawal steps out in Don't Quit t-shirt amid Hera Pheri 3 exit. PicActor Paresh Rawal's \"Don't Quit\" t-shirt caught everyone's attention amid news of his exit from 'Hera Pheri 3'. Fans are speculating whether it was a subtle message or just a coincidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nikita-roy-trailer-sonakshi-sinha-arjun-rampal-confront-evil-in-supernatural-thriller-2739509-2025-06-12",
      "headline": "Nikita Roy trailer: Sonakshi, Arjun Rampal confront evil in supernatural thrillerThe trailer of 'Nikita Roy' starring Sonakshi Sinha, Arjun Rampal, and Paresh Rawal is out. The film will release in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shankar-mani-ratnam-last-few-films-flop-game-changer-thug-life-2739225-2025-06-12",
      "headline": "The worrying form of legendary directors Shankar and Mani RatnamLegendary directors Shankar and Mani Ratnam changed the landscape of Tamil cinema with their creations. However, their recent outings have been marred by harsh criticism, especially because of poor screenwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sobhita-dhulipala-and-naga-chaitanya-stun-at-akhil-zainab-reception-pics-2739491-2025-06-12",
      "headline": "Sobhita Dhulipala and Naga Chaitanya stun at Akhil-Zainab reception. PicsActors Sobhita Dhulipala and Naga Chaitanya stole the spotlight at Akhil Akkineni and Zainab Ravdjee's wedding reception in Hyderabad. Pictures from the event show the duo posing with the newlyweds along with their Akkineni family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-film-races-past-salman-khan-sikandar-2739487-2025-06-12",
      "headline": "Housefull 5 box office Day 6: Akshay Kumar's film races past SikandarAkshay Kumar's 'Housefull 5' has been doing exceptionally well at the box office. The multi-starrer has earned Rs 119.75 crore in six days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-nikhil-siddhartha-the-india-house-set-accident-many-injured-2739483-2025-06-12",
      "headline": "Water tank burst floods Ram Charan-Nikhil's The India House set, many injuredA major accident happened on the sets of Ram Charan's maiden production, 'The India House', starring Nikhil Siddhartha. An assistant cameraperson and many other crew members sustained injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-praises-ajay-devgn-as-producer-in-maa-2739471-2025-06-12",
      "headline": "Kajol praises Ajay Devgn's involvement in Maa: He's been a hands-on producerKajol returned to the big screen with 'Maa', a mythological horror co-produced by husband Ajay Devgn. She called him a \"hands-on producer\" who shaped the film with his keen eye for detail.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-cameo-rajinikanth-lokesh-kanagaraj-coolie-2739466-2025-06-12",
      "headline": "Aamir Khan confirms cameo in Rajinikanth's Coolie: Didn't even listen to scriptAamir Khan has finally confirmed his cameo role in Rajinikanth and Lokesh Kanagaraj's upcoming film, 'Coolie'. The film is gearing up for a grand release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-denies-retirement-plans-mahabharat-last-film-2739464-2025-06-12",
      "headline": "Aamir Khan clarifies Mahabharat isn't his final film amid retirement buzzAamir Khan recently put all speculations to rest about his retirement plans. The buzz erupted after the superstar shared his views on the film 'Mahabharat'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-7-kamal-haasan-film-crashes-earns-rs-42-crore-in-7-days-2739451-2025-06-12",
      "headline": "Thug Life box office Day 7: Kamal Haasan's film crashes, Rs 42 crore in Week 1Kamal Haasan and director Mani Ratnam's 'Thug Life' seems to have crashed at the box office. After seven days in theatres, Rs 50 crore-mark still feels distant for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sabrina-carpenter-announces-release-date-of-new-album-mans-best-friend-glbs-2739436-2025-06-12",
      "headline": "Sabrina Carpenter announces release date of new album 'Man's Best Friend'Sabrina Carpenter announces her bold new album Man's Best Friend, dropping August 29. Featuring chart-topping single Manchild, daring cover art, and a fall tour, the pop star is back with major momentum.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/is-zahara-jolie-pitt-engaged-to-actor-elijah-cooper-glbs-2739431-2025-06-12",
      "headline": "Is Angelina Jolie and Brad Pitt's daughter engaged to actor Elijah Cooper?Zahara Jolie-Pitt sparked engagement rumours after being spotted with a diamond ring while out with actor Elijah Cooper in L.A. The 20-year-old daughter of Angelina Jolie and Brad Pitt has yet to confirm the buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disney-and-nbcuniversal-sue-ai-firm-midjourney-over-copyright-infringement-glbs-2739428-2025-06-12",
      "headline": "Disney and NBCUniversal sue AI firm Midjourney over copyright infringementDisney and NBCUniversal have sued AI firm Midjourney for large-scale copyright infringement, accusing it of enabling users to generate unauthorised images of iconic characters like Darth Vader and the Minions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/youtuber-p2isthenames-cause-of-death-revealed-after-tragic-mail-room-discovery-glbs-2739420-2025-06-12",
      "headline": "YouTuber P2istheName's cause of death revealed after tragic mail room discoveryYouTuber P2istheName, also known as Philip Enewally, died from sudden cardiac dysfunction due to a rare heart condition. The 26-year-old had nearly 4 million subscribers and was known for his gaming content and entrepreneurial spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brian-wilson-iconic-beach-boys-co-founder-passes-away-at-82-glbs-2739416-2025-06-12",
      "headline": "Brian Wilson, iconic Beach Boys co-founder, passes away at 82Brian Wilson, co-founder of The Beach Boys and a pop music legend, has died at 82. Known for his melodic genius and personal struggles, Wilson leaves behind a lasting legacy in American music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-is-milind-chandwani-actor-avika-gor-soon-to-be-husband-2739333-2025-06-11",
      "headline": "Who is Milind Chandwani, actor Avika Gor's soon-to-be husband?Actor Avika Gor recently got engaged to 'MTV Roadies Real Heroes' fame Milind Chandwani. Chandwani is an IIM-Ahmedabad graduate and currently runs an NGO dedicated to underprivileged children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-opens-up-about-height-insecurities-recalls-support-from-javed-akhtar-2739328-2025-06-11",
      "headline": "Aamir Khan opens up about height insecurities, recalls support from Javed AkhtarAamir Khan, known as the perfectionist of Hindi cinema, recently spoke about his early career insecurities regarding his height. He credited humour and advice from Javed Akhtar for helping him overcome these fears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-back-on-ustaad-bhagat-singh-sets-makers-release-video-2739334-2025-06-11",
      "headline": "Pawan Kalyan back on Ustaad Bhagat Singh sets, makers release video After wrapping up 'Hari Hara Veera Mallu' and 'OG', actor and Andhra Pradesh Deputy Chief Minister Pawan Kalyan has now resumed work on 'Ustaad Bhagat Singh'. A behind-the-scenes video shared by the makers shows him arriving on set, interacting with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-reacts-with-pride-after-pm-narendra-modi-talks-menstrual-hygiene-2739313-2025-06-11",
      "headline": "Rupali Ganguly reacts with pride after PM Modi talks menstrual hygieneRupali Ganguly has expressed her admiration for PM Narendra Modi's efforts in breaking menstrual taboos. She feels proud of the positive impact this initiative has on society and awareness."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-army-chief-asim-munir-washington-military-parade-invite-michael-kurilla-praise-india-reaction-2739506-2025-06-12",
      "headline": "After general's praise, Pak Army chief Asim Munir invited to US military paradePakistani Army Chief General Asim Munir confirmed his presence at the US military parade in Washington on June 14, sources said. During the trip, he is also expected to meet with officials from the State Department and the Pentagon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dangerous-place-trump-orders-withdrawal-us-troops-middle-east-iran-iraq-israel-tensions-nuclear-2739459-2025-06-12",
      "headline": "Dangerous place: Trump orders US pullback from Middle East amid Iran tensionsThe decision comes against the backdrop of heightened tensions in the Middle East as talks between the US and Iran over its rapidly advancing nuclear program appear to have hit an impasse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asked-pm-modi-to-stop-hasina-from-reaching-out-to-bangladesh-he-said-muhammad-yunus-2739368-2025-06-11",
      "headline": "Yunus asks PM Modi to stop Hasina from speaking; gets 'you can't control it' replyWhen asked whether India was doing what Bangladesh expected, Muhammad Yunus responded without hesitation: \"No.\" He confirmed that Bangladesh had written to the Indian government requesting Hasina's extradition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-sonam-mangalsutra-left-homestay-helped-cops-2739417-2025-06-12",
      "headline": "Meghalaya honeymoon murder: How Sonam's mangalsutra left at homestay helped copsSonam Raghuvanshi left behind her 'mangalsutra' at a Meghalaya homestay, giving police the first clue in the murder of her husband Raja Raghuvanshi during their honeymoon. Five people, including her boyfriend, are now in custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-students-limbo-worried-parents-us-tightens-rules-foreign-enrolment-trump-america-visa-education-2738736-2025-06-12",
      "headline": "Indian students in limbo as US tightens rules on foreign enrolmentWith mounting visa hurdles and erratic US policy shifts under the Trump administration, Indian students are seemingly moving away from the American dream even as parents push to prioritise safety and stability. Experts say emotional and financial strain is prompting a shift away from higher education in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gyanesh-kumar-chief-election-commissioner-poll-rigging-voters-list-electoral-rolls-preparation-rigorous-transparent-rahul-gandhi-2739531-2025-06-12",
      "headline": "Most transparent: Poll body chief defends electoral rolls prep amid rigging claimChief Election Commissioner Gyanesh Kumar defended the electoral rolls preparation in India at an event in Sweden, saying it is one of the world's most rigorous and transparent. His statement came amid allegations of fudging voter data and poll rigging by the Opposition, including Congress MP Rahul Gandhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-card-5-million-dollars-permanent-us-residency-wait-list-is-open-website-visa-2739442-2025-06-12",
      "headline": "Trump Card, offering path to US residency for $5 million, now open for applicantsThe fine print of Donald Trump's social media post suggests that the Gold Card doesn't guarantee anyone US citizenship but is only a 'beautiful road in gaining access to the Greatest Country.' Trump has maintained that he would not need Congress's approval as the 'Gold Card' does not grant citizenship to the buyers, only a path to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-deployed-more-troops-to-los-angeles-than-syria-iraq-combined-report-glbs-2739426-2025-06-12",
      "headline": "Amid unrest, Trump deploys more troops to Los Angeles than Syria, Iraq combinedUS President Donald Trump has deployed more troops to Los Angeles to curb protests than the combined number stationed in Iraq and Syria. With around 4,700 personnel on the ground, the move has drawn backlash from California officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-nikhil-siddhartha-the-india-house-set-accident-many-injured-2739483-2025-06-12",
      "headline": "Water tank burst floods Ram Charan-Nikhil's The India House set, many injuredA major accident happened on the sets of Ram Charan's maiden production, 'The India House', starring Nikhil Siddhartha. An assistant cameraperson and many other crew members sustained injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-trump-greeted-with-cheers-boos-first-kennedy-center-appearance-glbs-2739443-2025-06-12",
      "headline": "Watch: Trump greeted with cheers, boos at first Kennedy Centre appearancePresident Trump received a mix of cheers and boos as he attended Les Misérables at the Kennedy Centre. He attended the show just days after deploying US Marines and the National Guard to address the ongoing violent protests in Los Angeles following his immigration raids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-nearly-90-percent-ready-on-market-access-in-fta-talks-says-piyush-goyal-2739489-2025-06-12",
      "headline": "India, EU nearly 90% ready on market access in FTA talks, says Piyush GoyalPiyush Goyal also underlined the political backing behind the deal, referring to the meeting between Prime Minister Narendra Modi and European Commission President Ursula von der Leyen in New Delhi on 28 February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-cop-dies-2-police-officers-serious-as-black-scorpio-rams-them-during-night-patrol-bihar-patna-2739458-2025-06-12",
      "headline": "Woman cop dies, 2 injured as SUV rams them during patrol in PatnaA Scorpio SUV ran over three police personnel during a late-night routine vehicle-checking operation in Bihar's Patna on Wednesday, injuring a woman constable and two inspectors. However, the woman constable succumbed to her injuries on Thursday morning.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/raja-raghuvanshi-murder-case-sonam-killed-husband-meghalaya-honeymoon-horror-2739337-2025-06-11",
      "headline": "Murder, matrimony, and melodrama: A honeymoon in Meghalaya ends in horrorA couple's honeymoon in Meghalaya turns into a chilling murder tale involving a suspected love triangle, a viral influencer sister, and a public outcry for justice wrapped in online melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-shubman-gill-karun-nair-number-three-sanjay-bangar-2739501-2025-06-12",
      "headline": "Neither Gill nor Nair: Ex-coach suggests new No. 3 options for England TestsSanjay Bangar feels that neither Shubman Gill nor Karun Nair will be playing at No.3 for India during the Test series against England. Bangar feels that it could be a toss-up between two potential debutants for the spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-musks-apology-was-very-nice-after-ugly-public-feud-glbs-2739432-2025-06-12",
      "headline": "Very nice: Donald Trump responds to Musk's public apology after ugly feudDonald Trump has reacted to Elon Musk's public apology following a week-long online feud. Musk said his comments about the president had \"gone too far.\" Trump told the New York Post he was \"really surprised\" but held \"no hard feelings,\" though he added he was \"a little disappointed.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-apex-council-meeting-ipl-victory-celebration-bengaluru-stampede-2739388-2025-06-11",
      "headline": "BCCI to discuss formulation of norms for IPL celebration after Bengaluru stampedeThe Indian cricket board will discuss the need to formulate norms for victory celebration of Indian Premier League franchises during its apex council meeting on June 14. The matter has gained urgency following the stampede in Bengaluru that killed 11 people and left over 50 injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/delhi-university-can-relationships-be-taught-as-a-curriculum-in-a-classroom-2739290-2025-06-11",
      "headline": "Can relationships be taught as a curriculum in a classroom?Delhi University (DU) has launched a course that will cover everything from understanding love and friendships to spotting red flags and building healthier bonds. The question is: Can relationships be taught as a curriculum in a classroom? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/a-month-into-india-pakistan-ceasefire-uri-on-loc-declares-bunkers-a-necessity-now-2739218-2025-06-11",
      "headline": "A month into India-Pakistan ceasefire, Uri on LoC declares: 'Bunkers a necessity now'INDIA TODAY takes stock of some J&K border villages intensely shelled by Pakistan during Operation Sindoor as their residents pick up the pieces\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ashok-gehlot-softens-tone-sachin-pilot-says-we-were-never-far-away-2739440-2025-06-12",
      "headline": "Ashok Gehlot softens tone on Sachin Pilot, says we were never far awayAshok Gehlot made the remark during an interaction with the media at the venue of the 'Prarthna Sabha' held in memory of Rajesh Pilot, a veteran Congress leader and father of Sachin Pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/los-angeles-protests-donald-trump-anti-immigration-stir-more-us-states-cities-curfew-national-guard-marines-arrests-detains-2739452-2025-06-12",
      "headline": "LA protests: 400 arrested, curfew imposed again as stir spreads to more US citiesNearly 400 people have been detained or arrested in Los Angeles for the anti-immigration protests, which entered its sixth day on Wednesday. A curfew has been imposed again following a brief lift on Wednesday morning as the demonstrations swelled to other US cities, with more planned over the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-cameo-rajinikanth-lokesh-kanagaraj-coolie-2739466-2025-06-12",
      "headline": "Aamir Khan confirms cameo in Rajinikanth's Coolie: Didn't even listen to scriptAamir Khan has finally confirmed his cameo role in Rajinikanth and Lokesh Kanagaraj's upcoming film, 'Coolie'. The film is gearing up for a grand release on August 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shiva-temple-vandalised-tensions-erupt-west-bengal-maheshtala-arrest-2739482-2025-06-12",
      "headline": "Tension grips Bengal's Maheshtala amid clash over temple vandalism, 40 arrestedViolence broke out in South 24 Parganas, West Bengal, after a Shiva temple was allegedly vandalised over a shop construction dispute. Stones were pelted, vehicles torched, and Section 163 was imposed as police made 40 arrests.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-30-can-government-deliver-jobs-private-investment-2739435-2025-06-12",
      "headline": "PM Modi 3.0: Can the government deliver on jobs and private investment?As the PM Modi-led government has completed 11 years in power, let's have a look at how India's economy has done, and what's the road ahead. Naysayers have often questioned the government and its economic policies. Has the Indian economy really done well?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-failure-indian-football-aiff-india-vs-hong-kong-isl-vs-i-league-2739450-2025-06-12",
      "headline": "Why Manolo Marquez's India stint proves FIFA Career Mode isn't real lifeIndian football tried to play Career Mode in real life—handing one man two jobs, but now it's all gone glitchy. No wins, no goals, no direction. Time to uninstall the experiment."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-gautam-gambhir-shubman-gill-huddle-talk-squad-2739530-2025-06-12",
      "headline": "Start fighting every ball: Shubman Gill, Gautam Gambhir huddle talk before England TestsIndia coach Gautam Gambhir and captain Shubman Gill inspired the full squad ahead of the England tour with some pep talk. The Indian team is set to embark on a new era under the leadership of Gambhir and Gill in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-goes-past-sachin-tendulkar-in-elite-list-after-gutsy-fifty-in-wtc-final-2739521-2025-06-12",
      "headline": "Steve Smith goes past Sachin Tendulkar in elite list after gutsy fifty in WTC FinalStar Australia batter Steve Smith went past legendary India batter Sachin Tendulkar in the list of most fifty plus scores in the history of knockout matches of ICC tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-2025-sa-vs-aus-south-africas-batting-on-day-1-sparks-debate-2739497-2025-06-12",
      "headline": "WTC Final: Timid or outclassed? South Africa's batting on Day 1 sparks debateAUS vs SA, WTC Final: South Africa squandered a strong start in the big final in London as their batters showed a lack of intent, drawing criticism from former players like Matthew Hayden and Dale Steyn. Despite Kagiso Rabada's five-wicket haul, Australia ended Day 1 on top. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-shubman-gill-karun-nair-number-three-sanjay-bangar-2739501-2025-06-12",
      "headline": "Neither Gill nor Nair: Ex-coach suggests new No. 3 options for England TestsSanjay Bangar feels that neither Shubman Gill nor Karun Nair will be playing at No.3 for India during the Test series against England. Bangar feels that it could be a toss-up between two potential debutants for the spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-1-kagiso-rabada-full-press-conference-2739495-2025-06-12",
      "headline": "Not the ideal start, but still a lot of cricket left to be played: Kagiso RabadaSouth Africa fast bowler Kagiso Rabada acknowledged that his team hasn't got off to the best of starts with the bat on Day 1 of the World Test Championship (WTC) final 2025. Rabada helped South Africa dismiss Australia for 212, and they later finished the day on 43/4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-1-steve-smith-full-press-conference-2739488-2025-06-12",
      "headline": "Australia are in a good position, despite not getting a big total: Steve SmithStar Australia batter Steve Smith is delighted with his team's position in the WTC Final 2025 against South Africa at the end of Day 1, despite not having enough runs on the board. South Africa are reeling at 43/4 at the end of Day 1 in reply to Australia's first innings score of 212."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-acknowledges-doping-mistake-following-stellar-show-in-wtc-final-2739480-2025-06-12",
      "headline": "Kagiso Rabada acknowledges doping mistake following stellar show in WTC FinalSouth Africa fast bowler Kagiso Rabada recalled his doping ban following a stellar five-wicket haul on Day 1 of the World Test Championship (WTC) final 2025 against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-2025-steve-smith-left-surprised-by-south-africas-drs-blunder-vs-beau-webster-2739465-2025-06-12",
      "headline": "Steve Smith left 'surprised' by South Africa's DRS blunder against Beau WebsterStar Australia batter Steve Smith said he was left surprised by South Africa not opting to go for DRS for a close lbw shout against Beau Webster during Day 1 of the World Test Championship (WTC) final at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-failure-indian-football-aiff-india-vs-hong-kong-isl-vs-i-league-2739450-2025-06-12",
      "headline": "Why Manolo Marquez's India stint proves FIFA Career Mode isn't real lifeIndian football tried to play Career Mode in real life—handing one man two jobs, but now it's all gone glitchy. No wins, no goals, no direction. Time to uninstall the experiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-test-series-morne-morkel-on-nitish-kumar-reddy-2739447-2025-06-12",
      "headline": "Nitish Reddy is skillful with ball, want to see him bowl more in Tests: Morne MorkelNitish Kumar Reddy has the knack for delivering \"magical\" balls, but India's bowling coach Morne Morkel believes the young all-rounder must take on greater bowling responsibility to truly complement his batting prowess.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-sreeja-akula-jaipur-patriots-semi-final-2739403-2025-06-11",
      "headline": "Sreeja Akula leads Jaipur Patriots to maiden UTT semi-final with 9-6 winUndefeated Sreeja Akula starred as she sealed Jaipur Patriots' maiden UTT semi-final berth with a 9-6 win over PBG Pune Jaguars—her Clarke-like dominance continuing a season of brilliance under the bright lights at Ahmedabad's EKA Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-acknowledges-doping-mistake-following-stellar-show-in-wtc-final-2739480-2025-06-12",
      "headline": "Kagiso Rabada acknowledges doping mistake following stellar show in WTC FinalSouth Africa fast bowler Kagiso Rabada recalled his doping ban following a stellar five-wicket haul on Day 1 of the World Test Championship (WTC) final 2025 against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-2025-steve-smith-left-surprised-by-south-africas-drs-blunder-vs-beau-webster-2739465-2025-06-12",
      "headline": "Steve Smith left 'surprised' by South Africa's DRS blunder against Beau WebsterStar Australia batter Steve Smith said he was left surprised by South Africa not opting to go for DRS for a close lbw shout against Beau Webster during Day 1 of the World Test Championship (WTC) final at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-failure-indian-football-aiff-india-vs-hong-kong-isl-vs-i-league-2739450-2025-06-12",
      "headline": "Why Manolo Marquez's India stint proves FIFA Career Mode isn't real lifeIndian football tried to play Career Mode in real life—handing one man two jobs, but now it's all gone glitchy. No wins, no goals, no direction. Time to uninstall the experiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-test-series-morne-morkel-on-nitish-kumar-reddy-2739447-2025-06-12",
      "headline": "Nitish Reddy is skillful with ball, want to see him bowl more in Tests: Morne MorkelNitish Kumar Reddy has the knack for delivering \"magical\" balls, but India's bowling coach Morne Morkel believes the young all-rounder must take on greater bowling responsibility to truly complement his batting prowess.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-tennis-sreeja-akula-jaipur-patriots-semi-final-2739403-2025-06-11",
      "headline": "Sreeja Akula leads Jaipur Patriots to maiden UTT semi-final with 9-6 winUndefeated Sreeja Akula starred as she sealed Jaipur Patriots' maiden UTT semi-final berth with a 9-6 win over PBG Pune Jaguars—her Clarke-like dominance continuing a season of brilliance under the bright lights at Ahmedabad's EKA Arena."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}