{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-over-340-points-higher-nifty-crosses-22500-bajaj-finserv-gains-4-percent-2694691-2025-03-17",
      "headline": "Sensex, Nifty end higher as healthcare and financial stocks boost marketThe S&P BSE Sensex jumped 341.04 points to close at 74,169.95, while the NSE Nifty50 added 111.55 points to end at 22,508.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-hits-all-time-low-should-you-sell-buy-hold-expert-advice-insolvency-plea-2694682-2025-03-17",
      "headline": "Ola Electric share price tanks over 7%: Should you buy, sell or hold?Ola Electric share price: The stock dropped to a record low of Rs 46.40 on the Bombay Stock Exchange (BSE) in early trade. By 3:00 pm, it was trading at Rs 46.95, down 7.10%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-pension-rules-know-how-divorced-and-separated-daughters-can-benefit-2694666-2025-03-17",
      "headline": "New pension rules: Know how divorced and separated daughters can benefitThese changes aim to encourage women's participation in governance and administration and ensure financial independence for widows and separated women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bombay-hc-gives-clean-chit-to-gautam-adani-brother-rajesh-adani-in-market-regulation-violations-case-sfio-2012-2694637-2025-03-17",
      "headline": "High Court clears Gautam Adani, brother in Rs 388 crore market violation caseThe case dates back to 2012 when the Serious Fraud Investigation Office (SFIO) filed a chargesheet against Adani Enterprises Limited (AEL) and its promoters, accusing them of criminal conspiracy and cheating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-financial-investments-make-a-better-inheritance-over-antiques-and-business-2694634-2025-03-17",
      "headline": "Why financial investments make a better inheritance over antiques and businessFinancial investments like savings, stocks, bonds, and mutual funds are easy to inherit through a will or nomination. They can be easily transferred through a will or nomination, giving your children financial flexibility and immediate access to funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-shark-tank-india-new-judge-srikanth-bolla-all-you-need-to-know-2694613-2025-03-17",
      "headline": "Who is Shark Tank India's new judge Srikanth Bolla? All you need to knowSrikanth Bolla will now be part of Shark Tank India's panel that evaluates and invests in promising business ideas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mobikwik-stock-price-falls-up-to-15-today-to-hit-a-52-week-low-today-why-is-it-down-today-2694592-2025-03-17",
      "headline": "Explained: Why MobiKwik shares fell 15% to hit 52-week low todayMobiKwik stock price: The sharp fall in its share price came after its three-month IPO lock-in expired. As a result, 6% of the company's outstanding stock or 46 lakh shares became eligible for trading.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-rosmerta-digital-limited-insolvency-plea-ola-electric-share-price-all-you-need-to-know-2694574-2025-03-17",
      "headline": "Rosmerta Digital files insolvency plea against Ola Electric. All you need to knowOla Electric shares slipped below Rs 50 for the first time, hitting a record low of Rs 46.94 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-jiohotstar-to-end-free-ipl-cricket-streaming-after-2-years-new-subscription-plan-2694571-2025-03-17",
      "headline": "Reliance Jio to end free IPL cricket streaming in India after 2 yearsThe company's new subscription plan starts at Rs 299 for mobile users. Those who opt for this plan will be able to watch IPL matches on JioHotstar, the recently formed streaming platform under the Reliance-Disney joint venture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroup-plans-to-layoff-30-percent-of-it-contractors-here-is-why-2694556-2025-03-17",
      "headline": "Citigroup plans to layoff 30% of IT contractors. Here's whyThis change is intended to enhance data security, improve risk management practices, and ensure compliance with regulatory requirements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-pension-processing-now-similar-to-ops-rules-check-latest-guidelines-2694517-2025-03-17",
      "headline": "NPS pension processing now similar to OPS rules. Check latest guidelinesNew guidelines have been introduced to speed up the pension processing process and to ensure that retired employees receive their pensions on time without any trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-swp-investment-plans-what-is-the-difference-expert-view-money-tips-mutual-funds-2694510-2025-03-17",
      "headline": "SIP and SWP are not the same. Here's how they differSIP (Systematic Investment Plan) is a way to invest money in mutual funds at regular intervals, helping investors build wealth over time."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-tayme-thapthimthong-on-the-white-lotus-s3-lisa-of-blackpink-asian-representation-2694643-2025-03-17",
      "headline": "Exclusive: Tayme on The White Lotus S3, Lisa of Blackpink, Asian representationTayme Thapthimthong's journey from a real-life security guard to a celebrated actor in The White Lotus Season 3 is truly remarkable. Paired with Blackpink's Lisa, Tayme, in an exclusive chat with India Today speaks about his journey, Asian representation and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-kardashian-vs-kanye-west-rapper-fights-with-ex-wife-over-daughter-north-name-2694645-2025-03-17",
      "headline": "Kim Kardashian vs Kanye West: Rapper fights with ex-wife over daughter's nameKanye West released a song featuring daughter North, despite Kim Kardashian's objections. She took legal action, but Kanye leaked their private chat and refused to back down, escalating their feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/after-cid-crime-patrol-begins-to-stream-on-netflix-fans-react-2694589-2025-03-17",
      "headline": "After CID, Crime Patrol begins to stream on Netflix, fans reactCrime Patrol, the iconic true-crime series on Sony TV, is now available to stream on Netflix. Fans reacted to the announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-kim-soo-hyun-and-kim-sae-ron-controversy-why-its-not-okay-to-be-okay-2694514-2025-03-17",
      "headline": "Kim Soo-hyun and Kim Sae-ron controversy: Exposing Korean industry's double standardsThe controversy involving South Korean actors Kim Soo-hyun and the late Kim Sae-ron has opened a Pandora's box of issues within the entertainment industry, from age-gap relationships to the treatment of disgraced celebrities. As the public grapples with these revelations, the debate continues to rage on about ethics, consent, and gender double standards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-agency-gold-medalist-theatens-indian-blogger-for-unauthorised-content-2694525-2025-03-17",
      "headline": "Kim Soo-hyun's agency acts against Indian blogger for unauthorised contentIn a dramatic turn of events, actor Kim Soo-hyun's agency has initiated legal proceedings against an Indian influencer. The influencer shared emails from the agency, revealing that he was threatened for posting 'unauthorised' content.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-performs-umrah-amid-cancer-battle-see-photos-videos-2694558-2025-03-17",
      "headline": "Hina Khan performs Umrah amid cancer battle, says she's 'overwhelmed, speechless'Actor Hina Khan performed Umrah amid her cancer battle. She shared emotional moments from Mecca on Instagram. Accompanied by her brother, the actor expressed gratitude and prayed for strength while documenting her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-scenes-cut-from-good-day-following-kim-sae-ron-controversy-2694544-2025-03-17",
      "headline": "Kim Soo-hyun's scenes cut from 'Good Day' following Kim Sae-ron controversyK-drama actor Kim Soo-hyun's scenes from MBC's variety program 'Good Day' were edited after Kim Sae-ron controversy. The production house shared a statement and confirmed the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/erica-fernandes-opens-up-past-physical-abuse-reveals-impact-of-do-patti-movie-2694425-2025-03-17",
      "headline": "TV actor Erica Fernandes says Do Patti triggered memories of abusive relationshipActor Erica Fernandes shared her experience of physical abuse in a past relationship, highlighting how films like Do Patti resurfaced painful memories. Despite the challenges, she opened up about her journey towards healing and the societal pressures that kept her silent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-little-brother-holi-pic-2694313-2025-03-16",
      "headline": "Sidhu Moose Wala's little brother's Holi pic goes viral. Seen yet?A viral photo of Sidhu Moose Wala's little brother, Shubhdeep, dressed in traditional attire with Holi colours on his cheeks, has captured the hearts of fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-of-us-are-dead-actor-lomon-on-india-i-think-of-taj-mahal-and-bengal-tigers-2694255-2025-03-16",
      "headline": "All Of Us Are Dead actor Lomon on India: I think of Taj Mahal and Bengal TigersSouth Korean actor Lomon, known for his role in All of Us Are Dead, discussed his latest project Family Matters and shared insights on his career and inspirations in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-discoloured-nails-not-nailpaint-sideeffect-of-chemotherapy-2694210-2025-03-16",
      "headline": "Hina Khan shares pic of discoloured nails: Most common side effect of chemotherapyTelevision actor Hina Khan opened up about the side effects of chemotherapy on her nails, sharing a glimpse of the discolouration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saira-banu-says-she-shouldnt-be-called-ar-rahmans-ex-wife-were-not-divorced-only-separated-2694208-2025-03-16",
      "headline": "Saira Banu says she shouldn't be called AR Rahman's ex-wife: We're not divorcedSaira Banu, wife of AR Rahman, clarifies that they are separated but not divorced, addressing recent rumours. She cites her health issues as a reason and wishes Rahman well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chahar-choudhary-ankit-gupta-unfollow-each-other-stmp-2694198-2025-03-16",
      "headline": "Priyanka Chahar Choudhary-Ankit Gupta unfollow each other, fans speculate break-upTelevision actors Priyanka Chahar Choudhary and Ankit Gupta, known for their chemistry on Udaariyaan, have unfollowed each other on Instagram, sparking rumours about their relationship status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-health-update-son-ameen-dehydartion-composer-discharged-2694173-2025-03-16",
      "headline": "AR Rahman discharged from hospital, son shares health updateAR Rahman's son Ameen shared an update on the music maestro's health, explaining his hospitalisation was due to dehydration. He assured fans that Rahman is now recovering well. India Today Digital has learnt that the composer has also been discharged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-plays-holi-with-girlfriend-ankita-kukreti-sanjeeda-shaikh-divorce-2693960-2025-03-15",
      "headline": "Watch: Actor Aamir Ali plays Holi with girlfriend Ankita KukretiTelevision actor Aamir Ali was seen celebrating Holi with his girlfriend Ankita Kukreti.  The couple's public appearance comes after Aamir confirmed his relationship status in a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ted-lasso-starring-jason-sudeikis-show-renewed-for-fourth-season-apple-tv-2693905-2025-03-15",
      "headline": "Ted Lasso returns: Jason Sudeikis show renewed for fourth seasonApple TV+ has renewed Ted Lasso for a fourth season with Jason Sudeikis leading the charge once more. The new season will introduce Ted coaching a women's football team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-says-thank-you-india-shares-lollapalooza-performance-glimpse-photo-dump-2693841-2025-03-15",
      "headline": "Singer Shawn Mendes says 'dhanyawad' to India after Lollapalooza performanceSinger Shawn Mendes visited India for Lollapalooza 2025 and is currently in the nation, expressing his gratitude through social media post. He especially appreciated Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-hosts-hasan-minhaj-indore-treat-2693783-2025-03-15",
      "headline": "Stand-up comic Zakir Khan treats Hasan Minhaj with delicious Indore foodZakir Khan hosted Hasan Minhaj in Indore, introducing him to the city's street food culture and hinting at a future collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tulsi-gabbard-rajnath-singh-meeting-us-strict-action-unlawful-anti-india-khalistan-group-sfj-pannun-2694685-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajnath Singh urges US spy chief to act against Khalistani group SFJ: ReportDuring his meeting with US spy chief Tulsi Gabbard, Defence Minister Rajnath Singh expressed India's concerns over the SFJ's anti-India activities on US soil and asked Washington to take action against the Khalistani outfit, ANI reported, citing sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-gold-smuggling-case-husband-jatin-hukkeri-says-married-in-november-separated-in-december-arrest-exemption-2694694-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Married Ranya Rao in November, separated month later, husband tells courtRanya Rao's husband Jatin Hukkeri applied for exemption from arrest in the gold smuggling case saying the couple separated a month after getting married in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-peace-deal-ceasefire-donald-trump-vladimir-putin-calls-moscow-kyiv-zelenskyy-2694618-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump to speak to Putin as Russia demands 'ironclad' guarantees for Ukraine dealRussia is demanding 'ironclad' security guarantees in a peace treaty with Ukraine to end the three-year war, as talks advance on a US-proposed 30-day ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-ends-over-340-points-higher-nifty-crosses-22500-bajaj-finserv-gains-4-percent-2694691-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty end higher as healthcare and financial stocks boost marketThe S&P BSE Sensex jumped 341.04 points to close at 74,169.95, while the NSE Nifty50 added 111.55 points to end at 22,508.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/march-madness-balochistan-blows-up-noshki-bla-57-attacks-train-hijack-baloch-separatist-movement-explained-2694523-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "March Madness as Balochistan blows upMarch has been a fireworks display in Pakistan's north and south, and the military is running around like a headless chicken. Baloch rebels launched 57 attacks in the last 48 hours. A lethal combo has got the secessionists humming \"mauka, mauka\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/islamist-terrorism-says-tulsi-gabbard-on-pak-sponsored-terror-against-india-2694675-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Islamist terrorism, says Tulsi Gabbard on Pak-sponsored terror against IndiaTulsi Gabbard also said that US President Donald Trump and PM Modi are working together to defeat terrorism."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-accident-video-cctv-driver-student-gujarat-rakshit-chaurasia-2694399-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Minutes before Vadodara crash: CCTV footage reveals accused, friend's activitiesNew CCTV footage showed the Vadodara crash accused and his friend minutes before the crash, where he allegedly drove intoxicated, killing a woman and injuring four others on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tulsi-gabard-us-intelligence-chief-china-india-security-advisory-pm-modi-practical-2694655-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US spy chief on China threat: Goal is peace, Trump, PM Modi's approach pragmaticTulsi Gabbard, the US Director of National Intelligence, praised PM Modi's \"pragmatic approach\" to China, likening it to Donald Trump's, and emphasised India's key role in regional stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/mattress-linked-good-quality-sleep-poor-health-science-behind-it-2694554-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why your mattress matters: The science behind quality sleepWhile adults spend nearly a third of their lives sleeping, the role of mattresses in sleep quality has often been overlooked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-inspired-by-crime-show-gwalior-man-kills-wife-stages-it-as-road-accident-2694667-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inspired by crime show, Gwalior man kills wife, stages it as road accidentA Gwalior man allegedly killed his wife and staged it as a road accident. Police first treated it as an accident, but a post-mortem exposed the murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-declares-pardons-issued-by-joe-biden-void-signed-by-autopen-2694519-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump declares pardons issued by Joe Biden void: Done by autopenPresident Donald Trump has voided Joe Biden's last-minute pardons, claiming they were signed by an autopen without Biden's approval and may involve criminal misconduct.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-gold-smuggling-kannada-actor-karnataka-mla-basanagouda-patil-yatnal-hiding-gold-bengaluru-2694448-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "She hid gold wherever…: BJP MLA's vulgar remark against Ranya RaoKarnataka BJP MLA Basangouda Patil Yatnal, who made a vulgar remark against actor Ranya Rao, also said that state ministers are involved in the case and that he will expose them in the Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/david-warners-massy-look-from-debut-telugu-film-robinhood-out-see-poster-2694625-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "David Warner's massy look from debut Telugu film Robinhood out. See posterAustralian cricketer David Warner will be making his acting debut in the Telugu film Robinhood, starring Nithiin and Sreeleela in the lead. Directed by Venky Kudumula, the film is scheduled to release on March 28, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-south-is-resisting-the-delimitation-exercise-2694305-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the South is resisting the Delimitation ExerciseThe South's efforts to preserve its political voice, federal autonomy, and economic contributions at odds with the North's cries of under-representation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bombay-hc-gives-clean-chit-to-gautam-adani-brother-rajesh-adani-in-market-regulation-violations-case-sfio-2012-2694637-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High Court clears Gautam Adani, brother in Rs 388 crore market violation caseThe case dates back to 2012 when the Serious Fraud Investigation Office (SFIO) filed a chargesheet against Adani Enterprises Limited (AEL) and its promoters, accusing them of criminal conspiracy and cheating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-immigration-self-deportation-cbp-home-app-united-states-ranjani-srinivasan-2694520-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Indian Columbia student flees, Elon Musk endorses self-deportation appRanjani Srinivasan, an Indian Columbia student, used the CBP Home App, launched by the Donald Trump administration to allow individuals to lawfully 'self-deport', avoiding the risk of arrest and detention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-kim-soo-hyun-and-kim-sae-ron-controversy-why-its-not-okay-to-be-okay-2694514-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kim Soo-hyun and Kim Sae-ron controversy: Exposing Korean industry's double standardsThe controversy involving South Korean actors Kim Soo-hyun and the late Kim Sae-ron has opened a Pandora's box of issues within the entertainment industry, from age-gap relationships to the treatment of disgraced celebrities. As the public grapples with these revelations, the debate continues to rage on about ethics, consent, and gender double standards. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-army-officer-son-allege-45-minute-thrashing-by-punjab-cops-with-baseball-bats-2694504-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Army officer, son allege 45-minute thrashing by Punjab cops with baseball batsThree Patiala Police officials allegedly assaulted a senior Army officer and his son in Patiala for 45 minutes, leaving the officer with a fractured arm and his son with head injuries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-did-gauri-spratt-fall-in-love-with-aamir-khan-she-answers-2694521-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How did Gauri Spratt fall in love with Aamir Khan? She answersGauri Spratt lists the reasons that made her fall in love with Aamir Khan. The superstar introduced his live-in partner to the media last week ahead of his 60th birthday celebration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lashkar-e-taiba-founder-hafiz-saeed-mastermind-mumbai-2611-attack-security-pakistan-isi-attack-2694572-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After aide's murder, Pak boosts security for LeT chief Hafiz Saeed: SourcesFollowing the murder of LeT terrorist Abu Qatal, Pakistan has heightened security for 26/11 plotter Hafiz Saeed and his son Talha Saeed, amid a series of attacks on Saeed's close associates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-man-spots-zomato-delivery-agent-eating-customer-food-shares-story-behind-it-deepinder-goyal-2694539-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi man spots Zomato delivery agent eating customer's food, shares story behind itAt first, the man assumed that the Zomato delivery agent was eating food meant for a customer. It was only after speaking to the agent that he understood the story behind it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-relief-to-auroville-township-development-sets-aside-ngt-madras-hc-rulings-2694597-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court fines resident Rs 1 lakh for case against road in AurovilleSupreme Court fined an Auroville resident Rs 1 lakh for obstructing development and overturned High Court and National Green Tribunal orders stalling road projects. The ruling will allow Auroville Foundation to resume its planned developmental activities in the township."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-influencer-orry-7-others-face-charges-for-alleged-drinking-at-vaishno-devi-camp-katra-fir-lodged-2694545-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Influencer Orry, 7 others face charges for drinking at Vaishno Devi base campJ&K police on Monday filed an FIR against Bollywood influencer Orry, and seven others, including a Russian national, for allegedly consuming alcohol at a hotel in Katra, near Vaishno Devi shrine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-shares-link-to-pm-modis-podcast-with-lex-fridman-in-surprise-endorsement-2694579-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump shares link to PM's podcast with Lex Fridman in surprise endorsementDuring his conversation with Lex Fridman, PM Modi recalled key moments with Donald Trump, including the 2019 \"Howdy Modi\" event, his White House visit, and last year's assassination attempt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/police-official-statement-on-orry-case-involving-alcohol-consumption-at-vaishno-devi-temple-premises-2694681-2025-03-17",
      "headline": "Will be dealt with iron hands: Police on FIR against Orry in Vaishno Devi rowOrhan Awatramani, popularly known as Orry, is facing charges in a case involving alleged consumption of alcohol at a hotel in Katra, near the Vaishno Devi temple premises. The police on Monday released a long statement explaining the entire matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-tayme-thapthimthong-on-the-white-lotus-s3-lisa-of-blackpink-asian-representation-2694643-2025-03-17",
      "headline": "Exclusive: Tayme on The White Lotus S3, Lisa of Blackpink, Asian representationTayme Thapthimthong's journey from a real-life security guard to a celebrated actor in The White Lotus Season 3 is truly remarkable. Paired with Blackpink's Lisa, Tayme, in an exclusive chat with India Today speaks about his journey, Asian representation and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/david-warners-massy-look-from-debut-telugu-film-robinhood-out-see-poster-2694625-2025-03-17",
      "headline": "David Warner's massy look from debut Telugu film Robinhood out. See posterAustralian cricketer David Warner will be making his acting debut in the Telugu film Robinhood, starring Nithiin and Sreeleela in the lead. Directed by Venky Kudumula, the film is scheduled to release on March 28, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-kardashian-vs-kanye-west-rapper-fights-with-ex-wife-over-daughter-north-name-2694645-2025-03-17",
      "headline": "Kim Kardashian vs Kanye West: Rapper fights with ex-wife over daughter's nameKanye West released a song featuring daughter North, despite Kim Kardashian's objections. She took legal action, but Kanye leaked their private chat and refused to back down, escalating their feud."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-mirra-andreeva-aryna-sabalenka-speech-presentation-2694692-2025-03-17",
      "headline": "Watch: Mirra Andreeva, Aryna Sabalenka win hearts with hilarious speechesMirra Andreeva and Aryna Sabalenka had the crowd at Indian Wells laughing as they delivered hilarious post-match speeches during the presentation ceremony on Sunday, March 16. Andreeva beat Sabalenka to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-unbox-live-streaming-where-to-watch-tickets-virat-kohli-2694689-2025-03-17",
      "headline": "RCB Unbox 2025 live streaming and telecast: Date, time, venue and where to watch?IPL 2025: Royal Challengers Bengaluru's Unbox event will be held at the M Chinnaswamy Stadium on Monday, March 17. Here's how you can watch the event on television and online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-faf-du-plessis-vice-captain-2694658-2025-03-17",
      "headline": "Delhi Capitals appoint Faf du Plessis as captain Axar Patel's deputyIPL 2025: Delhi Capitals appointed South Africa star Faf du Plessis as their vice-captain on Monday, March 17. The star batter will be captain Axar Patel's deputy in the revamped set-up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-on-his-360-degree-comeback-after-ipl-2024-2694651-2025-03-17",
      "headline": "Hardik Pandya on his remarkable comeback after IPL 2024: Destiny had its planIndia all-rounder Hardik Pandya opened up on his remarkable comeback to international cricket following a forgettable season in the Indian Premier League 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-netflix-khakhee-bengal-greg-chappell-reference-2694653-2025-03-17",
      "headline": "Sourav Ganguly turns cop in Netflix promo with hilarious Chappell throwbackFormer India captain Sourav Ganguly flaunted his acting skills in a Netflix promo for Khakee: The Bengal Chapter, playing an aggressive cop. In a hilarious twist, he channels his past rivalry with Greg Chappell to bring intensity to his role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-dream-captain-shashank-singh-pbks-mi-2694611-2025-03-17",
      "headline": "Rohit Sharma is my dream captain, want to play under him once: Shashank SinghPunjab Kings batter Shashank Singh has said that Rohit Sharma is his dream captain and wants to play under the Mumbai Indians legend at least once in his career. Rohit is the joint-most successful captain in IPL history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tristan-stubbs-speaks-on-delhi-capitals-opening-faf-du-plessis-2694593-2025-03-17",
      "headline": "Who can emulate Abhishek-Head partnership for Delhi Capitals? Stubbs answersDelhi Capitals batter Tristan Stubbs opened up shared his thoughts about the ideal opening combination for their team in the upcoming Indian Premier League 2025 (IPL 2025). The youngster also expressed excitement ahead of sharing the dressing room with Faf du Plessis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harry-brook-ban-delhi-capitals-moeen-ali-kkr-2694573-2025-03-17",
      "headline": "KKR's Moeen Ali doesn't find Harry Brook's IPL ban harsh: Messed his team upKKR all-rounder Moeen Ali doesn't find Harry Brook's IPL ban harsh as he feels the England batter has messed up DC's plan for the upcoming IPL 2025 season by withdrawing just before the start of the season. Brook was bought by Delhi for 6.5 crore rupees during the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-bruno-fernandes-roy-keane-criticism-2694555-2025-03-17",
      "headline": "Manchester United's Fernandes reacts to Keane criticism: I do things my wayManchester United captain Bruno Fernandes responded to the criticism from Roy Keane and claimed that he does things his way and has immense respect for the club legend. Fernandes has been in red-hot form for United in recent weeks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-begins-practicing-with-intense-net-session-2694549-2025-03-17",
      "headline": "Watch: Virat Kohli begins practicing for IPL 2025 with intense net sessionRoyal Challengers Bengaluru (RCB) batter Virat Kohli has begun practicing for upcoming Indian Premier League 2025 (IPL 2025) through an intense net session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-umran-malik-story-dale-steyn-yorker-2694522-2025-03-17",
      "headline": "IPL 2025: When Umran Malik proved Dale Steyn 'wrong' with 155 kmph thunderboltDale Steyn recalled how Umran Malik once proved him wrong by bowling a 155 kmph yorker and going against his advice. Umran enjoyed a fruitful time under Steyn's guidance at SRH in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tristan-stubbs-speaks-on-delhi-capitals-opening-faf-du-plessis-2694593-2025-03-17",
      "headline": "Who can emulate Abhishek-Head partnership for Delhi Capitals? Stubbs answersDelhi Capitals batter Tristan Stubbs opened up shared his thoughts about the ideal opening combination for their team in the upcoming Indian Premier League 2025 (IPL 2025). The youngster also expressed excitement ahead of sharing the dressing room with Faf du Plessis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-harry-brook-ban-delhi-capitals-moeen-ali-kkr-2694573-2025-03-17",
      "headline": "KKR's Moeen Ali doesn't find Harry Brook's IPL ban harsh: Messed his team upKKR all-rounder Moeen Ali doesn't find Harry Brook's IPL ban harsh as he feels the England batter has messed up DC's plan for the upcoming IPL 2025 season by withdrawing just before the start of the season. Brook was bought by Delhi for 6.5 crore rupees during the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-bruno-fernandes-roy-keane-criticism-2694555-2025-03-17",
      "headline": "Manchester United's Fernandes reacts to Keane criticism: I do things my wayManchester United captain Bruno Fernandes responded to the criticism from Roy Keane and claimed that he does things his way and has immense respect for the club legend. Fernandes has been in red-hot form for United in recent weeks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-begins-practicing-with-intense-net-session-2694549-2025-03-17",
      "headline": "Watch: Virat Kohli begins practicing for IPL 2025 with intense net sessionRoyal Challengers Bengaluru (RCB) batter Virat Kohli has begun practicing for upcoming Indian Premier League 2025 (IPL 2025) through an intense net session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-umran-malik-story-dale-steyn-yorker-2694522-2025-03-17",
      "headline": "IPL 2025: When Umran Malik proved Dale Steyn 'wrong' with 155 kmph thunderboltDale Steyn recalled how Umran Malik once proved him wrong by bowling a 155 kmph yorker and going against his advice. Umran enjoyed a fruitful time under Steyn's guidance at SRH in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-final-liverpool-vs-newcastle-united-arne-slot-reaction-2694490-2025-03-17",
      "headline": "Liverpool boss Arne Slot calm despite League Cup loss: Part of playing footballLiverpool boss Arne Slot is remaining calm despite his side's League Cup final loss to Newcastle United at Wembley on Sunday, March 16. The final loss rounded off a horrible week for Liverpool as they crashed out of the Champions League as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohit-sharma-rates-delhi-capitals-bowling-attack-as-best-ever-2694466-2025-03-17",
      "headline": "Delhi Capitals' bowling attack is the best I've been a part of in IPL: Mohit SharmaSeamer Mohit Sharma rated Delhi Capitals' bowling attack as the best he's ever been a part of in IPL history. Mohit was bought by Delhi for Rs 2.20 Crore in the mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-lucknow-super-giants-squad-2694456-2025-03-17",
      "headline": "LSG optimistic that Mayank Yadav will join squad around April 2nd weekLucknow Super Giants are optimistic that Mayank Yadav will join the squad around the second week of April for the IPL 2025 campaign. Mayank is stepping up his recovery and LSG are waiting for the green signal from the BCCI Centre Of Excellence regarding the pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-wanted-to-retire-after-his-100th-test-and-even-invited-ms-dhoni-2694430-2025-03-17",
      "headline": "Wanted to retire after playing my 100th Test, had even invited MS Dhoni: R AshwinLegendary India all-rounder Ravichandran Ashwin recently revealed that he wanted to retire after playing his 100th Test and had even invited former India captain to present him with the memento."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/meera-andreeva-beats-aryna-sabalenka-to-claim-indian-wells-title-2694421-2025-03-17",
      "headline": "17-year-old Mirra Andreeva shocks World No. 1 Sabalenka to win Indian Wells crownRussia's teenage star Mirra Andreeva edged past world number one Aryna Sabalenka to win the Indian Wells final. The 17-year-old beat the three-time Grand Slam champion 2-6 6-4 6-3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-beat-liverpool-to-win-league-cup-dan-burn-alexander-isak-2694414-2025-03-17",
      "headline": "Dan Burn, Alexander Isak guide Newcastle to League Cup triumph over LiverpoolNewcastle beat Liverpool 2-1 in the League Cup final riding on Dan Burn and Isak Alexander's goal to win their first major domestic trophy in 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-tino-best-heated-face-off-indian-masters-vs-west-indies-masters-2694398-2025-03-17",
      "headline": "Watch: Yuvraj Singh, Tino Best get involved in heated face off during IML finalLegendary India all-rounder Yuvraj Singh and West Indies fast bowler Tino Best got involved in a heated face-off during the final of International Masters League between the India Masters and the West Indies Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-vs-chelsea-report-highlights-2694375-2025-03-16",
      "headline": "Arsenal beat Chelsea 1-0 to keep title hopes alive in Premier LeagueArsenal stayed in the hunt of the Premier League by beating Chelsea 1-0 on Sunday, March 16. Mikel Merino scored the winner in what turned out to be a scrappy game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/meera-andreeva-beats-aryna-sabalenka-to-claim-indian-wells-title-2694421-2025-03-17",
      "headline": "17-year-old Mirra Andreeva shocks World No. 1 Sabalenka to win Indian Wells crownRussia's teenage star Mirra Andreeva edged past world number one Aryna Sabalenka to win the Indian Wells final. The 17-year-old beat the three-time Grand Slam champion 2-6 6-4 6-3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-beat-liverpool-to-win-league-cup-dan-burn-alexander-isak-2694414-2025-03-17",
      "headline": "Dan Burn, Alexander Isak guide Newcastle to League Cup triumph over LiverpoolNewcastle beat Liverpool 2-1 in the League Cup final riding on Dan Burn and Isak Alexander's goal to win their first major domestic trophy in 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-tino-best-heated-face-off-indian-masters-vs-west-indies-masters-2694398-2025-03-17",
      "headline": "Watch: Yuvraj Singh, Tino Best get involved in heated face off during IML finalLegendary India all-rounder Yuvraj Singh and West Indies fast bowler Tino Best got involved in a heated face-off during the final of International Masters League between the India Masters and the West Indies Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-vs-chelsea-report-highlights-2694375-2025-03-16",
      "headline": "Arsenal beat Chelsea 1-0 to keep title hopes alive in Premier LeagueArsenal stayed in the hunt of the Premier League by beating Chelsea 1-0 on Sunday, March 16. Mikel Merino scored the winner in what turned out to be a scrappy game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/international-masters-league-final-india-vs-west-indies-sachin-tendulkar-2694371-2025-03-16",
      "headline": "Sachin Tendulkar unleashes classic upper cut as India beat West Indies in IML finalIndia beat West Indies to win the inaugural edition of the International Masters League on Sunday, March 16. The crowd went gaga as Sachin Tendulkar unleashed his sensational upper-cut shot in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-did-not-want-rcb-captaincy-rajat-patidar-2694369-2025-03-16",
      "headline": "Virat Kohli did not want to captain RCB, Rajat was best option: Jitesh SharmaRCB wicketkeeper-batter Jitesh Sharma feels that Virat Kohli did not want to captain the franchise. Jitesh feels that Rajat Patidar was RCB's best option.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-umran-malik-injury-kkr-replcament-chetan-sakariya-2694362-2025-03-16",
      "headline": "Pacer Umran Malik ruled out of IPL 2025, KKR announce replacementKolkata Knight Riders' tearaway pacer Umran Malik has been ruled out of the Indian Premier League's 2025 season. KKR have replaced Umran with Chetan Sakariya.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-corbin-bosch-served-legal-notice-psl-2694360-2025-03-16",
      "headline": "Cricketer in trouble after opting for IPL over PSL: PCB issues legal noticeThe Pakistan Cricket Board (PCB) has issued a legal notice to Corbin Bosch for breaching his contract after he withdrew from the Pakistan Super League (PSL) to join Mumbai Indians as an IPL replacement. This is the first time the PSL window clashes with the IPL.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bcci-nca-doctor-nitin-patel-resigns-vvs-laxman-2694346-2025-03-16",
      "headline": "BCCI Sports Science head resigns, NCA expected to see major changesBCCI's newly inaugurated Centre of Excellence (COE) is set to undergo staff changes after Nitin Patel resigned as head of the Sports Science and Medical team. Additionally, several coaches, including those from NCA, may move on in the coming months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-abishek-porel-axar-patel-rishabh-pant-2694341-2025-03-16",
      "headline": "Dehli Capitals will miss Rishabh Pant: Abishek Porel nostalgic ahead of new seasonDelhi Capitals wicketkeeper-batter Abishek Porel has said that the team will miss Rishabh Pant. In an interview with Sports Today, Porel drew similarities between the captaincies of Rishabh and Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-preview-2694233-2025-03-16",
      "headline": "DC Preview: Delhi Capitals enter Axar Patel era to end title droughtIPL 2025: Delhi Capitals, captained by Axar Patel, will begin their campaign on March 24 against Lucknow Super Giants with the aim of ending their 17-year-long wait to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-regret-rr-2694324-2025-03-16",
      "headline": "MS Dhoni reveals IPL moment he regrets the most: That was a big mistakeMS Dhoni revealed the IPL moment he regrets the most ahead of the start of the 2025 campaign. Dhoni is all set to play his 18th IPL campaign and will be part of CSK once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-shardul-thakur-lsg-training-photo-2694320-2025-03-16",
      "headline": "Shardul Thakur to LSG? All-rounder sparks rumours after photo goes viralMumbai all-rounder Shardul Thakur's photos wearing the Lucknow Super Giants training kit have gone viral. The photos sparked rumours about whether he was going to join the injury-stricken side for the upcoming edition of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-karun-anir-exclusive-delhi-capitals-second-stint-2694306-2025-03-16",
      "headline": "IPL 2025: 'Mature' Karun Nair eager to grab opportunities in second DC stintIn an exclusive interaction with India Today, Karun Nair hopes he can bring in the maturity he has gained in recent times to the IPL during his second stint with the Delhi Capitals. Karun spent 2 seasons with Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-karun-nair-comments-2694293-2025-03-16",
      "headline": "Karun Nair backing on domestic form to conquer IPL 2025Vidarbha batter Karun Nair was roped in by Delhi Capitals ahead of the IPL 2025. Nair hoped to translate his domestic form into the IPL this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-pm-narendra-modi-lex-fridman-podcast-2694290-2025-03-16",
      "headline": "Results reveal who is better: PM Modi on India-Pakistan cricket rivalryPrime Minister Narendra Modi commented on sports and the famous India-Pakistan cricket rivalry on the Lex Fridman podcast. PM Modi also opened up on who he feels is the best footballer of all time. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}