{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunscreen-faceoff-honasa-vs-hul-in-court-over-ad-claims-2710432-2025-04-17",
      "headline": "Sunscreen faceoff: Honasa vs HUL in court over ad claimsThe core of the argument is SPF, the sun protection factor which measures how well a sunscreen protects against harmful UV rays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vijay-kedia-10-red-flags-spot-potential-scam-companies-gensol-fraud-blusmart-shuts-down-2710438-2025-04-17",
      "headline": "Vijay Kedia warns of 10 red flags to spot a potential scam amid Gensol fraudInvestor and market expert Vijay Kedia has warned that Gensol is not the only company with problems amid the findings by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-techie-compares-life-with-rs-25-lakh-in-india-vs-100k-dollars-in-us-2710353-2025-04-17",
      "headline": "Rs 25 lakh in India or $100K in US? Bengaluru techie weighs in on what's betterChoosing to stay in India means staying close to family, celebrating festivals, and living within a culture you know well, said the tech professional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phonepe-rolls-out-upi-circle-simplifies-payments-for-family-and-friends-2710392-2025-04-17",
      "headline": "PhonePe rolls out UPI Circle, simplifies payments for family and friendsUPI Circle is a feature by NPCI (National Payments Corporation of India) where a primary user gives permission to a secondary user to make payments from their UPI account, within set limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-tuhin-kanta-pandey-gensol-fraud-job-is-to-find-and-punish-them-2710390-2025-04-17",
      "headline": "Sebi's job is to find and punish them: Tuhin Kanta Pandey on Gensol fraudThe Securities and Exchange Board of India (Sebi) released an interim order on April 15, stating that Gensol Engineering's promoters, brothers Anmol and Puneet Singh Jaggi, had diverted company funds for personal use. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-700-points-nifty-gains-4-things-to-know-2710369-2025-04-17",
      "headline": "Surprise rally lights up Dalal Street, Sensex jumps 1,500 points. Here's whyShare market today: Despite a slight uptick in volatility, sentiment turned decisively positive as fears around global trade tensions began to fade. Broader market indices joined the rally, reflecting widespread optimism among investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-shuts-operations-sebi-expose-gensol-fraud-anmol-puneet-singh-jaggi-2710342-2025-04-17",
      "headline": "End of the road for BluSmart as Sebi exposes Gensol fraudMany users across Delhi-NCR, Bengaluru, and Mumbai reported that they could no longer book rides through the BluSmart app. The company also sent a notification to users stating that bookings were being temporarily closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-expectations-fy26-outlook-dividend-net-profit-revenue-2710323-2025-04-17",
      "headline": "Infosys Q4 results today: All eyes on FY26 outlook, dividend detailsInfosys Q4FY25 results: As the second-largest software services exporter gears up to release its earnings, investors will be watching closely for guidance on FY26 revenue growth, margins, and management's take on business sentiment in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-shares-hit-5-percent-lower-circuit-for-2nd-straight-day-2710312-2025-04-17",
      "headline": "Gensol Engineering shares hit 5% lower circuit for 2nd straight dayGensol Engineering share price: The stock plunged 5% to Rs 117.50 on the Bombay Stock Exchange (BSE), hitting yet another all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-market-value-stock-crash-148-billion-dollars-gone-trump-china-curbs-explained-2710298-2025-04-17",
      "headline": "Explained: Why Nvidia's market value dropped $148 billion overnightNvidia shares were hit hard in the overnight trading session on Wall Street, falling nearly 7% and losing $148 billion in market value. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/demi-moore-oscars-snub-substance-mikey-madison-anora-2710447-2025-04-17",
      "headline": "Demi Moore finally breaks silence on losing Oscar to Anora star Mikey MadisonDemi Moore, 'The Substance' actor, revealed how she felt after losing the Oscar for Best Actress to Mikey Madison. Mikey bagged the award for her performance in the film 'Anora'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hailee-steinfeld-i-was-a-crybaby-on-last-day-of-shoot-exclusive-2710409-2025-04-17",
      "headline": "Hailee Steinfeld: I was a crybaby on last day of shoot | ExclusiveHailee Steinfeld reflects on her emotional last day on the set of Ryan Coogler's upcoming vampire thriller 'Sinners', where she plays the role of Mary alongside Michael B Jordan. The film, which explores complex character dynamics and personal histories, is set to release in India on April 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-samantha-nazriya-nazim-social-media-absence-emotional-well-being-2710339-2025-04-17",
      "headline": "Parvathy to Samantha, celebs wish Nazriya Nazim healing after emotional postAfter Nazriya Nazim shared a post explaining her social media absence, she received a lot of love from her industry colleagues and fans. Samantha, Parvathy, Tovino Thomas and several others wished her speedy recovery and healing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/youtuber-uncovers-fake-paneer-at-gauri-khan-torii-restaurant-issues-response-2710382-2025-04-17",
      "headline": "YouTuber claims 'fake paneer served' at Gauri Khan's Torii, restaurant reactsA popular YouTuber alleged the use of fake paneer at Gauri Khan's high-end restaurant, Torii. The establishment addressed the claims and issued a response. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sai-tamhankar-mimi-changed-a-lot-of-things-for-me-got-me-more-work-2710378-2025-04-17",
      "headline": "Mimi changed a lot of things for me, it got me more work, says Sai TamhankarSai Tamhankar credits her performance in the film 'Mimi' as a significant career milestone, opening new professional and personal opportunities. The actor shares her journey of evolving through diverse roles and the impact of receiving appreciation for her work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/waves-summit-2025-may-1-to-may-4-in-mumbai-2710380-2025-04-17",
      "headline": "WAVES Summit 2025: Cultivating next-gen filmmaking talent in IndiaWAVES Summit 2025, organised by FICCI and the Ministry of Information & Broadcasting, is set to revolutionise the media and entertainment industry. The event promises to be a landmark for aspiring filmmakers and storytellers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-2-announced-sunny-deol-reunites-with-director-gopichand-malineni-2710375-2025-04-17",
      "headline": "Jaat 2 announced: Sunny Deol reunites with director Gopichand MalineniAfter its successful run, Sunny Deol announced 'Jaat 2'. The actor will be seen reprising his role as Baldev Pratap Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-on-kunal-kamra-row-adds-funny-disclaimer-to-new-video-2710338-2025-04-17",
      "headline": "Varun Grover's witty take on Kunal Kamra row, adds funny disclaimer to new videoComedian Varun Grover humorously addressed the controversy surrounding fellow comedian Kunal Kamra during a recent performance. Kamra faced backlash from Shiv Sena for his parody song mocking Maharashtra's deputy CM Eknath Shinde.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-box-office-collection-day-7-detailed-report-ajith-film-gets-strong-push-ahead-of-2nd-weekend-2710359-2025-04-17",
      "headline": "Good Bad Ugly box office Day 7: Ajith's film gets strong push ahead of 2nd weekendAjith's film 'Good Bad Ugly' is doing good business at the box office, both domestically and worldwide. The film has already emerged as the top Tamil grosser of the year so far, and is only the second film on Ajith's resume in the global Rs 200 crore club. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vincy-aloshious-complaint-shine-tom-chacko-over-alleged-drug-use-and-misconduct-2710351-2025-04-17",
      "headline": "Malayalam actor Vincy accuses Shine Tom Chacko of drug abuse, misconductMalayalam actor Vincy Aloshious filed a complaint against Shine Tom Chacko with the Kerala Film Chamber of Commerce. She had earlier accused her co-star of using drugs on set and misbehaving with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-ishaan-khatter-bhumi-pednekars-coming-of-age-drama-to-release-in-may-2710344-2025-04-17",
      "headline": "The Royals: Ishaan Khatter, Bhumi Pednekar's coming-of-age drama to release in MayIshaan Khatter and Bhumi Pednekar's upcoming series, 'The Royals', is set to premiere on Netflix on May 9. The makers announced the date with a poster.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/logout-review-bbail-khan-gets-likes-followers-subscribers-in-this-tech-thriller-2710319-2025-04-17",
      "headline": "Logout review: Babil Khan gets likes, followers and chaos in tech thrillerReleased-Fri Apr 18, 2025Babil Khan's 'Logout' will stream on Zee5 from April 18 onwards. The thriller offers a chilling commentary on digital obsession and the following psychological unraveling. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-wows-with-shaandaar-performance-seema-singh-daughter-sangeet-karan-johar-sushmita-join-2710293-2025-04-17",
      "headline": "Shahid Kapoor wows with 'Shaandaar' performance at event, KJo and Sushmita joinBollywood star Shahid Kapoor made a memorable appearance at Seema Singh's daughter's sangeet ceremony last night. He entertained the guests with his dance moves to 'Mauja Hi Mauja' and singing 'Shaam Shaandaar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-7-detailed-report-sunny-deol-gets-3rd-biggest-film-of-his-career-after-gadar-2710322-2025-04-17",
      "headline": "Jaat box office Day 7: Sunny Deol gets 3rd biggest film of his career after GadarSunny Deol's 'Jaat' is already the third highest-grossing film of his career after 'Gadar' and 'Gadar 2'. The film is currently running decently in theatres with its seven-day business in the range of Rs 57 crore nett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-malaika-arora-heartwarming-hug-mumbai-event-2710283-2025-04-17",
      "headline": "Kajol and Malaika Arora's heartwarming hug at Mumbai event wins InternetAt a recent Mumbai event, Bollywood stars Kajol and Malaika Arora shared a warm embrace, capturing the attention of fans and media alike. The duo's chemistry was the highlight of the evening, as fans couldn't stop gushing over the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/apoorva-mukhija-vacates-mumbai-home-after-indias-got-latent-row-2710271-2025-04-17",
      "headline": "Apoorva Mukhija hints at vacating Mumbai home after India's Got Latent rowInfluencer and actor Apoorva Mukhija seemed to have moved out of her Mumbai house, months after India's Got Latent controversy. She shared a short video giving a glimpse of the empty house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-roots-for-brother-samay-raina-says-apoorva-mukhija-ashish-chanchlani-him-became-closer-2710243-2025-04-17",
      "headline": "Picture abhi baki hai: Ranveer Allahbadia says 'brother' Samay Raina will be backRanveer Allahbadia conducted an 'Ask Me Anything' session on Instagram addressing the India's Got Latent controversy and the events that followed. He revealed stronger ties with Samay Raina and support for Ashish Chanchlani and Apoorva Mukhija."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-urvashi-kaathal-the-core-kerala-state-film-awards-presentation-2023-2710250-2025-04-17",
      "headline": "Prithviraj and Malayalam celebs honoured at Kerala State Film Awards presentationChief Minister Pinarayi Vijayan presented Kerala State Film Awards (2023) in Thiruvananthapuram on Wednesday. Prithviraj Sukumaran, Urvashi and many others were honoured for their exceptional work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anurag-kashyap-slams-brahmin-outfits-opposing-phule-calls-out-censorship-and-rigged-system-2710197-2025-04-17",
      "headline": "Anurag Kashyap slams Brahmin outfits opposing Phule, calls out rigged systemAnurag Kashyap criticised Brahminical groups for opposing Hindi film 'Phule', highlighting issues of casteism and a compromised system. He questioned the access that fringe groups have to unreleased films and called out censorship practices."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/waqf-act-hearing-supreme-court-order-no-changes-to-existing-rule-waqf-by-user-centre-2710421-2025-04-17",
      "headline": "No waqf appointments, changes to waqf by user till next hearing: Supreme CourtThe Centre assured the Supreme Court that no appointments would be made to Waqf boards. The new law makes it compulsory to include non-Muslims as its members."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-we-are-different-from-hindus-invokes-jinnah-two-nation-theory-2710336-2025-04-17",
      "headline": "We are different from Hindus: Pak Army chief invokes Two-Nation TheoryPakistan's Army chief, General Asim Munir, has urged Pakistanis to pass down the ideology that led to the creation of the Islamic Republic. In a public speech, Munir doubled down on the differences between Hindus and Muslims, as he invoked the Two-Nation Theory, the cornerstone of Pakistan's creation and identity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/bjp-questions-srivilliputhur-temple-gopuram-replica-on-karunanidhis-grave-slams-dmk-tn-govt-symbol-2710381-2025-04-17",
      "headline": "BJP slams Tamil Nadu government using 'temple' logo on Karunanidhi's memorialA replica of a temple structure, similar to that of Srivilliputhur kovil tower, atop M Karunanidhi's memorial has triggered a political row in Tamil Nadu. The BJP accused the ruling DMK of insulting Hindu sentiments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-shuts-operations-sebi-expose-gensol-fraud-anmol-puneet-singh-jaggi-2710342-2025-04-17",
      "headline": "End of the road for BluSmart as Sebi exposes Gensol fraudMany users across Delhi-NCR, Bengaluru, and Mumbai reported that they could no longer book rides through the BluSmart app. The company also sent a notification to users stating that bookings were being temporarily closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-legion-babies-sperm-donation-ashley-st-clair-tiffany-fong-2710364-2025-04-17",
      "headline": "Elon Musk reaches out to women to have babies, wants to build a 'legion': ReportElon Musk, the world's richest man, has offered his sperm to women, used surrogates, and worked secret deals with women to keep his personal affairs out of public view, according to a WSJ report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bengal-teachers-recruitment-scam-supreme-court-partial-relief-untainted-class-9-to-12-fresh-hiring-2710393-2025-04-17",
      "headline": "Supreme Court allows Bengal to retain 'untainted' teachers till fresh selectionThe Supreme Court allowed the West Bengal government to continue the employment of 'untainted' assistant teachers for classes 9-12. The teachers' jobs were terminated earlier this month due to irregularities in the selection process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/doctor-mumtaz-patel-appointed-president-royal-college-of-physicians-uk-daughter-indian-immigrants-2710345-2025-04-17",
      "headline": "First Indian-origin woman elected President of UK's Royal College of PhysiciansMumtaz Patel became the first British-Indian woman to be elected the President of the Royal College of Physicians (RCP). She will be just the fourth woman head in the RCP's 500-year history. The Indo-British Muslim doctor was awarded the Outstanding Leader Award last year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/youtuber-uncovers-fake-paneer-at-gauri-khan-torii-restaurant-issues-response-2710382-2025-04-17",
      "headline": "YouTuber claims 'fake paneer served' at Gauri Khan's Torii, restaurant reactsA popular YouTuber alleged the use of fake paneer at Gauri Khan's high-end restaurant, Torii. The establishment addressed the claims and issued a response. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/meerut/story/uttar-pradesh-meerut-man-killed-by-wife-her-lover-duo-stage-snakebite-to-cover-up-crime-2710350-2025-04-17",
      "headline": "Man's 'snakebite' death turns out to be murder by wife, her loverAfter initially being believed to have died from a snakebite, a man's death in Meerut took a dark turn when police revealed that his wife had confessed to murdering him with the help of her lover, after he discovered their illicit relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-get-land-99-paise-andhra-pradesh-visakhapatnam-nara-lokesh-it-hub-growth-promotion-2710238-2025-04-17",
      "headline": "TCS gets 21 acres in Visakhapatnam for just 99 paise as Andhra bets big on techThe cabinet of Andhra Pradesh cleared the proposal on Tuesday, stating that the project is expected to bring in an investment of around Rs 1,370 crore and create nearly 12,000 jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anurag-kashyap-slams-brahmin-outfits-opposing-phule-calls-out-censorship-and-rigged-system-2710197-2025-04-17",
      "headline": "Anurag Kashyap slams Brahmin outfits opposing Phule, calls out rigged systemAnurag Kashyap criticised Brahminical groups for opposing Hindi film 'Phule', highlighting issues of casteism and a compromised system. He questioned the access that fringe groups have to unreleased films and called out censorship practices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-suicide-madhya-pradesh-blames-wife-in-laws-viral-video-2710242-2025-04-17",
      "headline": "Man dies by suicide in Madhya Pradesh, blames wife and in-laws in viral videoA 32-year-old man in Madhya Pradesh died by suicide, blaming his wife and in-laws in videos shared before his death. Police have registered an accidental death report and begun investigation.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-no-police-protection-marriage-against-parents-wish-2710258-2025-04-17",
      "headline": "No protection for those marrying against parents' wish: Allahabad High CourtThe Allahabad High Court ruled that couples marrying against their parents' wishes cannot demand police protection as a right unless there's a real threat to their safety. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-fan-wheelchair-selfie-airport-video-2710396-2025-04-17",
      "headline": "Watch: MS Dhoni stops to take selfie with fan in wheelchair amid airport securityIPL2025: Chennai Super Kings captain MS Dhoni took time out to meet and greet a fan in a wheelchair while heading out of an airport. Dhoni's heartwarming gesture has been appreciated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-throw-2025-potch-invitational-event-south-africa-2710249-2025-04-17",
      "headline": "Watch: Neeraj Chopra begins 2025 season with winning throw at South Africa eventAhead of next month's Doha Diamond League, Neeraj Chopra competed in an invitational event in Potchefstroom, South Africa. Neeraj topped a six-man field with a best effort of 84.52m on Wednesday, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/blusmart-stops-booking-this-is-what-happens-to-money-in-blu-cab-wallet-delhi-ncr-bengaluru-mumbai-2710356-2025-04-17",
      "headline": "What happens to BluSmart wallet money as cab company suspends bookingsBluSmart users across Delhi-NCR, Bengaluru, and Mumbai reported they could no longer book rides through its app as the cab company seemed to have temporarily suspended its services. BluSmart users are worried about the unused money in their app wallets. This is what BluSmart is saying about refunding wallet money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/telugu-employees-fannie-mae-mass-firing-indian-american-lawmaker-demands-explanation-2710358-2025-04-17",
      "headline": "Mass lay-offs of Telugu employees in US: Indian-American lawmakers seek actionAmerican mortgage giant Fannie Mae fired 200 employees, the majority of them Telugus, on \"ethical grounds\". The allegation is that they were involved in a salary scam. Three Indian-American lawmakers have now taken up their fight and sought an explanation from the American company over the mass sacking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-sack-coaches-abhishek-nayar-t-dilip-bgt-australia-series-loss-2710286-2025-04-17",
      "headline": "Team India's batting, fielding coaches sacked after Australia series debacleThe Board of Control for Cricket in India (BCCI) has removed assistant coach Abhishek Nayar, along with fielding coach T. Dilip and strength and conditioning coach Soham Desai, from their roles after India's 1-3 series loss in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-on-kunal-kamra-row-adds-funny-disclaimer-to-new-video-2710338-2025-04-17",
      "headline": "Varun Grover's witty take on Kunal Kamra row, adds funny disclaimer to new videoComedian Varun Grover humorously addressed the controversy surrounding fellow comedian Kunal Kamra during a recent performance. Kamra faced backlash from Shiv Sena for his parody song mocking Maharashtra's deputy CM Eknath Shinde.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-palm-print-found-in-actors-building-matches-with-accused-2710408-2025-04-17",
      "headline": "Saif Ali Khan attack: Palm print found in actor's building matches with accusedAccording to the report submitted by the Director of the Fingerprint Bureau, one of the three chance prints lifted from the building was a complete match with the left palm of Mohammad Shariful Islam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/royal-challengers-bengaluru-ipl-sues-uber-viral-ad-travis-head-delhi-high-court-2710387-2025-04-17",
      "headline": "RCB sues Uber over viral 'Hyderabaddie' ad featuring Travis HeadRCB, in its petition before the Delhi High Court, alleged that Uber disparaged its trademark in its YouTube ad, 'Baddies in Bengaluru ft. Travis Head'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-harvard-university-row-enroll-foreign-students-2710327-2025-04-17",
      "headline": "Harvard may lose ability to enroll foreign students if...: Trump's big warningThe Trump administration has warned Harvard University to accept its new policy or risk losing the ability to enroll foreign students. \r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-ishan-kishan-300-obsession-not-fixated-2710464-2025-04-17",
      "headline": "Ishan Kishan not fixated on SRH's 300-run dreamDespite Sunrisers Hyderabad's open ambition to breach the 300-run barrier, Ishan Kishan insists there's no obsession with the number. For him, the priority remains team performance over milestones or individual landmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-bcci-assistant-coach-sacking-scapegoat-fans-reaction-2710469-2025-04-17",
      "headline": "Abhishek Nayar made scapegoat? Sacking of India assistant coach shocks fansThe sacking of Abhishek Nayar, India's assistant coach, just eight months into his tenure has not gone down well with a section of fans. The former Mumbai all-rounder has become the first casualty of the BCCI's review meeting following India's disastrous Test tour of Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-captaincy-delhi-capitals-template-2710461-2025-04-17",
      "headline": "Axar Patel relishing DC captaincy in IPL 2025: I don't go by the templateDelhi Capitals captain Axar Patel is enjoying his captaincy, especially after leading his side to the top of the IPL 2025 points table following a thrilling Super Over victory over Rajasthan Royals at the Arun Jaitley Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-munaf-patel-bcci-fine-viral-video-heated-argument-umpire-2710423-2025-04-17",
      "headline": "BCCI penalises Delhi Capitals bowling coach Munaf Patel. Here's whyIPL 2025: Delhi Capitals bowling coach Munaf Patel was seen arguing with the fourth umpire from near the boundary rope during the team's thrilling win over Rajasthan Royals on Wednesday, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-dodgers-vs-rockies-treasure-performs-tommy-edman-shares-unforgettable-moment-glbs-2710402-2025-04-17",
      "headline": "MLB Dodgers vs Rockies: Treasure performs, Tommy Edman shares unforgettable momentKorean pride and baseball passion came together at Dodger Stadium during the Los Angeles Dodgers' 8-7 win over the Colorado Rockies on Wednesday night, April 16. South Korean boy band Treasure ignited the crowd at Centerfield Plaza. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-fan-wheelchair-selfie-airport-video-2710396-2025-04-17",
      "headline": "Watch: MS Dhoni stops to take selfie with fan in wheelchair amid airport securityIPL2025: Chennai Super Kings captain MS Dhoni took time out to meet and greet a fan in a wheelchair while heading out of an airport. Dhoni's heartwarming gesture has been appreciated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-match-preview-predicted-xi-weather-prediction-2710389-2025-04-17",
      "headline": "MI vs SRH, Match preview: Mount 300 in-sight as heavy-hitting sides faceoffIPL 2025, MI vs SRH Match Preview: With both teams packed with explosive hitters and eyeing momentum, MI vs SRH at Wankhede could turn into a run-fest. If the stars align, IPL 2025 might just witness its first 300-run innings on April 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-women-contract-jess-jonassen-tess-flintoff-2710340-2025-04-17",
      "headline": "Jess Jonassen left out, Flintoff earns maiden Cricket Australia women's contractCricket Australia (CA) has unveiled its new 18-player women's national contract list for the 2025-26 season. Veteran all-rounder Jess Jonassen has been left out of the updated list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-heats-dominate-bulls-while-mavericks-edge-out-kings-glbs-2710343-2025-04-17",
      "headline": "NBA Play-in tournament: Heat dominate Bulls while Mavericks edge out KingsThe Dallas Mavericks and the Miami Heat kept their chances alive for the playoffs after winning their respective games on Wednesday night, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-mumbai-indians-batter-naman-dhir-press-conference-2710326-2025-04-17",
      "headline": "Hardik, Pollard have helped me stay calm under pressure: Naman DhirIPL 2025, MI vs SRH: In the pre-match press conference, Naman Dhir said that Hardik Pandya and Kieron Pollard have helped him learn the art of staying calm under pressure while batting at No.6 and 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-axar-patel-yashasvi-jaiswal-super-over-snub-2710321-2025-04-17",
      "headline": "Did RR choose wrong batters for Super Over? DC captain Axar Patel surprisedIPL 2025: Axar Patel revealed DC were prepared for Jaiswal in the Super Over and were surprised when RR didn't send him out. Their decision backfired, as Rahul and Stubbs sealed a smooth chase for DC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-match-preview-predicted-xi-weather-prediction-2710389-2025-04-17",
      "headline": "MI vs SRH, Match preview: Mount 300 in-sight as heavy-hitting sides faceoffIPL 2025, MI vs SRH Match Preview: With both teams packed with explosive hitters and eyeing momentum, MI vs SRH at Wankhede could turn into a run-fest. If the stars align, IPL 2025 might just witness its first 300-run innings on April 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-women-contract-jess-jonassen-tess-flintoff-2710340-2025-04-17",
      "headline": "Jess Jonassen left out, Flintoff earns maiden Cricket Australia women's contractCricket Australia (CA) has unveiled its new 18-player women's national contract list for the 2025-26 season. Veteran all-rounder Jess Jonassen has been left out of the updated list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-play-in-tournament-heats-dominate-bulls-while-mavericks-edge-out-kings-glbs-2710343-2025-04-17",
      "headline": "NBA Play-in tournament: Heat dominate Bulls while Mavericks edge out KingsThe Dallas Mavericks and the Miami Heat kept their chances alive for the playoffs after winning their respective games on Wednesday night, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-srh-mumbai-indians-batter-naman-dhir-press-conference-2710326-2025-04-17",
      "headline": "Hardik, Pollard have helped me stay calm under pressure: Naman DhirIPL 2025, MI vs SRH: In the pre-match press conference, Naman Dhir said that Hardik Pandya and Kieron Pollard have helped him learn the art of staying calm under pressure while batting at No.6 and 7.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-axar-patel-yashasvi-jaiswal-super-over-snub-2710321-2025-04-17",
      "headline": "Did RR choose wrong batters for Super Over? DC captain Axar Patel surprisedIPL 2025: Axar Patel revealed DC were prepared for Jaiswal in the Super Over and were surprised when RR didn't send him out. Their decision backfired, as Rahul and Stubbs sealed a smooth chase for DC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/bcci-sacks-4-support-staff-members-after-bad-performance-in-border-gavaskar-trophy-2710315-2025-04-17",
      "headline": "BCCI sacks 4 support staff members after bad performance in Border–Gavaskar TrophyThe BCCI has removed four support staff members from the Indian cricket team following the 3-1 loss in the Border Gavaskar Trophy. Those removed include batting coach Abhishek Nair, fielding coach T Dilip, and strength and conditioning coach Soham Desai. This action comes amid reports of rifts within the team and concerns about discipline. The BCCI has not immediately announced replacements for the removed staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-rr-nitish-rana-press-conference-super-over-loss-2710308-2025-04-17",
      "headline": "Credit to Starc but saliva makes a lot of difference: Nitish on Super Over lossRajasthan Royals batter Nitish Rana credited Mitchell Starc for his sensational 20th over but added that the return of saliva has made a massive difference to the game.\r\n\r\n\"We had our moments, but Starc was ice cold under pressure...to execute 11 out of the 12 yorkers he bowled perfectly at 145 Km/hr with the ball reversing, you have to give him the due credit\", Rana said in the post match press conference.\r\n\r\nRajasthan Royals batter Nitish Rana credited Mitchell Starc for his sensational 20th over but added that the return of saliva had made a massive difference to the game.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-kl-rahul-yashasvi-jaiswal-wicket-kuldeep-yadav-watch-video-2710303-2025-04-17",
      "headline": "Watch: DC's KL Rahul calls out Yashasvi Jaiswal's dismissal by Kuldeep YadavFrom calling Jaiswal's dismissal behind the stumps to anchoring the Super Over finish, KL Rahul's all-round game awareness proved decisive. His brilliance helped Delhi Capitals seal a thrilling win against Rajasthan Royals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/axar-patel-provides-update-on-kuldeep-yadav-praises-starc-after-dc-win-super-over-2710285-2025-04-17",
      "headline": "Axar Patel provides update on Kuldeep, praises Starc after DC win Super OverDelhi Capitals captain Axar Patel said that he was enjoying his leadership stint in IPL 2025 while providing update on Kuldeep Yadav's injury sustained during the Super Over win over Rajasthan Royals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-sack-coaches-abhishek-nayar-t-dilip-bgt-australia-series-loss-2710286-2025-04-17",
      "headline": "Team India's batting, fielding coaches sacked after Australia series debacleThe Board of Control for Cricket in India (BCCI) has removed assistant coach Abhishek Nayar, along with fielding coach T. Dilip and strength and conditioning coach Soham Desai, from their roles after India's 1-3 series loss in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-nitish-rana-breaks-silence-super-over-snub-2710276-2025-04-17",
      "headline": "Nitish Rana breaks silence on Super Over snub vs DC: All decisions were rightDespite being RR's top performer with the bat, Nitish Rana stood by the management's call to send Riyan Parag and Shimron Hetmyer for the Super Over. RR's decisions in the key clash sparked criticism after DC clinched a tense win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-ali-apologises-for-king-kar-lega-remark-for-babar-azam-2710185-2025-04-17",
      "headline": "Watch: Hasan Ali apologises for 'King kar lega' remark to Babar AzamPakistan fast bowler Hasan Ali has apologised for his 'King Kar Lega' remark to Babar Azam in 2023. The fast bowler plays for Karachi Kings in the Pakistan Super League 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-throw-2025-potch-invitational-event-south-africa-2710249-2025-04-17",
      "headline": "Watch: Neeraj Chopra begins 2025 season with winning throw at South Africa eventAhead of next month's Doha Diamond League, Neeraj Chopra competed in an invitational event in Potchefstroom, South Africa. Neeraj topped a six-man field with a best effort of 84.52m on Wednesday, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-sack-coaches-abhishek-nayar-t-dilip-bgt-australia-series-loss-2710286-2025-04-17",
      "headline": "Team India's batting, fielding coaches sacked after Australia series debacleThe Board of Control for Cricket in India (BCCI) has removed assistant coach Abhishek Nayar, along with fielding coach T. Dilip and strength and conditioning coach Soham Desai, from their roles after India's 1-3 series loss in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-nitish-rana-breaks-silence-super-over-snub-2710276-2025-04-17",
      "headline": "Nitish Rana breaks silence on Super Over snub vs DC: All decisions were rightDespite being RR's top performer with the bat, Nitish Rana stood by the management's call to send Riyan Parag and Shimron Hetmyer for the Super Over. RR's decisions in the key clash sparked criticism after DC clinched a tense win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasan-ali-apologises-for-king-kar-lega-remark-for-babar-azam-2710185-2025-04-17",
      "headline": "Watch: Hasan Ali apologises for 'King kar lega' remark to Babar AzamPakistan fast bowler Hasan Ali has apologised for his 'King Kar Lega' remark to Babar Azam in 2023. The fast bowler plays for Karachi Kings in the Pakistan Super League 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-throw-2025-potch-invitational-event-south-africa-2710249-2025-04-17",
      "headline": "Watch: Neeraj Chopra begins 2025 season with winning throw at South Africa eventAhead of next month's Doha Diamond League, Neeraj Chopra competed in an invitational event in Potchefstroom, South Africa. Neeraj topped a six-man field with a best effort of 84.52m on Wednesday, April 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-arsenal-bayern-munich-vs-inter-milan-2710241-2025-04-17",
      "headline": "UCL: Real Madrid's 'remontada' fails vs Arsenal, Bayern fall to InterA night of contrasting emotions in Europe — Real Madrid's fabled comebacks fell flat, and Thomas Müller bid a tearful goodbye to Champions League glory as Arsenal and Inter Milan marched into the semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-mitchell-starc-diagrees-salaiva-game-changer-super-over-2710228-2025-04-17",
      "headline": "Saliva a game changer in IPL 2025? Starc disagrees after Super Over heroicsIPL 2025, DC vs RR: Mitchell Starc said he prefers using sweat over saliva on the red-ball. On Wednesday, Starc helped the Delhi Capitals beat the Rajasthan Royals in the Super Over clash at the Arun Jaitley Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-naman-dhir-press-conference-2710201-2025-04-17",
      "headline": "Naman Dhir welcomes dry ball rule as relief for bowlersIPL 2025, MI vs SRH: In the pre-match press conference, Naman Dhir said that the introduction of the second ball has helped bowlers mostly because of dew playing big part in matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-axar-patel-mitchell-starc-super-over-dc-vs-rr-2710193-2025-04-17",
      "headline": "12 yorkers in 12 balls: Axar in awe of Starc after Super Over winIPL 2025, DC vs RR: Axar Patel heaped praise on Mitchell Starc, who won the Player of the Match award after Delhi Capitals beat Rajasthan Royals in the Super Over on Wednesday at the Arun Jaitley Stadium in New Delhi.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-on-mitchell-starcs-genius-after-losing-super-over-dc-vs-rr-2710190-2025-04-17",
      "headline": "DC vs RR: Sanju Samson doffs his hat to Mitchell Starc's genius after losing Super OverRajasthan Royals (RR) captain Sanju Samson was left in awe of Delhi Capitals speedster Mitchell Starc following their loss in the super over in Match 32 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-rr-super-over-delhi-thriller-highlights-2710184-2025-04-16",
      "headline": "Delhi Capitals reclaim top spot after Super Over thriller vs RoyalsIPL 2025, DC vs RR: Delhi Capitals edged past Rajasthan Royals in a thriller after the match on Wednesday at the Arun Jaitley Stadium in New Delhi went right down to the Super Over. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-bat-size-check-controversy-dc-vs-rr-2710158-2025-04-16",
      "headline": "IPL 2025: Parag uses same bat after umpire struggles to pass it through gaugeRajasthan Royals (RR) batter Riyan Parag's bat failed to pass through the measuring gauge against Delhi Capitals (DC) during Match 32 of the Indian Premier League 2025 (IPL 2025). However, he was still allowed to use it during his innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sanju-samson-dc-vs-rr-injury-2710155-2025-04-16",
      "headline": "Sanju Samson walks off retired hurt in major injury scare for RRIPL 2025, DC vs RR: Sanju Samson faced discomfort while batting in the match against Delhi Capitals and had to retire hurt after scoring 31 runs off 19 balls with two fours and three sixes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-collabs-with-lionel-messi-in-new-ad-shows-off-football-skills-2710141-2025-04-16",
      "headline": "Watch: MS Dhoni collabs with Lionel Messi in new ad, shows off football skillsLegendary India cricketer MS Dhoni was seen collaborating with football icon Lionel Messi in a new advertisement where the duo were seen showing off their football skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-noor-ahmad-rashid-khan-sarandeep-singh-afghanistan-2710113-2025-04-16",
      "headline": "Noor has the potential to lead Afghanistan's spin attack: Ex-India spinnerIPL 2025: Former Indian off-spinner Sarandeep Singh said that Noor Ahmad has bowled brilliantly in the ongoing tournament and could go on to become the lead spinner of the Afghanistan team in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-daniel-vettori-on-bat-size-check-srh-vs-mi-2710072-2025-04-16",
      "headline": "Wish they checked bats, when I was playing: Daniel Vettori's hilarious takeSunrisers Hyderabad (SRH) head coach Daniel Vettori made a hilarious comment on frequent bat checks in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/karun-nair-seen-frustrated-in-dressing-room-after-three-ball-duck-vs-rr-2710086-2025-04-16",
      "headline": "IPL 2025: Karun Nair seen frustrated in dressing room after three-ball duck vs RRDelhi Capitals' (DC) Karun Nair seemed frustrated in the dressing room after getting out for three-ball duck against Rajasthan Royals (RR) in Match 32 of the Indian Premier League 2025 (IPL 2025). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}