{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-worst-stock-market-crashes-from-covid-19-to-trump-tariffs-april-7-black-monday-2705192-2025-04-07",
      "headline": "India's worst stock market crashes: From Covid-19 to Trump tariffsOn Monday, April 7, the Indian stock market faced one of its biggest falls since June 2024. The Sensex fell nearly 4,000 points, while the Nifty 50 slipped below 21,750, dragging down investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-crashes-3000-points-nifty-tumbles-sharply-sectors-hit-hardest-in-stock-market-bloodbath-2705188-2025-04-07",
      "headline": "Stock market crash: Which sectors have been hit hardest today?All sectors ended deep in the red, triggering sharp wealth erosion for investors. Some bore steeper losses than others. Here's a breakdown of the hardest-hit sectors in today's session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-fall-10-percent-why-reason-stock-market-crash-2705154-2025-04-07",
      "headline": "Explained: Why Tata Motors share price fell 10% todayTata Motors share price: Tata Motors' stock has seen a steady decline over the past few months. It has fallen by 17.12% in the last five trading days alone. In the past six months, the stock is down by 39.42%. Over the last one year, it has lost 44.50% of its value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-down-3000-points-5-things-to-know-2705148-2025-04-07",
      "headline": "Sensex plunges 3,000 points: 5 reasons behind stock market crashShare market crash: Dalal Street is facing its worst trading session in a year, as Donald Trump's tariff shock has sparked a global rout and reignited fears of a looming recession."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-crash-rs-19-lakh-crore-investor-wealth-gone-no-gainers-sensex-nifty-bloodbath-dalal-street-trump-tariff-2705134-2025-04-07",
      "headline": "Rs 19 lakh crore wealth wiped out on Dalal Street; no stock trades in greenThe sharp fall in the stock market followed a global selloff triggered by rising trade tensions and growing fears of a recession in the United States. Markets around the world have come under pressure, and Indian stocks were no exception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-stock-market-crash-india-japan-taiwan-us-donald-trump-reciprocal-tariffs-2705124-2025-04-07",
      "headline": "Global stock markets crash as Donald Trump's tariff tsunami wipes trillionsDonald Trump's tariff salvo has triggered a global market meltdown, leaving investors rattled and economies on edge. Here's how markets from Wall Street to Asia are reacting to the unfolding chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-crashes-nearly-3000-points-nifty-plunges-1000-points-on-donald-trumps-tariffs-2705119-2025-04-07",
      "headline": "Sensex falls to 10-month low, Rs 19 lakh crore wiped out amid Trump tariff shockShare market crash: With today's stock market plunge, the Sensex and Nifty have fallen to their lowest levels in approximately 10 months, and analysts suggest that they could fall further due to massive volatility in global markets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-april-7-shares-in-focus-today-tata-motors-itc-lt-nykaa-indusind-bank-2705111-2025-04-07",
      "headline": "Stocks to watch on April 7: Tata Motors, ITC, L&T, Nykaa, IndusInd BankShares of firms such as Tata Motors, ITC, L&T, Nykaa, IndusInd Bank, Mazagon Dock Shipbuilders, TVS, Bajaj Housing Finance, YES Bank etc. will be in focus today due to important developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/asian-markets-plunge-as-trump-tariffs-spark-global-sell-off-nikkei-dives-nearly-8-per-cent-glbs-2705084-2025-04-07",
      "headline": "Asian markets plunge as Trump tariffs spark global sell-off; Nikkei dives nearly 8%Asian markets tumbled sharply following Wall Street's crash, triggered by Trump's tariff escalation and Beijing's retaliation. Japan's Nikkei led the losses, diving nearly 8%, as recession fears gripped investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/asian-markets-plunge-as-investors-anticipate-us-rate-cuts-amid-trade-war-2705083-2025-04-07",
      "headline": "Asian markets suffer huge plunge as Trump's tariffs make Wall Street bleedFutures markets moved swiftly to price in almost five-quarter-point cuts in US rates this year, pulling Treasury yields down sharply and hampering the dollar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/black-monday-us-jim-cramer-expert-warns-donald-trump-tariffs-could-trigger-worst-crash-since-1987-2704742-2025-04-06",
      "headline": "'Black Monday': US expert warns Trump tariffs could trigger worst crash since 1987Jim Cramer warned that markets might face a bloodbath similar to 1987 - when the Dow Jones suffered its biggest single-day crash to date. He claimed that if the US President didn't 'reach out' to nations which have not imposed retaliatory tariffs and reward them for their compliance, the situation could worsen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-helpline-startups-dukandari-jibe-innovation-startup-maha-kumbh-event-2704717-2025-04-06",
      "headline": "Piyush Goyal announces helpline for startups days after 'dukandari' jibe at themDays after questioning the innovation of Indian startups overtly focussing on food delivery and betting and fantasy sports apps, Commerce and Industry Minister Piyush Goyal announced a helpline for startups if they wanted to make suggestions or file complaints."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karma-kdrama-review-park-hae-soo-shin-min-a-lee-kwang-soo-show-is-sharp-2705206-2025-04-07",
      "headline": "Karma review: A sharp, gritty tangle of fate and retributionReleased-Fri Apr 04, 2025Karma Kdrama review: The series delves into the intricacies of fate intertwined with retribution in a sharp and gritty narrative. Itmasterfully portrays the consequences of actions through its compelling storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-wife-tahira-kashyap-suffers-breast-cancer-relapse-after-7-years-still-got-this-2705205-2025-04-07",
      "headline": "Tahira Kashyap suffers breast cancer relapse after 7 years: Still got thisTahira Kashyap said she's 'still got this' while expressing her positive outlook towards life in a post mentioning her battle with breast cancer for the second time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-joins-sons-taimur-jeh-at-football-match-chats-with-fans-2705201-2025-04-07",
      "headline": "Kareena Kapoor joins sons Taimur, Jeh at football match, chats with fansActor Kareena Kapoor Khan accompanied her sons, Taimur and Jeh, to a football match on Sunday. There, she not only greeted several fans but also took the time to interact with them and sign autographs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-slams-fan-for-questioning-age-gap-between-her-and-mohanlal-2705197-2025-04-07",
      "headline": "Malavika Mohanan slams fan for questioning age gap between her and MohanlalActor Malavika Mohanan has slammed the internet for raising questions about her and co-star Mohanlal's age gap. The two will soon be seen sharing screen space in the Malayalam film Hridayapoorvam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-idol-15-winner-manasi-ghosh-want-to-collab-with-ar-rahman-sonu-nigam-2705195-2025-04-07",
      "headline": "Indian Idol 15 winner Manasi Ghosh: Want to collab with AR Rahman, Sonu NigamKolkata's Manasi Ghosh was crowned the winner of Indian Idol 15 on Sunday. In an exclusive chat, she shared her aspirations of collaborating with music legends like AR Rahman and Sonu Nigam. She emphasised her journey of hard work, diverse singing capabilities, and future plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-loses-cool-at-elderly-fan-during-manoj-kumars-prayer-meet-2705159-2025-04-07",
      "headline": "Jaya Bachchan loses cool at elderly fan during Manoj Kumar's prayer meetAt the prayer tribute for the late Manoj Kumar in Mumbai, a video of Jaya Bachchan's interaction with an elderly woman went viral, sparking reactions on social media. The veteran actor appeared miffed when the fan requested a photo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-thudaram-locks-april-release-actor-unveils-new-poster-2705155-2025-04-07",
      "headline": "Mohanlal's Thudaram locks April release, actor unveils new posterAfter Empuraan, Mohanlal is set to star in the family-drama Thudaram. Directed by Tharun Moorthy, the film will release in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/test-madhavan-nayanthara-siddharth-moral-super-over-netflix-2705150-2025-04-07",
      "headline": "No heroes, No villains: Test examines life's morality in thrilling Super OverMadhavan, Nayanthara and Siddharth-starrer 'Test' is an intense drama exploring the morality of the lead characters. The film is streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-collection-day-8-detailed-report-salman-khan-biggest-dip-so-far-even-behind-jai-ho-2705147-2025-04-07",
      "headline": "Sikandar box office Day 8: Salman Khan's biggest dip so far, even behind Jai Ho'Sikandar' is Salman Khan's 18th film to enter the Rs 100 cror-club. It is, however, the lowest Rs 100 crore grosser on that list. The film collected Rs 102.25 crore after eight days domestically. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dia-mirza-hits-back-at-revanth-reddy-over-use-of-ai-clip-on-gachibowli-tree-felling-2705125-2025-04-07",
      "headline": "Dia Mirza blasts Revanth Reddy for AI clip charge on tree felling: Verify factsBollywood actor Dia Mirza has refuted claims by the Telangana Chief Minister that she shared AI-generated fake videos of tree felling in Gachibowli. She urged the CM to verify the facts before making accusations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samay-raina-tony-kakkar-new-song-indias-got-latent-row-2705132-2025-04-07",
      "headline": "Comic Samay Raina reacts to Tony Kakkar's new song with an emotional audio noteStand-up comedian Samay Raina thanked singer Tony Kakkar in an emotional audio note, after he released a song titled Shat Pratishat. The song is seemingly a reply to trolls who attacked Raina and his sister, Neha Kakkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-collection-day-11-detailed-report-mohanlal-film-unshaken-global-run-amid-controversy-nears-rs-100-crore-domestically-2705128-2025-04-07",
      "headline": "Empuraan box office Day 11: Mohanlal's film's unshaken global run amid controversy'L2: Empuraan' is only Rs 2 crore short of hitting a century at the domestic box office. However, the Mohanlal-starrer has already emerged as the highest-grossing Malayalam film of all time globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jasleen-royal-breaks-down-into-tears-after-coldplay-concert-i-swear-ill-die-2705115-2025-04-07",
      "headline": "I swear I'll die: Jasleen Royal breaks down into tears after Coldplay concertAfter facing backlash from a Coldplay concert, singer Jasleen Royal reveals she isn't formally trained. She shares her emotional struggle and determination to continue her musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-mother-mallika-on-income-tax-notice-to-her-son-amid-empuraan-political-row-we-are-not-afraid-2705114-2025-04-07",
      "headline": "We are not afraid: Prithviraj Sukumaran's mother on tax notice amid Empuraan row'Empuraan' director Prithviraj Sukumara was issued an income tax notice last week - a development that followed the political controversy that erupted over the film's original content. The actor-director's mother reacted to the issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sreeleela-shocked-fan-pull-her-into-crowd-kartik-aaryan-2705107-2025-04-07",
      "headline": "Scene or fan encounter? Man grabs Sreeleela as Kartik walks away in viral videoIn a viral video, actor Sreeleela can be seen being forcibly dragged by a fan. However, the internet is now curious if this was a scene from a film or a shocking fan encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-birthday-with-vijay-deverakonda-fans-think-so-2705106-2025-04-07",
      "headline": "Did Rashmika Mandanna ring in her birthday with Vijay Deverakonda? Fans think soRashmika Mandanna rang in her 29th birthday on April 5. After sharing a few glimpses from her birthday bash in Oman, fans began assuming that Vijay Deverakonda was with her, and here's why. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-cutout-collapses-tirunelveli-theatre-panic-good-bad-ugly-release-2705082-2025-04-07",
      "headline": "Ajith Kumar's huge cut-out collapses causing panic among fans. Viral VideoA towering banner of Ajith Kumar collapsed at a Tirunelveli theatre in Tamil Nadu on April 6. A video of fans fleeing from the theatre has now emerged on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kolkatas-manasi-ghosh-wins-indian-idol-15-takes-home-rs-25-lakh-2705052-2025-04-06",
      "headline": "Kolkata's Manasi Ghosh wins Indian Idol 15, takes home Rs 25 lakhThe winner of Indian Idol 15 is Manasi Ghosh from Kolkata. She not only won the trophy but also took home a brand-new car along with prize money of Rs 25 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jujutsu-kaisen-premiere-indian-tv-when-where-to-watch-it-2705012-2025-04-06",
      "headline": "Jujutsu Kaisen on Indian television: When, where to watch the anime on TVJujutsu Kaisen is set to premiere on Indian television, airing weekdays at 9:00 pm\r\n IST on Sony YAY! with Hindi and Tamil dubs. This marks its TV debut in India."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-meets-sacked-teachers-supreme-court-verdict-wbssc-exam-recruitment-bjp-marches-to-her-residence-2705213-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I can be jailed but..: Mamata Banerjee vows to back sacked Bengal teachersThe Supreme Court's April 3 verdict cited large-scale irregularities and fraud in the recruitment process, leading to the dismissal of thousands of teachers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-crashes-nearly-3000-points-nifty-plunges-1000-points-on-donald-trumps-tariffs-2705119-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex falls to 10-month low, Rs 19 lakh crore wiped out amid Trump tariff shockShare market crash: With today's stock market plunge, the Sensex and Nifty have fallen to their lowest levels in approximately 10 months, and analysts suggest that they could fall further due to massive volatility in global markets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-home-minister-g-parameshwara-bengaluru-woman-molested-street-2705193-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tends to happen in a big city: Karnataka minister on woman molested on streetCCTV footage went viral on social media last week showing a man groping a woman on a street in Bengaluru. The Home Minister directed the police to increase beat patrolling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-counter-tariffs-us-donald-trump-bilateral-trade-agreement-2705105-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India to refrain from counter-tariffs on US despite market meltdown: ReportIndia is unlikely to impose counter-tariffs on the US  and is banking on a key clause in the executive order signed by Donald Trump last week. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/hypocrites-indian-origin-techie-confronts-microsoft-bosses-quits-over-gaza-2705109-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Hypocrites': Indian-origin techie confronts Microsoft bosses, quits over GazaFollowing the confrontation, Vaniya Agrawal dropped a scathing resignation letter, stating that her last day at the office would be April 11. She said she could no longer be part of an organisation that empowers 'oppressors' instead of the oppressed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-today-sensex-down-3000-points-5-things-to-know-2705148-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex plunges 3,000 points: 5 reasons behind stock market crashShare market crash: Dalal Street is facing its worst trading session in a year, as Donald Trump's tariff shock has sparked a global rout and reignited fears of a looming recession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-tariffs-effect-vietnam-taiwan-indonesia-china-india-2705140-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Are Trump's tariffs working? Vietnam, Taiwan offer zero duty on US importsTrump tariffs: Vietnam and Taiwan, among the countries to face the steepest US reciprocal tariffs, have offered to eliminate all levies as the basis for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/sndp-yogam-vellapally-natesan-calls-malappuram-different-country-iuml-sadiq-thangal-reacts-2705145-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala Hindu group leader calls Muslim-majority district 'different country'SNDP yogam general secretary Vellappally Natesan sparked controversy by calling Kerala's Muslim-majority district Malappuram \"a different country\". This drew sharp reactions from IUML and others, even as he defended his remarks and accused critics of misrepresenting his intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-wife-tahira-kashyap-suffers-breast-cancer-relapse-after-7-years-still-got-this-2705205-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tahira Kashyap suffers breast cancer relapse after 7 years: Still got thisTahira Kashyap said she's 'still got this' while expressing her positive outlook towards life in a post mentioning her battle with breast cancer for the second time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/piyush-goyal-battle-startups-engage-in-just-to-survive-indian-ecosystem-murtaza-amin-x-post-it-burhanpur-mp-2704852-2025-04-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Startup founder from Burhanpur, MP, pours his heart out to Piyush Goyal | OpinionAfter Commerce and Industry Minister Piyush Goyal slammed Indian startups for the lack of innovation and a narrow focus on just e-commerce, a startup founder discussed, in a post on X, how difficult it was to do business in India. Murtaza Amin, who runs an IT services company, BizProspex, from Burhanpur in Madhya Pradesh, revealed the challenges faced by startups in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-act-rocks-jammu-and-kashmir-assembly-chaos-and-sloganeering-as-national-conference-mlas-tear-copies-of-law-2705170-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf Act rocks J&K Assembly, chaos and sloganeering as MLAs tear copies of lawAs protests erupted in the assembly, NC MLAs, Hilal Lone and Salman Sagar, tore copies of the Waqf Act. The situation further worsened when NC MLA Abdul Majeed Larmi tore his jacket on the floor of the House in protest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-srh-vs-gt-gujarat-titans-2705062-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inside Siraj's IPL renaissance: India snub heartbreak, reverse swing masteryMohammed Siraj's career has been a roller-coaster ride in the past few months, with the fast bowler facing several heartbreaks. However, the speedster has arrived at the Indian Premier League 2025 (IPL 2025) having learnt his lessons and is putting a show for the ages at the T20 extravaganza."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dia-mirza-hits-back-at-revanth-reddy-over-use-of-ai-clip-on-gachibowli-tree-felling-2705125-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dia Mirza blasts Revanth Reddy for AI clip charge on tree felling: Verify factsBollywood actor Dia Mirza has refuted claims by the Telangana Chief Minister that she shared AI-generated fake videos of tree felling in Gachibowli. She urged the CM to verify the facts before making accusations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-loses-cool-at-elderly-fan-during-manoj-kumars-prayer-meet-2705159-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaya Bachchan loses cool at elderly fan during Manoj Kumar's prayer meetAt the prayer tribute for the late Manoj Kumar in Mumbai, a video of Jaya Bachchan's interaction with an elderly woman went viral, sparking reactions on social media. The veteran actor appeared miffed when the fan requested a photo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/orange-monday-memes-global-markets-crash-after-trump-announces-tariffs-2705189-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Orange Monday' memes flood X after global markets sink due to Trump's tariffs'Orange Monday' made it to the top of the trends list after Asian stock indexes tumbled overnight, triggering major turmoil in global markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-sundar-pichai-google-ceo-tweet-washington-sundar-2705117-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "GT respond to Google CEO Sundar Pichai after Washington IPL comebackWashington Sundar made a strong statement in his first IPL 2025 outing for Gujarat Titans, scoring 49 against his former team SRH. This \r\n prompted the franchise to revive a supportive old tweet from Google CEO Sundar Pichai praising the all-rounder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-mother-mallika-on-income-tax-notice-to-her-son-amid-empuraan-political-row-we-are-not-afraid-2705114-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "We are not afraid: Prithviraj Sukumaran's mother on tax notice amid Empuraan row'Empuraan' director Prithviraj Sukumara was issued an income tax notice last week - a development that followed the political controversy that erupted over the film's original content. The actor-director's mother reacted to the issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kunal-kamra-moves-bombay-high-court-quash-fir-legality-propriety-eknath-shinde-joke-parody-case-2705110-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shinde joke row: Kunal Kamra calls FIR malicious, approaches court to cancel itComedian Kunal Kamra approached the Bombay High Court, challenging the 'legality, correctness, and propriety' of the FIR registered against him in connection with the 'gaddar' jibe directed at Eknath Shinde during his stand-up show."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/drunk-tv-director-rams-car-into-crowd-in-kolkata-market-beaten-by-mob-1-dead-6-critical-2705080-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 killed, 6 injured after 'drunk' TV director's car rams crowd in Kolkata marketFollowing the incident, both people in the car were stopped by locals and beaten by the agitated crowd before being handed over to the police. As officers rushed to the spot to rescue them, an official told India Today TV that the co-passenger, Shriya Basu, appeared to be intoxicated and collapsed on the road."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-idol-15-winner-manasi-ghosh-want-to-collab-with-ar-rahman-sonu-nigam-2705195-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian Idol 15 winner Manasi Ghosh: Want to collab with AR Rahman, Sonu NigamKolkata's Manasi Ghosh was crowned the winner of Indian Idol 15 on Sunday. In an exclusive chat, she shared her aspirations of collaborating with music legends like AR Rahman and Sonu Nigam. She emphasised her journey of hard work, diverse singing capabilities, and future plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-stock-market-crash-india-japan-taiwan-us-donald-trump-reciprocal-tariffs-2705124-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Global stock markets crash as Donald Trump's tariff tsunami wipes trillionsDonald Trump's tariff salvo has triggered a global market meltdown, leaving investors rattled and economies on edge. Here's how markets from Wall Street to Asia are reacting to the unfolding chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zach-yadegari-18-year-old-millionaire-ceo-open-letter-to-harvard-yale-after-rejection-2705202-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18-year-old millionaire CEO writes open letter to Harvard, Yale after rejectionZach Yadegari, an 18-year-old US-based millionaire CEO, shared an open letter to top universities for rejecting him. In it, he urged colleges to prioritise merit over diversity.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-woman-physically-abused-molested-in-laws-dowry-2705121-2025-04-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In-laws molest UP woman, hire hitmen to attack her over Rs 2 lakh dowryThe 32-year-old woman alleged that her troubles began immediately after her marriage in 2011. She also claimed her in-laws took away both her children."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravi-ashwin-youtube-controversy-explained-noor-ahmad-prasanna-2705199-2025-04-07",
      "headline": "R Ashwin's YouTube channel to not cover remaining CSK games in IPL 2025IPL 2025: Ravi Ashwin's YouTube channel will not be covering CSK matches going forward. Ashwin's YouTube admin explained the reason behind taking the decision to keep away from content related to CSK.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-fined-player-code-of-conduct-2705181-2025-04-07",
      "headline": "Ishant Sharma fined 25 per cent match fees for breach of conduct vs SRHGujarat Titans fast bowler Ishant Sharma has been fined 25 per cent of his match fees for breaching the code of conduct vs SRH. Ishant is the fifth player to be fined this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-gt-coach-ashish-nehra-passes-game-knowledge-prasidh-krishna-2705174-2025-04-07",
      "headline": "Nehra passes his game knowledge to us: Prasidh Krishna praises GT coachGujarat Titans pacer Prasidh Krishna heaped praise on his side's head coach Ashish Nehra, highlighting how the former India pacer helps his side's bowling attack by passing on his own game knowledge to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-ashish-nehra-sourav-ganguly-2705160-2025-04-07",
      "headline": "Sourav Ganguly praises GT coach Ashish Nehra after thumping win vs SRHFormer India captain Sourav Ganguly heaped praise on Gujarat Titans coach Ashish Nehra after they beat SunRisers Hyderabad away from home. Ganguly said that Nehra had tremendous game sense."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-rcb-jasprit-bumrah-back-bowling-leader-2705146-2025-04-07",
      "headline": "Jasprit Bumrah is back: MI's bowling leader returns with season in balanceJasprit Bumrah returns to the Mumbai Indians squad at the right time with their IPL 2025 campaign in the balance. The star pacer will have his tails up and raring to go as he will be tasked with galvanising the team once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-rcb-live-score-ipl-2025-updates-royal-challengers-bengaluru-mumbai-indians-2705142-2025-04-07",
      "headline": "MI vs RCB Live Score: Can Bengaluru handle Bumrah's return?Mumbai Indians (MI) vs Royal Challengers Bengaluru (RCB) Live Score, IPL 2025: While IPL walks into its more competitive stages with each team having played more than two matches respectively, the intensity amongst both fans and players has already started to amp up. In terms of fresh action, Mumbai Indians take on Royal Challengers Bengaluru at Wankhede, which might even feature the return of Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-kavya-maran-frustrated-reaction-abhishek-sharma-2705133-2025-04-07",
      "headline": "SRH owner Kavya Maran left frustrated as Abhishek Sharma flops againSRH owner Kavya Maran looked visibly frustrated as her team slumped to their fourth straight loss in IPL 2025, with opener Abhishek Sharma failing yet again in what turned out to be another batting collapse against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-sundar-pichai-google-ceo-tweet-washington-sundar-2705117-2025-04-07",
      "headline": "GT respond to Google CEO Sundar Pichai after Washington IPL comebackWashington Sundar made a strong statement in his first IPL 2025 outing for Gujarat Titans, scoring 49 against his former team SRH. This \r\n prompted the franchise to revive a supportive old tweet from Google CEO Sundar Pichai praising the all-rounder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-srh-vs-gt-gujarat-titans-2705062-2025-04-07",
      "headline": "Inside Siraj's IPL renaissance: India snub heartbreak, reverse swing masteryMohammed Siraj's career has been a roller-coaster ride in the past few months, with the fast bowler facing several heartbreaks. However, the speedster has arrived at the Indian Premier League 2025 (IPL 2025) having learnt his lessons and is putting a show for the ages at the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-daniel-vettori-backs-aggressive-style-fourth-loss-2705088-2025-04-07",
      "headline": "SRH coach Vettori continues to back aggressive style despite GT thrashingAfter suffering their fourth loss of the season with a defeat to Gujarat Titans, SRH head coach Daniel Vettori still backed his team's aggressive style, insisting it can succeed again with better reading of conditions moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-srh-batting-not-bowling-hurting-vs-gt-ambati-rayudu-2705078-2025-04-07",
      "headline": "SRH's bowling and not batting hurting them the most in IPL 2025: Ambati RayuduAmbati Rayudu feels that SRH's bowling is hurting them more this season than their batting after losing to Gujarat Titans on Sunday, April 6. Hyderabad lost their 4th game on the trot. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-kavya-maran-frustrated-reaction-abhishek-sharma-2705133-2025-04-07",
      "headline": "SRH owner Kavya Maran left frustrated as Abhishek Sharma flops againSRH owner Kavya Maran looked visibly frustrated as her team slumped to their fourth straight loss in IPL 2025, with opener Abhishek Sharma failing yet again in what turned out to be another batting collapse against Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-sundar-pichai-google-ceo-tweet-washington-sundar-2705117-2025-04-07",
      "headline": "GT respond to Google CEO Sundar Pichai after Washington IPL comebackWashington Sundar made a strong statement in his first IPL 2025 outing for Gujarat Titans, scoring 49 against his former team SRH. This \r\n prompted the franchise to revive a supportive old tweet from Google CEO Sundar Pichai praising the all-rounder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-siraj-comeback-srh-vs-gt-gujarat-titans-2705062-2025-04-07",
      "headline": "Inside Siraj's IPL renaissance: India snub heartbreak, reverse swing masteryMohammed Siraj's career has been a roller-coaster ride in the past few months, with the fast bowler facing several heartbreaks. However, the speedster has arrived at the Indian Premier League 2025 (IPL 2025) having learnt his lessons and is putting a show for the ages at the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-gt-daniel-vettori-backs-aggressive-style-fourth-loss-2705088-2025-04-07",
      "headline": "SRH coach Vettori continues to back aggressive style despite GT thrashingAfter suffering their fourth loss of the season with a defeat to Gujarat Titans, SRH head coach Daniel Vettori still backed his team's aggressive style, insisting it can succeed again with better reading of conditions moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-srh-batting-not-bowling-hurting-vs-gt-ambati-rayudu-2705078-2025-04-07",
      "headline": "SRH's bowling and not batting hurting them the most in IPL 2025: Ambati RayuduAmbati Rayudu feels that SRH's bowling is hurting them more this season than their batting after losing to Gujarat Titans on Sunday, April 6. Hyderabad lost their 4th game on the trot. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}