{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-204-points-lower-nifty-below-24800-indusind-bank-down-2-2731884-2025-05-28",
      "headline": "Sensex ends 240 points lower, Nifty below 24,800; ITC falls 3%The BSE Sensex ended 239.31 points lower at 81,312.32, while the NSE Nifty50 fell 73.75 points to settle at 24,752.45. Most of the broader market indices also fell due to high volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodhas-nithin-kamath-explains-why-indias-gdp-growth-isnt-enough-india-becomes-fourth-largest-economy-2731874-2025-05-28",
      "headline": "Zerodha's Nithin Kamath explains why India's GDP growth isn't enoughNithin Kamath mentioned that both the government and private companies need to work together to improve education, research, and regulations. Otherwise, many talented Indians may choose to work abroad, and India will miss out on its chance to grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extension-why-it-happened-and-what-you-need-to-do-now-income-tax-filing-by-september-15-2731832-2025-05-28",
      "headline": "ITR deadline extension: Why it happened and what you need to do nowEven though the deadline to file your ITR has been extended to September 15, 2025, it's still wise to get started early. Waiting till the last minute often leads to unnecessary stress and errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-move-monaco-why-tax-free-haven-no-wealth-capital-gain-tax-2731780-2025-05-28",
      "headline": "Why the world's ultra-rich are looking for a Monaco addressMore and more of the world's richest people are looking to move to Monaco or at least have an address there. But why is this tiny country, smaller than many cities, drawing so much interest from the ultra-rich?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/decoding-finfluencer-stock-tips-investor-crypto-gensol-ipos-risks-2731777-2025-05-28",
      "headline": "Finfluencer frenzy: Why you shouldn't chase viral stock tipsCan you spot when a finfluencer's tip will make you money or cost you everything? How much are you really risking chasing the next viral stock? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/soon-every-indian-address-may-get-a-unique-digital-id-government-to-introduce-digipin-2731752-2025-05-28",
      "headline": "Soon, every Indian address may get a unique Digital IDThe Centre wants to bring addresses under India's Digital Public Infrastructure (DPI) matrix. Right now, there is no proper system or rule to manage address details in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/belrise-industries-share-price-listing-below-expectation-11-percent-premium-2731711-2025-05-28",
      "headline": "Belrise Industries share price: Stock lists below expectations with 11% premiumBelrise Industries listing: The company's shares listed at Rs 100 on the BSE, which is an 11.11% rise over the issue price of Rs 90. On the NSE, the stock started trading at Rs 98.50, which is a gain of 9.44%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-bill-online-property-registration-key-details-explained-2731694-2025-05-28",
      "headline": "Centre proposes bill for online property registration. What it means for you?The Centre has floated a draft bill to digitise property registration. If passed, it could change how you buy, sell, or prove ownership of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-fall-3-percent-why-reason-stake-sale-bat-should-you-buy-expert-view-2731692-2025-05-28",
      "headline": "ITC share price falls over 3% today. Here's why and should you buy?ITC shares fell over 3% in early trade. The stock is down 2.02% in the last month, and has fallen over 11% in the past 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-150-points-lower-nifty-below-24900-itc-down-3-percent-titan-2731669-2025-05-28",
      "headline": "Sensex opens over 150 points lower, Nifty below 24,900; ITC down 3%The S&P BSE Sensex fell 164.83 points to 81,386.80, while the NSE Nifty50 was down by 22.25 points to 24,803.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-listing-today-strong-debut-low-dull-share-price-ipo-latest-gmp-2731665-2025-05-28",
      "headline": "Belrise Industries listing: Will the stock make strong market debut? Check GMPBelrise Industries IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashok-saraf-anant-nag-shobana-chandrakumar-and-others-conferred-with-padma-awards-2731899-2025-05-28",
      "headline": "Actors Ashok Saraf, Anant Nag, Shobana and others conferred with Padma awardsPresident Droupadi Murmu presented Padma awards to actors Anant Nag, Ashok Saraf, Shobana Chandrakumar, and musician Ricky Kej among others from the entertainment industry. Singer Sharda Sinha was posthumously honoured with the Padma Vibhushan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-to-play-mukesh-his-grandfather-and-legendary-musician-in-biopic-2731831-2025-05-28",
      "headline": "Neil Nitin to play Mukesh, his grandfather and legendary musician, in biopicNeil Nitin Mukesh is set to bring the life of his legendary grandfather, singer Mukesh, to the screen in a heartfelt biopic, which he's co-writing and producing. Gathering material from family stories and rare archives, Neil hopes to portray grandfather Mukesh himself in the biopic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jennifer-winget-karan-singh-grover-to-reunite-after-11-years-karan-johar-show-the-traitirs-2731903-2025-05-28",
      "headline": "Jennifer Winget, Karan Singh Grover to reunite after 11 years on KJo's show: ReportActors Jennifer Winget, Karan Singh Grover to reunite after 11 years on Karan Johar's 'The Traitors'. The show will premiere on Prime Video on June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-welcomes-ali-fazal-to-south-films-calls-him-important-actor-for-india-2731891-2025-05-28",
      "headline": "Kamal Haasan welcomes Ali Fazal to South films, calls him important actor for IndiaActor Kamal Haasan welcomed Ali Fazal to the South cinema at the latest 'Thug Life' event. The legendary icon, also called Fazal, an important actor for India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-father-kasthuri-raja-good-bad-ugly-makers-unauthorised-use-of-songs-2731889-2025-05-28",
      "headline": "Dhanush's father warns Good Bad Ugly makers of legal action over use of his songsFilmmaker and writer Kasthuri Raja, at a recent interaction with the media, called out the makers of 'Good Bad Ugly' over unauthorised use of his songs in the film. Earlier, Ilaiyaraaja issued a legal notice to the makers for using his songs without consent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-amruta-subhash-on-losing-confidence-for-being-rejected-over-skin-colour-2731812-2025-05-28",
      "headline": "Actor Amruta Subhash on losing confidence for being rejected over skin colourAmruta Subhash recently opened up on how rejection by a dance teacher over skin tone affected her self-confidence. She revealed how it took her years to get over the insecurity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-to-have-multiple-twisted-endings-different-screen-different-climax-2731842-2025-05-28",
      "headline": "Different screen, different climax: Housefull 5 to have multiple twisted endingsIn a first for the audience, 'Housefull 5' is going to feature different climaxes on different screens, providing an unlikely experience everytime you watch it in a theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-looks-regal-in-white-at-friends-wedding-dances-with-bridesmaids-2731823-2025-05-28",
      "headline": "Alia Bhatt looks regal in white at friend's wedding, grooves with bridesmaidAlia Bhatt looked stunning in a white outfit at a friend's wedding in Spain. One of the viral videos featured her dancing along with other bridesmaids. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-emiway-bantai-receives-death-threat-after-sidhu-moosewala-tribute-song-2731814-2025-05-28",
      "headline": "Rapper Emiway Bantai receives death threat after Sidhu Moosewala tribute songRapper Emiway Bantai filed a police complaint in Mumbai after receiving a threatening message from a person claiming to be gangster Goldy Brar. The threat came days after he released a tribute to the late singer Sidhu Moosewala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-peaceful-cloud-gazing-moment-with-daughter-malti-marie-2731785-2025-05-28",
      "headline": "Priyanka Chopra shares peaceful cloud-gazing moment with daughter Malti MariePriyanka Chopra delighted fans with a heartwarming photo of her and daughter Malti Marie cloud-gazing by the waterfront. She shared the photo on her Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pranks-nargis-fakhri-at-housefull-5-trailer-launch-2731802-2025-05-28",
      "headline": "Akshay Kumar pranks Nargis Fakhri at Housefull 5 trailer launch. WatchAkshay Kumar pulled off a prank on co-star Nargis Fakhri at the 'Housefull 5' trailer launch. A video of the hilarious incident has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-season-2-key-updates-unveiled-before-tudum-event-2731693-2025-05-28",
      "headline": "One Piece Season 2's key updates unveiled before Netflix's Tudum eventA new clip has reunited the iconic Straw Hat crew from 'One Piece', teasing some fun crew bonding at a slumber party. Ahead of Netflix's Tudum 2025 event on May 31, fans can also look forward to major updates about 'Wednesday', 'Stranger Things', 'Squid Game', 'Outer Banks', 'Love Is Blind', and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-actor-dhanush-playing-apj-abdul-kamal-in-biopic-director-om-raut-reacts-2731741-2025-05-28",
      "headline": "Why is Dhanush playing APJ Abdul Kamal in biopic? Director Om Raut reactsFilmmaker Om Raut recently opened up on his decision to cast Dhanush in his upcoming film,\" Kalam: The Missile Man of India.' The film is a biopic on the eleventh Indian President and aerospace scientist Dr APJ Abdul Kalam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-aarti-removes-posts-marital-dispute-divorce-after-legal-notice-2731784-2025-05-28",
      "headline": "Ravi, estranged wife Aarti remove posts on marital dispute amid divorce battleActor Ravi Mohan and his estranged partner Aarti removed their statements about their marital dispute from their social media pages. This came after the court ordered them to refrain from sharing their opinions when the divorce proceedings are underway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-combs-threatened-to-kill-rapper-kid-cudi-ex-employee-tells-us-court-2731760-2025-05-28",
      "headline": "Sean 'Diddy' Combs threatened to kill rapper Kid Cudi, ex-employee tells US courtFormer employee Capricorn Clark testified that Sean 'Diddy' Combs threatened to kill rapper Kid Cudi after learning of his relationship with Cassie Ventura. Her testimony adds to serious allegations of abuse and threats in Combs' ongoing federal trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-finds-londons-most-expensive-coffee-pheeki-in-funny-vlog-2731740-2025-05-28",
      "headline": "Diljit Dosanjh finds London's most expensive coffee 'pheeki' in funny vlog. WatchSinger-actor Diljit Dosanjh shared his experience of sipping London's 'most expensive coffee', and it seems that he was not impressed at all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-opens-up-on-cancer-battle-and-its-impact-on-son-ruhaan-2731710-2025-05-28",
      "headline": "Actor Shoaib Ibrahim confident of Dipika's cancer recovery, reveals son's reactionTelevision actor Dipika Kakar revealed she's battling second-stage liver cancer but remains hopeful, with surgery planned once she recovers from the flu. Her husband, Shoaib Ibrahim, shared a YouTube video requesting people to pray for her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishaan-khatter-bhumi-pednekar-the-royals-renewed-for-season-2-2731722-2025-05-28",
      "headline": "Old money, new blood: Ishaan Khatter, Bhumi's The Royals renewed for Season 2Ishaan Khatter and Bhumi Pednekar's 'The Royals' have been renewed for a second season. The makers announced the same with a post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-unni-mukundan-denies-assault-claim-by-alleged-ex-manager-no-physical-attack-2731713-2025-05-28",
      "headline": "No physical attack: Actor Unni Mukundan denies assault claim by alleged ex-managerMalayalam actor Unni Mukundan shared a detailed statement on his social media, calling allegations of assault against him 'false'. He also clarified that the man claiming he had assaulted him was never appointed as his manager. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-unable-to-explain-cash-found-at-home-misconduct-calls-for-impeachment-probe-report-2731942-2025-05-28",
      "headline": "Justice Yashwant Varma unable to explain cash found at home, misconduct calls for impeachment: Probe reportJustice Yashwant Varma unable to explain cash found at home, misconduct calls for impeachment: Probe report"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/three-indians-go-missing-after-travelling-to-iran-delhi-urges-tehran-to-trace-ensure-safety-2731913-2025-05-28",
      "headline": "Three Indians go missing in Iran, Delhi urges Tehran to trace them, ensure safetyThe Indian mission in Tehran is keeping the families of those missing regularly updated about the efforts being made to trace them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bholari-airbase-pakistan-saab-200-awec-fighter-jets-operation-sindoor-indian-air-force-2731888-2025-05-28",
      "headline": "Pak's Bholari base hangar hit by India had Saab airborne control aircraft, 4 jetsThe Bholari base is located less than 100 miles from the port city of Karachi, and was one of nearly a dozen air force targets struck by India during Operation Sindoor.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/udit-raj-calls-shashi-tharoor-bjp-super-spokesperson-as-he-defends-op-sindoor-2731829-2025-05-28",
      "headline": "Congress upset with Shashi Tharoor's 'cover fire' to BJP post Op Sindoor: SourcesThe Congress's stated position has been that six surgical strikes were conducted during the UPA regime, but those were never publicised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rachel-gupta-resigns-miss-grand-international-2024-organisers-terminated-2731897-2025-05-28",
      "headline": "Rachel Gupta resigns as Miss Grand International 2024. Organisers say no, terminatedRachel Gupta's dream run as Miss Grand International 2024 ended in controversy after the organisation revoked her crown. However, Gupta said she walked away first, and for a good reason."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-siddaramaiah-bjp-unite-kamal-haasan-faces-backlash-from-karnataka-leaders-over-kannada-born-from-tamil-remark-2731822-2025-05-28",
      "headline": "Poor Kamal Haasan, mental patient: Congress, BJP unite as actor stokes Kannada rowKamal Haasan's remark that Kannada was born from Tamil has sparked rare bipartisan criticism in Karnataka, with both the ruling Congress and Opposition BJP slamming the actor for insulting Kannada identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-election-june-2026-bnp-protest-allege-ploy-to-delay-waker-uz-zaman-2731830-2025-05-28",
      "headline": "Why Yunus' election-by-June plan is raising suspicion and fearsThe insistence of Muhammad Yunus, the head of Bangladesh's interim government, to hold elections by June 2026 has triggered a row, with the BNP rejecting the timeline as suspicious and impractical. The first half of the calendar doesn't leave scope for polls, with people believing that elections, if not conducted by December, might get pushed to next winter.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gaurav-gogoi-on-wife-pakistan-link-claim-himanta-biswa-sarma-allegations-2731906-2025-05-28",
      "headline": "Wife went for climate project, I visited once: Gaurav Gogoi on Pak link claimA fresh war of words erupted between Congress MP Gaurav Gogoi and Assam Chief Minister Himanta Biswa Sarma on Wednesday over. Gogoi slammed Sarma over Pakistan link allegations against him and his wife, calling it the BJP leader's \"old habit of deceiving people\".  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-move-monaco-why-tax-free-haven-no-wealth-capital-gain-tax-2731780-2025-05-28",
      "headline": "Why the world's ultra-rich are looking for a Monaco addressMore and more of the world's richest people are looking to move to Monaco or at least have an address there. But why is this tiny country, smaller than many cities, drawing so much interest from the ultra-rich?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-donald-trump-harvard-university-funding-plumbers-lgbtq-graduates-2731877-2025-05-28",
      "headline": "Need more plumbers, not LGBTQ graduates: White House doubles down on HarvardThe remarks by White House Press Secretary Karoline Leavitt come as the Donald Trump administration plans to cancel federal contracts with Harvard worth $100 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-big-war-to-fight-former-pm-imran-khan-blows-bugle-pti-mass-movement-nationwide-here-is-more-2731811-2025-05-28",
      "headline": "Pak Army has a big war to fight as Imran Khan blows bugleThe Pakistani Army will soon have a more pressing issue to deal with at its home front. Former Prime Minister and Pakistan Tehreek-e-Insaf (PTI) chief, Imran Khan, has called upon his party to gear up for a large-scale national agitation against the current hybrid regime of PM Shehbaz Sharif and Army Chief Asim Munir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-shares-her-life-mantra-amid-sandeep-reddy-vanga-row-stuns-in-red-stand-by-decisions-2731679-2025-05-28",
      "headline": "When going gets tough... Deepika Padukone shares mantra as Sandeep Vanga row ragesActor Deepika Padukone attended an event in Sweden on Tuesday night and shared her life philosophy in an interview there. The actor's statement came amid her rumoured exit from Sandeep Reddy Vanga's 'Spirit', which snowballed into a row after the director shared a long cryptic note on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/thunderstorms-gusty-winds-upto-70-kmph-to-hit-delhi-warns-imd-2731925-2025-05-28",
      "headline": "Delhi to be hit by thunderstorms, 70 kmph winds over next three daysThe most intense weather is expected on Thursday, May 30, when wind speeds in Delhi may temporarily surge to 70 kmph during thundersqualls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/drills-to-be-conducted-tomorrow-evening-in-gujarat-rajasthan-punjab-and-jk-people-asked-to-remain-alert-2731858-2025-05-28",
      "headline": "Drills in 4 border states tomorrow; Gujarat, J&K, Punjab, Rajasthan on alertAmid ongoing tensions between New Delhi and Islamabad, a mock drill will be conducted in the states bordering Pakistan -- Gujarat, Punjab, Rajasthan, and Jammu and Kashmir -- which came under heavy attack from across the border during the recently concluded four-day conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/covid-19-cases-surge-asia-new-omicron-variants-strains-vaccination-protection-study-2731860-2025-05-28",
      "headline": "Can vaccines protect against newer Covid-19 virus variants?Covid-19 cases have surged across Asia with new Omicron sub-lineages causing mild symptoms. Despite viral mutations, vaccination continues to offer strong protection against severe illness, say researchers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/decoding-finfluencer-stock-tips-investor-crypto-gensol-ipos-risks-2731777-2025-05-28",
      "headline": "Finfluencer frenzy: Why you shouldn't chase viral stock tipsCan you spot when a finfluencer's tip will make you money or cost you everything? How much are you really risking chasing the next viral stock? Read on to find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pak-called-india-twice-for-cessation-of-firing-casualty-figures-there-from-op-sindoor-now-at-160-say-sources-2731843-2025-05-28",
      "headline": "Islamabad called Delhi twice for ceasefire; Op Sindoor deaths in Pak rise to 160Pakistan's Director-General of Military Operations had made a call to his Indian counterpart during Operation Sindoor on May 7 seeking a cessation of hostilities. But these overtures were met with scepticism by India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/what-host-of-advisories-for-indian-foreign-students-in-us-warn-against-immigration-crackdown-trump-students-visa-2731793-2025-05-28",
      "headline": "What advisories for Indian, foreign students in US warn againstInternational students, including those from India, are facing heightened scrutiny in the US. A series of advisories has been issued by the US government and universities for these students, asking them to avoid actions that could jeopardise their visa status. Here are some of the important points from the advisories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-allahabad-high-court-cash-at-home-impeachment-motion-procedure-2731876-2025-05-28",
      "headline": "Justice Yashwant Varma to face impeachment? Here's how that worksThe procedure for impeaching a High Court judge is governed by the Constitution of India and the Judges (Inquiry) Act, 1968. Under the Constitution, a judge can be removed only on grounds of proven misbehaviour or incapacity, through a motion passed by both Houses of Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/salt-therapy-is-growing-wellness-trend-but-take-it-with-a-pinch-of-salt-2731365-2025-05-28",
      "headline": "Salt therapy is a growing wellness trend, but take it with a pinch of saltWellness retreats are getting salty with the rise of salt therapy or halotherapy in India. It claims to help with holistic well-being, but to what extent?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/satellite-pics-show-india-targeted-underground-facility-pakistan-murid-nur-khan-base-damage-crater-2731644-2025-05-28",
      "headline": "Satellite pics show India hit underground site complex at Pak's Murid air baseSatellite images show a 3-metre-wide crater just 30 metres from the entrance of a highly secured sub-complex, possibly housing an underground facility at Murid air base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-boy-operation-sindoor-youngest-hero-helped-army-india-pak-conflict-2731580-2025-05-27",
      "headline": "Punjab boy who served milk, lassi to jawans during Op Sindoor honoured by ArmyThe Indian Army honoured a 10-year-old boy from Punjab's Ferozepur district for his unwavering committment during the India-Pakistan conflict. He helped the soldiers by bringing water, milk and other items as they fought the battle in the scorching heat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-reveals-why-spacex-lost-control-of-starship-and-crashed-over-indian-ocean-2731764-2025-05-28",
      "headline": "Elon Musk reveals why Starship crashed over Indian OceanMusk confirmed that Starship achieved its scheduled main engine cutoff, marking a significant improvement over previous flights. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-pbks-gt-rcb-replacements-2731892-2025-05-28",
      "headline": "List of unavailable players in playoffs and their replacementsIPL 2025: The four teams in the playoffs, RCB, MI, PBKS and GT have had to shuffle their squads after quite a few of their players missed out due to national duties. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-ruben-amorim-jose-mourinho-2731921-2025-05-28",
      "headline": "Jose Mourinho backs Manchester United boss Ruben Amorim with personal exampleJose Mourinho backed Ruben Amorim for success at Manchester United and gave a personal example as a motivating message for the fellow Portuguese tactician. Amorim has endured a rough six months at Manchester United so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-today-match-scores-alcaraz-paolini-sabalenka-ruud-2731911-2025-05-28",
      "headline": "Day 4 Live: Jasmine Paolini and Lorenzo Musetti off to solid startFrench Open 2025 Day 4 Live Score: Jasmine Paolini has begun her second-round match on a solid note against Ajla Tomljanovic. Lorenzo Musetti is, meanwhile, powering through to the second round. Later in the day, second seed Carlos Alcaraz and World No. 1 Aryna Sabalenka will be in action in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-virat-kohli-rohit-sharma-retirement-shardul-thakur-2731896-2025-05-28",
      "headline": "Rohit, Kohli may have felt they can't drive Tests as before: ShardulShardul Thakur feels that Virat Kohli and Rohit Sharma may have retired from Test cricket, knowing that they may not be able to contribute or drive the format as before. Kohli and Rohit retired just ahead of the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-luis-suarez-new-club-deportivo-lsm-uruguayan-league-2731890-2025-05-28",
      "headline": "Lionel Messi and Luis Suarez unveil new Uruguayan club Deportivo LSMArgentine football icon Lionel Messi and his long-time former FC Barcelona and Inter Miami teammate Luis Suarez have announced the formation of their new club Deportivo LSM, which will compete in the Uruguayan fourth-tier football league.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/i-league-relegation-rule-aiff-on-hold-delhi-fc-sc-bengaluru-protest-2731835-2025-05-28",
      "headline": "AIFF puts I-League relegation on hold amid Delhi FC, SC Bengaluru protestsThe AIFF's decision to pause I-League relegation amid legal challenges by Delhi FC and SC Bengaluru marks another flashpoint in a season already clouded by disputes, raising deeper concerns about governance in Indian football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-live-streaming-squads-schedule-2731809-2025-05-28",
      "headline": "England vs West Indies ODI series: Squads, all you need to knowENG vs WI: Harry Brook's England and Shai Hope's West Indies will face each other in three ODIs to be played at Edgbaston, Sophia Gardens and Kennington Oval. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/singapore-open-satwiksairaj-rankireddy-chirag-shetty-win-lakshay-sen-retires-2731792-2025-05-28",
      "headline": "Satwik-Chirag win on return, Lakshya Sen retires hurt at Singapore OpenSatwiksairaj Rankireddy and Chirag Shetty marked a winning return at the Singapore Open Super 750, even as Lakshya Sen's campaign ended in heartbreak after an injury forced him to retire mid-match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-corentin-moutet-clement-tabur-point-video-first-round-2731776-2025-05-28",
      "headline": "Point of the year? Corentin Moutet pulls miraculous effort in first roundFrench Open 2025: Corentin Moutet displayed remarkable grit and determination to earn a crucial break point against Clement Tabur in their first-round clash on Tuesday at Court Simonne-Mathieu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-rcb-jitesh-sharma-spectacular-mayank-agarwal-2731761-2025-05-28",
      "headline": "Jitesh Sharma was spectacular: RCB's Mayank Agarwal after 228 chase vs LSGRCB's Mayank Agarwal lauded Jitesh Sharma's unbeaten 85, calling it pivotal in their record 228-run chase against LSG that sealed their place in Qualifier 1 — RCB's highest-ever successful chase in IPL history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-gujarat-titans-ipl-2025-playoffs-history-2731756-2025-05-28",
      "headline": "Can Mumbai Indians, Gujarat Titans win the title? Here's what history suggestsIPL 2025: Royal Challengers Bengaluru, Mumbai Indians, Gujarat Titans and Punjab Kings have qualified for the playoffs, but which teams have a better chance of lifting the title? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-live-streaming-squads-schedule-2731809-2025-05-28",
      "headline": "England vs West Indies ODI series: Squads, all you need to knowENG vs WI: Harry Brook's England and Shai Hope's West Indies will face each other in three ODIs to be played at Edgbaston, Sophia Gardens and Kennington Oval. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/singapore-open-satwiksairaj-rankireddy-chirag-shetty-win-lakshay-sen-retires-2731792-2025-05-28",
      "headline": "Satwik-Chirag win on return, Lakshya Sen retires hurt at Singapore OpenSatwiksairaj Rankireddy and Chirag Shetty marked a winning return at the Singapore Open Super 750, even as Lakshya Sen's campaign ended in heartbreak after an injury forced him to retire mid-match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-corentin-moutet-clement-tabur-point-video-first-round-2731776-2025-05-28",
      "headline": "Point of the year? Corentin Moutet pulls miraculous effort in first roundFrench Open 2025: Corentin Moutet displayed remarkable grit and determination to earn a crucial break point against Clement Tabur in their first-round clash on Tuesday at Court Simonne-Mathieu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-rcb-jitesh-sharma-spectacular-mayank-agarwal-2731761-2025-05-28",
      "headline": "Jitesh Sharma was spectacular: RCB's Mayank Agarwal after 228 chase vs LSGRCB's Mayank Agarwal lauded Jitesh Sharma's unbeaten 85, calling it pivotal in their record 228-run chase against LSG that sealed their place in Qualifier 1 — RCB's highest-ever successful chase in IPL history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-gujarat-titans-ipl-2025-playoffs-history-2731756-2025-05-28",
      "headline": "Can Mumbai Indians, Gujarat Titans win the title? Here's what history suggestsIPL 2025: Royal Challengers Bengaluru, Mumbai Indians, Gujarat Titans and Punjab Kings have qualified for the playoffs, but which teams have a better chance of lifting the title? "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}