{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-jump-as-investors-eye-possible-tariff-leeway-lower-price-2698414-2025-03-24",
      "headline": "Tesla shares jump 10% as investors eye possible tariff leeway, lower priceTesla shares surged 10% on Monday amid reports of tariff exclusions under the Trump administration. Investors saw an opportunity after a steep decline this year. The rally lifted Wall Street, with tech stocks pushing indexes to two-week highs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-dalal-street-green-flags-what-investors-should-know-2698127-2025-03-24",
      "headline": "Red flags turn green on Dalal Street: Will the stock market bull run continue?Stock market rally today: With today's rebound, both indices have nearly erased most of the losses suffered in the first two months of 2025. It may be noted that the total market capitalisation of all BSE-listed firms swelled by over Rs 5 lakh crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/volkswagen-tax-case-why-government-doesnt-want-to-quash-14-billion-demand-2698086-2025-03-24",
      "headline": "Volkswagen tax case: Why government stands firm on $1.4 billion demandThe government's tax demand is against Skoda Auto Volkswagen India, which is accused of wrongly classifying imported parts for some Audi, VW and Skoda cars to avoid paying higher import taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bull-run-continues-on-dalal-street-as-sensex-surges-1000-points-2698085-2025-03-24",
      "headline": "Sensex surges 1,000 points as FIIs chase Dalal Street rallyBull run on Dalal Street: The S&P BSE Senses added 1,003.06 points to 77,908.57, while the NSE Nifty50 gained 286.95 points to 23,637.35 as of 12:37 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-under-pressure-cautions-saurabh-mukherjea-what-are-its-key-challenges-2698060-2025-03-24",
      "headline": "Is India's middle class losing momentum? See what this expert saysThe rise of automation is a growing threat to jobs. Machines are replacing traditional roles in both factories and offices. The next phase of automation, powered by generative AI, is expected to accelerate job displacement across multiple sectors, Saurabh Mukherjea said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fii-selling-stop-return-to-dalal-street-why-comeback-on-sensex-nifty-key-reasons-2698064-2025-03-24",
      "headline": "Why foreign investors are rushing back to bet on Dalal Street FIIs returning to Dalal Street has given a sharp boost to domestic investors, with the main indices extending gains for the sixth consecutive session. The S&P BSE Sensex was up 950 points and Nifty rose 273 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-loser-stocks-on-sensex-and-nifty-stock-market-today-titan-kotak-bank-bhel-infosys-ntpc-lt-2698016-2025-03-24",
      "headline": "Stock market rally: Check top gainers and losers on Dalal StreetSensex surged over 800 points to surpass the 77,700 mark, and Nifty jumped over 200 points to trade above the 23,500 level as Dalal Street continued its winning streak.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-gains-dalal-street-no-impact-of-reciprocal-tariffs-explained-2698012-2025-03-24",
      "headline": "Why Trump's tariffs aren't spooking Dalal Street investors anymoreForeign investors are back, and markets are rallying. But with Trump's reciprocal tariffs set for April 2, will the optimism last, or is another sell-off on the way?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-rising-today-sensex-jumps-500-points-nifty-up-key-reasons-fii-selling-stop-good-marco-expert-view-2697999-2025-03-24",
      "headline": "Sensex jumps over 1,000 points, extends rally: 5 things to knowStock Market Today: As of 11:06 am, the S&P BSE Sensex went up by 1000.10 points to reach 77,905.61. At the same time, the NSE Nifty50 increased by 289.85 points to 23,640.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ncc-share-price-today-jhunjhunwala-backsed-stock-jumps-5-percent-major-deal-win-2697994-2025-03-24",
      "headline": "NCC share price jumps 5% after Rs 1,480 crore hospital redevelopment orderNCC Ltd's stock price jumped in early trade after the company secured a contract worth Rs 1,480 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-rising-again-is-bhel-a-good-share-buy-after-recent-order-wins-2697978-2025-03-24",
      "headline": "Defence stocks are rising again. Is BHEL a good buy after recent order wins?Having declined over 24% in the past six months and over 9% in 2025, the stock has finally started showing signs of recovery. In the past month it has gained 11% and nearly 8% in the past five trading sessions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-jumps-over-500-points-nifty-surges-150-points-lt-gains-2-percent-2697976-2025-03-24",
      "headline": "Sensex, Nifty gain as energy stocks rally and foreign inflows surgeThe S&P BSE Sensex was up 579.88 points to 77,485.39, while the NSE Nifty50 jumped 160.85 points to 23,511.25 as of 9:26 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-likely-to-open-higher-how-to-trade-on-dalal-street-today-stock-market-expectations-2697953-2025-03-24",
      "headline": "Sensex, Nifty likely to open higher: How to trade on Dalal Street today?Dalal Street is expected to open higher as the overall market sentiment remains positive, with traders watching key levels for further movement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-march-24-bse-nse-what-to-expect-from-sensex-nifty-today-2697941-2025-03-24",
      "headline": "Sensex, Nifty opening prediction on March 24: What to expect from D-Street todayNifty50 posted its biggest weekly gain in over four years, driven by renewed interest from foreign investors and expectations that the recent market decline has come to an end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-24-shares-in-news-today-ril-ola-raymond-adani-green-lt-mahindra-godrej-properties-2697935-2025-03-24",
      "headline": "Stocks to watch on March 24: RIL, Ola, Raymond, Adani Green, Mahindra & MahindraAs markets resume trading, several stocks will be in focus due to key developments. These include Reliance Industries, Mahindra & Mahindra, Ola Electric, Adani Green, Adani Enterprises, NCC, Dr. Reddy's, Max Healthcare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-wins-business-todays-business-icon-of-the-year-award-2697664-2025-03-23",
      "headline": "Kumar Mangalam Birla wins Business Today's Business Icon of the Year awardThe award recognises not only Kumar Mangalam Birla's achievements over the past three decades since he took over the reins of his family business at the tender age of 28, but also showcases his visionary approach in changing times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kumar-mangalam-birla-honoured-business-icon-of-the-year-bt-mindrush-2697665-2025-03-23",
      "headline": "Kumar Mangalam Birla honoured with Business Icon of the Year at BT MindRushAt Business Today MindRush 2025, Aditya Birla Group Chairman Kumar Mangalam Birla was honoured with the 'Business Icon of the Year' award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-mindrush-2025-nitin-gadkari-tesla-entry-automotive-industry-india-growth-2697517-2025-03-22",
      "headline": "What does Tesla entry mean for India's automotive industry? Nitin Gadkari answersAt the Business Today Mindrush 2025 forum, Nitin Gadkari expressed confidence that India's automotive industry would become the second largest in the world in the next few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-viksit-bharat-vision-2047-on-track-aditya-birla-group-kumar-mangalam-birla-2697500-2025-03-22",
      "headline": "India on track to become 'Viksit Bharat' by 2047, says Kumar Mangalam BirlaAditya Birla Group Chairman Kumar Mangalam Birla said India is on track for Viksit Bharat 2047, crediting policy stability, infrastructure growth, and economic momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-withdraws-20-duty-on-onion-export-to-be-effective-from-april-1-2697490-2025-03-22",
      "headline": "Government withdraws 20% duty on Onion export, to be effective from April 1The Centre has removed the 20 per cent export duty on onions, effective April 1. The duty, imposed to ensure domestic availability, had been in place since September 2024. Despite restrictions, onion exports saw significant growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/90-percent-retail-investors-lose-money-in-fo-trading-stock-market-think-they-are-smart-sebi-chief-money-loss-2697477-2025-03-22",
      "headline": "Overconfidence leading to F&O losses for retail investors, says Sebi chiefTuhin Kanta Pandey said that studies conducted by the market regulator, Sebi, show that 90% of retail investors lose money in the futures and options (F&O) segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-should-stock-market-traders-be-worried-about-today-sebi-chief-tuhin-kanta-pandey-answers-2697461-2025-03-22",
      "headline": "What should market traders be worried about today? Sebi chief answersSebi chief Tuhin Kanta Pandey pointed to India's efforts to negotiate bilateral trade agreements with the United States and pursue free trade agreements with various other nations as examples of strategic responses to global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marico-chairman-harsh-mariwala-hiring-good-talent-market-share-company-growth-bt-mindrush-2025-2697459-2025-03-22",
      "headline": "Marico Chairman Harsh Mariwala says war for talent as crucial as market shareMarico Chairman Harsh Mariwala urged entrepreneurs to focus on building strong teams, saying the competition for skilled professionals is intense.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-explains-why-retail-investors-fail-to-make-money-from-stock-market-2697433-2025-03-22",
      "headline": "Motilal Oswal explains why retail investors fail to make money from stock marketMotilal Oswal cautioned that most retail investors are engaging in speculative short-term trading or investing in unknown companies, which often leads to losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nse-ceo-ashish-chauhan-retail-investors-derivatives-trade-warning-bt-mindrush-2025-2697396-2025-03-22",
      "headline": "NSE CEO Ashish Chauhan warns retail investors against derivatives tradingNSE chief Ashish Chauhan also advised investors not to believe market tips and discussions on social media platforms.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-you-should-opt-in-2025-26-income-tax-filing-2697107-2025-03-22",
      "headline": "Old vs new tax regime: Which one should you opt for in 2025-26?While the old tax regime promotes savings through tax benefits, the new one is simpler, involves less paperwork and reduces the chances of tax fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-income-tax-regime-what-to-choose-if-you-earn-rs-50-lakh-per-year-2696980-2025-03-21",
      "headline": "Old vs new income tax regime: What to choose if you earn Rs 50 lakh per yearTaxpayers should consider a few key factors before making a choice. The old regime allows deductions, whereas the new regime offers lower tax rates but no major deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-over-500-points-nifty-above-23300-ntpc-gains-3-percent-2696931-2025-03-21",
      "headline": "Sensex closes over 500 points, Nifty above 23,300; NTPC gains 3%The S&P BSE Sensex added 557.45 points to end at 76,905.51, while the NSE Nifty50 gained 159.75 points to close at 23,350.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-likely-to-drop-usd-23-billion-plan-to-push-domestic-manufacturing-blow-to-make-in-india-2696891-2025-03-21",
      "headline": "Government to lapse $23 billion scheme to boost domestic manufacturing: ReportThe Production-Linked Incentive (PLI) scheme, introduced in 2020, aimed to increase manufacturing's share of India's economy to 25% by 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-card-flexipay-know-how-to-convert-credit-card-payments-into-emis-2696879-2025-03-21",
      "headline": "SBI Card Flexipay: Know how to convert credit card payments into EMIsOne can convert transactions of Rs 500 or more into EMIs under SBI Card's Flexipay option. It offers multiple repayment tenure options, such as three, six, nine, 12, 18 and 24 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smallcap-midcap-stock-market-recover-dalal-street-is-it-good-for-risky-mutual-funds-explained-2696870-2025-03-21",
      "headline": "Smallcap, midcap stocks gain momentum. Good news for mutual funds too?Given the correction, some analysts have indicated that quality smallcap and midcap stocks could start regaining some momentum. But does this apply to smallcap and midcap mutual funds too?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-rise-against-us-dollar-strong-fpi-inflows-best-week-in-past-2-years-market-performance-2696862-2025-03-21",
      "headline": "Rupee heads for best week in 2 years as dollar inflows riseAt 1 pm, the rupee was trading at 86.07 against the US dollar, extending its weekly gain to 0.72%. This marks the strongest weekly performance for the rupee since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investor-exodus-dalal-street-over-key-factors-explained-stock-market-rally-retail-investors-2696842-2025-03-21",
      "headline": "Is the foreign selling crisis finally over on Dalal Street?Foreign investors turned net buyers in two of the last four sessions, sparking a market rally. While selling pressure has eased, is the months-long foreign outflow crisis finally coming to an end?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/morgan-stanley-to-layoff-2000-employees-to-boost-efficiency-2696835-2025-03-21",
      "headline": "Morgan Stanley to layoff 2,000 employees to boost efficiencySeveral renowned banks have been reducing their workforce recently as they brace for economic uncertainty following President Donald Trump's newly announced trade tariffs.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-tesla-partnership-global-supplier-india-entry-elon-musk-report-2696815-2025-03-21",
      "headline": "Tata Group quietly becomes Tesla's global supplier: ReportTata firms have already signed global agreements with Tesla and are supplying various parts and services and their involvement is expected to grow further. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-aasif-sheikh-collapsed-during-bhabiji-ghar-par-hain-shoot-heres-the-truth-exclusive-2698416-2025-03-24",
      "headline": "Actor Aasif Sheikh collapsed during Bhabiji shoot? Here's the truthActor Aasif Sheikh's health sparked concerns after rumours of hospitalisation emerged. However, sources clarify that the reports are exaggerated, and the actor is in good health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-ghar-par-hai-writer-manoj-santoshi-dies-at-49-due-to-liver-ailment-2698395-2025-03-24",
      "headline": "Bhabiji Ghar Par Hai writer Manoj Santoshi dies at 49 due to liver ailmentRenowned TV writer Manoj Santoshi, known for his work on popular sitcoms, died at 49 due to liver complications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-director-ashwath-marimuthu-meets-thalapathy-vijay-calls-it-dream-come-true-2698370-2025-03-24",
      "headline": "Dragon director Ashwath Marimuthu meets Thalapathy Vijay, calls it a dream come trueDirector Ashwath Marimuthu met his idol, Tamil superstar Thalapathy Vijay, and shared the emotional significance of the encounter with fans. The meeting was a dream come true for Marimuthu, who was deeply moved by Vijay's praise for his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-dances-his-heart-out-to-devara-song-ahead-of-its-japan-release-2698351-2025-03-24",
      "headline": "Jr NTR dances his heart out to Devara song ahead of its Japan release. WatchTelugu star Jr NTR has been busy promoting his last release, Devara, in Japan. The movie, also starring Janhvi Kapoor and Saif Ali Khan, will soon release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonas-brothers-announce-jonas20-living-the-dream-tour-see-full-dates-glbs-2698365-2025-03-24",
      "headline": "Jonas Brothers announce JONAS20: Living the Dream tour – See full datesThe Jonas Brothers announced their JONAS20: Living the Dream Tour, celebrating 20 years of music. The 43-date North American tour kicks off August 10, featuring Marshmello, The All-American Rejects, and Boys Like Girls.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-emme-shine-at-othello-broadway-premiere-in-matching-black-outfits-glbs-2698353-2025-03-24",
      "headline": "Jennifer Lopez & Emme shine at Othello Broadway premiere in matching black outfitsJennifer Lopez and Emme attended Broadway's Othello premiere in stylish black outfits. The event featured star guests, including Joe Biden. Lopez reflected on motherhood while celebrating Emme's 17th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-residence-review-uzo-aduba-randall-park-giancarlo-esposito-shine-in-netflix-whodunnit-2698324-2025-03-24",
      "headline": "The Residence review: Uzo Aduba, Randall Park shine in sharp whodunnitReleased-Thu Mar 20, 2025Shondaland's latest offering - The Residence - is a gripping murder mystery set in the iconic White House. Led by Uzo Aduba as detective Cordelia Cupp, the series combines satire and social commentary with suspenseful storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-5-review-no-harvey-spector-but-ted-black-finally-delivers-sass-swag-and-story-worth-the-wait-2698336-2025-03-24",
      "headline": "Suits LA finally delivers as episode 5 brings sass, swag, and story worth the waitAfter the wait of four episodes, we get the one justifying what the 'Suits' franchise stands for. Ted Black is making you sit up and notice his world, and you are finally into it. Check out a no-spoiler commentary on the latest episode. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-reacts-after-pakistani-actor-javed-sheikh-calls-him-rude-2698297-2025-03-24",
      "headline": "Emraan Hashmi reacts after Pakistani actor Javed Sheikh calls him rudeActor Emraan Hashmi has reacted to veteran Pakistani actor Javed Sheikh's claims that he was rude to him during the shoot of Jannat. Hashmi said that the claims are false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-to-be-a-grand-pongal-release-check-announcement-2698306-2025-03-24",
      "headline": "Thalapathy Vijay's Jana Nayagan to be a grand Pongal release. Check announcementThalapathy Vijay shared the new poster of his film 'Jana Nayagan' online. The poster revealed the release date of the film, which is supposed to be his last. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/oscar-winner-christoph-waltz-joins-only-murders-in-the-building-season-5-2698257-2025-03-24",
      "headline": "Oscar winner Christoph Waltz joins Only Murders in the Building Season 5Two-time Oscar winner Christoph Waltz is set to appear in Season 5 of Hulu's Only Murders in the Building. The Austrian actor will join a cast that includes Keegan-Michael Key."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-says-high-time-deols-got-work-in-bollywood-we-were-waiting-for-it-2698262-2025-03-24",
      "headline": "Sunny Deol says 'high time' Deols got work in Bollywood: We were waiting for itActor Sunny Deol commented on the success enjoyed by him, his brother, Bobby Deol, and father, Dharmendra with newfound popularity in the industry. He spoke at the trailer launch of 'Jaat'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-singer-v-says-he-has-lost-10-kg-in-military-pics-2698254-2025-03-24",
      "headline": "BTS singer V says he has lost 10 kg in military, shares picsBTS singer V aka Kim Taehyung has shared brand-new photos from his time in the military. The artiste said he has lost 10 kilos during training. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-holds-tricolour-car-racing-team-secure-third-place-italy-2698261-2025-03-24",
      "headline": "Ajith holds tricolour, leads celebration as his car racing team secures 3rd placeAjith Kumar and his racing team secured third place in an international car racing championship in Italy. A video shows the actor leading the celebration by holding the tricolour and popping the champagne bottle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-responds-shekhar-kapur-claims-bandit-queen-edits-2698255-2025-03-24",
      "headline": "Prime Video responds to Shekhar Kapur's claims about Bandit Queen editsGiant streamer Prime Video reacted to Shekhar Kapur's complaint over the editing of his 1994 film Bandit Queen. The OTT platform has denied making any changes to the film. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-love-for-accessories-as-she-gives-a-peek-into-her-closet-2698161-2025-03-24",
      "headline": "Zeenat Aman shares her love for accessories as she gives a peek into her closetVeteran actor Zeenat Aman shared her love for accessories, revealing her preference for boutiques over high street brands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-group-newjeans-defy-court-order-perform-as-njz-before-announcing-hiatus-2698210-2025-03-24",
      "headline": "K-pop group NewJeans defy court order, perform as NJZ before announcing hiatusIn a surprising move, K-pop group NewJeans performed under the name NJZ at ComplexCon Hong Kong, defying a South Korean court ruling. The group debuted a new song and announced a temporary pause in activities."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/comedian-kunal-kamra-wont-apologise-eknath-shinde-joke-row-habitat-studio-mumbai-police-investigation-2698264-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Won't apologise but...: What Kunal Kamra told cops in Eknath Shinde joke rowThe stand-up comedian stirred a huge row with his indirect dig at Shinde for switching sides and joining the BJP after defecting from the erstwhile Shiv Sena, with the political outfit targeting him through threats and a police complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/judges-are-caesars-wife-allahabad-bar-wants-justice-varma-impeached-in-cash-row-2698289-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judges are Caesar's wife: Allahabad Bar wants Justice Varma impeached in cash rowThe Allahabad High Court Bar Association has demanded a review of Justice Yashwant Varma's rulings and his impeachment following a cash discovery at his residence. The association argues that judicial integrity is at stake and public trust is eroding.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-gives-centre-4-weeks-to-file-status-report-on-rahul-gandhis-citizenship-2698303-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre given 4 weeks for status report on plea over Rahul Gandhi's citizenshipIn 2019, BJP leader Subramanian Swamy had alleged that Rahul Gandhi had declared himself a British citizen in documents submitted to British authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cctv-meerut-murder-case-victim-bike-friend-chilling-murder-wife-lover-police-visuals-2698279-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CCTV shows Meerut man on bike with friend hours before wife, her lover killed himCCTV footage showed Saurabh Rajput and his friend on a bike entering a street to get food at 11.49 pm on March 3 before he was murdered by his wife Muskan Rastogi and her lover Sahil after a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dc-vs-lsg-live-score-updates-ipl-2025-delhi-capitals-vs-lucknow-super-giants-2698312-2025-03-24#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "DC vs LSG Live: Delhi Capitals in freefall inside powerplayDC vs LSG, IPL 2025 Live Score Updates: A nightmare start for Delhi Capitals in their 210-run chase after Shardul Thakur dismissed both Jake Fraser-McGurk and Abhishek Porel in his very first over, followed by M Siddharth dismissing Sameer Rizvi.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kunal-kamra-to-abusive-eknath-shinde-supporter-in-viral-call-tamil-nadu-shinde-sena-mumbai-studio-2698361-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I stay in Tamil Nadu: Clip of 'Kunal Kamra-Shinde supporter' call goes viralComedian Kunal Kamra was threatened in a purported call over his jokes mocking Deputy Chief Minister Eknath Shinde. India Today cannot verify the authenticity of the viral clip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/kunal-kamra-comic-timing-gone-wrong-for-bitter-or-verse-eknath-shinde-controversy-2698309-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "For bitter or verse, Kamra's comic timing gone wrongComics have a way with words and of telling the bitter truth. But once personal bitterness takes full control, comedy shrinks in size and becomes politics in disguise. For a comic, politics is a terrific slave but a terrible master."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salary-daily-allowance-pension-hike-of-mps-parliament-april-2023-2698249-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre notifies 24% hike in salaries, pensions for MPs and ex-ParliamentariansSitting MPs will receive a monthly salary of Rs 1.24 lakh as against Rs 1 lakh they received earlier. The pension for former MPs was hiked from Rs 25,000 per month to Rs 31,000 per month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-school-student-religious-remark-science-exhibition-probe-2698383-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Short clothes lead to…' Karnataka student's project at science fair sparks probeA viral video of a Karnataka school student making a controversial religious remark during a science exhibition has sparked outrage, raising concerns over education and prompting a government investigation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-eknath-shinde-controversy-karma-is-a-bitch-kangana-ranaut-bungalow-demolition-shiv-sena-sanjay-raut-2698212-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kamra's Kangana karma comes back to bite himJokes on Shiv Sena leader Eknath Shinde have landed stand-up comic Kunal Kamra in a spot. As people defended his right to free speech, some were quick to point out how he cheered on the BMC as it demolished actor Kangana Ranaut's bungalow in 2020. Though karma might have returned to bite Kamra, his right to free speech should be defended by all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-bjp-spar-over-constitution-change-remarks-2698221-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DK Shivakumar says his 'Constitution change' remark misquoted: What's the row?As BJP claims DK Shivakumar hinted at changing the Constitution for religion-based reservations, the Karnataka Deputy Chief Minister vehemently denied the charge. He called it the Centre's political ploy to take the focus away from more pressing matters. Here's what has happened so far.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/before-gandhis-non-violence-anushilan-samitis-arms-revolution-shook-the-britsh-raj-2698325-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Before Gandhi's non-violence, Anushilan Samiti's armed revolution shook the Britsh RajA skirmish for independence began in the early 20th century, even before Mahatma Gandhi's non-violent movement. Armed resistance by Anushilan Samiti took the British by surprise and put them on the back foot. Fighters like Khudiram Bose and Bagha Jatin made British officers fear for their lives in ways they never expected.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-collegium-repatriates-yashwant-varma-allahabad-high-court-cash-row-2698258-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court collegium recommends Justice Varma's transfer to Allahabad High CourtThe Supreme Court Collegium has recommended Justice Yashwant Varma's repatriation to the Allahabad High Court. This follows a cash discovery at his residence, which he denies being involved in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bryan-johnson-face-sexual-allegation-confidentiality-agreement-blueprint-2698141-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walked naked, discussed erection at work: Bryan Johnson faces sensational chargesTech entrepreneur Bryan Johnson faces allegations of inappropriate workplace behaviour, including nudity and sexual conversations, with former employees challenging his confidentiality agreements.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-the-habitat-kunal-kamra-eknath-shinde-joke-demolition-shiv-sena-vandalism-2698318-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All about The Habitat, Mumbai studio ransacked after Kunal Kamra's performanceThe Habitat studio in Mumbai, where comedian Kunal Kamra triggered a huge row for his joke on Maharashtra Deputy Chief Minister Eknath Shinde, has been a popular venue for stand-up comedy shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/12-year-old-us-boy-builds-nuclear-fusion-reactor-gets-visit-from-fbi-2697413-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12-year-old builds nuclear fusion reactor, gets visit from FBI12-year-old Jackson Oswalt, from Memphis, US, has built a nuclear fusion reactor in his bedroom and made a Guinness World Record for the youngest person to achieve fusion. Later on, he got a visit from the FBI to make sure all was good. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-makes-revanth-reddy-and-kt-rama-rao-enemies-in-hyderabad-frenemies-in-chennai-2698164-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What makes Revanth Reddy and KT Rama Rao enemies in Hyderabad, frenemies in ChennaiRevanth Reddy and KT Rama Rao, who are at each other's throats in Hyderabad almost every day, found themselves singing the same tune in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/perplexity-ai-ceo-aravind-srinivas-explains-why-he-never-explored-bengaluru-nikhil-kamath-podcast-2698282-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Perplexity AI CEO explains why he never explored Bengaluru on Nikhil Kamath's podcastPerplexity AI CEO Aravind Srinivas explained why he never explored Bengaluru on Nikhil Kamath's podcast. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chennai/story/rippling-0xppl-founder-prasanna-sankar-x-twitter-thread-harassed-by-wife-chennai-police-son-custody-post-divorce-2697961-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tech entrepreneur alleges harassment by wife, Chennai cops over child custodyThe founder of the software company Rippling and tech entrepreneur Prasanna Sankar made serious allegations against his estranged wife, amid their divorce and custody battle. While he claimed harassment by the police, the wife accused him of financial and sexual misconduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-nainital-naini-lake-water-crisis-shortage-tourism-deforestation-low-rainfall-snowfall-2698275-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nainital to face water crisis this summer?Naini Lake's water level has dropped to 4.7 feet, the lowest in 5 years, due to low rainfall and snowfall, raising fears of a summer water crisis in Nainital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-director-ashwath-marimuthu-meets-thalapathy-vijay-calls-it-dream-come-true-2698370-2025-03-24",
      "headline": "Dragon director Ashwath Marimuthu meets Thalapathy Vijay, calls it a dream come trueDirector Ashwath Marimuthu met his idol, Tamil superstar Thalapathy Vijay, and shared the emotional significance of the encounter with fans. The meeting was a dream come true for Marimuthu, who was deeply moved by Vijay's praise for his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-dances-his-heart-out-to-devara-song-ahead-of-its-japan-release-2698351-2025-03-24",
      "headline": "Jr NTR dances his heart out to Devara song ahead of its Japan release. WatchTelugu star Jr NTR has been busy promoting his last release, Devara, in Japan. The movie, also starring Janhvi Kapoor and Saif Ali Khan, will soon release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonas-brothers-announce-jonas20-living-the-dream-tour-see-full-dates-glbs-2698365-2025-03-24",
      "headline": "Jonas Brothers announce JONAS20: Living the Dream tour – See full datesThe Jonas Brothers announced their JONAS20: Living the Dream Tour, celebrating 20 years of music. The 43-date North American tour kicks off August 10, featuring Marshmello, The All-American Rejects, and Boys Like Girls.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-rishabh-pant-six-ball-duck-reactions-memes-2698412-2025-03-24",
      "headline": "Rs 27 crore ka duck: Rishabh Pant memes viral after LSG captain out for 0 vs DCIPL 2025, DC vs LSG: Rishabh Pant's debut for Lucknow Super Giants was forgettable with the bat. The wicketkeeper-batter affected the momentum of their innings by getting out for a six-ball duck against Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/son-of-former-yankees-star-brett-gardner-dies-after-falling-ill-on-vacation-glbs-2698410-2025-03-24",
      "headline": "Son of former Yankees star Brett Gardner dies after falling ill on vacationBrett Gardner's 14-year-old son, Miller, passed away after a sudden illness during a family vacation. The former Yankees outfielder and his family are mourning the heartbreaking loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lebron-james-nba-injury-status-will-he-play-against-orlando-magic-tonight-glbs-2698405-2025-03-24",
      "headline": "LeBron James NBA injury status: Will he play against Orlando Magic tonight?Los Angeles Lakers star LeBron James is listed as probable for Monday's matchup, March 24 against the Orlando Magic due to a groin injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/stephen-curry-injury-update-warriors-star-expected-to-return-soon-glbs-2698397-2025-03-24",
      "headline": "Stephen Curry injury update: Warriors star expected to return soonThe Golden State Warriors received positive news regarding Stephen Curry's injury. The star guard suffered a hard fall during the team's win over the Toronto Raptors on Thursday, March 20 during the NBA regular game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-kyrie-irving-celebrates-33rd-birthday-as-luka-doncic-sends-heartfelt-message-glbs-2698393-2025-03-24",
      "headline": "NBA: Kyrie Irving celebrates 33rd birthday as Luka Doncic sends heartfelt messageDallas Mavericks star Kyrie Irving turned 33 on Sunday, March 23, fans, teammates and fellow NBA players took time to wish him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ex-nba-player-butch-carter-joins-lawsuit-alleging-sexual-abuse-by-indiana-university-team-doctor-glbs-2698368-2025-03-24",
      "headline": "Ex-NBA player Butch Carter joins lawsuit alleging sexual abuse by Indiana University team doctorEx- NBA player Butch Carter has become the fifth former Indiana University basketball player to accuse longtime team physician Dr. Bradford Bomba of sexual abuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-bcci-central-contract-a-plus-category-2698359-2025-03-24",
      "headline": "BCCI central contracts: Will Rohit, Kohli continue in A+ category?The BCCI is set to announce the men's central contracts soon, with potential reshuffling in the A+ category following Rohit Sharma, Virat Kohli, and Ravindra Jadeja's T20I retirements, sparking discussions on player retainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-kl-rahul-misses-game-birth-child-2698343-2025-03-24",
      "headline": "DC vs LSG: KL Rahul misses out Delhi's opening game in VizagIPL 2025, DC vs LSG: KL Rahul missed the opening game of Delhi Capitals due to personal reasons. Delhi picked both Faf du Plessis and Jake Fraser-McGurk in their XI for the game on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-david-warner-karachi-kings-captain-shan-masood-replaced-2698326-2025-03-24",
      "headline": "Warner replaces Shan Masood as Karachi Kings captain in maiden PSL stintDavid Warner has been announced as Karachi Kings' new skipper for his maiden PSL season in 2025, replacing Shan Masood ahead of the highly anticipated tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-parents-reaction-csk-vs-mi-kerala-spinner-2698308-2025-03-24",
      "headline": "Watched every ball of CSK v MI, couldn't sleep from joy: Vignesh Puthur's motherIPL 2025, CSK vs MI: Vignesh Puthur called his parents twice after the match,sharing his excitement with them. The Kerala spinner took three wickets in his debut for Mumbai Indians in Chennai on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-bcci-central-contract-a-plus-category-2698359-2025-03-24",
      "headline": "BCCI central contracts: Will Rohit, Kohli continue in A+ category?The BCCI is set to announce the men's central contracts soon, with potential reshuffling in the A+ category following Rohit Sharma, Virat Kohli, and Ravindra Jadeja's T20I retirements, sparking discussions on player retainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-kl-rahul-misses-game-birth-child-2698343-2025-03-24",
      "headline": "DC vs LSG: KL Rahul misses out Delhi's opening game in VizagIPL 2025, DC vs LSG: KL Rahul missed the opening game of Delhi Capitals due to personal reasons. Delhi picked both Faf du Plessis and Jake Fraser-McGurk in their XI for the game on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-david-warner-karachi-kings-captain-shan-masood-replaced-2698326-2025-03-24",
      "headline": "Warner replaces Shan Masood as Karachi Kings captain in maiden PSL stintDavid Warner has been announced as Karachi Kings' new skipper for his maiden PSL season in 2025, replacing Shan Masood ahead of the highly anticipated tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vignesh-puthur-parents-reaction-csk-vs-mi-kerala-spinner-2698308-2025-03-24",
      "headline": "Watched every ball of CSK v MI, couldn't sleep from joy: Vignesh Puthur's motherIPL 2025, CSK vs MI: Vignesh Puthur called his parents twice after the match,sharing his excitement with them. The Kerala spinner took three wickets in his debut for Mumbai Indians in Chennai on Sunday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}