{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-foreign-investors-outflows-indian-stock-market-2630910-2024-11-09",
      "headline": "Only a weaker dollar will bring foreign investors back to India: Ruchir SharmaIn an interview with India Today News Director Rahul Kanwal, Ruchir Sharma explained that the primary factor hindering foreign capital inflows into India is the strength of the dollar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-donald-trump-india-us-trade-ties-tariff-plans-interview-2630877-2024-11-09",
      "headline": "Should India worry about Donald Trump's tariff plans? Ruchir Sharma explainsRuchir Sharma warned that under Donald Trump, India must brace for a more transactional approach, where deals could be made based on America's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bookingcom-parent-company-booking-holdings-job-cuts-company-reorganisation-plan-2630694-2024-11-09",
      "headline": "Booking plans job cuts as part of company's reorganisation planBooking Holdings, which owns brands like Booking.com and Kayak, did not disclose how many jobs would be affected but said it expected to provide more details on timing, likely impact on employees and financials \"in due course\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-market-value-rises-electric-automaker-shares-jumped-elon-musk-donald-trump-2630662-2024-11-09",
      "headline": "Elon Musk's Tesla hits $1 trillion market value after Trump winThe electric automaker's shares jumped 8.2 per cent to $321.22, catapulting the company's valuation above the trillion-dollar mark for the first time in more than two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-most-powerful-women-2024-awards-kalli-purie-speech-2630633-2024-11-09",
      "headline": "A woman's soulmate is another woman: Kalli Purie at Business Today MPW 2024Kalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, delivered the vote of thanks at Business Today's Most Powerful Women 2024 awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indias-women-achivers-honoured-at-business-todays-most-powerful-women-2024-awards-2630631-2024-11-09",
      "headline": "Watch: Trailblazers awarded at Business Today's Most Powerful Women 2024Business Today unveiled the 21st edition of its Most Powerful Women in Business list on Friday, celebrating 60 exceptional women leaders who are pioneering change, driving growth, and inspiring progress across diverse industries. This year's edition brings in 12 fresh faces and recognises four returning achievers, underscoring the dynamic nature of leadership in business. Watch the award ceremony here on India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/i-salute-the-trailblazers-kalli-purie-at-business-todays-most-powerful-women-event-2630629-2024-11-09",
      "headline": "I salute the trailblazers: Kalli Purie at Business Today's Most Powerful Women eventKalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, lauded the growing accomplishments and transformation of women leaders in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trailblazers-on-business-today-most-powerful-women-2024-list-2630545-2024-11-08",
      "headline": "Trailblazers on Business Today's Most Powerful Women 2024 listThis year's Business Today Most Powerful Women list introduces 12 new faces, four returning achievers, and 37 repeat honourees from last year. Two trailblazers entered the MPW Hall of Fame after seven-time wins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/americans-can-learn-a-lesson-or-two-from-india-piyush-goyal-on-women-representation-2630574-2024-11-08",
      "headline": "Americans can learn a lesson or two from India: Piyush Goyal on women representationUnion Minister of Commerce & Industry Piyush Goyal lauded India's approach to women's empowerment and said that Americans can learn a lesson or two from India on women representation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-cut-tariffs-harley-davidson-donald-trump-us-president-2630573-2024-11-08",
      "headline": "Harley-Davidson tariffs to be cut after Trump's return? Piyush Goyal respondsSpeaking at the Business Today's Most Powerful Women 2024 event, Piyush Goyal expressed India's openness to reconsidering the tariffs on the iconic motorcycles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-leaders-share-insights-on-achieving-work-life-balance-and-success-at-bt-mpw-2024-2630562-2024-11-08",
      "headline": "Women leaders share insights on achieving work-life balance and success at BT MPW 2024At the Business Today MPW 2024 session, Ritu Arora, CEO & CIO of Allianz Investment Management, Asia Pacific, Nirupa Shankar, Joint MD of Brigade Group; and Devita Saraf, Chairperson & CEO of Vu Group, shared insights on striking a fine balance between work, life, health and wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-need-to-move-from-being-savers-to-investors-radhika-gupta-2630549-2024-11-08",
      "headline": "Women need to move from being savers to investors: Radhika GuptaSpeaking at the Business Today Most Powerful Women 2024 event, Radhika Gupta, MD and CEO of Edelweiss Mutual Fund, emphasised the need for women to move beyond saving and start investing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/edelweiss-mutual-fund-radhika-gupta-on-women-phenomenal-savers-should-not-outsource-money-management-to-men-2630490-2024-11-08",
      "headline": "It's not complicated: Radhika Gupta urges women to manage their own moneySpeaking at Business Today's Most Powerful Women 2024 event, Edelweiss Mutual Fund Managing Director and CEO Radhika Gupta said that while women have been the \"chief financial officers\" of their households for generations, it's time to extend that role into the financial markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-have-always-had-a-tough-time-breaking-barriers-in-business-padmaja-ruparel-at-bt-mpw-2024-2630469-2024-11-08",
      "headline": "Women have always had a tough time breaking barriers in business: Padmaja Ruparel at BT MPW 2024Speaking at Business Today's Most Powerful Women 2024 event, Padmaja Ruparel said women always had a tough time breaking barriers in business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-accused-of-breaching-antitrust-laws-competition-commission-of-india-2630326-2024-11-08",
      "headline": "Zomato, Swiggy accused of unfair practices in food delivery market: ReportThe investigation found these companies implemented practices that gave preferential treatment to certain restaurants on their platforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fii-selling-it-gains-weak-q2-earnings-2630311-2024-11-08",
      "headline": "Sensex, Nifty end in red as FII selling offsets IT gains; RVNL tanks 6%The S&P BSE Sensex dropped 55.47 points to settle at 79,486.32, while the NSE Nifty50 fell 89.95 points to 24,109.40.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shiv-nadar-billionaire-edelgive-hurun-india-philanthropy-list-2024-rs-2153-crore-fy24-2630279-2024-11-08",
      "headline": "Shiv Nadar, billionaire with a big heart, donates Rs 2,153 crore in FY24For the third time in five years, Shiv Nadar and his family have topped the EdelGive-Hurun India Philanthropy List 2024, contributing Rs 2,153 crore in the fiscal year 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharan-hegde-faces-criticism-after-laying-off-15-employees-linkedin-post-2630199-2024-11-08",
      "headline": "Sharan Hegde of 1% Club faces criticism after laying off 15% employeesPopular finfluencer Sharan Hegde is facing backlash after announcing layoffs at his company, 1% Club. His LinkedIn post has drawn criticism from many on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-hotels-share-price-gains-6-percent-should-you-buy-sell-hold-brokerage-views-2630161-2024-11-08",
      "headline": "Indian Hotels share price jumps over 6% to hit 1-year high. Buy, hold or sell?Indian Hotels share price: After a softer June quarter, the Tata group's hospitality arm showed strong recovery, buoyed by wedding-driven demand in Mumbai and pent-up bookings delayed by Q1's election and weather impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-reliance-power-share-price-5-percent-lower-circuit-major-setback-seci-bank-2630148-2024-11-08",
      "headline": "Reliance Power share price hits 5% lower circuit after major setback. Details hereReliance Power shares have faced significant volatility this year. The stock has surged by 103% over the past year, reaching a 52-week high of Rs 54.25 in early October. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-slams-congress-divisive-tactics-they-cant-tolerate-obc-prime-minister-maharashtra-assembly-elections-2630862-2024-11-09",
      "headline": "PM slams Congress' 'divisive tactics': They can't tolerate OBC Prime MinisterPrime Minister Narendra Modi on Saturday launched a scathing attack on the Congress, accusing the party of attempting to divide the Other Backward Classes (OBCs) for political gains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-polls-jharkhand-election-trends-ruchir-sharma-investor-lok-sabha-2630866-2024-11-09",
      "headline": "Maharashtra, Jharkhand polls may follow national election trends: Ruchir SharmaAuthor Ruchir Sharma suggested that the upcoming Maharashtra and Jharkhand elections may follow recent Lok Sabha trends, citing a historical pattern. He, however, cautioned that each state election remains distinct. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-covid-procurement-scam-michael-dcunha-commission-of-inquiry-prosecution-of-yediyurappa-b-sriramulu-2630814-2024-11-09",
      "headline": "BJP's Yediyurappa, ex-Minister to face prosecution over misuse of Covid fundsThe recommendation stems from allegations regarding irregularities in the 2020 procurement of three lakh PPE kits from Chinese companies during the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-quetta-railway-station-bomb-blast-peshawar-bound-express-death-injured-2630734-2024-11-09",
      "headline": "CCTV captures moment massive blast ripped through Pak railway station, 25 killedThe blast took place inside the railway station when the Peshawar-bound express was about to leave for its destination, a senior police official said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/no-sex-marriage-us-women-korean-4b-movement-trending-americans-trump-presidential-election-2630185-2024-11-09",
      "headline": "Won't have sex, US women vow as part of 4B revenge against men for Trump winA large number of women in the US are blaming men for Donald Trump's victory, and joining the 4B movement in protest. The 4B movement, which has its origins in South Korea, is about women vowing no sex, no relationships, no marriage and no childbirth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-pm-shehbaz-sharif-congratulates-donald-trump-x-social-media-banned-trolled-2630673-2024-11-09",
      "headline": "Pak PM congratulates Trump, gets community noted for using X that he bannedPakistan's Prime Minister Shehbaz Sharif congratulated Donald Trump using X, faced criticism for using the platform after banning it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-railway-official-gets-trapped-between-engine-coach-dies-begusarai-barauni-lucknow-barauni-express-2630894-2024-11-09",
      "headline": "Railway worker crushed to death while decoupling engine and bogie in BiharThe railway official was decoupling the engine of the Lucknow-Barauni Express when it unexpectedly reversed, resulting in the trapping of the official between the engine and one of the coaches of the train. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-donald-trump-india-us-trade-ties-tariff-plans-interview-2630877-2024-11-09",
      "headline": "Should India worry about Donald Trump's tariff plans? Ruchir Sharma explainsRuchir Sharma warned that under Donald Trump, India must brace for a more transactional approach, where deals could be made based on America's interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/how-handbags-are-now-the-ultimate-accessory-for-men-2628975-2024-11-09",
      "headline": "How handbags are now the ultimate accessory for menMen have no need to shy away from pairing their outfit with a stylish handbag now, as this trend is taking the fashion world by storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/himachal-pradesh-chief-minister-samosa-cid-yeh-kya-samvidhan-bachayenge-2630564-2024-11-09",
      "headline": "Couldn't save samosas, yeh kya samvidhan bachayenge?Can the lords and saviours of the nation protect the Constitution if these saviours can't even save our savouries?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-unsafe-when-pm-modi-visits-shiv-sena-ubt-sanjay-raut-on-ek-hai-to-safe-hai-call-2630722-2024-11-09",
      "headline": "Maharashtra unsafe when PM visits: Sanjay Raut on 'ek hai to safe hai' callShiv Sena (UBT) leader Sanjay Raut on Saturday criticised Prime Minister Narendra Modi's \"Ek hai toh safe hai\" (We are safe if we are united) slogan, asserting that Maharashtra is already a safe state. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/desperate-to-move-to-canada-delhi-man-kills-mother-then-says-sorry-to-father-2630847-2024-11-09",
      "headline": "Desperate to move to Canada, Delhi man kills mother, then says sorry to fatherKrishan believed that his mother was practicing black magic to prevent him from going abroad. Convinced that she was the reason behind his failure to move to Canada, he attacked her with a knife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hum-saath-saath-hain-turns-25-salman-khan-neelam-kothari-saif-ali-khan-satish-shah-mahesh-thakur-himani-shivpuri-2630259-2024-11-09",
      "headline": "Hum Saath Saath Hain turns 25: Can new-age stars recreate 90s family magic?Sooraj Barjatya's film Hum Saath Saath Hain, which remains popular for its portrayal of love, unity, and family values, completed 25 years. On the occasion, the actors of the 1999 film discussed the possibility of witnessing a sequel, capturing its timeless appeal, despite shifting industry trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jk-national-conference-mla-qaiser-jamshaid-lone-tortured-army-officer-become-militant-2630659-2024-11-09",
      "headline": "Tortured by Army officer, wanted to become a militant: New J&K MLA's revelationNational Conference MLA Qaiser Jamshaid Lone said that during his younger years, he wanted to become a militant after he was \"tortured and humiliated\" by an Army officer during a military crackdown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-daughter-in-law-cruelty-sleep-on-carpet-prohibiting-tv-2630787-2024-11-09",
      "headline": "Making daughter-in-law sleep on carpet, prohibiting TV not cruelty: High CourtIn its ruling, the court acquitted the man, his parents, and his brother, who had been convicted by a lower court for cruelty towards his late wife.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/after-prabhas-leaked-kannappa-pic-team-offers-rs-5-lakh-to-catch-culprit-2630858-2024-11-09",
      "headline": "After Prabhas' leaked Kannappa pic, team offers Rs 5 lakh to catch culpritSouth star Prabhas' photo from the upcoming release, Kannappa, has been leaked online. Now, the team has offered Rs 5 lakh to catch the person responsible for the act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-teaser-ram-charan-kiara-advani-promise-an-unpredictable-entertainer-2630903-2024-11-09",
      "headline": "Game Changer teaser: Ram Charan promises an 'unpredictable' entertainerThe first full teaser of Ram Charan-starrer Game Changer is here. The S Shankar directorial also features Kiara Advani in a lead role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gujarati-family-holds-funeral-for-12-year-old-car-samadhi-performs-rituals-viral-video-2630731-2024-11-09",
      "headline": "Video: Gujarati family holds 'funeral' for 12-year-old car, over 1,500 attendees joinA family in Gujarat bid farewell to their beloved 12-year-old car with a full-fledged burial ceremony. Several videos of the event went viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-meerut-two-women-booked-burning-stray-puppies-alive-noise-complaint-2630732-2024-11-09",
      "headline": "Annoyed by noise, two women burn five puppies alive in UP's Meerut, case lodgedIn Uttar Pradesh's Meerut, two women allegedly burned five stray puppies alive due to noise frustration. Police have filed a case against the two accused. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/kon-waii-son-act-how-drinking-raw-chicken-blood-can-invite-serious-infections-2630759-2024-11-09",
      "headline": "Kon Waii Son act: How drinking raw chicken blood can invite serious infectionsThe potential impact of raw chicken blood on your health and why doctors insist on consuming well-cooked poultry\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-railways-overcrowded-festive-season-vande-bharat-china-train-driving-holiday-airfare-2630187-2024-11-08",
      "headline": "Indians stuffed in train toilets, China moves billions with little fussMillions of travellers get added in India during the festive season, putting pressure on the railway network. But how has China managed its lunar holiday travellers, which is much higher than India's? This is the bigger story behind people stuffed in train toilets in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/business-today-most-powerful-women-2024-awards-kalli-purie-speech-2630633-2024-11-09",
      "headline": "A woman's soulmate is another woman: Kalli Purie at Business Today MPW 2024Kalli Purie, Vice-Chairperson and Executive Editor-in-Chief, India Today Group, delivered the vote of thanks at Business Today's Most Powerful Women 2024 awards."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/can-artificial-rain-lessen-air-pollution-in-delhi-experts-question-effectiveness-2630897-2024-11-09",
      "headline": "Can artificial rain lessen air pollution in Delhi? Experts question effectivenessArtificial rain attempts to mimic the natural cleansing effects of rain on air quality. However, it introduces a pertinent question: can this method effectively reduce dust particles and overall pollution? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-polls-donald-trump-wins-nevada-clinches-battleground-state-2024-us-polls-2630856-2024-11-09",
      "headline": "Trump wins Nevada, clinches sixth battleground state in 2024 US polls Donald Trump secured his sixth battleground state by winning Nevada, extending his lead over Kamala Harris in the 2024 election. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-teaser-ram-charan-kiara-advani-promise-an-unpredictable-entertainer-2630903-2024-11-09",
      "headline": "Game Changer teaser: Ram Charan promises an 'unpredictable' entertainerThe first full teaser of Ram Charan-starrer Game Changer is here. The S Shankar directorial also features Kiara Advani in a lead role. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/video/bigg-boss-18-digvijay-singh-kashish-kapoor-splitsvilla-controversy-2630467-2024-11-09",
      "headline": "Digvijay Singh Rathee on BB 18, Kashish Kapoor and his Splitsvilla daysModel and actor Digvijay Singh Rathee spoke to India Today Digital about his wildcard entry in Bigg Boss 18 alongside Kashish Kapoor. He addressed his Splitsvilla controversy, shared his thoughts on co-contestant Vivian Dsena, and identified those he perceived as fake on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-grandmother-indrani-thakur-dies-brain-stroke-2630896-2024-11-09",
      "headline": "Kangana Ranaut's grandmother dies: Was painful to see her bed-riddenKangana Ranaut mourned the death of her grandmother, Indrani Thakur. In her tribute, the actor called her a remarkable woman and an inspiration to the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/amaran-box-office-day-9-sivakarthikeyan-sai-pallavi-film-earns-rs-122-crore-in-india-2630888-2024-11-09",
      "headline": "Amaran box office Day 9: Sivakarthikeyan film earns Rs 122 crore domesticallySivakarthikeyan's war drama, Amaran, has earned Rs 122 crore at the domestic box office. The film also stars Sai Pallavi in a pivotal role. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-real-madrid-coach-manager-retirement-clears-air-fire-me-laliga-2630914-2024-11-09",
      "headline": "Ancelotti clears retirement talks amidst Real Madrid form: Will have to fire meReal Madrid's Carlo Ancelotti reaffirmed his commitment to the club despite recent setbacks, emphasizing his focus on improving performance and dismissing any thoughts of retirement amid swirling rumors about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-committed-to-aggressive-batting-despite-mcg-failure-coach-andrew-mcdonald-2630886-2024-11-09",
      "headline": "Australia 'committed' to aggressive batting despite MCG failure: Coach McDonaldAustralia's head coach Andrew McDonald believes the team, led by Pat Cummins, will stick to its ultra-aggressive batting style despite suffering a heavy nine-wicket defeat to Pakistan in the second ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-fails-to-impress-in-debut-for-adelaide-strikers-in-wbbl-2630878-2024-11-09",
      "headline": "Smriti Mandhana fails to impress on debut for Adelaide Strikers in WBBLSmriti Mandhana made her debut for Adelaide Strikers and failed to make a mark in the Women's Big Bash League 2024. She managed only 6 runs and was dismissed by Shikha Pandey of Brisbane Heat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-vs-jemimah-rodrigues-star-india-batters-reflect-on-wbbl-faceoff-2630865-2024-11-09",
      "headline": "Smriti Mandhana vs Jemimah Rodrigues: Star India batters reflect on WBBL faceoffSmriti Mandhana and Jemimah Rodrigues reflected on their face-off in the Women's Big Bash league match between Adelaide Strikers and Brisbane Heat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/alexander-zverev-satisfied-with-his-performance-in-2024-2630857-2024-11-09",
      "headline": "Happy with where I am: Alexander Zverev satisfied with his performance in 2024World No. 2 Alexander Zverev is thrilled with his 2024 performance, feeling renewed after a tough recovery from his 2022 French Open ankle injury. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-wife-reacts-to-hundred-vs-proteas-my-forever-favourite-hero-2630836-2024-11-09",
      "headline": "Sanju Samson's wife reacts to hundred vs Proteas: My forever favourite heroSanju Samson's wife Charulatha reacted to her husband's scintillating hundred vs South Africa in Durban. She took to Instagram and captioned her story, \"My forever favourite hero\" alongside Samson's picture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-joins-javelin-legend-jan-zelezny-training-group-2630800-2024-11-09",
      "headline": "Neeraj Chopra joins Javelin great Jan Zelezny's training groupDouble Olympic medalist Neeraj Chopra has announced his new collaboration with javelin legend Jan Železný as his coach. The partnership aims to refine Chopra's technique and elevate his performance to new heights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-rinku-singh-number-six-aakash-chopra-2630799-2024-11-09",
      "headline": "Are India being fair to Rinku Singh? Aakash Chopra questions batter's spotAakash Chopra has questioned the Indian team management's decision to always send Rinku Singh down the order at No.6. The southpaw hasn't got a lot of chances to perform in recent times with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/would-have-continued-playing-till-50-james-anderson-on-his-retirement-2630797-2024-11-09",
      "headline": "Would have continued playing till 50: James Anderson on his retirementJames Anderson opened up about his retirement and said that he would have continued playing till 50. He recently expressed his interest in playing IPL as he registered his name in the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marseille-coach-roberto-de-zerbi-threatens-to-quit-as-home-woes-continue-2630794-2024-11-09",
      "headline": "Marseille coach Roberto De Zerbi threatens to quit as home woes continueRoberto De Zerbi declared he was \"ready to leave\" Olympique de Marseille after his team suffered a 3-1 home defeat to AJ Auxerre on Friday night. De Zerbi's side had won only one of their five home games, leaving the Italian coach frustrated and questioning his future with the club.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samsons-wife-reacts-to-hundred-vs-proteas-my-forever-favourite-hero-2630836-2024-11-09",
      "headline": "Sanju Samson's wife reacts to hundred vs Proteas: My forever favourite heroSanju Samson's wife Charulatha reacted to her husband's scintillating hundred vs South Africa in Durban. She took to Instagram and captioned her story, \"My forever favourite hero\" alongside Samson's picture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-joins-javelin-legend-jan-zelezny-training-group-2630800-2024-11-09",
      "headline": "Neeraj Chopra joins Javelin great Jan Zelezny's training groupDouble Olympic medalist Neeraj Chopra has announced his new collaboration with javelin legend Jan Železný as his coach. The partnership aims to refine Chopra's technique and elevate his performance to new heights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-rinku-singh-number-six-aakash-chopra-2630799-2024-11-09",
      "headline": "Are India being fair to Rinku Singh? Aakash Chopra questions batter's spotAakash Chopra has questioned the Indian team management's decision to always send Rinku Singh down the order at No.6. The southpaw hasn't got a lot of chances to perform in recent times with the bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/would-have-continued-playing-till-50-james-anderson-on-his-retirement-2630797-2024-11-09",
      "headline": "Would have continued playing till 50: James Anderson on his retirementJames Anderson opened up about his retirement and said that he would have continued playing till 50. He recently expressed his interest in playing IPL as he registered his name in the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marseille-coach-roberto-de-zerbi-threatens-to-quit-as-home-woes-continue-2630794-2024-11-09",
      "headline": "Marseille coach Roberto De Zerbi threatens to quit as home woes continueRoberto De Zerbi declared he was \"ready to leave\" Olympique de Marseille after his team suffered a 3-1 home defeat to AJ Auxerre on Friday night. De Zerbi's side had won only one of their five home games, leaving the Italian coach frustrated and questioning his future with the club.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-australia-a-2nd-unofficial-test-sam-konstas-fifty-2630786-2024-11-09",
      "headline": "Konstas special helps Australia beat India in 2nd unofficial TestSam Konstas' unbeaten 73 guided Australia A to a six-wicket victory over India A, securing a 2-0 sweep in the unofficial two-match Test series on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-paine-backs-37-year-old-usman-khawaja-to-play-longer-for-australia-2630771-2024-11-09",
      "headline": "Tim Paine backs 37-year-old Usman Khawaja to play longer for AustraliaFormer Australian Test captain Tim Paine is confident that, despite nearing 38, Usman Khawaja will continue representing Australia for a few more years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-kickboxer-shraddha-rangarh-exclusive-goals-world-champion-2630772-2024-11-09",
      "headline": "Want to be world champion in 2 years: Kickboxer Shraddha Rangarh reveals goalIn an exclusive interaction with Indiatoday.in, Indian kickboxer Shraddha Rangarh opened up on her dream of becoming a world champion and how the sport came into her life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-1st-t20i-live-streaming-when-and-where-to-watch-2630767-2024-11-09",
      "headline": "Sri Lanka vs New Zealand 1st T20I Live streaming: When and where to watch Sri Lanka and New Zealand will face each other for a 3-match T20I series, starting November 9 in Rangiri Dambulla International Stadium. New Zealand are coming off a 3-0 win in Test series vs India "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/in-pics-ms-dhonis-beach-day-out-with-daughter-ziva-in-phuket-2630748-2024-11-09",
      "headline": "In Pics: MS Dhoni's beach day out with daughter Ziva in PhuketMS Dhoni is currently holidaying with his family in Phuket, Thailand. The veteran wicketkeeper-batter was retained by the Chennai Super Kings as an uncapped player for Rs 4 corer ahead of IPL 2025 mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-sanju-samson-ravi-shastri-message-durban-2630730-2024-11-09",
      "headline": "Sanju, you just need 1 big hundred: Samson reveals Ravi Shastri's messageSanju Samson has revealed the message he got from Ravi Shastri before he started his golden run in T20Is for India. Samson scored his second consecutive hundred in T20Is on Friday, November 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/korea-masters-kiran-george-loses-to-top-seed-kunlavut-vitidsarn-in-semi-final-2630728-2024-11-09",
      "headline": "Kiran George loses to top seed Kunlavut Vitidsarn in semi-finalKorea Masters 2024: Kiran George was knocked out in the semi-finals after losing to top-seeded Kunlavut Vitidsarn in a 53-minute match on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-prasidh-krishna-auditions-for-perth-test-2630720-2024-11-09",
      "headline": "Prasidh auditions for Perth Test with all-round performance vs Australia AIndia A pacer Prasidh Krishna dismissed Marcus Harris and Cameron Bancroft on golden ducks in the second innings of the second unofficial Test against Australia A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/in-pics-ms-dhonis-beach-day-out-with-daughter-ziva-in-phuket-2630748-2024-11-09",
      "headline": "In Pics: MS Dhoni's beach day out with daughter Ziva in PhuketMS Dhoni is currently holidaying with his family in Phuket, Thailand. The veteran wicketkeeper-batter was retained by the Chennai Super Kings as an uncapped player for Rs 4 corer ahead of IPL 2025 mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-sanju-samson-ravi-shastri-message-durban-2630730-2024-11-09",
      "headline": "Sanju, you just need 1 big hundred: Samson reveals Ravi Shastri's messageSanju Samson has revealed the message he got from Ravi Shastri before he started his golden run in T20Is for India. Samson scored his second consecutive hundred in T20Is on Friday, November 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/korea-masters-kiran-george-loses-to-top-seed-kunlavut-vitidsarn-in-semi-final-2630728-2024-11-09",
      "headline": "Kiran George loses to top seed Kunlavut Vitidsarn in semi-finalKorea Masters 2024: Kiran George was knocked out in the semi-finals after losing to top-seeded Kunlavut Vitidsarn in a 53-minute match on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-prasidh-krishna-auditions-for-perth-test-2630720-2024-11-09",
      "headline": "Prasidh auditions for Perth Test with all-round performance vs Australia AIndia A pacer Prasidh Krishna dismissed Marcus Harris and Cameron Bancroft on golden ducks in the second innings of the second unofficial Test against Australia A."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-arsenals-declan-rice-a-doubt-for-london-derby-against-chelsea-mikel-arteta-2630716-2024-11-09",
      "headline": "Arsenal's Declan Rice a doubt for London derby against Chelsea: Mikel ArtetaArsenal manager Mikel Arteta is uncertain if Declan Rice will play against Chelsea due to a toe injury. The midfielder missed Arsenal's recent matches, raising concerns ahead of the London derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-samson-rohit-career-suryakumar-dhoni-move-2630711-2024-11-09",
      "headline": "Sanju Samson 2024. Rohit Sharma 2013: Has Suryakumar Yadav done an MS Dhoni?South Africa vs India: With role clarity and renewed confidence, Sanju Samson seems to be making the most of his chances in T20Is. On Friday, he became the first Indian batter to hit hundreds in back-to-back T20 internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-first-t20i-sanju-samson-form-kingsmead-durban-2630707-2024-11-09",
      "headline": "Ready to make full utilisation of my form: Samson after Durban 100Sanju Samson's explosive back-to-back T20I hundreds underscore his red-hot form, setting him up as a reliable asset for India's top order after years of missed chances. His consistency is establishing him as a vital player in the lineup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-nicholas-pooran-andre-russell-return-full-squads-2630703-2024-11-09",
      "headline": "WI vs ENG: Pooran, Russell, Hetmyer back in West Indies squad for 1st 2 T20IsWest Indies have announced their squad for the first two T20Is against England, marking the return of Nicholas Pooran, Andre Russell, and Shimron Hetmyer. The series is set to begin on November 9th at Kensington Oval, Barbados."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}