{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/boat-ipo-news-founder-exit-aman-gupta-sameer-mehta-resignation-investor-concern-red-flag-2818675-2025-11-13",
      "headline": "boAt founders step down before IPO: Should investors be concerned?Having been the face of their brands for years, these founders suddenly moving to non-executive positions has raised questions about intent and timing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/fujiyama-power-ipo-opens-for-subscription-check-key-details-latest-gmp-2818612-2025-11-13",
      "headline": "Fujiyama Power IPO opens for subscription: Check key details, latest GMPFujiyama Power has set its price band at Rs 216 to Rs 228 per share, with a lot size of 65 shares. At the upper end of the band, the IPO size stands at Rs 828 crore, comprising a fresh issue of Rs 600 crore (2.63 crore shares) and an OFS of Rs 228 crore (1 crore shares)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-q2-results-buy-hold-sell-2818604-2025-11-13",
      "headline": "Ashok Leyland shares jump after Q2 results. Should you buy, hold or sell?Ashok Leyland's Q2 numbers lifted the stock, with analysts divided between strong margin-led optimism and concerns over the MHCV cycle's volatility. With targets ranging widely, is the next leg of growth convincing enough?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-mamaearth-shares-jump-9-percent-after-strong-q2-earnings-should-you-buy-2818581-2025-11-13",
      "headline": "Honasa Consumer shares jump up to 9% after strong Q2 earnings: Should you buy?Honasa Consumer's strong Q2 turnaround, rising margins and category momentum have lifted the stock sharply, but stretched valuations and divided analyst views now raise the question: is the rally sustainable?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-ipo-day-3-details-subscription-gmp-trend-latest-gains-allotment-listing-date-2818576-2025-11-13",
      "headline": "PhysicsWallah IPO struggles to find takers: Should you subscribe?Despite strong brand recognition and support from anchor investors, the IPO has so far been subscribed only 14%, reflecting weak investor interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-slightly-lower-despite-global-optimism-record-low-inflation-2818552-2025-11-13",
      "headline": "Sensex, Nifty open slightly lower despite global optimism, record-low inflationAt around 9:21 am, the Sensex slipped 143 points to 84,323, while the Nifty50 fell 60 points to 25,816. Broader markets were also under pressure, indicating some profit booking after recent gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-silver-price-today-precious-metal-india-rate-impact-us-government-shutdown-end-donald-trump-buy-sell-2818535-2025-11-13",
      "headline": "Gold, silver rate today: How will US shutdown end impact precious metals?After weeks of uncertainty, both houses of the US Congress have passed a deal to reopen the government, ending the longest shutdown in US history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-government-open-shutdown-end-impact-stock-market-sensex-nifty-nse-bse-rally-fall-trading-view-today-2818527-2025-11-13",
      "headline": "US government shutdown to end: Will it result in a rally for Sensex, Nifty?Stock market today: Gift Nifty futures were trading at 25,950.5 points at 8:00 am, suggesting that the Nifty50 will open above Wednesday's closing level of 25,875.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/applying-for-a-personal-loan-do-not-fall-for-these-5-common-scam-tactics-2818292-2025-11-12",
      "headline": "Applying for a personal loan? Don't fall for these 5 common scam tacticsThe race to get fast loans has made many borrowers easy targets for fraudsters. Scammers use fake apps, urgent messages and sweet deals to trap people. Spotting the red flags can save you from serious financial trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-continue-to-rise-why-are-they-climbing-2818211-2025-11-12",
      "headline": "Gold prices continue to rise. Why are they climbing?After months of ups and downs, gold is once again on the rise. With fresh global triggers and growing demand, the metal is gaining strength. Here's a closer look at the factors fuelling the latest surge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-record-low-of-025-percent-in-october-as-food-prices-fall-2818191-2025-11-12",
      "headline": "Retail inflation eases to record low of 0.25% in October as food prices fallThe latest consumer price index (CPI) print was well below expectations and marks the lowest reading since the current CPI series began in 2015, which uses 2012 as the base year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-income-tax-refund-delayed-here-is-how-interest-is-calculated-on-it-2818150-2025-11-12",
      "headline": "Is your income tax refund delayed? Here's how interest is calculated on itWaiting endlessly for your tax refund can test anyone's patience. The silver lining? The government compensates you with interest for delays — at a fixed rate, calculated monthly. But there are rules, limits and exceptions. Let's decode them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-rally-end-higher-it-stocks-gain-tcs-tech-mahindra-up-2818136-2025-11-12",
      "headline": "Sensex, Nifty end higher as US optimism sparks IT rallyThe S&P BSE Sensex gained 595.19 points to close at 84,466.51, while the NSE Nifty50 added 180.85 points to end at 25,875.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-gold-etf-buying-bond-india-leads-us-china-shift-physical-precious-metals-why-reason-2818123-2025-11-12",
      "headline": "Gold without the glitter: Why investors are moving away from physical goldIn October 2025, India recorded the third-highest gold ETF inflows globally, behind only the United States and China, a clear sign that the country's love for gold is being redefined in the digital era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-a-house-just-because-you-can-afford-the-emi-think-again-2818050-2025-11-12",
      "headline": "Buying a house just because you can afford the EMI? Think againThe calculator may say you can afford it, but life may say otherwise. A home loan is not just a financial decision — it impacts savings, career choices, and long-term stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-enterprises-share-price-rally-over-6-percent-today-rights-issue-2818043-2025-11-12",
      "headline": "Explained: Why Adani Enterprises shares have gained over 6% todayAdani Enterprises share price: The rise came after the company announced plans for a Rs 24,930-crore rights issue, its biggest fundraising move since the cancelled follow-on public offering (FPO) in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-jump-5-percent-today-why-stock-is-gaining-today-2818041-2025-11-12",
      "headline": "IndusInd Bank shares jump 5% today. What's behind the rally?At around 1:20 pm, IndusInd Bank shares were up 4.38% at Rs 862.05 on the Bombay Stock Exchange (BSE), with trading volumes remaining strong through the afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indias-direct-tax-collection-up-7-percent-but-refunds-down-177-percent-what-does-it-mean-2817988-2025-11-12",
      "headline": "India's direct tax collection up 7%, but refunds down 17.7%. What does it mean?India's direct tax collection climbed 7% this year, but refunds dropped 17.7%. It leaves taxpayers asking what's really driving the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-jump-why-is-stock-market-rising-today-reason-us-india-deal-it-stocks-rally-asian-markets-2817983-2025-11-12",
      "headline": "Sensex jumps 600 points: 3 reasons why stock market is rising todayThe S&P BSE Sensex rose 663.63 points to 84,534.95, while the NSE Nifty50 jumped 196.25 points to 25,891.20 as of 11:38 am. The rally comes after days of sluggish trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-why-so-many-retail-investors-end-up-losing-money-2817758-2025-11-12",
      "headline": "The great IPO gamble: Why so many retail investors end up losing moneyThis is Part 1 of a three-part series examining how India's IPO boom is entering risky territory for retail investors amid sky-high valuations and growing market hype.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/delhi-crime-season-3-real-life-2012-case-that-inspired-shefali-shahs-show-2818652-2025-11-13",
      "headline": "Delhi Crime Season 3: Real-life 2012 case that inspired Shefali Shah's show The third season of 'Delhi Crime' explores the complexities behind the investigation into the abuse and death of the two-year-old. The latest season sheds light on a case that continues to haunt collective memory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-recalls-how-kriti-sanon-height-made-her-create-special-pair-heels-2818665-2025-11-13",
      "headline": "Kajol recalls how Kriti Sanon's height made her create special pair heels Kajol shared her funny first impression of Kriti Sanon from the 'Dilwale' sets, joking about her co-star's height and how she needed \"Kriti heels\" to match up. Kriti added to the fun, recalling a spooky hotel incident and her admiration for Hrithik Roshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/larissa-bonesis-number-1-wish-for-aryan-khans-birthday-steals-the-show-2818627-2025-11-13",
      "headline": "Larissa Bonesi's 'number 1' wish for Aryan Khan's birthday is cherry on the cake 'The Ba****ds of Bollywood' director Aryan Khan marked his 28th birthday with warm wishes from friends and family alike. However, it was a special message from his rumoured girlfriend, Larissa Bonesi, that stole the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-talks-about-why-shirish-avoids-industry-events-2818623-2025-11-13",
      "headline": "Farah Khan talks about why Shirish avoids industry events: People ignored him Farah Khan shared that her husband, filmmaker Shirish Kunder, often felt uncomfortable at events because people would ignore him and focus solely on her. The choreographer-director shared that this led to frequent fights early in their marriage until they decided he would skip gatherings that made him uneasy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/death-threats-online-hostility-girl-group-katseye-mental-health-challenges-2818609-2025-11-13",
      "headline": "KATSEYE opens up on receiving thousands of death threats: It's heavy and jarring Members of KATSEYE share their experiences with online hostility, reflecting on the emotional toll and the pressures of public life during an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-kavya-maran-new-york-relationship-rumours-2818584-2025-11-13",
      "headline": "Composer Anirudh, Kavya Maran dating? Vlogger captures duo strolling on NY streets Musician Anirudh Ravichander and Sun TV heiress Kavya Maran were recently seen walking together in New York, drawing attention from onlookers and sparking public curiosity about their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-says-his-father-was-upset-watching-him-get-beaten-up-in-early-roles-2818593-2025-11-13",
      "headline": "Nawazuddin says his father was upset watching him get beaten up in early roles Nawazuddin Siddiqui shared that his father once asked him to stop coming home because he was tired of seeing him get beaten up in films like 'Sarfarosh' and 'Munna Bhai MBBS'. The actor said his father finally appreciated his work after 'Gangs of Wasseypur' made him a household name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-parents-were-convinced-her-first-film-offer-was-prostitution-racket-2818569-2025-11-13",
      "headline": "Huma Qureshi's parents feared film offer was a scam Actor Huma Qureshi has revealed that her parents initially believed her first film offer was a 'prostitution racket'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-ar-rahman-unreleased-tere-ishk-mein-song-performance-mumbai-2818541-2025-11-13",
      "headline": "Dhanush's emotional Tamil song at Tere Ishk Mein Mumbai event moves audience Actor Dhanush delivered a live performance of an unreleased Tamil version of a song from 'Tere Ishk Mein' during the film's audio launch event in Mumbai. AR Rahman played the piano and together, the two created a special moment for the fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kris-jenner-plastic-surgeon-steven-levine-was-the-star-of-her-70th-birthday-bash-2818546-2025-11-13",
      "headline": "Kris Jenner's plastic surgeon Steven Levine was the star of her 70th birthday bash Kris Jenner's star-studded 70th birthday bash, hosted at Jeff Bezos and Lauren Sanchez's mansion, featured A-list guests from Beyoncé to Oprah Winfrey but it was her plastic surgeon, Dr. Steven Levine, who stole the spotlight online. Levine, credited for Jenner's viral new facelift, was seen celebrating alongside the Kardashian-Jenner clan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-girlfriend-box-office-collection-day-6-rashmika-mandanna-film-eyes-rs-20-crore-mark-2818533-2025-11-13",
      "headline": "The Girlfriend box office Day 6: Rashmika Mandanna's film eyes Rs 20-crore mark Rashmika Mandanna and Dheekshith Shetty's 'The Girlfriend' has crossed the Rs 10-crore mark within six days of its release, maintaining steady box office momentum. The romantic drama's upcoming weekend performance will be crucial in determining if it can reach the Rs 20-crore milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-praised-by-rashmika-mandanna-as-a-blessing-during-the-success-of-the-girlfriend-2818523-2025-11-13",
      "headline": "Rashmika Mandanna: Hope everyone has a Vijay Deverakonda in life, he's a blessing At the success meet of 'The Girlfriend' in Hyderabad, Rashmika Mandanna expressed gratitude to Vijay Deverakonda, referring to him as \"a blessing\" and sharing her hopes that everyone has such a person in their lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-box-office-day-6-collection-emraan-hashmi-yami-gautam-legal-drama-sees-slight-dip-2818528-2025-11-13",
      "headline": "Haq box office Day 6: Emraan Hashmi-Yami Gautam's legal drama sees slight dip Emraan Hashmi and Yami Gautam's courtroom drama 'Haq' has crossed Rs 11 crore at the domestic box office after a strong opening weekend. Despite a midweek dip, steady audience turnout and positive word-of-mouth suggest the film could maintain its momentum into the second weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jimmy-kimmel-live-suspension-jennifer-aniston-call-unity-voting-us-elections-2818497-2025-11-13",
      "headline": "Jennifer Aniston shares rare political stance after Jimmy Kimmel suspension Actor Jennifer Aniston responds to the suspension of 'Jimmy Kimmel Live!' by advocating for unity and the importance of voting, following controversy involving Jimmy Kimmel's remarks and subsequent network action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/love-otp-review-aniish-crafts-a-relatable-tale-mixing-humour-love-and-toxicity-2818457-2025-11-13",
      "headline": "Love OTP review: Aniish crafts relatable tale mixing humour, love, and toxicityRelease Date:Fri Nov 14, 2025 'Love OTP' review: Written, directed and starring Aniish, 'Love OTP' is an entertaining take on toxic relationships with relatable comedy as its strong point. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adah-sharma-half-the-country-wanted-to-protect-me-other-half-wanted-to-kill-me-2818260-2025-11-13",
      "headline": "Adah Sharma: Half the country wanted to protect me, other half wanted to kill me Actor Adah Sharma spoke to IndiaToday.in about receiving death threats post 'The Kerala Story' and why she deems controversial roles necessary. She also discussed her upcoming legal thriller 'Reeta Sanyal Season 2'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/red-white-royal-blue-sequel-confirmed-taylor-zakhar-perez-2026-filming-2818498-2025-11-13",
      "headline": "Actor Taylor Zakhar Perez says Red, White & Royal Blue 2 script is really good Taylor Zakhar Perez has expressed enthusiasm for the upcoming sequel to the film 'Red, White & Royal Blue', with plans underway to begin filming in 2026. The actor confirmed the script has been well received and shared insights about the production process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jimmy-kimmel-pays-emotional-tribute-to-bandleader-cleto-escobedo-iii-after-his-sudden-death-2818496-2025-11-13",
      "headline": "Jimmy Kimmel gets emotional paying tribute to Cleto Escobedo III. Watch Jimmy Kimmel pays homage to late-night bandleader Cleto Escobedo III, who died at the age of 59, with a heartfelt monologue and temporary pause of his programme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/adele-joins-tom-ford-cry-to-heaven-film-adaptation-2026-2818495-2025-11-13",
      "headline": "Singer Adele to star in Tom Ford's directorial Cry to Heaven: Report Singer Adele will star in Tom Ford's new film, marking her acting debut in the adaptation of Anne Rice's 'Cry to Heaven', with production scheduled for January and release planned for autumn 2026."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-blast-al-falah-university-haryana-hostel-room-doctors-planned-terror-attack-2818630-2025-11-13",
      "headline": "Building 17, room 13: Al-Falah University hostel where doctors plotted terrorDelhi blast: Investigations have revealed that room number 13 in building 17 inside the sprawling Al-Falah University campus served as the secret meeting point for the terror module."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-arrests-jaypee-infratech-md-manoj-gaur-money-laundering-homebuyers-fraud-2818644-2025-11-13",
      "headline": "ED arrests Jaypee Infratech MD Manoj Gaur in Rs 12,000-crore money laundering caseManoj Gaur was taken into custody under the Prevention of Money Laundering Act (PMLA) after investigators alleged his involvement in the diversion and misuse of funds collected from homebuyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/delhi-blast-minsiter-khawaja-asif-says-pakistan-is-ready-for-two-front-war-with-india-afghanistan-2818610-2025-11-13",
      "headline": "Ready for 2-front war with India, Afghanistan: Pak minister's latest blusterLinking the Islamabad suicide bombing to Kabul, Pakistan's Defence Minister Khawaja Asif said the attack was a \"message from the Afghan Taliban\" -- one Islamabad was \"fully prepared to respond to\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-car-blast-police-recovers-severed-hand-near-explosion-site-sends-it-for-forensic-testing-2818643-2025-11-13",
      "headline": "Three days after Red Fort blast, severed arm found 300 metres away on shop roofThe blast, which took place at 6.52 pm on Monday evening, was so strong that a severed arm was found almost 300 metres from the site of the explosion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-air-pollution-emergency-no-traffic-at-night-why-morning-air-toxic-aqi-today-severe-hazardous-level-ncr-smog-2818549-2025-11-13",
      "headline": "No traffic at night, but why is morning air most toxic?As pollution in Delhi peaks in winter, people are advised to avoid morning walks. But why is morning air so toxic despite low vehicular traffic at night? The early morning rise in PM2.5 and PM10 is a weather phenomenon as temperature inversion, with cooler air near the ground trapping pollutants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/from-jamia-to-jail-terror-tainted-al-falah-chancellor-jawad-siddiqui-shady-past-2818411-2025-11-12",
      "headline": "From Jamia to jail: Chancellor of terror-tainted Al-Falah has a shady pastAccording to a former colleague who spoke to India Today Fact Check on the condition of anonymity, Jawad became a Mechanical Engineering lecturer at Jamia Millia Islamia in 1993. But his ambitions far exceeded the humble podium of a college."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sania-mirze-single-mother-panic-attacks-shoaib-malik-divore-farah-khan-support-2818449-2025-11-12",
      "headline": "Sania Mirza details emotional toll of Shoaib Malik divorce, recalls panic attackSania Mirza has revealed she suffered panic attacks after her divorce from Shoaib Malik. The tennis star credited her close friend, Bollywood director Farah Khan, for helping her through one of her lowest emotional moments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-dhaka-violence-crude-bomb-attacks-sheikh-hasina-ict-verdict-today-2818575-2025-11-13",
      "headline": "Why Bangladesh has been rocked by violence, bomb attacks againDhaka violence: Bangladesh's capital, Dhaka, turned into a fortress on Thursday ahead of a crucial verdict by the International Crimes Tribunal against deposed Prime Minister Sheikh Hasina."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/field-marshal-munir-pakistan-military-ruler-bleed-india-terror-project-2818640-2025-11-13",
      "headline": "Field Marshal Munir's Musharraf planIs Pakistan's new dictator Asim Munir embracing a former dictator Pervez Musharraf's strategy of death by a thousand cuts?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/red-fort-blast-investigation-intensifies-police-search-missing-maruti-brezza-delhi-ncr-2818620-2025-11-13",
      "headline": "Brezza used for recce of Red Fort found inside Al-Falah University: SourcesAuthorities on Thursday found a Maruti Brezza linked to Delhi bomber after a massive hunt was launched for the vehicle. The car was found parked inside Al-Falah University."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/before-drone-chase-cctv-captures-sudden-knife-attack-on-groom-at-wedding-2818565-2025-11-13",
      "headline": "Before drone chase, CCTV captures sudden knife attack on groom at weddingA groom was stabbed during his wedding ceremony in Amravati, Maharashtra. The footage shows the bride and groom standing on stage when the accused, identified as Ragho Jitendra Bakshi, calmly approaches and suddenly lunges at the groom, stabbing him multiple times with a metal knife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/zoho-founder-sridhar-vembu-breaks-silence-after-arattai-drops-from-top-100-apps-list-says-he-is-thinking-long-term-2818608-2025-11-13",
      "headline": "Zoho founder Sridhar Vembu breaks silence after Arattai drops from top 100 apps listZoho founder Sridhar Vembu speaks about the Arattai's drop from the top 100 apps, saying such fluctuations are normal and the company is focused on long-term technology, not hype. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/kerala-goa-mizoram-youth-unemployment-despite-high-literacy-2818209-2025-11-13",
      "headline": "Literate, yet jobless: Are India's most educated states falling behind?Kerala, Goa and Mizoram have crossed 90 percent literacy but youth unemployment remains high. This highlights the urgent need to link education with employability and skill development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/train-them-then-go-home-scott-bessent-explains-trumps-new-h-1b-visa-policy-glbs-2818491-2025-11-13",
      "headline": "Train US workers, then go home: Scott Bessent explains Trump's new H-1B visa planTreasury Secretary Scott Bessent defended President Trump's visa strategy as key to reviving US manufacturing, saying it will rebuild skills in industries like shipbuilding and semiconductors after decades of outsourcing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-election-2025-bhagalpur-congress-ajeet-sharma-bollywood-neha-sharma-roadshow-glamour-campaign-votes-results-2818201-2025-11-13",
      "headline": "Actor-beti Neha Sharma a brahmastra for Congress MLA in Bhagalpur?With election season in Bihar, Bollywood actor and influencer Neha Sharma was back in Bhagalpur. She gave her Instagram feed a break from the usual film promotion, brand endorsements and travel posts and shared a Reel of a roadshow with her father, Congress MLA Ajeet Sharma. Is Neha Sharma really the \"Brahmastra\" and \"Hukum ka ikka\" for her dad?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/wealthy-italians-paid-bosnia-kill-civilians-1990s-civil-war-report-2818578-2025-11-13",
      "headline": "Wealthy Italians paid to go to Bosnia to kill civilians during 90s war: ReportMilan prosecutors are probing what they have described as \"sniper tourism\", where Italian nationals would randomly pick and choose people, including children, to kill on the streets of Sarajevo using snipers during the 1992-95 Bosnia War, considered to be the most violent in Europe since World War II."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/up-doctor-shares-video-elderly-woman-mocking-daughter-in-law-labour-pain-sparks-outrage-mother-in-law-2818585-2025-11-13",
      "headline": "UP doctor shares video of woman mocking daughter-in-law in labour, sparks outrageThe video shows the young woman lying on the hospital bed, surrounded by her family members. Her husband is seen holding her hand while other relatives laugh at the elderly woman's remarks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-red-fort-blast-live-updates-car-explosion-chandini-chowk-dr-umar-nia-pm-modi-faridabad-terror-module-2818500-2025-11-13",
      "headline": "Live: Al-Falah University hostel under lens, death toll rises to 13Delhi Red Fort Blast Live Updates: A powerful explosion ripped through a Hyundai i20 near Delhi's Red Fort Metro Station at around 6.50 pm on Monday, killing 13 people and injuring 20 others. The explosion took place in a slow-moving car that had stopped at a red light just outside the Red Fort metro station. The Union Cabinet on Wednesday officially classified the blast as a \"terrorist act\" carried out by \"anti-national elements.\" Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/red-fort-bomber-dr-umar-visited-faiz-e-ilahi-mosque-near-ramlila-maidan-before-blast-caught-on-cctv-2818511-2025-11-13",
      "headline": "Caught on CCTV: Red Fort bomber outside Tablighi Jamaat mosque on day of blast Live UpdatesCCTV cameras captured Dr Umar un Nabi entering and leaving the Faiz-e-Ilahi Mosque near Ramlila Maidan, opposite Turkman Gate, where he stayed for over 10 minutes before heading towards the Red Fort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/not-just-kidneys-and-heart-high-blood-sugar-levels-affect-your-flexibility-too-2818596-2025-11-13",
      "headline": "Not just kidneys and heart, high blood sugar levels affect your flexibility tooIndia is witnessing a rapid rise in diabetes cases affecting mobility. This silent impact on joints and spine is more concerning than the disease itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/auroras-shine-satellites-struggle-solar-storm-hits-earth-at-324-million-kmph-2818639-2025-11-13",
      "headline": "Auroras shine, satellites struggle: Solar storm hits at 3.24 million kmphAccording to space weather monitors, storm levels have fluctuated between category G1 (Minor) and G3 (Strong), with blasts of solar wind now exceeding 900 km/s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-sanctions-32-entities-individuals-indian-firm-farmlane-uae-marco-klinge-missiles-uav-programme-china-ukraine-2818590-2025-11-13",
      "headline": "US sanctions Indian company for director's role in Iran missile, drone programmeThe Donald Trump-led US government has sanctioned Chandigarh-based Farmlane Private Limited and its UAE-based director, Marco Klinge, for allegedly supplying materials linked to Iran's ballistic missile and drone development. The action, taken under Trump's maximum pressure programme, will freeze the company's assets in the US and bar any American entity from doing business with it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/ananya-panday-farah-khan-is-gen-z-the-therapy-generation-thats-emotionally-liberated-but-too-sensitive-2818069-2025-11-13",
      "headline": "Is Gen Z the therapy generation that's emotionally liberated but too sensitive?Gen Z loves to talk about their emotions, but sometimes maybe a little too much. Does this emotional openness make them a bit too sensitive?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-moves-t20-tri-series-to-rawalpindi-after-islamabad-blast-2818611-2025-11-13",
      "headline": "Pakistan move tri-series to Rawalpindi after Sri Lanka players flag safety concernsPakistan has shifted its upcoming T20 tri-series to Rawalpindi due to rising security concerns in the wake of a suicide attack in Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-recalls-how-kriti-sanon-height-made-her-create-special-pair-heels-2818665-2025-11-13",
      "headline": "Kajol recalls how Kriti Sanon's height made her create special pair heelsKajol shared her funny first impression of Kriti Sanon from the 'Dilwale' sets, joking about her co-star's height and how she needed \"Kriti heels\" to match up. Kriti added to the fun, recalling a spooky hotel incident and her admiration for Hrithik Roshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/larissa-bonesis-number-1-wish-for-aryan-khans-birthday-steals-the-show-2818627-2025-11-13",
      "headline": "Larissa Bonesi's 'number 1' wish for Aryan Khan's birthday is cherry on the cake'The Ba****ds of Bollywood' director Aryan Khan marked his 28th birthday with warm wishes from friends and family alike. However, it was a special message from his rumoured girlfriend, Larissa Bonesi, that stole the show. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-cheteshwar-pujara-sai-sudharsan-jurel-test-cricket-2818661-2025-11-13",
      "headline": "Sai Sudharsan has potential but needs to start converting his starts vs SA: Pujara Former India batter Cheteshwar Pujara feels the upcoming Test series against South Africa will be key for Sai Sudharsan, who has impressed with his potential but is still searching for big scores despite several promising starts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-moves-t20-tri-series-to-rawalpindi-after-islamabad-blast-2818611-2025-11-13",
      "headline": "Pakistan move tri-series to Rawalpindi after Sri Lanka players flag safety concerns Pakistan has shifted its upcoming T20 tri-series to Rawalpindi due to rising security concerns in the wake of a suicide attack in Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-enter-japan-masters-quarterfinal-beat-jia-heng-jason-teh-badminton-2818580-2025-11-13",
      "headline": "Japan Masters: Lakshya Sen enters quarterfinal after beating Jia Heng Jason Teh Lakshya Sen advanced to the quarterfinals of the Kumamoto Masters Japan with a straight-games win over Singapore's Jia Heng Jason Teh on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/euro-2028-uk-ireland-cardiff-opening-wembley-final-2818563-2025-11-13",
      "headline": "Euro 2028 to kick off in Cardiff, Wembley to host final Cardiff will host the opening match of the 2028 European Championship on June 9, while the final has been scheduled for London's Wembley Stadium on July 9, tournament organiser UEFA announced on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-5th-t20i-jacob-duffy-leads-new-zealand-to-eight-wicket-win-over-west-indies-2818554-2025-11-13",
      "headline": "NZ vs WI: New Zealand cruise past West Indies after Duffy sparks top-order collapse Jacob Duffy's four-wicket burst and a commanding opening stand from Tim Robinson and Devon Conway powered New Zealand to an eight-wicket win over the West Indies. The visitors crumbled early and never recovered as the hosts wrapped up the chase with ease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-hashim-amla-says-inexperience-could-help-south-africa-in-india-tests-2818534-2025-11-13",
      "headline": "No past scars, no fear: Hashim Amla on why South Africa's rookies may thrive in India Hashim Amla believes South Africa's inexperience in Indian conditions could be a hidden strength, freeing the Proteas from past baggage. With only five players from the 2019 tour returning, he feels a fresh mindset may help them rewrite their story in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-steve-smith-questions-england-pace-heavy-bowling-strategy-australia-2818532-2025-11-13",
      "headline": "Australia's Steve Smith questions England's all-out pace plans for Ashes Steve Smith believes England may have picked the wrong bowlers for the Ashes, arguing that Australian wickets are likely to reward seam and swing more than an all-out pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-crisis-deadlock-stalls-isl-i-league-season-2818512-2025-11-13",
      "headline": "ISL, I-League clubs to meet Sports Minister after failed talks with AIFF chief The crisis in Indian football escalated on Wednesday, landing at the doorstep of Sports Minister Mansukh Mandaviya after talks between the national federation and CEOs of Indian Super League (ISL) clubs failed to resolve the deadlock that has stalled the domestic circuit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sanam-sekhon-india-drift-king-guinness-world-record-2818139-2025-11-13",
      "headline": "Tyre smoke, control: India's drift king Sanam Sekhon on his Guinness record ride India's very own Drift King, Sanam Sekhon, did the unthinkable when he pulled off the perfect drift to claim the Guinness World Record at the Umling La. Speaking to India Today, Sanam opens up on his journey, the legacy he wants to leave and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-series-2025-stat-pack-rishabh-pant-shubman-gill-2818313-2025-11-13",
      "headline": "Rishabh Pant eyes Sehwag's historic India record in South Africa Tests: Stat Pack IND vs SA, Stat Pack: Rishabh Pant, Shubman Gill, Ravindra Jadeja and other Indian players will eye key milestones in the upcoming Test series against South Africa, starting November 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-steve-smith-questions-england-pace-heavy-bowling-strategy-australia-2818532-2025-11-13",
      "headline": "Australia's Steve Smith questions England's all-out pace plans for Ashes Steve Smith believes England may have picked the wrong bowlers for the Ashes, arguing that Australian wickets are likely to reward seam and swing more than an all-out pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-crisis-deadlock-stalls-isl-i-league-season-2818512-2025-11-13",
      "headline": "ISL, I-League clubs to meet Sports Minister after failed talks with AIFF chief The crisis in Indian football escalated on Wednesday, landing at the doorstep of Sports Minister Mansukh Mandaviya after talks between the national federation and CEOs of Indian Super League (ISL) clubs failed to resolve the deadlock that has stalled the domestic circuit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sanam-sekhon-india-drift-king-guinness-world-record-2818139-2025-11-13",
      "headline": "Tyre smoke, control: India's drift king Sanam Sekhon on his Guinness record ride India's very own Drift King, Sanam Sekhon, did the unthinkable when he pulled off the perfect drift to claim the Guinness World Record at the Umling La. Speaking to India Today, Sanam opens up on his journey, the legacy he wants to leave and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-series-2025-stat-pack-rishabh-pant-shubman-gill-2818313-2025-11-13",
      "headline": "Rishabh Pant eyes Sehwag's historic India record in South Africa Tests: Stat Pack IND vs SA, Stat Pack: Rishabh Pant, Shubman Gill, Ravindra Jadeja and other Indian players will eye key milestones in the upcoming Test series against South Africa, starting November 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-super-kings-ipl-2026-retention-prediction-ravindra-jadeja-samson-2818467-2025-11-13",
      "headline": "IPL 2026 retention prediction: How will CSK shape up after Jadeja-Samson trade?Chennai Super Kings hit their lowest point in the IPL, finishing at the bottom of the table for the first time. The five-time champions are now set for a major reset ahead of next season, with several gaps in the squad needing attention. The proposed trade of Ravindra Jadeja for Sanju Samson is also expected to reshape the team's balance and give CSK a fresh direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-yashasvi-jaiswal-rajasthan-royals-captain-ravindra-jadeja-trade-aakash-chopra-2818458-2025-11-12",
      "headline": "Not Ravindra Jadeja, Yashasvi Jaiswal should be RR captain: Aakash ChopraAakash Chopra believes Rajasthan Royals should hand the captaincy to Yashasvi Jaiswal instead of Ravindra Jadeja. His comments come amid reports of a blockbuster trade between CSK and RR involving Jadeja, Curran, and Sanju Samson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sania-mirze-single-mother-panic-attacks-shoaib-malik-divore-farah-khan-support-2818449-2025-11-12",
      "headline": "Sania Mirza details emotional toll of Shoaib Malik divorce, recalls panic attackSania Mirza has revealed she suffered panic attacks after her divorce from Shoaib Malik. The tennis star credited her close friend, Bollywood director Farah Khan, for helping her through one of her lowest emotional moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-to-abandon-ongoing-pakistan-tour-after-islamabad-bomb-blast-2818445-2025-11-12",
      "headline": "SLC to take action against players considering leaving Pak after Islamabad blastThe Sri Lankan cricket board has warned its players of action who are thinking of pulling out of the ongoing Pakistan tour after a bomb blast in Islamabad. Several members of the Sri Lankan squad have informed their cricket board that they are unwilling to continue with the tour, citing security fears"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haryana-cm-felicitates-shafali-verma-with-rs-15-crore-prize-for-world-cup-win-2818408-2025-11-12",
      "headline": "Haryana CM felicitates Shafali Verma with Rs 1.5 Crore prize for World Cup winHaryana Chief Minister Nayab Singh Saini felicitated India's Women's World Cup-winning star Shafali Verma at his official residence in Chandigarh. Shafali played a pivotal role in India's World Cup triumph, being adjudged Player of the Match in the final for scoring 87 runs and taking two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-jasprit-bumrah-kagiso-rabada-key-role-pacers-eden-gardens-2818426-2025-11-12",
      "headline": "Jasprit Bumrah and Kagiso Rabada will play big role in IND vs SA Tests: Greame SmithGraeme Smith feels Jasprit Bumrah and Kagiso Rabada could define the India-South Africa Test series. The former Proteas captain said both sides must handle pace early before spinners take charge in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-vijay-hazare-trophy-participation-mca-official-2818358-2025-11-12",
      "headline": "No word from Rohit Sharma on availability for Vijay Hazare Trophy: MCA OfficialMumbai Cricket Association officials state Rohit Sharma has not yet communicated his availability for the Vijay Hazare Trophy. The BCCI has reportedly urged senior players to participate in domestic cricket to remain in ODI contention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-to-abandon-ongoing-pakistan-tour-after-islamabad-bomb-blast-2818445-2025-11-12",
      "headline": "SLC to take action against players considering leaving Pak after Islamabad blastThe Sri Lankan cricket board has warned its players of action who are thinking of pulling out of the ongoing Pakistan tour after a bomb blast in Islamabad. Several members of the Sri Lankan squad have informed their cricket board that they are unwilling to continue with the tour, citing security fears"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haryana-cm-felicitates-shafali-verma-with-rs-15-crore-prize-for-world-cup-win-2818408-2025-11-12",
      "headline": "Haryana CM felicitates Shafali Verma with Rs 1.5 Crore prize for World Cup winHaryana Chief Minister Nayab Singh Saini felicitated India's Women's World Cup-winning star Shafali Verma at his official residence in Chandigarh. Shafali played a pivotal role in India's World Cup triumph, being adjudged Player of the Match in the final for scoring 87 runs and taking two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-jasprit-bumrah-kagiso-rabada-key-role-pacers-eden-gardens-2818426-2025-11-12",
      "headline": "Jasprit Bumrah and Kagiso Rabada will play big role in IND vs SA Tests: Greame SmithGraeme Smith feels Jasprit Bumrah and Kagiso Rabada could define the India-South Africa Test series. The former Proteas captain said both sides must handle pace early before spinners take charge in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-vijay-hazare-trophy-participation-mca-official-2818358-2025-11-12",
      "headline": "No word from Rohit Sharma on availability for Vijay Hazare Trophy: MCA OfficialMumbai Cricket Association officials state Rohit Sharma has not yet communicated his availability for the Vijay Hazare Trophy. The BCCI has reportedly urged senior players to participate in domestic cricket to remain in ODI contention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-shardul-thakur-arjun-tendulkartraded-mumbai-indians-ipl-2026-retention-2818340-2025-11-12",
      "headline": "Shardul Thakur to MI? R Ashwin accidentally reveals big trade move for IPL 2026Ravichandran Ashwin accidentally revealed Shardul Thakur's trade to Mumbai Indians ahead of the IPL 2026 retention deadline. Thakur played for Lucknow Super Giants (LSG) in IPL and scalped 13 wickets from ten games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-new-zealand-defeat-lessons-spin-heavy-proteas-ryan-ten-doeschate-2818318-2025-11-12",
      "headline": "Hope India use New Zealand lessons vs spin-heavy South Africa: Ryan ten DoeschateIndia assistant coach Ryan ten Doeschate expects India's batters to apply lessons from last year's New Zealand defeat as they face defending World Test champions South Africa. The two-match series begins Friday at the Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghan-cricketer-rashid-khan-confirms-second-marriage-10-months-after-first-kabul-rumours-cricket-sports-2818271-2025-11-12",
      "headline": "Afghan cricketer Rashid Khan confirms second marriage, 10 months after firstAfghanistan cricket star Rashid Khan, who represents Gujarat Titans in the Indian Premier League (IPL), confirmed that he had married for a second time on August 2, 2025, just 10 months after his first marriage. His confirmation came after rumours sparked by charity event photos. Khan requested his privacy be respected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-responds-ian-botham-criticism-england-ashes-preparation-australia-tour-2818264-2025-11-12",
      "headline": "Stokes responds to Botham's criticism over Ashes preps: Not sure what more we can doBen Stokes has dismissed Ian Botham's criticism over England's Ashes preparations, insisting the team has done everything possible despite a packed schedule. He sounded confident that England will be ready when the series begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-beckham-gary-neville-india-visit-november-salford-city-promotion-2818265-2025-11-12",
      "headline": "David Beckham and Gary Neville set to land in India promoting Salford CityManchester United legends David Beckham and Gary Neville will visit India this November to promote their club Salford City. Their trip adds to a star-studded year for Indian football, with Lionel Messi also set to arrive soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-on-jasprit-bumrah-toughest-bowler-to-face-sa20-2818145-2025-11-12",
      "headline": "Bumrah is the toughest to face, hope we don't see him in SA20: Faf du PlessisFaf du Plessis has hailed Jasprit Bumrah as the toughest bowler to face in the world. He also jokingly hoped that he would never get to face him in South Africa's premier T20 competition SA20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahmudul-hasan-joy-century-leads-bangladesh-dominance-ireland-first-test-2818216-2025-11-12",
      "headline": "Bangladesh dominate Ireland in Sylhet Test after Mahmudul Hasan Joy 169BAN vs IRE, 1st Test: Mahmudul Hasan Joy's unbeaten 169 and a record fourth-highest opening stand with Shadman Islam powered Bangladesh to 338 for 1, giving them a 52-run lead over Ireland in the Sylhet Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-nitish-kumar-reddy-released-join-india-a-squad-2818217-2025-11-12",
      "headline": "Nitish Kumar Reddy released from India Test squad for South Africa seriesIndia all-rounder Nitish Kumar Reddy has been released from the Test squad ahead of the South Africa series. He will join India A in Rajkot to gain match time after recent injury setbacks."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}