{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rates-cancer-drugs-namkeen-health-insurance-postponed-nirmala-sitharaman-2596666-2024-09-09",
      "headline": "GST rates on cancer drugs cut, decision on health insurance postponedFinance Minister Nirmala Sitharaman, who chaired the GST Council meeting, said that GST rates on some cancer drugs have been reduced to 5 per cent from 12 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-delays-decision-on-insurance-premiums-to-next-meeting-report-2596572-2024-09-09",
      "headline": "GST Council delays decision on insurance premiums to next meeting: ReportCurrently, policyholders are paying 18% GST on their premiums, and many hoped this rate would be reduced to ease the financial pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-fully-subscribed-on-day-1-check-latest-gmp-subscription-2596536-2024-09-09",
      "headline": "Bajaj Housing Finance IPO fully subscribed. Check latest GMP, subscriptionBajaj Housing Finance IPO fully subscribed: The proceeds from this public offering will be used to strengthen Bajaj Housing Finance's capital base, positioning it to meet future business needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-sensex-nifty-end-higher-as-financial-stocks-surge-godfrey-phillips-down-5-percent-2596482-2024-09-09",
      "headline": "Sensex, Nifty end higher as financial stocks surge, Godfrey Phillips down 5%The S&P BSE Sensex added 375.61 points to close at 81,559.54, while the Nifty50 gained 84.25 points to end at 24,936.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-civil-aviation-minister-ram-mohan-naidu-government-to-monitor-airline-prices-amid-holiday-travel-surge-2596476-2024-09-09",
      "headline": "Government to monitor airline prices amid holiday travel surgeThe festive season typically sees a spike in travel demand, which often leads to increased ticket prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-madhabi-puri-buch-cotroversy-allegations-hindenburg-congress-internal-protests-2596441-2024-09-09",
      "headline": "Caught in a whirlwind: Sebi's Madhabi Puri Buch faces mounting scrutinyUnder increasing pressure from external allegations and internal unrest, Sebi Chairperson Madhabi Puri Buch faces a turbulent period marked by accusations of conflict of interest and claims of a toxic work culture. The path ahead remains uncertain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/18-percent-gst-income-on-transactions-under-rs-2000-awaits-fitment-committee-call-report-2596433-2024-09-09",
      "headline": " 18% GST on transactions under Rs 2,000 awaits fitment committee's call: ReportThe GST council did not make a final decision and chose to refer the issue to the fitment committee for further analysis and recommendations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscribe-or-not-key-details-price-band-gmp-and-brokerage-preview-2596377-2024-09-09",
      "headline": "Bajaj Housing Finance IPO: Should you subscribe or skip?Bajaj Housing Finance IPO: The company aims to raise up to Rs 7,000 crore through the IPO, which includes both fresh equity and an offer-for-sale component."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-factory-closure-germany-first-time-87-years-cut-cost-carmaker-manufacturing-2596366-2024-09-09",
      "headline": "Volkswagen proposes first-ever factory closure in Germany. Why it's a big deal?Volkswagen's management has revealed that the company's core brand needs to save 10 billion euros by 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-increase-international-routes-global-airline-2030-ceo-pieter-elbers-2596342-2024-09-09",
      "headline": "IndiGo plans to double international routes to 40 by year-end: ReportThe plan is part of a broader strategy to establish IndiGo as a leading global airline by 2030."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-relief-insurance-buyers-expert-view-expectations-2596334-2024-09-09",
      "headline": "GST Council Meeting: Major relief likely for insurance buyers? The Goods and Services Tax (GST) Council, which is meeting on September 9, 2024, in New Delhi, is expected to discuss the possibility of removing the 18% GST on term life insurance premiums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-warns-bangladesh-over-500-million-in-unpaid-power-dues-2596325-2024-09-09",
      "headline": "Adani Group warns Bangladesh over $500 million in unpaid power duesDespite recent growth, Bangladesh continues to face chronic energy shortages, worsened by dwindling domestic gas reserves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gala-precision-engineering-ipo-listing-hold-or-sell-expert-take-2596306-2024-09-09",
      "headline": "Gala Precision Engineering makes solid market debut. Hold or sell? Gala Precision Engineering IPO listing: The shares of the company made a strong debut, listing at a 42% premium over the issue price on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-10-things-to-know-issue-size-price-band-gmp-today-expert-view-2596268-2024-09-09",
      "headline": "Bajaj Housing Finance IPO: 10 points you need to knowThe proceeds from this public offering will be used to strengthen Bajaj Housing Finance's capital base, positioning it to meet future business needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/54th-gst-council-meet-today-life-insurance-to-report-on-online-gaming-what-to-expect-2596249-2024-09-09",
      "headline": "GST Council Meet today: Insurance tax, payment aggregators — what to expectGST Council Meeting: The session is expected to address several critical topics, including the taxation of insurance premiums, proposed rate rationalisations, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-opens-today-gmp-expected-gains-and-brokerage-views-2596241-2024-09-09",
      "headline": "Should you apply for Bajaj Housing Finance IPO? Check GMP, expected gainsBajaj Housing Finance IPO: Investors are anticipating strong listing gains, as indicated by the company's grey market premium (GMP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-us-jobs-data-reignites-recession-fears-2596228-2024-09-09",
      "headline": "Sensex, Nifty open lower as weak US jobs data reignites recession fearsThe S&P BSE Sensex was down 181.90 points at 81,002 at 9:19 am, while the NSE NIfty50 declined 49.55 points to trade at 24,802.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maximising-returns-how-to-select-top-mutual-funds-for-your-portfolio-investment-tips-money-wealth-2595507-2024-09-07",
      "headline": "Maximising returns: How to select top mutual funds for your portfolioMutual funds have emerged as a popular investment option, offering a balanced approach to growing wealth without the complexity of managing individual stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-criticises-auditor-bdo-exit-call-recordings-illegal-requests-demands-2595495-2024-09-07",
      "headline": "'Multiple call recordings exist': Byju's cries foul after auditor BDO resignsIn a strong response to BDO's resignation, Byju's has accused the audit firm of making unethical requests and manipulating the audit process, including suggesting the backdating of financial reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-auditor-bdo-resigns-financial-crisis-trouble-mounts-edtech-firm-legal-challenges-2595469-2024-09-07",
      "headline": "Byju's crisis worsens as second auditor BDO resigns over financial concernsBDO's exit comes just a year after Deloitte, the company's previous auditor, stepped down citing problems with Byju's financial reporting."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-trainee-doctor-mamata-banerjee-police-claims-bribery-charge-family-rape-murder-rg-kar-case-2596596-2024-09-09",
      "headline": "Kolkata doctor's mother alleges Mamata Banerjee is lying: We were offered moneyThe mother of the Kolkata trainee doctor, who was raped and murdered at RG Kar Hospital, hit back at West Bengal Chief Minister Mamata Banerjee over claims that the police bribed them, accusing her of lying."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/aap-congress-haryana-seat-sharing-talks-bjp-strongholds-arvind-kejriwal-2596664-2024-09-09",
      "headline": "Why did Congress-AAP alliance talks in Haryana fail? Inside storyDisagreements over seat-sharing between AAP and Congress have stalled their alliance for the Haryana Assembly elections as, sources said, AAP rejected BJP stronghold seats offered by the grand old party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rates-cancer-drugs-namkeen-health-insurance-postponed-nirmala-sitharaman-2596666-2024-09-09",
      "headline": "GST rates on cancer drugs cut, decision on health insurance postponedFinance Minister Nirmala Sitharaman, who chaired the GST Council meeting, said that GST rates on some cancer drugs have been reduced to 5 per cent from 12 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/fresh-iphone-16-pro-price-details-leak-hours-ahead-of-apple-event-tonight-2596510-2024-09-09",
      "headline": "Fresh iPhone 16 Pro price details leak hours ahead of Apple event tonightAccording to Mark Gurman, Apple could maintain the starting price of the iPhone 16 Pro at $999, quashing earlier rumours of a price hike for the entry-level Pro model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-not-a-pappu-uncle-sam-pitroda-reminds-people-congress-up-ke-ladke-narendra-modi-kiren-rijiju-2596649-2024-09-09",
      "headline": "Rahul Gandhi was referred to as Pappu, Uncle Sam reminds peopleAttacked as 'Pappu' by rivals, Congress leader Rahul Gandhi walked for over 4,000 km and worked tirelessly to shed that image. He spearheaded the Congress's poll campaign and reinvented himself. People forgot the 'Pappu' tag and even BJP leaders stopped using it for him, until Congress's very own Sam Pitroda reminded people of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kate-middleton-finished-chemotherapy-course-video-message-2596720-2024-09-09",
      "headline": "Kate Middleton completes chemotherapy: Out of darkness, can come lightBritain's Princess of Wales, Kate Middleton, released a video message on Monday nearly six months after disclosing that she had been diagnosed with an undisclosed form of cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/actor-darshan-kicked-renukaswamy-made-him-fall-at-pavithra-gowdas-feet-police-2596637-2024-09-09",
      "headline": "Actor Darshan 'hit Renukaswamy with branch, had Pavithra Gowda hit him': CopsAccording to the chargesheet filed by Bengaluru Police, actor Darshan admitted to \"forcefully kicking\" Renukaswamy's head, neck, and chest and using a tree branch to assault him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-bans-padma-ilish-hilsa-diplomacy-to-india-west-bengal-durga-puja-sheikh-hasina-dhaka-military-interim-government-2596348-2024-09-09",
      "headline": "Bangladesh targets Indian plate and palette, bans Padma hilsa for Durga PujaBangladesh had sent a 4,000-tonne consignment of Padma hilsa, considered to be tastier than the Indian varieties, before Durga Puja last year. Post-Hasina, Bangladesh has banned hilsa export in the months leading to Durga Puja in an assault on Indian plates and palettes. But hilsa-loving Indians seem to have found a way to skirt the ban.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/gujarat-couple-car-roof-flooded-river-2596635-2024-09-09",
      "headline": "Watch: Gujarat couple sits calmly on car roof for 4 hours in flooded river, rescuedThe vehicle was carried for 1.5 kilometres before stopping against a rock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-thirteen-year-old-fan-viral-video-armless-archer-watch-2596218-2024-09-09",
      "headline": "Inspired by local hero Sheetal Devi, teen without arms and legs begins trainingA viral video shows a 13-year-old girl from Sheetal Devi's village training in archery under the same coach, despite having no legs and arms. Her determination reflects the inspiring journey of India's Paralympic bronze medalist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-pic-mk-stalin-warm-welcome-tamils-in-us-2596700-2024-09-09",
      "headline": "Actor Vijay Sethupathi lauds 'incredible welcome' of MK Stalin by Tamilians in USActor Vijay Sethupathi shared a photo of Tamil Nadu Chief Minister MK Stalin receiving a warm welcome from Tamilians in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mpox-isolated-case-confirmed-india-not-public-health-emergency-declared-who-2596600-2024-09-09",
      "headline": "Mpox case detected in man not from current outbreak, no risk to public: CentreA new mpox case has been detected in India, the government confirmed, but said that the case was an isolated one and a \"travel-related infection\" after a man recently travelled to India from a country that is experiencing the outbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-empress-wu-zetian-rose-from-harem-throne-buddhism-nalanda-tang-zhou-dynasty-william-dalrymple-book-2596457-2024-09-09",
      "headline": "China's only empress rose from harem to throne, used Buddhism to capture powerWu Zetian was a fifth-grade concubine in the Chinese royal harem in the 7th century who rose to become China's only empress. William Dalrymple's new book, The Golden Road: How Ancient India Transformed the World, sheds light on how she used Buddhism and Nalanda-trained scholars to capture and consolidate power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/shiv-aroor-paralympics-india-historic-medals-29-inspiring-stories-2596651-2024-09-09",
      "headline": "Shiv Aroor's Take: Decimating stereotypes, Indian heroes script Paralympic historyParis Paralympics: In his popular segment, senior editor Shiv Aroor sheds light on the inspiring stories of India's Paralympic heroes from Paris. India shattered records and rallied against the odds to win 29 medals, its highest-ever tally in the history of the Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mars-on-a-budget-musks-billion-dollar-plan-to-travel-and-colonise-red-planet-2596305-2024-09-09",
      "headline": "Explained: The big bucks needed to travel and live on MarsIn a recent series of tweets, Musk shed light on the economic challenges and goals of making Mars travel a reality."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rameshwaram-cafe-attackers-ied-blast-karnataka-bjp-malleshwaram-bengaluru-office-ram-mandir-2596571-2024-09-09",
      "headline": "Rameshwaram Cafe attackers planned blast at BJP office on Ram Mandir inaugurationAccording to the NIA, Taaha and Shazib, who were Islamic State radicals, were funded by their handler through cryptocurrencies. They used these funds to perpetrate various acts of violence in Bengaluru, which included a failed IED attack at the BJP office in Malleshwaram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/bank-of-bengal-issued-indias-first-paper-currency-1812-2596559-2024-09-09",
      "headline": "When the Bank of Bengal issued India's first paper currency in 1812On September 9, 1812, the Bank of Bengal issued India's first paper currency, revolutionising the financial landscape and paving the way for modern banking practices in the subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/apple-iphone-16-launch-event-live-besides-the-iphone-16-series-apple-watch-series-10-airpods-4-expected-2596665-2024-09-09",
      "headline": "Apple iPhone 16 Launch Event Live: iPhone 16 series, Watch 10, AirPods 4 expectedApple iPhone 16 Launch Event 2024 Live Updates: Apple is hosting its annual iPhone event in San Francisco tonight at 10:30PM IST. The company will likely introduce iPhone 16, iPhone 16 Plus, iPhone 16 Pro and iPhone 16 Pro Max."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bccl-officer-union-minister-satish-chandra-dubey-shoes-pyjamas-jharkhand-viral-video-2596526-2024-09-09",
      "headline": "Video shows officer removing Union Minister's shoes, adjusting his pyjamasThe General Manager (GM) of Bharat Coking Coal Limited (BCCL) was caught on camera removing the shoes of Union Minister Satish Chandra Dubey and adjusting his pyjamas, sparking controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/supreme-court/story/kolkata-doctor-murder-case-supreme-court-west-bengal-government-chief-justice-2596221-2024-09-09",
      "headline": "Kolkata horror: Supreme Court flags 'missing' paper, warns doctors to resume work A Supreme Court bench headed by Chief Justice DY Chandrachud asked the CBI to file a fresh status report in the Kolkata rape-murder case by next Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/anubhav-sinha-upset-mukesh-chabbra-casting-rajiv-thakur-ic-814-2596363-2024-09-09",
      "headline": "Anubhav Sinha was upset that I auditioned: Actor who played 'Chief' in IC 814Rajiv Thakur, in an exclusive interview with IndiaToday.In, shared that director Anubhav Sinha was initially upset with casting director Mukesh Chhabra over his audition. Read on to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/mahavir-phogat-vinesh-phogat-olympics-gold-medal-politics-haryana-elections-congress-2596492-2024-09-09",
      "headline": "Vinesh should have focused on achieving her Olympic goal: Uncle Mahavir PhogatWrestler Vinesh Phogat's uncle Mahavir Phogat objected to his niece joining politics and contesting elections in Haryana and said he wanted her to focus on winning a gold medal in the 2028 Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-madhabi-puri-buch-cotroversy-allegations-hindenburg-congress-internal-protests-2596441-2024-09-09",
      "headline": "Caught in a whirlwind: Sebi's Madhabi Puri Buch faces mounting scrutinyUnder increasing pressure from external allegations and internal unrest, Sebi Chairperson Madhabi Puri Buch faces a turbulent period marked by accusations of conflict of interest and claims of a toxic work culture. The path ahead remains uncertain.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-presidential-poll-donald-trump-kamala-harris-neck-and-neck-ahead-of-televised-presidential-debate-2596564-2024-09-09",
      "headline": "Donald Trump, Kamala Harris neck and neck before televised presidential debateThe latest polling confirms that Trump retains locked-in support from about half of voters, despite the Republican's historic status as a convicted felon and his role in instigating the unprecedented attempt to overturn his 2020 loss to Joe Biden.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/kannada-actor-vinod-raj-fills-potholes-bengaluru-2596717-2024-09-09",
      "headline": "Video: Kannada actor Vinod Raj fills potholes in BengaluruKannada actor Vinod Raj, known for his social work, is continuing his pothole-filling mission. Currently, he is filling potholes on the road from Nelamangala to Doddaballapur in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-accident-x-post-2596702-2024-09-09",
      "headline": "Rashmika Mandanna shares health update after minor accidentActor Rashmika Mandanna shared that she had been in a 'minor' accident and was taking a break from social media to recover. In a recent X post, the actor also encouraged fans to prioritise their health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-pic-mk-stalin-warm-welcome-tamils-in-us-2596700-2024-09-09",
      "headline": "Actor Vijay Sethupathi lauds 'incredible welcome' of MK Stalin by Tamilians in USActor Vijay Sethupathi shared a photo of Tamil Nadu Chief Minister MK Stalin receiving a warm welcome from Tamilians in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurranas-electrifying-performance-to-lollipop-lagelu-aiims-patna-2596679-2024-09-09",
      "headline": "Watch: Ayushmann Khurrana's electrifying performance to Lollipop Lagelu in PatnaActor-singer Ayushmann Khurrana mesmerised the students of AIIMS Patna with his energetic performance of the Bhojpuri hit, Lollipop Lagelu. The video of his performance is rapidly gaining traction on social media."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/intercontinental-cup-2024-india-vs-syria-report-manolo-marquez-hyderabad-2596749-2024-09-09",
      "headline": "Intercontinental Cup 2024: Syria down hapless India 3-0 to win titleSyria downed a hapless India 3-0 to secure the Intercontinental Cup 2024 on Monday, September 2024 in Hyderabad. The Indian defence had a rough day at the office as Manolo Marquez' first assignment as coach ended on a sour note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bajrang-punia-takes-nada-to-court-to-compete-in-the-world-wrestling-championships-2596743-2024-09-09",
      "headline": "Bajrang takes NADA to court to compete in World Wrestling ChampionshipsOlympic bronze medallist Bajrang Punia has moved the Delhi High Court against NADA, seeking permission to compete in the World Wrestling Championships after being suspended. Bajrang alleged multiple violations by NADA during the doping test process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-rankings-us-open-champion-jannik-sinner-no-1-spot-taylor-fritz-top-10-2596723-2024-09-09",
      "headline": "Jannik Sinner tightens grip on No. 1 spot, Taylor Fritz returns to top 10US Open men's singles champion Jannik Sinner tightened his grip on the No. 1 spot while runner-up Taylor Fritz returned to the top 10 in the ATP rankings at No. 7 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-deepthi-jeevanji-interview-villagers-mocking-parents-sell-land-2596708-2024-09-09",
      "headline": "Mocked by neighbours, Deepthi fights social stigma to win Paralympic medalParalympics 2024: Speaking to India Today, track and field medalist Deepthi Jeevanji recalled her tough road to glory. Deepthi, 20, faced hostility from a bunch of superstitious neighbours, who ridiculed her intellectual impairment and suggested she be sent to an orphanage"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-start-sarfaraz-khan-test-vs-bangladesh-musheer-india-a-2596704-2024-09-09",
      "headline": "KL Rahul likely to start ahead of Sarfaraz Khan in Test series vs BangladeshKL Rahul's experience in Test cricket is expected to give him the edge over the fearless Sarfaraz Khan for India's Test series against Bangladesh. The team management is also focusing on the upcoming tour of Australia, where Rahul's past performances may prove crucial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-third-test-ollie-pope-reaction-oval-2596680-2024-09-09",
      "headline": "Credit to Sri Lanka but Oval Test loss not down to 'complacency': Ollie PopeEngland's stand-in captain Ollie Pope has claimed that complacency wasn't a reason behind his side's loss to Sri Lanka at the Oval on Monday, September 9. Sri Lanka prevented a clean sweep by the hosts on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paris-paralympics-deepthi-jeevanji-neighbours-parents-land-warangal-2596667-2024-09-09",
      "headline": "'Neighbours used to call me monkey': Deepthi Jeevanji recalls road to Paralympics gloryParis Paralympics: Deepthi Jeevanji, speaking to India Today, recalled her battle against the odds and support from family in her journey to Paralympic glory. The 20-year-old from Warangal, Telangana, won a bronze medal in the women's 400m T20 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/olly-stone-to-replace-rested-gus-atkinson-in-england-squad-for-australia-odis-2596660-2024-09-09",
      "headline": "Olly Stone to replace rested Gus Atkinson in England squad for Australia ODIsThe England and Wales Cricket Board (ECB) announced that fast bowler Gus Atkinson will be rested for this month's One-Day International series against Australia, with Olly Stone selected as his replacement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-england-oval-test-dhananjaya-de-silva-reaction-2596655-2024-09-09",
      "headline": "Sri Lanka's De Silva emotional after rare England win: Happiest moment Sri Lanka captain Dhananjaya de Silva was emotional after leading his team to a remarkable Test victory over England at The Oval. The eight-wicket win marked Sri Lanka's first Test triumph on English soil in a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/shiv-aroor-paralympics-india-historic-medals-29-inspiring-stories-2596651-2024-09-09",
      "headline": "Shiv Aroor's Take: Decimating stereotypes, Indian heroes script Paralympic historyParis Paralympics: In his popular segment, senior editor Shiv Aroor sheds light on the inspiring stories of India's Paralympic heroes from Paris. India shattered records and rallied against the odds to win 29 medals, its highest-ever tally in the history of the Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-navdeep-singh-exclusive-neeraj-chopra-inspiration-2596650-2024-09-09",
      "headline": "Paris 2024: How Neeraj Chopra inspired Paralympics champion Navdeep SinghIn an exclusive interaction with India Today, Paralympic champion Navdeep Singh revealed how Neeraj Chopra inspired him to take up javelin throw. Navdeep secured the gold medal in Paris with a record throw of 47.32 m. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paris-paralympics-deepthi-jeevanji-neighbours-parents-land-warangal-2596667-2024-09-09",
      "headline": "'Neighbours used to call me monkey': Deepthi Jeevanji recalls road to Paralympics gloryParis Paralympics: Deepthi Jeevanji, speaking to India Today, recalled her battle against the odds and support from family in her journey to Paralympic glory. The 20-year-old from Warangal, Telangana, won a bronze medal in the women's 400m T20 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/olly-stone-to-replace-rested-gus-atkinson-in-england-squad-for-australia-odis-2596660-2024-09-09",
      "headline": "Olly Stone to replace rested Gus Atkinson in England squad for Australia ODIsThe England and Wales Cricket Board (ECB) announced that fast bowler Gus Atkinson will be rested for this month's One-Day International series against Australia, with Olly Stone selected as his replacement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-england-oval-test-dhananjaya-de-silva-reaction-2596655-2024-09-09",
      "headline": "Sri Lanka's De Silva emotional after rare England win: Happiest moment Sri Lanka captain Dhananjaya de Silva was emotional after leading his team to a remarkable Test victory over England at The Oval. The eight-wicket win marked Sri Lanka's first Test triumph on English soil in a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/shiv-aroor-paralympics-india-historic-medals-29-inspiring-stories-2596651-2024-09-09",
      "headline": "Shiv Aroor's Take: Decimating stereotypes, Indian heroes script Paralympic historyParis Paralympics: In his popular segment, senior editor Shiv Aroor sheds light on the inspiring stories of India's Paralympic heroes from Paris. India shattered records and rallied against the odds to win 29 medals, its highest-ever tally in the history of the Paralympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-navdeep-singh-exclusive-neeraj-chopra-inspiration-2596650-2024-09-09",
      "headline": "Paris 2024: How Neeraj Chopra inspired Paralympics champion Navdeep SinghIn an exclusive interaction with India Today, Paralympic champion Navdeep Singh revealed how Neeraj Chopra inspired him to take up javelin throw. Navdeep secured the gold medal in Paris with a record throw of 47.32 m. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-oval-test-pathum-nissanka-127-records-2596634-2024-09-09",
      "headline": "Nissanka becomes 1st Sri Lankan opener in 13 years to hit Test ton in England England vs Sri Lanka, 3rd Test: 26-year-old Pathum Nissanka became the first Sri Lankan opener since Tilakaratne Dilshan in 2011 to hit a Test hundred in England. His unbeaten 127 helped Sri Lanka end their 10-year wait for a Test victory in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-beat-england-oval-test-stat-pack-nissanka-hundred-bazball-2596602-2024-09-09",
      "headline": "Sri Lanka's 4th Test win in England, rare hundred for Pathum NissankaSri Lanka completed the highest successful run chase by Asian teams in England to secure their fourth Test win on English soil. Pathum Nissanka's unbeaten 127 anchored the win, marking Sri Lanka's first Test victory over England since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/paralympic-champion-navdeep-recalls-viral-celebration-doesnt-feel-good-now-2596598-2024-09-09",
      "headline": "Paralympic champion Navdeep recalls viral celebration: 'Doesn't feel good now'Paralympic champion Navdeep Singh, in an exclusive interaction with India Today, reflected on his emotional outburst during the men's javelin F41 final at the 2024 Paralympic Games, where he ultimately secured the gold medal. In the heat of the moment, Navdeep Singh was captured on camera displaying raw frustration and using strong language after a throw. \"Looking back, it doesn't feel good now,\" Navdeep Singh admitted, acknowledging that his intense reaction was fueled by the high stakes of the competition. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-day-4-report-pathum-nissanka-hundred-oval-2596591-2024-09-09",
      "headline": "Oval Test: Pathum Nissanka Bazballs Sri Lanka to first win in England in 10 yearsPathum Nissanka was the star of the show as Sri Lanka denied England from completing a clean sweep of the series at the Oval on September 9, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-day-1-washed-out-wet-outfield-greater-noida-2596589-2024-09-09",
      "headline": "Wet outfield in Greater Noida washes out opening day of AFG vs NZ one-off TestAfghanistan vs New Zealand, one-off Test: No play was possible on the opening day of the Test match due to wet outfield at the Shaheed Vijay Singh Pathak Stadium in Greater Noida on Monday, September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-11-full-schedule-telugu-titans-vs-bengaluru-bulls-opener-2596565-2024-09-09",
      "headline": "Pro Kabaddi League season 11: Telugu Titans vs Bengaluru Bulls to start campaignThe full schedule of the Pro Kabaddi League season 11 has been released on September 9, Monday with Telugu Titans and Bengaluru Bulls starting the campaign on October 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tailender-iftikhar-ahmed-explains-his-role-in-the-pakistan-team-2596533-2024-09-09",
      "headline": "I consider myself tailender: Iftikhar Ahmed explains his role in Pakistan team Pakistan's white-ball specialist, Iftikhar Ahmed, at times \"felt like a tailender\" when the team management asked him to bat as low as number 7 and 8 in limited-over games for the national team in the recent past.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrids-rodrygo-upset-over-ballon-dor-top-30-snub-think-i-deserved-it-2596509-2024-09-09",
      "headline": "Real Madrid's Rodrygo 'upset' over Ballon d'Or top 30 snub: Think I deserved itReal Madrid forward Rodrygo admitted that he was upset over his snub from the Ballon d'Or top 30 list and felt he deserved to be there. Rodrygo was a key part of the Real Madrid team that won the LaLiga and the UEFA Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-new-zealand-one-off-test-day-1-washed-out-wet-outfield-greater-noida-2596589-2024-09-09",
      "headline": "Wet outfield in Greater Noida washes out opening day of AFG vs NZ one-off TestAfghanistan vs New Zealand, one-off Test: No play was possible on the opening day of the Test match due to wet outfield at the Shaheed Vijay Singh Pathak Stadium in Greater Noida on Monday, September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-11-full-schedule-telugu-titans-vs-bengaluru-bulls-opener-2596565-2024-09-09",
      "headline": "Pro Kabaddi League season 11: Telugu Titans vs Bengaluru Bulls to start campaignThe full schedule of the Pro Kabaddi League season 11 has been released on September 9, Monday with Telugu Titans and Bengaluru Bulls starting the campaign on October 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tailender-iftikhar-ahmed-explains-his-role-in-the-pakistan-team-2596533-2024-09-09",
      "headline": "I consider myself tailender: Iftikhar Ahmed explains his role in Pakistan team Pakistan's white-ball specialist, Iftikhar Ahmed, at times \"felt like a tailender\" when the team management asked him to bat as low as number 7 and 8 in limited-over games for the national team in the recent past.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrids-rodrygo-upset-over-ballon-dor-top-30-snub-think-i-deserved-it-2596509-2024-09-09",
      "headline": "Real Madrid's Rodrygo 'upset' over Ballon d'Or top 30 snub: Think I deserved itReal Madrid forward Rodrygo admitted that he was upset over his snub from the Ballon d'Or top 30 list and felt he deserved to be there. Rodrygo was a key part of the Real Madrid team that won the LaLiga and the UEFA Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-on-course-to-become-all-time-great-in-test-cricket-sourav-ganguly-2596503-2024-09-09",
      "headline": "Rishabh Pant on course to become all-time great in Test cricket: Sourav GangulyFormer India captain Sourav Ganguly believes Rishabh Pant is on track to becoming one of the all-time greats in Test cricket. However, he emphasises the need for Pant to enhance his performance in white-ball formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-test-cricket-squad-duleep-trophy-2596464-2024-09-09",
      "headline": "Back to his audacious and chirpy best, Rishabh Pant returns to Test cricket foldIndia vs Bangladesh: Rishabh Pant was at his best with both bat and gloves in the first round of the Duleep Trophy in Bengaluru. Chirpy behind the stumps, the wicketkeeper-batter looked confident on his return to red-ball cricket. As expected, Pant was named in India's squad for the upcoming two-Test series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captaincy-shan-masood-babar-azam-coaches-gillespie-kirsten-pcb-2596486-2024-09-09",
      "headline": "Don't sack Pakistan captains: Coaches Gillespie, Kirsten tell PCBPakistan's white and red ball head coaches Gary Kirsten and Jason Gillespie have advised the country's cricket board against sacking Babar Azam and Shan Masood."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}