{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/oracle-cuts-over-100-jobs-in-india-as-ai-reshapes-workforce-2784544-2025-09-09",
      "headline": "Oracle cuts over 100 jobs in India as AI reshapes workforceOracle, which employs around 30,000 people in India, reported a revenue of Rs 20,459 crore in the year ended March 2024, a 20% jump from the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/backpacking-on-a-budget-smart-forex-tips-for-young-travellers-2784521-2025-09-09",
      "headline": "Backpacking on a budget: Smart forex tips for young travellersFor young backpackers, every rupee counts. While cheap flights and hostels often top the checklist, the way you manage foreign exchange could quietly decide whether your trip stays on budget, or slips into overspending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/hyderabad-on-track-to-become-a-global-tech-hub-d-sridhar-babu-2784471-2025-09-09",
      "headline": "Hyderabad on track to become a global tech hub: D Sridhar BabuHyderabad is aiming to become a global technology hub, focusing on innovation, start-ups, and talent development. At the India Today Conclave South 2025, D Sridhar Babu, Minister for IT, E&C, Industries & Commerce, outlined the city's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-314-points-higher-nifty-above-24850-infosys-gains-5-percent-it-stocks-2784437-2025-09-09",
      "headline": "Sensex ends 314 points higher, Nifty above 24,850; Infosys gains 5%The S&P BSE Sensex was up 314.02 points to close at 81,101.32, while the NSE Nifty50 added 95.45 points to end at 24,868.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karishma-kapoor-kids-samaira-kiaan-legal-battle-sunjay-kapur-rs-30000-crore-wealth-2784430-2025-09-09",
      "headline": "Karisma Kapoor's children vs stepmother Priya in lawsuit over Sunjay Kapur's willSunjay Kapur's children, identified as the legal heirs, have filed a suit in Delhi High Court seeking partition of the estate, rendition of accounts, and a permanent injunction"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/hyderabad-aims-to-become-a-global-technology-hub-says-d-sridhar-babu-2784423-2025-09-09",
      "headline": "Hyderabad aims to become a global technology hub, says D Sridhar BabuHyderabad, according to  D Sridhar Babu, is positioning itself as a global technology and innovation hub, with a strong focus on AI, start-ups, industry, and skill development, while aiming to balance economic growth with social welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ericsson-lays-off-100-canadian-employees-amid-global-restructuring-2784363-2025-09-09",
      "headline": "Ericsson lays off 100 Canadian employees amid global restructuringEricsson has confirmed that about 100 of its Canadian staff will lose their jobs as the company continues to restructure its workforce worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/how-can-ease-of-business-be-improved-in-indias-real-estate-sector-2784309-2025-09-09",
      "headline": "How can ease of business be improved in India's real estate sector?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-pf-problem-why-so-many-employees-struggle-to-access-their-own-money-2784319-2025-09-09",
      "headline": "The PF problem: Why so many employees struggle to access their own moneyEvery month, employees across India save a part of their salary in the Provident Fund. But system errors, bureaucratic delays, and glitches mean that for millions, claiming their own PF money has become a frustrating challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/affordable-housing-india-how-to-build-cheap-houses-tax-tata-realty-ceo-sanjay-dutt-2784290-2025-09-09",
      "headline": "How can India achieve affordable housing? Tata Realty CEO explainsSanjay Dutt, Managing Director and CEO of Tata Realty & Infrastructure Ltd, spoke about how India can work towards making affordable housing more accessible and practical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-agarwals-to-patels-which-surnames-rule-india-richest-family-businesses-2784257-2025-09-09",
      "headline": "From Agarwals to Patels: Which surnames rule India's richest family businesses?Behind India's richest family businesses lies an interesting pattern, certain surnames appear again and again. The Hurun India Rich List 2025 reveals which surnames dominate this legacy of wealth, with Agarwals, Guptas and Jains leading the pack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/selling-property-here-are-9-smart-ways-to-save-on-capital-gains-tax-2784232-2025-09-09",
      "headline": "Selling property? Here are 9 smart ways to save on capital gains taxSelling property can bring you a good profit, but it often comes with the worry of paying a hefty capital gains tax. Luckily, the Income Tax Act offers several ways to cut down or even avoid this tax if you plan wisely."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-premanand-maharaj-why-shes-not-happy-his-reply-goes-viral-bigg-boss-19-2784682-2025-09-09",
      "headline": "Tanya Mittal asks Premanand Maharaj, why she's not happy, his reply goes viralTanya Mittal's old video about seeking happiness during her visit to Premanand Maharaj in Vrindavan has emerged online. This comes amid her entry in Salman Khan-hosted 'Bigg Boss 19'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/steven-spielberg-praises-leonardo-dicaprio-one-battle-after-another-insane-film-2784624-2025-09-09",
      "headline": "Steven Spielberg praises Leonardo Dicaprio's One Battle After Another: Insane filmDirector Paul Thomas Anderson's 'One Battle After Another' received high praise in its first reviews. Director Steven Spielberg and other critics praised the unique blend of absurdist comedy and intense storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-season-9-9-celebs-6-commoners-owners-vs-tenants-format-2784539-2025-09-09",
      "headline": "Inside Bigg Boss Telugu Season 9: 9 celebs, 6 commoners, owners vs tenants format'Bigg Boss Telugu 9' premiered on September 7, 2025, bringing together nine celebrities and six commoners under the new 'Owners vs Tenants' format. The season divides the house into separate groups, setting the stage for clashes and drama as the contestants navigate the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalyani-priyadarshan-on-lokah-success-proud-to-be-indias-1st-female-superhero-2784609-2025-09-09",
      "headline": "Kalyani Priyadarshan on Lokah's success: Proud to be India's 1st female superheroWith 'Lokah Chapter 1: Chandra' drawing acclaim, Kalyani Priyadarshan is being hailed for breaking new ground as India's first female superhero. In an exclusive conversation, the actor shared how she feels about her new title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-cancels-nepal-travel-plan-amid-protests-expresses-solidarity-2784612-2025-09-09",
      "headline": "Prajakta Koli cancels Nepal travel plan amid protests, expresses solidarityActor-Youtuber Prajakta Koli cancelled her Nepal travel plans amid Gen-Z protests, expressing concern for those affected by the unrest and a social media ban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saba-azad-imaad-shah-bond-after-breakup-we-became-less-judgmental-2784565-2025-09-09",
      "headline": "Saba Azad, Imaad Shah on their bond after breakup: We became less judgmentalActors Saba Azad and Imaad Shah recently opened up on their breakup and the evolution of their relationship. They stated that their bond has transformed into a strong, family-like friendship with mutual support and understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-feels-films-shape-beliefs-inspire-social-change-2783460-2025-09-09",
      "headline": "Actor Saiyami Kher feels films shape beliefs, inspire social change'Special Ops 2' actor Saiyami Kher, in an interview with IndiaToday.in, spoke about playing a spy and performing combat sequences. She also reflected on portraying strong characters on-screen, inspirational Hindi films and the role of sports in her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saloni-gaur-feels-excessive-censorship-limits-satire-and-art-2769924-2025-09-09",
      "headline": "Actor Saloni Gaur feels excessive censorship limits satire and artActor-comedian Saloni Gaur, in an exclusive interview with IndiaToday.in, expressed her views on censorship, mental health, digital detox and more. She was recently seen in the slice-of-life series 'Lafangey'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rise-and-fall-aahana-kumra-bali-explosive-fight-2784519-2025-09-09",
      "headline": "Ghatiya aurat, fake shakal: Aahana and Bali's explosive fight rock Rise & FallActor Aahana Kumra and influencer Bali engaged in a verbal clash during the nomination task on 'Rise & Fall.' Both contestants exchanged personal insults and called each other fake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/catherine-zetajones-watches-shah-rukh-kha-om-shanti-om-at-us-open-fans-praise-her-taste-2784554-2025-09-09",
      "headline": "Catherine Zeta-Jones watches SRK's Om Shanti Om at US Open, fans praise her tasteActor Catherine Zeta-Jones shared her fondness for Shah Rukh Khan's 'Om Shanti Om'. The actor enjoyed watching the iconic Bollywood film while waitig for US Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shwetha-menon-pushes-for-better-work-conditions-for-women-reflects-on-fixed-hours-2784562-2025-09-09",
      "headline": "Shwetha Menon pushes for better work conditions for women, reflects on fixed hoursActor Shwetha Menon, the first woman president of AMMA, stressed the need for fixed working hours for women in cinema at India Today South Conclave 2025. Drawing from her own pregnancy shoots, she highlighted how communication, support systems, and fear of career setbacks continue to shape women's struggles in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shwetha-menon-on-obscenity-case-was-shattered-then-became-fiery-tigress-2783770-2025-09-09",
      "headline": "Shwetha Menon on obscenity case: Was shattered, then I became a fiery tigressAt the India Today Conclave South 2025, actor Shwetha Menon reacted to the FIR filed against her while she was contesting for the president of Association of Malayalam Movie Artistes (AMMA). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shwetha-menon-amma-president-legal-cases-gender-bias-india-today-conclave-2025-2784497-2025-09-09",
      "headline": "Actor Shwetha Menon discusses being 1st woman leader of AMMA, safe working spacesActor Shwetha Menon took charge as the first female president of the Association of Malayalam Movie Artists (AMMA), highlighting key changes in the organisation post-Covid. She addressed challenges including legal cases and stressed communication and content over gender biases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/cooking-doesnt-define-a-woman-lesson-101-from-kunickaa-sadanand-tanya-mittal-bigg-boss-19-clash-2784526-2025-09-09",
      "headline": "Cooking doesn't define a woman - lesson 101 from Kunickaa-Tanya's BB 19 clashThe Kunickaa Sadanand vs Tanya Mittal clash in 'Bigg Boss 19' isn't just another kitchen fight, it shines a harsh light on how women empowerment is still misunderstood. Cooking doesn't define a woman, and the explosive debate proves why empowerment is about freedom of choice, not outdated gender roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-rise-and-fall-offered-films-because-of-my-talent-not-what-happened-2784340-2025-09-09",
      "headline": "Dhanashree: Getting movie offers for my talent, not because of what happenedChoreographer Dhanashree Verma opened up about getting multiple offers for films in the recent episode of 'Rise & Fall.' She said she is being offered films because of her talent and not what happened in her personal life. Dhanashree and cricketer Yuzvendra Chahal got divorced in March 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-being-human-punjab-flood-victims-rescue-aid-2784454-2025-09-09",
      "headline": "Punjab floods: Salman's Being Human foundation sends boats, to adopt villagesActor Salman Khan's Being Human foundation has joined the rescue and relief work as Punjab faces floods. The foundation has sent five boats to flood-affected areas. It has also planned to adopt flood-hit border villages near Husainiwala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rise-and-fall-bigg-boss-reality-tv-ashneer-grover-mx-player-2784377-2025-09-09",
      "headline": "Is Rise & Fall what Bigg Boss once used to be?'Rise & Fall' debuts as a fresh reality show focusing on power and social divides. Here's a look at how this show will remind you what 'Bigg Boss' used to be. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-gandhi-wins-standing-ovation-50th-toronto-film-festival-pratik-gandhi-2784453-2025-09-09",
      "headline": "Gandhi premiere at Tiff 2025: Hansal Mehta's series wins standing ovationFilmmaker Hansal Mehta's series 'Gandhi' had its grand premiere at the 50th Toronto International Film Festival. The series even received a standing ovation at the festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-ias-aspirant-fails-answer-rs-7-lakh-question-2784288-2025-09-09",
      "headline": "KBC 17: IAS aspirant fails to answer Rs 7.5 lakh question. Can you?Kaun Banega Crorepati 17: In the episode aired on September 8, the first contestant, Abhishek, took the hot seat. However, his journey came to an end at the Rs 7.5 lakh question, one that even the audience failed to answer correctly. Can you answer this?"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-burns-in-explosive-gen-z-protest-as-social-media-ban-row-topples-oli-regime-glbs-2784742-2025-09-10",
      "headline": "Nepal burns as explosive Gen Z protests topple Oli government, Army takes chargeNepal's protests entered its second day despite the government lifting the social media ban, leaving 22 dead and more than 300 injured. Gen Z protesters torched Oli's residence, set fire to the parliament buildings and attacked homes of senior leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/will-speak-to-pm-modi-trump-says-india-us-to-continue-trade-talks-glbs-2784767-2025-09-10",
      "headline": "Will speak to PM Modi: Trump says India, US to continue talks on trade barriersUS President Donald Trump on Tuesday said that his administration is continuing negotiations with India to address trade barriers between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nda-candidate-cp-radhakrishnan-elected-14th-vice-president-of-india-defeats-sudershen-reddy-by-152-votes-2784587-2025-09-09",
      "headline": "CP Radhakrishnan is Vice-President, Sudershan Reddy's tally shows cracks in OppositionNDA candidate CP Radhakrishnan is the 15th Vice President of India, defeating his rival INDIA bloc candidate B Sudershan Reddy (300) by 452 to 300 votes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-launches-iphone-17-pro-and-pro-max-with-48mp-triple-camera-and-a19-pro-chip-full-details-2784716-2025-09-09",
      "headline": "Apple launches iPhone 17 Pro, Pro Max in India with 48MP triple camera and A19 Pro chip: DetailsBilled as the most powerful iPhones ever created, the new Pro lineup introduces a redesigned camera system, fast A19 Pro chip, and the longest-ever battery life on an iPhone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-unrest-kp-sharma-oli-india-and-curious-timing-of-protests-social-media-ban-supreme-court-compliance-2784371-2025-09-09",
      "headline": "Oli, India and the curious timing of Nepal protestsThe massive protests in Nepal in which 20 people have been killed came ahead of PM KP Sharma Oli's planned trip to India and after his return from China. India's immediate neighbourhood has become a playground of diverse external forces. Though the Gen Z protests seem to be spontaneous, they come amid China-US tug-of-war and can be hijacked, warn experts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-feels-badly-about-israels-doha-strike-trump-assured-qatar-such-attack-wont-happen-again-white-house-2784706-2025-09-09",
      "headline": "US says it notified Qatar about Israeli strike, Doha says call came after attackThe Trump administration confirmed it was notified in advance of Israel's strike on Hamas negotiators in Doha but stressed it did not support the move, warning it undermines peace efforts with Qatar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stability-of-nepal-vital-to-india-pm-modi-in-peace-message-as-violence-rages-in-neighbouring-nation-2784660-2025-09-09",
      "headline": "Nepal's stability vital to India: PM urges peace as Kathmandu sees violent protestsPM Modi called the violence in Nepal \"heart-rending\", adding that the stability, peace and prosperity of the Himalayan nation are of \"utmost importance\" to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/doha-hit-by-multiple-blasts-targeting-hamas-leaders-glbs-2784575-2025-09-09",
      "headline": "Israel takes 'full responsibility' for Doha strike; Hamas says US complicitIsrael stated it would continue to act to \"defeat the Hamas terrorist organisation.\" The attack comes days after Israeli army chief Eyal Zamir threatened to target Hamas leaders abroad and hours after Israel's Foreign Minister Gideon Saar said the country had accepted a Gaza ceasefire proposal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-launches-iphone-17-air-calls-it-the-thinnest-iphone-it-has-ever-made-price-and-other-details-2784714-2025-09-09",
      "headline": "Apple launches iPhone Air with A19 Pro chip, calls it the thinnest iPhone ever made: Price and featuresThe term \"Air\" is not new to Apple. The suffix made its debut with the MacBook in 2008 with the scene of the late Steve Jobs pulling it out of an envelope, still iconic and one to beat at tech keynote events. Recently, the iPad got the Air update and now, finally, it is coming to the iPhone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/emmanuel-macron-appoints-loyalist-sebastien-lecornu-as-frances-new-prime-minister-news-agency-reuters-2784719-2025-09-09",
      "headline": "Emmanuel Macron appoints loyalist Sebastien Lecornu as France's new Prime MinisterFrench President Emmanuel Macron named Defence Minister Sebastien Lecornu as prime minister, replacing François Bayrou after a budget defeat, signalling continued pro-business reforms amid rising debt and a fragile minority government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/former-nepal-pm-jhala-nath-khanals-wife-succumbs-to-burn-injuries-after-protesters-set-house-ablaze-2784558-2025-09-09",
      "headline": "Former Nepal PM's wife dies of burns after protesters set their house on fireAccording to family members, a group of protesters allegedly forced her inside the residence before igniting the blaze. She was rushed to Kirtipur Burn Hospital in critical condition but could not survive her injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/ktaka-actor-darshan-poison-chitradurga-renukaswamy-murder-case-unbearable-jail-conditions-2784387-2025-09-09",
      "headline": "Fungus on hands, smelly clothes, can't live in jail: Darshan asks judge for poisonActor Darshan, accused in the Renukaswamy murder case in Karnataka, pleaded with the judge to give him poison, citing unbearable jail conditions. The judge refused his request. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dhaka-redux-how-nepal-is-following-bangladesh-script-line-for-line-protests-india-neighbouring-countries-similarity-explained-2784427-2025-09-09",
      "headline": "How Nepal is following Bangladesh script, line for line | 5 pointsNepal Prime Minister KP Sharma Oli resigned on Tuesday after protests by youngsters over social media ban turned into an anti-regime agitation. Nepal's Gen Z protests have uncanny similarities to the Bangladesh agitation from July-August 2024 that toppled the regime of PM Sheikh Hasina. Here's a 5-point explainer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-afghanistan-vs-hong-kong-sediqullah-omarzai-gulbadin-2784711-2025-09-10",
      "headline": "Asia Cup 2025: Dark horses Afghanistan crush Hong Kong to begin campaign in styleAfghanistan got their Asia Cup 2025 campaign off to a phenomenal start as they crushed Hong Kong by 94 runs in the tournament opener. Sediqullah Atal top-scored for his team with his unbeaten innings of 73* (52)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/record-80-indian-visa-rejections-by-canada-in-2025-only-9-top-choice-canada-colleges-2784289-2025-09-09",
      "headline": "Canada rejects 80% Indian student visas in 2025, top choice status fallsCanada, once a top destination for study-abroad aspirants, rejected 80% of visa applications for Indian students in 2025, the highest in a decade. Barely 9% of Indian study abroad aspirants now see it as the top choice. With growing uncertainty and mounting challenges, what does studying in Canada look like now, and what new study-abroad dreams are Indian students embracing?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-storms-out-viral-video-loss-vs-nikolas-theodorou-grand-swiss-2784699-2025-09-09",
      "headline": "Watch: Dejected Gukesh storms out of hall after 2nd staright Grand Swiss lossWorld Champion D Gukesh stormed out of the Samarkand playing hall after losing to Nikolas Theodorou, visibly frustrated. He did not speak to interviewers or fans, leaving immediately after the match without engaging with anyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-protests-discord-revolution-a-success-and-a-failure-2784606-2025-09-09",
      "headline": "How Discord became control room for Nepal's Gen Z protestsHow a poorly organised student agitation in Nepal turned into death and destruction"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-balen-shah-trusted-by-nepal-gen-z-protests-who-threw-out-oli-pm-whats-next-rapper-engineer-mayor-kathmandu-2784469-2025-09-09",
      "headline": "Who is Balen Shah, Gen Z protesters' favourite for Nepal PM?Balen Shah, Kathmandu's mayor and former rapper, has emerged as a trusted leader for Nepal's Gen Z, earning admiration for supporting the agitation against corruption and social media ban. Gen Zers, who forced out KP Sharma Oli from power, are batting for Shah to take over. Shah's 2022 victory symbolised a generational shift in Nepali politics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-nitish-kumar-is-wooing-bihars-woman-vote-2025-bihar-assembly-elections-2784499-2025-09-09",
      "headline": "How Nitish Kumar is wooing Bihar's woman voteNitish Kumar's Mukhya Mantri Mahila Rozgar Yojana is being pitched as another step towards women's self-reliance; yet the Bihar election subtext is unmistakable"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karishma-kapoor-kids-samaira-kiaan-legal-battle-sunjay-kapur-rs-30000-crore-wealth-2784430-2025-09-09",
      "headline": "Karisma Kapoor's children vs stepmother Priya in lawsuit over Sunjay Kapur's willSunjay Kapur's children, identified as the legal heirs, have filed a suit in Delhi High Court seeking partition of the estate, rendition of accounts, and a permanent injunction"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-updates-curfew-in-kathmandu-oli-government-in-emergency-huddle-security-forces-use-tear-gas-2783755-2025-09-08",
      "headline": "Live: Nepal Army Chief addresses nation amid violent protests, appeals for peaceKP Sharma Oli resigned as Nepal's Prime Minister on Tuesday following violent protests triggered by a ban on major social media platforms and anger over corruption. At least 22 people were killed and hundreds injured as police used deadly force against demonstrators, mostly youths leading what came to be called the \"Gen Z\" movement. Despite the government rolling back the ban, protests intensified on the second day, with crowds attacking and injuring Nepalese leaders. India Today is reporting live from ground zero in Nepal. Pankaj Das, Amit Bharadwaj and Rohit Singh are present at the scene. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-spy-on-millions-citizens-surveillance-chinese-firewall-western-phone-tapping-amnesty-report-2784524-2025-09-09",
      "headline": "Pakistan blends Chinese firewall, Western tools to spy on millionsThe security state of Pakistan, led by Asim Munir, fusing Chinese censorship tech with Western surveillance tools has built one of the world's most extensive monitoring systems outside China, reveals an Amnesty report. From mass phone-tapping to internet blackouts, the Munir-led regime is weaponising technology to crush dissent, silence opposition, and tighten military control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-protests-kp-sharma-oli-resigns-india-neighbourhood-turmoil-us-china-proxy-war-2784428-2025-09-09",
      "headline": "With Nepal, India's neighbourhood in turmoil again. US vs China playing out?Nepal protests: What started as an agitation in Nepal against a social media ban, quickly spiralled into protests against corruption, forcing Prime Minister KP Sharma Oli to resign. It follows a familiar script that happened in Bangladesh and Sri Lanka."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-win-rashid-khan-spinner-selection-omarzai-fastest-fifty-2784754-2025-09-10",
      "headline": "Asia Cup: Spoilt for choices, Rashid Khan says leading Afghanistan a tough jobAfghanistan captain Rashid Khan spoke about the challenge of managing the rich spin arsenal of his team. Afghanistan began their Asia Cup 2025 campaign with a massive 94-run win over Hong Kong as they left out Mujeeb ur Rehman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-most-expensive-player-pretoria-capitals-win-sa20-auction-2784757-2025-09-10",
      "headline": "SA20 Auction: Costliest buys, updated squads after intense bidding warsThe SA20 fourth season auction saw Dewald Brevis become the most expensive player ever. Intense bidding wars highlighted the event, reshaping team squads ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-suryakumar-yadav-salman-ali-agha-handshake-snub-viral-video-2784743-2025-09-10",
      "headline": "Did Suryakumar snub handshake with Pakistan captain? Viral clip clears airAsia Cup 2025: Suryakumar Yadav and Salman Ali Agha grabbed the spotlight at the captains' meet in Dubai on Tuesday, as speculation over the two skipping a handshake went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-afghanistan-vs-hong-kong-sediqullah-omarzai-gulbadin-2784711-2025-09-10",
      "headline": "Asia Cup 2025: Dark horses Afghanistan crush Hong Kong to begin campaign in styleAfghanistan got their Asia Cup 2025 campaign off to a phenomenal start as they crushed Hong Kong by 94 runs in the tournament opener. Sediqullah Atal top-scored for his team with his unbeaten innings of 73* (52)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-storms-out-viral-video-loss-vs-nikolas-theodorou-grand-swiss-2784699-2025-09-09",
      "headline": "Watch: Dejected Gukesh storms out of hall after 2nd staright Grand Swiss lossWorld Champion D Gukesh stormed out of the Samarkand playing hall after losing to Nikolas Theodorou, visibly frustrated. He did not speak to interviewers or fans, leaving immediately after the match without engaging with anyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-afghanistan-vs-hong-kong-azmat-omarzai-t20-record-fastest-fifty-2784692-2025-09-09",
      "headline": "Asia Cup: Azmat Omarzai begins campaign with record-breaking 20-ball fiftyAzmatullah Omarzai set a new record with the fastest fifty by an Afghanistan batter in T20Is. His explosive innings helped Afghanistan dominate Hong Kong in the opening match of Asia Cup 2025 in Abu Dhabi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/world-boxing-championship-nikhat-zareen-quarterfinals-beat-yuna-nishinaka-2784653-2025-09-09",
      "headline": "Nikhat Zareen battles past Nishinaka to reach Worlds Boxing Championship QFNikhat Zareen fought through a scrappy contest to edge Japan's Yuna Nishinaka and reach the World Boxing Championships quarterfinals. The Indian star now faces Turkey's Buse Naz Cakiroglu in her bid for a third world medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/abhimanyu-mishra-youngest-to-beat-world-champion-fide-grand-swiss-2025-2784648-2025-09-09",
      "headline": "Who is Abhimanyu Mishra: 16-year-old Grandmaster stuns D Gukesh in FIDE Grand SwissFIDE Grand Swiss 2025: At 16, Abhimanyu Mishra defeated reigning world champion Gukesh Dommaraju in a stunning 61-move match. The stunning victory came a day after the American Grandmaster held top seed R Praggnanandhaa with black pieces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manrekar-excludes-rohit-sharma-from-all-time-indian-batting-great-list-2784647-2025-09-09",
      "headline": "Rohit Sharma does not fit in all-time Indian greats list: Sanjay ManjrekarSanjay Manjrekar has excluded Rohit Sharma from the all-time Indian batting greats list, citing his Test record. Rohit retired from Tests earlier this year after scoring 4301 runs from 67 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-uae-live-streaming-predicted-xi-pitch-conditions-2784646-2025-09-09",
      "headline": "India vs UAE, Asia Cup 2025 All you need to know: Predicted XI, live streamingIndia begin their Asia Cup 2025 journey against hosts UAE in Dubai. With Suryakumar Yadav leading and Shubman Gill back as vice-captain, the defending champions aim to make a winning statement in their opening clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-captains-press-conference-full-video-2784616-2025-09-09",
      "headline": "Asia Cup: Won't ask players to downplay aggression, say India and Pakistan captainsAsia Cup 2025: India and Pakistan captains, Suryakumar Yadav and Salman Ali Agha, were in the spotlight as the captains of all eight teams spoke to the press in Dubai on Tuesday, September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/world-boxing-championship-nikhat-zareen-quarterfinals-beat-yuna-nishinaka-2784653-2025-09-09",
      "headline": "Nikhat Zareen battles past Nishinaka to reach Worlds Boxing Championship QFNikhat Zareen fought through a scrappy contest to edge Japan's Yuna Nishinaka and reach the World Boxing Championships quarterfinals. The Indian star now faces Turkey's Buse Naz Cakiroglu in her bid for a third world medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/abhimanyu-mishra-youngest-to-beat-world-champion-fide-grand-swiss-2025-2784648-2025-09-09",
      "headline": "Who is Abhimanyu Mishra: 16-year-old Grandmaster stuns D Gukesh in FIDE Grand SwissFIDE Grand Swiss 2025: At 16, Abhimanyu Mishra defeated reigning world champion Gukesh Dommaraju in a stunning 61-move match. The stunning victory came a day after the American Grandmaster held top seed R Praggnanandhaa with black pieces. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manrekar-excludes-rohit-sharma-from-all-time-indian-batting-great-list-2784647-2025-09-09",
      "headline": "Rohit Sharma does not fit in all-time Indian greats list: Sanjay ManjrekarSanjay Manjrekar has excluded Rohit Sharma from the all-time Indian batting greats list, citing his Test record. Rohit retired from Tests earlier this year after scoring 4301 runs from 67 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-uae-live-streaming-predicted-xi-pitch-conditions-2784646-2025-09-09",
      "headline": "India vs UAE, Asia Cup 2025 All you need to know: Predicted XI, live streamingIndia begin their Asia Cup 2025 journey against hosts UAE in Dubai. With Suryakumar Yadav leading and Shubman Gill back as vice-captain, the defending champions aim to make a winning statement in their opening clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-captains-press-conference-full-video-2784616-2025-09-09",
      "headline": "Asia Cup: Won't ask players to downplay aggression, say India and Pakistan captainsAsia Cup 2025: India and Pakistan captains, Suryakumar Yadav and Salman Ali Agha, were in the spotlight as the captains of all eight teams spoke to the press in Dubai on Tuesday, September 9. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}