{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-tax-free-benefit-pass-to-people-private-public-sector-finance-minister-nirmala-sitharaman-2782521-2025-09-05",
      "headline": "Exclusive: Will common man get insurance rate cut benefits in GST 2.0? FM answersFinance Minister Nirmala Sitharaman made it clear that the tax relief was introduced for citizens and not for insurance companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/popcorn-puzzle-solved-nirmala-sitharaman-explains-gst-classification-2782506-2025-09-05",
      "headline": "Popcorn puzzle solved: Nirmala Sitharaman explains GST classificationIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman explained why salted and chocolate-coated variants had earlier attracted different GST rates."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kiku-sharda-shuts-down-rumours-of-rift-with-krushna-abhishek-says-bond-is-unbreakable-2782843-2025-09-06",
      "headline": "Kiku Sharda shuts down rumours of rift with Krushna Abhishek, says bond is unbreakableComedian Kiku Sharda has dismissed rumours of a fallout with co-star Krushna Abhishek, affirming his ongoing role in 'The Great Indian Kapil Show'. Fans can look forward to the remaining episodes on Netflix as the cast's strong camaraderie remains intact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/bad-girl-review-varsha-bharath-anjali-sivaraman-coming-of-age-master-break-patriarchal-chains-2782729-2025-09-05",
      "headline": "Bad Girl review: A coming-of-age masterpiece about breaking patriarchal chainsRelease Date:Fri Sep 05, 2025Bad Girl movie review: Director Varsha Bharath's 'Bad Girl' is a fantastic coming-of-age film of a woman. This lovely gem of a film lays bare patriarchy and showcases how women are slowly breaking away from generational trauma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rise-and-fall-contestants-premiere-date-ashneer-grover-reality-tv-show-amazon-mx-player-2782659-2025-09-05",
      "headline": "Rise & Fall: All about Ashneer Grover's reality showA new reality TV show, titled 'Rise & Fall', hosted by entrepreneur Ashneer Grover, is set to stream on Amazon MX Player. Some of the confirmed contestants include Arjun Bijlani, Dhanashree Verma, Kiku Sharda and Kubbra Sait, among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-pledges-rs-5-crore-for-punjab-flood-relief-calls-it-sewa-2782673-2025-09-05",
      "headline": "Akshay Kumar pledges Rs 5 crore for Punjab flood relief, calls it sewaActor Akshay Kumar has generously pledged Rs 5 crore to support relief efforts in flood-hit Punjab. His timely contribution, alongside heartfelt messages from celebrities like Diljit Dosanjh, brings hope and strength to the resilient people of Punjab during this difficult time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ghaati-review-anushka-shetty-comeback-film-struggles-basic-tropes-2782642-2025-09-05",
      "headline": "Ghaati review: Anushka Shetty's comeback film fails to rise above basic tropesRelease Date:Fri Sep 05, 2025Ghaati movie review: Director Krish Jagarlamudi's 'Ghaati', starring Anushka Shetty, Vikram Prabhu and others, is a strictly average tale on exploitation and oppression. The film relies on familiar tropes with very little to look forward to."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aditya-narayan-pawan-singh-join-ashneer-grover-reality-show-rise-and-fall-2782663-2025-09-05",
      "headline": "Pawan Singh and Aditya Narayan join Ashneer Grover's reality show Rise and FallAmazon MX Player's new reality show 'Rise & Fall' welcomes singer-host Aditya Narayan and Bhojpuri superstar Pawan Singh, promising a thrilling mix of drama and entertainment. The series challenges 15 celebrities to adapt and strategise in a dynamic luxury-versus-bare-basics setting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/patralekhaa-opens-up-on-egg-freezing-struggles-pregnancy-was-way-easier-2782584-2025-09-05",
      "headline": "Pregnancy was way easier: Patralekhaa opens up on egg-freezing strugglesActor Patralekhaa, expecting her first child with husband Rajkummar Rao, opened up about the difficulties she faced during her egg-freezing journey three years ago, revealing that conceiving naturally was much easier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-bengal-files-movie-review-vivek-agnihotri-ruthless-hard-hitting-political-film-but-stretched-thin-2782426-2025-09-05",
      "headline": "The Bengal Files review: Ruthless, hard-hitting but stretched thinRelease Date:Fri Sep 05, 2025The Bengal Files review: Director Vivek Agnihotri's political-thriller 'The Bengal Files' is based on the 1946 Calcutta Killings and the Noakhali riots. Is the film able to do justice to a sensitive subject involving communal tensions and democracy? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-korean-dramas-use-time-travel-to-explore-love-regret-and-second-chances-2782367-2025-09-05",
      "headline": "How Korean dramas use time travel to explore love, regret and second chancesIn this week's K-fix we will discover how Korean dramas like 'A Time Called You', 'Moon Lovers: Scarlet Heart Ryeo', and 'Couple on the Backtrack' use time travel to explore love, regret, and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-odisha-contestant-reveals-father-forced-her-to-quit-studies-for-marriage-2782409-2025-09-05",
      "headline": "KBC 17: Odisha contestant says father forced her to quit studies for marriageIn the latest episode of 'Kaun Banega Crorepati 17', a contestant from Odisha revealed that she had to give up her job and that her father pressured her to marry at a young age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-visits-mumbai-months-after-sardaar-ji-3-row-2782405-2025-09-05",
      "headline": "Diljit Dosanjh visits Mumbai months after Sardaar Ji 3 rowSinger-actor Diljit Dosanjh made a rare appearance in Mumbai on Thursday. The visit came months after controversy over his film 'Sardaar Ji 3'. The actor recently wrapped filming for 'Border 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anoushka-shankar-calls-out-body-shaming-trolls-champions-self-love-2782524-2025-09-05",
      "headline": "Anoushka Shankar calls out body-shaming trolls, champions self-loveAcclaimed sitar maestro Anoushka Shankar has boldly confronted body-shaming remarks on social media, asserting her right to autonomy and self-respect. She shared a series of posts on Thursday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-aces-salt-and-pepper-look-leaked-pics-arshad-warsi-king-sets-siddharth-anand-2782512-2025-09-05",
      "headline": "Shah Rukh Khan aces salt and pepper look in leaked pics from King setsShah Rukh Khan is currently shooting for 'King' in Poland with Arshad Warsi. Pictures of the two stars from the sets have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-movie-review-tiger-shroff-film-is-25-hours-of-coma-and-you-pay-for-bed-2782480-2025-09-05",
      "headline": "Baaghi 4 review: Tiger Shroff's film is 2.5 hours of coma, and you pay for the bedRelease Date:Fri Sep 05, 2025Baaghi 4 movie review: It is not just another Tiger Shroff action film, it's a close to three-hour hallucination where the story collapses so fast you don't get time to process, care, or even hope for a comeback.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-11-written-update-baseer-ali-abhishek-bajaj-captain-mridul-tiwari-2782341-2025-09-05",
      "headline": "Bigg Boss 19 episode 11: Baseer defeats Abhishek to become new captainBigg Boss 19: Baseer Ali won the captaincy task after a heated argument with Abhishek Bajaj. Earlier in the day, Mridul Tiwari was injured during a task. Kunickaa Sadanand and Tanya Mittal also clashed with each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-x-twitter-internet-review-tiger-shroff-impresses-some-others-question-his-future-2782418-2025-09-05",
      "headline": "Baaghi 4 X review: Tiger Shroff impresses some, others question his futureSeveral X users have shared their reviews on actor Tiger Shroff's film 'Baaghi 4'. The film released in theatres on September 5 and also features Sanjay Dutt, Sonam Bajwa and Harnaaz Sandhu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/gst-2o-film-industry-benefit-government-new-reform-experts-weigh-in-2782419-2025-09-05",
      "headline": "Will the film industry benefit from government's new GST reform? Experts weigh inThe GST 2.0 reforms aim to make cinema tickets cheaper, but experts argue the impact will be minimal as Rs 100 tickets are nearly extinct. While single screens may see slight relief, multiplex audiences are unlikely to benefit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sivakarthikeyan-madharaasi-review-gun-culture-action-ar-murugadoss-film-2782408-2025-09-05",
      "headline": "Madharaasi review: Logic dies, but Sivakarthikeyan lives to tell gun culture taleRelease Date:Fri Sep 05, 2025Madharaasi movie review: Director AR Murugadoss's 'Madharaasi' starring Sivakarthikeyan, Rukmini Vasanth and Vidyut Jammwal, is a commercial actioner on gun culture. While the performances and action sequences win you over, the film's logical loopholes keep it a mediocre entertainer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-alia-bhatt-cheer-for-malayalam-hit-kalyani-priyadarshan-lokah-chapter-1-2782421-2025-09-05",
      "headline": "Priyanka Chopra, Alia Bhatt cheer for Malayalam hit Lokah: Added to my watchlist'Lokah Chapter 1: Chandra' has made a remarkable impact as Malayalam cinema's first female superhero film, blending mythology with contemporary fantasy to captivate audiences across India. Praised by Bollywood stars and shattering box office records, it heralds a new era for women-led stories in regional cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/very-disappointed-india-would-be-buying-russian-oil-i-get-along-pm-modi-trump-glbs-2782801-2025-09-06",
      "headline": "Will always be friends: Trump backtracks from 'lost India to China' remarkDespite his criticism, Trump underlined his personal relationship with Prime Minister Narendra Modi. \"I get along very well with Modi, as you know. He's great. He was here a couple of months ago,\" Trump said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-skip-un-session-in-us-this-month-will-be-replaced-by-s-jaishankar-trump-is-set-to-address-event-2782837-2025-09-06",
      "headline": "PM to skip general debate at UN session in US, S Jaishankar to represent IndiaPrime Minister Narendra Modi will not address the UN General Assembly's high-level General Debate later this month, with External Affairs Minister S Jaishankar scheduled to speak for India on September 27. The 80th UNGA session, opening September 9, will focus on global conflicts and mark the UN's 80th anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-impact-infiltration-attempts-loc-army-chief-dwivedi-2782824-2025-09-06",
      "headline": "War with Pakistan didn't end on May 10: Army Chief on Op SindoorArmy Chief General Upendra Dwivedi said it is too early to assess Operation Sindoor's impact on the LoC. Infiltration attempts by Pakistan-backed terrorists continue, indicating ongoing security challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jailed-mp-engineer-rashid-attacked-by-transgender-inmates-inside-prison-2782746-2025-09-05",
      "headline": "Jailed MP Engineer Rashid attacked by transgender inmates inside prison: SourcesPrison sources dismissed reports of a murder conspiracy as unfounded, adding that Rashid is currently lodged with three transgender inmates in Tihar Jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/its-all-bravado-india-will-bend-predicts-harvard-lutnick-on-trumps-tariffs-2782717-2025-09-05",
      "headline": "India will say sorry in 2 months: Trump aide Howard Lutnick on tariffsUS Commerce Secretary Howard Lutnick predicted that India's defiance over US tariffs is \"all bravado\" and that New Delhi will eventually be forced to strike a deal with Washington."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-his-team-disappointed-india-continues-fund-russias-ukraine-war-kevin-hassett-glbs-2782795-2025-09-06",
      "headline": "Trump disappointed as India continues to fund Russia's Ukraine war: Kevin HassettSpeaking at a media interaction, Hassett said that President Donald Trump and his trade team are frustrated with New Delhi's decision to continue purchasing crude from Moscow despite the ongoing war in Ukraine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-leader-kaish-khan-arrested-in-kannauj-for-violating-district-ban-2782789-2025-09-06",
      "headline": "Video: Dramatic arrest of Samajwadi leader, UP cops find him hiding behind mattressSamajwadi Party leader Kaish Khan was arrested in Kannauj for defying a court order that barred him from entering the district. Police found Khan hiding behind a mattress in the loft at his brother's house."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-states-affected-by-floods-to-review-situation-sources-2782755-2025-09-05",
      "headline": "PM Modi to visit states affected by floods to review situation: SourcesPM Narendra Modi will visit flood-hit northern states to assess the situation and review relief efforts. However, no official date or schedule has been announced yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajgir-sports-complex-bihar-sporting-revival-hockey-asia-cup-2782820-2025-09-06",
      "headline": "Inside Rajgir sports complex: Cradle of Bihar's sporting culture revival, dreamsWith world-class facilities and an international cricket stadium on the way, the Rajgir Sports Complex is leading a revolution in Bihar by reviving the state's sporting culture and laying out new dreams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signs-executive-order-renaming-department-of-defence-as-department-of-war-glbs-2782800-2025-09-06",
      "headline": "Trump signs executive order renaming Department of Defence as Department of WarThe order designates \"Department of War\" as a secondary title, a step that allows the administration to bypass congressional approval for formally renaming a federal agency, according to a senior administration official."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-gender-restrictions-delay-rescue-efforts-afghanistan-women-earthquake-2782694-2025-09-05",
      "headline": "Taliban's 'no skin contact with males' rule leaves Afghan women under quake rubbleWomen trapped under debris are sometimes left behind while the dead are pulled out, further underscoring how gender rules, not just rubble, are obstructing rescue efforts in a country ruled by the Taliban for the past four years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/egg-hurled-at-imran-khans-sister-outside-rawalpindi-jail-2-women-arrested-video-glbs-2782683-2025-09-05",
      "headline": "Video: Egg thrown at Imran Khan's sister outside Pak jail, 2 arrestedTwo women were arrested in Rawalpindi for throwing an egg at Imran Khan's sister Aleema Khanum outside Adiala Jail during a Toshakhana case hearing, sparking condemnation and social media reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovc-us-open-defeat-carlos-alcaraz-jannik-sinner-analysis-2782813-2025-09-06",
      "headline": "Once ageless, now 38, Djokovic just can't stop the Sincaraz partyAt 38, Novak Djokovic still chases a record-breaking 25th Grand Slam, but the Sincaraz party shows no mercy. Even the GOAT may need something extraordinary to crash it. And whether he can is anyone's guess as the young guns keep raising the bar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariffs-responsible-for-india-china-russia-new-world-order-sco-summit-modi-xi-putin-2782646-2025-09-05",
      "headline": "Trump has realised only 50% of the truth on India, ChinaUS President Donald Trump has admitted that the US has \"lost\" India and Russia to the \"darkest\" China. While Trump has admitted to 50% of the truth, he hasn't realised the other 50% that he, and solely he, is solely responsible for pushing India towards China with tariffs, nasty rhetoric, and short-sighted diplomacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-family-court-rules-that-wife-living-in-adultery-is-not-entitled-to-maintenance-by-husband-2782790-2025-09-06",
      "headline": "Wife living in adultery not entitled to maintenance by husband: CourtFamily court judge Namrita Aggarwal was hearing the plea of the woman, saying the estranged husband, though legally and morally bound to provide maintenance, was intentionally ignoring the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-saved-as-meta-sends-alert-to-cops-after-his-posts-on-suicide-intentions-2782828-2025-09-06",
      "headline": "Man saved as Meta sends alert to cops after his posts on suicide intentionsMeta sent an alert to the Social Media Center at Police Headquarters in Lucknow, reporting a disturbing post in which the man stated he was sitting on a railway track and intended to die. This prompted swift action by the police, saving the man's life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dukhu-majhi-padma-shri-environmentalist-housing-struggles-tree-planting-west-bengal-2782776-2025-09-06",
      "headline": "Planted 5,000 trees, won Padma Shri, Bengal's Dukhu Majhi still lives in broken hutAt the entrance, a red board scribbled in chalk reads \"Awarded by the President of India, Dukhu Majhi.\" Next to it rests an old bicycle. Majhi lives with his aged wife and differently-abled son in precarious conditions.  Makeshift patches cover the leaking walls and ceiling, yet the house remains on the verge of collapse."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-launched-covert-operation-to-intercept-kim-jong-un-calls-before-2019-nuke-talks-it-failed-2782671-2025-09-05",
      "headline": "How US's attempt to intercept Kim's calls before 2019 N-talks fell apartIn early 2019, US Navy SEAL Team 6 launched a covert mission on North Korean soil, authorised by Donald Trump, with the objective of installing an electronic device designed to intercept communications from Kim Jong-un."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ukrainians-russians-die-while-india-profits-from-russian-oil-navarros-big-claim-glbs-2782807-2025-09-06",
      "headline": "Ukrainians, Russians die while India profits from oil trade: Navarro's big claimPeter Navarro criticised India's trade policies and its energy trade with Moscow. His remarks were in response to a Washington Post article, which claimed that the Trump administration's harsh rhetoric toward New Delhi was straining ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-waqf-board-case-against-hazratbal-shrine-plaque-vandals-2782740-2025-09-05",
      "headline": "Ashoka Emblem at J&K's Hazratbal shrine vandalised, Waqf Board chief demands actionA political and religious controversy erupted over the engraving of the national emblem on the renovation plaque at Hazratbal Shrine in Jammu and Kashmir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/luis-suarez-spitting-ban-inter-miami-2782825-2025-09-06",
      "headline": "Luis Suarez banned for 6 games after spitting saga in Leagues Cup finalInter Miami's Luis Suarez has been handed a 6-game ban for his antics in the Leagues Cup final against Seattle Sounders. Suarez had spit on the face of one of the opposition staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-to-attend-us-open-mens-final-after-2015-glbs-2782793-2025-09-06",
      "headline": "Trump to attend US Open men's final. His 1st since getting booed in 2015Donald Trump will attend the US Open men's final on Sunday, marking his first return since 2015. His presence is set to draw both attention and controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-bjp-leader-agnimitra-paul-hospitalised-after-suffering-from-brain-stroke-stable-2782802-2025-09-06",
      "headline": "BJP's Agnimitra Paul hospitalised after suffering from brain stroke, stableAgnimitra Paul, 52, a BJP MLA from Asansol South, was admitted to Fortis Hospital on Thursday night after feeling unwell. She was diagnosed with a mild brain stroke during a health check-up and was admitted to Fortis Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sinner-semifinal-match-report-2782846-2025-09-06",
      "headline": "Jannik Sinner sets up grand Sincaraz final after 4-set battle vs Auger AliassimeWorld No.1 Jannik Sinner set up a grand US Open final against Carlos Alcaraz. On Saturday, Sinner beat Canada's Felix Auger Aliassime with mechanical precision in a 4-set battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/luis-suarez-spitting-ban-inter-miami-2782825-2025-09-06",
      "headline": "Luis Suarez banned for 6 games after spitting saga in Leagues Cup finalInter Miami's Luis Suarez has been handed a 6-game ban for his antics in the Leagues Cup final against Seattle Sounders. Suarez had spit on the face of one of the opposition staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rajgir-sports-complex-bihar-sporting-revival-hockey-asia-cup-2782820-2025-09-06",
      "headline": "Inside Rajgir sports complex: Cradle of Bihar's sporting culture revival, dreamsWith world-class facilities and an international cricket stadium on the way, the Rajgir Sports Complex is leading a revolution in Bihar by reviving the state's sporting culture and laying out new dreams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-tim-henman-novak-djokovic-retirement-prediction-alcaraz-defeat-2782822-2025-09-06",
      "headline": "Tim Henman makes Novak Djokovic retirement prediction after US Open lossFormer British No.1 Tim Henman has tipped Novak Djokovic to make one final push at the Australian Open before considering retirement, after the Serbian great's US Open exit at the hands of Carlos Alcaraz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-vs-amanda-anisimova-2025-us-open-womens-final-preview-2782811-2025-09-06",
      "headline": "Sabalenka vs Anisimova Live Streaming: All you need to know about finalUS Open 2025: World No.1 Aryna Sabalenka and Amanda Anisimova of the United States will be up against each other in the women's singles final at Flushing Meadows on Saturday, September 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovc-us-open-defeat-carlos-alcaraz-jannik-sinner-analysis-2782813-2025-09-06",
      "headline": "Once ageless, now 38, Djokovic just can't stop the Sincaraz partyAt 38, Novak Djokovic still chases a record-breaking 25th Grand Slam, but the Sincaraz party shows no mercy. Even the GOAT may need something extraordinary to crash it. And whether he can is anyone's guess as the young guns keep raising the bar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-targets-2026-grand-slam-season-after-us-open-2025-exit-2782809-2025-09-06",
      "headline": "Djokovic quashes retirement buzz after US Open exit: Want to play majors in 2026Novak Djokovic confirmed he is not retiring after his US Open 2025 loss to Carlos Alcaraz. He plans to compete in the 2026 Grand Slam season despite physical challenges in longer matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defeats-novak-djokovic-us-open-2025-semifinal-2782805-2025-09-06",
      "headline": "Novak Djokovic no match for ruthless Carlos Alcaraz in one-sided semisCarlos Alcaraz defeated Novak Djokovic to reach the US Open 2025 men's singles final. Alcaraz took two hours and 23 minutes to register a 6-4, 7-6 (4), 6-2 victory at Arthur Ashe Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-enrique-collarbone-fracture-surgery-psg-coach-cycling-accident-2782803-2025-09-06",
      "headline": "PSG coach Luis Enrique sidelined after cycling accident and surgery setbackParis Saint-Germain boss Luis Enrique faces surgery after a cycling accident left him with a fractured collarbone. The setback comes as PSG chase another strong season in Ligue 1 and Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/afghanistan-win-uae-sharjah-tri-series-close-finish-2782794-2025-09-06",
      "headline": "Afghanistan survive late UAE charge to secure narrow win in tri-seriesAfghanistan secured a thrilling 4-run victory over UAE in the Sharjah tri-series, giving them more momentum before the grand finale against Pakistan on September 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovc-us-open-defeat-carlos-alcaraz-jannik-sinner-analysis-2782813-2025-09-06",
      "headline": "Once ageless, now 38, Djokovic just can't stop the Sincaraz partyAt 38, Novak Djokovic still chases a record-breaking 25th Grand Slam, but the Sincaraz party shows no mercy. Even the GOAT may need something extraordinary to crash it. And whether he can is anyone's guess as the young guns keep raising the bar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-targets-2026-grand-slam-season-after-us-open-2025-exit-2782809-2025-09-06",
      "headline": "Djokovic quashes retirement buzz after US Open exit: Want to play majors in 2026Novak Djokovic confirmed he is not retiring after his US Open 2025 loss to Carlos Alcaraz. He plans to compete in the 2026 Grand Slam season despite physical challenges in longer matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defeats-novak-djokovic-us-open-2025-semifinal-2782805-2025-09-06",
      "headline": "Novak Djokovic no match for ruthless Carlos Alcaraz in one-sided semisCarlos Alcaraz defeated Novak Djokovic to reach the US Open 2025 men's singles final. Alcaraz took two hours and 23 minutes to register a 6-4, 7-6 (4), 6-2 victory at Arthur Ashe Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-enrique-collarbone-fracture-surgery-psg-coach-cycling-accident-2782803-2025-09-06",
      "headline": "PSG coach Luis Enrique sidelined after cycling accident and surgery setbackParis Saint-Germain boss Luis Enrique faces surgery after a cycling accident left him with a fractured collarbone. The setback comes as PSG chase another strong season in Ligue 1 and Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/afghanistan-win-uae-sharjah-tri-series-close-finish-2782794-2025-09-06",
      "headline": "Afghanistan survive late UAE charge to secure narrow win in tri-seriesAfghanistan secured a thrilling 4-run victory over UAE in the Sharjah tri-series, giving them more momentum before the grand finale against Pakistan on September 7."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}