{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-receives-2nd-imf-payout-as-india-raises-concerns-2724656-2025-05-14",
      "headline": "Pakistan receives 2nd IMF payout as India raises concernsThis payment is part of the second instalment of a $7 billion IMF loan deal that began in September 2024 and will run for 37 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-182-points-higher-nifty-above-24600-tata-steel-up-4-2724635-2025-05-14",
      "headline": "Markets end higher amid midcap rally; Sensex up 182 pointsThe BSE Sensex was up 182.34 points to 81,330.56 at the closing bell, while the NSE Nifty50 settled 88.55 points higher at 24,666.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-new-chip-plant-by-hcl-foxconn-joint-venture-near-jewar-airport-2724622-2025-05-14",
      "headline": "Cabinet approves new HCL-Foxconn semiconductor plant near Jewar AirportThis marks another significant step in India's ambitions to become a global semiconductor hub, with the proposed fab expected to bolster domestic chip-making capabilities and reduce dependence on imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-wholesale-inflation-drops-to-13-month-low-in-april-2724601-2025-05-14",
      "headline": "India's wholesale inflation drops to 13-month low in AprilIndia's wholesale inflation dropped to 0.85% in April, a 13-month low, as prices of food, fuel, and key items cooled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cait-seeks-travel-ban-on-turkey-and-azerbaijan-for-openly-backing-pakistan-easemytrip-go-homestays-2724586-2025-05-14",
      "headline": "Traders' body seeks travel ban on Turkey and Azerbaijan for backing PakistanFollowing their backing of Pakistan, major travel companies have already suspended all travel packages to Turkey and Azerbaijan. Travel booking platform EaseMyTrip has advised its customers to avoid visiting these countries unless absolutely necessary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-is-reviewing-ev-wallets-after-blusmart-collapse-know-key-details-2724551-2025-05-14",
      "headline": "Explained: Why RBI is reviewing EV wallets after BluSmart collapseThe central bank has initiated informal discussions with EV charging point operators and other app-based service providers to assess potential consumer risks tied to such platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/do-not-just-look-rich-ca-shares-7-habits-to-build-lasting-wealth-start-a-retirement-fund-invest-in-stocks-sips-gold-2724535-2025-05-14",
      "headline": "'Don't just look rich': CA shares 7 habits to build lasting wealthThe first step to financial freedom is breaking the paycheck-to-paycheck cycle and having a safety cushion, which should cover you for 3 to 6 months in case of a job loss, medical emergency, or any unforeseen event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-grse-cochin-shipyard-mazagon-dock-rally-sharply-what-should-investors-do-2724532-2025-05-14",
      "headline": "GRSE, Cochin Shipyard, Mazagon Dock shares rise up to 17%: Good time to buy?At 12:17 pm, shares of Cochin Shipyard were trading 10.37% higher at Rs 1,740.80, while GRSE was trading 15.92% higher at 2,220. Mazagon Dock Shipbuilders was also up over 5%.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-itr-7-form-out-what-is-different-and-who-must-file-itr-filing-2025-2724502-2025-05-14",
      "headline": "New ITR-7 Form out: What's different and who must fileNew fields have been added to the ITR-7 form to help eligible entities clearly report housing loan interest claimed under Section 24(b)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-steel-share-price-jumps-capital-expnditure-expansion-plan-2724481-2025-05-14",
      "headline": "Explained: Why Tata Steel shares jumped over 4% todayAt around 10:30 am, shares of the company were trading 4.41% higher at Rs 156.10 on the BSE. The rally was sparked by fresh optimism following disclosures from top company officials about the scale and focus of Tata Steel's expansion plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/raymond-shares-down-64-percent-why-is-the-stock-falling-amid-realty-demerger-2724477-2025-05-14",
      "headline": "Raymond shares crash 64%: Why is the stock falling after realty demerger?At last count, the stock was trading at Rs 556.45, down 64.36% from its previous close of Rs 1,561.30. The sharp fall coincided with the ex-date of the demerger, when Raymond shares stopped factoring in the value of its real estate business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-continues-sensex-nifty-rise-key-reasons-to-know-2724468-2025-05-14",
      "headline": "Sensex jumps over 500 points today: Why is the stock market rising today?Today's sharp rebound followed Tuesday's volatile session where the Nifty had tumbled over 400 points from its intraday high before closing near day's low. This was largely due to profit booking after Monday's euphoric ceasefire rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-shares-fall-sharply-after-q4-results-key-reasons-to-know-2724462-2025-05-14",
      "headline": "Tata Motors shares fall after Q4 results. Key reasons to knowAt first glance, the headline numbers seemed disappointing. A 51% year-on-year drop in consolidated net profit to Rs 8,470 crore and flat revenue at Rs 1.19 lakh crore. But despite the sharp dip in profit, Tata Motors outperformed Street expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/raymond-stock-in-focus-realty-business-demerger-all-you-need-to-know-2724461-2025-05-14",
      "headline": "Raymond stock in spotlight as realty demerger takes effect. Check detailsAs per the approved scheme, Raymond shareholders will receive one equity share of Raymond Realty for every share held in Raymond. The standalone real estate company is expected to be listed during the September quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-300-points-nifty-above-24600-as-inflation-cools-2724451-2025-05-14",
      "headline": "Sensex surges over 400 points, Nifty nears 24,800 as inflation coolsAt 9:29 am, the BSE Sensex was up 462.27 points at 81,610.49, while the NSE Nifty50 rose 135.35 points to 24,713.70. Both indices extended gains shortly after the opening bell, signalling bullish momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/msci-includes-indias-coromandel-nykaa-to-key-index-to-global-standard-index-in-may-rejig-2724447-2025-05-14",
      "headline": "MSCI includes India's Coromandel, Nykaa to key index in May rejigThe inclusion could bring passive inflows worth $216 million-$227 million into Coromandel and $172 million - $181 million into Nykaa, according to IIFL Alternate Research and JM Financial estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-cooling-inflation-us-china-deal-positive-2724438-2025-05-14",
      "headline": "Stock market today: Sensex, Nifty likely to open positive as inflation coolsGift Nifty futures were quoting at 24,729.5 as of 8:15 am, suggesting the Nifty 50 could open comfortably above Tuesday's close of 24,578.35. This comes a day after the Sensex and Nifty logged their steepest single-day losses in a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-microsoft-is-firing-about-6000-employees-while-spending-billions-on-ai-glbs-2724395-2025-05-14",
      "headline": "Why Microsoft is firing about 6,000 employees while spending billions on AI?Microsoft is cutting around 6,000 jobs to save money, even while it spends big on artificial intelligence. The company says the move will help it focus on important areas as building AI tools is becoming more expensive and affecting profits.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-declines-to-6-year-low-of-316-in-april-2724166-2025-05-13",
      "headline": "Retail inflation declines to 6-year low of 3.16% in AprilRetail inflation dropped to a six-year low of 3.16% in April 2025 from 3.34% in March, thanks to cheaper vegetables, fruits, pulses, and protein-rich food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-should-your-home-loan-decide-for-you-2724141-2025-05-13",
      "headline": "Old vs new tax regime: Should your home loan decide for you?Home loan benefits are important, but they aren't the only ones to think about. Other deductions under the old regime, like Section 80D (health insurance), Section 80G (donations) and HRA (House Rent Allowance), also make a difference."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-disappointed-virat-kohli-retirement-asks-him-to-reconsider-2724630-2025-05-14",
      "headline": "Javed Akhtar 'disappointed' with Virat Kohli's retirement, asks him to reconsiderVeteran lyricist Javed Akhtar is 'disappointed' with Virat Kohli's retirement. He requested the cricketer to reconsider his decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-soft-launching-her-relationship-with-raj-nidimoru-in-new-viral-pic-2724623-2025-05-14",
      "headline": "Did Samantha just soft-launch her relationship with Raj Nidimoru in new pic?Actor Samantha shared a picture on social media in which she could be seen resting her head on Raj Nidimoru's shoulders. Now, fans believe that she's making her relationship official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-mission-impossible-the-final-reckoning-advance-booking-india-record-breaking-figures-for-opening-weekend-2724594-2025-05-14",
      "headline": "Tom Cruise's Mission Impossible-Final Reckoning eyes record advance booking in India'Mission: Impossible - The Final Reckoning' is set to break its previous advance booking record in India. The Tom Cruise film is already selling tickets like hotcakes at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-trailer-pankaj-tripathis-case-has-three-sides-of-truth-watch-2724600-2025-05-14",
      "headline": "Criminal Justice trailer: Pankaj Tripathi's case has three sides of truth. WatchThe trailer for 'Criminal Justice - A Family Matter' has been released. The trailer gives a glimpse into the high-stakes legal battle in the upcoming season. Featuring Pankaj Tripathi, the fourth season of the series will stream on JioHotstar starting May 29. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-warns-of-kali-avatar-if-no-photo-rule-for-her-twins-is-broken-2724550-2025-05-14",
      "headline": "Preity Zinta warns of 'Kali Avatar' if no-photo rule for her twins is brokenActor Preity Zinta talked about wanting privacy for her twins, Jai and Gia, in a recent Ask Me Anything session on X, and highlighted the importance of setting boundaries with the paparazzi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angela-bassett-mission-impossible-us-president-empowers-women-final-reckoning-india-exclusive-2724562-2025-05-14",
      "headline": "Exclusive: Actor Angela Bassett on playing President in MI, Tom Cruise, and IndiaAngela Bassett stars as the American President in 'Mission Impossible: The Final Reckoning.' Her role highlights women empowerment and celebrates Indian fashion influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakondas-kingdom-release-date-postponed-amid-india-pak-tensions-2724569-2025-05-14",
      "headline": "Vijay Deverakonda's Kingdom release date postponed amid India-Pak tensionsVijay Deverakonda's action drama 'Kingdom', directed by Gautham Tinnanuri, has been officially postponed. The film, initially planned for a summer release on May 30, will now arrive in cinemas on July 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-meets-ex-boxing-champion-julius-francis-at-london-fan-meet-2724555-2025-05-14",
      "headline": "Actor Ram Charan meets ex-boxing champion Julius Francis at London fan meetActor Ram Charan honoured former British boxing champion Julius Francis, who was a bouncer at his fan event in London. He requested the 'RRR' actor to place a boxing belt on his shoulder. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-gets-emotional-during-premanand-maharaj-ashram-visit-with-virat-kohli-2724573-2025-05-14",
      "headline": "Anushka Sharma gets emotional during Premanand Maharaj's ashram visit with ViratAnushka Sharma recently got emotional during her visit to Premanand Maharaj's ashram with Virat Kohli. A video of the actor holding back her tears has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-urges-indians-to-cancel-turkey-trips-amid-indias-stand-against-pak-backed-terrorism-2724568-2025-05-14",
      "headline": "Rupali Ganguly urges Indians to cancel Turkey trips amid India's Operation Sindoor'Anupamaa' actor Rupali Ganguly asked her followers to cancel their trips to Turkey after the country backed Pakistan against India during Operation Sindoor last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-de-niro-tiffany-cehn-cannes-red-carpet-pics-2724564-2025-05-14",
      "headline": "Robert De Niro and his 35-year-younger girlfriend walk Cannes red carpet. Pics81-year-old Hollywood actor Robert De Niro walked the Cannes 2025 red carpet with girlfriend Tiffany Chen, a martial arts professional. This is one of their rarest public appearances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/enrique-iglesias-to-perform-in-mumbai-this-october-report-2724542-2025-05-14",
      "headline": "Spanish singer Enrique Iglesias to perform in Mumbai this October: ReportEnrique Iglesias will reportedly perform in Mumbai this October. The singer, popular for tracks like 'Bailamos' and 'Heart Attack', has earlier performed in India in 2004 and 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-rajkumar-hiurani-reunite-5-years-pk-3-idiots-2724537-2025-05-14",
      "headline": "Aamir Khan and Rajkumar Hirani to reunite after 5 years: ReportAamir Khan and Rajkumar Hirani are set to reunite after five years for an upcoming project. Reportedly, the production is expected to begin after 'Sitare Zameen Par' release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/salma-hayek-is-ageless-and-iconic-at-58-on-sports-illustrated-swimsuit-cover-2724516-2025-05-14",
      "headline": "Salma Hayek is ageless and iconic at 58 on Sports Illustrated Swimsuit cover. WatchAt 58, Salma Hayek makes a powerful debut on the 'Sports Illustrated Swimsuit' cover, challenging age stereotypes with grace and confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-says-directors-dont-have-guts-to-slam-actors-like-ranbir-kapoor-2724515-2025-05-14",
      "headline": "Vivek Agnihotri says directors don't 'have guts' to slam actors like Ranbir KapoorFilmmaker Vivek Agnihotri recently said in an interview that Bollywood directors do not have the courage to criticise stars for their performances, while they do the same behind closed doors. He was speaking in the context of the criticism of 'Animal' director Sandeep Reddy Vanga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/spider-noir-nicolas-cage-looks-dark-spider-man-1st-look-teaser-leaked-2724510-2025-05-14",
      "headline": "Spider-Noir: Nicolas Cage looks dark as Spider-Man in 1st look, teaser leakedActor Nicolas Cage is set returning as Spider-Man in the upcoming series 'Spider-Man Noir'. The makers unveiled his first look from the live-action drama. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/santhanam-dd-next-level-janasena-ttd-board-member-2724501-2025-05-14",
      "headline": "BJP leader sues Tamil actor Santhanam for Rs 100 crore over devotional song useTamil actor Santhanam's upcoming film, 'DD Next Level', is currently embroiled in controversy over the use of devotional song. Janasena and BJP members have condemned the use and called for removal of the song from the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-downey-jr-flexes-his-muscles-in-bts-pics-from-doomsday-sets-2724489-2025-05-14",
      "headline": "Robert Downey Jr flexes his muscles in BTS pics from Doomsday setsRobert Downey Jr is busy filming his upcoming movie Avengers: Doomsday. On Tuesday, the actor posted a BTS picture from the set, flexing his biceps, drawing attention from fans. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-hits-back-at-vivek-agnihotri-calls-him-liar-2724483-2025-05-14",
      "headline": "Anurag Kashyap hits back at Vivek Agnihotri, calls him 'jhoota aadmi'Filmmaker Vivek Agnihotri recently accused Anurag Kashyap of alcoholism and shirking writing duties during their collaboration on the film Goal. Anurag Kashyap has strongly denied these allegations, calling Vivek a liar and clarifying he was never on set."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/turkey-helped-pak-army-plan-attack-on-india-supplied-350-drones-military-operatives-sources-2724565-2025-05-14",
      "headline": "Turkey helped Pak attack India, sent 350+ drones, military operativesTwo Turkish military operatives were killed as part of Operation Sindoor, which reveals that Turkey not only helped Pakistan in its war against India with over 350 drones, but also with operators, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-seeks-regional-economic-plan-india-northeastern-states-nepal-bhutan-2724645-2025-05-14",
      "headline": "Bangladesh calls for regional economic plan with India's Northeast, Nepal, BhutanOne of the key focus areas was regional energy cooperation, especially hydropower, Bangladesh's Chief Adviser Muhammad Yunus said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-pk-shaw-detained-by-pakistan-after-accidentally-crossing-border-repatriated-at-wagah-border-2724498-2025-05-14",
      "headline": "Pak returns BSF jawan to India 20 days after he accidentally crossed borderBSF constable Purnam Kumar Shaw of the 182nd Battalion was detained by Pakistan Rangers on April 23 after he inadvertently crossed the International Border near Ferozepur, Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-successfully-test-fires-bhargavastra-homegrown-hard-kill-counter-swarm-drone-system-2724617-2025-05-14",
      "headline": "Video: India tests homegrown counter drone system BhargavastraBhargavastra, a new low-cost counter-drone system designed in hard kill mode, boasts of advanced capabilities for detecting and eliminating small and incoming drones at distances of upto 2.5 km."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-turkey-helped-pakistan-drones-military-celebi-handles-high-security-job-indian-airport-delhi-mumbai-2724631-2025-05-14",
      "headline": "Turkey aided Pak, but its Celebi handles high-security tasks at Indian airportsSubsidiaries of a Turkish company, Celebi Aviation, are involved in high-security tasks, including cargo handling, at several Indian airports. It could cause some unease as it comes to light that Turkey not only supplied military drones, but even Turkish operatives to assist Pakistan as it attacked India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/creative-naming-will-not-alter-reality-india-rejects-chinas-renaming-of-some-places-in-arunachal-pradesh-2724450-2025-05-14",
      "headline": "Creative naming can't alter reality: India rejects China's Arunachal renamingIn a strongly worded statement, the Ministry of External Affairs (MEA) firmly rejected China's latest attempt to rename several locations in Arunachal Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-receives-2nd-imf-payout-as-india-raises-concerns-2724656-2025-05-14",
      "headline": "Pakistan receives 2nd IMF payout as India raises concernsThis payment is part of the second instalment of a $7 billion IMF loan deal that began in September 2024 and will run for 37 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-clear-winner-air-battle-against-pakistan-aviation-expert-2724592-2025-05-14",
      "headline": "Op Sindoor: India clear winner in air battle against Pak, says aviation expertMilitary historian and aviation analyst Tom Cooper, while talking to India Today, said that the more he followed the news and social media, from the evening of May 7 till May 9, it became clear that Pakistan was losing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/working-over-52-hours-week-brain-changes-memory-emotions-decision-making-study-2724584-2025-05-14",
      "headline": "Working more than 52 hours a week can change brain structureA new study reveals that working more than 52 hours a week may alter brain structure. These changes could impact memory, emotions, and decision-making, raising concerns about overwork effects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/woman-leaving-job-children-not-voluntary-desertion-entitled-alimony-court-2724646-2025-05-14",
      "headline": "Woman leaving job for children not voluntary desertion, entitled to alimony: CourtThe court said that the situation could be viewed as a consequence of the paramount duty to look after the child and said that the woman is entitled to alimony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-new-chip-plant-by-hcl-foxconn-joint-venture-near-jewar-airport-2724622-2025-05-14",
      "headline": "Cabinet approves new HCL-Foxconn semiconductor plant near Jewar AirportThis marks another significant step in India's ambitions to become a global semiconductor hub, with the proposed fab expected to bolster domestic chip-making capabilities and reduce dependence on imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-ceasefire-live-operation-sindoor-us-trump-pak-radiation-leak-reports-air-strikes-pm-modi-bjp-congress-2724443-2025-05-14",
      "headline": "Live: PM holds key meet with Rajnath Singh, Amit Shah after Cabinet security briefingIndia-Pakistan Ceasefire Live: The Indian armed forces launched Operation Sindoor on May 7 to avenge the Pahalgam attack where 26 people - mostly tourists – were killed. Subsequently, the two countries were involved in military actions against each other. Defence Minister Rajnath Singh told an all-party meeting on May 8 that at least 100 hardcore terrorists and their associates were killed in Indian strikes on terror sites in Pakistan and Pakistan-occupied-Kashmir (PoK) under the ongoing Operation Sindoor. The two neighbouring countries reached an understanding for ceasefire on May 10. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/are-indian-exports-to-turkey-powering-its-drones-2723672-2025-05-12",
      "headline": "Are Indian exports to Turkey powering its drones?Pakistan attacked India with around 400 Turkish drones in four days. Here's a look at how India's exports are helping Turkey in making these drones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ins-vikrant-brahmos-equipped-warships-submarines-blockaded-paks-karachi-port-during-op-sindoor-sources-2724482-2025-05-14",
      "headline": "INS Vikrant-led 36-ship armada was in position to hit Karachi: SourcesFollowing the recent terror attack in Jammu and Kashmir's Pahalgam in which 26 people were killed, India launched a tri-pronged pressure strategy on Pakistan. The Navy was placed on high alert, prompting Pakistan to issue NAVAREA warnings amid fears of a possible naval strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/turkish-broadcaster-trt-worlds-x-account-withheld-in-india-for-spreading-misinformation-2724587-2025-05-14",
      "headline": "Turkish broadcaster's X account blocked in India for spreading misinformationIn a rapid crackdown on global media outlets spreading propaganda and misinformation against India, the X account of Turkish news broadcaster TRT World has been blocked by the Centre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-us-student-gaurav-jaisingh-dies-in-tragic-fall-during-trip-to-bahamas-bentley-university-shrewsbury-massachusetts-2724530-2025-05-14",
      "headline": "Indian-American student dies after falling from Bahamas hotel balconyAn Indian-American student died after falling from a hotel balcony in the Bahamas. Gaurav Jaisingh was on a class trip to the Bahamas and fell to death just six days before his graduation. Gaurav was set to start his career as a consultant in New York City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/virat-kohli-premanand-maharaj-prasann-ho-anushka-sharma-question-viral-video-2724485-2025-05-14",
      "headline": "Virat Kohli's reply to Premanand Maharaj's 'Prasann Ho' question goes viralA day after announcing his Test retirement, Virat Kohli visited Shri Hit Radha Keli Kunj Ashram in Vrindavan with Anushka Sharma to seek blessings. A video of their conversation with Premanand Maharaj has since gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/punjab-board-class-12-result-declared-direct-link-to-check-scores-2724626-2025-05-14",
      "headline": "Punjab Board Class 12 result declared. Direct link to check scoresThe Punjab School Education Board (PSEB) has declared the Class 12 results for the academic year 2024–25 today, May 14. Students can check their scores on the official website, pseb.ac.in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/br-gavai-next-chief-justice-six-months-tenure-first-woman-cji-bv-nagarathna-just-36-days-term-supreme-court-2710040-2025-05-14",
      "headline": "Gavai to be CJI for 6 months, first woman CJI might serve just 36 daysJustice BR Gavai took oath as the 52nd Chief Justice of India on Wednesday, and will serve as the CJI for six months. If you think this is a short tenure, consider that the first possible woman CJI will serve for just 36 days. Yet, her tenure will not be the shortest as CJI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-pakistan-reporter-shuts-down-prime-minister-narendra-modi-peace-deal-2724418-2025-05-14",
      "headline": "US official shuts down Pak reporter who accused PM Modi of blocking peace dealWhen the Pakistani reporter asked whether the US was disappointed that PM Modi did not welcome the 'peace deal,' US Department of State official Thomas Pigott said that the focus was on the ceasefire. 'Our focus is the ceasefire and encouraging direct communication,' said the US official."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-soft-launching-her-relationship-with-raj-nidimoru-in-new-viral-pic-2724623-2025-05-14",
      "headline": "Did Samantha just soft-launch her relationship with Raj Nidimoru in new pic?Actor Samantha shared a picture on social media in which she could be seen resting her head on Raj Nidimoru's shoulders. Now, fans believe that she's making her relationship official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-will-retain-a-plus-contract-after-test-retirement-2724609-2025-05-14",
      "headline": "Why Kohli and Rohit will retain A-plus contract after Test retirement?Star Indian batting duo Rohit Sharma and Virat Kohli are all set to retain their A-plus category contracts despite their recent retirement from Test format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/cbse-class-10-board-exam-student-student-scores-35-maharashtra-solapur-celebration-video-viral-2724583-2025-05-14",
      "headline": "CBSE Class 10 student scores 35% in all subjects, celebration video goes viralAs CBSE Class 10 results came in, one student from Maharashtra's Solapur stood out, not for topping the list, but for scoring exactly 35 per cent in every subject and passing without fail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-islamist-maulana-abdul-quddus-faruqi-calls-suicide-attack-kolkata-taliban-style-hindu-hate-cleric-2724261-2025-05-14",
      "headline": "Would send suicide bombers to Kolkata: Bangladeshi cleric spews anti-Hindu hateA Bangladeshi Islamic cleric, Maulana Abdul Quddus Faruqi, has called for suicide attacks on Kolkata, endorsing a Taliban-style tactic. In the video that has been watched over 1.3 lakh times, Faruqi declared that if the Bangladesh army permitted it, he would plan the attack. He used hate-filled rhetoric against Hindus and India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-disappointed-virat-kohli-retirement-asks-him-to-reconsider-2724630-2025-05-14",
      "headline": "Javed Akhtar 'disappointed' with Virat Kohli's retirement, asks him to reconsiderVeteran lyricist Javed Akhtar is 'disappointed' with Virat Kohli's retirement. He requested the cricketer to reconsider his decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-soft-launching-her-relationship-with-raj-nidimoru-in-new-viral-pic-2724623-2025-05-14",
      "headline": "Did Samantha just soft-launch her relationship with Raj Nidimoru in new pic?Actor Samantha shared a picture on social media in which she could be seen resting her head on Raj Nidimoru's shoulders. Now, fans believe that she's making her relationship official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-mission-impossible-the-final-reckoning-advance-booking-india-record-breaking-figures-for-opening-weekend-2724594-2025-05-14",
      "headline": "Tom Cruise's Mission Impossible-Final Reckoning eyes record advance booking in India'Mission: Impossible - The Final Reckoning' is set to break its previous advance booking record in India. The Tom Cruise film is already selling tickets like hotcakes at the box office. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/javed-shabana-sonam-kapoor-and-other-celebs-at-nirmal-kapoors-13th-day-ceremony-2724580-2025-05-14",
      "headline": "Javed-Shabana, Sonam Kapoor, and other celebs at Nirmal Kapoor's 13th day ceremonyNirmal Kapoor, mother of actors Anil Kapoor, Boney Kapoor, and Sanjay Kapoor, died in Mumbai on Friday at the age of 90. Today marks the 13th-day ceremony held in her memory, with several Bollywood celebrities in attendance to pay their respects."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sneh-rana-comeback-sri-lanka-tri-series-2724682-2025-05-14",
      "headline": "Less pace, fuller lengths: How Sneh Rana staged fairytale ODI comebackSneh Rana said that she has worked with India bowling coach Avishkar Salvi to improve her bowling. Rana picked up 15 wickets in the tri-series in Sri Lanka. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-ipl-2025-delhi-capitals-replacement-2724661-2025-05-14",
      "headline": "Mustafizur Rahman replaces Jake Fraser-McGurk at Delhi CapitalsIPL 2025: Delhi Capitals (DC) have picked Bangladesh fast bowler Mustafizur Rahman for the remainder of the tournament after it was learned that Jake Fraser-McGurk won't return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/english-fa-reappoint-dan-ashworth-as-chief-football-officer-2724654-2025-05-14",
      "headline": "English FA reappoint Dan Ashworth as chief football officerFormer Manchester United sporting director Dan Ashworth has rejoined the Football Association as their first chief football officer on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mehidy-hasan-miraz-kathryn-bryce-named-icc-players-of-the-month-for-april-2724648-2025-05-14",
      "headline": "Mehidy Hasan Miraz, Kathryn Bryce named ICC Players of the Month for AprilBangladesh all-rounder Mehidy Hasan Miraz and Scotland captain Kathryn Bryce were named ICC Men's and Women's Player of the Month for April 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bcci-sunil-gavaskar-suggestion-cheerleaders-djs-2724616-2025-05-14",
      "headline": "BCCI to discuss hosting remainder of IPL 2025 without cheerleaders, DJs: SourcesBatting great Sunil Gavaskar, speaking to India Today, urged the BCCI to host the remainder of the IPL 2025 season without glitz and glamour, saying it would be a gesture of respect for the families affected by the conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-george-bailey-wtc-final-australia-vs-south-africa-2724613-2025-05-14",
      "headline": "Labuschange to open in WTC Final? Australia selector opens upSince David Warner retired from Test cricket, Usman Khawaja has had four different opening partners. Chairman of selectors George Bailey said that Marnus Labuschagne is one of the options as Usman Khawaja's opening partner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-will-retain-a-plus-contract-after-test-retirement-2724609-2025-05-14",
      "headline": "Why Kohli and Rohit will retain A-plus contract after Test retirement?Star Indian batting duo Rohit Sharma and Virat Kohli are all set to retain their A-plus category contracts despite their recent retirement from Test format."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-pakistan-participation-doubtful-pahalgam-attack-2724595-2025-05-14",
      "headline": "Pahalgam fallout: Pakistan doubtful for Asia Cup 2025 hockey in BiharThe Asia Cup will be staged in Rajgir, Bihar from August 27 to September 7. Hosts India, Pakistan, Japan, Korea, China, Malaysia, Oman and Chinese Taipei are scheduled to participate in the 12th edition of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-james-anderson-india-shoes-2724588-2025-05-14",
      "headline": "India have big shoes to fill without Rohit, Kohli: James AndersonFormer England pacer James Anderson said that India have talent emerging from the IPL, but reckoned that they have big boots to fill after Rohit Sharma and Virat Kohli's Test retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pickleball-arvind-ramesh-prabhoo-exclusive-interview-2724553-2025-05-14",
      "headline": "Inside the battle for pickleball: Arvind Ramesh Prabhoo calls for national recognitionIn an exclusive conversation with Indiatoday.in, AIPA President Arvind Ramesh Prabhoo explained why the association strongly opposes the Sports Ministry's decision to grant national federation status to the newly-formed Indian Pickleball Association (IPA), and outlined AIPA's long-standing contributions to the development of the sport in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-reacts-to-rohitsharma-and-virat-kohlis-retirements-2724538-2025-05-14",
      "headline": "Great players should play till 50: Yograj Singh reacts to Rohit, Kohli's retirementsFormer India all-rounder Yograj Singh has reacted to the retirements of star Indian batting duo of Rohit Sharma and Virat Kohli saying that great players should continue playing till the age of 50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-and-rohit-sharma-will-retain-a-plus-contract-after-test-retirement-2724609-2025-05-14",
      "headline": "Why Kohli and Rohit will retain A-plus contract after Test retirement?Star Indian batting duo Rohit Sharma and Virat Kohli are all set to retain their A-plus category contracts despite their recent retirement from Test format."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-pakistan-participation-doubtful-pahalgam-attack-2724595-2025-05-14",
      "headline": "Pahalgam fallout: Pakistan doubtful for Asia Cup 2025 hockey in BiharThe Asia Cup will be staged in Rajgir, Bihar from August 27 to September 7. Hosts India, Pakistan, Japan, Korea, China, Malaysia, Oman and Chinese Taipei are scheduled to participate in the 12th edition of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-james-anderson-india-shoes-2724588-2025-05-14",
      "headline": "India have big shoes to fill without Rohit, Kohli: James AndersonFormer England pacer James Anderson said that India have talent emerging from the IPL, but reckoned that they have big boots to fill after Rohit Sharma and Virat Kohli's Test retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pickleball-arvind-ramesh-prabhoo-exclusive-interview-2724553-2025-05-14",
      "headline": "Inside the battle for pickleball: Arvind Ramesh Prabhoo calls for national recognitionIn an exclusive conversation with Indiatoday.in, AIPA President Arvind Ramesh Prabhoo explained why the association strongly opposes the Sports Ministry's decision to grant national federation status to the newly-formed Indian Pickleball Association (IPA), and outlined AIPA's long-standing contributions to the development of the sport in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yograj-singh-reacts-to-rohitsharma-and-virat-kohlis-retirements-2724538-2025-05-14",
      "headline": "Great players should play till 50: Yograj Singh reacts to Rohit, Kohli's retirementsFormer India all-rounder Yograj Singh has reacted to the retirements of star Indian batting duo of Rohit Sharma and Virat Kohli saying that great players should continue playing till the age of 50. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}