{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-rating-india-raises-outlook-economic-growth-7-percent-q2-performance-gst-reforms-rbi-rate-cut-2785047-2025-09-10",
      "headline": "Fitch raises India's growth forecast to 6.9% for FY26 on strong Q2 performanceThe revision comes after India's real GDP grew by 7.8% in the April–to-June quarter, surpassing expectations and marking an acceleration from the 7.4% growth seen in the previous three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/delhi-high-court-asks-priya-kapur-to-list-sunjay-kapurs-assets-2784953-2025-09-10",
      "headline": "Delhi High Court asks Priya Kapur to list Sunjay Kapur's assetsThe legal dispute over the estate of the late businessman Sanjay Kapoor has reached the Delhi High Court. A suit has been filed by Karishma Kapoor's two children, who claim they are entitled to their father's personal assets as legal heirs. The High Court has registered the suit and will hear the matter on the 9th of October to decide on an interim stay. The children contend they have been informed they are not beneficiaries under Sanjay Kapoor's will, which they are now questioning and allege has been forged. In response, Priya Kapoor's counsel has told the court that the children \"have already been given 1900 crore worth of assets six days before the suit was even filed.\" The Delhi High Court has directed Priya Kapoor to file a list of all movable and immovable assets of Sanjay Kapoor known to her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-crypto-exchange-eyes-3-billion-ipo-with-nasdaq-backing-2785006-2025-09-10",
      "headline": "This crypto exchange eyes $3 billion IPO with Nasdaq backingThe company, backed by the Winklevoss twins, plans to sell 16.67 million shares at a price between $24 and $26 each, up from its previous range of $17 to $19 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-affordable-housing-demand-is-slowing-down-in-india-2784968-2025-09-10",
      "headline": "Why affordable housing demand is slowing down in IndiaAffordable housing was once the backbone of India's housing dream, offering budget-friendly options to urban families. But today, demand in this segment is slipping, as buyers increasingly feel these homes don't match their needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karisma-kapoor-children-sunjay-kapoor-rs-30000-crore-empire-hearing-case-samaira-kiaan-2784884-2025-09-10",
      "headline": "Can Karisma Kapoor's children get a part of Sunjay Kapur's Rs 30,000 crore empire?The lawsuit from Karisma Kapoor's children accuses their stepmother Priya Sachdeva of withholding critical information and details about Sunjay Kapur's will. The hearing for this case is scheduled for today, September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/in-suit-filed-by-karisma-kapoors-children-stepmother-priya-asked-to-list-late-sunjay-kapurs-assets-2784893-2025-09-10",
      "headline": "Court asks Priya Kapur to list Sunjay Kapur's assets after lawsuitDelhi High Court has asked Priya Sachdev Kapur to submit a detailed list of all movable and immovable assets belonging to the late Sunjay Kapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-on-gold-jewellery-here-is-all-you-need-to-know-2784886-2025-09-10",
      "headline": "Tax on gold jewellery? Here's all you need to knowWondering if your gold jewellery attracts income tax? The answer depends on whether you simply own it or decide to sell it. Here's a quick look at how the tax rules work in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/novo-nordisk-cuts-9000-jobs-to-save-126-billion-annually-2784864-2025-09-10",
      "headline": "Novo Nordisk cuts 9,000 jobs to save $1.26 billion annuallyThe company, which employs nearly 78,400 people globally, said around 5,000 of the job losses will take place in Denmark. The decision comes as Novo faces increasing pressure from its US rival Eli Lilly and slowing demand for Wegovy in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/it-stocks-rally-big-on-fed-cut-optimism-where-to-invest-now-2784853-2025-09-10",
      "headline": "IT stocks rally big on Fed cut optimism Where to invest nowThe main driver behind IT sector rally is growing hope that the US Federal Reserve will cut interest rates soon. Lower rates would reduce costs for global businesses and boost demand for IT services. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/homebuyer-expectations-in-2025-pirce-affordability-location-luxury-2784839-2025-09-10",
      "headline": "What are homebuyers most worried about in 2025? Hint: It's not just priceThe 2025 housing market signals a clear shift. Buyers are moving beyond affordability, prioritising quality, timely delivery, and livability, even if it means paying more for premium and luxury homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-300-points-nifty-above-24950-lt-bel-among-top-gainers-2784817-2025-09-10",
      "headline": "Sensex up nearly 400 points, Nifty nears 25,000 on hopes of India-US trade talksThe S&P BSE Sensex rose over 350 points in early trade, while the Nifty50 edged close to the 25,000 mark around 9:30 am. Both indices reflected improved sentiment after five straight sessions of gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-review-open-bidding-today-latest-gmp-should-you-invest-2784793-2025-09-10",
      "headline": "Urban Company IPO open for bidding today: Should you invest as GMP doubles?Ahead of the public subscription, Urban Company raised Rs 854 crore from anchor investors. Notable institutions participating in the anchor round included Government Pension Fund Global, Nomura Funds Ireland, etc. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kurukshetra-netflix-adapts-the-mahabharata-into-a-2-part-animated-series-2785014-2025-09-10",
      "headline": "Kurukshetra: Netflix adapts the Mahabharata into a 2-part animated seriesNetflix recently announced a new series named 'Kurukshetra', drawing inspiration from the ancient Indian epic the Mahabharata. The series will release in two installments of nine episodes each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashneer-grover-not-salman-khan-clone-reality-show-host-rise-and-fall-2785002-2025-09-10",
      "headline": "Ashneer Grover on comparisons with Salman Khan: Not here to be a cloneAshneer Grover debuts as host of MXPlayer's Rise and Fall, facing comparisons to Salman Khan. He emphasises his unique style and rejects being seen as a clone, aiming to offer fresh content to audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-advance-booking-history-in-india-rs-15-crore-already-done-new-records-in-opening-weekend-2785011-2025-09-10",
      "headline": "Demon Slayer Infinity Castle advance booking: Rs 15 crore done, history in makingJapanese anime film 'Demon Slayer: Infinity Castle' sets records in India with advance ticket sales exceeding expectations. The film is scheduled to release on September 12, breaking prior anime records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-with-kajol-and-twinkle-when-and-where-to-watch-the-talk-show-2784947-2025-09-10",
      "headline": "Two Much with Kajol and Twinkle: When and where to watch the unscripted talk showThe release date of the upcoming talk show 'Two Much with Kajol and Twinkle' has been announced. The unscripted series will feature actors Kajol and Twinkle Khanna as co-hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vayuputra-3d-animation-film-on-lord-hanuman-announced-first-look-poster-out-2784975-2025-09-10",
      "headline": "Vayuputra, 3D animation film on Lord Hanuman announced. First-look poster outProducer Naga Vamsi shared the announcement about a new 3D animation film, Vayuputra, on his social media with an animated poster featuring Lord Hanuman. The animated film will be directed by Chandoo Mondeti of 'Thandel' fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/armaan-malik-first-indian-musician-apple-keynote-meets-tim-cook-ateez-yunho-2784988-2025-09-10",
      "headline": "Singer Armaan Malik meets Tim Cook and ATEEZ's Yunho at Apple keynoteSinger Armaan Malik's meets Tim Cook and Yunho at Apple Park and becomes the first Indian musician to attend Apple's keynote. Amitabh Bachchan's granddaughter Navya Nanda, was also present at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-trailer-review-akshay-kumar-arshad-warsi-go-big-on-their-fight-for-justice-2784986-2025-09-10",
      "headline": "Jolly LLB 3 trailer: Akshay Kumar-Arshad Warsi go big on their fight for justiceThe makers of Jolly LLB 3 have released the final trailer starring Akshay Kumar and Arshad Warsi. The courtroom comedy-drama, directed by Subhash Kapoor, showcases the clash between the two Jollies, a socially relevant storyline, and a star-studded cast including Saurabh Shukla, Huma Qureshi, and Amrita Rao. The film hits theaters on September 19."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-the-bengal-files-shocking-disturbing-anupam-kher-pallavi-joshi-2784976-2025-09-10",
      "headline": "Anupam Kher calls The Bengal Files shocking, disturbing as he watches in theatreActor Anupam Kher, who plays a pivotal role in Vivek Agnihotri's 'The Bengal Files', shared a post and called the film 'disturbing' and 'shocking'. He even wrote about watching the film with 80 per cent occupancy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-security-bigg-boss-19-threats-no-live-audience-strict-protocols-2784945-2025-09-10",
      "headline": "Salman Khan's security enhanced, no live audience on Bigg Boss 19: MakersSecurity measures for Salman Khan on 'Bigg Boss 19' have been intensified due to ongoing threats, resulting in no live audience and strict protocols."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jacqueline-fernandez-supports-hydrocephalus-child-with-medical-expense-pledge-alongside-hussain-mansuri-2784904-2025-09-10",
      "headline": "Jacqueline Fernandez visits child with rare condition, pledges supportBollywood actress Jacqueline Fernandez has committed to funding medical treatment for a child suffering from hydrocephalus, accompanied by philanthropist Hussain Mansuri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dwayne-johnson-sheds-weight-play-70-year-old-lizard-music-2784858-2025-09-10",
      "headline": "Dwayne Johnson sheds weight to play a 70-year-old in Lizard MusicHollywood actor Dwayne Johnson sheds muscle for a quirky new role in 'Lizard Music', reuniting with 'The Smashing Machine' director Benny Safdie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/karan-aujla-shines-us-tv-debut-jimmy-fallon-grooving-to-bhangra-the-tonight-show-2784923-2025-09-10",
      "headline": "Karan Aujla shines in US TV debut, gets Jimmy Fallon grooving to bhangra beatsSinger-songwriter Karan Aujla recently left fans surprised after he gave bhangra lessons to 'The Tonight Show' host Jimmy Fallon. The viral video has left fans rooting for South Asian fashion and culture on international TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-skips-bigg-boss-19-weekend-ka-vaar-akshay-kumar-arshad-warsi-host-2784894-2025-09-10",
      "headline": "Salman to skip Bigg Boss 19 shoot, Arshad-Akshay to host Weekend Ka VaarSalman Khan will skip 'Bigg Boss 19' Weekend Ka Vaar shoot due to Battle of Galwan filming in Ladakh. Akshay Kumar and Arshad Warsi will replace him as hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-17-day-16-written-update-amaal-mallik-kunickaa-sadanand-tanya-mittal-nomination-task-2784856-2025-09-10",
      "headline": "Bigg Boss 19 episode 17: Amaal revolts against Kunickaa, 4 contestants nominatedSinger Amaal Mallik went all out to support Tanya Mittal in her fight against Kunickaa Sadanand during the nomination task in 'Bigg Boss 19'. He planned to press the buzzer before the stipulated time, but was warned against it by 'Bigg Boss'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-invokes-grandfather-bp-koirala-legacy-amid-gen-z-nepal-protests-writes-democracy-is-indivisible-2784860-2025-09-10",
      "headline": "Democracy is indivisible: Manisha Koirala echoes grandfather amid Nepal protestsActor Manisha Koirala remembered her grandfather and Nepal's first elected Prime Minister, BP Koirala, amid ongoing youth-led protests. Quoting his words, \"Democracy is indivisible,\" she expressed solidarity with students rising against corruption and restrictions in Nepal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-after-being-called-jayaphilic-kaun-banega-crorepati-17-2784826-2025-09-10",
      "headline": "Patniji will be happy: Amitabh Bachchan after being called Jayaphilic on KBC 17A 'Kaun Banega Crorepati' 17 contestant enlightened Amitabh Bachchan about the term \"ambivert\" and praised his enduring love for his actor-wife Jaya Bachchan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/selena-gomez-on-love-of-indian-fans-it-means-the-world-to-me-exclusive-2784837-2025-09-10",
      "headline": "Selena Gomez on love of Indian fans: It means the world to me | Exclusive Selena Gomez opened up about her affection for India and hopes to tour the country soon. In an exclusive interview with India Today, she also reveals her joy working alongside stars like Meryl Streep in the latest season of 'Only Murders in the Building'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/inside-deepika-padukone-daughter-dua-1st-birthday-cake-baked-with-love-by-mom-2784836-2025-09-10",
      "headline": "Inside Deepika Padukone's daughter Dua's 1st birthday, cake baked with love by momActor Deepika Padukone baked a homemade chocolate cake to celebrate daughter Dua's first birthday. Sharing the sweet moment on Instagram, the actor gave fans a glimpse of her love-filled celebration with husband Ranveer Singh and their little one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prem-kumar-fahadh-faasil-tamil-action-thriller-collaboration-2784804-2025-09-10",
      "headline": "Fahadh Faasil to team up with Prem Kumar of Meiyazhagan fame. DetailsActor Fahadh Faasil has signed his next Tamil film in his career. The untitled film will be directed by Prem Kumar of '96' and 'Meiyazhagan' fame."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/rewrite-or-amend-constitution-investigate-properties-looted-in-3-decades-demands-of-nepal-gen-z-protesters-2784849-2025-09-10",
      "headline": "Rewrite Constitution, probe loot of 3 decades: Demand of Nepal Gen Z protesters Live UpdatesEven after toppling PM KP Sharma Oli-led government, Nepal remained tense as Gen Z protesters pushed for constitutional overhaul and demanded a probe into the looted assets of the country. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-double-game-betrayal-qatar-israel-attack-hamas-leaders-doha-2784914-2025-09-10",
      "headline": "Trump's 'Pushpa move', double game and a $400 million betrayal of QatarA White House official said that the US was informed well in advance of Israel's strike in Qatar to target Hamas leaders. The fact the strikes occurred in Qatar, a close ally of the US that has worked to cultivate Trump, only contributed to the sense of betrayal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/france-braces-for-acts-of-sabotage-amid-block-everything-protests-as-new-pm-takes-charge-over-200-arrested-2785050-2025-09-10",
      "headline": "New France PM's baptism by fire as 'Block Everything' protests rage; 200 arrestedProtesters staged demonstrations across France on Wednesday, disrupting traffic, setting fires and clashing with police in a bid to \"Block Everything\" in anger at the Macron government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/will-nepals-anarchy-lead-to-the-return-of-monarchy-the-lowdown-2785041-2025-09-10",
      "headline": "Will Nepal's anarchy lead to the return of monarchy? | The LowdownPro-monarchy chants heard during Nepal's Gen Z protests. Will democracy's crisis be an opportunity for the Shah dynasty?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/india-todays-first-look-at-iphone-17-air-2784912-2025-09-10",
      "headline": "India Today's first look at iPhone 17 AirIndia Today offers an exclusive first look at Apple's latest iPhone 17 Air, highlighting its design and key features."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/air-fauda-five-reasons-why-the-israeli-air-force-can-strike-west-asia-at-will-2784970-2025-09-10",
      "headline": "Air-Fauda: 5 reasons why the Israeli Air Force can strike West Asia at willIAF jets have struck Hamas in the Gaza Strip, crossed borders into southern Lebanon to assassinate Hezbollah chief Hasan Nasrallah, destroyed the Syrian navy and air force, and the defence headquarters in Damascus."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/greater-nicobar-port-project-india-pearl-harbour-benefits-indian-navy-2784999-2025-09-10",
      "headline": "India's Pearl Harbour in the Nicobar islandsThe port in Galathea Bay is one of India's most ambitious plans to create a dual-use civil-military project on one of its most strategically located island territories. Maritime strategists have likened the Nicobar port to a future Pearl Harbour, the gigantic US naval base on Hawaii."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-army-chief-sigdel-hindu-king-prithvi-narayan-shah-portrait-monarchy-return-speculation-2784961-2025-09-10",
      "headline": "Hindu king's portrait behind Nepal Army chief. Is there a message?When Nepal Army chief, General Ashok Raj Sigdel, addressed a restless nation on Tuesday, it wasn't just his call for peace that was important. A portrait of King Prithvi Narayan Shah hung prominently behind him. Is there a message behind the image of the Hindu king, founder of Nepal's Shah dynasty?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/iit-entry-without-jee-lateral-entry-olympiads-2784717-2025-09-10",
      "headline": "Is the Olympiad route to IITs creating a new meritocracy beyond the JEE?Gaining admission to India's most prestigious institutes is no longer limited to cracking the JEE alone. A lateral entry route has opened up for students who excel in international Olympiads, offering them a direct pathway into IITs. Institutes like IIT Kanpur, IIT Madras, and IIT Bombay have already embraced this initiative. But how exactly does this new system work?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-army-chief-holds-midnight-talks-with-protesters-as-unrest-continues-2784775-2025-09-10",
      "headline": "Live: Army warns against vandalism, announces nationwide curfew after 5 pmNepal descended into political turmoil on Tuesday after Prime Minister K P Sharma Oli resigned, as Gen Z-led demonstrations intensified across Kathmandu and other regions. Protesters stormed government buildings, including Parliament and the Prime Minister's Office, and set ablaze the private residences of President Ram Chandra Poudel, Oli, and several former premiers. In response to the escalating crisis, the Nepal Army and top security officials jointly appealed for calm, urging dialogue as the only path to restore order. The Army vowed to safeguard the country's sovereignty, independence, and the lives and property of its citizens while closely monitoring the Gen Z-led movement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-natural-partners-pm-modi-says-he-too-is-looking-forward-to-speaking-with-president-trump-2784778-2025-09-10",
      "headline": "Likewise: PM Modi responds to Trump's 'looking forward to speak' postThe positive exchange between PM Modi and US President Donald Trump comes against the backdrop of Washington's punitive 50 per cent tariffs on New Delhi over Russian oil imports roiling bilateral ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protests-former-pm-hit-with-sticks-foreign-minister-wife-punched-as-protesters-storm-their-home-2784820-2025-09-10",
      "headline": "Video: Ex-Nepal PM hit with sticks, wife punched as protesters storm their homeA dramatic video from the attack, now viral on social media, shows the minister being kicked, punched, and manhandled by protesters after they forced their way into her home. In chaotic scenes, another group of demonstrators can be seen stepping in to shield her from further blows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-trailer-review-akshay-kumar-arshad-warsi-go-big-on-their-fight-for-justice-2784986-2025-09-10",
      "headline": "Jolly LLB 3 trailer: Akshay Kumar-Arshad Warsi go big on their fight for justiceThe makers of Jolly LLB 3 have released the final trailer starring Akshay Kumar and Arshad Warsi. The courtroom comedy-drama, directed by Subhash Kapoor, showcases the clash between the two Jollies, a socially relevant storyline, and a star-studded cast including Saurabh Shukla, Huma Qureshi, and Amrita Rao. The film hits theaters on September 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/in-suit-filed-by-karisma-kapoors-children-stepmother-priya-asked-to-list-late-sunjay-kapurs-assets-2784893-2025-09-10",
      "headline": "Court asks Priya Kapur to list Sunjay Kapur's assets after lawsuitDelhi High Court has asked Priya Sachdev Kapur to submit a detailed list of all movable and immovable assets belonging to the late Sunjay Kapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-uae-prediction-asia-cup-group-a-match-dubai-team-news-2784799-2025-09-10",
      "headline": "IND v UAE preview: Suryakumar Yadav's India out to justify favourites tagThe Asia Cup opens with India expected to set the tone. The defending world champions will be looking to live up to the billing of outright favourites. The UAE, meanwhile, chase pride in a rare shot against cricket's powerhouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-new-thar-flies-out-of-delhi-showroom-as-lemon-crushing-ritual-goes-wrong-2784925-2025-09-10",
      "headline": "New Thar flies out of Delhi showroom as lemon crushing ritual goes wrongAs part of a traditional ritual, the woman placed lemons under the tyres before driving the vehicle forward. However, she pressed the accelerator instead, causing the car to lurch forward uncontrollably."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/language-debate-hindi-tamil-north-south-india-maharashtra-bangalore-noam-chomsky-identity-pride-power-2783025-2025-09-10",
      "headline": "Why the linguist from Mars would laugh at India's language warsLanguage wars in India might puzzle both philosophers and even a linguist from Mars. Linguist Noam Chomsky's thought experiment imagined such a Martian, who would see all human tongues as the same, mere variations of a universal grammar hardwired into us. But on Earth, those tongues become symbols of identity, culture, and pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/it-is-true-you-can-fly-to-dubai-and-buy-iphone-17-pro-max-and-still-save-money-over-buying-it-in-india-2784870-2025-09-10",
      "headline": "Fly to Dubai, buy iPhone 17 Pro Max, and you will save money over buying it hereApple has finally launched the iPhone 17 series. As is always the case, the prices in India and other regions vary significantly, and in some cases so much that you can actually save money by taking a flight to Dubai, buy the iPhone 17 Pro Max there and then come back. In a manner of speaking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protests-former-pm-baburam-bhattarai-asks-protesters-to-be-beware-of-wolves-dressed-as-sheep-2784883-2025-09-10",
      "headline": "Wolves dressed as sheep: Ex-Nepal PM on infiltrators among Gen Z protestersWriting from his Tokha residence in Kathmandu, Baburam Bhattarai recounted how he and his 96-year-old father narrowly escaped death after protesters set fire to his home, highlighting the personal danger posed by the unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/powerful-alien-signal-hits-earth-it-came-from-outside-the-milky-way-galaxy-2784992-2025-09-10",
      "headline": "Powerful alien signal hits Earth. It came from outside the galaxyScientists have discovered repeated bursts of gamma rays coming from outside our galaxy over a day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/inside-deepika-padukone-daughter-dua-1st-birthday-cake-baked-with-love-by-mom-2784836-2025-09-10",
      "headline": "Inside Deepika Padukone's daughter Dua's 1st birthday, cake baked with love by momActor Deepika Padukone baked a homemade chocolate cake to celebrate daughter Dua's first birthday. Sharing the sweet moment on Instagram, the actor gave fans a glimpse of her love-filled celebration with husband Ranveer Singh and their little one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/40-year-old-ktaka-mangaluru-woman-dies-after-two-wheeler-hits-pothole-lorry-crushes-victim-2784878-2025-09-10",
      "headline": "Karnataka woman crushed under lorry after her scooter topples on pothole in highwayA 44-year-old Karnataka woman fell under a moving lorry after her two-wheeler toppled over a pothole on national highway near Kuluru, prompting police to register a case against driver and highway officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/suicide-prevention-mental-health-awareness-breaking-myths-support-india-2784588-2025-09-10",
      "headline": "Changing the suicide narrative: Why mental health is everyone's businessSuicide rates in India highlight urgent need to change harmful narratives. Greater awareness and support systems can help prevent these avoidable deaths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/homebuyer-expectations-in-2025-pirce-affordability-location-luxury-2784839-2025-09-10",
      "headline": "What are homebuyers most worried about in 2025? Hint: It's not just priceThe 2025 housing market signals a clear shift. Buyers are moving beyond affordability, prioritising quality, timely delivery, and livability, even if it means paying more for premium and luxury homes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-third-match-moved-to-hobart-floodlight-delays-2785028-2025-09-10",
      "headline": "India vs Australia 3rd Women's ODI shifted to Hobart from MelbourneThe third women's ODI between India and Australia has been moved from Melbourne to Hobart due to floodlight installation delays. India will play three ODIs, three T20Is and one Test on the tour of Australia in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-bcci-video-shubman-gill-speculations-2785029-2025-09-10",
      "headline": "Asia Cup: BCCI's latest clip of Sanju Samson leaves fans scratching their heads amidst selection dramaFans were left scratching their head after a bizarre ending to their latest video showing Sanju Samson ahead of their Asia Cup 2025 opener against the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-playoffs-top-eight-teams-qualify-semi-finals-2025-2784773-2025-09-10",
      "headline": "BGMS season 4 playoffs end with top eight teams in semi-finalsThe BGMS Season 4 playoffs concluded with the top eight teams advancing to the semi-finals. Intense matches are expected as seasoned teams compete for the championship title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-shaheen-afridi-form-2784983-2025-09-10",
      "headline": "Shaheen Afridi is back in his rhythm: Wasim AkramFormer cricketer Wasim Akram is excited to see Shaheen Shah Afridi in the Asia Cup. The star fast bowler is slowly gaining form after months of poor performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-pat-cummins-comeback-plan-back-injury-concerns-2784985-2025-09-10",
      "headline": "Pat Cummins sets Ashes comeback plan amidst back injury concernsPat Cummins is aiming for a swift recovery from his lumbar bone stress injury to return in time for the home Ashes. Confident about Australia's bowling depth, the skipper is determined to push himself to be fit for the first Test against England in Perth.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestlepalooza-2024-john-cena-vs-brock-lesnar-aj-lee-return-mixed-tag-match-2784768-2025-09-10",
      "headline": "Updated WWE Wrestlepalooza Card revealed: 2 new matches confirmedWrestlepalooza 2024 features star-studded matches including Cena vs Lesnar. AJ Lee's return and new rivalries promise unforgettable moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-uae-match-details-2784935-2025-09-10",
      "headline": "UAE captain Muhammad Waseem hoping to give India a run for their moneyUAE captain Muhammad Waseem has expressed confidence ahead of Asia Cup 2025 opener against India. The team aims to leverage home conditions and challenge favourites India in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-gukesh-defeat-nikolas-theoduru-vaishali-2784939-2025-09-10",
      "headline": "FIDE Grand Swiss: Gukesh suffers second loss, Erigaisi, Vaishali stay in huntWorld champion D Gukesh suffers defeat in the World Cup Swiss tournament, impacting his chances for Candidates 2026. Meanwhile, Arjun Erigaisi and R Vaishali maintain strong positions, setting up a tense final phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/valorant-champions-2025-group-c-preview-team-liquid-edward-gaming-nrg-drx-2784772-2025-09-10",
      "headline": "VALORANT Champions 2025: Group C stacked with Liquid, EDG, NRG, and DRXGroup C at Valorant Champions 2025 promises intense competition among top teams. The battle will test legacies, strategy adaptations, and resilience on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-cricket-litton-das-asia-cup-2024-resurgence-preview-2784901-2025-09-10",
      "headline": "Litton Das shines bright, but can Bangladesh turn brilliance into glory?Bangladesh have shown steady improvement in T20 cricket under captain Litton Das. Their balanced squad and recent series wins raise hopes for a strong Asia Cup 2025 performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-jonathan-trott-afghanistan-grounded-hong-kong-win-2784869-2025-09-10",
      "headline": "Jonathan Trott warns Afghanistan after Hong Kong rout in Asia Cup: We've won nothingAfghanistan won their opening Asia Cup match against Hong Kong but showed inconsistency in performance. Coach Jonathan Trott warned that individual brilliance won't suffice against stronger teams ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-uae-match-details-2784935-2025-09-10",
      "headline": "UAE captain Muhammad Waseem hoping to give India a run for their moneyUAE captain Muhammad Waseem has expressed confidence ahead of Asia Cup 2025 opener against India. The team aims to leverage home conditions and challenge favourites India in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-gukesh-defeat-nikolas-theoduru-vaishali-2784939-2025-09-10",
      "headline": "FIDE Grand Swiss: Gukesh suffers second loss, Erigaisi, Vaishali stay in huntWorld champion D Gukesh suffers defeat in the World Cup Swiss tournament, impacting his chances for Candidates 2026. Meanwhile, Arjun Erigaisi and R Vaishali maintain strong positions, setting up a tense final phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/valorant-champions-2025-group-c-preview-team-liquid-edward-gaming-nrg-drx-2784772-2025-09-10",
      "headline": "VALORANT Champions 2025: Group C stacked with Liquid, EDG, NRG, and DRXGroup C at Valorant Champions 2025 promises intense competition among top teams. The battle will test legacies, strategy adaptations, and resilience on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-cricket-litton-das-asia-cup-2024-resurgence-preview-2784901-2025-09-10",
      "headline": "Litton Das shines bright, but can Bangladesh turn brilliance into glory?Bangladesh have shown steady improvement in T20 cricket under captain Litton Das. Their balanced squad and recent series wins raise hopes for a strong Asia Cup 2025 performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-jonathan-trott-afghanistan-grounded-hong-kong-win-2784869-2025-09-10",
      "headline": "Jonathan Trott warns Afghanistan after Hong Kong rout in Asia Cup: We've won nothingAfghanistan won their opening Asia Cup match against Hong Kong but showed inconsistency in performance. Coach Jonathan Trott warned that individual brilliance won't suffice against stronger teams ahead."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}