{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/google-ai-wave-q4-result-cross-400-billion-in-annual-revenue-ceo-sundar-pichai-gemini-cloud-services-2864278-2026-02-06",
      "headline": "How Google rode the AI wave to cross $400 billion in annual revenue for 1st timeGoogle said that the Gemini app alone has crossed 750 million monthly active users, showing that AI adoption is no longer limited to developers or businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/fractal-analytics-aye-finance-ipos-to-open-next-week-what-investors-should-know-2864265-2026-02-06",
      "headline": "Fractal Analytics, Aye Finance IPOs to open next week: What investors should knowInvestors will have two fresh IPO opportunities next week as Fractal Analytics and Aye Finance open their public issues on February 9. The offerings span technology and finance, drawing attention from those looking to diversify their portfolios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crash-wipes-2-trillion-what-triggered-biggest-crypto-slump-since-trumps-election-2864179-2026-02-06",
      "headline": "Bitcoin crash stuns markets. Decoding biggest crypto slump since Trump electionBitcoin has witnessed one of its sharpest corrections in recent years, wiping out more than $2 trillion from the global cryptocurrency market in a single day. The fall is the steepest since Donald Trump's election. It comes amid rising global risk aversion, weakness in technology and AI stocks, and sustained institutional selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-rebound-fmcg-high-it-stocks-bleed-tcs-infosys-shares-down-2864177-2026-02-06",
      "headline": "Sensex, Nifty rebound to close higher; IT stocks bleed to limit gainsThe S&P BSE Sensex added 266.47 points to close at 83,580.40, while the NSE Nifty50 gained 50.90 points to end at 25,693.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-uber-rapido-drivers-6-hour-strike-february-7-minimum-fares-key-demands-2864126-2026-02-06",
      "headline": "Why Ola, Uber and Rapido drivers are going on a 6-hour strike tomorrowThe strike has been called by the Telangana Gig and Platform Workers Union, also known as TGPWU. The union represents app-based transport workers operating on platforms such as Ola, Uber and Rapido."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-rs-1000-silver-falls-rs-6000-should-you-buy-now-or-wait-longer-2864098-2026-02-06",
      "headline": "Gold jumps Rs 1,000, silver falls Rs 6,000: Should you buy now or wait longer?Recent swings in gold and silver prices have caught investors' attention, with the metals showing mixed trends after a strong run. The big question now is whether this is a pause before the next move — should you buy now or wait longer?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-budget-2026-putting-services-at-the-centre-of-indias-growth-strategy-2864036-2026-02-06",
      "headline": "Is Budget 2026 putting services at the centre of India's growth strategy?Budget 2026, in essence, quietly recognises that India's economic growth and job creation are and will continue to be powered by services – both tradable and non-tradable, while maintaining the focus on infrastructure and manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-rbis-new-measures-make-it-easier-to-do-business-and-boost-credit-flow-2864024-2026-02-06",
      "headline": "Can RBI's new measures make it easier to do business and boost credit flow?With the RBI announcing new steps to improve credit access and ease regulations, attention is turning to their real-world impact. Could these changes help businesses grow and borrow more smoothly?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-is-falling-rbi-repo-rate-unchanged-sensex-nifty-down-it-shares-fall-reason-2864018-2026-02-06",
      "headline": "Why stock markets fell after RBI kept key lending rates unchanged Even though inflation is within the comfort band and growth remains robust, RBI signalled that it is not ready to shift toward a softer stance. Global uncertainties, from geopolitical tensions to commodity volatility, continue to influence the outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/repo-rate-unchanged-rbi-why-stable-emis-are-not-bad-news-for-homebuyers-2863992-2026-02-06",
      "headline": "RBI keeps repo rate unchanged, why its still a win-win situation for homebuyersWhile many homebuyers were hoping for a rate cut, the RBI decision to keep rates steady at 5.25% is not bad news, especially for those who value stability and clear planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-maintains-525-repo-rate-what-it-means-for-homebuyers-and-emis-2863988-2026-02-06",
      "headline": "RBI maintains 5.25% repo rate: What it means for homebuyers and EMIsThe RBI has decided to keep its key interest rate unchanged in its latest policy review. What could this steady stance mean for homebuyers and their monthly loan repayments?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rates-unchanged-at-525-in-last-mpc-of-fy26-2863965-2026-02-06",
      "headline": "RBI keeps key lending rates unchanged at 5.25% in last MPC of FY26The Reserve Bank of India (RBI) kept repo rate unchanged at 5.25% in the last meeting for Fy26. The RBI Governor said inflation trends have been supportive of keeping rates unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-it-stocks-down-sensex-nifty-fall-tcs-infosys-tech-mahindra-tank-2863959-2026-02-06",
      "headline": "Sensex, Nifty open lower as IT stocks continue fall; TCS, TechM down 2%The S&P BSE Sensex fell by 216.98 points to 83,097.00, while the NSE Nifty50 lost 80.25 points to 25,562.55 as of 9:48 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-falls-16-month-low-will-it-drop-below-60000-2863946-2026-02-06",
      "headline": "Bitcoin prices hit 16-month low: Will it fall below $60,000?Bitcoin, the world's largest cryptocurrency, dropped to an intraday low of $60,008.52 during volatile trade. This was the weakest level seen since October 2024"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-today-repo-rate-cut-or-stable-governor-sanjay-malhotra-sdf-msf-expert-views-2863937-2026-02-06",
      "headline": "RBI MPC announcement today: Will Governor Sanjay Malhotra reduce repo rate?In its December policy meeting, the Reserve Bank of India had reduced the repo rate by 25 basis points from 5.50% to 5.25%. At the same time, it retained a neutral policy stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-trade-policy-gender-blind-spot-women-trade-fta-2863929-2026-02-06",
      "headline": "India-EU trade deal and the gender blind spot in India's trade policyIntegrating gender considerations into trade policy design, implementation, and evaluation is therefore essential—not only to ensure that trade works for women, but to ensure that trade works better overall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-nigeria-ties-key-to-shaping-a-stronger-global-south-2863702-2026-02-05",
      "headline": "India–Nigeria ties key to shaping a stronger global southBy working closely through diplomatic engagement, trade and cultural cooperation, Musawa believes that both nations can play a leading role in shaping a future where developing countries have a louder voice on the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/peace-partnerships-and-progress-top-agenda-for-caribbean-nations-2863669-2026-02-05",
      "headline": "Peace, partnerships and progress top agenda for Caribbean nationsSpeaking to India Today at the World Governments Summit, Wheatley and Mitchell highlighted the importance of peace, economic diversification and stronger global partnerships for Caribbean nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hovers-around-71000-hits-weakest-level-in-about-15-months-2863583-2026-02-05",
      "headline": "Bitcoin hovers around $71,000, hits weakest level in about 15 monthsBitcoin fell nearly 2% to around $71,000 on February 5, marking its weakest level in about 15 months. The world's largest cryptocurrency has now lost more than 42% from its October peak of $126,000 last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-govt-summit-2026-jose-ramos-horta-international-law-warning-2863587-2026-02-05",
      "headline": "Global conflicts expose decline of international law, says Timor-Leste president President of Timor-Leste José Ramos-Horta said the world is witnessing the steady breakdown of global systems that were created to protect peace, human rights, and fair international trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/samay-raina-on-performing-at-madison-square-us-president-donald-trump-and-more-2864304-2026-02-06",
      "headline": "Samay Raina on performing at Madison Square, US President Donald Trump and more In an interview with India Today, comedian Samay Raina discusses his show Still Alive and performing at Madison Square Garden. Reflecting on past legal controversies, Raina humorously compares performing in India and the US, while explaining how personal resilience fuelled his latest unscripted performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-on-nick-jonas-sunday-best-youre-the-most-honest-person-i-know-2864376-2026-02-06",
      "headline": "Priyanka Chopra on Nick Jonas' Sunday Best: You're the most honest person I know Priyanka Chopra dedicated an emotional note to husband Nick Jonas following the release of his new album Sunday Best. Praising his \"endless talent\" and sincerity, the actor expressed pride in his work while preparing for her own upcoming releases in the film and the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-on-arijit-quitting-playback-singing-we-are-not-factory-products-2864350-2026-02-06",
      "headline": "Pankaj Tripathi on Arijit quitting playback singing: We are not factory products Pankaj Tripathi has backed Arijit Singh's decision to quit playback singing, highlighting the vital need for artistic breaks. Emphasising that creators are not \"factory products,\" the actor said that slowing down is essential for personal reinvention and maintaining excitement in a demanding profession."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/singer-chinmayi-sripadaa-backs-arjun-kapoor-after-emotional-post-on-online-bullying-2864345-2026-02-06",
      "headline": "Singer Chinmayi backs Arjun Kapoor after emotional post on online bullying Singer Chinmayi Sripaada publicly supported Arjun Kapoor amid concerns about harsh social media trolling, following the actor's candid post about difficult times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ashakal-aayiram-review-jayaram-kalidas-family-drama-passion-ego-2864406-2026-02-06",
      "headline": "Ashakal Aayiram review: Jayaram-Kalidas shine, but film falls short of greatnessRelease Date:Fri Feb 06, 2026 Ashakal Aayiram movie review: Director G Prajith's Ashakal Aayiram, starring Jayaram and Kalidas Jayaram, is an attempt at a heartwarming film about a dad-son's passion and ego issues. The film has interesting ideas, but falls short of greatness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swifts-opalite-video-packs-cameos-and-peak-90s-nostalgia-domnhall-gleeson-cillian-murphy-lewis-capaldi-2864353-2026-02-06",
      "headline": "Taylor Swift's Opalite video packs cameos and peak '90s nostalgia. Watch Taylor Swift has released the quirky and nostalgic music video for Opalite exclusively on Spotify and Apple Music, opting to skip YouTube for now. The video features a star-studded cast and blends humour with retro kitsch, reflecting themes of emotional survival and happiness in true Swift style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/anomie-review-crime-thriller-bhavana-menon-rahman-flawed-execution-review-2864339-2026-02-06",
      "headline": "Anomie review: Bhavana starrer crime thriller is high concept, low impactRelease Date:Fri Feb 06, 2026 Anomie: The Equation of Death is a Malayalam crime thriller starring Bhavana Menon in the lead. The film, directed by debutant Riyaz Marath, is a below-average crime thriller that promises gold but only delivers brass (in slow motion)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/euphoria-review-strong-themes-uneven-storytelling-in-gunasekhars-social-drama-2864273-2026-02-06",
      "headline": "Euphoria review: Strong themes, uneven storytelling in Gunasekhar's social dramaRelease Date:Fri Feb 06, 2026 Euphoria marks Gunasekhar's shift from visual spectacle to a hard-hitting social drama, but uneven execution keeps its powerful ideas from fully landing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-yrf-denies-claims-of-sensationalising-delhi-missing-girls-case-2864323-2026-02-06",
      "headline": "YRF breaks silence on Mardaani 3 being linked to Delhi's missing girls report Yash Raj Films responded to allegations that it used reports of missing girls in Delhi to amplify promotions for the film Mardaani 3, starring Rani Mukerji. It denied any deliberate sensationalism of the sensitive issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/steve-carell-returns-to-tv-with-hbo-campus-comedy-rooster-watch-trailer-2864293-2026-02-06",
      "headline": "Steve Carell returns to TV with HBO campus comedy Rooster. Watch trailer HBO's new comedy series Rooster, starring Steve Carell and Charly Clive, is set to premiere on 8 March and will explore the dynamics between an author and his daughter on a college campus."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-charity-controversy-lenin-bharathi-fake-philanthropist-sanitisation-worker-2864256-2026-02-06",
      "headline": "Director Lenin Bharathi labels Rajinikanth 'fake philanthropist' over charity act Filmmaker Lenin Bharathi has criticised Rajinikanth calling him a 'fake philanthropist' after gifting a gold chain to a sanitation worker. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yashs-toxic-sells-andhra-pradesh-telangana-distribution-rights-for-rs-120-crore-2864203-2026-02-06",
      "headline": "Yash's Toxic sells Andhra Pradesh-Telangana distribution rights for Rs 120 crore Sri Venkateswara Creations secured Andhra Pradesh and Telangana rights for Toxic in a landmark Rs 120 crore deal, the highest ever for a non-Telugu origin film, highlighting strong industry confidence in the upcoming release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ruby-bhatia-who-earned-rs-1-lakh-per-show-says-she-makes-rs-1000-a-video-now-2864115-2026-02-06",
      "headline": "Ruby Bhatia, who earned Rs 1 lakh per show, says she makes Rs 1,000 a video now Video jockey Ruby Bhatia addressed public speculation about her financial situation. In a recent interview, she explained her low fees for Instagram videos and her preference for a quieter, more manageable way of life amid rising expenses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prabhas-the-rajasab-streaming-premiere-causes-jiohotstar-platform-crash-2864182-2026-02-06",
      "headline": "The Raja Saab on OTT: JioHotstar crashes ahead of film's digital release The digital launch of Prabhas' horror comedy The Raja Saab on JioHotstar led to a record-breaking surge in platform traffic, resulting in technical disruptions and prompting the streamer to enhance its server capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sabar-bonda-on-ott-when-and-where-to-watch-award-winning-marathi-lgbtq-drama-2864160-2026-02-06",
      "headline": "Sabar Bonda on OTT: When and where to watch Sundance winner Marathi LGBTQ+ drama Rohan Parashuram Kanawade's celebrated Marathi-language film Sabar Bonda, which earned top awards at the 2025 Sundance Film Festival, is now streaming online following a delayed digital release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-reveals-he-was-nervous-after-hearing-rajamoulis-varanasi-narration-2864168-2026-02-06",
      "headline": "Mahesh Babu reveals he was nervous after hearing Rajamouli's Varanasi narration Mahesh Babu recently revealed that he was nervous when SS Rajamouli narrated Varanasi. The actor recalled what he did to deal with the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-tops-netflix-in-22-nations-including-pak-bangladesh-saudi-arabia-uae-2864136-2026-02-06",
      "headline": "Dhurandhar tops Netflix in 22 nations including Pak, Bangladesh, Saudi Arabia, UAE The espionage-thriller Dhurandhar has set a global benchmark following its OTT release. The film is currently trending at number one in 22 countries, including Pakistan, Bangladesh and Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pankaj-tripathi-returns-theatre-musical-comedy-lailaaj-daughter-aashi-2864141-2026-02-06",
      "headline": "Pankaj Tripathi returns to theatre after 12 years, shares stage with daughter Aashi Pankaj Tripathi is set to make his stage comeback after a 12-year hiatus with the musical comedy play Lailaaj. The production will feature Tripathi in a cameo alongside his daughter Aashi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-singer-talwiinder-reacts-viral-unmasked-video-media-public-scrutiny-2864113-2026-02-06",
      "headline": "Talwiinder says his world changed after viral video with Disha Patani A leaked video forced Talwiinder into the spotlight he always avoided. His emotional reaction reveals how the moment changed everything overnight."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-england-win-sixth-u19-world-cup-title-vaibhav-sooryavanshi-175-2864389-2026-02-06",
      "headline": "India win 6th U19 World Cup crown after Sooryavanshi 175 scorches EnglandIndia lifted a sixth men's Under-19 World Cup title after Vaibhav Sooryavanshi's magnificent 175 laid the foundation for a dominant 100-run victory over England in the final at the Harare Sports Club on February, February 6."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/islamabad-shiite-mosque-suicide-bombing-killed-injured-pakistan-2864295-2026-02-06",
      "headline": "Bomber was stopped by guards, blew self up killing 50: All about Islamabad blastA suicide bomber killed at least 50 people and injured over 150 after being stopped by security guards at the gate of a Shi'ite mosque in Islamabad during Friday prayers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mardaani-3-yrf-denies-claims-of-sensationalising-delhi-missing-girls-case-2864323-2026-02-06",
      "headline": "YRF breaks silence on Mardaani 3 being linked to Delhi's missing girls reportYash Raj Films responded to allegations that it used reports of missing girls in Delhi to amplify promotions for the film Mardaani 3, starring Rani Mukerji. It denied any deliberate sensationalism of the sensitive issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/every-home-has-a-patient-diarrhoea-boils-linked-to-contaminated-water-in-noida-sector-brahmaputra-apartments-unsafe-water-2863983-2026-02-06",
      "headline": "Insects in drinking water at Noida society for veterans; an Indore waiting to happen?In Noida's Sector 29, a residential society home to retired Army veterans, residents now measure daily life in sediments and insects flowing from their taps. Days without safe water have become routine, with little sign of urgency in fixing the crisis. You should read this ground report to understand how easily a water contamination emergency can take hold, and why no neighbourhood is immune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/news-analysis/story/dhurandhar-balochistan-hamza-ali-pakistan-attack-bla-bashir-zaib-ranveer-singh-2863743-2026-02-06",
      "headline": "Internet spots Hamza in Balochistan: BLA's Pak attack clip has shades of DhurandharHandcrafted ByOur Editors When Baloch fighters went out to launch decades' deadliest attack on Pakistan, the visuals looked straight out of Dhurandhar. The visual was uncanny: wind-swept desert, militant gear, flowing beard, unhurried swagger, eyes fixed forward, making the internet believe 'Balochistan has its own Hamza Ali Mazari.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/confused-by-conflicting-reports-on-missing-delhi-children-heres-all-you-need-to-know-2864381-2026-02-06",
      "headline": "Confused by conflicting reports on missing Delhi children? Here's all you need to knowIndia Today Fact Check went through the many claims and counterclaims to cut through the noise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-elections-bnp-tarique-rahman-jamaat-india-poll-manifesto-2864222-2026-02-06",
      "headline": "Bangladesh elections: What political parties promised on India, HindusThe February 12 Bangladesh elections will see a direct clash between Tarique Rahman's Bangladesh Nationalist Party (BNP) and the Jamaat. Both parties released their poll manifestos this week, outlining their stance towards India and Hindus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-test-fires-agni-3-ballistic-missile-february-2864384-2026-02-06",
      "headline": "Agni-3: India test fires missile that can strike up to 3,000 kmIndia successfully test-fired the Agni-3 intermediate-range ballistic missile from Odisha on February 6, validating its operational readiness under the Strategic Forces Command. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-election-hefazat-e-islam-declares-jihad-against-jamaat-e-islami-voting-haram-supports-bnp-2864359-2026-02-06",
      "headline": "Voting for Jamaat is haram: Islamist Hefazat launches jihad on Bangladesh poll eveJust days before Bangladesh votes, rival Islamist groups have turned the election into a showdown. The Hefazat-e-Islam has declared jihad against the Islamist Jamaat-e-Islami, saying voting for it is \"haram\". Hefazat is backing the Tarique Rahman-led Bangladesh Nationalist Party (BNP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-175-u19-world-cup-final-records-broken-ind-vs-eng-2864166-2026-02-06",
      "headline": "Vaibhav 175: No double, but he shatters records in U19 World Cup finalVaibhav Sooryavanshi produced one of the most commanding innings in Under-19 World Cup history, scoring a stunning 175 off 80 balls in the final of the ICC Men's Under-19 World Cup against England at Harare. The 14-year-old left-hander's knock put India in complete control of the title clash and left England struggling to contain the onslaught."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/explosion-at-islamabads-imam-bargah-mosque-casualties-feared-2864152-2026-02-06",
      "headline": "50 killed, 169 injured in suicide attack in Islamabad during Friday prayersThe blast occurred while worshippers were offering Friday prayers at a Shia imambara on the outskirts of Islamabad. Videos from the site showed severed limbs strewn across the area, as locals and victims' family members gathered, desperately searching for their loved ones."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dhs-homeland-security-worst-of-the-worst-criminals-list-89-indian-offenders-names-donald-trump-2864171-2026-02-06",
      "headline": "ICE's Worst of the Worst list has 89 Indians, most convicted of financial fraudThe US Department of Homeland Security has released a database listing immigrants arrested by ICE and convicted for a range of offences. The database, which has at least 25,000 entries, also lists the names of 89 Indian offenders arrested for crimes ranging from financial fraud to sexual offences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/gurugram/story/speeding-scorpio-hits-schoolgirl-gurugram-adarsh-nagar-cctv-haryana-2864391-2026-02-06",
      "headline": "Video: Scorpio driver hits schoolgirl in Gurugram, drags her, then fleesA speeding Scorpio SUV hit a schoolgirl riding a scooter in Gurugram's Adarsh Nagar, dragging her for several metres and leaving her critically injured. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pune-entrepreneur-sunil-motilal-sadarangani-59-jumps-from-high-rise-incident-caught-on-camera-2864124-2026-02-06",
      "headline": "Pune entrepreneur, 59, jumps from high-rise, incident caught on cameraSunil Motilal Sadarangani, a renowned entrepreneur and owner of Multani Bakery in Solapur, tragically ended his life by jumping from a building in Pune. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-man-dies-after-falling-into-jal-board-pit-family-alleges-negligence-2864058-2026-02-06",
      "headline": "Delhi man falls to death in open Jal Board pit, 3 officials suspendedA young man from Delhi's Rohini went missing during his return home, leading to a frantic overnight search by his family and police. He was found dead in an uncovered water board pothole in Janakpuri. The Delhi Jal Board has suspended three officials following an initial probe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/google-ai-wave-q4-result-cross-400-billion-in-annual-revenue-ceo-sundar-pichai-gemini-cloud-services-2864278-2026-02-06",
      "headline": "How Google rode the AI wave to cross $400 billion in annual revenue for 1st timeGoogle said that the Gemini app alone has crossed 750 million monthly active users, showing that AI adoption is no longer limited to developers or businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/tawang-integration-india-75-years-story-major-bob-khathing-ralengnao-1951-frontier-peaceful-expedition-northeast-2863753-2026-02-06",
      "headline": "As Mao marched, India won Tawang without firing even a shot. Thanks to Bob KhatingIn the eastern Himalayas, Tawang used to be a loosely administered frontier region even after the 1914 Shimla Convention placed it in the British-Indian territory. Mao Zedong's annexation of Tibet in 1950 rang alarm bells for India. Then, Major Bob Khathing Ralengnao, a Manipuri Naga officer, achieved what the British could not. He hoisted the Indian Tricolour in Tawang on February 14, 1951, and integrated it with India, without firing a single shot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-amazon-meta-microsoft-spending-more-on-ai-in-2026-than-india-will-spend-on-entire-country-2864194-2026-02-06",
      "headline": "Tech companies spending more on AI in 2026 than India will spend on entire countryWhether AI is a boom or bust is something we don't know yet. But what has become clear is that tech companies are going all in on AI. Only four of them — Google, Meta, Amazon and Microsoft — are set to spend nearly $650 billion on AI in 2026. It is almost as much as the Indian government will spend on the entire country this year!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-weather-forecast-rain-snow-delhi-temperature-fog-february-7-saturday-2026-2864413-2026-02-06",
      "headline": "Sunny skies in Delhi, rain likely in parts of North India over weekendIndia is set to experience a mix of weather conditions, including fresh snow in the north and persistent fog in the plains. The India Meteorological Department (IMD) has detailed how two Western Disturbances will influence the climate over the coming days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-hypocrisy-red-carpet-world-bank-chief-ajay-banga-india-t20-match-boycott-2863982-2026-02-06",
      "headline": "Pak plays cricket politics, drops it for dollars from India-born World Bank headPakistan has decided to boycott the T20 World Cup match against India. However, on the other hand, it has rolled out the red carpet for Indian-origin World Bank chief Ajay Banga. Pakistan's mehman nawazi for Banga was not for nothing. We explain the reasons behind it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsp-mayawati-brahmins-ghooskhor-pandat-netflix-demands-ban-fir-up-election-yogi-adityanath-2864163-2026-02-06",
      "headline": "BSP chief Mayawati stands up for Brahmins in Ghooskhor Pandat rowBSP supremo Mayawati has demanded a ban and legal action against the upcoming Netflix film Ghooskhor Pandit, calling it \"casteist\". She said the Manoj Bajpayee-starrer insults and angers the Brahmin community. Just weeks ago, Mayawati opposed the UGC's equity rules, batting for \"upper-caste communities\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-uber-rapido-drivers-6-hour-strike-february-7-minimum-fares-key-demands-2864126-2026-02-06",
      "headline": "Why Ola, Uber and Rapido drivers are going on a 6-hour strike tomorrowThe strike has been called by the Telangana Gig and Platform Workers Union, also known as TGPWU. The union represents app-based transport workers operating on platforms such as Ola, Uber and Rapido."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-basant-lahore-2026-kite-flying-festival-punjab-cm-maryam-nawaz-market-hotel-booking-concert-2864100-2026-02-06",
      "headline": "Basant makes a stunning return to Pak's Lahore after a two-decade banAfter a 19-year ban, Basant festivities have returned to Lahore and set the city abuzz. Rooftops in the Pakistani city have come alive again with DJ music and hotels in Androon Lahore are fully booked. The Lahore sky is crowded with kites as the Maryam Nawaz government allowed three-day celebrations and promoted the festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/is-jeffrey-epstein-alive-or-dead-sparked-conspiracy-theory-jail-tier-entry-video-logs-cell-investigation-trump-2864102-2026-02-06",
      "headline": "Is Epstein alive? Conspiracy theories get new life after release of filesEven years after his death, Jeffrey Epstein is still stoking conspiracy theories. From viral images to newly released documents, there are claims that the convicted sex offender who supplied minor girls to elite clients might still be alive. While official probes said he died by suicide, security lapses and contradictions in prison records are fuelling claims."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-england-win-sixth-u19-world-cup-title-vaibhav-sooryavanshi-175-2864389-2026-02-06",
      "headline": "India win 6th U19 World Cup crown after Sooryavanshi 175 scorches England India lifted a sixth men's Under-19 World Cup title after Vaibhav Sooryavanshi's magnificent 175 laid the foundation for a dominant 100-run victory over England in the final at the Harare Sports Club on February, February 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-sourav-ganguly-surprised-pakistan-india-boycott-bangladesh-participate-2864385-2026-02-06",
      "headline": "Sourav Ganguly reacts to Pakistan's boycott stance against India in T20 World Cup ICC Men's T20 World Cup 2026: Sourav Ganguly expressed surprise at Pakistan's decision to boycott its T20 World Cup match against India, even as the tournament begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/delhi-court-denies-bail-olympian-sushil-kumar-sagar-dhankhar-murder-case-2864378-2026-02-06",
      "headline": "Olympian Sushil Kumar denied bail in fellow wrestler Sagar's murder case A Delhi court on Friday dismissed Olympian Sushil Kumar's bail plea in the murder case of former junior national wrestling champion Sagar Dhankar at the Chhatrasal Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-india-vs-usa-press-conference-suryakumar-yadav-mumbai-2864373-2026-02-06",
      "headline": "T20 World Cup: History up for grabs, but Surya wants India to stay in the moment T20 World Cup 2026 India vs USA: Speaking on the eve of India's opening game in Mumbai, captain Suryakumar Yadav spoke about the pressure of expectations, the weight of history and how India are trying to stay in the moment and get the job done. India are bidding to become the first team to defend the title and win the trophy as many as three times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-on-ishan-kishan-opening-in-t20-world-cup-2026-usa-2864258-2026-02-06",
      "headline": "Suryakumar Yadav all but confirms Ishan Kishan as opener for USA clash India captain Suryakumar Yadav has almost confirmed Ishan Kishan as the opener for the T20 World Cup 2026 opening match against the USA. Kishan's explosive recent form has edged out Sanju Samson, signalling a fresh start for India's top order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-pakistan-banned-india-boycott-ex-bcci-president-anurag-thakur-2864246-2026-02-06",
      "headline": "Pakistan should be banned for refusing to play India in T20 World Cup: Anurag Thakur ICC T20 World Cup 2026: Former BCCI president and BJP MP, Anurag Thakur has called for the ICC to take strong action against Pakistan for their boycott of their group-stage game against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-175-u19-world-cup-final-records-broken-ind-vs-eng-2864166-2026-02-06",
      "headline": "Vaibhav 175: No double, but he shatters records in U19 World Cup final Vaibhav Sooryavanshi produced one of the most commanding innings in Under-19 World Cup history, scoring a stunning 175 off 80 balls in the final of the ICC Men's Under-19 World Cup against England at Harare. The 14-year-old left-hander's knock put India in complete control of the title clash and left England struggling to contain the onslaught."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-harry-brook-300-runs-2864165-2026-02-06",
      "headline": "T20 World Cup likely to see its first 300-plus total, hints Harry Brook ICC T20 World Cup 2026: England captain Harry Brook believes that the 2026 edition of the T20 World Cup might see its first 300+ total. Brook says that there are multiple Indian grounds where such high scores might be possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-bangladesh-brothers-urges-support-t20-world-cup-2864145-2026-02-06",
      "headline": "Bangladesh our brothers, hope they support us in T20 World Cup: Pakistan captain Pakistan captain Salman Ali Agha on Thursday referred to Bangladesh as Pakistan's \"brothers\" and expressed hope that Bangladeshi fans would continue to back the Men in Green at the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-hundred-u19-world-cup-final-ind-vs-eng-2864137-2026-02-06",
      "headline": "Vaibhav Sooryavanshi scripts history, hits fastest U19 World Cup final hundred Vaibhav Sooryavanshi scripted history in the U19 World Cup by hitting the fastest hundred in the final of the tournament. Vaibhav Sooryavanshi reached his century in 55 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harshit-rana-out-icc-t20-world-cup-joint-tenderness-india-2864133-2026-02-06",
      "headline": "Injured Harshit Rana ruled out of T20 World Cup, set to undergo surgery: Sources Harshit Rana has been ruled out of the ICC Men's T20 World Cup after sustaining an injury during a warm-up match against South Africa in Navi Mumbai on Wednesday. The Indian pacer is set to undergo surgery and is expected to be sidelined for a considerable period, sources have told India Today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nasser-hussain-icc-commentary-panel-t20-world-cup-2026-pakistan-boycott-bangladesh-exclusion-2864075-2026-02-06",
      "headline": "Despite criticism of ICC, Nasser Hussain named in T20 World Cup commentary panelFormer England captain Nasser Hussain has been named in the ICC's T20 World Cup 2026 commentary panel despite recently criticising the global body over governance, consistency and the treatment of Bangladesh and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/winter-olympics-ski-jumper-penis-size-cheating-2864044-2026-02-06",
      "headline": "Are ski-jumpers enhancing penis-size to fly further in Winter Olympics?A major controversy has brewed in the Winter Olympics. WADA is looking into allegations that ski jumpers are temporarily enhancing their penis sizes to fly further in their events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-world-cup-final-live-score-india-vs-england-harare-updates-2864019-2026-02-06",
      "headline": "IND vs ENG final Highlights: India clinch 6th title with 100-run victoryIndia (IND) vs England (ENG), U19 World Cup final Highlights: India have beaten England by 100 runs in the final and clinched their sixth Under-19 World Cup title. Vaibhav Suryavanshi starred in the summit clash with his sensational innings of 175 (80)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-injury-icc-t20-world-cup-australia-squad-2863987-2026-02-06",
      "headline": "Australia hit by injury crisis, after Cummins, Hazlewood ruled out of T20 WCAustralia are in a major injury crisis right ahead of the T20 World Cup. After the exit of Pat Cummins, fast bowler Josh Hazlewood has been ruled out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-wpl-final-smriti-mandhana-virat-kohli-2863954-2026-02-06",
      "headline": "Mandhana reveals how RCB took the Kohli way en route to title no.2 in WPLRCB captain Smriti Mandhana revealed that the one key thing that helped the side to their second WPL trophy. Mandhana in her post-match address, revealed that RCB had put a lot of work behind the scenes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-final-delhi-capitals-lose-4th-time-rcb-2863926-2026-02-06",
      "headline": "Heartbreak is their canvas: Delhi Capitals paint pain like Picasso in WPL historyWPL 2026: Delhi Capitals lost to Royal Challengers Bengaluru by six wickets in the WPL final on Thursday at the Kotambi Stadium in Vadodara. Jemimah Rodrigues-led DC became the first team in the tournament's history to win the Eliminator but fell short of lifting the WPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-wpl-title-virat-kohli-smriti-mandhana-2863896-2026-02-06",
      "headline": "Virat Kohli writes special message to Smriti Mandhana after RCB's 2nd WPL titleWPL: Royal Challengers Bengaluru became the first ever team in the history to hold the IPL and WPL titles together. After the historic feat, Virat Kohli penned a special message for RCB women's team captain Smriti Mandhana to congratulate the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/u19-cricket-world-cup-2026-india-vs-england-final-harare-live-streaming-2863635-2026-02-06",
      "headline": "U19 World Cup final: India eye record-extending 6th title, favourites vs EnglandU19 World Cup: India and England are set to lock horns in the grand finale on Friday, February 6. In the semi-final on Wednesday, India beat Afghanistan by seven wickets with a record run-chase in the tournament's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-social-media-relationship-rumours-fan-wars-2863770-2026-02-06",
      "headline": "Yuzi Chahal tired of endless social media rumours: I know who I really amYuzvendra Chahal opens up on social media rumours, online trolling and fan wars, saying he ignores the noise and trusts his family and close friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-gone-through-lot-marriage-shreyanka-patil-rcb-2nd-wpl-title-win-2863849-2026-02-05",
      "headline": "Smriti Mandhana has gone through a lot, this win is for her: Shreyanka PatilWPL 2026 final: Shreyanka Patil dedicated RCB's historic second WPL title victory to Smriti Mandhana for leading the side once again after the personal setbacks she faced before the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-final-rcb-win-2nd-wpl-title-highest-run-chase-beat-delhi-capitals-2863835-2026-02-05",
      "headline": "RCB script historic chase to clinch 2nd title as DC stumble again in finalRoyal Challengers Bengaluru (RCB) scripted history by chasing down the highest total in WPL to clinch their second title. Smriti Mandhana led from the front with her innings of 87 (41) as RCB chased down 204 in 19.4 overs to beat Delhi Capitals by six wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sri-lanka-urges-pakistan-reconsider-india-boycott-heavy-losses-2863819-2026-02-05",
      "headline": "Sri Lanka urges Pakistan to reconsider India boycott, flags heavy losses: ReportT20 World Cup 2026: Sri Lanka Cricket has reportedly urged the PCB to reconsider boycotting the India match, warning of heavy financial and tourism losses, with the marquee fixture at risk of being called off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/yuzvendra-chahal-on-indias-t20-world-cup-chances-suryakumar-yadav-2863795-2026-02-05",
      "headline": "India can only lose T20 World Cup on it's own, no team can beat them: Yuzvendra ChahalIndia spinner Yuzvendra Chahal has said that India are firm favourites to win the T20 World Cup 2026 and that only their own mistakes could lead to them losing in the tournament. India will begin their campaign against the USA on February 7 at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-on-how-gautam-gambhir-removed-personal-milestone-obsession-2863783-2026-02-05",
      "headline": "Gautam Gambhir has changed team's milestone-obsessed mindset: Suryakumar YadavIndia captain Suryakumar Yadav praised head coach Gautam Gambhir for prioritising team goals over personal milestones. The India captain sakid that the shift has fuelled India's dominant run in T20 cricket and boosted team unity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-captains-press-conference-suryakumar-yadav-2863761-2026-02-05",
      "headline": "India ready to play Pakistan in T20 World Cup, will travel to Colombo: SuryakumarT20 World Cup 2026: India captain Suryakumar Yadav said the Men in Blue will travel to Colombo for the February 15 match, despite Pakistan threatening a boycott. Suryakumar said the matter is beyond his control, adding that even the International Cricket Council finds it difficult to intervene when decisions are driven by the Pakistan government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chetan-sharma-on-pakistan-t20-world-cup-boycott-reversal-bangladesh-elections-2863746-2026-02-05",
      "headline": "Pak will make a U-turn on India boycott stance after February 12: Chetan SharmaFormer India pacer Chetan Sharma expects Pakistan to reverse their boycott of the India match after the Bangladesh elections. The Pakistan government have denied permission to their cricket team to play against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-pakistan-super-league-lahore-qalandars-77-per-cent-less-ipl-contract-2863750-2026-02-05",
      "headline": "Mustafizur heads to PSL after shock IPL exit, to earn 77 per cent lessMustafizur Rahman has signed with Lahore Qalandars for PSL 11 after his IPL release by KKR, agreeing to a deal worth about Rs 2 crore, nearly 77 per cent lower than his IPL contract."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-backs-virat-kohli-and-rohit-sharma-for-2027-odi-world-cup-2863689-2026-02-05",
      "headline": "Sunil Gavaskar backs Virat Kohli and Rohit Sharma for 2027 ODI World CupSunil Gavaskar did not think twice when he backed both Virat Kohli and Rohit Sharma to play the 2027 ODI World Cup. Speaking at India Today's Salaam Cricket 2026, Gavaskar backed the idea of having India's favourite duo for one last push for the ODI crown. \"Virat and Kohli will definitely play ODI World Cup 2027. They've been performing well. Even if the ODI are six months later, they will continue practising and stay in touch with the game. Their experience is of utmost importance to the team,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gavaskar-dance-promise-suryakumar-yadav-india-defend-t20-world-cup-crown-2863680-2026-02-05",
      "headline": "Dancing with joy: Gavaskar's promise to Suryakumar Yadav if India defend T20 crownSunil Gavaskar has promised India captain Suryakumar Yadav a joyful dance if the team successfully defend their T20 World Cup crown, saying nothing moves him more than seeing India lift a trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-dc-live-score-wpl-2026-final-royal-challengers-bengaluru-delhi-capitals-womens-match-2863668-2026-02-05",
      "headline": "WPL Final Highlights: Royal Challengers Bengaluru win 2nd title in dramatic fashionWPL 2026, Royal Challengers Bengaluru (RCB-W) vs Delhi Capitals (DC-W) Live Score: The Royal Challengers Bengaluru have done it again, leaving Delhi Capitals in the dust to win their second Women's Premier League title."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}