{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/personal-loan-5-hidden-charges-by-banks-you-must-check-2685448-2025-02-25",
      "headline": "Applying for personal loan? 5 hidden charges you must check While banks may not disclose the hidden charges when applying for personal loans, borrowers must understand them when applying for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-dip-check-indusind-dcb-bank-city-union-and-other-top-banks-2685370-2025-02-25",
      "headline": "FD rates dip: Check IndusInd, DCB, City Union and other top banksWith a drop in FD interest rates, depositors might witness a marginal decline in their earnings on fixed deposits.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jubilant-foodworks-issues-clarification-on-fir-against-chairman-2685338-2025-02-25",
      "headline": "Chairman says allegations are false: Jubilant FoodWorks after reports of FIRIn a stock exchange filing, Jubilant FoodWorks said its Chairman Shyam Sundar Bhartia has denied all allegations against him, calling them \"baseless, false and disparaging, and made with clear malafide intent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-markets-stay-range-bound-as-cautious-sentiment-prevails-sensex-gains-nifty-loses-2685279-2025-02-25",
      "headline": "Sensex gains, Nifty loses: Markets stay range-bound as cautious sentiment prevailsThe S&P BSE Sensex gained 147.71 points to close at 74,602.12, while the NSE Nifty50 lost 5.80 points to end at 22,547.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-withdrawal-relief-for-new-india-cooperative-bank-depositors-check-details-here-2685236-2025-02-25",
      "headline": "RBI withdrawal relief for New India Co-op Bank depositors. Check details hereThis announcement comes just over a week after the central bank prohibited the bank from issuing new loans, dissolved its board and took control owing to 'supervisory concerns.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sell-india-buy-china-why-foreign-investors-are-shifting-bets-2685237-2025-02-25",
      "headline": "Sell India, Buy China: Why FIIs are falling out of love with Dalal StreetDalal Street has witnessed correction over the past six months, with the Nifty50 plummeting from 25,200 levels to around 22,500 levels by the end of February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bets-big-on-assam-to-invest-rs-50000-crore-in-next-5-years-summit-pm-modi-2685213-2025-02-25",
      "headline": "Reliance bets big on Assam, to invest Rs 50,000 crore in next 5 yearsManaging Director Mukesh Ambani announced an investment of Rs 50,000 crore in Assam. A major part of Reliance's investment will be directed towards making Assam a leader in technology and artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hungary-announces-tax-exemption-for-mothers-with-2-or-more-children-2685199-2025-02-25",
      "headline": "Hungary announces tax exemption for mothers with 2 or more children The said announcement comes ahead of the 2026 elections and is a part of Orban's efforts to boost the country's birth rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dbs-set-to-cut-4000-jobs-over-3-years-due-to-ai-says-ceo-2685206-2025-02-25",
      "headline": "DBS set to cut 4,000 jobs over 3 years due to AI, says CEODBS CEO Piyush Gupta said the bank will shrink its workforce by 10% in the next three years due to artificial intelligence replacing human roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hein-schumacher-to-step-down-as-unilever-ceo-in-march-2685192-2025-02-25",
      "headline": "Hein Schumacher to step down as Unilever CEO in MarchThe departure comes just weeks after Unilever announced underwhelming full-year earnings and chose Amsterdam over London and New York as the primary listing for its ice cream business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-10-percent-today-ipo-news-group-company-details-2685184-2025-02-25",
      "headline": "Explained: Why Tata Investment share price jumped 10% todayAt around 12:56 pm, shares of the non-banking financial company were up 7.65% to Rs 6,195.85 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-universal-pension-scheme-here-all-you-need-to-know-2685156-2025-02-25",
      "headline": "What is Universal Pension Scheme? Here's all you need to know With India's senior citizen population aged 60 years and above expected to touch 227 million by 2036, a comprehensive social security or pension scheme is necessary."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-udit-narayan-visits-maha-kumbh-mela-with-wife-expresses-gratitude-2685597-2025-02-25",
      "headline": "Singer Udit Narayan visits Maha Kumbh Mela with wife, expresses gratitude Singer Udit Narayan was among the latest celebrities to visit the holy city of Prayagraj for Maha Kumbh 2025. In an interview with ANI, he expressed his gratitude and congratulated Chief Minister Yogi Adityanath for the well-organised and efficient arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-dearest-nemesis-review-moon-ga-young-choi-hyun-wook-2685507-2025-02-25",
      "headline": "My Dearest Nemesis review: Chaotic chemistry makes even familiar trope workMy Dearest Nemesis features K-drama stars Moon Ga young and Choi Hyun-wook in the lead. It is available to stream on Viki. Here's our take on the romantic drama. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-honey-singh-kicks-off-millionaire-tour-with-a-grand-mumbai-show-2684048-2025-02-22",
      "headline": "Watch: Honey Singh kicks off Millionaire tour with a grand Mumbai showRapper Honey Singh launched his Millionaire Tour with a spectacular concert in Mumbai. The show featured dramatic entrances and a lineup of energetic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-x-review-fans-give-thumbs-up-to-seo-kang-joons-k-drama-2683974-2025-02-22",
      "headline": "Undercover High School X review: Fans give thumbs up to Seo Kang-joon's K-dramaUndercover High School, featuring Seo Kang-joon and Jin Ki-joo, has premiered on MBC TV. The series, praised for its engaging storyline, follows an undercover NIS agent as a high school student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. Ricco had once defended Osama bin Laden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/robin-tunney-10-years-the-mentalist-finale-simon-baker-2683326-2025-02-21",
      "headline": "Robin Tunney marks 10 years since The Mentalist finale, thanks fan for their loveActor Robin Tunney celebrated the 10th anniversary of The Mentalist finale, expressing gratitude to fans for their unwavering support. She also reflected on the show's impact on her life and career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/atif-aslam-surprise-street-performance-london-leaves-fans-in-disbelief-2683349-2025-02-21",
      "headline": "Atif Aslam's surprise street performance in London leaves fans in disbelief. WatchSinger Atif Aslam's video of him performing on a London street has emerged online. This surprise clip has left many fans in disbelief. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-millionaire-tour-what-makes-it-special-2683339-2025-02-21",
      "headline": "Honey Singh Millionaire tour: Reasons why it's unlike any otherYo Yo Honey Singh is set to electrify Mumbai with his high-energy performance as part of the Stage Tak Millionaire tour, promising an unforgettable night of music and nostalgia. Here are a few reasons why one should not miss it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nobody-wants-this-season-2-on-netflix-what-is-leighton-meester-playing-in-husband-adam-brody-show-2683330-2025-02-21",
      "headline": "Nobody Wants This 2: What is Leighton Meester playing in husband Adam Brody's show?Netflix renewed 'Nobody Wants This' for season 2 last year, and now actor Leighton Meester, known for playing Blair Waldorf in 'Gossip Girl', has joined the show. Her husband, actor Adam Brody, plays the lead character, Noah, in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/varun-grover-jibe-at-beerbiceps-ranveer-allahabadia-samay-raina-indias-got-latent-controversy-2683270-2025-02-21",
      "headline": "Comic Varun Grover's sharp take on Ranveer Allahbadia, censorship and BeerBicepsComedian-lyricist Varun Grover recently took a jibe at the recent controversy surrounding podcaster Ranveer Allahbadia's appearance on India's Got Latent. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mahashivratri-triveni-sangam-final-snan-prayagraj-devotees-last-day-2685633-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devotees flock for final holy dip as Maha Kumbh marks grand culmination todayThe Maha Kumbh Mela, held every 12 years, which attracted millions of devotees from across the country, is set to conclude on Wednesday, coinciding with Mahashivratri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-and-ukraine-agree-terms-on-critical-minerals-deal-amid-talks-to-end-russia-war-news-agency-reuters-2685631-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US, Ukraine agree on critical minerals deal amid talks to end Russia warThe US and Ukraine have finalised a minerals deal, hoping to improve ties, as Kyiv agreed to joint resource development after the US dropped its $500 billion revenue demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-defends-aaps-liquor-policy-cag-report-delhi-assembly-uproar-bjp-reaction-2685558-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi defends AAP's liquor policy, says critics rely on 'BJP HQ pointers'In an exclusive conversation with India Today TV, Atishi said that the high revenue target set under the now-scrapped excise policy was not met because the Centre hindered its implementation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chief-minister-mk-stalin-declares-tamil-nadu-ready-for-another-language-war-over-hindi-policy-2685311-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stalin says Tamil Nadu ready for 'language war', Annamalai fires backTamil Nadu Chief Minister MK Stalin reiterated his stance on the language debate, asserting that the state is \"ready for another language war\" amid renewed tensions over the Centre's alleged Hindi imposition.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/first-things-fast/video/shashi-tharoor-the-gentleman-congress-cant-tame-2685488-2025-02-25#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Shashi Tharoor: The gentleman Congress can't tame?Is Congress sidelining Shashi Tharoor, or is he making his own moves? From praising Kerala's Left government to questioning Congress' strategy, he's stirring the pot again. I"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cpim-cpm-stance-narendra-modi-government-fascist-attack-criticism-congress-cpi-kerala-2685450-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Modi govt isn't fascist, explains CPM, rattles Congress and CPIIn a draft note ahead of its party congress in April, the CPM has explained that while the Modi government exhibits \"neo-fascist characteristics\", it does not qualify as a \"fascist or a neo-fascist regime\". This stance has triggered sharp criticism from its national allies, the CPI and the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/2-board-exams-for-class-10-for-2025-2026-cbse-seeks-response-from-stakeholders-2685525-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 board exams for Class 10 for 2025-2026? CBSE seeks response from stakeholdersStarting from 2026, Class 10 students under CBSE will have the opportunity to take board exams twice a year. The move aims to ease academic pressure and provide students with a chance to improve their scores.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-mass-murder-man-kills-5-with-hammer-leaves-lpg-leak-to-explode-skull-smashed-2685531-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shattered skull, bodies in pools of blood seen at Kerala mass murder sitesShocking details have emerged from the gruesome multiple homicide in Kerala's capital. Witnesses of the scene told gory tales of how Afan hammered his family members and girlfriend to death. Before surrendering, he left the LPG valve open to trigger an explosion, showing no remorse, said the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-married-longtime-boyfriend-vrishank-khanal-2685544-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Prajakta Koli marries her longtime boyfriend Vrishank KhanalYouTuber-turned-actor Prajakta Koli is now married to her longtime boyfriend and lawyer Vrishank Khanal. On February 25, the Mismatched actor shared dreamy pictures from her wedding ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/lpus-2025-batch-final-year-student-bags-rs-103-crore-118000-placement-package-2682322-2025-02-19#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "LPU's 2025 Batch Final Year Student Bags Rs 1.03 Crore ($1,18,000) Placement Package-Betireddy Naga Vamsi Reddy B. Tech student has secured a 1.03 Crore ($1,18,000) package with an AI robotics company and is set to graduate in May 2025. \r\n\r\n-Over 1,700 students have received packages ranging from Rs 10 LPA – Rs 1 Crore per annum \r\n\r\n-1,912 students received multiple job offers while Adireddy Vasu, secured 7 job offers, setting a rare and impressive record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-age-fraud-case-explained-key-points-2685581-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lakshya Sen's age fraud case explained: Here's what we know about controversyLakshya Sen has found himself at the centre of a controversial case as he, along with his family and coach, have been accused of age fraud. The case, which was filed in 2022, has caught fire in the recent days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-uttar-pradesh-government-maha-kumbh-victims-compensation-2685584-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After 'Mrityu Kumbh' remark, Mamata Banerjee questions Mela's 144-year-cycleTaking on Uttar Pradesh Chief Minister Yogi Adityanath, West Bengal Chief Minister Mamata Banerjee demanded his government to immediately release compensation to the families of those who died in the Maha Kumbh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/shivratri-every-month-maha-shivratri-once-a-year-know-why-2685506-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shivratri every month, Maha Shivratri once a year – know whyShivratri is observed every month on the 14th lunar day, dedicated to Lord Shiva, while Maha Shivratri, celebrated once a year, holds special significance as it marks the divine union of Lord Shiva and Goddess Parvati. Here's a detailed explanation of both these auspicious occasions.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-australia-vs-south-africa-abandoned-group-b-qualification-scenario-2685431-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: AUS vs SA called off, what does this mean for Group B?The match between Australia and South Africa in Rawalpindi was called off and this has left Group B wide open.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/journalist-mahesh-langa-arrested-enforcement-directorate-money-laundering-case-2685551-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED arrests Gujarat-based journalist Mahesh Langa in money laundering caseThe money laundering case against Gujarat-based journalist Mahesh Langa stems from two FIRs filed by the Ahmedabad Police on charges of committing fraud, criminal misappropriation and causing wrongful loss of lakhs of rupees to certain people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cag-audit-report-aap-delhi-liquor-policy-led-to-rs-2000-crore-revenue-loss-assembly-session-atishi-arvind-kejriwal-lg-vk-saxena-2685169-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP's Delhi liquor policy led to Rs 2,002 crore revenue loss: CAG reportThe Comptroller and Auditor General of India report on the now-scrapped Delhi liquor policy scam was tabled in the Assembly today by Chief Minister Rekha Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/indias-first-hyperloop-test-track-delhi-to-jaipur-in-30-mins-2685155-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's first hyperloop test track. Delhi to Jaipur in 30 minutes?Delhi is not far away from Jaipur now. The 422-meter facility at IIT Madras marks a significant milestone in revolutionising transportation between major Indian cities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-statement-after-new-india-cooperative-bank-writes-off-18-crore-loan-2685099-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Preity Zinta, Kerala Congress clash on X over Rs 18-crore loan write-off chargePreity Zinta called reports of New India Cooperative Bank writing off her Rs 18-crore loan false. She blasted Congress for promoting fake news by linking her with Bharatiya Janata Party (BJP)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-politics-space-kerala-state-assembly-election-rahul-gandhi-leadership-2685179-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress has no heart or house for Mr TharoorDespite his intellect, eloquence, and four consecutive wins from Thiruvananthapuram, Congress MP Shashi Tharoor remains an outsider in his own party. The Congress has no heart or house for Tharoor as it finds him too independent for national politics and too unconventional for Kerala's faction-ridden political affairs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/egg-border-smuggling-us-border-bird-flu-price-rise-dozen-american-control-immigration-2685330-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Eggmergency in US driving up smuggling of eggs from MexicoThe surge in egg prices has sparked a rise in egg smuggling into the US. Between October 2024 and February 2025, there was a 29% increase in the seizure of shell eggs at US ports of entry compared to the same period the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-jeff-bezoss-blue-origin-launches-tourists-to-space-on-record-10th-flight-2685542-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Jeff Bezos's Blue Origin launches tourists to space on record 10th flightThe New Shepard spacecraft lifted off from Blue Origin's West Texas launch site, carrying six crew members for a brief joyride to suborbital space."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ex-congress-mp-sajjan-kumar-sentenced-to-life-imprisonment-in-1984-anti-sikh-riots-case-2685210-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sajjan Kumar, ex-Congress MP, sentenced to life in jail in anti-Sikh riots caseFormer Congress MP Sajjan Kumar has been sentenced to life imprisonment for his involvement in the killing of two Sikhs in the 1984 riots. This is his second life sentence, as he is already serving time for his role in the Delhi Cantonment riots case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/if-mahakumbh-airfares-shocked-you-know-that-spikes-will-be-the-norm-2685294-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If Mahakumbh airfares shocked you, know that spikes will be the normCivil aviation minister Rammohan N. Kinjarapu and IndiGo CEO Pieter Elbers signal why there's no quick respite from event-linked fare spirals and what the only solution is"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-ahuja-divorce-report-37-years-of-marriage-2685265-2025-02-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Govinda-Sunita Ahuja heading for divorce after 37 years: ReportBollywood actor Govinda and his wife Sunita Ahuja may be heading for a divorce after 37 years of marriage, as per reports. While Govinda avoided the question, Sunita did not respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-udit-narayan-visits-maha-kumbh-mela-with-wife-expresses-gratitude-2685597-2025-02-25",
      "headline": "Singer Udit Narayan visits Maha Kumbh Mela with wife, expresses gratitude Singer Udit Narayan was among the latest celebrities to visit the holy city of Prayagraj for Maha Kumbh 2025. In an interview with ANI, he expressed his gratitude and congratulated Chief Minister Yogi Adityanath for the well-organised and efficient arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sandeep-reddy-vanga-on-people-praising-ranbir-kapoor-in-animal-easy-to-comment-about-me-2685567-2025-02-25",
      "headline": "Sandeep Vanga says nobody criticised Ranbir for Animal: They want to work with himDirector Sandeep Reddy Vanga addressed the feedback surrounding Ranbir Kapoor's performance in Animal. He expressed his confusion over the disparity, noting that while he faced criticism for the film, Ranbir did not.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-married-longtime-boyfriend-vrishank-khanal-2685544-2025-02-25",
      "headline": "Actor Prajakta Koli marries her longtime boyfriend Vrishank KhanalYouTuber-turned-actor Prajakta Koli is now married to her longtime boyfriend and lawyer Vrishank Khanal. On February 25, the Mismatched actor shared dreamy pictures from her wedding ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-trisha-krishnan-good-bad-ugly-teaser-release-date-2685539-2025-02-25",
      "headline": "Good Bad Ugly: Ajith Kumar film's teaser to release on February 28The teaser of the much-anticipated Tamil action-comedy film Good Bad Ugly, starring Ajith Kumar and Trisha Krishnan, is set to be unveiled on February 28. Fans are eagerly awaiting the first glimpse of this exciting project."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-cricket-board-beefs-up-ground-security-after-pitch-invasion-in-rawalpindi-2685598-2025-02-26",
      "headline": "Pakistan Cricket Board beefs up ground security after pitch invasion in RawalpindiThe Pakistan Cricket Board (PCB) has reinforced the security at all the venues of the ICC Champions Trophy 2025 after a pitch invasion by a fan during the New Zealand vs Bangladesh match in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jos-buttler-reacts-to-indias-advantage-of-playing-in-dubai-2685576-2025-02-25",
      "headline": "JButtler takes a dig at India for only playing in Dubai: It's a unique tournamentEngland captain Jos Buttler commented on India's advantage of playing at just one venue in the ICC Champions Trophy 2025. The Men in Blue are playing all of their matches in Dubai after denying to travel to Pakistan for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-age-fraud-case-explained-key-points-2685581-2025-02-25",
      "headline": "Lakshya Sen's age fraud case explained: Here's what we know about controversyLakshya Sen has found himself at the centre of a controversial case as he, along with his family and coach, have been accused of age fraud. The case, which was filed in 2022, has caught fire in the recent days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-delhi-capitals-rcb-dc-2685575-2025-02-25",
      "headline": "DC dethrone RCB as table-toppers with dominating win vs Gujarat Giants WPL 2025: Delhi Capitals beat the Ash Gardner-led Gujarat Giants by six wickets and moved to the top of the table. Jess Jonassen picked up one wicket and scored a 32-ball 61 at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-cricket-jos-buttler-press-conference-afghanistan-vs-england-afg-vs-eng-2685566-2025-02-25",
      "headline": "Jos Buttler backs England to come good against Afghanistan's tough spin testEngland captain Jos Buttler is confident of his team to come good against the tough spin challenge against Afghanistan, who beat them during the last meeting between the two teams in the ODI World Cup 2023. Both teams will be eager for a win in the upcoming game as the loser of the match will get knocked out of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jos-buttler-captaincy-lahore-2685559-2025-02-25",
      "headline": "ENG vs AFG: England captain Jos Buttler admits his job is on the lineEngland captain Jos Buttler has admitted that his job is on the line ahead of their clash against Afghanistan on Wednesday, February 25. England are going through a poor run of form having lost their first match of the Champions Trophy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-only-scores-vs-zimbabwe-and-smaller-teams-danish-kaneria-2685547-2025-02-25",
      "headline": "Babar Azam only scores vs Zimbabwe and other smaller teams: Danish KaneriaFormer Pakistan spinner Danish Kaneria slammed Babar Azam amid his ongoing poor form in the Champions Trophy 2025. Babar has come under fire for his poor strike rate after the first game against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-lahore-weather-forecast-group-b-2685532-2025-02-25",
      "headline": "ENG vs AFG Lahore weather forecast: Will rain play spoilsport in Group B clash?England and Afghanistan are all set to lock horns in a high-stakes Group B clash in Lahore on February 26. Will rain play spoilsport in the contest as both teams aim to keep their semi-final hopes alive? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ahmed-shehzad-interview-exclusive-pakistan-debacle-2685521-2025-02-25",
      "headline": "Ahmed Shahzad slams 'indiscipline' in team after Champions Trophy debacleChampions Trophy 2025: In an exclusive interview with India Today, Ahmed Shehzad spoke about the reasons behind Pakistan's poor performance recently after they failed to advance to the semi-final of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-age-fraud-case-supreme-court-stays-karnataka-high-court-order-2685518-2025-02-25",
      "headline": "Relief for Lakshya Sen as Supreme Court halts further probe in age fraud caseLakshya Sen was granted relief by the Supreme Court of India by staying the Karnataka High Court order that had permitted further investigation into an age fraud complaint against the badminton star and his brother, Chirag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afghanistan-vs-england-afg-vs-eng-lahore-pitch-report-playing-xi-2685501-2025-02-25",
      "headline": "Afghanistan vs England, all you need to know: Lahore pitch report, playing XIAfghanistan and England are all set to lock horns in Match 8 of the ICC Champions Trophy 2025. Both teams are coming into the fixture having lost their respective first matches and will take each other in a must-win encounter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-only-scores-vs-zimbabwe-and-smaller-teams-danish-kaneria-2685547-2025-02-25",
      "headline": "Babar Azam only scores vs Zimbabwe and other smaller teams: Danish KaneriaFormer Pakistan spinner Danish Kaneria slammed Babar Azam amid his ongoing poor form in the Champions Trophy 2025. Babar has come under fire for his poor strike rate after the first game against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-lahore-weather-forecast-group-b-2685532-2025-02-25",
      "headline": "ENG vs AFG Lahore weather forecast: Will rain play spoilsport in Group B clash?England and Afghanistan are all set to lock horns in a high-stakes Group B clash in Lahore on February 26. Will rain play spoilsport in the contest as both teams aim to keep their semi-final hopes alive? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-ahmed-shehzad-interview-exclusive-pakistan-debacle-2685521-2025-02-25",
      "headline": "Ahmed Shahzad slams 'indiscipline' in team after Champions Trophy debacleChampions Trophy 2025: In an exclusive interview with India Today, Ahmed Shehzad spoke about the reasons behind Pakistan's poor performance recently after they failed to advance to the semi-final of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-age-fraud-case-supreme-court-stays-karnataka-high-court-order-2685518-2025-02-25",
      "headline": "Relief for Lakshya Sen as Supreme Court halts further probe in age fraud caseLakshya Sen was granted relief by the Supreme Court of India by staying the Karnataka High Court order that had permitted further investigation into an age fraud complaint against the badminton star and his brother, Chirag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-afghanistan-vs-england-afg-vs-eng-lahore-pitch-report-playing-xi-2685501-2025-02-25",
      "headline": "Afghanistan vs England, all you need to know: Lahore pitch report, playing XIAfghanistan and England are all set to lock horns in Match 8 of the ICC Champions Trophy 2025. Both teams are coming into the fixture having lost their respective first matches and will take each other in a must-win encounter."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}