{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-is-trumps-big-deal-claim-a-pressure-tactic-experts-weigh-in-2747356-2025-06-27",
      "headline": "India-US trade deal: Is Trump's 'big deal' claim a pressure tactic? Experts weigh inUS President Donald Trump on Thursday announced a trade deal with China on rare earths and hinted at a 'very big' trade agreement with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-rallies-nasdaq-sp-500-record-highs-ai-stocks-fed-policy-recession-fears-ease-2747331-2025-06-27",
      "headline": "Wall Street rallies to record highs as AI stocks soar, recession fears easeUS stock markets hit all-time highs on Friday thanks to an AI boom and Fed hints at looser policy ahead. Trade deals with the UK and China have also fuelled market hopes that a global recession could be avoided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khans-girlfriend-gauri-spratt-says-theres-room-for-improvement-in-his-acting-2748039-2025-06-29",
      "headline": "Aamir Khan's girlfriend Gauri Spratt says there's room for improvement in his actingAamir Khan's girlfriend Gauri Spratt made a rare appearance during his interview, where she playfully said there's always room for improvement in his acting. Her comment and their candid exchange quickly went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-struggle-after-divorce-with-reena-dutta-tried-to-kill-myself-with-alcohol-2747996-2025-06-29",
      "headline": "Aamir Khan on struggle after divorce with Reena: Tried to kill myself with alcoholAamir Khan opened up about his painful separation from Reena Dutta, sharing he turned to alcohol and depression during that time. Despite the success of 'Lagaan', the actor said he felt lost and broken, calling it one of the darkest phases of his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-gets-overwhelming-love-in-pakistan-2747971-2025-06-29",
      "headline": "Amid backlash in India, Sardaar Ji 3 gets overwhelming love in Pak; Diljit reactsDiljit Dosanjh's 'Sardaar Ji 3' skipped its India release amid controversy but opened to packed theatres in Pakistan. Despite the backlash, the film has been receiving an overwhelming response in Pakistan, earning an estimated $500,000 on its first day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-trailer-india-september-release-2747970-2025-06-29",
      "headline": "Tanjiro's final war begins: Infinity Castle trailer brings fire and revengeThe trailer for 'Demon Slayer: Kimetsu no Yaiba – Infinity Castle' has finally dropped—and it's all heat, heartbreak, and hands. Tanjiro vs Akaza is on the cards, and with revenge in his eyes, Tanjiro looks ready to finish what Rengoku started."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-body-shaming-response-workout-video-2747954-2025-06-29",
      "headline": "Samantha hits back at trolls calling her skinny, sickly with fierce workout videoSamantha Ruth Prabhu made it clear via Instagram Stories that she had no patience for comments about her body or health. She challenged body-shamers with a fierce workout video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-gushes-over-f1-star-brad-pitt-2747953-2025-06-29",
      "headline": "Brad Pitt. That's It: Deepika Padukone gushes over F1 star Bollywood actor Deepika Padukone shared her excitement after watching Brad Pitt's sports drama 'F1'. Her cheeky Instagram post quickly caught attention and felt like a fun tribute to the Hollywood actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-enjoys-a-day-out-at-park-with-sons-ibrahim-ali-khan-taimur-and-jeh-2747935-2025-06-29",
      "headline": "Saif Ali Khan enjoys a day out at the park with sons Ibrahim, Taimur, and JehIbrahim Ali Khan shared heartwarming photos from a fun day out at the park with his father Saif Ali Khan and younger brothers Taimur and Jeh. The pataudi brothers were seen enjoying nature and playing cricket in the park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-sudden-death-arti-singh-tribute-social-media-made-plans-2747933-2025-06-29",
      "headline": "We made plans just a week back: Arti Singh mourns Shefali Jariwala's sudden deathActor Arti Singh expressed deep sorrow over the sudden death of her friend and Bigg Boss 13 co-contestant Shefali Jariwala. The actor also extended condolences to Shefali's family,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-jyotika-enjoy-beach-vacation-in-seychelles-video-2747908-2025-06-29",
      "headline": "Suriya-Jyotika enjoy vacation in Seychelles, fans call them made for each otherSuriya and Jyotika are enjoying a vacation in Seychelles, with Jyotika posting a video of their fun moments by the beach. Fans admired their chemistry and said the holiday scenes brought back nostalgic vibes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vinay-sapru-remembers-shefali-jariwala-sudden-death-kaanta-laga-iconic-video-2747899-2025-06-29",
      "headline": "Shefali Jariwala was planning her next 20 years: Kaanta Laga directorVinay Sapru opens up about the sudden death of Shefali Jariwala, the face of 'Kaanta Laga'. He reflects on her dedication, warmth, and the lasting impact she made on Indian pop culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-heads-of-state-screening-brunch-sharmeen-obaid-chinoy-mira-nair-2747878-2025-06-29",
      "headline": "Priyanka Chopra enjoys borderless brunching with Sharmeen Obaid-Chinoy, Mira NairPriyanka Chopra received heartfelt support from her family in India, who hosted a special screening of her upcoming film 'Heads Of State'. The actor also spent her weekend with filmmakers Sharmeen Obaid Chinoy and Mira Nair, calling it a fun day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/raja-chaudhary-claims-abhinav-kohli-came-crying-after-separation-from-shweta-tiwari-2747868-2025-06-29",
      "headline": "Raja Chaudhary claims Abhinav Kohli came crying after separation from Shweta TiwariActor Raja Chaudhary has claimed that Shweta Tiwari's second husband, Abhinav Kohli, came to him in tears after their marriage ended. He also alleged that Shweta initially introduced Abhinav as a 'brother' before marrying him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-box-office-collection-theatre-exclusive-2747856-2025-06-29",
      "headline": "Sitaare Zameen Par box office Day 9: Aamir's film outshines new releasesAamir Khan's sports drama 'Sitaare Zameen Par' collected Rs 108.30 crore in nine days. The film earned more than the new releases - 'Maa', 'Kannappa' and 'F1'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajol-maa-box-office-collection-rises-on-second-day-2747845-2025-06-29",
      "headline": "Maa box office Day 2: Kajol film crosses Rs 10 crore after solid Saturday growthKajol's mythological horror film 'Maa' sees a significant box office jump on day two. The film's unique blend of mythology and horror is winning audience appreciation despite mixed reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-box-office-day-2-vishnu-manchus-film-crosses-rs-15-crore-with-minor-dip-2747832-2025-06-29",
      "headline": "Kannappa box office Day 2: Vishnu Manchu's film crosses Rs 15 croreVishnu Manchu's film 'Kannappa' has crossed Rs 15 crore at the box office on its second day despite a minor dip, maintaining steady footfall across regions. The mythological action-drama is performing well, especially in Telugu-speaking areas, outshining other big releases of the week."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-sudden-death-paras-chhabra-lashes-out-at-media-over-insensitive-reports-2747805-2025-06-29",
      "headline": "Paras Chhabra slams paparazzi for insensitive coverage after Shefali Jariwala's deathParas Chhabra strongly criticised the paparazzi for insensitive reporting, especially regarding a news piece about Parag Tyagi taking Shefali Jariwala's pet dog for a walk soon after her death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/raja-chaudhary-on-palak-tiwari-ibrahim-ali-khan-dating-rumours-strained-ties-with-daughter-career-focus-advice-2747802-2025-06-29",
      "headline": "Raja Chaudhary reacts to Palak Tiwari's dating rumoursActor Raja Chaudhary addressed his distant relationship with daughter Palak Tiwari and expressed concern over her alleged romance with Ibrahim Ali Khan. He advised Palak to prioritise her career over relationships at this stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/video/shefali-jariwala-husband-parag-tyagi-emotional-appeal-2747743-2025-06-28",
      "headline": "Pray for my Pari: Shefali Jariwala's husband Parag Tyagi's emotional appealFollowing the final rites, Shefali Jariwala's husband, Parag Tyagi, appeared visibly distraught. Addressing the paparazzi with folded hands, he urged everyone to pray for his \"Pari.\" Holding back emotion, he said, \"Please pray for her - that wherever she is, she's happy and at peace.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-backs-diljit-dosanjh-amid-sardaar-ji-3-row-2747729-2025-06-28",
      "headline": "Javed Akhtar backs Diljit Dosanjh amid Sardaar Ji 3 row: What can the poor guy doJaved Akhtar defended Diljit Dosanjh amid backlash over 'Sardaar Ji 3', which features Pakistani actor Hania Aamir. He noted the film was shot before recent tensions and urged sensitivity, while advising against such casting in the future."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-puts-three-language-policy-on-hold-amid-backlash-forms-panel-to-decide-implementation-framework-2748032-2025-06-29",
      "headline": "Maharashtra withdraws 3-language policy order amid Hindi 'imposition' backlashMaharashtra Chief Minister Devendra Fadnavis announced the cancellation of the controversial government resolutions concerning the three-language policy in primary schools."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-rape-case-what-we-know-so-far-trinamool-infighting-feud-kalyan-banerjee-vs-mohua-moitra-2747969-2025-06-29",
      "headline": "Kolkata rape case: Women's panel says attempts being made to hide somethingThe Kolkata law college gang-rape case has brought back memories of the infamous RG Kar incident from nearly a year ago, when a second-year post-graduate medical student was raped and murdered inside the RG Kar Medical College and Hospital on the intervening nights of August 8 and 9, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/puri-temple-stampede-odisha-dead-injured-gundicha-temple-rath-yatra-2747829-2025-06-29",
      "headline": "Puri Rath Yatra stampede: 2 officials transferred after 3 killed, 50 injuredPuri stampede: The incident took place near Saradhabali, in front of the temple, where Lord Jagannath was seated on the chariot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tokyo-delhi-air-india-flight-diverted-to-kolkata-due-to-persistent-cabin-heat-issue-2748040-2025-06-29",
      "headline": "Tokyo-Delhi Air India flight diverted to Kolkata due to persistent cabin heat issueA Delhi-bound Air India flight coming from Tokyo was diverted to Kolkata due to persistent cabin heat issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-gets-overwhelming-love-in-pakistan-2747971-2025-06-29",
      "headline": "Amid backlash in India, Sardaar Ji 3 gets overwhelming love in Pak; Diljit reactsDiljit Dosanjh's 'Sardaar Ji 3' skipped its India release amid controversy but opened to packed theatres in Pakistan. Despite the backlash, the film has been receiving an overwhelming response in Pakistan, earning an estimated $500,000 on its first day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-monojit-mishra-history-harassment-targeted-women-campus-violence-tmcp-2747992-2025-06-29",
      "headline": "Kolkata rape accused has history of harassing women, campus violence: Ex-friendTitas Manna, a former friend of Kolkata gangrape accused Monojit Mishra, alleged that the TMCP leader had been involved in multiple incidents targeting women during their time at the college, but that survivors were afraid to lodge formal complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/heavy-rain-brings-respite-from-heat-in-delhi-ncr-as-monsoon-arrives-early-2747997-2025-06-29",
      "headline": "Heavy rain brings respite from heat in Delhi-NCR as monsoon arrives earlyThe southwest monsoon has now covered the entire country, reaching Delhi on Sunday — a day ahead of its normal onset date of June 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kalyan-banerjee-fumes-over-mahua-moitra-misogyny-charge-kolkata-law-college-rape-calls-her-a-homebreaker-2747870-2025-06-29",
      "headline": "She broke a family: Kalyan Banerjee says Mahua Moitra is 'most anti-woman'Kalyan Banerjee's attack comes in response to Mahua Moitra taking an indirect dig at his 'avoid bad company' remark following the gang rape of a first-year law student in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-on-struggle-after-divorce-with-reena-dutta-tried-to-kill-myself-with-alcohol-2747996-2025-06-29",
      "headline": "Aamir Khan on struggle after divorce with Reena: Tried to kill myself with alcoholAamir Khan opened up about his painful separation from Reena Dutta, sharing he turned to alcohol and depression during that time. Despite the success of 'Lagaan', the actor said he felt lost and broken, calling it one of the darkest phases of his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-woman-found-dead-in-garbage-truck-legs-tied-to-neck-body-stuffed-in-bag-2748028-2025-06-29",
      "headline": "Legs tied to neck, body stuffed in bag: Bengaluru woman found dead in garbage truckThe dead body of a woman was found in the back of a garbage truck near a skating rink in Bengaluru on Saturday night. Preliminary investigation suggests that the woman may have been sexually assaulted before being murdered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/will-mumbai-dance-bar-girls-get-to-emerge-from-shadows-if-dance-bars-get-legalised-again-what-may-change-for-bar-girls-2747345-2025-06-29",
      "headline": "Will Mumbai's dance bar girls get to emerge from the shadows?In Mumbai, dance bars, which have been banned since 2005, now operate as orchestra bars. Nothing much has changed, other than the bar girls, mostly young women, being deprived of their income. Experts, associations and bar girls say legalising the dance bars will transform their lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-feature-title-2747934-2025-06-29",
      "headline": "Wimbledon looms for Djokovic: Final shot at glory or end of an era?Wimbledon 2025: Former World No.1 Novak Djokovic has had his fair share of struggles this year, but the Serb has plenty to look forward to when he begins his campaign in the grass-court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gangrape-accused-monojit-mishra-demanded-death-rg-kar-rapist-facebook-post-2748024-2025-06-29",
      "headline": "Kolkata gangrape accused had demanded death penalty for RG Kar rapist in postMonojit Mishra took to Facebook in August last year following the rape and murder of a doctor at RG Kar Medical College in Kolkata, sharing a video of protests that broke out in the aftermath of the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-woman-24-vanishes-in-us-new-jersey-days-after-arriving-for-arranged-marriage-2747939-2025-06-29",
      "headline": "Indian woman, 24, vanishes in US days after arriving for arranged marriageAfter launching a probe and reviewing nearby CCTV footage, local police found that the woman, identified as Simran, was seen checking her phone and looking around - apparently waiting for someone before she went missing on Wednesday. The authorities further noted that Simran didn't appear to be in any distress from what they could make out from the footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/army-chief-asim-munir-threatens-india-again-calls-pak-net-regional-stabiliser-2747830-2025-06-29",
      "headline": "Asim Munir at it again; threatens India, calls Pak net regional stabiliserBlaming India for escalating regional tensions, Munir vowed a decisive response to any future Indian aggression. Speaking at the Pakistan Naval Academy in Karachi on Saturday, Munir called Pakistan a 'net regional stabiliser,' claiming that Islamabad had responded 'resolutely' to 'unprovoked' Indian military aggression."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/stampedes-plane-crash-war-natural-disasters-indias-turbulent-2025-so-far-2747982-2025-06-29",
      "headline": "Stampedes, plane crash, war, natural disasters: India's turbulent 2025 so farFirst Kumbh stampede, then Delhi station stampede, then India-Pak conflict, Air India crash and now the Puri stampede - the first half of 2025 has been one of India's most turbulent in recent memory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-500-27-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iits-iims-amongst-89-institutions-pulled-up-by-ugc-over-ragging-norms-2747964-2025-06-29",
      "headline": "IIT Bombay, IIM Rohtak named in UGC's anti-ragging defaulter listThe University Grants Commission (UGC) has flagged 89 higher education institutions, including premier IITs and IIMs, for failing to comply with anti-ragging norms. Show-cause notices have been issued over non-submission of mandatory undertakings meant to ensure campus safety.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-accident-recovery-dinshaw-pardiwala-2747977-2025-06-29",
      "headline": "Will I ever play again? Pant's surgeon recalls rehab process after accidentRishabh Pant's surgeon recalled the Indian wicketkeeper's journey after his car accident in December 2022. Pant was out of the game for close to 16 months after the accident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-bjp-president-rss-jp-nadda-modi-party-chief-amit-shah-2747896-2025-06-29",
      "headline": "BJP-RSS deadlock over new party chief drags on, state leadership in limboThe BJP and RSS remain deadlocked over choosing a new national president, with the decision now likely hinging on key discussions at the upcoming RSS meet in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/hair-transplants-why-practice-matters-more-than-just-theory-2747902-2025-06-29",
      "headline": "Hair transplants: Why practice matters more than just theoryAs hair transplants become more popular and accessible, the need for hands-on training grows stronger. Experts say that real-world experience—not just theory—is key to ensuring safe, natural-looking results in this delicate and demanding procedure.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/emergency-enslave-judiciary-pm-narendra-modi-in-mann-ki-baat-congress-indira-gandhi-bjp-2747947-2025-06-29",
      "headline": "PM recalls Emergency, plays audios of Morarji Desai, Vajpayee during Mann Ki BaatPM Modi said those who imposed the Emergency not only murdered the Constitution but also made judiciary their puppet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-pretends-to-keep-job-after-layoff-lands-better-role-through-fake-linkedin-post-2747888-2025-06-29",
      "headline": "Man pretends to keep job after layoff, lands better role through 'fake' LinkedIn postIn a now-viral post on Reddit, a man shared how faking continued employment led him to a better job. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-womens-t20is-smriti-mandhana-maiden-hundred-captaincy-2748041-2025-06-29",
      "headline": "Smriti Mandhana eyes more T20I success after maiden hundred: Still work in progressSmriti Mandhana said that her batting in T20Is is still a work in progress after scoring her maiden hundred in the format on June 28. Mandhana became the second Indian batter to score a T20I hundred. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-women-slow-over-rate-penalty-2748038-2025-06-29",
      "headline": "ENG-W vs IND-W: England handed fine for slow over-rate in Trent Bridge T20IENG-W vs IND-W: England's rough start to the T20I series against India worsened after they were fined 10% of their match fees for a slow over-rate in their 97-run loss at Trent Bridge on June 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-criticism-mohammed-azharuddin-2748031-2025-06-29",
      "headline": "Give Shubman Gill a fair chance: Mohammed Azharuddin slams India captain criticsMohammed Azharuddin has jumped to the defence of Shubman Gill ,saying that the Indian Test team captain should be given a fair chance. Gill's captaincy has been criticised after India's loss in the Headingley Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-novak-djokovic-feature-title-2747934-2025-06-29",
      "headline": "Wimbledon looms for Djokovic: Final shot at glory or end of an era?Wimbledon 2025: Former World No.1 Novak Djokovic has had his fair share of struggles this year, but the Serb has plenty to look forward to when he begins his campaign in the grass-court major. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-chelsea-vs-benfica-weather-stoppage-enzo-maresca-2748012-2025-06-29",
      "headline": "US not right place for Club World Cup: Chelsea boss Enzo Maresca on match stoppageEnzo Maresca was left fuming at the fact that Chelsea's game against Benfica in the Club World Cup was halted for almost two hours due to weather conditions in Charlotte. Maresca claimed that the US may not be the right place to host the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-harpreet-brar-nets-session-shubman-gill-text-birmingham-test-2747998-2025-06-29",
      "headline": "Shubman Gill texted me: How Harpreet Brar joined India nets in BirminghamHarpreet Brar joined India's nets in Birmingham after a personal invite from skipper Shubman Gill, sparking fresh buzz around spin tactics and bowling combinations ahead of the second Test against England at Edgbaston."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-steve-smith-likely-to-play-2nd-test-reveals-andrew-mcdonald-2747993-2025-06-29",
      "headline": "WI vs AUS: Steve Smith likely to play 2nd Test, reveals head coach Andrew McDonaldAustralia batter Steve Smith is likely to play in the second Test against the West Indies, revealed head coach Andrew McDonald. Smith missed the first Test after sustaining a finger injurey during the World Test Championship (WTC) final 2025 vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-accident-recovery-dinshaw-pardiwala-2747977-2025-06-29",
      "headline": "Will I ever play again? Pant's surgeon recalls rehab process after accidentRishabh Pant's surgeon recalled the Indian wicketkeeper's journey after his car accident in December 2022. Pant was out of the game for close to 16 months after the accident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wouldve-gone-for-wickets-in-leeds-gill-isnt-like-that-sanjay-manjrekar-2747973-2025-06-29",
      "headline": "Kohli would've gone for wickets in Leeds, Gill isn't like that: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has compared Shubman Gill's captaincy style with Virat Kohli following India's loss in the first Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-rahul-dravid-step-down-after-2023-odi-world-cup-final-australia-ahmedabad-2747906-2025-06-29",
      "headline": "Rohit on Dravid: Wanted to step down after 2023 ODI World Cup heartbreakRohit Sharma revealed that Rahul Dravid did not want to continue as coach following the heartbreak against Australia in the ODI World Cup, but the Indian skipper pushed him on to continue as they went on to win the T20 World Cup in Barbados. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-jasprit-bumrah-leeds-test-2747965-2025-06-29",
      "headline": "Jasprit Bumrah threat? Smith reveals why he attacked Jadeja in Leeds TestENG vs IND: Jamie Smith played a couple of crucial knocks under pressure as England sealed the Leeds Test to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wi-vs-aus-steve-smith-likely-to-play-2nd-test-reveals-andrew-mcdonald-2747993-2025-06-29",
      "headline": "WI vs AUS: Steve Smith likely to play 2nd Test, reveals head coach Andrew McDonaldAustralia batter Steve Smith is likely to play in the second Test against the West Indies, revealed head coach Andrew McDonald. Smith missed the first Test after sustaining a finger injurey during the World Test Championship (WTC) final 2025 vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-accident-recovery-dinshaw-pardiwala-2747977-2025-06-29",
      "headline": "Will I ever play again? Pant's surgeon recalls rehab process after accidentRishabh Pant's surgeon recalled the Indian wicketkeeper's journey after his car accident in December 2022. Pant was out of the game for close to 16 months after the accident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wouldve-gone-for-wickets-in-leeds-gill-isnt-like-that-sanjay-manjrekar-2747973-2025-06-29",
      "headline": "Kohli would've gone for wickets in Leeds, Gill isn't like that: Sanjay ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has compared Shubman Gill's captaincy style with Virat Kohli following India's loss in the first Test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-rahul-dravid-step-down-after-2023-odi-world-cup-final-australia-ahmedabad-2747906-2025-06-29",
      "headline": "Rohit on Dravid: Wanted to step down after 2023 ODI World Cup heartbreakRohit Sharma revealed that Rahul Dravid did not want to continue as coach following the heartbreak against Australia in the ODI World Cup, but the Indian skipper pushed him on to continue as they went on to win the T20 World Cup in Barbados. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jamie-smith-jasprit-bumrah-leeds-test-2747965-2025-06-29",
      "headline": "Jasprit Bumrah threat? Smith reveals why he attacked Jadeja in Leeds TestENG vs IND: Jamie Smith played a couple of crucial knocks under pressure as England sealed the Leeds Test to take a 1-0 lead in the five-match series. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}