{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharama-asks-banks-to-stay-on-alert-amid-rising-indo-pak-tensions-2722375-2025-05-09",
      "headline": "Nirmala Sitharama asks banks to stay on alert amid rising Indo-Pak tensionsThe directive comes a day after India successfully intercepted multiple missile and drone attacks launched from Pakistan late on May 8. While India reported no major damage, the government has since asked all critical institutions to bolster their cybersecurity infrastructure in anticipation of potential retaliatory attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/go-homestays-cuts-ties-with-turkish-airlines-over-anti-india-stand-2722299-2025-05-09",
      "headline": "'Unsupportive stance towards India': Go Homestays ends ties with Turkish AirlinesGo Homestays ends ties with Turkish Airlines after Turkey backs Pakistan following 'Operation Sindoor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/india-pak-tensions-oil-psus-assure-ample-fuel-stocks-urge-against-panic-buying-2722194-2025-05-09",
      "headline": "India-Pak tensions: Oil PSUs assure ample fuel stocks, urge against panic buyingIndian oil companies have issued statements assuring ample fuel stocks across the country. The Indian Oil Corporation and Bharat Petroleum Corporation Limited have emphasised that there is no shortage of petrol, diesel, CNG, or LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bharti-airtel-in-talks-to-acquire-49-percent-stake-in-haier-india-report-2722238-2025-05-09",
      "headline": "Bharti Airtel in talks to acquire 49% stake in Haier India: ReportSunil Mittal, the billionaire-founder of Indian telecom operator Bharti Airtel, has partnered with private equity firm, Warburg Pincus to buy a substantial stake in Haier India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/telecom-regulator-trai-recommends-5-year-satellite-spectrum-allotment-report-2722224-2025-05-09",
      "headline": "Telecom regulator recommends 5-year satellite spectrum allotment: ReportThe move comes amid growing interest in satellite internet services from global players like Elon Musk's Starlink and domestic telecom giants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-880-points-lower-nifty-above-24000-titan-ends-4-percent-up-2722207-2025-05-09",
      "headline": "Sensex closes 880 points lower, Nifty above 24,000; Titan ends 4% upThe S&P BSE Sensex lost 880.34 points to end at 79,454.47, while the NSE Nifty50 was down by 265.80 points to close at 24,008.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-faces-no-shortage-of-essentials-items-government-amid-rising-tensions-pakistan-war-2722173-2025-05-09",
      "headline": "Essential goods supply to remain unaffected across India amid geopolitical heatPrices of key food items, including pulses and vegetables, are being watched closely to make sure they stay under control. Efforts are also being made to keep the supply of these items steady across all cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-an-fd-in-2025-check-these-6-banks-offering-attractive-interest-rates-2722156-2025-05-09",
      "headline": "Planning an FD in 2025? Check these 6 banks offering attractive interest ratesFor fixed deposits between 15 and 21 months, HDFC Bank is offering 7.05% to general citizens, while senior citizens get 7.55%"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-pakistan-tensions-finance-minister-nirmala-sitharaman-review-cyber-readiness-banks-financial-institutions-2722163-2025-05-09",
      "headline": "Finance Minister to review cyber readiness of banks, financial institutionsThe meeting will bring together representatives from several key institutions like the Reserve Bank of India (RBI), the National Payments Corporation of India (NPCI), the Bombay Stock Exchange (BSE), the National Stock Exchange (NSE), etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-jumped-over-7-percent-today-key-reasons-explained-2722110-2025-05-09",
      "headline": "Explained: Why Yes Bank share price jumped over 7% todayThe Yes Bank stock has now gained nearly 11% over the past five sessions, sparking investor curiosity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-100000-dollars-again-as-us-uk-trade-deal-lifts-market-mood-2722020-2025-05-09",
      "headline": "Bitcoin crosses $100,000 again, as US-UK trade deal lifts market moodThe announcement of a fresh trade deal between US President Donald Trump and UK Prime Minister Keir Starmer helped lift market mood across sectors and gave crypto investors an added reason to feel positive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-securities-raises-paytm-target-to-rs-975-on-profitability-turnaround-and-surge-in-merchant-lending-2722100-2025-05-09",
      "headline": "YES Securities raises Paytm target to Rs 975 on profitability turnaround and surge in merchant lendingContribution margin rises to 56.1%, EBITDA turns positive before ESOP costs, and merchant loan volumes gain traction under DLG model."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-cena-returns-in-peacemaker-season-2-trailer-packed-with-dc-cameos-glbs-2722513-2025-05-10",
      "headline": "John Cena returns in 'Peacemaker' Season 2 trailer packed With DC CameosJohn Cena returns in the action-packed Peacemaker Season 2 trailer, featuring new characters and surprise cameos. Premiering August 21 on Max, the season explores deeper emotional arcs and conflict.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/falaq-naaz-questions-loyalty-of-muslim-actors-towards-the-nation-2722412-2025-05-09",
      "headline": "Falaq Naaz questions loyalty of fellow actors towards the nation: I feel sorryTelevision actor Falaq Naaz has openly criticised Muslim actors in the Indian entertainment industry for their silence amidst the India-Pakistan conflict, urging them to show loyalty to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bramayugam-maker-rahul-sadasivan-horror-film-pranav-mohanlal-titled-dies-irae-2722387-2025-05-09",
      "headline": "Dies Irae: Bramayugam makers announce title of horror film with Pranav MohanlalPranav Mohanlal's horror film, which will be directed by Rahul Sadasivan of 'Bramayugam' fame has finally got its title - 'Dies Irea'. It is a Latin word that means 'The Day of Wrath'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohans-wife-aarti-ravi-in-fresh-note-on-divorce-issues-2722346-2025-05-09",
      "headline": "He walked away from duties: Actor Ravi Mohan's wife in fresh note on divorce issuesActor Ravi Mohan's estranged wife, Aarti Ravi, once again shared a long note on social media, accusing the actor of emotional abandonment and financial neglect during their ongoing divorce. Her statement comes amid rumours of Ravi's alleged relationship with singer Kenishaa Francis, who has denied any romantic involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-calls-actors-bhands-says-fine-with-dancing-at-weddings-2722364-2025-05-09",
      "headline": "Nawazuddin Siddiqui calls actors 'bhands', says fine with dancing at weddings Nawazuddin Siddiqui said he has no issue with actors dancing at weddings and called performers like himself modern-day 'bhands'. He shared that despite receiving disrespect towards artists, performance remains a respectful part of their profession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/not-all-men-just-baek-ho-the-potato-lab-hero-who-stays-and-rewrites-romance-2722355-2025-05-09",
      "headline": "Not all men, just Baek Ho: The Potato Lab hero who stays and rewrites romanceThey say you grow out of fairytales. But, in our weekly K-fix, we introduce you to a man - So Baek-ho from 'The Potato Lab' - who walks into a lab tucked in the hills and quietly rewrites everything you thought you knew about love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/indian-idol-12-winner-pawandeep-rajan-undergoes-three-more-surgeries-remains-under-observation-2722352-2025-05-09",
      "headline": "Singer Pawandeep Rajan's health update: Undergoes three more surgeriesIndian Idol 12 winner Pawandeep Rajan underwent three more surgeries following his tragic accident on May 5. His team issued a statement and updated fans about his health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jackson-wang-india-trip-may-defer-amid-indo-pak-tension-2722334-2025-05-09",
      "headline": "Singer Jackson Wang's India trip may defer amid Indo-Pak tensionSinger Jackson Wang's India trip might be deferred due to escalating tensions between India and Pakistan. No official statement has been released by the global sensation yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-to-follow-youtube-pay-per-view-model-2722274-2025-05-09",
      "headline": "Aamir Khan's Sitaare Zameen Par to follow YouTube pay-per-view model: ReportAamir Khan's upcoming film 'Sitaare Zameen Par' will be released on YouTube through a pay-per-view model, eight weeks after its theatrical release. The film introduces 10 debutant actors under the banner of Aamir Khan Productions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-unusual-x-activity-raises-eyebrows-2722257-2025-05-09",
      "headline": "Blank tweets? Amitabh Bachchan's unusual X activity raises eyebrowsVeteran actor Amitabh Bachchan's recent string of around 20 blank tweets has left fans puzzled and speculating about their significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/subham-movie-review-samantha-first-production-delivers-a-sweet-offbeat-horror-comedy-2722247-2025-05-09",
      "headline": "Subham review: Samantha's first production delivers a sweet, offbeat horror comedyReleased-Fri May 09, 2025'Subham', Samantha Ruth Prabhu's debut production, offers a quirky, light-hearted blend of horror and comedy. Directed by 'Cinema Bandi''s Praveen Kandregula, the film tackles social themes with humour. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-dismisses-akshay-kumar-isnt-friend-statement-calls-him-cool-guy-2722235-2025-05-09",
      "headline": "Paresh Rawal dismisses 'Akshay isn't friend' statement, calls him 'cool guy'Paresh Rawal says 'maatha kharab ho gaya' after the interview in which he called Akshay Kumar 'a colleague' and 'not a friend'. The actor now comes clean on the statement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-row-hits-back-files-new-lawsuit-against-kim-sae-ron-family-2722203-2025-05-09",
      "headline": "Kim Soo-hyun row: Actor hits back, files new lawsuit against Kim Sae-ron's familyKorean actor Kim Soo-hyun filed a lawsuit against YouTuber Kim Se-eui and Kim Sae-ron's family for spreading false information against the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/single-movie-review-honest-timepass-comedy-without-logic-but-delivers-wholesome-laughs-sree-vishnu-ivana-caarthick-raju-2722189-2025-05-09",
      "headline": "Single review: A timepass comedy without logic but delivers wholesome laughsReleased-Fri May 09, 2025'Single' movie review: Directed by Caarthick Raju, 'Single' is a slapstick comedy about a love triangle between Sree Vishnu, Ivana and Ketika Sharma. The film, although has an illogical plot, serves as a good timepass flick to watch and laugh in abandon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-daughter-sitara-ghattamaneni-meets-kendall-jenner-2722158-2025-05-09",
      "headline": "Mahesh Babu's daughter Sitara's fan girl moment with Kendall JennerMahesh Babu's daughter Sitara Ghattamaneni recently bumped into international model Kendall Jenner. The two clicked selfies together, delighting fans across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishaan-khatter-bhumi-pednekar-the-royals-review-lacks-chemistry-visually-grand-2722121-2025-05-09",
      "headline": "The Royals review: A royal khichdi with ample hot bods but lacklustre chemistryReleased-Fri May 09, 2025'The Royals' offers a modern Indian fairy-tale set in Rajasthan, blending classic romance tropes with regal grandeur and contemporary twists. Despite its picturesque backdrop and strong performances, the show struggles to ignite the essential chemistry expected in a mushy romantic drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-asks-citizens-to-be-cautious-in-wise-note-amid-india-pakistan-tensions-2722118-2025-05-09",
      "headline": "Rajamouli asks citizens to be cautious in wise note amid India-Pakistan tensionsFilmmaker SS Rajamouli praised the Indian Army and urged citizens to act responsibly amid India-Pakistan tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-posts-proud-note-for-indian-army-amid-india-pakistan-tensions-virat-kohli-reacts-2722126-2025-05-09",
      "headline": "Anushka Sharma posts proud note for Indian Army amid Indo-Pak tensions, Virat reactsAnushka Sharma called the Indian Armed Forces real 'heroes' in a note posted on Instagram, following India's precision strike against terrorist centres in Pakistan and PoK under the code-name Operation Sindoor. Her husband and cricketer, Virat Kohli, was among the first people to comment on the post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-krystle-dsouza-tv-celebs-extend-support-to-indian-army-2722116-2025-05-09",
      "headline": "Karan Kundrra to Krystle Dsouza: TV celebs extend support to Indian ArmyKaran Kundrra, Krystle Dsouza, Karan Veer Mehra, among other TV celebs who extended their support to the Indian army amid tensions with Pakistan. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-drones-intercepted-locations-jammu-kashmir-punjab-india-2722445-2025-05-09",
      "headline": "Pakistan targets 20 Indian cities in fresh drone attack, air defence in actionSeveral drones were intercepted at multiple locations in Jammu and Kashmir, Punjab, and Rajasthan, as Pakistan attempted to strike military and civilian targets for the second consecutive day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-live-update-operation-sindoor-blackout-india-pak-war-missile-drone-attack-pahalgam-terror-attack-air-strike-2721927-2025-05-09",
      "headline": "Live: 3 injured after Pak drone targets civilians in Ferozepur, say Army sourcesPakistan drone attack live updates: Sirens went off in Jammu for a second consecutive day as Pakistan began shelling in parts of Jammu and Kashmir, including Poonch and Uri. Blasts were heard in Jammu, and the city witnessed blackout for a second day. Meanwhile, amid escalating tensions, Prime Minister Narendra Modi chaired a high-level security meeting with the chiefs of Army, Navy and Air Force. On Thursday, Pakistan launched a series of missile and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/32-airports-civil-operations-suspended-till-may-14-as-india-pak-tension-escalates-2722512-2025-05-10",
      "headline": "32 airports shut till May 14 as India-Pak tensions escalateCivil flight operations at 32 airports in North and West India will remain suspended from May 9 to 14, 2025, following security concerns after cross-border tensions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-cities-targeted-by-pakistan-in-fresh-drone-attacks-list-of-locations-2722467-2025-05-09",
      "headline": "26 locations targeted by Pak in fresh drone attacks. Here is the listPakistan resorted to unprovoked ceasefire violations as it launched shelling on several locations inside India, escalating the ongoing tensions between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-confrontation-operation-sindoor-hidden-enemy-china-hand-pakistan-general-asim-munir-2722305-2025-05-09",
      "headline": "Who wants to keep India busy in war, apart from a mad Pakistan General?Hostilities are simmering between India and Pakistan, but a more insidious force may be pulling the strings. As missiles fly and tempers flare, the real battle might not be at the border — but in the shadows, where the hidden enemy quietly thrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fareed-zakaria-india-pakistan-tensions-operation-sindoor-pahalgam-attack-retaliation-2722479-2025-05-09",
      "headline": "India has moral high ground, should take strategic high ground too: Fareed ZakariaIn an interview with India Today TV, Fareed Zakaria stressed that India must act with long-term strategy in mind. \"India has the moral high ground but it has the most to lose from a massive escalation,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-1-billion-loan-approved-imf-funds-body-india-tensions-2722485-2025-05-09",
      "headline": "Pakistan says $1 billion loan approved by IMF, funds body yet to commentThe IMF has approved a review of Pakistan's $7 billion loan program, releasing a $1 billion tranche, despite objections from India, which raised concerns over political issues and Pakistan's high, unsustainable debt levels.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-commercial-flights-flew-in-pakistani-skies-since-its-drone-attacks-2722440-2025-05-09",
      "headline": "Pak using airlines as shield? Its skies saw over 100 flights since drone attackIndian Air Force's Wing Commander Vyomika Singh stated that Pakistan did not close its airspace despite launching a failed drone and missile attack at 8:30 pm on May 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/kashmiri-foiled-pakistan-plan-snatch-jammu-kashmir-india-mujahideens-1965-war-operation-sindoor-2722234-2025-05-09",
      "headline": "When Kashmiris foiled Pak's villainous plan to snatch J&K with mujahideenThe Pakistan military and the ISI hatched a plot for months to use mujahideen and disguised army regulars to snatch Kashmir from India. Its Operation Gibraltar hinged on the belief that Kashmiris would side with them and revolt against India. Leave alone revolt, Kashmiris gave away critical information that helped the Indian Army defeat the Pakistanis. It was Operation Gibraltar that led to the 1965 War."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/president-trump-india-pak-tensions-white-house-drone-attacks-op-sindoor-2722475-2025-05-09",
      "headline": "Trump wants to see India-Pak tensions 'de-escalate as soon as possible'US President Donald Trump urges swift de-escalation between India and Pakistan, as the US rules out military involvement. On Thursday, Vice President Vance stresses diplomacy, calling the conflict \"none of America's business.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-army-rajnath-singh-pakistan-drone-strikes-2722476-2025-05-09",
      "headline": "Defence Minister asks Army to act firmly against civilian attacks by Pak: SourcesThe Defence Minister has asked the Indian Army to take strong action against the Pak Army for targeting civilians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-board-ipl-host-bcci-india-vs-pakistan-war-2722453-2025-05-09",
      "headline": "IPL 2025 in England? ECB extends offer to BCCI: ReportThe Indian Premier League 2025 has been suspended for a week amid rising India-Pakistan tensions. The ECB has offered to host the remaining matches of the tournament, The Cricketer has reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-the-smiles-on-rajnath-singh-3-service-chiefs-tell-a-story-india-crushing-pak-2722078-2025-05-09",
      "headline": "The smiles on Rajnath Singh, 3 service chiefs tell a story - India crushing PakThe meeting - attended by Chief of Defence Staff General Anil Chauhan, Chief of the Army Staff General Upendra Dwivedi, Air Chief Marshal AP Singh, and Navy Chief Admiral Dinesh K Tripathi - came less than 24 hours after Pakistan launched a wave of drone and missile attacks along India's western border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-attack-pahalgam-terrorist-attack-chinese-missile-pl-15-jammu-punjab-rajasthan-army-2722405-2025-05-09",
      "headline": "Pak confirms use of Chinese PL-15 missile after India struck its terror campsIn the first-ever confirmed combat use, Pakistan admitted to firing China's long-range PL-15 missile at India, following India's strike on Pak terrorist camps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amritsar-red-alert-drone-attack-civilian-movement-prohitbited-2722468-2025-05-09",
      "headline": "Amritsar on red alert after 15 Pak drones intercepted: SourcesAccording to sources, at least 15 drones were spotted in five different areas of Amritsar and most of these have been neutralised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-postponed-indefinitely-india-pakistan-tenisons-2722435-2025-05-09",
      "headline": "Neeraj Chopra Classic postponed indefinitely amidst India-Pakistan tensionsThe inaugural edition of the Neeraj Chopra Classic has been postponed indefinitely due to the rising India-Pakistan cross-border tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-unusual-x-activity-raises-eyebrows-2722257-2025-05-09",
      "headline": "Blank tweets? Amitabh Bachchan's unusual X activity raises eyebrowsVeteran actor Amitabh Bachchan's recent string of around 20 blank tweets has left fans puzzled and speculating about their significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/pakistans-strike-on-india-used-gun-toting-turkish-drones-all-about-songar-2722320-2025-05-09",
      "headline": "Pakistan likely used Turkey's Songar drones to attack India: What is it?Indian air defence systems responded swiftly, bringing down the majority of these drones before they could inflict significant damage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-india-may-8-attack-turkish-drone-used-400-drones-civilian-planes-radar-india-36-drones-operation-sindoor-2722309-2025-05-09",
      "headline": "Pak targeted 36 places with 300-400 'Turkish' drones: India on May 8 attackThe government said that the \"possible purpose of these large-scale aerial intrusions were to test the air defence systems and gather intelligence.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/the-psychological-toll-of-a-india-pakistan-war-like-situation-on-common-man-2721174-2025-05-09",
      "headline": "The psychological toll of a war-like situation on common manThe escalating tensions between India and Pakistan have left many feeling anxious and scared. Psychologists acknowledge the impact of such situations on mental health, but there are ways to cope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/balochistan-attacks-on-pakistan-army-bla-rebels-fighters-overrun-flag-hoist-independence-liberation-calls-2722171-2025-05-09",
      "headline": "Baloch rebels see opportunity in Pak's adversity, hoist flags of liberationFierce attacks by Baloch rebels have shaken the Pakistani state, even as it is focused on the Indian front. Balochistan's provincial capital, Quetta, saw six attacks on Pakistani forces on Thursday. The Baloch people have replaced Pakistani flags with their own, and want to be recognised as an independent country, with a diplomatic mission in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/permanent-commission-for-women-army-officers-case-sc-hearing-not-time-for-running-around-courtrooms-amid-border-conflict-2722322-2025-05-09",
      "headline": "This isn't time for court battles: Top court says retain all women officersThe Supreme Court made strong remarks on women officers in defence forces amidst the ongoing India-Pakistan border tensions. The top court urged the Army not to release women officers challenging denial of Permanent Commission, stressing morale and service utility over courtroom battles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-economy-imf-loan-package-financial-condition-bailout-islamabads-suicide-attack-on-itself-amid-india-tensions-2722114-2025-05-09",
      "headline": "Pakistan's suicide attack on itself amid IMF meetEven as Pakistan is firing missiles and drones at Indian civilian and military infrastructure, the \"establishment\" of the almost-broke nation might be shooting itself in the foot. With a crucial IMF review meeting on loans to Pakistan today, Islamabad's war drums may drown out the jingle of the much-needed money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/godzilla-x-kong-supernova-confirmed-for-2027-production-begins-on-monsterverse-sequel-glbs-2722516-2025-05-10",
      "headline": "'Godzilla x Kong: Supernova' Confirmed for 2027, production begins on Monsterverse SequelWarner Bros. confirms Godzilla x Kong: Supernova for March 2027 with production underway. Teaser hints at Titan activity, Monarch's return, and fan-favorite Easter eggs in the expanding Monsterverse saga.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-cena-returns-in-peacemaker-season-2-trailer-packed-with-dc-cameos-glbs-2722513-2025-05-10",
      "headline": "John Cena returns in 'Peacemaker' Season 2 trailer packed With DC CameosJohn Cena returns in the action-packed Peacemaker Season 2 trailer, featuring new characters and surprise cameos. Premiering August 21 on Max, the season explores deeper emotional arcs and conflict.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bramayugam-maker-rahul-sadasivan-horror-film-pranav-mohanlal-titled-dies-irae-2722387-2025-05-09",
      "headline": "Dies Irae: Bramayugam makers announce title of horror film with Pranav MohanlalPranav Mohanlal's horror film, which will be directed by Rahul Sadasivan of 'Bramayugam' fame has finally got its title - 'Dies Irea'. It is a Latin word that means 'The Day of Wrath'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohans-wife-aarti-ravi-in-fresh-note-on-divorce-issues-2722346-2025-05-09",
      "headline": "He walked away from duties: Actor Ravi Mohan's wife in fresh note on divorce issuesActor Ravi Mohan's estranged wife, Aarti Ravi, once again shared a long note on social media, accusing the actor of emotional abandonment and financial neglect during their ongoing divorce. Her statement comes amid rumours of Ravi's alleged relationship with singer Kenishaa Francis, who has denied any romantic involvement."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-dc-players-arrive-delhi-dharamshala-2722486-2025-05-09",
      "headline": "PBKS, DC players arrive in Delhi from Dharamshala after IPL 2025 suspensionThe Punjab Kings and Delhi Capitals players arrived in Delhi from Dharamshala after the IPL 2025 match on May 8 was called off due to Pakistan attacks on various parts of India. The players reached Delhi in a special train arranged by the BCCI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/italian-open-carlos-alcaraz-jannik-sinner-2722474-2025-05-09",
      "headline": "Tennis needs him: Alcaraz welcomes back Sinner after doping banItalian Open 2025: Carlos Alcaraz heaped praise on Jannik Sinner before the latter's comeback match on Saturday against Argentina's Mariano Navone. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-plans-host-2025-27-world-test-championship-final-india-2722459-2025-05-09",
      "headline": "BCCI keen to host WTC Final 2027 in IndiaThe BCCI is planning to bid for the hosting rights of the World Test Championship 2027 Final. The first three finals have been held in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-dharamsala-stampede-pbks-vs-dc-2722454-2025-05-09",
      "headline": "Couldn't have allowed a stampede: IPL chairman on Dharamsala evacuationArun Dhumal, the chairman of the IPL, talked about how the crowd at the HPCA Stadium in Dharamsala was asked to evacuate the venue during the match between Delhi Capitals and Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-board-ipl-host-bcci-india-vs-pakistan-war-2722453-2025-05-09",
      "headline": "IPL 2025 in England? ECB extends offer to BCCI: ReportThe Indian Premier League 2025 has been suspended for a week amid rising India-Pakistan tensions. The ECB has offered to host the remaining matches of the tournament, The Cricketer has reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-postponed-india-pakistan-border-tensions-2722450-2025-05-09",
      "headline": "PCB postpones remaining 8 matches of Pakistan Super LeagueThe Pakistan Cricket Board has postponed the remaining matches of the Pakistan Super League due to escalating tensions at the India-Pakistan border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sourav-ganguly-rohit-sharma-test-retirement-decision-interview-2722439-2025-05-09",
      "headline": "Right time for him: Ganguly backs Rohit Sharma's retirement decisionIn an interview with India Today, former Indian captain Sourav Ganguly spoke about Rohit Sharma's decision to retire from Test cricket. Rohit retired on May 7 with 4301 runs from 67 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-postponed-indefinitely-india-pakistan-tenisons-2722435-2025-05-09",
      "headline": "Neeraj Chopra Classic postponed indefinitely amidst India-Pakistan tensionsThe inaugural edition of the Neeraj Chopra Classic has been postponed indefinitely due to the rising India-Pakistan cross-border tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-delhi-capitals-security-dharamsala-2722425-2025-05-09",
      "headline": "How IPL teams, Delhi and Punjab, were moved amid security concernsIPL 2025: Punjab Kings and Delhi Capitals players were evacuated from the HPCA Stadium in Dharamsala after Pakistan tried to invade air space near Chandigarh with drone attacks. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-chennai-super-kings-ravindra-jadeja-urvil-patel-2722411-2025-05-09",
      "headline": "CSK players Ravindra Jadeja, Urvil Patel head home after IPL 2025 suspensionCSK players Ravindra Jadeja and Urvil Patel are heading home after the IPL 2025 season was suspended for a week in the wake of the rising cross-border tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-thanks-indian-railways-special-train-evacuates-ipl-teams-dharamsala-india-pakistan-war-2722400-2025-05-09",
      "headline": "Watch: Indian railways' special train evacuates players from DharamsalaBCCI thanked Indian Railways for arranging a special train to evacuate IPL teams from Dharamsala. The move followed the suspension of the Punjab Kings and Delhi Capitals match amid India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sourav-ganguly-rohit-sharma-test-retirement-decision-interview-2722439-2025-05-09",
      "headline": "Right time for him: Ganguly backs Rohit Sharma's retirement decisionIn an interview with India Today, former Indian captain Sourav Ganguly spoke about Rohit Sharma's decision to retire from Test cricket. Rohit retired on May 7 with 4301 runs from 67 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-postponed-indefinitely-india-pakistan-tenisons-2722435-2025-05-09",
      "headline": "Neeraj Chopra Classic postponed indefinitely amidst India-Pakistan tensionsThe inaugural edition of the Neeraj Chopra Classic has been postponed indefinitely due to the rising India-Pakistan cross-border tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-delhi-capitals-security-dharamsala-2722425-2025-05-09",
      "headline": "How IPL teams, Delhi and Punjab, were moved amid security concernsIPL 2025: Punjab Kings and Delhi Capitals players were evacuated from the HPCA Stadium in Dharamsala after Pakistan tried to invade air space near Chandigarh with drone attacks. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspended-chennai-super-kings-ravindra-jadeja-urvil-patel-2722411-2025-05-09",
      "headline": "CSK players Ravindra Jadeja, Urvil Patel head home after IPL 2025 suspensionCSK players Ravindra Jadeja and Urvil Patel are heading home after the IPL 2025 season was suspended for a week in the wake of the rising cross-border tensions between India and Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-thanks-indian-railways-special-train-evacuates-ipl-teams-dharamsala-india-pakistan-war-2722400-2025-05-09",
      "headline": "Watch: Indian railways' special train evacuates players from DharamsalaBCCI thanked Indian Railways for arranging a special train to evacuate IPL teams from Dharamsala. The move followed the suspension of the Punjab Kings and Delhi Capitals match amid India-Pakistan tensions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}