{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adidas-puma-rivalry-dassler-brothers-history-sibling-feud-adolf-rudolf-succession-war-2611900-2024-10-06",
      "headline": "Succession Wars: Sibling rivalry that led to the birth of Adidas and PumaAdolf 'Adi' Dassler and Rudolf Dassler, transformed the world of sports footwear through innovation, ambition, and intense sibling rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-exit-poll-election-result-bjp-congress-national-conference-pdp-naya-kashmir-2612009-2024-10-06",
      "headline": "What went wrong for BJP's 'Naya Kashmir' dreams as exit polls favour INDIA blocThe BJP was eyeing a surprise in Jammu and Kashmir with its 'Naya Kashmir' narrative and claims of peace and prosperity. However, exit polls offer a disappointment for them, especially in the Valley. What went wrong for the BJP's Kashmir dreams?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-attacks-emmanuel-macron-israel-arms-embargo-proposal-iran-hezbollah-lebanon-gaza-2612021-2024-10-06",
      "headline": "Netanyahu's video message for Macron over call for arms embargo: Shame on themIsraeli Prime Minister Benjamin Netanyahu denounced French President Emmanuel Macron's proposal for an arms embargo on Israel, and questioned whether Iran had restricted weapons deliveries to its proxies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-2024-exit-poll-bjp-failure-pave-way-congress-win-after-decade-2612071-2024-10-06",
      "headline": "BJP's failures that may pave way for Congress win in Haryana after 10 yearsThe BJP's declining popularity in Haryana can be attributed to several critical missteps during its two terms in power."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-sarpanch-panchayat-elections-jalalabad-fazilka-shooting-aap-sad-akali-dal-2612085-2024-10-06",
      "headline": "AAP leader injured in firing in Punjab's Jalalabad, party blames Akali DalThe Aam Aadmi Party (AAP) blamed the Shiromani Akali Dal (SAD) for the clashes in Jalalabad, Punjab, where one person was injured in an alleged firing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/sonagachi-durga-puja-kolkata-soil-sex-workers-tradition-rg-kar-protest-2611715-2024-10-06",
      "headline": "Erosion of soil tradition as Durga idol makers skip red-light districtThe age-old tradition of soil from a red-light district being used for making Durga idols was depicted in Shah Rukh Khan-starrer Devdas. It came as a revelation to millions of people in India. The custom is mentioned in the Puranas and is also associated with Lord Ram. However, 'punya mati' has been commercialised now, and the tradition is on the wane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-girl-body-rape-murder-accused-mostakin-sardar-confesses-case-lodged-2612101-2024-10-06",
      "headline": "Accused confesses to Bengal girl's murder, denies rape charge: SourcesThe accused, Mostakin Sardar, said he killed the girl by smothering her after she resisted his attempts to sexually assault her. He admitted to killing the girl out of fear of being caught if she were alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-businessman-mumthaz-ali-missing-kulur-bridge-in-mangaluru-search-2612095-2024-10-06",
      "headline": "Karnataka businessman goes missing, his damaged BMW found near bridgeKarnataka businessman Mumthaz Ali, brother of JD(S) MLC BM Farooq and former Congress MLA Mohiuddin Bava, has gone missing on Sunday. His damaged car was found near Kulur bridge in Mangaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-smoky-skies-deserted-streets-as-israeli-strikes-pound-beirut-2612052-2024-10-06",
      "headline": "Ground Report: Smoky skies, deserted streets as Israeli strikes pound BeirutIsrael Defense Forces (IDF) intensified its airstrikes in Lebanon's Bekaa Valley, which is considered a stronghold of the Hezbollah. India Today TV's Ashraf Wani shows an area in south Beirut, where Israel carried out airstrikes. Smokes can be seen coming out of buildings hit by the missiles. A road in the region also was almost deserted following the strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-star-rani-rampal-slams-air-india-over-broken-suitcase-2612112-2024-10-06",
      "headline": "Hockey star Rani Rampal slams Air India over broken suitcaseIndia hockey star Rani Rampal was left fuming over Air India's mishandling of her suitcase. Rampal took to Twitter to slam Air India and demanded an immediate resolution.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-israel-mossad-pager-walkie-talkie-taiwan-iran-gaza-attack-hamas-2612038-2024-10-06",
      "headline": "How Israel's plan to booby-trap Hezbollah pagers took 9 years: ReportNew details reveal Israel's decade-long elaborate plan to sabotage Hezbollah's communication devices, involving meticulous planning, from sending sales pitches to remote detonation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-aligarh-acid-attack-woman-throws-acid-lover-blackmailing-police-probe-2612072-2024-10-06",
      "headline": "UP woman throws acid on lover, alleges 12 years of blackmailA woman threw acid on her lover in Uttar Pradesh's Aligarh. She claimed the man had been blackmailing her for the past 12 years. The police are investigating the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-gwalior-t20i-prediction-preview-sanju-samson-mayank-yadav-2612028-2024-10-06",
      "headline": "India to unleash new opening pair, express pacer(s) in Gwalior T20IIndia vs Bangladesh, 1st T20I: Still in the nascent stages of the Gautam Gambhir era, Suryakumar Yadav-led India will look to identity potential next-gen stars in the three-match series at home. Sanju Samson has been given the opener's role while Mayank Yadav and Harshit Rana might add some spice to the proceedings with their express pace, if handed a debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-tillotama-shome-slams-air-india-for-85-hours-delay-writes-no-solutions-offered-zero-accountability-on-x-2612102-2024-10-06",
      "headline": "Actor Tillotama Shome slams Air India for 8.5 hours delay: No solutions offeredActor Tillotama Shome voiced her frustration over a significant delay on her Air India flight to London. She criticised the airline's communication and accountability, affecting many passengers, including a patient needing urgent medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-jammu-and-kashmir-assembly-election-2024-india-today-cvoter-exit-polls-result-congress-bjp-2611927-2024-10-05",
      "headline": "Congress to reclaim Haryana, INDIA edge in J&K tight fight: Exit pollThe CVoter exit poll predicts a strong showing by the Congress in Haryana, while Jammu and Kashmir may see the Congress-National Conference combine holding the edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adidas-puma-rivalry-dassler-brothers-history-sibling-feud-adolf-rudolf-succession-war-2611900-2024-10-06",
      "headline": "Succession Wars: Sibling rivalry that led to the birth of Adidas and PumaAdolf 'Adi' Dassler and Rudolf Dassler, transformed the world of sports footwear through innovation, ambition, and intense sibling rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-donald-trump-butler-pennsylvania-rally-vote-fight-joe-biden-democrats-republicans-2612040-2024-10-06",
      "headline": "Fight, fight, fight. Vote, vote, vote: Elon Musk puts on a show at Trump rallyElon Musk displayed his staunch support for Donald Trump as he shared a stage with the Republican presidential nominee, declaring that \"nothing is more important\" than voting for him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sleeping-labourer-man-attacked-with-stick-by-miscreant-in-delhi-model-town-caught-cctv-camera-2612099-2024-10-06",
      "headline": "Video: Sleeping labourer attacked in Delhi, concerns over lack of police presenceA labourer sleeping outside a shop in Delhi's Model Town was attacked by a miscreant, an incident captured on CCTV that has gone viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-424-04-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/man-playing-lord-ram-in-ramlila-collapses-dies-on-stage-in-delhi-2612069-2024-10-06",
      "headline": "Man playing Lord Ram in Ramlila collapses, dies on stage in DelhiIn a video of the incident, the man playing Lord Ram is seen delivering his lines when he suddenly clutches his chest and appears to be in distress. He then goes behind the stage and collapses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-conflict-airstrikes-ground-operations-lebanon-beirut-hamas-gaza-october-7-protests-2612005-2024-10-06",
      "headline": "'Very violent' strikes shake Beirut as Israel vows no respite for Hezbollah Live UpdatesIsrael's military campaign against the Iran-backed Hezbollah in Lebanon continued with intense airstrikes and ground operations, marking one of the most violent phases of the conflict yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/fuel-efficiency-co2-emissions-based-star-ratings-to-promote-ev-adoption-say-experts-2612109-2024-10-06",
      "headline": "Fuel efficiency, CO2 emissions-based star ratings to promote EV adoptionA fuel efficiency and CO2 emissions-based star rating system will lead to a change in the portfolio mix of OEMs, according to experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-couples-therapy-essential-even-for-people-in-a-healthy-relationship-2611125-2024-10-06",
      "headline": "Is couples therapy essential even for people in a healthy relationship?Seeking therapy doesn't mean something is broken in your relationship. Instead, it reflects your awareness and commitment to nurturing and strengthening your bond. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-barielly-maharana-pratap-hospital-hair-eating-disease-tricholotomania-2612064-2024-10-06",
      "headline": "UP woman complains of severe stomach ache, doctors remove 2-kg hairballThe woman has been battling a psychological disorder characterised by the compulsive urge to eat hair. Over 15 years, she accumulated a massive bundle of hair in her stomach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jani-master-national-film-award-has-been-suspended-2612037-2024-10-06",
      "headline": "Choreographer Jani Master's National Film Award suspended amid Pocso chargesChoreographer Jani Master's National Film Award has been suspended due to the sexual assault allegations against him. The award committee issued a statement regarding this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-tillotama-shome-slams-air-india-for-85-hours-delay-writes-no-solutions-offered-zero-accountability-on-x-2612102-2024-10-06",
      "headline": "Actor Tillotama Shome slams Air India for 8.5 hours delay: No solutions offeredActor Tillotama Shome voiced her frustration over a significant delay on her Air India flight to London. She criticised the airline's communication and accountability, affecting many passengers, including a patient needing urgent medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-aniruddhacharya-blesses-contestants-gifts-salman-khan-bhagavad-gita-2612100-2024-10-06",
      "headline": "Bigg Boss 18: Aniruddhacharya blesses contestants, gifts Salman Khan Bhagavad GitaGuru Aniruddhacharya Ji Maharaj appeared as a guest on Bigg Boss 18. He blessed the contestants for the upcoming season and presented host Salman Khan with a Bhagavad Gita."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-misinterpretation-vasan-bala-remarks-jigra-script-2612088-2024-10-06",
      "headline": "Karan Johar on misinterpretation of Vasan Bala's remarks on Jigra scriptKaran Johar responded to criticism directed at him after a misunderstanding of director Vasan Bala's comments regarding Jigra. On Sunday, he shared a detailed statement addressing the issue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/keanu-reeves-spins-out-of-track-in-pro-racing-debut-at-indianapolis-escapes-injury-2612076-2024-10-06",
      "headline": "Keanu Reeves spins out of track in pro racing debut at US, escapes injuryKeanu Reeves, famed for his action roles, has taken to the racing track at Indianapolis Motor Speedway. Despite a minor spin-out, the actor completed the race unscathed, thrilling fans and the motorsport community."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-sandeep-sharma-ipl-career-revive-injury-replacement-auction-unsold-2612104-2024-10-06",
      "headline": "Sandeep Sharma reveals how Sanju Samson revived his IPL careerSandeep Sharma credited Sanju Samson for reviving his IPL career after going unsold in 2023, with Samson's intervention securing him a spot in Rajasthan Royals, where he became a key bowler over two seasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-naseem-return-as-pakistan-announce-playing-xi-for-1st-test-vs-england-2612106-2024-10-06",
      "headline": "Shaheen Afridi returns as Pakistan announce playing XI for 1st Test vs EnglandPakistan announced playing XI for 1st Test vs England in Multan. Pakistan's ace pacer Shaheen Shah Afridi returned to the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-aakash-chopra-arshdeep-singh-mayank-yadav-harshit-rana-2612103-2024-10-06",
      "headline": "Chopra wants India to unleash Arshdeep, Mayank, Rana together on BangladeshIND vs BAN: Former cricketer Aakash Chopra wants India to play three specialist pacers against Bangladesh. Chopra wants India to unleash the full fury of Arshdeep Singh, Harshit Rana and Mayank Yadav together on Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jammu-is-set-to-host-a-match-in-the-legends-league-cricket-llc-for-the-very-first-time-marking-a-major-milestone-in-its-growing-sports-culture-this-inclusion-as-a-venue-is-a-significant-step-2612084-2024-10-06",
      "headline": "Jammu set to host first-ever Legends League Cricket match at Bakshi StadiumJammu will make its debut as a host in the Legends League Cricket, marking a new chapter in the region's cricketing history. With international legends set to take the field, the city is poised to become a key destination for top-level cricket events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-suryakumar-yadav-washington-sundar-2612082-2024-10-06",
      "headline": "Candid Suryakumar Yadav teases Washington Sundar in practiceIndia captain Suryakumar Yadav was at his candid best in the team's final training session ahead of the 1st T20I. Yadav was seen teasing Washington Sundar for his Gabba heroics back in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-ind-vs-pak-sanjay-manjrekar-makes-bold-prediction-on-richa-2612074-2024-10-06",
      "headline": "Women's T20 World Cup, IND vs PAK: Sanjay Manjrekar makes bold prediction on RichaWomen's T20 World Cup 2024: Sanjay Manjrekar made a bold prediction ahead of India's mouth-watering and must win clash against Pakistan. He predicted Richa Ghosh to win the Player of the Match award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-ben-stokes-missing-1st-test-due-to-bigger-picture-2612073-2024-10-06",
      "headline": "Ben Stokes missing 1st Test due to 'bigger picture'England Test captain Ben Stokes has explained why he is not playing the 1st Test match against Pakistan. Stokes said that he has opted out keeping the bigger picture in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-harshit-rana-nitish-reddy-mayank-yadav-2612055-2024-10-06",
      "headline": "IPL's fast bowling stars set for India audition vs BangladeshIndia are set to play Bangladesh in a 3-match T20I series. The series will help India test out at least two of its latest Indian Premier League sensations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suresh-raina-rewinds-clock-smashes-quickfire-fifty-in-national-cricket-league-2612051-2024-10-06",
      "headline": "Suresh Raina rewinds clock, smashes quickfire fifty in National Cricket LeagueSuresh Raina rolled back the years with a blistering 53* off 28 balls in the Sixty Strikes tournament, smashing Shakib Al Hasan for two sixes and a four. His knock powered New York Lions to a commanding 19-run win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/was-told-that-i-wont-be-ready-for-rohit-sharma-tanzim-sakib-before-ind-vs-ban-2612043-2024-10-06",
      "headline": "Was told that I won't be ready for Rohit Sharma: Tanzim Sakib before IND vs BANTanzim Sakib revealed how everyone once told him that he was too new to be able to bowl at someone like Rohit Sharma. Nonetheless, his first international scalp was that of Rohit in Asia Cup 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-t20i-mayank-yadav-2612039-2024-10-06",
      "headline": "Aakash Chorpa expects tough calls in team selection ahead of 1st T20IIndia vs Bangladesh: Former cricketer Aakash Chopra believes that the Indian team management will have to make some tough calls in terms of playing XI in the 1st T20I. India have called up multiple promising youngsters for this series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-ben-stokes-missing-1st-test-due-to-bigger-picture-2612073-2024-10-06",
      "headline": "Ben Stokes missing 1st Test due to 'bigger picture'England Test captain Ben Stokes has explained why he is not playing the 1st Test match against Pakistan. Stokes said that he has opted out keeping the bigger picture in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-harshit-rana-nitish-reddy-mayank-yadav-2612055-2024-10-06",
      "headline": "IPL's fast bowling stars set for India audition vs BangladeshIndia are set to play Bangladesh in a 3-match T20I series. The series will help India test out at least two of its latest Indian Premier League sensations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suresh-raina-rewinds-clock-smashes-quickfire-fifty-in-national-cricket-league-2612051-2024-10-06",
      "headline": "Suresh Raina rewinds clock, smashes quickfire fifty in National Cricket LeagueSuresh Raina rolled back the years with a blistering 53* off 28 balls in the Sixty Strikes tournament, smashing Shakib Al Hasan for two sixes and a four. His knock powered New York Lions to a commanding 19-run win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/was-told-that-i-wont-be-ready-for-rohit-sharma-tanzim-sakib-before-ind-vs-ban-2612043-2024-10-06",
      "headline": "Was told that I won't be ready for Rohit Sharma: Tanzim Sakib before IND vs BANTanzim Sakib revealed how everyone once told him that he was too new to be able to bowl at someone like Rohit Sharma. Nonetheless, his first international scalp was that of Rohit in Asia Cup 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-t20i-mayank-yadav-2612039-2024-10-06",
      "headline": "Aakash Chorpa expects tough calls in team selection ahead of 1st T20IIndia vs Bangladesh: Former cricketer Aakash Chopra believes that the Indian team management will have to make some tough calls in terms of playing XI in the 1st T20I. India have called up multiple promising youngsters for this series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/llc-2024-ian-bell-feels-lucky-to-have-played-international-cricket-for-so-long-2612036-2024-10-06",
      "headline": "LLC 2024: Ian Bell feels lucky to have played international cricket for so longIan Bell said that he felt lucky to have played international cricket for so long and to take part in the Legends Cricket League 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-mitchell-starc-supports-wife-alyssa-healy-in-womens-t20-world-cup-2612032-2024-10-06",
      "headline": "Watch: Mitchell Starc supports wife Alyssa Healy in Women's T20 World CupAustralia fast bowler Mitchell Starc was spotted in the stands supporting his wife Alyssa Healy in the Women's T20 World Cup. Healy, who is captaining the Australian side was in India during the IPL supporting Starc.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-gwalior-t20i-prediction-preview-sanju-samson-mayank-yadav-2612028-2024-10-06",
      "headline": "India to unleash new opening pair, express pacer(s) in Gwalior T20IIndia vs Bangladesh, 1st T20I: Still in the nascent stages of the Gautam Gambhir era, Suryakumar Yadav-led India will look to identity potential next-gen stars in the three-match series at home. Sanju Samson has been given the opener's role while Mayank Yadav and Harshit Rana might add some spice to the proceedings with their express pace, if handed a debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-mi-rcb-ipl-retentions-auction-hardik-pandya-ab-de-villiers-2612022-2024-10-06",
      "headline": "Rohit Sharma to RCB will be bigger than Hardik Pandya to MI: AB de VilliersIf Rohit Sharma was to move to RCB in IPL 2025, it would be a bigger move than Hardik Pandya rejoining Mumbai Indians, felt AB de Villiers. However, ABD doubted that the move could actually happen due to Rohit's loyalties towards MI.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-dani-carjaval-acl-injury-2612013-2024-10-06",
      "headline": "Real Madrid jolted with injury blow as Dani Carvajal set to undergo ACL surgeryReal Madrid defender Dani Carvajal is set to be out for months after incurring an ACL injury. Carvajal updated his situation on social media and informed that he was set to have a surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-or-ms-dhoni-shivam-dubes-intelligent-reply-in-kapil-sharma-show-2612011-2024-10-06",
      "headline": "Rohit Sharma or MS Dhoni: Shivam Dube's 'intelligent' reply on Kapil Sharma ShowIndia all-rounder Shivam Dube was asked to name his favourite captain on the Kapil Sharma show. Dube was given a choice between MS Dhoni and Rohit Sharma. The all-rounder's cheeky reply impressed the host and the audience.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-challenge-preview-harmanpreet-kaur-fatima-sana-2611981-2024-10-06",
      "headline": "Harmanpreet's India face tricky road as Pakistan challenge awaitsWomen's T20 World Cup 2024: India are in a precarious position as they face Fatima Sana's Pakistan after losing to New Zealand in Dubai on Friday. Pakistan will be brimming with confidence after beating Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-suryakumar-yadav-gwalior-pitch-t20-cricket-2611990-2024-10-05",
      "headline": "Suryakumar Yadav deems Gwalior pitch ideal for T20 cricketIND vs BAN, 1st T20I: Suryakumar Yadav said that the pitch in Gwalior is ideal for T20 cricket. Suryakumar will lead India when the Men in Blue step out for their series opener against Bangladesh on Sunday, October 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-dani-carjaval-acl-injury-2612013-2024-10-06",
      "headline": "Real Madrid jolted with injury blow as Dani Carvajal set to undergo ACL surgeryReal Madrid defender Dani Carvajal is set to be out for months after incurring an ACL injury. Carvajal updated his situation on social media and informed that he was set to have a surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-or-ms-dhoni-shivam-dubes-intelligent-reply-in-kapil-sharma-show-2612011-2024-10-06",
      "headline": "Rohit Sharma or MS Dhoni: Shivam Dube's 'intelligent' reply on Kapil Sharma ShowIndia all-rounder Shivam Dube was asked to name his favourite captain on the Kapil Sharma show. Dube was given a choice between MS Dhoni and Rohit Sharma. The all-rounder's cheeky reply impressed the host and the audience.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-challenge-preview-harmanpreet-kaur-fatima-sana-2611981-2024-10-06",
      "headline": "Harmanpreet's India face tricky road as Pakistan challenge awaitsWomen's T20 World Cup 2024: India are in a precarious position as they face Fatima Sana's Pakistan after losing to New Zealand in Dubai on Friday. Pakistan will be brimming with confidence after beating Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-suryakumar-yadav-gwalior-pitch-t20-cricket-2611990-2024-10-05",
      "headline": "Suryakumar Yadav deems Gwalior pitch ideal for T20 cricketIND vs BAN, 1st T20I: Suryakumar Yadav said that the pitch in Gwalior is ideal for T20 cricket. Suryakumar will lead India when the Men in Blue step out for their series opener against Bangladesh on Sunday, October 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-super-league-mohun-bagan-beat-mohammedan-sporting-2611989-2024-10-05",
      "headline": "Mohun Bagan thrash Mohammedan Sporting riding on 3 first-half goalsMohun Bagan crushed city rivals Mohammed Sporting riding on three first-half strikes from Jamie Maclaren, Subhasish Bose and Greg Stewart in the less fancied 'Kolkata Derby' here on Saturday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-t20i-predicted-starting-eleven-mayank-yadav-nitish-kumar-reddy-debut-2611980-2024-10-05",
      "headline": "IND vs BAN, 1st T20I Predicted XI: Mayank Yadav, Nitish Reddy to debut?India's youth-heavy T20 squad, led by Suryakumar Yadav, aims to maintain their momentum against Bangladesh, with potential debuts for IPL sensation Mayank Yadav and rising star Nitish Kumar Reddy in the highly anticipated series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-reveals-rishabh-pant-smart-tactic-in-t20-world-cup-final-2611977-2024-10-05",
      "headline": "Rohit reveals Pant's smart tactic in T20 World Cup final triumphT20 World Cup 2024: Rohit Sharma has revealed Rishabh Pant had used a clever tactic during the final against South Africa to slow down the game and break the momentum of the batting side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-bangladesh-danni-wyatt-hodge-nigar-sultana-sharjah-2611962-2024-10-05",
      "headline": "Danni Wyatt-Hodge stars as England edge past spirited Bangladesh Women's T20 World Cup 2024: Heather Knight's England beat Bangladesh by 21 runs on Saturday and got off to a brilliant start in their campaign in the United Arab Emirates (UAE). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}