{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-109-points-lower-nifty-below-25100-tata-motors-down-2-percent-2792928-2025-09-25",
      "headline": "Sensex, Nifty trade flat after opening lower amid F&O expiry, US visa curbsAt 9:28 am, the S&P BSE Sensex was up 95.55 points at 81,811.18, while the NSE Nifty50 rose 25.65 points to 25,082.55. Broader market indices also traded in the green, though overall sentiment on Dalal Street remained mixed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/atlanta-electricals-ipo-allotment-today-check-your-status-online-guide-listing-date-gmp-gain-loss-2792908-2025-09-25",
      "headline": "Atlanta Electricals IPO allotment out: Check your status, listing date and GMPInvestors who applied for Atlanta Electricals IPO can check their allotment status through either the BSE website or the registrar's platform, MUFG Intime India Private Limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-imposes-import-curbs-on-plain-silver-jewellery-till-march-2026-2792832-2025-09-24",
      "headline": "Government imposes import curbs on plain silver jewellery till March 2026The restrictions have been introduced in the wake of an import of plain silver jewellery from under preferential duty exemptions rising steeply during April-June 2024-25 to April-June 2025-26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/investors-cautious-of-it-stocks-h-1b-visa-changes-psu-consumption-banking-gold-vs-equities-2792662-2025-09-24",
      "headline": "Should investors be cautious of IT stocks amid H-1B visa changes?With ongoing changes in visa fees and policies, analysts say the outlook for the sector has turned uncertain in the short run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/npci-rs-500-crore-profit-half-of-world-digital-payment-upi-transactions-2792595-2025-09-24",
      "headline": "How NPCI powers half the world's digital payments on just Rs 500 croreNational Payments Corporation of India handles 46% of the world's digital transactions. UPI alone processes 3,729 transactions per second. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-rs-1866-crore-productivity-bonus-for-railway-staff-2792634-2025-09-24",
      "headline": "Cabinet clears Rs 1,866 crore productivity bonus for railway staffRailway employees are in for festive cheer as the Union Cabinet has approved a productivity-linked bonus, benefiting lakhs of staff members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-have-two-credit-cards-here-is-what-you-need-to-know-2792617-2025-09-24",
      "headline": "Should you have two credit cards? Here's what you need to knowCredit card usage is on the rise in India, and many people are wondering if having a second card makes sense. From rewards to financial flexibility, here's what you should know before applying for another card."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-386-points-lower-nifty-below-25100-tata-motors-bel-among-top-losers-2792602-2025-09-24",
      "headline": "Sensex, Nifty end lower as profit booking continues; Tata Motors falls over 2%The S&P BSE Sensex fell 386.47 points to 81,715.63, while the NSE Nifty50 lost 112.60 points to close at 25,056.90. Broader market indices also ended lower, with sectoral breadth largely negative, except for pharma stocks, which managed modest gains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cashless-health-insurance-claim-rejection-key-reasons-explained-2792600-2025-09-24",
      "headline": "Why your cashless insurance claim isn't always 'cashless'Cashless claims promise convenience, but long delays, unclear policies, and unjust deductions often leave patients stressed. Understanding your rights and navigating the system proactively can prevent financial and medical headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-scss-ssy-are-small-saving-scheme-interest-rates-set-to-change-sukanya-samriddhi-yojana-public-provident-fund-2792534-2025-09-24",
      "headline": "PPF, SCSS, SSY: Are Small Saving Scheme interest rates set to change?As the September 30 announcement approaches, savers are wondering if interest rates on popular small saving schemes like PPF, SCSS, and Sukanya Samriddhi Yojana (SSY) will change. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-buy-gold-the-right-way-this-festive-season-2792466-2025-09-24",
      "headline": "How to buy gold the right way this festive seasonGold shopping is a festive tradition for many Indian families, but with rising prices and endless options, making the right choice can feel tricky. Here's how you can buy gold the right way this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-us-h1b-visa-fee-hike-trump-tariff-remittance-money-send-india-2792464-2025-09-24",
      "headline": "H-1B crackdown cracks the rupee. Know why INR hit an all-time lowEconomists estimate that remittances, the money Indians abroad send back, could drop by around $400 million. For a country that relies on foreign money flowing in, that's significant."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rihanna-asap-rocky-welcome-third-child-reveal-name-2792918-2025-09-25",
      "headline": "Rihanna and ASAP Rocky announce birth of third child, reveal baby's name Singer Rihanna and her partner, ASAP Rocky, announce the birth of their third child. The couple shared the first image of their child on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/slow-horses-5-review-an-engaging-spy-series-on-online-hate-radicalisation-2792874-2025-09-25",
      "headline": "Slow Horses 5 review: An engaging spy thriller on online hate, radicalisationRelease Date:Wed Sep 24, 2025 Slow Horses Season 5 series review: The fifth season of 'Slow Horses' on Apple TV + depicts Jackson Lamb and his team investigating shocking attacks in London. Is the espionage series worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-tears-up-child-actor-mother-gives-speech-at-idli-kadai-event-watch-2792917-2025-09-25",
      "headline": "Dhanush tears up as child actor's mother gives speech at Idli Kadai event. Watch Dhanush got teary-eyed at the 'Idli Kadai' event in Madurai after the child actor's mother paid tribute to him while praising his acting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/pawan-kalyan-they-call-him-og-review-gangster-drama-sujeeth-thaman-2792870-2025-09-25",
      "headline": "They Call Him OG review: Pawan Kalyan lifts predictable film with unmatched auraRelease Date:Thu Sep 25, 2025 They Call Him OG movie review: Director Sujeeth's 'They Call Him OG' is a fan-service to Power Star Pawan Kalyan. The gangster drama, with a Japanese connection, has redundant ideas but is lifted by rousing elevation sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/salman-khan-aamir-khan-too-much-with-kajol-twinkle-khanna-divorce-fatherhood-expectations-2792719-2025-09-24",
      "headline": "Salman on fatherhood, Aamir on divorce: How superstars made Two Much too much Excited for 'Two Much with Kajol and Twinkle' premiere? From embracing fatherhood to bonding after divorce, here's a glimpse into the candid revelations made by superstars Aamir and Salman Khan on the talk show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-last-film-roi-roi-binale-musical-love-story-fans-will-love-it-says-wife-garima-saikia-garg-2792759-2025-09-24",
      "headline": "Zubeen Garg's last film is a musical love story and fans will love it, says wife Late singer Zubeen Garg's wife, Garima, shared her resolve to complete his last film 'Roi Roi Binale'. Despite the sadness of his death, she is dedicated to honouring his legacy and fulfilling his unfinished work for his fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/shah-rukh-khans-national-award-for-jawan-three-decades-too-late-2792721-2025-09-24",
      "headline": "Shah Rukh Khan's National Award for Jawan: Three decades too late? Shah Rukh Khan wins his first National Award in 2025 for 'Jawan'. More than a single performance, the honour marks a long-overdue recognition of SRK's three-decade legacy, iconic films, and unmatched cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-reacts-to-anurag-kashyap-vikramaditya-motwanes-ai-criticism-2792722-2025-09-24",
      "headline": "Sunny Leone reacts to Anurag Kashyap, Vikramaditya Motwane's AI criticism Actor Sunny Leone recently addressed the concerns around the use of artificial intelligence (AI) in cinema. She also highlighted the relevance of AI-driven cinema in the entertainment industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-anurag-kashyap-follow-saiyaara-playbook-for-nishaanchi-leads-aaishvary-thackeray-2792709-2025-09-24",
      "headline": "Exclusive: Did Anurag Kashyap follow Saiyaara playbook for Nishaanchi leads? In an exclusive chat with India Today, filmmaker-actor Anurag Kashyap revealed why he kept newcomers away from interviews ahead of 'Nishaanchi's' release. He praised Aaishvary Thackeray's impressive debut while brushing aside nepotism concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-anniversary-post-paris-2792604-2025-09-24",
      "headline": "Parineeti Chopra's playful anniversary wish for Raghav Chadha has a Paris twist Actor Parineeti Chopra wished her politician husband, Raghav Chadha, on their second wedding anniversary with a dash of humour. The reference to Paris in their social media post was unmissable. Check it out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-manoj-kumar-sharma-is-family-stood-by-me-at-national-film-awards-2792663-2025-09-24",
      "headline": "Vikrant Massey: Manoj Kumar Sharma is family, stood by me at National Awards Vikrant Massey's Best Actor win for '12th Fail' at the 71st National Film Awards was a heartfelt celebration shared with the real-life IPS officer, Manoj Kumar Sharma, who inspired the film. The actor, while rooted in portraying the common man, told us that he is eager to explore diverse roles and entertain audiences in new ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/urmila-jevliya-wins-rs-kbc-17-strategic-play-amitabh-bachchan-cricket-joke-indi-pakistan-2792517-2025-09-24",
      "headline": "KBC 17: Amitabh Bachchan jokes about Pakistanis smashing TVs after losing to India In the latest episode of 'Kaun Banega Crorepati 17', host Amitabh Bachchan entertained all with a joke about Pakistani fans after a cricket match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-enjoy-london-outing-with-son-akaay-viral-pics-2792633-2025-09-24",
      "headline": "Anushka Sharma, Virat Kohli enjoy London outing with son Akaay. See viral pics Anushka Sharma and Virat Kohli, who have been staying in London lately, were clicked enjoying strolling on the streets. The couple was accompanied by their son, Akaay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-one-piece-season-2-loguetown-grand-line-new-adventures-2026-2792383-2025-09-24",
      "headline": "One Piece Season 2: First look at Loguetown out crew sets sail for Grand Line Netflix teases new locations for 'One Piece' Season 2, beginning with Loguetown. Official synopsis highlights peril and discovery in the Grand Line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/honoured-to-share-national-award-with-shah-rukh-khan-hes-a-legend-actor-vikrant-massey-to-india-today-2792621-2025-09-24",
      "headline": "Vikrant Massey on National Award win: To be mentioned in same breath as SRK... Vikrant Massey celebrated his first National Award for '12th Fail', calling it a \"dream\" to share the honour with Shah Rukh Khan, who also won his first for 'Jawan'. The actor recalled a heartfelt moment with SRK and Rani Mukerji as they cherished their medals together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-leone-ai-film-kaur-vs-kore-first-indian-ai-powered-feature-film-2792597-2025-09-24",
      "headline": "Exclusive: Sunny Leone sets trend with AI-driven feature film 'Kaur vs KORE' Sunny Leone is set to star in 'Kaur vs KORE', a pioneering AI-powered film. The movie blends futuristic technology with human emotions and highlights digital safety concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/main-hoon-nas-amrita-rao-recalls-shah-rukh-khans-advice-on-choosing-films-2792458-2025-09-24",
      "headline": "Main Hoon Na's Amrita Rao recalls Shah Rukh Khan's advice on choosing films Actor Amrita Rao shared valuable career advice she received from Shah Rukh Khan. She said on a recent podcast that the actor's philosophy guided her selective approach to signing films. What was his advice? Read on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-akaza-anime-backstories-2792169-2025-09-24",
      "headline": "How humanised backstories of demons made Demon Slayer a global hit Demon Slayer: Infinity Castle Part 1 – Akaza Returns' has become a global blockbuster, and one key reason is that it demonstrates not only the Demon Slayers' strength but also how demons reflect human vices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-restored-version-premiere-in-sydney-with-original-ending-as-centrepiece-2792545-2025-09-24",
      "headline": "Sholay restored version to premiere in Sydney with original ending as centrepiece The newly restored version of 'Sholay' will be screened as centrepiece at The Indian Film Festival of Sydney. The restoration includes the original ending and involved archival discoveries in London and Mumbai."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-bcci-pcb-icc-complaint-haris-rauf-sahibzada-farhan-suryakumar-yadav-2792902-2025-09-25",
      "headline": "BCCI complains to ICC against Pak players' gestures. PCB protests against SuryaThe BCCI has launched a complaint against Haris Rauf and Sahibzada Farhan for their provocative gestures during the India vs Pakistan Super 4s clash in the Asia Cup 2025. PCB have also lodged a protest against India captain Suryakumar Yadav for his remark on the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-mumbai-conclave-2025-devendra-fadnavis-politics-bollywood-business-2792786-2025-09-25",
      "headline": "Maximum City, Maximum Ideas: India Today Mumbai Conclave kicks off todayThe India Today Conclave, now in its 23rd year, will see the political, entrepreneurial, and intellectual elite shed light on India's position on the global stage and speak on some of the pressing issues of the day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/triple-sabotage-trump-orders-secret-service-to-probe-sinister-un-mishaps-glbs-2792876-2025-09-25",
      "headline": "Triple sabotage: Trump orders Secret Service to probe 'sinister' UN mishapsAfter encountering a stalled escalator, teleprompter failure, and faulty sound at the UN, Trump claimed the technical snags were deliberate sabotage and ordered the Secret Service to investigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonam-wangchuk-ladakh-statehood-protest-violence-bjp-u-turns-joblessness-youth-frustration-2792833-2025-09-24",
      "headline": "Activist Sonam Wangchuk says BJP U-turns, job crisis fuelled Ladakh violenceCalling it one of the \"saddest days\" of his life, activist Sonam Wangchuk said the violent turn in Ladakh's protests reflected years of pent-up anger among local youth over jobs, autonomy and broken promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/pawan-kalyan-they-call-him-og-review-gangster-drama-sujeeth-thaman-2792870-2025-09-25",
      "headline": "They Call Him OG review: Pawan Kalyan lifts predictable film with unmatched auraRelease Date:Thu Sep 25, 2025They Call Him OG movie review: Director Sujeeth's 'They Call Him OG' is a fan-service to Power Star Pawan Kalyan. The gangster drama, with a Japanese connection, has redundant ideas but is lifted by rousing elevation sequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-upholds-hindu-succession-act-property-passing-husbands-heirs-2792909-2025-09-25",
      "headline": "When Hindu woman marries, her 'gotra' changes: Supreme Court in succession caseThese remarks came while the top court was hearing a plea challenging Section 15(1)(b) of the Hindu Succession Act, 1956, which provides that when a Hindu woman dies intestate, her property passes to her husband's heirs if she leaves no husband or children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-man-california-varun-suresh-kills-sex-offender-after-finding-name-in-database-says-victim-deserved-to-die-2792894-2025-09-25",
      "headline": "India man kills sex offender in US, tells cops he wanted to kill one for yearsVarun Suresh, who was charged with murder on Monday, told police during questioning that all sex offenders \"deserved to die\" and wanted to kill one for a very long time, as per court documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-energy-secretary-chris-wright-russian-oil-imports-glbs-2792872-2025-09-25",
      "headline": "Don't want to punish India, but…: US Energy Secretary on Russian oil importsUS Energy Secretary Chris Wright urged India to avoid Russian oil, citing moral and strategic concerns, while emphasizing alternatives and opportunities for deeper energy cooperation between Washington and New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/slow-horses-5-review-an-engaging-spy-series-on-online-hate-radicalisation-2792874-2025-09-25",
      "headline": "Slow Horses 5 review: An engaging spy thriller on online hate, radicalisationRelease Date:Wed Sep 24, 2025Slow Horses Season 5 series review: The fifth season of 'Slow Horses' on Apple TV + depicts Jackson Lamb and his team investigating shocking attacks in London. Is the espionage series worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pmo-push-puts-long-pending-drdo-revamp-back-on-track-2792652-2025-09-24",
      "headline": "PMO push puts long-pending DRDO revamp back on trackThe restructuring of DRDO into a leaner and strategically agile institution is being led by a senior PMO official. Deadline: the 68th Foundation Day on January 1, 2026\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-blames-activist-sonam-wangchuk-for-ladakh-violence-says-his-provocative-speeches-incited-mob-2792816-2025-09-24",
      "headline": "Sonam Wangchuk's provocative statements led to Ladakh violence: GovernmentAt least four people were killed and more than 60 others were injured as protests held in Leh by demonstrators demanding statehood for Ladakh turned violent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-acknowledges-turbulence-but-stresses-positive-trajectory-in-ties-with-india-glbs-2792886-2025-09-25",
      "headline": "Hot and cold moments, but US says ties with India on positive trajectoryUS-India ties face short-term turbulence amid trade and energy disputes, but officials stress strong personal diplomacy, high-level engagement, and a positive long-term trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-loses-10kg-ahead-odi-return-australia-2792772-2025-09-24",
      "headline": "Rohit Sharma sheds 10kg: Abhishek Nayar reveals stunning ODI comeback lookAhead of his return to international cricket, Rohit Sharma has been working hard on his fitness. Training under former India assistant coach Abhishek Nayar, the 38-year-old has shed around 10 kilograms through intensive sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/clash-in-gujarat-during-garba-over-online-post-stones-thrown-vehicles-torched-2792895-2025-09-25",
      "headline": "Clash in Gujarat during garba over online post, stones thrown, vehicles torchedWhat began as a dispute over a social media status quickly escalated during Garba celebrations, resulting in stone pelting and a stampede. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-baba-on-the-run-why-india-continues-to-trust-spiritual-charlatans-delhi-ashram-chief-2792638-2025-09-24",
      "headline": "Another Baba on the Run: Why India continues to trust spiritual charlatansDespite repeated scandals, fake babas retain vast followings fueled by societal fear, hope, and political protection, challenging India's spiritual fabric."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/leh-protests-ladakh-statehood-sixth-schedule-bjp-office-torched-reason-gen-z-delay-statehood-explained-2792643-2025-09-24",
      "headline": "What sparked Gen Z protests in Ladakh? Explained in 5 pointsThe agitation for Ladakh's statehood and inclusion in the Sixth Schedule in the capital Leh turned violent on Wednesday. Four people were killed and over 60 injured. This came even as protesters torched a BJP office and a CRPF van. Activist Sonam Wangchuk has called the protests a \"Gen Z revolution\". The BJP has slammed the Congress for the chaos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-gets-trolled-for-interrupting-janhvi-kapoor-ai-remark-2789575-2025-09-18",
      "headline": "Varun Dhawan gets trolled for interrupting Janhvi Kapoor's AI remark: DisrespectfulAt the trailer launch of 'Sunny Sanskari Ki Tulsi Kumari', Janhvi Kapoor spoke about the misuse of AI-generated images, but Varun Dhawan interrupted her with a joke, sparking backlash online. Social media users criticised Varun for being \"disrespectful\" and diverting attention from a serious issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mohsin-naqvi-fighter-jet-2792836-2025-09-24",
      "headline": "After Haris Rauf, PCB chief uses Ronaldo video to signal jet-downing gesturePakistan Cricket Board chief Mohsin Naqvi took to X to mock India just days after the India vs Pakistan clash in Asia Cup. Naqvi shared a video of Cristiano Ronaldo which insinuated the controversial fighter-jet gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-sambit-patra-congress-leader-rahul-gandhi-questioning-up-law-banning-caste-based-protests-2792849-2025-09-24",
      "headline": "His father was against it, he wants caste-based protests: BJP slams Rahul GandhiRahul Gandhi criticised the UP government's move, saying that caste-based protests are prohibited in the state while backward and marginalised communities continue to lack adequate participation in public life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/indian-air-forces-mig-21-set-for-final-flight-a-sky-ruler-in-the-1965-and-1971-wars-2792865-2025-09-25",
      "headline": "Indian Air Force's MiG-21 set for final flight: A sky ruler in the 1965 and 1971 warsThe MiG-21, which served the Indian Air Force for over six decades, is preparing for its final flight. Known for its role in the 1965 and 1971 wars, the aircraft became a symbol of India's air power. Here's the journey of the legendary fighter jet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/shah-rukh-khans-national-award-for-jawan-three-decades-too-late-2792721-2025-09-24",
      "headline": "Shah Rukh Khan's National Award for Jawan: Three decades too late?Shah Rukh Khan wins his first National Award in 2025 for 'Jawan'. More than a single performance, the honour marks a long-overdue recognition of SRK's three-decade legacy, iconic films, and unmatched cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/where-have-goa-coconuts-integral-to-its-famed-fish-curry-gone-2792666-2025-09-24",
      "headline": "Where have Goa coconuts, integral to its famed fish curry, gone?The drastic fall in output is being attributed to pest infestations, destruction of the crop by monkeys and plantations past their prime\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jimmy-kimmel-triumphs-on-late-night-with-record-ratings-amid-trump-controversy-glbs-2792881-2025-09-25",
      "headline": "Jimmy Kimmel triumphs on late night with record ratings amid Trump controversyJimmy Kimmel returned to late night after a week-long suspension, drawing 6.26 million viewers. He addressed backlash over his Charlie Kirk remarks, defended political satire, and poked fun at Trump.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-trump-to-meet-pakistan-pm-sharif-thursday-bilateral-talks-glbs-2792880-2025-09-25",
      "headline": "Trump expected to meet Pakistan PM Sharif Thursday for bilateral talksUS President Donald Trump is expected to meet Pakistani Prime Minister Shehbaz Sharif at the White House on Thursday. The meeting follows a recent trade deal, highlighting warming US-Pakistan relations amid regional tensions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-squad-announcement-live-updates-press-conference-ajit-agarkar-shubman-gill-2792923-2025-09-25",
      "headline": "IND vs WI Test Squad Live: Ajit Agarkar to address presser at 12:30 pm India vs West Indies Test Squad Live Updates: The India squad announcement for their upcoming Test series vs West Indies was postponed from September 24 to September 25. Chief selector Ajit Agarkar will address a press conference at 11 am local time in Dubai and 12:30 pm IST. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-suryakumar-yadav-bat-higher-india-vs-bangladesh-sunil-gavaskar-suggests-2792921-2025-09-25",
      "headline": "Suryakumar Yadav should have batted higher, needed runs vs Bangladesh: Sunil Gavaskar Sunil Gavaskar has urged Suryakumar Yadav to prioritise runs over experiments after India's Super 4 clash against Bangladesh. While India's unbeaten streak continued, the captain's batting struggles have raised concerns ahead of the Asia Cup final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-fielding-woes-t-dilip-under-fire-2792916-2025-09-25",
      "headline": "Pressure on fielding coach T Dilip as India become worst catching side in Asia Cup India may have stormed into the Asia Cup final, but their sloppy fielding has left a cloud over their campaign. With 12 dropped catches already, the pressure is firmly on fielding coach T Dilip to sharpen standards before mistakes cost India dearly in bigger, high-stakes contests ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-bcci-pcb-icc-complaint-haris-rauf-sahibzada-farhan-suryakumar-yadav-2792902-2025-09-25",
      "headline": "BCCI complains to ICC against Pak players' gestures. PCB protests against Surya The BCCI has launched a complaint against Haris Rauf and Sahibzada Farhan for their provocative gestures during the India vs Pakistan Super 4s clash in the Asia Cup 2025. PCB have also lodged a protest against India captain Suryakumar Yadav for his remark on the Pahalgam attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-final-suryakumar-yadav-form-struggles-2792890-2025-09-25",
      "headline": "Captaincy weighing down Suryakumar Yadav? Pressure rises after mediocre Asia Cup Asia Cup, India vs Bangladesh: Captain Suryakumar Yadav has marshalled his troops admirably, guiding India into the final, but he has struggled for consistency with the bat in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-mohanlal-sanjay-manjrekar-interview-2792860-2025-09-25",
      "headline": "Watch: Sanju Samson turns to Mohanlal analogy to answer tough batting question Asia Cup 2025: Sanju Samson drew inspiration from Malayalam superstar Mohanlal to explain the importance of versatility in India's ever-competitive set-up. Speaking during the Asia Cup, Samson cleverly used the actor's ability to play varied roles as an analogy for adapting to batting order changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-sunil-gavaskar-india-batting-order-experiments-suryakumar-shot-selection-2792858-2025-09-25",
      "headline": "IND vs BAN: Sunil Gavaskar questions India's batting order experiments Legendary Indian batter Sunil Gavaskar, speaking to India Today from Dubai, questioned the team management's decision to send Shivam Dube ahead of captain Suryakumar Yadav in the Super 4 clash against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-match-report-abhishek-sharma-bumrah-2792844-2025-09-24",
      "headline": "Sluggish India still too strong for Bangladesh in Super 4, storm into final India might not have been at their best, but still proved too strong for Bangladesh in the Super 4 for Asia Cup 2025. The result forced Bangladesh into a virtual knockout against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mohsin-naqvi-fighter-jet-2792836-2025-09-24",
      "headline": "After Haris Rauf, PCB chief uses Ronaldo video to signal jet-downing gesture Pakistan Cricket Board chief Mohsin Naqvi took to X to mock India just days after the India vs Pakistan clash in Asia Cup. Naqvi shared a video of Cristiano Ronaldo which insinuated the controversial fighter-jet gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-second-successive-fifty-asia-cup-india-bangladesh-super-4-2792820-2025-09-24",
      "headline": "Abhishek Sharma smashes 37-ball 75, goes past mentor Yuvraj Singh in elite list Super 4: Abhishek Sharma smashed his second consecutive fifty in the Asia Cup against Bangladesh. He scored a fifty in 25 balls or fewer for the fifth time in his nascent career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/after-gill-abhishek-yuvraj-singh-trains-prabhsimran-singh-priyansh-arya-2792793-2025-09-24",
      "headline": "After Gill-Abhishek's success, Yuvraj trains Prabhsimran Singh, Priyansh Arya Legendary India all-rounder Yuvraj Singh was spotted training Punjab Kings batters Priyansh Arya and Prabhsimran Singh. Yuvraj earlier trained Shubman Gill and Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-sunil-gavaskar-india-batting-order-experiments-suryakumar-shot-selection-2792858-2025-09-25",
      "headline": "IND vs BAN: Sunil Gavaskar questions India's batting order experiments Legendary Indian batter Sunil Gavaskar, speaking to India Today from Dubai, questioned the team management's decision to send Shivam Dube ahead of captain Suryakumar Yadav in the Super 4 clash against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-match-report-abhishek-sharma-bumrah-2792844-2025-09-24",
      "headline": "Sluggish India still too strong for Bangladesh in Super 4, storm into final India might not have been at their best, but still proved too strong for Bangladesh in the Super 4 for Asia Cup 2025. The result forced Bangladesh into a virtual knockout against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-mohsin-naqvi-fighter-jet-2792836-2025-09-24",
      "headline": "After Haris Rauf, PCB chief uses Ronaldo video to signal jet-downing gesture Pakistan Cricket Board chief Mohsin Naqvi took to X to mock India just days after the India vs Pakistan clash in Asia Cup. Naqvi shared a video of Cristiano Ronaldo which insinuated the controversial fighter-jet gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-second-successive-fifty-asia-cup-india-bangladesh-super-4-2792820-2025-09-24",
      "headline": "Abhishek Sharma smashes 37-ball 75, goes past mentor Yuvraj Singh in elite list Super 4: Abhishek Sharma smashed his second consecutive fifty in the Asia Cup against Bangladesh. He scored a fifty in 25 balls or fewer for the fifth time in his nascent career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/after-gill-abhishek-yuvraj-singh-trains-prabhsimran-singh-priyansh-arya-2792793-2025-09-24",
      "headline": "After Gill-Abhishek's success, Yuvraj trains Prabhsimran Singh, Priyansh Arya Legendary India all-rounder Yuvraj Singh was spotted training Punjab Kings batters Priyansh Arya and Prabhsimran Singh. Yuvraj earlier trained Shubman Gill and Abhishek Sharma."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}