{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-energy-solutions-downplays-kenya-scrapping-736-million-power-deal-no-material-impact-2639242-2024-11-24",
      "headline": "Adani firm downplays Kenya scrapping $736 million power deal: No material impactAdani Energy Solutions said there was \"no material impact\" on the company's operations after Kenya cancelled a $736 million transmission line project over Gautam Adani's indictment in a bribery case in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reaction-bjp-led-mahayuti-win-maharashtra-will-it-lead-to-maha-rally-on-dalal-street-expert-view-2639133-2024-11-24",
      "headline": "BJP-led Mahayuti win Maharashtra: Will it lead to 'maha' rally on Dalal Street?The results of the Maharashtra assembly election, announced on Saturday, are expected to have a notable impact on the stock markets when trading resumes on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-gets-richer-wealth-hits-all-time-high-tesla-shares-surge-spacex-xai-usd-70-billion-addition-2638737-2024-11-23",
      "headline": "Elon Musk gets even richer after wealth hits all-time high post Trump winThe jump in Elon Musk's fortune came after Tesla shares rose 3.8% on Friday, reaching a 3.5-year closing high of $352.56 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-jeff-bezos-tesla-stock-space-x-us-electiosn-donald-trump-2638708-2024-11-23",
      "headline": "Jeff Bezos denies Musk's claim on Tesla stock advice: '100% not true'Elon Musk said on social media platform X that Bezos had advised people to sell their Tesla and SpaceX shares, predicting Donald Trump's electoral defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-founder-told-us-ally-to-flee-the-us-to-avoid-testifying-report-2637906-2024-11-22",
      "headline": "Byju's founder told US ally to flee the US to avoid testifying: ReportThe businessman, William R. Hailer, testified before US Bankruptcy Judge John T. Dorsey, alleging that Byju Raveendran offered him a lucrative job and sent him a $10,700 plane ticket to Dubai just two days before he was scheduled to testify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-today-sensex-2000-points-nifty-above-23900-2637809-2024-11-22",
      "headline": "Sensex ends nearly 2,000 points higher, Nifty above 23,900A broad-based recovery in information technology (IT), financial, banking and energy stocks spearheaded the recovery. A sharp rebound in Adani Group stocks also added to the positive momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-2000-points-key-factors-adani-shares-2637775-2024-11-22",
      "headline": "Sensex surges 2,000 points, Rs 7 lakh crore added: 4 key factors behind rallyThe Sensex was up 2039.44 points to 79,195.23 at 2:57 pm, while the NSE Nifty50 gained 587.90  to 23,938.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-high-within-touching-distance-of-100000-dollar-milestone-2637714-2024-11-22",
      "headline": "Bitcoin hits record high, within touching distance of $100,000 milestoneThe world's leading cryptocurrency topped $99,300, coming within striking distance of the psychological milestone that many experts had anticipated after the US election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-1200-points-nifty-3-things-to-know-stock-market-bull-run-2637706-2024-11-22",
      "headline": "Sensex jumps 1,200 points: 3 things to know about today's stock market bull runThe BSE Sensex climbed 1,193.90 points to cross 78,340.07, while the NSE Nifty advanced 371.50 points to reach 23,721.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-rises-1000-points-nifty-rebounds-adani-stocks-in-green-2637683-2024-11-22",
      "headline": "Sensex jumps over 1,000 points as most Adani Group stocks rebound sharplyStock market today: The S&P BSE Sensex climbed 1,034.76 points to 78,190.55 by 12:42 pm, while the NSE Nifty50 gained 329.15 points to reach 23,679.05. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-accused-of-racial-discrimination-at-australian-coal-mining-unit-2637668-2024-11-22",
      "headline": "Adani Group accused of racial discrimination at Australian coal mining unitAdani Bribery Case: The Nagana Yarrbayn Wangan & Jagalingou Cultural Custodians in Queensland state filed a complaint alleging serious racial discrimination by Bravus Mining and Resources, an Adani Group unit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-bribery-case-sp-lowers-outlook-on-3-adani-units-raises-funding-concerns-2637623-2024-11-22",
      "headline": "Adani bribery case: S&P lowers outlook on 3 Adani units, raises funding concernsGautam Adani Case: S&P expressed concerns that the accusations could erode investor confidence, impair funding access, and escalate borrowing costs for the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-listing-stock-market-debut-investors-hold-or-exit-2637602-2024-11-22",
      "headline": "Zinka Logistics makes tepid market debut: Should investors hold or exit?Zinka Logistics listing: Shares listed at Rs 280.90 on the National Stock Exchange (NSE), a 2.89% premium to the issue price of Rs 273. On the Bombay Stock Exchange (BSE), the stock opened at Rs 279.05, reflecting a 2.22% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-layoffs-500-employees-restructuring-drive-sales-profitability-2637591-2024-11-22",
      "headline": "Ola Electric layoffs: 500 employees likely to lose jobs amid restructuringOla Electric Layoffs News: The move aims to streamline operations, eliminate redundant roles, and enhance profitability. The restructuring process, which began months ago, is expected to conclude by December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-22-2024-precious-metals-record-hike-on-mcx-2637583-2024-11-22",
      "headline": "Gold, silver price today, November 22, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-fall-second-straight-day-bribery-charges-check-top-losers-2637582-2024-11-22",
      "headline": "Adani Group stocks extend slide amid bribery charges. Details hereAdani Group stocks: This marks the second consecutive session of heavy losses for the conglomerate, with Thursday's rout wiping out Rs 2.25 lakh crore from the group's market capitalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sagar-adani-gautam-adani-group-bribery-case-bribe-notes-indictment-solar-energy-corruption-2637574-2024-11-22",
      "headline": "How Sagar Adani's 'bribe notes' unravelled $250 million schemeAdani Bribery Case: At the heart of the complex bribery scheme for which Gautam Adani and his associates have been indicted are the industrialist's nephew Sagar Adani and the detailed \"bribe notes\" he kept on his mobile phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-jump-3-percent-today-after-brokerage-bernsteins-update-should-you-buy-2637570-2024-11-22",
      "headline": "Paytm shares jump 3% today after brokerage Bernstein's update. Should you buy?Paytm share price: With shares up 34% this year and 136% in six months, Paytm's growth potential continues to attract investor interest, although challenges remain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-bounce-back-despite-adani-stocks-enterprises-green-ports-triggering-sell-off-2637558-2024-11-22",
      "headline": "Sensex, Nifty bounce back; Adani Energy shares down 5%Stock Market Today: The S&P BSE Sensex was up 496.10 points to 77,651.89, while the NSE Nifty50 gained 72.25 points to 23,422.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-adani-green-airtel-lti-jsw-zinka-stocks-to-watch-today-2637523-2024-11-22",
      "headline": "Adani Enterprises, Adani Green, Airtel, LTI, JSW, Zinka: Stocks to watch todayBroader market indices also faced selling pressure, with volatility surging across sectors. As trading opens today, several stocks are expected to remain in focus due to recent developments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/hemant-soren-submits-resignation-jharkhand-governor-oath-taking-2639285-2024-11-24",
      "headline": "Hemant Soren stakes claim to form government, oath likely on November 28Hemant Soren submits resignation to Jharkhand Governor, stakes claim to form government, oath likely on Nov 28"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-election-mahayuti-alliance-ncp-shiv-sena-bjp-eknath-shinde-devendra-fadnavis-2639180-2024-11-24",
      "headline": "Who will be Maharashtra Chief Minister? Mahayuti key meets today amid suspense Mahayuti alliance partners are holding crucial meetings today with newly elected MLAs to elect their legislative party leaders, which will be followed by an alliance meeting on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-live-updates-day-1-sold-unsold-full-squads-csk-rcb-dc-mi-rr-gt-kkr-pbks-srh-lsg-jeddah-2639176-2024-11-24",
      "headline": "Day 1 Live: Rishabh Pant to LSG for most expensive 27 cr bidIPL Mega Auction Day 1 Live Updates: Shreyas Iyer becomes the mostr expensive player in IPL histroy as PBKS rope him in for Rs 26.75 crore held by Mitchell Starc. The IPL 2025 mega auction kicked off with Arshdeep Singh going to PBKS, who use RTM for the pacer for Rs 18 crore after a bidding war with SRH."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/clashes-in-ups-sambhal-over-mosque-survey-cops-fire-tear-gas-shells-2639107-2024-11-24",
      "headline": "3 killed as mob opposing mosque survey clashes with police in UP's SambhalA complaint, filed by Supreme Court lawyer Vishnu Shankar Jain, claimed that Mughal emperor Babar demolished a temple, Hari Har Mandir, which once stood at the site of the Shahi Masjid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/rent-crisis-grips-india-landlords-bend-rules-employ-tricks-threats-delhi-noida-bengaluru-flats-broker-2637989-2024-11-24",
      "headline": "Rent crisis grips India as landlords bend rules, employ tricks and threatsHouse rents, stagnant since the pandemic, started zooming from mid-2023 by up to 50%, and are still surging. Even after a year, house rents haven't stabilised, and landlords are shortening agreement duration and issuing eviction threats for further unusual rent hikes. This has added to anxiety and agony among tenants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-assembly-election-mva-congress-maha-vikas-aghadi-shiv-sena-uddhav-thackeray-sharad-pawar-2639228-2024-11-24",
      "headline": "INDIA allies didn't help each other: Congress leader after Maharashtra poll lossCongress leader G Parmeshwar said that MVA's crushing defeat in the Maharashtra Assembly elections was due to lack of cooperation among the partners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-shreyas-iyer-becomes-most-expensive-player-sold-to-punjab-kings-2639277-2024-11-24",
      "headline": "Shreyas Iyer becomes most expensive player, sold to Punjab for Rs 26.75 croreIPL 2025: Middle-order batter Shreyas Iyer became the most expensive player ever in an IPL auction during the mega auction in Jeddah, Saudi Arabia on Sunday. The bidding war was nothing short of a spectacle, showcasing intense competition among franchises eager to secure the services of the prolific cricketer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jds-future-looks-bleak-as-dewe-gowda-launches-another-nikhil-kumaraswamy-dud-opinion-2639135-2024-11-24",
      "headline": "JDS future looks bleak as Gowda launches another Nikhil dudFormer PM HD Deve Gowda's bid to launch grandson Nikhil Kumaraswamy's political career failed, marking Nikhil's third defeat in five years, losing Channapatna to Congress veteran CP Yogeshwar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-anushka-sharma-flying-kiss-2639241-2024-11-24",
      "headline": "Watch: Kohli gives flying kiss to Anushka Sharma after Perth Test hundred AUS vs IND: Virat Kohli scored his 30th Test hundred as India declared their innings at 487 for six, setting Australia a target of 534 at the Optus Stadium in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-perth-test-day-3-report-virat-jaiswal-hundred-australia-target-india-top-2639247-2024-11-24",
      "headline": "Virat Kohli 100, Yashasvi Jaiswal 161 deflate Australia as India smell victoryBorder-Gavaskar Trophy: India ended Day 3 of the opening Test against Australia firmly in control, with Virat Kohli's stylish century and Yashasvi Jaiswal's career-best 161 powering them to a commanding position. India set an imposing victory target of 534 and removed three Australian wickets in the final session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-mahayuti-next-cm-race-maratha-eknath-shinde-or-brahmin-devendra-fadnavis-2638994-2024-11-24",
      "headline": "Will Brahmin Fadnavis lose CM race to himself, and not Shinde?Devendra Fadnavis, a former Maharashtra Chief Minister, had to play the role of a deputy to Eknath Shinde for over two years. Fadnavis, a Brahmin, has emerged as the brightest star in BJP's stellar victory in the Assembly election. Will Fadnavis get the CM's chair, or will he lose the race to himself, and not Shinde?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/i-trust-ar-rahman-with-my-life-love-him-saira-in-new-statement-after-separation-2639227-2024-11-24",
      "headline": "I trust AR Rahman with my life, love him: Saira in new statement after separationAR Rahman's estranged wife Saira addressed the speculations and defamatory posts about the reason behind their separation in a new statement on Sunday. She expressed her love for Rahman, and requested everyone to provide privacy for the family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-police-constable-kiran-pal-killed-accused-encounter-govind-puri-2639200-2024-11-24",
      "headline": "Delhi cop stops men for patrol, stabbed to death; key accused killed in encounterConstable Kiran Pal was fatally stabbed by three suspects during a night patrol. While two of the accused were arrested, the third was shot dead in an encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-elections-2024-results-raj-thackerays-maharashtra-navnirman-sena-uddhav-shiv-sena-mumbai-eknath-shinde-2639132-2024-11-24",
      "headline": "How Raj Thackeray's party helped Uddhav Sena retain Mumbai in MaharashtraRaj Thackeray's Maharashtra Navnirman Sena candidates pulled away the votes from Eknath Shinde's Shiv Sena, allowing Uddhav Sena to maintain their stronghold in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/up-bypoll-election-result-kundarki-bjp-win-ramveer-thakur-muslim-dominant-evm-tampering-2638898-2024-11-23",
      "headline": "Hindu BJP candidate trounces 11 Muslims in UP. What led to his massive win?BJP candidate Ramveer Thakur secured a decisive victory in Kundarki, defeating 11 Muslim contenders, including Samajwadi Party's Haji Rizwan, by a margin of over 1 lakh votes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/ola-electric-customer-smashes-scooter-outside-showroom-in-viral-video-2639220-2024-11-24",
      "headline": "Furious Ola Electric customer smashes scooter outside showroom in viral videoA video of a furious Ola Electric customer thrashing his scooter with a hammer outside an Ola showroom has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-delayed-california-result-india-counted-640-million-votes-in-one-day-2639092-2024-11-24",
      "headline": "India counted 640 million votes in 1 day: Elon Musk on delayed California resultElon Musk On California Result: Elon Musk criticised California's delayed presidential election results, comparing them to India's efficient vote counting during the Lok Sabha elections. Kamala Harris was declared winner by US agencies in California, with an official announcement pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/gautam-adani-bribery-scheme-us-allegations-supreme-court-application-sebi-probe-hindenburg-madhabi-buch-2639217-2024-11-24",
      "headline": "US bribery case against Adani reaches Supreme Court, Sebi in the dockAfter Gautam Adani and his associates were charged in a bribery case in the US, a fresh application filed in the Supreme Court alleges shortcomings in the Sebi probe into the Adani Group and questions the market regulator's credibility."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-virat-kohli-reaction-perth-test-hundred-anushka-sharma-retirement-critics-2639240-2024-11-24",
      "headline": "Virat Kohli reacts to critics: 'Don't want to hang around for the sake of it' Border-Gavaskar Trophy: Virat Kohli was emotional after he ended his nearly 15-month-long wait for a Test hundred. Kohli thanked Anushka Sharma for her support and sent a message to his detractors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-says-sobhita-dhulipala-fills-void-in-me-we-will-marry-in-front-of-anr-statue-2639202-2024-11-24",
      "headline": "Naga Chaitanya says 'Sobhita fills void in me': We'll marry in front of ANR's statueActor Naga Chaitanya opened up on his plans to marry Sobhita Dhulipala in a traditional Telugu wedding ceremony on December 4. He also shared that the wedding would take place in front of his grandfather's statue in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hemant-soren-jmm-assembly-election-result-chief-minister-oath-ceremony-november-26-rahul-gandhi-kejriwal-mamata-banerjee-2639171-2024-11-24",
      "headline": "Hemant Soren's oath as Jharkhand Chief Minister on November 28: SourcesAccording to sources, the swearing-in ceremony on November 28 is expected to be attended by prominent leaders from the INDIA bloc, including Mamata Banerjee, Rahul Gandhi, Akhilesh Yadav, and Arvind Kejriwal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/justin-trudeau-taylor-swift-concert-dancing-viral-video-montreal-protests-riots-nato-anti-semitism-2639124-2024-11-24",
      "headline": "Video: Trudeau grooved at Taylor Swift concert while Montreal burnedCanadian Prime Minister Justin Trudeau has found himself at the centre of a social media storm after a viral video showed him dancing and singing along to music at a Taylor Swift concert in Toronto while anti-NATO protests erupted in Montreal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-cabinet-berths-demand-jharkhand-assembly-election-results-india-bloc-hemant-soren-jmm-exclusive-2639188-2024-11-24",
      "headline": "Congress to push for 4 Jharkhand cabinet berths after winning 16 seats: SourcesIn the Jharkhand assembly elections, the JMM secured 34 seats, the Congress 16, the RJD 4, and the CPI-ML 2, paving the way for a second consecutive term for the INDIA bloc alliance in the state.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/shalini-passi-earnings-from-fabulous-lives-go-to-charity-my-fees-support-village-2639283-2024-11-24",
      "headline": "Shalini Passi: Earnings from Fabulous Lives go to charity, my fees support villageShalini Passi was one of the guests at the Sahitya Aaj Tak event in Delhi, where she talked about working towards the welfare of underprivileged people, and taking steps to uplift women in real-life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahsaas-channa-child-artist-image-kabhi-alvida-na-kehna-tvf-half-ca-shah-rukh-khan-2639265-2024-11-24",
      "headline": "Ahsaas Channa credits child artist image for opportunities: Grateful for my journeyActor Ahsaas Channa, who began acting at an early age in Bollywood, spoke about breaking the child image. She reflected on the journey and shared how she will always be grateful for those films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/video/video-jubin-nautiyal-on-voice-modulation-allegations-marriage-plans-and-more-2639273-2024-11-24",
      "headline": "Video: Jubin Nautiyal on voice modulation allegations, marriage plans and more Singer Jubin Nautiyal addressed the voice modulation allegations that singers often face on Day 3 of Sahitya Aajtak 2024. He even spoke about his journey and marriage plans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-talks-about-finding-ray-of-sunshine-and-hope-amid-divorce-rumours-with-aishwarya-rai-bachchan-2639246-2024-11-24",
      "headline": "Abhishek Bachchan talks about finding ray of 'sunshine and hope' in difficult timesActor Abhishek Bachchan talked about finding the purpose of one's life, searching for the 'silver lining' and the 'ray of hope' while battling negativity in life. His statement comes amid speculation about his separation with actor Aishwarya Rai. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-auction-shreyas-iyer-becomes-most-expensive-player-sold-to-punjab-kings-2639277-2024-11-24",
      "headline": "Shreyas Iyer becomes most expensive player, sold to Punjab for Rs 26.75 croreIPL 2025: Middle-order batter Shreyas Iyer became the most expensive player ever in an IPL auction during the mega auction in Jeddah, Saudi Arabia on Sunday. The bidding war was nothing short of a spectacle, showcasing intense competition among franchises eager to secure the services of the prolific cricketer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mallika-sagar-whos-mallika-sagar-ipl-2025-auction-2639275-2024-11-24",
      "headline": "Mallika Sagar returns to IPL 2025 auction. Here's all you need to know about herAuctioneer Mallika Sagar is all set to conduct her second succesive IPL(Indian Premier League) auction. Here's all you need to know about the auction sensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/centurion-virat-kohli-repays-gautam-gambhirs-faith-after-ricky-ponting-jibe-2639276-2024-11-24",
      "headline": "Centurion Virat Kohli repays Gautam Gambhir's faith after Ricky Ponting jibeVirat Kohli repaid the faith shown in him by the head coach Gautam Gambhir. Kohli scored a brilliant hundred on Day 3 of the 1st Test between India and Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-arshdeep-singh-punjab-kings-18-crore-record-pacer-2639274-2024-11-24",
      "headline": "Arshdeep Singh becomes most expensive Indian pacer after PBKS use RTM IPL 2025 mega auction: Arshdeep Singh became the most expensive Indian fast bowler to be sold at the auction. Punjab Kings outbid SUnRisers Hyderabad to bring back the left-arm pacer to their franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-virat-kohli-tells-yashasvi-jaiswal-to-lead-team-off-field-2639268-2024-11-24",
      "headline": "Watch: Virat Kohli tells Yashasvi Jaiswal to lead India off field as Day 3 endsVirat Kohli won hearts as he told Yashasvi Jaiswal to lead India off the field after a fine Day 3 performance during the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-perth-test-day-3-report-virat-jaiswal-hundred-australia-target-india-top-2639247-2024-11-24",
      "headline": "Virat Kohli 100, Yashasvi Jaiswal 161 deflate Australia as India smell victoryBorder-Gavaskar Trophy: India ended Day 3 of the opening Test against Australia firmly in control, with Virat Kohli's stylish century and Yashasvi Jaiswal's career-best 161 powering them to a commanding position. India set an imposing victory target of 534 and removed three Australian wickets in the final session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-virat-kohli-reaction-perth-test-hundred-anushka-sharma-retirement-critics-2639240-2024-11-24",
      "headline": "Virat Kohli reacts to critics: 'Don't want to hang around for the sake of it' Border-Gavaskar Trophy: Virat Kohli was emotional after he ended his nearly 15-month-long wait for a Test hundred. Kohli thanked Anushka Sharma for her support and sent a message to his detractors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-anushka-sharma-flying-kiss-2639241-2024-11-24",
      "headline": "Watch: Kohli gives flying kiss to Anushka Sharma after Perth Test hundred AUS vs IND: Virat Kohli scored his 30th Test hundred as India declared their innings at 487 for six, setting Australia a target of 534 at the Optus Stadium in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohli-surpasses-sachin-tendulkar-to-hit-most-test-hundreds-2639232-2024-11-24",
      "headline": "Virat Kohli hits 7th Test hundred in Australia, surpasses Sachin in elite listVirat Kohli hit his 7th Test hundred in Australia on Day 3 of the 1st Test. He surpassed Sachin Tendulkar to hit most Test hundreds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-ding-liren-world-chess-championship-journey-india-dominance-arjun-erigisi-2639049-2024-11-24",
      "headline": "D Gukesh's journey to the World Chess Championship and the Ding clashIn a historic clash, India's D Gukesh faces China's Ding Liren in the World Chess Championship, marking a transformative moment for Asian chess and a new chapter in India's pursuit of global dominance in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-max-verstappen-wins-4th-straight-title-matches-vettels-record-at-red-bull-2639212-2024-11-24",
      "headline": "Max Verstappen wins 4th straight title, matches Vettel's record at Red BullRed Bull's Max Verstappen won his 4th world title in a row to match Sebastian Vettel's record at Red Bull. Verstappen won the driver's championship after finishing 5th in the Las Vegas GP on Saturday, 23 November."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-virat-kohli-reaction-perth-test-hundred-anushka-sharma-retirement-critics-2639240-2024-11-24",
      "headline": "Virat Kohli reacts to critics: 'Don't want to hang around for the sake of it' Border-Gavaskar Trophy: Virat Kohli was emotional after he ended his nearly 15-month-long wait for a Test hundred. Kohli thanked Anushka Sharma for her support and sent a message to his detractors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-perth-test-anushka-sharma-flying-kiss-2639241-2024-11-24",
      "headline": "Watch: Kohli gives flying kiss to Anushka Sharma after Perth Test hundred AUS vs IND: Virat Kohli scored his 30th Test hundred as India declared their innings at 487 for six, setting Australia a target of 534 at the Optus Stadium in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohli-surpasses-sachin-tendulkar-to-hit-most-test-hundreds-2639232-2024-11-24",
      "headline": "Virat Kohli hits 7th Test hundred in Australia, surpasses Sachin in elite listVirat Kohli hit his 7th Test hundred in Australia on Day 3 of the 1st Test. He surpassed Sachin Tendulkar to hit most Test hundreds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-ding-liren-world-chess-championship-journey-india-dominance-arjun-erigisi-2639049-2024-11-24",
      "headline": "D Gukesh's journey to the World Chess Championship and the Ding clashIn a historic clash, India's D Gukesh faces China's Ding Liren in the World Chess Championship, marking a transformative moment for Asian chess and a new chapter in India's pursuit of global dominance in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/f1-max-verstappen-wins-4th-straight-title-matches-vettels-record-at-red-bull-2639212-2024-11-24",
      "headline": "Max Verstappen wins 4th straight title, matches Vettel's record at Red BullRed Bull's Max Verstappen won his 4th world title in a row to match Sebastian Vettel's record at Red Bull. Verstappen won the driver's championship after finishing 5th in the Las Vegas GP on Saturday, 23 November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-anushka-sharma-elated-claps-for-virat-kohli-after-he-completes-fifty-in-perth-2639209-2024-11-24",
      "headline": "Watch: Anushka Sharma elated, claps for Virat Kohli after he completes fifty in PerthAnushka Sharma was in attendance on Day 3 of the 1st Test between India and Australia at Optus Stadium in Perth. She lauded Kohli as he completed his fifty in 94 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-virat-kohli-closes-in-on-sachin-tendulkar-with-fighting-fifty-in-perth-2639205-2024-11-24",
      "headline": "Virat Kohli closes in on Sachin Tendulkar with fighting fifty in PerthVirat Kohli returned to form with a fighting fifty in difficult conditions at the Perth Stadium on Sunday, November 24. Kohli closed in on legendary Sachin Tendulkar in an elite record."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-rohit-sharma-arrives-in-perth-to-join-indian-team-2nd-child-2639185-2024-11-24",
      "headline": "Watch: Rohit Sharma arrives in Perth to join Indian team after welcoming 2nd childRohit Sharma arrived in Australia as he landed in Perth on November 24, Sunday. The Indian captain left for Perth and was spotted at the Mumbai airport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-mega-auction-live-updates-day-1-sold-unsold-full-squads-csk-rcb-dc-mi-rr-gt-kkr-pbks-srh-lsg-jeddah-2639176-2024-11-24",
      "headline": "Day 1 Live: Shreyas Iyer goes to PBKS for 26.75 crore, the highest everIPL Mega Auction Day 1 Live Updates: Shreyas Iyer becomes the mostr expensive player in IPL histroy as PBKS rope him in for Rs 26.75 crore held by Mitchell Starc. The IPL 2025 mega auction kicked off with Arshdeep Singh going to PBKS, who use RTM for the pacer for Rs 18 crore after a bidding war with SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohlis-dangerous-upper-cut-for-six-hits-security-guard-in-perth-2639177-2024-11-24",
      "headline": "Watch: Virat Kohli's dangerous upper cut for six hits security guard in PerthVirat Kohli hit Mitchell Starc for a stylish upper cut, which eventually hit a security guard. He took India's lead past 400 as India dominated proceedings on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-delhi-capitals-coach-buys-players-hemang-badani-2639174-2024-11-24",
      "headline": "DC will be tactically better: Coach Badani's bold claim ahead of IPL auctionIPL auction: Delhi Capitals will be tactically better under his coach, feels former India cricketer Hemang Badani. Speaking ahead of the IPL mega-auction, Badani said that his aim at DC is to win the IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-to-punjab-kings-india-star-likes-punjabs-ponting-ipl-auction-post-2639163-2024-11-24",
      "headline": "Rishabh Pant to Punjab Kings? India star likes Punjab's Ponting IPL auction postRishabh Pant liked a post by Punjab Kings which featured their coach Ricky Ponting giving an interview.  This sparked speculation if Pant could join Punjab Kings ahead of IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-rishabh-pant-stump-out-nathan-lyon-alex-carey-2639162-2024-11-24",
      "headline": "Reckless Rishabh Pant fails in Perth Test hours before IPL mega auctionRishabh Pant got out in a bizarre manner on Day 3 of the Perth Test match. Pant recklessly stepped down against Nathan Lyon and was caught miles outside his crease by Alex Carey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-virat-kohlis-dangerous-upper-cut-for-six-hits-security-guard-in-perth-2639177-2024-11-24",
      "headline": "Watch: Virat Kohli's dangerous upper cut for six hits security guard in PerthVirat Kohli hit Mitchell Starc for a stylish upper cut, which eventually hit a security guard. He took India's lead past 400 as India dominated proceedings on Day 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-delhi-capitals-coach-buys-players-hemang-badani-2639174-2024-11-24",
      "headline": "DC will be tactically better: Coach Badani's bold claim ahead of IPL auctionIPL auction: Delhi Capitals will be tactically better under his coach, feels former India cricketer Hemang Badani. Speaking ahead of the IPL mega-auction, Badani said that his aim at DC is to win the IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rishabh-pant-to-punjab-kings-india-star-likes-punjabs-ponting-ipl-auction-post-2639163-2024-11-24",
      "headline": "Rishabh Pant to Punjab Kings? India star likes Punjab's Ponting IPL auction postRishabh Pant liked a post by Punjab Kings which featured their coach Ricky Ponting giving an interview.  This sparked speculation if Pant could join Punjab Kings ahead of IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-rishabh-pant-stump-out-nathan-lyon-alex-carey-2639162-2024-11-24",
      "headline": "Reckless Rishabh Pant fails in Perth Test hours before IPL mega auctionRishabh Pant got out in a bizarre manner on Day 3 of the Perth Test match. Pant recklessly stepped down against Nathan Lyon and was caught miles outside his crease by Alex Carey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-virat-kohli-salutes-yashasvi-jaiswal-innings-perth-2639157-2024-11-24",
      "headline": "Virat Kohli applauds Yashasvi Jaiswal after opener's heroic 161 in PerthVirat Kohli stood and applauded Yashasvi Jaiswal after the batter got out for 161 runs in the second innings of the Perth Test match. Jaiswal's heroic innings took India's lead past 350 runs on Sunday, November 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-yashasvi-jaiswal-sunil-gavaskar-virender-sehwag-record-2639153-2024-11-24",
      "headline": "Yashasvi Jaiswal joins Sunil Gavaskar, Virender Sehwag in elite club AUS vs IND: Yashasvi Jaiswal scored a stupendous hundred in the second innings of the Perth Test and joined the likes of Virender Sehwag, Sunil Gavaskar and Ravi Shastri in an elite list of batters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-can-learn-back-foot-play-from-yashasvi-jaiswal-in-australia-manjrekar-2639147-2024-11-24",
      "headline": "Virat Kohli can learn back-foot play from Yashasvi Jaiswal in Australia: ManjrekarYashasvi Jaiswal's sensational maiden Test century in Australia was praised by former cricketer Sanjay Manjrekar, who suggested that Virat Kohli could learn from Jaiswal's back-foot dominance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-rahul-dravid-reveals-how-it-feels-to-be-part-of-auction-after-8-years-2639139-2024-11-24",
      "headline": "IPL 2025: Rahul Dravid reveals how it feels to be part of auction after 8 yearsRahul Dravid was appointed as the head coach of Rajasthan Royals ahead of IPL 2025 mega auction. Dravid revealed his sense of excitement on being part of an auction after 8 years. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}