{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-reduces-import-tax-crude-edible-oils-to-10-bring-down-food-prices-2733414-2025-05-30",
      "headline": "India reduces import tax on crude edible oils by 10% to bring down food pricesThe reduction in import tax will effectively bring down the total import duty on the three oils to 16.5 per cent from an earlier 27.5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-and-itr-4-excel-utilities-out-check-who-can-file-and-what-new-this-year-itr-filing-2025-2733229-2025-05-30",
      "headline": "ITR-1 and ITR-4 Excel utilities out: Check who can file and what's new this yearExcel utilities for ITR-1 and ITR-4 are now available for AY 2025–26. Taxpayers can visit the income tax e-filing site to download and use them for filing returns for FY 2024–25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-misses-may-payment-for-loan-on-blusmart-cabs-report-2733215-2025-05-30",
      "headline": "Gensol misses May payment for loan on BluSmart cabs: ReportGensol Engineering reportedly missed a payment of about Rs 4 crore to its pass-through certificate (PTC) holders in May. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-economic-growth-hits-4-year-low-of-65-in-fy25-2733165-2025-05-30",
      "headline": "India's economic growth hits 4-year low of 6.5% in FY25The real GDP growth for the March quarter (Q4) stood at 7.4%, which is the fastest among all four quarters of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-182-points-lower-nifty-below-24800-it-stocks-drag-markets-infosys-hcltech-2733139-2025-05-30",
      "headline": "Sensex closes 182 points lower, Nifty below 24,800; IT stocks drag marketsThe S&P BSE Sensex was down by 182 points to end at 81,451.01, while the NSE Nifty50 lost 82.90 points to close at 24,750.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-instant-pf-withdrawals-via-upi-and-atms-to-online-corrections-5-expected-features-of-epfo-3o-2733090-2025-05-30",
      "headline": "From UPI withdrawals to online corrections: 5 expected features of EPFO 3.0EPFO's upcoming system aims to enhance financial flexibility for employees with features like instant UPI and ATM withdrawals, auto-claim settlements, and expanded withdrawal reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-leena-gandhi-tewari-the-suv-chairperson-who-bought-india-costliest-flats-2733045-2025-05-30",
      "headline": "Meet Leena Tewari, the USV chairperson who bought India's costliest flatsLeena is the chairperson of USV, a Mumbai-based pharmaceutical company, which was started by her late father, Vithal Gandhi, in partnership with Revlon in 1961. Forbes estimates Leena's net worth at $3.9 billion, as of May 30, 2025, making her one of India's richest women."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-maria-goretti-sebi-ban-1-year-why-reasons-shares-sadhna-broadcast-limited-sbl-2733005-2025-05-30",
      "headline": "Explained: Why Arshad Warsi, wife Maria Goretti were banned by Sebi for 1 yearArshad Warsi and Maria Goretti bought shares of Sadhna Broadcast Limited (now known as Crystal Business System Ltd) from other individuals who were also named in the Sebi order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donaldtrump-tariff-tsunami-impact-on-global-economy-explained-2733001-2025-05-30",
      "headline": "How Trump's tariff tsunami is reshaping global economyIn just over four months, Trump's flurry of trade actions, alternating between shock-and-awe tariffs and strategic pauses, has upended conventional expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-form-16-here-is-when-will-you-get-it-and-what-to-check-itr-filing-2025-2732994-2025-05-30",
      "headline": "Waiting for Form 16? Here's when will you get it and what to checkEmployers are required to issue Form 16 to employees if they've deducted TDS from their salary. It consists of two parts and shows how much salary was paid and how much tax was deducted during the year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/arshad-warsi-wife-maria-goretti-sebi-ban-57-others-stock-manipulation-case-sadhna-broadcast-ltd-2732975-2025-05-30",
      "headline": "Arshad Warsi, his wife, among 59 people banned from stock market for 1 yearSebi said the group was part of a scheme to artificially raise the price of Sadhna Broadcast shares before selling them to unsuspecting retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/veteran-investor-shankar-sharma-explains-why-most-investors-fail-in-markets-indian-stock-market-investment-tips-2732917-2025-05-30",
      "headline": "Veteran investor explains why most investors fail in marketsAce investor Shankar Sharma said many investors fail to ask tough questions and instead rely on myths. He was critical of the belief that great investors can see into the future, dismissing it as an unrealistic myth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-data-today-q4-fy25-world-fourth-largest-economy-projections-inflation-2732908-2025-05-30",
      "headline": "India GDP data to be released today: What should investors expect?Earlier this year, the National Statistical Office had estimated that India's economy would grow by 6.5% in 2024–25, with an expected growth of 7.6% in the March quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-tumble-10-percent-after-q4-net-loss-should-you-buy-hold-or-sell-2732905-2025-05-30",
      "headline": "Ola Electric shares nosedive 10% after Q4 net loss. Should you buy, hold or sell?Ola Electric's Q4 numbers have laid bare the challenges facing India's EV poster child, from falling volumes and margin pressures to delays in execution. While the company's aggressive bets on electric motorcycles and rural expansion could pay off, the near-term outlook is murky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mazagon-dock-shares-snap-winning-streak-slide-sharply-q4-results-profit-halves-2732892-2025-05-30",
      "headline": "Mazagon Dock shares snap winning streak, tumble 8%. Here's whyThe stock fell to an intraday low of Rs 3,450, retracing from Thursday's close of Rs 3,749. Around 10:07 am, shares of the company were trading 4.75% lower at Rs 3,574.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/suzlon-energy-share-price-13-percent-rise-strong-q4-results-hold-or-sell-expert-view-outlook-2732887-2025-05-30",
      "headline": "Suzlon Energy share price up 13% over strong Q4 results: Should you buy?Suzlon Energy stock price: The shares jumped as much as 13% in early trade, reaching an intraday high of Rs 74.30 on the BSE. This rise comes after Suzlon Energy Ltd announced a sharp rise in its quarterly profit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-suzlon-energy-shares-rose-13-percent-after-strong-q4-results-2732871-2025-05-30",
      "headline": "Explained: Why Suzlon Energy shares rose 13% after Q4 resultsThe sharp rally came after Suzlon posted a 365% year-on-year jump in consolidated net profit for Q4FY25. Profit rose to Rs 1,182 crore from Rs 254 crore in the same quarter last year. Revenue from operations increased 73% to Rs 3,773 crore, compared to Rs 2,179 crore in the year-ago period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-lower-nifty-below-24800-infosys-down-over-1-percent-it-stocks-fall-2732862-2025-05-30",
      "headline": "Sensex opens 150 points lower; Nifty below 24,800; Infosys down over 1%The S&P BSE Sensex was down by 45.58 points to 81,587.44, while the NSE Nifty50 added 24.20 points to 24,857.80 as of 9:25 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/prostarm-info-systems-ipo-allotment-may-30-online-guide-check-status-subscription-gmp-today-listing-date-2732855-2025-05-30",
      "headline": "Prostarm Info Systems IPO allotment: Step-by-step guide to check statusProstarm Info Systems was subscribed to nearly 100 times. The IPO opened for subscription on May 27, 2025, and closed on May 29, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-to-open-higher-trading-setup-nse-bse-dalal-street-expectation-2732841-2025-05-30",
      "headline": "Stock market opening: Sensex, Nifty likely to open higher today. Here's whyAt 8:14 am, Gift Nifty futures were trading at 24,950, suggesting a positive start above Thursday's Nifty50 close of 24,833.6. This indicates that markets may open with gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-30-lic-baja-auto-ola-electric-nykaa-mazagaon-dock-indigo-2732836-2025-05-30",
      "headline": "Stocks to watch on May 30: LIC, Baja Auto, Ola, Nykaa, Mazagaon Dock, IndiGoAs the week nears its end, investors will be looking out for key movements on Friday, May 30, especially as several companies are expected to release their quarterly earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elf-beauty-buys-hailey-biebers-rhode-in-usd-1-billion-deal-2732645-2025-05-29",
      "headline": "Elf beauty buys Hailey Bieber's Rhode in $1 billion dealElf will acquire Rhode for $600 million in cash and $200 million of newly issued shares of Elf Beauty common stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbais-dharavi-to-get-a-rs-95790-crore-makeover-in-7-years-2732592-2025-05-29",
      "headline": "Mumbai's Dharavi to get a Rs 95,790 crore makeover in 7 yearsThe redevelopment is being led by a special purpose vehicle (SPV), Navbharat Mega Developers Private Limited (NMDPL), formed through a joint venture between the Maharashtra government's Slum Rehabilitation Authority (SRA) and the Adani Group's Dharavi Redevelopment Project Private Limited (DRPPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mumbai-record-home-deal-usvs-chairperson-picks-up-duplexes-for-rs-639-crore-naman-xana-building-on-worli-sea-face-2732547-2025-05-29",
      "headline": "Mumbai's record home deal: USV's chairperson picks up duplexes for Rs 639 croreThese sea-facing homes are in the high-end 40-storey Naman Xana building on Worli Sea Face, offering stunning views of the Arabian Sea. The duplexes are spread across four floors – from the 32nd to the 35th, covering a total area of 22,572 sq ft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-321-points-higher-nifty-above-24800-indusind-bank-up-over-2-2732495-2025-05-29",
      "headline": "Sensex ends 321 points higher, Nifty above 24,800; IndusInd Bank up over 2%The BSE Sensex ended 320.70 points higher at 81,633.02, while the NSE Nifty50 settled 81.15 points higher at 24,833.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/key-financial-changes-in-june-2025-free-aadhaar-update-epfo-3-0-launch-financial-rule-changes-saving-credit-fd-rates-india-2732474-2025-05-29",
      "headline": "From PF access to free Aadhaar update: 5 key financial changes in June 2025The deadline to update your Aadhaar details online for free is June 14, 2025. Those who fail to update their identity and address proof documents by this date will incur a fee of Rs 25 for updates through the online portal or Rs 50 at physical Aadhaar centres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-1-vs-itr-2-eligibility-for-income-tax-filing-2025-26-budget-changes-which-tax-form-should-salaried-individuals-choose-2732371-2025-05-29",
      "headline": "ITR-1 or ITR-2: Know which form suits your 2025-26 tax filingAn informative guide on choosing between ITR-1 and ITR-2 for salaried individuals, highlighting the eligibility criteria and recent updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-accuse-brother-manoj-manchu-theft-kannappa-hard-disk-2733481-2025-05-31",
      "headline": "Actor Vishnu Manchu accuses brother Manoj over alleged theft of Kannappa hard diskTelugu actor Vishnu Manchu accused his brother Manoj Manchu over the alleged theft of Kannappa's hard disk. Over the past few months, the brothers have been involved in a family feud, which resulted in Manoj being ousted from their father Mohan Babu's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-can-you-watch-the-tony-awards-this-year-streaming-details-inside-glbs-2733445-2025-05-31",
      "headline": "How can you watch the Tony Awards this year? Streaming details insideThe 2025 Tony Awards will be live on June 8 with top nominees, historic firsts, and a Hamilton cast reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emmy-winning-actress-and-mash-star-loretta-swit-dies-at-87-glbs-2733439-2025-05-31",
      "headline": "Emmy-winning actress and MASH star Loretta Swit dies at 87Loretta Swit, renowned for her role as Major Houlihan in MASH, has died at 87. The Emmy-winning actress redefined female roles on TV and was also a passionate animal rights advocate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-to-star-in-meet-the-parents-4-alongside-stiller-and-de-niro-glbs-2733429-2025-05-31",
      "headline": "Ariana Grande to star in 'Meet the parents 4' alongside Stiller and De NiroAriana Grande joins Robert De Niro and Ben Stiller in a new Meet the Parents comedy, playing a bold fiancée. The film marks her return to acting after Wicked, with a 2026 release date set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-buys-back-masters-first-six-albums-shamrock-capital-deal-2733368-2025-05-30",
      "headline": "You belong with me: Taylor Swift buys back rights to her first 6 albumsTaylor Swift has repurchased the master recordings of her first six albums. This move restores her ownership and highlights artists' rights in the music industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Shabana and I've been sleeping on streets: Javed Akhtar reacts to Pak actor's remarkJaved Akhtar replied strongly to Pakistani actor Bushra Ansari's comments about him not getting a house to rent. He said she has no right to tell him to stay quiet and proudly said he is Indian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-sister-midnight-film-release-uncut-india-2733296-2025-05-30",
      "headline": "Radhika Apte hopes Sister Midnight releases uncut in IndiaActor Radhika Apte discusses her daring new film Sister Midnight and its journey to an Indian release, hoping it will be shown uncut despite censorship concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-shares-his-success-mantra-saying-no-to-work-yes-to-family-2733276-2025-05-30",
      "headline": "Saif Ali Khan shares his success mantra: Saying no to work, yes to familySaif Ali Khan shared that true success, for him, means choosing family time over work commitments. He said small moments with loved one's matter more than professional achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-to-make-hollywood-debut-with-kevin-spacey-holiguards-2733287-2025-05-30",
      "headline": "Disha Patani to make Hollywood debut with Kevin Spacey's HoliguardsActor Disha Patani is set to make her Hollywood debut with Kevin Spacey's upcoming film 'Holiguards'. The film is extensively shot in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-controversy-south-indian-artistes-association-support-karnataka-backlash-unity-2733257-2025-05-30",
      "headline": "South Indian Artistes Association backs Kamal Haasan amid language rowThe South Indian Artistes Association has strongly supported Kamal Haasan amid the recent backlash in Karnataka. The statement warns that misrepresenting Kamal could harm cinema's cultural unity and public discourse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-and-vishwaroopam-tale-of-two-bans-and-kamal-haasans-defiance-2733233-2025-05-30",
      "headline": "Thug Life and Vishwaroopam: Tale of two bans and Kamal Haasan's defianceKamal Haasan's upcoming film, 'Thug Life', directed by Mani Ratnam, has been banned in Karnataka. Twelve years ago, another film of the actor, 'Vishwaroopam', was also banned. Both times, Haasan remained unfazed. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gigi-hadid-bella-hadid-introduce-23-year-old-half-sister-aydan-nix-2733221-2025-05-30",
      "headline": "Gigi and Bella Hadid introduce their 23-year-old half sister, Aydan NixSupermodel sisters, Gigi Hadid and Bella Hadid, have introduced their 23-year-old half-sister, Aydan Nix, who they connected with in 2023 after a surprise DNA test. Raised in Florida, Aydan is now pursuing a career in fashion after graduating from Parsons School of Design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/criminal-justice-season-4-review-stellar-pankaj-tripathi-cross-examines-average-legal-drama-2733216-2025-05-30",
      "headline": "Criminal Justice 4 review: Stellar Pankaj Tripathi cross-examines average legal dramaReleased-Fri May 30, 2025In 'Criminal Justice Season 4', actor Pankaj Tripathi tries to hold the court in a murder case, but how much can he do alone? The story looks engaging in parts, but not fully convincing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-fan-enters-theatre-with-snake-during-khaleja-re-release-2733214-2025-05-30",
      "headline": "Mahesh Babu fan enters theatre with snake during Khaleja re-releaseA Mahesh Babu fan carried a live snake to theatres in Vijayawada as the actor's film 'Khaleja' re-released in theatres. A video of the incident has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/hybe-chairman-bang-si-hyuk-investigated-fraudulent-trading-bts-comeback-2733100-2025-05-30",
      "headline": "Hybe chairman investigated for alleged fraud before BTS comebackHybe chairman Bang Si-hyuk is under investigation for alleged fraudulent trading during the company's pre-IPO phase. The probe intensifies scrutiny as BTS prepares for its highly anticipated comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bhairavam-review-typical-good-old-school-telugu-commercial-entertainer-2733142-2025-05-30",
      "headline": "Bhairavam review: A typical but good old-school Telugu commercial entertainerReleased-Fri May 30, 2025Bhairavam movie review: This Telugu family drama directed by Vijay Kanakamedala stars Manoj Manchu, Bellamkonda Sai Srinivas and Nara Rohith in the lead. The film packs a good emotional punch despite the template story, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kankhajura-review-mohit-raina-roshan-matthews-thriller-strong-performances-weak-ending-2733144-2025-05-30",
      "headline": "Kankhajura review: Mohit-Roshan's thriller grips early but falters in climaxReleased-Fri May 30, 2025Kankhajura series review: 'Kankhajura' is a psychological thriller on SonyLiv that explores family tension and emotional manipulation. Despite strong performances, the series falters with a rushed and less impactful ending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-gorgeous-bridesmaid-in-black-for-friend-white-wedding-in-spain-2733169-2025-05-30",
      "headline": "Alia Bhatt is a gorgeous bridesmaid in black for friend's white wedding in SpainActor Alia Bhatt radiated charm in a black outfit at her friend's white wedding in Spain. The pictures of her with the other bridesmaids have gone viral. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-colombia-statement-condemning-pakistan-deaths-in-operation-sindoor-2733470-2025-05-31",
      "headline": "Colombia retracts statement on Pak deaths after Shashi Tharoor's disapprovalColombia has withdrawn its statement condemning the deaths in Pakistan during India's Operation Sindoor following Congress MP Shashi Tharoor's rebuttal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-repeats-his-india-pak-ceasefire-brokering-claim-says-us-averted-nuclear-disaster-2733424-2025-05-30",
      "headline": "US averted nuclear disaster: Trump repeats India-Pak truce brokering claimTrump thanked the leaders of both countries, as well as his administration, for their roles in de-escalating the situation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-to-end-turkish-airlines-leasing-deal-by-august-31-2733344-2025-05-30",
      "headline": "IndiGo to cut ties with Turkish Airlines amid row over Ankara's support to PakThe Directorate General of Civil Aviation said IndiGo gave an undertaking that it will terminate the lease with Turkish Airlines by August 31 and will not seek a further extension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-dismisses-drug-allegations-slams-nyt-in-oval-office-response-donald-trump-2733448-2025-05-31",
      "headline": "Elon Musk brushes off bombshell NYT report on use of drugs during DOGE stintAccording to sources cited in the NYT report, Elon Musk regularly consumed ketamine, ecstasy and psychedelic mushrooms, raising alarm given his government advisory role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-mi-vs-gt-jasprit-bumrah-yorker-genius-2733462-2025-05-31",
      "headline": "Unplayable yorker, inevitable genius: How Jasprit Bumrah sank the Gujarat TitansJasprit Bumrah delivered yet another masterclass in the IPL 2025 Eliminator, turning the tide with an unplayable yorker that shattered Gujarat Titans' hopes. HIs spell was a reminder that with Bumrah, brilliance isn't occasional, but inevitable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-bhopal-visit-security-drill-monsoon-covid-case-titanic-launch-anniversary-2733479-2025-05-31",
      "headline": "News Menu, May 31: PM Modi in Bhopal today; security drill in Pak-bordering statesOn May 31, 1911, the RMS Titanic was launched, symbolising human ambition before its tragic end. India Today's news menu today spans PM Modi's Bhopal visit, security drills, political rallies, monsoon chaos, and a rising Covid subvariant.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-faizan-zaki-wins-2025-scripps-national-spelling-bee-glbs-2733436-2025-05-31",
      "headline": "Indian-American Faizan Zaki wins 2025 Scripps National Spelling Bee13-year-old Faizan Zaki wins the 2025 Scripps National Spelling Bee by spelling \"éclaircissement,\" earning $50,000 and the Scripps Cup in a historic 100th anniversary edition of the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/united-states-warns-china-threat-taiwan-indo-pacific-pete-hegseth-2733480-2025-05-31",
      "headline": "China rehearsing for real deal: US warns of imminent threat in Indo-PacificUS Defence Secretary Pete Hegseth warned that China's threat to Taiwan could be imminent and pledged unwavering support to Indo-Pacific allies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/blending-style-with-substance-evolving-language-of-espionage-in-storytelling-2732594-2025-05-31",
      "headline": "Blending style with substance: Evolving language of espionage in storytellingThe spy genre is the current flavour of the season. Where are espionage stories heading with the emergence of shows like 'The Freelancer,' 'Special Ops' and 'The Family Man'? On Cinematic Saturday, we speak to artistes from the Hindi cinema to understand the changing landscape of the Indian spy genre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-reacts-to-emmanuel-macron-wife-slap-video-says-couple-was-just-joking-2733433-2025-05-31",
      "headline": "Make sure door remains closed: Trump's advice to Emmanuel Macron after slap videoTrump said he had spoken to Macron and assured reporters that the couple was fine. He added that they are two good people he knows very well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-appears-in-oval-office-with-black-eye-blames-playful-punch-from-son-2733437-2025-05-31",
      "headline": "Elon Musk appears in Oval Office with black eye, blames playful punch from sonMusk humorously revealed that the injury came from a playful moment with his 5-year-old son."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-reacts-to-bushra-ansari-comment-shabana-azmi-and-i-sleeping-on-streets-2733310-2025-05-30",
      "headline": "Shabana and I've been sleeping on streets: Javed Akhtar reacts to Pak actor's remarkJaved Akhtar replied strongly to Pakistani actor Bushra Ansari's comments about him not getting a house to rent. He said she has no right to tell him to stay quiet and proudly said he is Indian."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/faridabad-name-mix-up-wrong-nitesh-released-from-jail-trespassing-raped-minor-boy-neemka-2733458-2025-05-31",
      "headline": "Name mix-up: Nitesh who trespassed got bail, but Nitesh who raped was releasedNitesh Pandey, 27, who walked out free, was arrested in 2021 for raping a nine-year-old boy in Faridabad. The other, Nitesh, 24, was arrested on Sunday on charges of trespass and assault and was granted bail by a court the next day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-betting-is-young-indias-new-deadly-gambling-addiction-mental-health-experts-2733443-2025-05-31",
      "headline": "Forget drugs, IPL betting is young India's new deadly addictionGoogle search trends indicate a sharp spike in interest for terms like \"IPL addiction\" and \"online betting\" during every IPL season. Broader searches such as \"gambling addiction\" have been steadily rising since 2015."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-shield-security-drills-today-punjab-jammu-kashmir-rajasthan-gujarat-chandigarh-2733474-2025-05-31",
      "headline": "Operation Shield security drills today in states bordering PakistanSecurity drill aims to enhance emergency preparedness in vulnerable regions adjoining the western border, including Jammu and Kashmir, Gujarat, Punjab and Rajasthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-protein-bar-a-healthy-breakfast-option-2733279-2025-05-31",
      "headline": "Is protein bar a good (and healthy) breakfast option?Breakfast on the go is no longer surprising. We are all chasing deadlines. Protein bars, meanwhile, have become a convenient option, but does that mean we could be inviting trouble?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-492-30-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-plans-to-double-steel-tariffs-from-25-to-50-per-cent-glbs-2733444-2025-05-31",
      "headline": "Trump to double steel tariffs on imports to 50% starting June 4Trump announced plans to double steel import tariffs from 25% to 50%, aiming to protect US steelmakers, despite concerns about rising costs for the housing, auto, and construction industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/indus-waters-treaty-india-paid-pakistan-water-scarcity-dams-canals-contribution-money-world-bank-deal-history-war-2733068-2025-05-30",
      "headline": "Not just water, money too flowed from India to Pakistan as part of Indus treatyFor a treaty hailed globally as a triumph of water diplomacy, India paid not just in rivers, but in rupees, following the Indus Waters Treaty (IWT) with Pakistan of 1960. Behind the Indus treaty lies the lesser-known story of how India bankrolled Pakistan's water infrastructure, only to be repaid with hostility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-8",
      "headline": "Operation Sindoor: When Indian missiles rained on Pak terror paradeIn the concluding part of our 'A Brief History of Terrorism in Kashmir' series, we revisit India's bold strikes on Pakistan after the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-weather-update-monsoon-five-killed-heavy-rain-lashes-northeast-red-alert-assam-2733456-2025-05-31",
      "headline": "5 killed as heavy rain lashes Northeast, red alert issued in AssamAs many as five people died in rain-related incidents in Mizoram, Tripura and Meghalaya. In Mizoram, at least three houses collapsed in Lawngtlai town and landslides blocked roads across the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-accuse-brother-manoj-manchu-theft-kannappa-hard-disk-2733481-2025-05-31",
      "headline": "Actor Vishnu Manchu accuses brother Manoj over alleged theft of Kannappa hard diskTelugu actor Vishnu Manchu accused his brother Manoj Manchu over the alleged theft of Kannappa's hard disk. Over the past few months, the brothers have been involved in a family feud, which resulted in Manoj being ousted from their father Mohan Babu's house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/teen-vaping-rises-india-cigarette-decline-nicotine-harm-legal-gaps-2733399-2025-05-31",
      "headline": "From trend to trap: The silent vaping crisis gripping India's teenagersVaping among Indian teenagers is steadily increasing despite a decline in cigarette use. This trend, experts say, threatens to undo tobacco control gains."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-sudharsan-press-conference-india-eliminator-2733491-2025-05-31",
      "headline": "Sudharsan strives for T20 improvement, not fussed about India call-upIPL 2025, GT vs MI Eliminator: Sai Sudharsan said that he still has a lot of work on his game to become a prolific T20 batter. On Friday, Sudharsan's 80-run knock went in vain as Gujarat Titans lost to Mumbai Indians by 20 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-inter-milan-vs-psg-live-streaming-timing-starting-xi-2733478-2025-05-31",
      "headline": "Champions League: Flair meets discipline as PSG face Inter in finalParis Saint-Germain meet Inter Milan in the biggest clash of football on Saturday evening. PSG – a testament to agility, speed and flair – is set to face a stern test against Inter Milan's maturity, grit and experience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-yuki-bhambri-rohan-bopanna-mens-doubles-2733473-2025-05-31",
      "headline": "Yuki Bhambri, Robert Galloway stun 7th seeds, Rohan Bopanna into R3French Open 2025: India's Yuki Bhambri and Robert Galloway defeated Nikola Mektic and Michael Venus 6-7(4), 7-6(7), 6-3 while Rohan Bopanna and Adam Pavlasek got the better of Fabien Reboul and Sadio Doumbia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-mi-vs-gt-jasprit-bumrah-yorker-genius-2733462-2025-05-31",
      "headline": "Unplayable yorker, inevitable genius: How Jasprit Bumrah sank the Gujarat TitansJasprit Bumrah delivered yet another masterclass in the IPL 2025 Eliminator, turning the tide with an unplayable yorker that shattered Gujarat Titans' hopes. HIs spell was a reminder that with Bumrah, brilliance isn't occasional, but inevitable.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/imane-khelif-boxing-olympics-sex-screening-2733459-2025-05-31",
      "headline": "Boxer Imane Khelif faces mandatory genetic sex screening to competeImane Khelif, who won the gold medal in the Paris Olympics last year, has to undergo a mandatory genetic sex screening to compete under boxing's new governing body.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-mahela-jayawardene-rohit-sharma-press-conference-2733457-2025-05-31",
      "headline": "Big game player: Why Rohit Sharma is coach Mahela Jayawardene's favouriteMumbai Indians opener Rohit Sharma won the player of the match award in the team's victory against Gujarat Titans in the Eliminator of the Indian Premier League. Head coach Mahela Jayawardene spoke about the batter and revealed why Rohit was his favourite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-iga-swiatek-wrap-third-round-2733451-2025-05-31",
      "headline": "Carlos Alcaraz made to work hard in Round 3, Iga Swiatek rolls onFrench Open 2025: Defending men's singles champion Carlos Alcaraz needed four sets gto beat lower-ranked Damir Dzumhur in the third round. Meanwhile, Iga Swiatek continued her title defence, easing through to the Round of 16 on Friday, May 30. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-betting-is-young-indias-new-deadly-gambling-addiction-mental-health-experts-2733443-2025-05-31",
      "headline": "Forget drugs, IPL betting is young India's new deadly addictionGoogle search trends indicate a sharp spike in interest for terms like \"IPL addiction\" and \"online betting\" during every IPL season. Broader searches such as \"gambling addiction\" have been steadily rising since 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-jasprit-bumrah-hardik-pandya-mumbai-housing-2733430-2025-05-31",
      "headline": "Jasprit Bumrah like Mumbai housing prices, a luxury to have: Hardik PandyaIPL 2025 Eliminator, GT vs MI: In a match that saw 448 runs scored, Jasprit Bumrah stood tall, conceding just 27 runs in four overs and picking up a key wicket with an unplayable yorkers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-hardik-pandya-tense-toss-moment-mumbai-indians-beat-gujarat-titans-ipl-2025-2733431-2025-05-31",
      "headline": "Did Shubman Gill snub Hardik Pandya's handshake during GT vs MI IPL Eliminator?IPL 2025: Hardik Pandya and Shubman Gill shared an awkward moment at the toss ahead of the eliminator between the Mumbai Indians and the Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-youngest-batter-700-runs-ipl-2025-season-2733427-2025-05-31",
      "headline": "GT's Sai Sudharsan scripts IPL history, signs off with 759 runsSai Sudharsan became the youngest player to score 700 runs in a single IPL season during the Eliminator match. Despite his record-breaking performance, Gujarat Titans lost to Mumbai Indians, ending their tournament run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-iga-swiatek-wrap-third-round-2733451-2025-05-31",
      "headline": "Carlos Alcaraz made to work hard in Round 3, Iga Swiatek rolls onFrench Open 2025: Defending men's singles champion Carlos Alcaraz needed four sets gto beat lower-ranked Damir Dzumhur in the third round. Meanwhile, Iga Swiatek continued her title defence, easing through to the Round of 16 on Friday, May 30. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/ipl-betting-is-young-indias-new-deadly-gambling-addiction-mental-health-experts-2733443-2025-05-31",
      "headline": "Forget drugs, IPL betting is young India's new deadly addictionGoogle search trends indicate a sharp spike in interest for terms like \"IPL addiction\" and \"online betting\" during every IPL season. Broader searches such as \"gambling addiction\" have been steadily rising since 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-eliminator-jasprit-bumrah-hardik-pandya-mumbai-housing-2733430-2025-05-31",
      "headline": "Jasprit Bumrah like Mumbai housing prices, a luxury to have: Hardik PandyaIPL 2025 Eliminator, GT vs MI: In a match that saw 448 runs scored, Jasprit Bumrah stood tall, conceding just 27 runs in four overs and picking up a key wicket with an unplayable yorkers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-hardik-pandya-tense-toss-moment-mumbai-indians-beat-gujarat-titans-ipl-2025-2733431-2025-05-31",
      "headline": "Did Shubman Gill snub Hardik Pandya's handshake during GT vs MI IPL Eliminator?IPL 2025: Hardik Pandya and Shubman Gill shared an awkward moment at the toss ahead of the eliminator between the Mumbai Indians and the Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-youngest-batter-700-runs-ipl-2025-season-2733427-2025-05-31",
      "headline": "GT's Sai Sudharsan scripts IPL history, signs off with 759 runsSai Sudharsan became the youngest player to score 700 runs in a single IPL season during the Eliminator match. Despite his record-breaking performance, Gujarat Titans lost to Mumbai Indians, ending their tournament run."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}