{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-overtakes-jeff-bezos-as-worlds-second-richest-person-2610993-2024-10-04",
      "headline": "Mark Zuckerberg overtakes Jeff Bezos as world's second-richest person The dramatic rise in Mark Zuckerberg's fortune has been fuelled by a 23% increase in Meta's stock price since its better-than-expected Q2 results.\r\n\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-bjp-congress-worker-molested-video-party-campaign-event-2611834-2024-10-05",
      "headline": "Anti-women party: BJP shares video of Haryana Congress worker 'molested' at eventThe BJP called Congress the most 'anti-women party' even as Congress MP Kumari Selja condemned the incident and demanded strict action against the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-pakistan-visit-external-affairs-ministe-sco-summit-islamabad-2611784-2024-10-05",
      "headline": "Jaishankar on upcoming Pak visit: Going there as SCO member, will behave myselfExternal Affairs Minister S Jaishankar announced that his upcoming visit to Pakistan for the Shanghai Cooperation Organisation (SCO) summit later this month will focus on the multilateral event rather than India-Pakistan relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uses-money-to-win-elections-pm-jabs-congress-over-delhi-drug-bust-2611756-2024-10-05",
      "headline": "Uses money to win elections: PM jabs Congress over Delhi drug bustPrime Minister Narendra Modi criticised the Congress over a Rs 5,000-crore drug bust in Delhi, accusing the party of pushing youth toward drugs to fund elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-opposes-5-nominated-members-jammu-kashmir-assembly-government-formation-bjp-election-results-2611731-2024-10-05",
      "headline": "J&K gets five MLAs even before the first vote is counted; Opposition furiousFor the first time in J&K, five nominated members will play a significant role in government formation. The Congress has strongly opposed the move to nominate members and accused the BJP of attempting to manipulate election results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/haifa-ground-report-northern-israel-deserted-look-amid-hezbollah-threat-israel-lebanon-war-2611809-2024-10-05",
      "headline": "Ground report: Haifa in northern Israel wears deserted look amid Hezbollah threatJust three days ago, Hezbollah fired some 100 rockets from southern Lebanon at Haifa Bay and other northern Israeli areas. There is still an uneasy calm in and around the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/revisiting-the-lost-glory-of-90s-indi-pop-magic-2611390-2024-10-05",
      "headline": "How the bustling beats of 90s' Indi-pop faded awayThe 90s era was a transformative period for Indian music, with Indi-pop emerging as a unique fusion of Indian and Western sounds, captivating audiences and creating a cultural wave. Though it faced a decline due to various factors, the genre is seeing a hopeful revival as modern artistes experiment with its essence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aap-leaders-saurabh-bharadwaj-detained-protest-delhi-bus-marshals-issue-2611855-2024-10-05",
      "headline": "Delhi minister, AAP leaders detained during bus marshals' protest AAP MLAs, ministers and several bus marshals had gathered outside the residence of Lt Governor VK Saxena. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/protests-west-bengal-south-24-parganas-district-body-of-girl-canal-locals-say-police-inaction-2611640-2024-10-05",
      "headline": "Huge protests after Bengal girl's body found in canal, family alleges rapeThe girl's family alleged that they were harassed by the police when they went to file a complaint. A video showed a group of people marching towards a police station in protest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-palestine-red-hands-empty-strollers-keffiyeh-keys-blood-stained-trousers-symbolism-amid-war-iran-gaza-2611701-2024-10-05",
      "headline": "Horror of red hands, wails of empty strollers: Symbolism amid warThe death and devastation in the war in the Middle East have given rise to symbols, and new meanings to old ones. Be it empty strollers, red-painted hands, Palestinian keys or blood-stained trousers. Here's a look at them on the eve of the first anniversary of the October 7 attack and the Israel-Iran war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/exit-poll-results-2024-live-streaming-time-when-and-where-to-watch-haryana-jk-exit-polls-2611828-2024-10-05",
      "headline": "When and where to watch exit polls for Haryana, Jammu and KashmirHaryana, J&K Exit Poll Result Live streaming: As the assembly elections conclude, all eyes are on the exit polls to predict the political landscape, with the BJP aiming for another term in Haryana and the Congress seeking a comeback, while Jammu & Kashmir witnesses its first assembly election in nearly a decade.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-lebanon-attack-beirut-hezbollah-gaza-war-palestine-hamas-netanyahu-latest-2611623-2024-10-05",
      "headline": "Israel targets north Lebanon, kills Hamas leader in fresh airstrikes  Live UpdatesIsraeli airstrikes targeting Hezbollah intensified in Lebanon, with blasts reported in Beirut and near the airport, as the offensive also expanded to northern Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-elections-voting-bjp-congress-nayab-saini-vinesh-phogat-aap-jjp-2611578-2024-10-05",
      "headline": "61% turnout till 5 pm in Haryana in high-stakes BJP vs Congress contest Live UpdatesHaryana Assembly Election: As voting progresses in Haryana, Yamunanagar registered the highest polling with 56.79 per cent, followed by Mewat at 56.59 per cent as of 3 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-hezbollah-hideout-in-beirut-reduced-to-rubble-in-israeli-strike-2611664-2024-10-05",
      "headline": "Ground report: Hezbollah hideout in Beirut reduced to rubble in Israeli strikeOver 25 Hezbollah fighters died in Israeli airstrikes in Dahiyeh district in the southern part of Beirut on Friday evening. India Today TV's Ashraf Wani, showed visuals of a building which was completely destroyed in the Israeli attacks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indigo-massive-system-slowdown-outage-across-network-web-check-ins-flight-movement-affected-2611739-2024-10-05",
      "headline": "IndiGo hit by system slowdown, check-ins, flight ops affectedIndiGo flight operations: The technical glitch led to slower check-ins and massive queues at airports. IndiGo said they were working to resolve the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-syria-masnaa-border-crossing-people-stranded-struggle-craters-hezbollah-israeli-strikes-2611787-2024-10-05",
      "headline": "Exclusive: Lebanon-Syria border crossing bombed, thousands in dire straitsIndia Today TV's Ashraf Wani, the only Indian reporter on the ground in Lebanon, reached the bombed-out Masnaa Border Crossing, a crucial artery connecting Lebanon and Syria."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/complaint-filed-against-actor-nagarjuna-akkineni-over-land-encroachment-2611763-2024-10-05",
      "headline": "Complaint filed against actor Nagarjuna Akkineni over land encroachmentNagarjuna Akkineni's N Convention Centre was demolished in August as part of a drive to remove illegal constructions that have encroached on water bodies and public lands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/inside-bigg-boss-18-house-turkish-hammam-bathroom-to-cave-and-fort-like-interiors-2611665-2024-10-05",
      "headline": "Inside Bigg Boss 18 house: Turkish hammam bathroom to cave and fort-like interiorsBigg Boss 18 is scheduled to premiere this Sunday. In anticipation of the launch, the show's producers released a video showcasing the grand house with its one-of-a-kind theme and interior design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-424-04-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-32-days-viral-video-teleprompter-malfunction-online-buzz-michigan-rally-2611708-2024-10-05",
      "headline": "Video: Kamala Harris stuck repeating '32 days', sparks teleprompter glitch buzzDuring a campaign speech in Michigan, Vice President Kamala Harris repeatedly mentioned \"32 days\". Despite the slip, Harris swiftly regained her composure and continued delivering her message."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amethi-murder-shooting-teacher-family-accused-extramarital-affair-victim-wife-police-probe-2611630-2024-10-05",
      "headline": "Amethi murders fallout of accused's affair with victim's wife: PoliceAccording to police, the accused, Chandan Verma, confessed to having an affair with the victim's wife, Poonam, for the past 1.5 years. However, the relationship had recently soured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-dj-alan-walker-concert-bengaluru-2611624-2024-10-05",
      "headline": "Alia Bhatt makes special appearance at DJ Alan Walker's concert in BengaluruAlia Bhatt attended DJ Alan Walker's concert in Bengaluru on October 4. She promoted her upcoming film Jigra. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ayatollah-ali-khamenei-rifle-friday-sermon-education-protest-against-shah-of-iran-anti-israel-proxies-hamas-hezbollah-2610593-2024-10-05",
      "headline": "Khamenei: Student protester to cleric ready for war with Israel at 85Iran's Ayatollah Ali Khamenei was born to a cleric who lived in a house with one room and eight children. A student who joined the protests against the Shah of Iran in 1979, Khamenei rose to become the supreme leader. A rifle in his Friday sermon, signalled that the 85-year-old Khamenei was ready to lead a direct war against Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/video/watch-bjp-mp-naveen-jindal-arrives-on-horse-to-cast-vote-in-haryana-2611694-2024-10-05",
      "headline": "Watch: BJP's Naveen Jindal arrives at polling booth on horse to cast voteBJP MP Naveen Jindal went to a polling station in Kurukshetra in Haryana to cast his vote for the Assembly elections on Saturday on a horse. The Haryana elections are being held in a single phase on October 5 to elect 90 legislators in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kashmiri-separatist-yasin-malik-gandhian-resistance-given-up-armed-struggle-uapa-tribunal-2611677-2024-10-05",
      "headline": "Gave up arms, I'm a Gandhian now: Separatist Yasin Malik to tribunalSeparatist leader Yasin Malik told a UAPA tribunal that he's given up armed struggle and adopted a \"Gandhian way of resistance\" to promote a \"united, independent Kashmir\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-salman-khan-meets-ai-versions-of-his-past-and-future-in-new-promo-2611862-2024-10-05",
      "headline": "Bigg Boss 18: Salman Khan meets AI versions of his past and future in new promoA new promo of Bigg Boss 18 was released ahead of its highly anticipated launch on October 6. In the promo video, host Salman Khan meets the AI versions of his past and future and engages in an interaction. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/spice-up-your-love-review-a-cheeky-k-drama-with-lee-sangyi-han-jihyun-spin-off-thatll-leave-you-craving-more-no-gain-no-love-2611595-2024-10-05",
      "headline": "Spice Up Our Love review: A cheeky K-drama spin-off that'll leave you craving moreReleased-Thu Oct 03, 2024No Gain No Love spin-off Spice Up Our Love consists of only two episodes and focusses on the second lead couple - Bok Gyu-hyun and Nam Ja-yeon. But is your cup of tea? Read the review and find out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/spider-man-director-sam-raimi-in-talks-to-direct-doctor-strange-3-2611805-2024-10-05",
      "headline": "Spider-Man director Sam Raimi in talks to direct Doctor Strange 3Director Sam Raimi is reportedly in discussions to return for Doctor Strange 3, aiming for a 2027 release. Benedict Cumberbatch will reprise his role, with the film set between Avengers: Doomsday and Avengers: Secret Wars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kaun-banega-crorepati-16-gold-medalists-avani-lekhara-navdeep-singh-and-sumit-antil-2611788-2024-10-05",
      "headline": "KBC 16: Gold medalists Avani Lekhara, Navdeep Singh, Sumit Antil win Rs 25 lakhsIn the latest episode of Kaun Banega Crorepati 16, Paralympic athletes Navdeep Singh, Avani Lekhara, and Sumit Antil appeared as special guests and won Rs 25 lakhs.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-england-babar-azam-captain-saud-shakeel-test-series-2611873-2024-10-05",
      "headline": "Babar Azam stepping down as captain won't affect Test team: Saud ShakeelPAK vs ENG: Saud Shakeel said that Pakistan dressing room has a healthy environment and won't be affected after Babar Azam stepped down as the ODI and T20I skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-joe-root-new-bowling-attack-exciting-prospect-gus-atkinson-jack-leach-2611860-2024-10-05",
      "headline": "Joe Root 'excited' about new England bowling attack for Pakistan TestJoe Root expressed excitement about England's revamped bowling attack featuring fresh talents like Brydon Carse and Gus Atkinson, offering a balanced pace-spin combination for their first Test against Pakistan in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-towhid-hridoy-expects-a-slow-pitch-at-gwalior-stadium-2611861-2024-10-05",
      "headline": "1st T20I: Towhid Hridoy expects a 'slow pitch' at Gwalior stadium Bangladesh middle-order batter Towhid Hridoy has predicted a slow pitch for the opening T20I against India at the Shrimant Madhavrao Scindia Stadium. This will mark the venue's first international match, presenting both teams with an unfamiliar challenge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-pakistan-vs-england-multan-test-press-sachin-tendulkar-alastair-cook-record-2611844-2024-10-05",
      "headline": "Chasing Sachin Tendulkar's record? Joe Root says milestones don't motivate himPakistan vs England, Multan Test: Speaking to the press ahead of the first Test in Multan, Joe Root said milestones don't drive him any more and he is focussed on enjoying his time with the England cricket team. Root is just 70 runs behind England's all-time Test scorer, Alastair Cook. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-mumbai-double-hundred-brother-musheer-sarfaraz-khan-2611843-2024-10-05",
      "headline": "Irani Cup for Mumbai, my double hundred for brother Musheer: Sarfaraz KhanAfter Mumbai won the Iran Cup, Sarfaraz Khan dedicated his match-winning double-century in the Irani Cup to his brother Musheer, who missed the tournament due to an accident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-pakistan-cricket-players-2611825-2024-10-05",
      "headline": "R Ashwin empathises with Pakistan cricketers, highlights their dilemma amid chaosIndia spinner Ravichandran Ashwin has empathised with Pakistan players amidst a cricketing crisis in their country. Ashwin has highlighted the dilemma of the players amidst constant change in leadership positions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-youth-archery-championship-india-women-win-silver-medal-vaishnavi-pawar-2611799-2024-10-05",
      "headline": "Asian Youth Archery: Vaishnavi Pawar stars as Indian women win silverRising star Vaishnavi Pawar helped India secure silver in the recurve U-18 women's team category at the 2024 Asian Youth Archery Championship, defeating South Korea in the semifinals and narrowly missing gold against Chinese Taipei."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-gwalior-mosque-friday-security-issue-2611782-2024-10-05",
      "headline": "Bangladesh cricket team doesn't visit Gwalior mosque, holds Friday prayer at hotelIndia vs Bangladesh: Security has been stepped up in Gwalior amid a call for a 'Gwalior bandh' on match day by right-wing outfits in protest against alleged atrocities on Hindus in Bangladesh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-womens-team-faces-online-trolling-after-loss-vs-new-zealand-2611758-2024-10-05",
      "headline": "T20 World Cup: India women's team faces online trolling after loss vs New ZealandThe Indian women's team was heavily trolled after their T20 World Cup opener loss to New Zealand. The heavy bullying came after Harmanpreet Kaur lost their bearings and were bowled out for just 102 runs in Dubai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-series-ben-stokes-ruled-out-injury-ollie-pope-captain-2611747-2024-10-05",
      "headline": "Ben Stokes ruled out of first Test in Pakistan, return delayedBen Stokes has been ruled out of England's first Test against Pakistan as he continues to recover from a hamstring injury he picked up earlier this year. Ollie Pope will be stepping in as captain yet again for the Multan clash starting October 7, after a similar fate in the Sri Lanka series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-mumbai-win-15th-title-rest-of-india-tanush-kotian-sarfaraz-khan-2611753-2024-10-05",
      "headline": "Mumbai win Irani Cup for first time in 27 years after Tanush Kotian rescue actIrani Cup 2024: Mumbai held Rest of India to a draw after securing a first-innings lead in Lucknow. Ajinkya Rahane's men went on to win the domestic trophy for the 15th time, first triumph since the 1997-98 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-youth-archery-championship-india-women-win-silver-medal-vaishnavi-pawar-2611799-2024-10-05",
      "headline": "Asian Youth Archery: Vaishnavi Pawar stars as Indian women win silverRising star Vaishnavi Pawar helped India secure silver in the recurve U-18 women's team category at the 2024 Asian Youth Archery Championship, defeating South Korea in the semifinals and narrowly missing gold against Chinese Taipei."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-gwalior-mosque-friday-security-issue-2611782-2024-10-05",
      "headline": "Bangladesh cricket team doesn't visit Gwalior mosque, holds Friday prayer at hotelIndia vs Bangladesh: Security has been stepped up in Gwalior amid a call for a 'Gwalior bandh' on match day by right-wing outfits in protest against alleged atrocities on Hindus in Bangladesh. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-womens-team-faces-online-trolling-after-loss-vs-new-zealand-2611758-2024-10-05",
      "headline": "T20 World Cup: India women's team faces online trolling after loss vs New ZealandThe Indian women's team was heavily trolled after their T20 World Cup opener loss to New Zealand. The heavy bullying came after Harmanpreet Kaur lost their bearings and were bowled out for just 102 runs in Dubai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-series-ben-stokes-ruled-out-injury-ollie-pope-captain-2611747-2024-10-05",
      "headline": "Ben Stokes ruled out of first Test in Pakistan, return delayedBen Stokes has been ruled out of England's first Test against Pakistan as he continues to recover from a hamstring injury he picked up earlier this year. Ollie Pope will be stepping in as captain yet again for the Multan clash starting October 7, after a similar fate in the Sri Lanka series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-mumbai-win-15th-title-rest-of-india-tanush-kotian-sarfaraz-khan-2611753-2024-10-05",
      "headline": "Mumbai win Irani Cup for first time in 27 years after Tanush Kotian rescue actIrani Cup 2024: Mumbai held Rest of India to a draw after securing a first-innings lead in Lucknow. Ajinkya Rahane's men went on to win the domestic trophy for the 15th time, first triumph since the 1997-98 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-jim-ratcliffe-erik-ten-hag-sacking-talks-snub-2611736-2024-10-05",
      "headline": "Manchester United's Jim Ratcliffe snubs Ten Hag axing talks: Not my callManchester United co-owner Jim Ratcliffe dodged questions about Erik ten Hag's future amid the club's ongoing struggles, fueling speculation about the Dutch manager's job security following United's poor start to the season across all competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-tour-of-sri-lanka-squad-pooran-russell-hetmyer-absence-2611733-2024-10-05",
      "headline": "West Indies tour of Sri Lanka: Pooran, Russell and Hetmyer opt out of T20I seriesWest Indies tour of Australia: West Indies will be without some of their senior players, including Andre Russell and Shimron Hetmyer. The tourists will play three T20Is and as many ODIs in the island nation from October 13 to 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-gwalior-head-to-head-preview-live-streaming-all-you-need-to-know-2611716-2024-10-05",
      "headline": "IND vs BAN, 1st T20I Live streaming: All you need to knowIndia's youthful T20I squad, led by Suryakumar Yadav, prepares to maintain their winning momentum against Bangladesh in a three-match series starting October 6, with fresh talents and experienced players aiming for continued dominance in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-italian-legend-paolo-maldinis-son-daniel-earns-maiden-call-up-2611709-2024-10-05",
      "headline": "Italian legend Paolo Maldini's son Daniel earns maiden call upItaly coach Luciano Spalletti has named AC Milan defender Matteo Gabbia and Monza forward Daniel Maldini in a 23-man squad for their upcoming Nations League fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-carlos-alcaraz-winning-start-juncheng-shang-gesture-2611704-2024-10-05",
      "headline": "Shanghai Masters: Alcaraz off to winning start, touched by opponent's gestureAt the Shanghai Masters 2024, World No. 3 Carlos Alcaraz secured a commanding victory against local favorite Juncheng Shang, winning 6-2, 6-2 on Saturday. After the match, Alcaraz said he was moved by Shang's admiration for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-sri-lanka-live-streaming-when-and-where-to-watch-womens-t20-world-cup-match-2611705-2024-10-05",
      "headline": "AUS vs SL live streaming: When and where to watch Women's T20 World Cup matchAustralia vs Sri Lanka: The Australian women's team will begin their campaign on Saturday, October 5. Here's everything you need to know about when and where the defending champions begin their campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-ameilia-kerr-run-out-dead-ball-rule-sophie-devine-2611682-2024-10-05",
      "headline": "New Zealand captain Sophie Devine reacts to controversial run-out call New Zealand captain Sophie Devine, who inspired them to a big win over India in their Women's T20 World Cup opener, feels the run-out controversy surrounding Amelia Kerr may have \"stalled\" India's game flow, but she stressed the importance of respecting umpires' judgement. India found themselves amid an umpiring controversy against the Kiwis here on Friday, a match they lost by 58 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-tattoo-gods-plan-details-yash-dayal-sixes-india-vs-bangladesh-2611679-2024-10-05",
      "headline": "Watch: India star Rinku Singh reveals stunning details of his 'God's Plan' tattoo India vs Bangladesh: Speaking ahead of the three-match T20I series, star batter Rinku Singh revealed stunning details of his new tattoo. Rinku explained how his new tattoo symbolises the iconic five sixes he hit against Yash Dayal in an IPL 2023 match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-carlos-alcaraz-winning-start-juncheng-shang-gesture-2611704-2024-10-05",
      "headline": "Shanghai Masters: Alcaraz off to winning start, touched by opponent's gestureAt the Shanghai Masters 2024, World No. 3 Carlos Alcaraz secured a commanding victory against local favorite Juncheng Shang, winning 6-2, 6-2 on Saturday. After the match, Alcaraz said he was moved by Shang's admiration for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-sri-lanka-live-streaming-when-and-where-to-watch-womens-t20-world-cup-match-2611705-2024-10-05",
      "headline": "AUS vs SL live streaming: When and where to watch Women's T20 World Cup matchAustralia vs Sri Lanka: The Australian women's team will begin their campaign on Saturday, October 5. Here's everything you need to know about when and where the defending champions begin their campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-ameilia-kerr-run-out-dead-ball-rule-sophie-devine-2611682-2024-10-05",
      "headline": "New Zealand captain Sophie Devine reacts to controversial run-out call New Zealand captain Sophie Devine, who inspired them to a big win over India in their Women's T20 World Cup opener, feels the run-out controversy surrounding Amelia Kerr may have \"stalled\" India's game flow, but she stressed the importance of respecting umpires' judgement. India found themselves amid an umpiring controversy against the Kiwis here on Friday, a match they lost by 58 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-tattoo-gods-plan-details-yash-dayal-sixes-india-vs-bangladesh-2611679-2024-10-05",
      "headline": "Watch: India star Rinku Singh reveals stunning details of his 'God's Plan' tattoo India vs Bangladesh: Speaking ahead of the three-match T20I series, star batter Rinku Singh revealed stunning details of his new tattoo. Rinku explained how his new tattoo symbolises the iconic five sixes he hit against Yash Dayal in an IPL 2023 match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-run-out-t20-world-cup-2611680-2024-10-05",
      "headline": "Run-out incident probably broke India's momentum: Sophie DevineNew Zealand captain Sophie Devine felt that India lost their momentum after the run-out incident involving Amelia Kerr. In the 14th over, the umpires ruled it a dead ball after Kerr was run-out trying to sneak in a second run.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tough-loss-fielding-coaching-award-dressing-room-2611657-2024-10-05",
      "headline": "India will bounce back: Fielding coach Munish Bali lifts spirits after tough lossIndia vs New Zealand, Women's T20 World Cup: Fielding coach Munish Bali tried to lift the morale in the Indian dressing room after the Asian giants lost their opening match by 58 runs. Jemimah Rodrigues won the best fielder medal on Friday, October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-rishabh-pant-sledging-2611652-2024-10-05",
      "headline": "Rishabh Pant: Australia players unanimously name 'best sledger' from Indian teamAhead of the Border Gavaskar Trophy Australia stars revealed that Rishabh Pant was the biggest sledger from the Indian team. In a hilarious video, Travis Head, Marnus Labuschange and Usman Khawaja called Pant a very funny man.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-pr-sreejesh-exclusive-delhi-sg-pipers-mentor-director-2611637-2024-10-05",
      "headline": "A New Goal: PR Sreejesh times his transition from player to mentor perfectly Hockey India League: Speaking to IndiaToday.in, legendary hockey player PR Sreejesh opened up about resisting the urge to play again and transitioning into the role of a mentor for the new HIL franchise, Delhi SG Pipers. Sreejesh is confident that the HIL, returning after seven years, will do wonders for Indian hockey. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}