{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/emirates-signs-deal-to-accept-crypto-payments-report-2753227-2025-07-09",
      "headline": "Emirates signs deal to accept crypto payments for flight bookings: ReportIn recent years, the UAE has grown into a popular place for crypto companies. Many crypto firms have opened offices there or are planning to expand. Today, people in the UAE can already use cryptocurrencies to pay for things like real estate, school fees and even transport services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-176-points-lower-nifty-below-25500-hcltech-down-2-percent-2753166-2025-07-09",
      "headline": "Sensex closes 176 points lower, Nifty below 25,500; HCLTech down 2%The S&P BSE Sensex was down by 176.43 points to 83,536.08, while the NSE Nifty50 lost 46.40 points to 25,476.10 as of 3:47 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/reliance-jio-ipo-delay-2025-listing-unlikely-report-2753164-2025-07-09",
      "headline": "Reliance Jio IPO hits pause button, 2025 listing unlikely: ReportReliance Industries shares fell sharply after the news and were down 1.8% in afternoon trade, dragging the broader market into negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-aftermath-effect-dalal-street-stock-market-news-2753149-2025-07-09",
      "headline": "Sebi's ban on Jane Street: Could it rattle Dalal Street?While the ban is focused on a single player, many believe it may have wider effects on liquidity, trading volumes, investor confidence, and even foreign investor behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/71-percent-indians-fear-ai-scams-during-prime-day-report-2753134-2025-07-09",
      "headline": "71% Indians fear AI scams during Prime Day: ReportPrime Day scams India, AI shopping scams 2025, McAfee Prime Day scam report, Fake Amazon websites India, online shopping scam awareness, AI scam protection tips, Prime Day fake deals warning, Indians fear online scams, cyber fraud Prime Day India, deepfake scams online shopping"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-ipo-review-latest-gmp-subscribe-skip-allotment-listing-date-2753114-2025-07-09",
      "headline": "Travel Food Services IPO to close soon: Should you subscribe? Check latest GMPThe bidding for the IPO began on July 7 and is set to close soon. Travel Food Services has set the price band for the issue between Rs 1,045 and Rs 1,100 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-who-qualifies-for-zero-income-tax-2753102-2025-07-09",
      "headline": "ITR filing: Who qualifies for zero income tax?In her 2025 Budget speech, Finance Minister Nirmala Sitharaman shared big news. Under the new regime, if you earn up to Rs 12 lakh, you will not have to pay any income tax. Salaried taxpayers get an extra benefit too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-q1fy26-preview-infosys-tcs-wipro-gain-momentum-or-soft-quarter-equirus-securities-earnings-preview-2753054-2025-07-09",
      "headline": "Infosys, TCS, Wipro: Will top IT companies gain momentum in Q1FY26?Equirus Securities, in its earnings preview, signals a subdued performance for the sector, where even the heavyweights are struggling to regain momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-june-2025-mutual-fund-inflows-rise-24-percent-stock-market-news-2753021-2025-07-09",
      "headline": "Mutual fund inflows rise 24% in June to Rs 23,587 crore: AMFI dataAmong the 11 equity mutual fund categories, all except equity-linked savings schemes (ELSS) recorded positive inflows. Flexi cap funds emerged as the most preferred option for investors, bringing in Rs 5,733 crore in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/9-countries-where-indians-can-get-citizenship-for-less-than-rs-1-crore-2753019-2025-07-09",
      "headline": "9 countries where Indians can get citizenship for less than Rs 1 croreAcross many countries, it is now fully legal to buy citizenship. With a single payment or donation, Indians can get a fresh passport that offers visa-free access and minimal global taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-asset-management-files-for-ipo-check-details-2752973-2025-07-09",
      "headline": "ICICI Prudential Asset Management files for IPO. Check offer detailsThe IPO will be an offer for sale of up to 1.77 crore shares, representing 10% of the company's equity share capital. The shares will be sold by Prudential Corporation Holdings Limited (PCHL), a wholly-owned subsidiary of UK-based insurer Prudential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/crizac-share-price-ipo-listing-14-percent-premium-rs-280-bse-nse-dalal-street-2752968-2025-07-09",
      "headline": "Crizac IPO listing: Shares debut at 14% premium on Dalal StreetCrizac share price: The stock opened at Rs 280 on the Bombay Stock Exchange (BSE) showing a 14.29% premium on its Dalal Street debut. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apple-tv-plus-slow-horses-gary-oldman-spy-show-renewed-season-seven-2753296-2025-07-09",
      "headline": "Slow Horses renewed: Gary Oldman's spy-thriller upgraded for seventh seasonActor Gary Oldman's British spy-thriller series 'Slow Horses' has been renewed for the seventh season. The show is based on Mick Herron's spy novel series 'Slough House'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-trailer-lord-vishnu-and-prahalds-epic-tale-comes-alive-2753326-2025-07-09",
      "headline": "Mahavatar Narsimha trailer: Lord Vishnu and Prahald's epic tale comes aliveThe trailer for 'Mahavatar Narsimha' has been unveiled, showcasing a grand and emotional depiction of a pivotal mythological tale centred on Prahlada's devotion and divine intervention. Set to release in 3D across five Indian languages in July 2025, the film also marks the beginning of the ambitious Mahavatar Cinematic Universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-surprises-fans-at-metro-in-dino-screening-video-goes-viral-2753300-2025-07-09",
      "headline": "Ali Fazal surprises fans at Metro In Dino screening, video goes viralAli Fazal surprised fans with an unannounced visit to a theatre screening of 'Metro... In Dino', leaving the audience thrilled and the moment going viral. The film is already receiving a positive response from viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-to-expect-from-james-gunns-superman-and-why-watching-man-of-steel-is-crucial-2753260-2025-07-09",
      "headline": "What to expect from James Gunn's Superman, and why watching Man of Steel is crucialJames Gunn's 'Superman' might bring a new and exciting look, full of action and visuals, but might not go too deep into the characters. However, watching 'Man of Steel' before can help you understand the background better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-cena-jokes-margot-robbie-barbie-was-a-mistake-that-happened-over-dinner-2753295-2025-07-09",
      "headline": "John Cena jokes Margot Robbie's Barbie was a mistake that happened over dinnerHollywood star John Cena landed a role in the 2023 hit 'Barbie' through an unexpected meeting at a dinner hosted by Margot Robbie. He appeared in a cameo role in the Oscar-nominated film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shahana-goswami-lionsgate-play-four-years-later-ott-romance-this-weekend-2753199-2025-07-09",
      "headline": "Four Years Later tops OTT romance this weekend, here's all about Shahana's showActor Shahana Goswami's Australian-Indian romantic-drama 'Four Years Later' is all set for its digital debut in India. The series explores the emotional and cultural challenges faced by a migrant couple in an arranged marriage. Here's when and where to binge-watch the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ballard-ott-guide-cast-story-and-what-to-expect-from-bosch-spinoff-2753236-2025-07-09",
      "headline": "Ballard OTT guide: Cast, story, and what to expect from Bosch spinoffOTT's 'The Bosch' spin-off 'Ballard' dives deep into cold cases and corruption. The show premiered on July 9.  Here's all about it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/charlize-theron-the-old-guard-2-trending-on-netflix-top-charts-despite-poor-reviews-2753220-2025-07-09",
      "headline": "All about Charlize Theron's The Old Guard 2, Netflix film trending amid poor reviews'The Old Guard 2', headlined by Charlize Theron, has taken over the top spot on Netflix's global top 10 movies for the week. The film ranked number 1 on Netflix in 74 countries, including India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-zendaya-dune-3-official-title-confirmed-all-you-need-to-know-about-new-dune-movie-2753177-2025-07-09",
      "headline": "Timothee Chalamet and Zendaya's Dune 3 official title confirmed: ReportsDenis Villeneuve's 'Dune 3' has entered production. The film's official title has been confirmed and, contrary to fans' predictions, it's not 'Dune Messiah'. Find out more details here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shiva-rajkumar-channels-vintage-spy-look-in-666-operation-dream-theatre-2753226-2025-07-09",
      "headline": "Actor Shiva Rajkumar channels vintage spy look in 666 Operation Dream TheatreThe makers of '666 Operation Dream Theatre' unveiled Shiva Rajkumar's first look. Directed by Hemanth Rao, the film is said to be a spy action thriller. The retro styling and tone hint at a tribute to old-school espionage dramas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jeetendra-kumar-jaideep-ahlawat-jackson-wang-promise-fun-on-the-great-indian-kapil-sharma-show-2753161-2025-07-09",
      "headline": "Jeetu bhaiya, Jaideep Ahlawat, Jackson Wang promise fun on Kapil's show. WatchActors Jaideep Ahlawat, Pratik Gandhi, Jeetendra Kumar and Vijay Varma will feature in the next episode of 'The Great Indian Kapil Show'. K-Pop singer Jackson Wang would also make an appearance in the episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/freedom-movie-review-sasikumar-action-drama-sri-lankan-refugee-lost-opportunity-2753225-2025-07-09",
      "headline": "Freedom review: Sasikumar's action drama, based on true story, is lost opportunityRelease Date:Wed Jul 09, 2025Freedom movie review: Director Sathyasiva's 'Freedom', based on a true incident about Sri Lankan refugees, features Sasikumar, Lijomol Jose and Sudev Nair. The film has a solid story at its core, but is bogged down by sloppy execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sai-pallavi-junaid-khans-ek-din-to-release-in-november-report-2753189-2025-07-09",
      "headline": "Sai Pallavi, Junaid Khan's Ek Din to release in November: ReportThe upcoming film, 'Ek Din', starring Junaid Khan and Sai Pallavi, is set for release in November. Directed by Sunil Pandey, it will mark Pallavi's Bollywood debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedika-prakash-shetty-alia-bhatt-ex-assistant-arrested-for-alleged-fraud-2753181-2025-07-09",
      "headline": "Who is Vedika Shetty? Alia Bhatt's ex-assistant arrested for alleged fraudAlia Bhatt's former personal assistant, Vedika Prakash Shetty, has been arrested by Juhu Police following allegations of cheating the actor and her production house of over Rs 76 lakh. Know more about the former assistant. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desais-slams-paps-neha-bhasin-inappropriate-video-no-respect-2753040-2025-07-09",
      "headline": "Rashami Desai slams paps for inappropriate video of Neha Bhasin: You have no respectActor Rashami Desai criticised paparazzi for disrespecting Neha Bhasin in a recent viral video. She expressed disappointment over filming Bhasin from behind, despite her objections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/madhur-bhandarkar-begins-the-wives-shoot-mouni-roy-shares-pics-from-mahurat-2753129-2025-07-09",
      "headline": "Madhur Bhandarkar begins The Wives shoot with Mouni Roy, shares pics from muhuratFilmmaker Madhur Bhandarkar has begun shooting his next film 'The Wives' with Mouni Roy. He shared pictures from the film's mahurat on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tiger-shroff-wraps-baaghi-4-shoot-expresses-gratitude-in-new-post-2753152-2025-07-09",
      "headline": "Tiger Shroff wraps Baaghi 4 shoot, expresses gratitude in new postActor Tiger Shroff has wrapped the filming of the fourth installment of 'Baaghi'. He shared a post on Wednesday to announce the same. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-raj-b-shetty-praises-yash-for-the-first-time-we-vow-to-defend-raavana-2753145-2025-07-09",
      "headline": "Actor Raj B Shetty praises Yash: For the first time, we vow to defend RavanaAs the buzz around Nitesh Tiwari's 'Ramayana' grows, Kannada actor Raj B Shetty's poetic tribute to Yash's portrayal of Ravana adds a powerful moment of appreciation, highlighting camaraderie and a fresh lens on one of the mythology's complex figure."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/statement-on-preliminary-report-of-air-india-crash-likely-to-be-out-this-week-a-month-after-incident-2753315-2025-07-09",
      "headline": "Statement on initial report of Air India crash likely this week: SourcesMembers of the Parliamentary Standing Committee on Transport, Tourism and Culture were informed during a recent meeting that the preliminary findings of the crash probe may be released as early as this week, a month after the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-bridge-collapse-dead-injured-gujarat-vehicles-fall-mahisagar-river-gambhira-2753012-2025-07-09",
      "headline": "Bridge collapses in Gujarat, 11 dead as vehicles plunge, truck hangs by a threadGujarat Bridge Collapse: Preliminary information indicated at least five vehicles had fallen into the river after the bridge collapse. Calling the incident 'deeply saddening,' Chief Minister Bhupendra Patel said that one of the 23 spans of the nearly 900-metre-long bridge had collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elon-musks-starlink-gets-approval-to-operate-internet-satellites-over-india-2753323-2025-07-09",
      "headline": "Elon Musk's Starlink gets approval to operate internet satellites over IndiaThe rollout of Starlink's services will, however, remain subject to all relevant regulatory clearances, approvals, and licenses from government departments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/one-big-beautiful-bill-us-hikes-student-tourist-h1b-visa-charges-with-250-dollar-security-fee-donald-trump-integrity-fee-2753147-2025-07-09",
      "headline": "US hikes student, tourist, H-1B visa charges with $250 security depositNon-immigrant visa applicants, including students, professionals, and tourists, will have to pay a $250 \"Integrity Fee\", along with other travel-related fees, starting in 2026, to enter the US. The fee might be refunded under certain conditions, but will change annually as it is based on inflation rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-priyank-kharge-young-bjp-mp-operation-sindoor-delegation-us-trump-meeting-2753163-2025-07-09",
      "headline": "Did Centre know? Priyank Kharge flags report of 'young BJP MP' meeting TrumpIn a lengthy post on X, the Karnataka minister asked pointed questions about how the 'young BJP MP' bypassed diplomatic protocols and demanded accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-10-iga-swiatek-jannik-sinner-novak-djokovic-2753218-2025-07-09",
      "headline": "Day 10 Live: Swiatek qualifies for semis, Bencic wins 1st set vs AndreevaWimbledon 2025, Day 10 Updates: Iga Swiatek went through to the semis after beating Russia's Liudmila Samsonova in straight sets. Later in the day, Novak Djokovic and Jannik Sinner will play their respective quarterfinal matches. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/heavy-rain-across-delhi-ncr-red-alert-sounded-for-next-2-hours-2753311-2025-07-09",
      "headline": "Heavy rain across Delhi-NCR, red alert sounded for next 2 hoursHeavy rain lashed Delhi-NCR on Wednesday evening, with India Metereological Department (IMD) sounding red alert across the region for next two hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/mysuru-jayadeva-hospital-sees-long-queues-rush-sees-as-people-in-panic-over-heart-attack-deaths-2753215-2025-07-09",
      "headline": "Long queues at Mysuru hospital as people panic over rise in heart attack casesRecent media reports about a surge in heart attack-related deaths in Karnataka, especially in Hassan, has triggered panic among the public. Thousands have been queueing up daily at Jayadeva Hospital in Mysuru for cardiac check-ups, prompting doctors to urge calm and lifestyle changes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-gambhira-bridge-collapse-vadodara-woman-cry-for-help-son-drowning-2753241-2025-07-09",
      "headline": "My son is drowning: Mother's desperate cry for help after Gujarat bridge collapseAccording to information gathered from the site, the woman had been travelling to Bagdana along with her son, daughter, husband, and son-in-law when the bridge gave way. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-tourists-detained-russia-moscow-immigration-ordeal-appeal-modi-jaishankar-2753255-2025-07-09",
      "headline": "Treated like criminals: Indian tourist, held in Russia with others, seeks helpAn Indian tourist detained by Moscow immigration authorities with eight others appealed to the Indian embassy and Prime Minister Narendra Modi to intervene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhangur-baba-played-with-honour-of-our-hindu-sisters-daughters-yogi-adityanath-2753254-2025-07-09",
      "headline": "Chhangur Baba a criminal, played with women's dignity: Yogi Adityanath lauds arrestUttar Pradesh Chief Minister Yogi Adityanath said that the acts of the arrested mastermind of religious conversion mastermind Chhangur Baba were anti-national and anti-social."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/plane-crashes-in-rajasthans-churu-pilot-found-dead-2753112-2025-07-09",
      "headline": "2 pilots killed in IAF Jaguar jet crash in Rajasthan, third incident in 5 monthsSources told India Today TV that the aircraft was on a training sortie when it went down. The IAF operates multiple air bases in Rajasthan, with major installations in Jodhpur and Bikaner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/samsung-launches-ultra-thin-galaxy-z-fold-7-and-flip-7-more-affordable-galaxy-z-flip-7-fe-tags-along-2753327-2025-07-09",
      "headline": "Samsung launches ultra-thin Galaxy Z Fold 7 and Flip 7Samsung has unveiled three new foldable smartphones — Galaxy Z Fold 7, Flip 7, and Flip 7 FE — at its Unpacked 2025 event in New York, USA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indias-new-age-travellers-going-abroad-are-not-from-delhi-or-mumbai-but-2753096-2025-07-09",
      "headline": "India's new-age travellers going abroad are not from Delhi or Mumbai but...International travel is not a far-fetched dream any more that only people living in metros can afford. Contemporary travellers, mostly below the age of 35, from Tier 2 and Tier 3 cities are now the ones leading the way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-slams-sanjay-gaikwad-punch-video-sena-mla-hits-contractor-bjp-maharashtra-2753140-2025-07-09",
      "headline": "Unacceptable: Devendra Fadnavis rebukes Sena MLA for assaulting canteen staffMaharashtra Chief Minister Devendra Fadnavis talked tough after a video of Shiv Sena MLA Sanjay Gaikwad assaulting a canteen operator over the alleged poor quality of food served to him went viral, calling the act \"unacceptable\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/how-pm-modis-vision-has-made-india-the-most-trusted-ally-and-guiding-light-of-the-global-south-2753143-2025-07-09",
      "headline": "India steps up as guiding force and key ally in the Global SouthPM Modi's visit to Ghana, the first by an Indian Prime Minister in three decades, marked a historic milestone. His meetings with President John Dramani Mahama elevated bilateral ties to a Comprehensive Partnership, with a bold commitment to double trade within five years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/that-thing-in-the-corner-of-your-room-isnt-a-ghost-its-sleep-paralysis-insomnia-sonakshi-sinha-sleep-disorder-2753256-2025-07-09",
      "headline": "That thing in the corner of your room isn't a ghost; it's sleep paralysis In the shadows, a figure watches you, but you are powerless to scream in your sleep. This isn't just Sonakshi Sinha's ghost story; it could be the terrifying reality of sleep paralysis"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/kerala-mechanical-engineer-edison-babu-unmasked-as-ketamelon-indias-top-darknet-drug-vendor-after-ncb-raid-2753284-2025-07-09",
      "headline": "Who is Ketamelon? Kerala engineer behind India's top darknet drug ring arrestedA mechanical engineer from Kerala was arrested after being identified as \"Ketamelon,\" India's biggest darknet drug vendor. The arrest was made by the NCB which also seized LSD, Ketamine, and assets in a high-impact operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/food-inspectors-raid-mla-hostel-canteen-after-sena-leader-assaults-staffer-over-dal-collect-samples-for-tests-2753243-2025-07-09",
      "headline": "Food inspectors raid canteen after Sena MLA assaults staffer, collect samplesFood inspectors raided the Akashwani canteen, from where food is served at the MLA hostel, after Shiv Sena (Eknath Shinde) leader assaulted staffer over dal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-cargo-ship-arrested-msc-akiteta-msc-elsa-environmental-damage-high-court-vizhinjam-port-admiralty-act-2753135-2025-07-09",
      "headline": "A ship will be arrested in Kerala for its sibling's debts. Here's how and whyThe Kerala High Court has ordered the arrest of the cargo vessel MSC Akiteta II, anchored at Thiruvananthapuram's Vizhinjam Port. The arrest order was prompted by the Kerala government's bid to secure compensation for massive coastal damage caused by the sinking of its loaded sister vessel MSC Elsa III in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-12-year-old-child-slapped-bitten-for-closing-door-of-lift-in-housing-complex-2753286-2025-07-09",
      "headline": "Video: Man slaps, bites 12-year-old inside lift for closing door in MaharashtraCCTV footage shows the man entering the lift and repeatedly slapping the boy. He is also seen appearing to threaten the child and biting him on the arm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-pitch-conditions-rishabh-pant-press-conference-2753310-2025-07-09",
      "headline": "Did India force England to change Lord's pitch plan? Rishabh Pant reactsRishabh Pant said that the Indian team isn't thinking about England are planning with the Lord's pitch ahead of the third Test, which begins from July 10. A lot of talk has been about the Lord's pitch, which seemed to be on the greener side as compared to the tracks for the first two Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nimisha-priya-execution-yemen-kerala-nurse-overdose-yemeni-national-be-saved-human-rights-activist-samuel-jerome-2753146-2025-07-09",
      "headline": "Can Kerala nurse Nimisha Priya facing execution in Yemen be saved?Nimisha Priya, a Kerala nurse, is set to be executed on July 16 for murdering a Yemeni national in 2017. India Today TV spoke to human rights activist, Samuel Jerome, who has been negotiating with the victim's family since the beginning, to understand if she has any options left."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apple-tv-plus-slow-horses-gary-oldman-spy-show-renewed-season-seven-2753296-2025-07-09",
      "headline": "Slow Horses renewed: Gary Oldman's spy-thriller upgraded for seventh seasonActor Gary Oldman's British spy-thriller series 'Slow Horses' has been renewed for the seventh season. The show is based on Mick Herron's spy novel series 'Slough House'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-trailer-lord-vishnu-and-prahalds-epic-tale-comes-alive-2753326-2025-07-09",
      "headline": "Mahavatar Narsimha trailer: Lord Vishnu and Prahald's epic tale comes aliveThe trailer for 'Mahavatar Narsimha' has been unveiled, showcasing a grand and emotional depiction of a pivotal mythological tale centred on Prahlada's devotion and divine intervention. Set to release in 3D across five Indian languages in July 2025, the film also marks the beginning of the ambitious Mahavatar Cinematic Universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-surprises-fans-at-metro-in-dino-screening-video-goes-viral-2753300-2025-07-09",
      "headline": "Ali Fazal surprises fans at Metro In Dino screening, video goes viralAli Fazal surprised fans with an unannounced visit to a theatre screening of 'Metro... In Dino', leaving the audience thrilled and the moment going viral. The film is already receiving a positive response from viewers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/what-to-expect-from-james-gunns-superman-and-why-watching-man-of-steel-is-crucial-2753260-2025-07-09",
      "headline": "What to expect from James Gunn's Superman, and why watching Man of Steel is crucialJames Gunn's 'Superman' might bring a new and exciting look, full of action and visuals, but might not go too deep into the characters. However, watching 'Man of Steel' before can help you understand the background better."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-pitch-conditions-rishabh-pant-press-conference-2753310-2025-07-09",
      "headline": "Did India force England to change Lord's pitch plan? Rishabh Pant reactsRishabh Pant said that the Indian team isn't thinking about England are planning with the Lord's pitch ahead of the third Test, which begins from July 10. A lot of talk has been about the Lord's pitch, which seemed to be on the greener side as compared to the tracks for the first two Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-3rd-test-ben-stokes-press-conference-comeback-2753268-2025-07-09",
      "headline": "Stokes tight-lipped about batting form chatter, promises strong response at Lord'sEngland vs India, 3rd Test: Ben Stokes played down concerns over his batting form while promising a strong response from the hosts in the third Test, starting July 10 at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-pkl-season-12-start-date-2753285-2025-07-09",
      "headline": "Pro Kabaddi League: PKL season 12 set to start from August 29The 12th season of the Pro Kabaddi League is all set to start from August 29, the organisers announced on Wednesday, July 9. The upcoming season is expected to be the most competitive version of the PKL so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-honeymoon-period-sourav-ganguly-warning-2753248-2025-07-09",
      "headline": "Shubman Gill's honeymoon period not forever: Ganguly warns India captainShubman Gill has made a strong start as India's Test captain, but with three games left, the real challenge is still to come. Sourav Ganguly says it's easy when things are going well, true leadership is shown when the pressure is on.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-lewis-hamilton-ferrari-silverstone-loss-car-weather-2753235-2025-07-09",
      "headline": "Ferrari car balance, dicey weather: Hamilton reasons Silverstone let-downLewis Hamilton finished 4th at his home race at Silverstone. The seven-time world champion admitted that the Ferrari car was tough to drive in the challenging conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-10-iga-swiatek-jannik-sinner-novak-djokovic-2753218-2025-07-09",
      "headline": "Day 10 Live: Swiatek qualifies for semis, Bencic wins 1st set vs AndreevaWimbledon 2025, Day 10 Updates: Iga Swiatek went through to the semis after beating Russia's Liudmila Samsonova in straight sets. Later in the day, Novak Djokovic and Jannik Sinner will play their respective quarterfinal matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-jofra-archer-return-ben-stokes-2753198-2025-07-09",
      "headline": "Ben Stokes sends India Jofra Archer warning: No fixed bowling plans on returnBen Stokes said that the England squad are excited to have Jofra Archer back in the Test lineup as the pacer makes a return to the longest format of the game for the match against India, starting from July 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-400-brain-lara-chris-gayle-slams-zimbabwe-vs-south-africa-2753173-2025-07-09",
      "headline": "Wiaan Mulder should've gone for 400: Chris Gayle slams South Africa batterChris Gayle questioned Wiaan Mulder's bold declaration at 367*, arguing he missed a once-in-a-lifetime shot at Brian Lara's Test record. While South Africa won, Gayle insists greatness comes from chasing iconic milestones when they appear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-returns-no-gus-atkinson-lords-test-2753172-2025-07-09",
      "headline": "Jofra Archer returns after 4 years, no Atkinson as England announce Lord's Playing XIJofra Archer is making a return to the England Test side for the first time in four years as the hosts announced their playing XI for the match at Lord's, which will begin on July 10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-red-bull-racing-sack-christian-horner-sex-scandal-2753153-2025-07-09",
      "headline": "Red Bull sack Christian Horner as team principal, a year after sex texts scandalRed Bull Racing have sacked Christian Horner as the team principal, a year after his sex texts scandal. Horner worked as the team principal of Red Bull for the past 20 years and was in charge of the team during the recent British GP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-committed-new-zealand-cricket-contract-decline-2025-2753144-2025-07-09",
      "headline": "Kane Williamson committed to New Zealand cricket despite contract declineHead coach Rob Walter has confirmed that star batter Kane Williamson still wants to play international cricket for the Black Caps, despite skipping the upcoming tour of Zimbabwe and turning down a central contract for the 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-jofra-archer-return-ben-stokes-2753198-2025-07-09",
      "headline": "Ben Stokes sends India Jofra Archer warning: No fixed bowling plans on returnBen Stokes said that the England squad are excited to have Jofra Archer back in the Test lineup as the pacer makes a return to the longest format of the game for the match against India, starting from July 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-400-brain-lara-chris-gayle-slams-zimbabwe-vs-south-africa-2753173-2025-07-09",
      "headline": "Wiaan Mulder should've gone for 400: Chris Gayle slams South Africa batterChris Gayle questioned Wiaan Mulder's bold declaration at 367*, arguing he missed a once-in-a-lifetime shot at Brian Lara's Test record. While South Africa won, Gayle insists greatness comes from chasing iconic milestones when they appear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-returns-no-gus-atkinson-lords-test-2753172-2025-07-09",
      "headline": "Jofra Archer returns after 4 years, no Atkinson as England announce Lord's Playing XIJofra Archer is making a return to the England Test side for the first time in four years as the hosts announced their playing XI for the match at Lord's, which will begin on July 10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-red-bull-racing-sack-christian-horner-sex-scandal-2753153-2025-07-09",
      "headline": "Red Bull sack Christian Horner as team principal, a year after sex texts scandalRed Bull Racing have sacked Christian Horner as the team principal, a year after his sex texts scandal. Horner worked as the team principal of Red Bull for the past 20 years and was in charge of the team during the recent British GP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-committed-new-zealand-cricket-contract-decline-2025-2753144-2025-07-09",
      "headline": "Kane Williamson committed to New Zealand cricket despite contract declineHead coach Rob Walter has confirmed that star batter Kane Williamson still wants to play international cricket for the Black Caps, despite skipping the upcoming tour of Zimbabwe and turning down a central contract for the 2025 season."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}