{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-tax-free-benefit-pass-to-people-private-public-sector-finance-minister-nirmala-sitharaman-2782521-2025-09-05",
      "headline": "Exclusive: Will common man get insurance rate cut benefits in GST 2.0? FM answersFinance Minister Nirmala Sitharaman made it clear that the tax relief was introduced for citizens and not for insurance companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/popcorn-puzzle-solved-nirmala-sitharaman-explains-gst-classification-2782506-2025-09-05",
      "headline": "Popcorn puzzle solved: Nirmala Sitharaman explains GST classificationIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman explained why salted and chocolate-coated variants had earlier attracted different GST rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-petrol-diesel-is-still-not-part-of-gst-nirmala-sitharaman-answers-exclusive-interview-with-india-today-2782492-2025-09-05",
      "headline": "Why petrol, diesel is still not part of GST? Nirmala Sitharaman answersThe new GST 2.0 promises a simpler, two-rate structure and relief for many sectors. But fuel, petrol and diesel, remains outside its ambit. Finance Minister Nirmala Sitharaman has explained the reason behind this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-next-after-gst-20-finance-minister-nirmala-sitharaman-on-gst-30-plans-exclusive-interview-with-india-today-2782467-2025-09-05",
      "headline": "What's next after GST 2.0? Nirmala Sitharaman on GST 3.0 plansFinance Minister Nirmala Sitharaman has confirmed that GST 2.0, with its new two-slab framework, will begin on September 22. But the bigger question is, what lies ahead in GST 3.0?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/benz-vs-hawai-chappal-nirmala-sitharaman-on-why-india-isnt-ready-for-one-nation-one-tax-2782479-2025-09-05",
      "headline": "Benz vs Hawai chappal: Nirmala Sitharaman on why India isn't ready for uniform GSTIn an exclusive conversation with India Today TV, Finance Minister Nirmala Sitharaman stated that while \"one nation, one tax\" remains an aspirational idea, India's uneven levels of development make a uniform GST rate unfair."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/patralekhaa-opens-up-on-egg-freezing-struggles-pregnancy-was-way-easier-2782584-2025-09-05",
      "headline": "Pregnancy was way easier: Patralekhaa opens up on egg-freezing strugglesActor Patralekhaa, expecting her first child with husband Rajkummar Rao, opened up about the difficulties she faced during her egg-freezing journey three years ago, revealing that conceiving naturally was much easier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-bengal-files-movie-review-vivek-agnihotri-ruthless-hard-hitting-political-film-but-stretched-thin-2782426-2025-09-05",
      "headline": "The Bengal Files review: Ruthless, hard-hitting but stretched thinRelease Date:Fri Sep 05, 2025The Bengal Files review: Director Vivek Agnihotri's political-thriller 'The Bengal Files' is based on the 1946 Calcutta Killings and the Noakhali riots. Is the film able to do justice to a sensitive subject involving communal tensions and democracy? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-korean-dramas-use-time-travel-to-explore-love-regret-and-second-chances-2782367-2025-09-05",
      "headline": "How Korean dramas use time travel to explore love, regret and second chancesIn this week's K-fix we will discover how Korean dramas like 'A Time Called You', 'Moon Lovers: Scarlet Heart Ryeo', and 'Couple on the Backtrack' use time travel to explore love, regret, and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-odisha-contestant-reveals-father-forced-her-to-quit-studies-for-marriage-2782409-2025-09-05",
      "headline": "KBC 17: Odisha contestant says father forced her to quit studies for marriageIn the latest episode of 'Kaun Banega Crorepati 17', a contestant from Odisha revealed that she had to give up her job and that her father pressured her to marry at a young age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-visits-mumbai-months-after-sardaar-ji-3-row-2782405-2025-09-05",
      "headline": "Diljit Dosanjh visits Mumbai months after Sardaar Ji 3 rowSinger-actor Diljit Dosanjh made a rare appearance in Mumbai on Thursday. The visit came months after controversy over his film 'Sardaar Ji 3'. The actor recently wrapped filming for 'Border 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anoushka-shankar-calls-out-body-shaming-trolls-champions-self-love-2782524-2025-09-05",
      "headline": "Anoushka Shankar calls out body-shaming trolls, champions self-loveAcclaimed sitar maestro Anoushka Shankar has boldly confronted body-shaming remarks on social media, asserting her right to autonomy and self-respect. She shared a series of posts on Thursday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-aces-salt-and-pepper-look-leaked-pics-arshad-warsi-king-sets-siddharth-anand-2782512-2025-09-05",
      "headline": "Shah Rukh Khan aces salt and pepper look in leaked pics from King setsShah Rukh Khan is currently shooting for 'King' in Poland with Arshad Warsi. Pictures of the two stars from the sets have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-movie-review-tiger-shroff-film-is-25-hours-of-coma-and-you-pay-for-bed-2782480-2025-09-05",
      "headline": "Baaghi 4 review: Tiger Shroff's film is 2.5 hours of coma, and you pay for the bedRelease Date:Fri Sep 05, 2025Baaghi 4 movie review: It is not just another Tiger Shroff action film, it's a close to three-hour hallucination where the story collapses so fast you don't get time to process, care, or even hope for a comeback.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-11-written-update-baseer-ali-abhishek-bajaj-captain-mridul-tiwari-2782341-2025-09-05",
      "headline": "Bigg Boss 19 episode 11: Baseer defeats Abhishek to become new captainBigg Boss 19: Baseer Ali won the captaincy task after a heated argument with Abhishek Bajaj. Earlier in the day, Mridul Tiwari was injured during a task. Kunickaa Sadanand and Tanya Mittal also clashed with each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-x-twitter-internet-review-tiger-shroff-impresses-some-others-question-his-future-2782418-2025-09-05",
      "headline": "Baaghi 4 X review: Tiger Shroff impresses some, others question his futureSeveral X users have shared their reviews on actor Tiger Shroff's film 'Baaghi 4'. The film released in theatres on September 5 and also features Sanjay Dutt, Sonam Bajwa and Harnaaz Sandhu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/gst-2o-film-industry-benefit-government-new-reform-experts-weigh-in-2782419-2025-09-05",
      "headline": "Will the film industry benefit from government's new GST reform? Experts weigh inThe GST 2.0 reforms aim to make cinema tickets cheaper, but experts argue the impact will be minimal as Rs 100 tickets are nearly extinct. While single screens may see slight relief, multiplex audiences are unlikely to benefit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sivakarthikeyan-madharaasi-review-gun-culture-action-ar-murugadoss-film-2782408-2025-09-05",
      "headline": "Madharaasi review: Logic dies, but Sivakarthikeyan lives to tell gun culture taleRelease Date:Fri Sep 05, 2025Madharaasi movie review: Director AR Murugadoss's 'Madharaasi' starring Sivakarthikeyan, Rukmini Vasanth and Vidyut Jammwal, is a commercial actioner on gun culture. While the performances and action sequences win you over, the film's logical loopholes keep it a mediocre entertainer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-alia-bhatt-cheer-for-malayalam-hit-kalyani-priyadarshan-lokah-chapter-1-2782421-2025-09-05",
      "headline": "Priyanka Chopra, Alia Bhatt cheer for Malayalam hit Lokah: Added to my watchlist'Lokah Chapter 1: Chandra' has made a remarkable impact as Malayalam cinema's first female superhero film, blending mythology with contemporary fantasy to captivate audiences across India. Praised by Bollywood stars and shattering box office records, it heralds a new era for women-led stories in regional cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-defends-bollywood-box-officed-audience-power-evolving-trends-saiyaara-2782400-2025-09-05",
      "headline": "Not every film can be Saiyaara or Mahavatar Narsimha: KJo defends BollywoodKaran Johar addresses challenges in the Hindi film industry during 'Mirai' press meet. Speaking about 'Saiyaara' and 'Mahavatar Narsimha', he highlights that audience choice ultimately decides a film's success, rejecting any fixed formula or crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-conjuring-last-rites-review-horror-finale-ed-warren-lorraine-warren-saga-emotional-closure-2782353-2025-09-05",
      "headline": "The Conjuring Last Rites review: Horror compromised for a fairy tale closureRelease Date:Fri Sep 05, 2025The Conjuring Last Rites movie review: The Conjuring Last Rites concludes the Warrens' story with a personal investigation. The film offers emotional closure but falls short on delivering fresh horror thrills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/inspector-zende-manoj-bajpayee-netflix-true-crime-charles-sobhraj-review-2782348-2025-09-05",
      "headline": "Inspector Zende review: Manoj Bajpayee echoes Family Man magic in mediocre filmRelease Date:Fri Sep 05, 2025'Inspector Zende' focuses on the cop who caught Charles Sobhraj twice, with Manoj Bajpayee delivering a compelling performance. The film blends period authenticity with police rivalry, but struggles with an uneven script."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-donates-rs-11-lakh-to-lalbaugcha-raja-2782337-2025-09-05",
      "headline": "Amitabh Bachchan donates Rs 11 lakh to Lalbaugcha RajaVeteran actor Amitabh Bachchan recently donated Rs 11 lakh to Lalbaugcha Raja. A viral picture of a cheque with the actor's signature has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-ananya-panday-dance-atop-bar-counter-at-tu-meri-main-tera-main-tera-tu-meri-wrap-2782333-2025-09-05",
      "headline": "Kartik Aaryan, Ananya Panday dance atop bar counter at Tu Meri Main Tera wrap partyKartik Aaryan and Ananya Panday celebrated the wrap of their romantic comedy 'Tu Meri Main Tera, Main Tera Tu Meri' with a lively dance to Amitabh Bachchan's 'Jumma Chumma De De'. The viral video is being shared widely across platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gege-akutami-mojuro-everything-know-about-jujutsu-kaisen-spin-off-2782321-2025-09-05",
      "headline": "Gege Akutami's Mojuro: Everything to know about the Jujutsu Kaisen spin-offDespite its successful run, 'Jujutsu Kaisen' concluded suddenly in 2024, leaving fans eager to see what creator Gege Akutami would work on next."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-next-after-gst-20-finance-minister-nirmala-sitharaman-on-gst-30-plans-exclusive-interview-with-india-today-2782467-2025-09-05",
      "headline": "What's next after GST 2.0? Nirmala Sitharaman on GST 3.0 plansFinance Minister Nirmala Sitharaman has confirmed that GST 2.0, with its new two-slab framework, will begin on September 22. But the bigger question is, what lies ahead in GST 3.0?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/weve-lost-india-russia-to-darkest-china-trump-shares-pic-of-modi-putin-xi-together-from-sco-summit-2782533-2025-09-05",
      "headline": "Trump shares pic of PM, Putin, Xi together: We've lost India, Russia to ChinaThe India-US ties worsened following the 50 per cent tariffs imposed by Trump on New Delhi last month. The US levied 25 per cent base tariffs and another 25 per cent duty over India's continued purchase of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nirmala-sitharaman-finance-minister-exclusive-interview-gst-rate-cuts-reflect-in-mrp-or-corporates-get-gains-answers-2782487-2025-09-05",
      "headline": "Will GST rate cuts reflect on MRP or companies loot gains?With GST rate rationalisation, the government is trying to provide relief to the common man and boost the economy. But will companies pass on the benefits to people, or will they pocket the gains? Finance Minister Nirmala Sitharaman explained on India Today TV why she believes the benefits would be passed on to the aam aadmi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/inaccurate-and-misleading-statements-we-reject-them-new-delhi-on-trump-aide-peter-navarros-anti-india-rant-2782551-2025-09-05",
      "headline": "India rejects US trade hawk Peter Navarro's misleading, inaccurate remarksMEA spokesperson Randhir Jaiswal firmly rejected Peter Navarro's \"Brahmins are profiteering\" remark as \"inaccurate and misleading.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-multiple-messages-from-xi-jinping-military-parade-flex-china-2782470-2025-09-05",
      "headline": "The multiple messages from Xi's military parade flexFrom nuclear deterrence to multi-domain warfare, China announced its arrival as a power of consequence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-anil-chauhan-china-border-dispute-pakistan-operation-sindoor-2782574-2025-09-05",
      "headline": "China border dispute India's biggest challenge, will remain so: Defence chiefThe remarks by Chief of Defence Staff (CDS) General Anil Chauhan come at a time when India is warming up to China amid a downturn in ties with the US over trade and tariff issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ajit-pawar-video-woman-ips-officer-anjana-krishna-illegal-excavation-solapur-ncp-2782221-2025-09-05",
      "headline": "Have highest respect for cops: Ajit Pawar on rebuking woman officer in viral videoIn the viral video, Deputy Chief Minister Ajit Pawar is heard telling IPS officer Anjana Krishna to halt the police crackdown on illegal murrum excavation in Maharashtra's Solapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/donald-trump-why-pentagon-pizza-index-orders-tracked-amid-us-president-dead-buzz-dominos-papa-johns-viral-trend-tracker-2782030-2025-09-05",
      "headline": "How pizza deliveries signal US military, political emergencyEarlier this week, when speculation over Donald Trump's alleged death was swirling, the Pentagon Pizza Index surged by 800%. Pizza orders near the Pentagon—the headquarters of the US Defence Department—are considered a barometer, hinting at officials at work for hours, during a crunch situation. This was also the case in June when the US bombed Iran. Even Soviet spies kept an eye on pizza orders during the Cold War. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-movie-review-tiger-shroff-film-is-25-hours-of-coma-and-you-pay-for-bed-2782480-2025-09-05",
      "headline": "Baaghi 4 review: Tiger Shroff's film is 2.5 hours of coma, and you pay for the bedRelease Date:Fri Sep 05, 2025Baaghi 4 movie review: It is not just another Tiger Shroff action film, it's a close to three-hour hallucination where the story collapses so fast you don't get time to process, care, or even hope for a comeback.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-police-increase-security-lashkar-e-jihadi-threat-anant-chaturdashi-2782404-2025-09-05",
      "headline": "'14 Pak terrorists, 400 kg RDX': Mumbai Police on high alert after threat messageThe threat message claimed that human bombs had been planted in 34 vehicles in Mumbai and that the city would be \"shaken\" after the blasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shilpa-shetty-look-out-notice-raj-kundra-mumbai-police-rs-60-crore-fraud-case-bollywood-2782476-2025-09-05",
      "headline": "Lookout notice against actor Shilpa Shetty, Raj Kundra in Rs 60-crore fraud caseShilpa Shetty and Raj Kundra are accused of diverting nearly Rs 60 crore from Best Deal TV for personal use, prompting an Lookout Circular (LOC) by Mumbai Police. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-kerala-tweet-mocks-bihar-bidis-gst-reforms-bjp-backlash-2782314-2025-09-05",
      "headline": "B for Bidis and Bihar: Congress jibe backfires, apologises, BJP says exposedCongress Kerala unit's tweet mocking Bihar and bidis under GST reforms sparked a political uproar. Bihar NDA leaders condemned the remark, calling it insult to the state.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/the-bengal-files-movie-review-vivek-agnihotri-ruthless-hard-hitting-political-film-but-stretched-thin-2782426-2025-09-05",
      "headline": "The Bengal Files review: Ruthless, hard-hitting but stretched thinRelease Date:Fri Sep 05, 2025The Bengal Files review: Director Vivek Agnihotri's political-thriller 'The Bengal Files' is based on the 1946 Calcutta Killings and the Noakhali riots. Is the film able to do justice to a sensitive subject involving communal tensions and democracy? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/500-rejections-23-year-old-northeast-openai-wfh-job-rs-20-lakh-monthly-2782491-2025-09-05",
      "headline": "After 500 rejections, 23-year-old lands OpenAI WFH job, earns Rs 20 lakh monthlyA 23-year-old engineer from Northeast India faced 500+ job rejections before landing a WFH job with OpenAI paying Rs 20 lakh per month. This was a big hike from his earlier Rs 3.6 lakh LPA job, proving remote work can open doors for small-town talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-tech-ceos-zuckerberg-sundar-pichai-tim-cook-white-house-dinner-timing-trade-deals-2782441-2025-09-05",
      "headline": "Trump flexes US tech muscle in dinner meet with CEOs. But why now?Days after China flexed its military muscle in its Victory Day parade, President Donald Trump flaunted what the US prides itself on - AI and technology. On Thursday, the who's who of Silicon Valley attended a lavish dinner meet at the White House."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/unfazed-by-praise-for-gst-reforms-finance-minister-nirmala-sitharaman-says-focus-remains-on-duty-2782557-2025-09-05",
      "headline": "Unfazed by praise for GST reforms, Nirmala Sitharaman says focus remains on dutyTurning philosophical, Nirmala Sitharaman said she accepts appreciation as it comes and, in the face of criticism, reminds herself to work harder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/up-man-thrashed-by-wife-and-her-family-after-dispute-over-samosas-video-goes-viral-2782514-2025-09-05",
      "headline": "UP man thrashed by wife and her family after dispute over samosas, video goes viralIt all started after Sangeeta asked her husband Shivam to bring her samosas. Shivam set out but lost his money on the way and returned home empty-handed, which led to a heated argument."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-vs-carlos-alcaraz-live-streaming-timing-details-2782532-2025-09-05",
      "headline": "Novak Djokovic aims to break semis curse, mess up 'Sincaraz' final hypeUS Open 2025: Novak Djokovic returns to the semifinals at Flushing Meadows chasing a record 25th Grand Slam, but faces the in-form Carlos Alcaraz, who has stormed through the draw without dropping a set.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/do-your-homework-nirmala-sitharaman-exclusive-hits-back-at-opposition-on-gst-criticism-2782513-2025-09-05",
      "headline": "Do your homework: Nirmala Sitharaman hits back at Opposition over GST criticismNirmala Sitharaman slammed the Opposition over its GST criticism, saying they were misinformed and should \"do their homework\" before making claims. She defended the timing of reforms, arguing previous governments failed to implement GST for decades due to lack of trust from states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-korean-dramas-use-time-travel-to-explore-love-regret-and-second-chances-2782367-2025-09-05",
      "headline": "How Korean dramas use time travel to explore love, regret and second chancesIn this week's K-fix we will discover how Korean dramas like 'A Time Called You', 'Moon Lovers: Scarlet Heart Ryeo', and 'Couple on the Backtrack' use time travel to explore love, regret, and second chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/japanese-woman-80-loses-rs-6-lakh-romance-scam-astronaut-stuck-in-space-needs-oxygen-to-return-2782599-2025-09-05",
      "headline": "Japanese woman, 80, duped of Rs 6 lakh in romance scam by 'astronaut stuck in space'Authorities in Hokkaido said the woman first encountered the individual on social media in July. The man, who claimed to be working as an astronaut, gradually won her trust in what investigators are calling a romance scam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gst-20-what-it-means-for-students-parents-and-schools-2782395-2025-09-05",
      "headline": "GST 2.0: What it means for students, parents and schoolsGST 2.0 makes India's tax system simpler with two main rates. Parents benefit from cheaper notebooks and supplies while school fees stay tax-free, but coaching classes and online courses remain expensive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/kate-middleton-debuts-bold-new-look-blonde-hair-2782493-2025-09-05",
      "headline": "Hello blonde hair: Kate Middleton debuts bold new lookUK royal Kate Middleton created a major buzz as she debuted her new blonde look, a striking departure from her signature chestnut hair."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-pretoria-capitals-head-coach-sa20-auction-graeme-smith-2782576-2025-09-05",
      "headline": "SA20: Sourav Ganguly's debut as head coach sparks buzz in South AfricaSourav Ganguly will take on the role of head coach of Pretoria Capitals in the upcoming SA20 season. Speaking to the media on Friday, League Commissioner Graeme Smith welcomed Dada to South Africa and explained why no Indian players are part of this year's auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-jersey-sponsor-dream-11-new-rates-asia-cup-bcci-online-gaming-act-2782577-2025-09-05",
      "headline": "BCCI hikes Team India jersey sponsorship rates after Dream11's exitThe BCCI has increased Team India's jersey sponsorship rates, making it costlier for brands to associate with the national team. The revision follows Dream11's exit after the government's Online Gaming Act 2025 came into effect."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/luis-suarez-apology-inter-miami-leagues-cup-seattle-sounders-major-league-soccer-2782567-2025-09-05",
      "headline": "Luis Suarez issues apology for spitting incident in Inter Miami's League Cup finalLuis Suarez has apologised for his controversial spitting incident during Inter Miami's Leagues Cup Final loss to Seattle Sounders. He admitted that frustration got the better of him and pledging to make amends as MLS reviews disciplinary action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-door-always-open-csk-dewald-brevis-ipl-2025-experience-2782541-2025-09-05",
      "headline": "MS Dhoni always kept his door open for advice: Dewald Brevis recalls CSK journeyDewald Brevis reflected on his IPL 2025 stint with Chennai Super Kings, calling MS Dhoni's mentorship career-shaping. The South African also enjoyed a record-breaking year in international cricket, including the fastest T20I century by a Proteas batter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-novak-djokovic-vs-carlos-alcaraz-live-streaming-timing-details-2782532-2025-09-05",
      "headline": "Novak Djokovic aims to break semis curse, mess up 'Sincaraz' final hypeUS Open 2025: Novak Djokovic returns to the semifinals at Flushing Meadows chasing a record 25th Grand Slam, but faces the in-form Carlos Alcaraz, who has stormed through the draw without dropping a set.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-t20i-retirement-teammates-not-inform-mitchell-marsh-pat-cummins-2782471-2025-09-05",
      "headline": "Mitchell Starc admits he forgot to inform teammates of T20I retirementMitchell Starc has retired from T20 internationals, surprising teammates and fans alike. The veteran pacer, Australia's second-highest T20I wicket-taker, chose to focus on Tests and ODIs, with the 2027 World Cup and packed red-ball calendar in sight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/naomi-osaka-us-open-semifinal-loss-labubu-plush-reveal-comeback-2782453-2025-09-05",
      "headline": "Osaka jokes US Open exit stings less than missing her 'Osaka labubu' revealNaomi Osaka lost a marathon US Open semifinal but stayed positive about her comeback. She missed unveiling a special Labubu plush in the final, which disappointed her fans and herself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/john-cena-final-smackdown-chicago-brock-lesnar-wrestlepalooza-retirement-tour-2782195-2025-09-05",
      "headline": "John Cena's retirement tour: Chicago SmackDown could be his final appearanceJohn Cena is set for a potentially final SmackDown appearance in Chicago, with the event also expected to set the stage for a high-profile showdown with Brock Lesnar, further intensifying the anticipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-harry-brook-dismisses-fatigue-as-excuse-after-odi-series-defeat-2782415-2025-09-05",
      "headline": "ENG vs SA: Harry Brook dismisses fatigue as excuse after ODI series defeatHarry Brook said that despite the constant workload on key players, he wants his best side to play in every white-ball game. He is focused on the next two ICC tournaments and admitted to making tactical blunders in the second ODI against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-injury-surgery-indian-football-team-cafa-nations-cup-aiff-2782416-2025-09-05",
      "headline": "After CAFA Cup let down, AIFF confirms Sandesh Jhinghan has undergone suregerySandesh Jhingan's cheekbone fracture and subsequent surgery have left India's Asian Cup qualifying hopes hanging in the balance. With the veteran sidelined, centre-back partner Anwar Ali will now be tasked with anchoring the defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/walker-cup-2024-cypress-point-top-amateur-golfers-us-uk-2782231-2025-09-05",
      "headline": "Top 10 amateurs set to shine at legendary Cypress Point in CaliforniaThe Walker Cup returns to the legendary Cypress Point Club after more than four decades. This exclusive amateur golf event showcases top talent amid stunning coastal views, drawing keen attention despite competing sports broadcasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/naomi-osaka-us-open-semifinal-loss-labubu-plush-reveal-comeback-2782453-2025-09-05",
      "headline": "Osaka jokes US Open exit stings less than missing her 'Osaka labubu' revealNaomi Osaka lost a marathon US Open semifinal but stayed positive about her comeback. She missed unveiling a special Labubu plush in the final, which disappointed her fans and herself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/john-cena-final-smackdown-chicago-brock-lesnar-wrestlepalooza-retirement-tour-2782195-2025-09-05",
      "headline": "John Cena's retirement tour: Chicago SmackDown could be his final appearanceJohn Cena is set for a potentially final SmackDown appearance in Chicago, with the event also expected to set the stage for a high-profile showdown with Brock Lesnar, further intensifying the anticipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sa-harry-brook-dismisses-fatigue-as-excuse-after-odi-series-defeat-2782415-2025-09-05",
      "headline": "ENG vs SA: Harry Brook dismisses fatigue as excuse after ODI series defeatHarry Brook said that despite the constant workload on key players, he wants his best side to play in every white-ball game. He is focused on the next two ICC tournaments and admitted to making tactical blunders in the second ODI against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-injury-surgery-indian-football-team-cafa-nations-cup-aiff-2782416-2025-09-05",
      "headline": "After CAFA Cup let down, AIFF confirms Sandesh Jhinghan has undergone suregerySandesh Jhingan's cheekbone fracture and subsequent surgery have left India's Asian Cup qualifying hopes hanging in the balance. With the veteran sidelined, centre-back partner Anwar Ali will now be tasked with anchoring the defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/walker-cup-2024-cypress-point-top-amateur-golfers-us-uk-2782231-2025-09-05",
      "headline": "Top 10 amateurs set to shine at legendary Cypress Point in CaliforniaThe Walker Cup returns to the legendary Cypress Point Club after more than four decades. This exclusive amateur golf event showcases top talent amid stunning coastal views, drawing keen attention despite competing sports broadcasts."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}