{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-213-points-lower-nifty-below-24900-tata-motors-down-2-percent-2742082-2025-06-17",
      "headline": "Sensex ends 213 points lower, Nifty below 24,900; Tata Motors down 2%Sensex ends 213 points lower, Nifty below 24,900; Tata Motors down 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/savings-accounts-interest-rates-fall-rbi-cuts-fixed-deposits-debt-mutual-funds-2742063-2025-06-17",
      "headline": "Savings account interest rates see sharp drop. Do you really need one?A look into the declining utility of savings accounts as interest rates fall, questioning their role in financial growth and suggesting alternative investment options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/octafx-forex-trading-fraud-scam-enforcement-directorate-investors-raids-mumbai-delhi-mule-accounts-url-masking-fake-e-commerce-platforms-2742067-2025-06-17",
      "headline": "Mule accounts, url masking: How forex trading platform OctaFX scammed investorsThe Enforcement Directorate on June 13 conducted raids at seven locations across four cities, and various incriminating documents and digital devices seized during the operation showed how forex trading platform - OctaFX - cheated investors and generated more than Rs 800 crore in less than a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hyderabad-real-estate-price-rise-80-percent-outpaces-delhi-mumbai-bengaluru-2742020-2025-06-17",
      "headline": "Over 80% jump: The city that outpaced Delhi, Mumbai in property price growthOver the past four years, one city has quietly clocked an 80% surge in home prices, outshining Delhi, Mumbai, and Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-location-importance-crude-oil-india-israel-iran-tensions-stock-market-inflation-2741920-2025-06-17",
      "headline": "Why the Strait of Hormuz matters to India amid Israel-Iran tensionsThe Strait of Hormuz is located between Iran to the north and Oman and the United Arab Emirates (UAE) to the south. It connects the Persian Gulf to the Gulf of Oman, and then to the Arabian Sea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-unemployment-rate-rises-may-2025-youth-women-affected-2741900-2025-06-17",
      "headline": "India's unemployment rate rises to 5.6% in May 2025Rural areas saw a considerable rise in unemployment among those aged 15–29, with the rate reaching 13.7% in May from 12.3% in April. The situation was similarly difficult for urban youth, where unemployment marginally increased to 17.9% from 17.2% the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vishal-mega-mart-share-price-drop-stock-crash-stake-sale-promoter-samayat-services-llp-2741875-2025-06-17",
      "headline": "Explained: Why Vishal Mega Mart shares crashed 8% todayDespite the drop, Vishal Mega Mart's shares have done well overall this year. They have risen 18% in 2025 so far, outperforming the Nifty index, which has given a return of 5% year-to-date. Since the company's listing, the stock has gained 12%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bank-fixed-deposits-decline-indian-households-prefer-mutual-funds-equities-2741869-2025-06-17",
      "headline": "Explained: Why fixed deposits are losing appeal among Indian householdsOnce the go-to option for safety-first savers, fixed deposits are steadily losing favour. Read on to know what's driving the shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trend-strong-rally-iran-israel-conflict-limited-impact-reason-explained-2741852-2025-06-17",
      "headline": "Explained: Why Dalal Street hasn't panicked amid ongoing Iran–Israel conflictDespite war jitters and foreign outflows, domestic markets held firm. With retail inflows steady and domestic themes strong, is the buy-the-dip playbook still the smartest move?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-titan-tata-motors-down-1-percent-2741849-2025-06-17",
      "headline": "Sensex opens flat, Nifty below 25,000; Titan down 1%The S&P BSE Sensex was down by 194.71 points to 81,601.44, while the NSE Nifty lost 69 points to 24,877.50 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/arisinfra-solutions-ipo-june-2025-price-band-gmp-listing-2741840-2025-06-17",
      "headline": "Arisinfra Solutions IPO to open for bidding: All you need to knowArisinfra Solutions, a tech-driven B2B platform in the construction materials industry, is launching its IPO on June 18, seeking to raise Rs 499.60 crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-17-sensex-nifty-today-trading-setup-nse-bse-iran-israel-war-us-wall-street-2741825-2025-06-17",
      "headline": "Stock market opening: Will Sensex, Nifty rise again today?At 8:12 am, the Gift Nifty futures were trading at 24,957. This points to a likely flat start for the Nifty50, which closed at 24,946.5 on Monday."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samyuktha-joins-vijay-sethupathi-in-puri-jagannadh-upcoming-pan-india-film-2741961-2025-06-17",
      "headline": "Samyuktha joins Vijay Sethupathi in Puri Jagannadh's upcoming pan-India filmActor Samyuktha has been confirmed to play the lead role opposite Vijay Sethupathi in Puri Jagannadh's untitled pan-India project. The film will be released in multiple languages across India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-snaps-at-paps-outside-her-gym-in-mumbai-2742051-2025-06-17",
      "headline": "Stop it guys: Samantha snaps at paps taking pictures of her outside her gymActor Samantha Ruth Prabhu snapped at the paparazzi stationed outside her gym in Mumbai. She requested them to stop and looked visibly irked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/genelia-deshmukh-joins-long-work-hours-debate-says-its-not-impossible-2742016-2025-06-17",
      "headline": "Genelia Deshmukh joins long work hours debate, says 10-hour shifts not impossibleActor Genelia Deshmukh shared her thoughts on long working hours in the film industry. She said she often works 10–12 hours a day but believes it's manageable with the right understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rekha-is-not-easy-find-director-muzaffar-ali-on-why-he-wouldnt-remake-umrao-jaan-2741909-2025-06-17",
      "headline": "Rekha is not easy find: Director Muzaffar Ali on why he wouldn't remake Umrao JaanDirector Muzaffar Ali's epic musical-drama 'Umrao Jaan' is all set to re-release in theatres. In an interview recently, he talked about the possibility of remaking the 1981 cult classic and why it wouldn't make sense now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-chitrangda-singh-apoorva-lakhia-military-action-film-2741994-2025-06-17",
      "headline": "Salman Khan and Chitrangda Singh team up for Apoorva Lakhia's next filmSalman Khan and Chitrangda Singh are set to star together for the first time in Apoorva Lakhia's upcoming military action drama. The untitled film is inspired by real events and marks a significant commercial outing for Chitrangda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aishwarya-rai-iconic-devdas-saree-look-created-overnight-by-designer-neeta-lulla-2741968-2025-06-17",
      "headline": "Aishwarya Rai's iconic Devdas saree created overnight, says designer Neeta LullaAishwarya Rai's iconic climax look in 'Devdas' was created overnight by designer Neeta Lulla after a last-minute request from director Sanjay Leela Bhansali. The dramatic saree scene became one of the film's most memorable moments and contributed to its National Award-winning costume design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-on-career-gaps-after-heeramandi-success-2741913-2025-06-17",
      "headline": "Aditi Rao Hydari opens up about career gaps after Heeramandi success: Still waitingDespite receiving immense praise for her role in 'Heeramandi', Aditi Rao Hydari revealed she hasn't signed a new project yet. She also opened up about the ongoing challenges women face in the entertainment industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-mourns-her-uncle-death-offers-condolences-to-mannara-chopra-2741944-2025-06-17",
      "headline": "Priyanka Chopra mourns her uncle's death, offers condolences to Mannara Actor Priyanka Chopra offered condolences to her family members, cousin Mannara Chopra, after the death of the latter's father. She shared a note on her Instagram stories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/payment-issues-delay-akshay-kumars-welcome-to-the-jungle-again-2741911-2025-06-17",
      "headline": "Akshay Kumar's Welcome To The Jungle delayed again due to payment issues: ReportAkshay Kumar's highly anticipated film, 'Welcome To The Jungle' (Welcome 3), is reportedly facing financial trouble, which halted the film's production since August 2023. The film was originally scheduled to release on December 20, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhavan-fatima-sana-shaikhs-aap-jaisa-koi-to-release-on-netflix-in-july-2741927-2025-06-17",
      "headline": "Madhavan, Fatima Sana Shaikh's Aap Jaisa Koi to release on Netflix in JulyThe release date of 'Aap Jaisa Koi', Netflix's upcoming romance drama, is out. It stars R Madhavan and Fatima Sana Shaikh in lead roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/al-pacino-becomes-first-actor-to-meet-pope-leo-xiv-2741907-2025-06-17",
      "headline": "Al Pacino becomes first actor to meet Pope Leo XIVLegendary actor Al Pacino met with Pope Leo XIV on Monday, becoming the first-ever movie star to do so. The 85-year-old icon marked a historic moment with this meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-ahan-shetty-start-shooting-border-2-with-sunny-deol-varun-dhawan-2741891-2025-06-17",
      "headline": "Diljit Dosanjh, Ahan Shetty start shooting Border 2 with Sunny Deol, Varun DhawanThe third schedule for 'Border 2' has begun in Pune, with actors Diljit Dosanjh and Ahan Shetty joining the rest of the cast. The film is being directed by Anurag Singh and also stars Sunny Deol and Varun Dhawan in important roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-reveals-als-battle-says-has-one-functioning-arm-2741873-2025-06-17",
      "headline": "Actor Eric Dane breaks silence on ALS battle: Will lose left side mobility soonActor Eric Dane opened up about his battle with ALS. In a heartbreaking interview, he grew emotional while discussing his diagnosis, revealing that one of his arms has completely stopped functioning. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-thudaram-plagiarism-director-sanal-kumar-sasidharan-2741868-2025-06-17",
      "headline": "Mohanlal's Thudaram accused of plagiarism by director Sanal Kumar SasidharanMalayalam director Sanal Kumar Sasidharan accused the makers of Mohanlal's 'Thudarum' of plagiarism. He alleged that the story of 'Thudarum' is written with the skeleton of the screenplay of his 2020 film 'Theeyattam'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bobby-deol-wishes-son-aryaman-on-24th-birthday-with-rare-selfie-celebs-react-2741857-2025-06-17",
      "headline": "Bobby Deol wishes son Aryaman on 24th birthday with rare selfie, celebs reactBobby Deol's heartwarming post for his son Aryaman's 24th birthday is winning hearts. He marked the occasion by sharing a rare selfie of the two together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasans-film-with-vetri-maaran-goes-on-floors-jailer-director-to-play-cameo-2741824-2025-06-17",
      "headline": "Simbu's film with Vetri Maaran goes on floors, Jailer director to play cameoActor Silambarasan's untitled film with director Vetri Maaran has commenced. A picture of the two and director Nelson Dilipkumar has been leaked on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/matthew-perry-friends-actor-death-ketamine-doctor-california-salvador-plasencia-agree-plead-guilty-moron-2741823-2025-06-17",
      "headline": "Doctor who gave ketamine to Matthew Perry, called actor moron, to plead guiltyDr. Salvador Plasencia, who was charged with supplying 'Friends' actor Matthew Perry with ketamine in the month leading up to his overdose death in 2023, has agreed to plead guilty, according to a signed document filed in federal court in Los Angeles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-cameo-companion-keneeshaa-single-amid-his-divorce-battle-with-aarti-2741804-2025-06-17",
      "headline": "Actor Ravi Mohan stars in companion Keneeshaa's single amid divorce with AartiActor Ravi Mohan played a cameo in his 'companion' Keneeshaa's music video, 'Andrum Indrum'. This video comes amid Ravi's divorce battle with his estranged wife, Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mannara-chopra-father-raman-rai-handa-dies-at-72-2741747-2025-06-17",
      "headline": "Mannara Chopra's father dies at 72, actor shares postActor Mannara Chopra's father, Raman Rai Handa, died on June 16. He was 72. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/on-iran-israel-conflict-trump-says-he-wants-a-real-end-not-a-ceasefire-2742074-2025-06-17",
      "headline": "Real end, not just a ceasefire: Trump's endgame on Iran-Israel conflictTrump, who left the G7 summit early due to the Middle East situation, said the US is looking at a \"real end\" to Iran-Israel conflict and not a ceasefire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-air-india-crash-mbbs-students-jump-from-hostel-to-escape-fire-in-new-video-2742003-2025-06-17",
      "headline": "New Air India crash videos show students jumping off balcony as smoke billowsSeveral videos have surfaced showing how people in nearby hostels tried to save their lives by climbing down from balconies after the London-bound Air India flight, with 242 on board, crashed into the BJ Medical College Hostel near Ahmedabad airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-years-away-nuclear-bomb-united-states-intel-report-counters-israel-claim-2742058-2025-06-17",
      "headline": "Iran 3 years away from nuclear bomb, not months, US intel counters Israel: ReportIran-Israel War: The intel assessment bares the differences between Israel and the US while dissecting the extent of Iran's nuclear program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-london-flight-cancelled-due-to-technical-glitch-same-route-on-which-ai171-crashed-2741956-2025-06-17",
      "headline": "Air India London flight cancelled due to snag. Same route on which AI 171 crashedThe ill-fated AI 171, which crashed in Ahmedabad last week, killing 274 people, was retired after the incident and replaced with AI 159."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-extremists-plot-ambush-during-pm-modi-canada-visit-g7-summit-kananaskis-alberta-trump-carney-2741942-2025-06-17",
      "headline": "Khalistanis plot 'ambush' during PM Modi's Canada visitKhalistani separatists in Alberta staged an \"ambush\" protest during PM Narendra Modi's G7 visit, shouting violent slogans. The anti-Modi rallies in Calgary drew Canadian media attention, but many journalists also praised PM Mark Carney's decision to invite Modi, viewing it as a signal that Canada is beginning to push back against separatist pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-escalate-attacks-on-day-5-of-conflict-donald-trump-proposes-ceasefire-2741822-2025-06-17",
      "headline": "Not for Iran ceasefire like publicity-seeking Macron said: Trump on early G7 exit Live UpdatesFrench President Emannuel Macron has claimed that US President Donald Trump has offered to broker a truce between Israel and Iran. Dismissing Macron's claims, Trump said that he had to cut short his G7 Summit meeting for a different reason and 'has nothing to do' with a ceasefire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-cancels-delhi-paris-flight-says-pre-flight-checks-identified-an-issue-2742083-2025-06-17",
      "headline": "Air India cancels Delhi-Paris flight after Dreamliner fails pre-flight checksThe aircraft was undergoing mandatory pre-flight checks when an issue was detected. The glitch is presently being addressed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/youtuber-social-media-influencer-kanchan-kumari-queen-murder-punjab-bhatinda-akal-takht-head-granthi-defame-religions-stopped-2741954-2025-06-17",
      "headline": "Nothing wrong: Akal Takht head granthi justifies Punjab YouTuber's murderGiani Malkit Singh, head granthi of Akal Takht Sahib, said that those who defame religions by indulging in vulgarity must be stopped, while commenting on the recent murder of popular YouTuber, Kanchan Kumari. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-pm-keir-starmer-grooming-gang-louise-casey-national-enquiry-young-white-girls-raped-tortured-abused-2741990-2025-06-17",
      "headline": "Gang-rape, torture cases made UK PM take U-turn on grooming gangsUK Prime Minister Keir Starmer has launched a national enquiry into grooming gang crimes, reversing Labour Party's earlier stance after mounting public and political pressure. The decision follows a damning review by Baroness Louise Casey, which exposed years of systemic failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cant-allow-mob-vigilance-to-take-over-supreme-court-says-kamal-haasans-thug-life-must-release-in-karnataka-2741936-2025-06-17",
      "headline": "Not Karnataka High Court's role to demand apology: Top court slams Thug Life banThe Supreme Court strongly criticised Karnataka's ban on Thug Life, stating that mobs cannot dictate film screenings. It transferred the case to itself, slamming the Karnataka High Court over suggestions that the actor apologise to resolve the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-beijing-is-worried-about-pm-modi-g7-visit-chinese-chatter-2741620-2025-06-17",
      "headline": "Chinese chatter: Why Beijing is worried about Modi's G7 visitAs PM Modi attends the G7 Summit, China watches closely, concerned over rare-earth diplomacy and India's balancing act between the West and Global South amid growing geopolitical unease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-shadow-of-sanjay-how-indira-gandhi-son-shaped-the-emergency-2741974-2025-06-17",
      "headline": "The shadow of Sanjay: How Indira Gandhi's son shaped the EmergencyThe second part of the Democracy's Darkest Hour series chronicles how Indira Gandhi's doubts and her son Sanjay Gandhi's ambition triggered one of the most repressive chapters in India's political history."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/society/story/victim-mentality-worst-enemy-self-sabotage-signs-way-out-of-it-2741829-2025-06-17",
      "headline": "Victim mentality is your worst enemy. How to come out of itEven though it may seem like an easy escape or a way to avoid blame, victim mentality is actually a survival strategy for many. For them, it's not a choice they make, but a default setting imposed by life. However, it comes with many downsides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-ali-shadmani-eliminated-wartime-chief-killed-idf-ayatollah-khamenei-2742004-2025-06-17",
      "headline": "Israel says it killed Iran's top military commander who took charge 4 days agoMajor General Ali Shadmani, Iran's top wartime commander and head of the Khatam-al Anbiya Central HQ, was killed in an Israeli airstrike in Tehran just four days after taking charge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-model-murder-sheetal-sunil-sonipat-police-cctv-footage-2742044-2025-06-17",
      "headline": "CCTV clip shows Haryana model entering car with lover hours before her murderHaryana-based model Sheetal, 24, was found with her throat slit and injuries in other parts of the body in a canal on Sunday. A car was also recovered from the canal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-us-iran-meeting-nuclear-deal-ceasefire-israel-war-2741892-2025-06-17",
      "headline": "Make-or-break moment? US, Iran talks likely this week on N-deal, says reportIran-Israel War: The meeting, if it goes through, could be a make-or-break moment in the conflict and decide if the US will join the offensive in a bid to eliminate Iran's nuclear program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rishi-sunak-akshata-murty-return-to-stanford-as-commencement-speakers-viral-video-2741881-2025-06-17",
      "headline": "Rishi Sunak and Akshata Murty return to Stanford, where it all beganRishi Sunak and Akshata Murty returned to Stanford after two decades, sharing life lessons, laughter, and love at the very place where their journey began."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-model-sheetal-murder-sonipat-boyfriend-arrested-sunil-2741858-2025-06-17",
      "headline": "Boyfriend arrested for Haryana model's murder. She found out he was marriedThe body of Sheetal was recovered from a canal in Sonipat on Monday with slit marks around her neck. Her boyfriend has confessed to stabbing her to death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-location-importance-crude-oil-india-israel-iran-tensions-stock-market-inflation-2741920-2025-06-17",
      "headline": "Why the Strait of Hormuz matters to India amid Israel-Iran tensionsThe Strait of Hormuz is located between Iran to the north and Oman and the United Arab Emirates (UAE) to the south. It connects the Persian Gulf to the Gulf of Oman, and then to the Arabian Sea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-day-5-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2741862-2025-06-17",
      "headline": "Live: Israel to expand operations in Iran, says intel chiefIsrael-Iran Conflict Live Updates: Both Israel and Iran launched several missiles at each other as the conflict entered its fifth day. Amid the ongoing crisis in the Middle East, G7 leaders gathered in Canada urged an end to hostilities between Iran and Israel, with French President Emmanuel Macron revealing that his US counterpart, Donald Trump, has already initiated a truce deal between the two warring nations. However, dismissing Macron's ceasefire claims, Trump said that he had left for Washington DC for something \"much bigger than that.\" Trump did not clarify what issue prompted his sudden return but concluded his post with a cryptic \"Stay Tuned!\"\r\n\r\nIsrael on Tuesday warned over 3,30,000 people to evacuate central Tehran, signalling a possible escalation in its military offensive on Iran. \r\n\r\nShortly after, the Israeli Defence Forces (IDF) released footage and details of overnight airstrikes targeting Iranian military infrastructure in western Iran, describing the operation as a major blow to Tehran's missile capabilities.\r\n\r\nFollow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/shimlas-damini-brar-cracks-iit-phd-nimhans-and-net-all-without-coaching-classes-2742011-2025-06-17",
      "headline": "Shimla woman clears toughest exams without coaching, bags Rank 1 in IIT entrancesDamini Singh Brar from Himachal Pradesh cleared IIT, NIMHANS, and UGC-NET without coaching. She will now pursue a PhD in Psychology from IIT Delhi after securing the top rank in the entrance exam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-husband-wife-chilli-powder-private-parts-hot-iron-torture-suspects-love-affair-muzaffarpur-2741951-2025-06-17",
      "headline": "Man puts chilli powder in wife's private parts, burns her with iron over 'affair'The woman alleged that her husband, who has been arrested, even tried to electrocute her and locked her in a room without food or water for two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-surpasses-pakistan-more-nuclear-warheads-added-more-since-2024-china-operation-sindoor-sipri-report-2741906-2025-06-17",
      "headline": "India surpasses Pakistan in nuke arsenal, adds 8 more warheads: ReportAccording to the yearbook by the Stockholm International Peace Research Institute, India currently has 180 nuclear warheads as opposed to 170 in Pakistan's stockpile. India increased its arsenal size in 2025 by adding eight more warheads."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/strange-signal-detected-from-deep-inside-antarctica-no-one-knows-what-it-is-2742002-2025-06-17",
      "headline": "Strange new signal detected beneath Antarctica. No one knows what it isScientists are unable to explain this phenomenon and are speculating that it may hint at new types of phenomena or interactions previously unknown to science, the team said. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-and-joe-root-will-re-create-anderson-kohli-rivalry-rob-key-2742079-2025-06-17",
      "headline": "Bumrah and Joe Root will re-create Anderson-Kohli rivalry: England directorEngland's Managing Director of Men's Cricket, Rob Key, has said that Jasprit Bumrah and Joe Root rivalry will recreate the thrill of the battle between Virat Kohli and James Anderson in the upcoming series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-balanced-delivery-stride-glenn-mcgrath-stuart-broad-2742022-2025-06-17",
      "headline": "Bumrah's delivery stride is as balanced as Glenn McGrath's: Stuart BroadFormer England pacer Stuart Broad has praised Jasprit Bumrah's bowling style, comparing it to Glenn McGrath's balanced delivery stride. Broad highlighted Bumrah's pace and competitive spirit as key factors in the upcoming Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-returns-to-top-spot-in-odi-batting-rankings-2742028-2025-06-17",
      "headline": "Mandhana returns to top spot in ODI batting rankings as Wolvaardt drops to 2ndIndia batter Smriti Mandhana has returned to the top spot in the ICC ODI batting rankings in the latest update as Laura Wolvaardt drops to second spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-jasprit-bumrah-jos-buttler-2742021-2025-06-17",
      "headline": "Jasprit Bumrah is the biggest superstar in Indian cricket: ButtlerJos Buttler described Jasprit Bumrah as the biggest superstar in Indian cricket. He said that Bumrah's unique bowling style challenges every single batter in world cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-wins-club-world-cup-opener-against-lafc-in-near-empty-stadium-2741962-2025-06-17",
      "headline": "Atmosphere for Chelsea's Club World Cup opener a bit strange: MarescaChelsea head coach Enzo Maresca admitted the atmosphere was \"a bit strange\" as his side began their FIFA Club World Cup campaign in front of nearly 50,000 empty seats at the Mercedes-Benz Stadium in Atlanta.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-sends-best-wishes-to-angelo-mathews-for-his-final-test-2741912-2025-06-17",
      "headline": "Rohit Sharma sends best wishes to Angelo Mathews for his final TestStar India batter Rohit Sharma sent his best wishes to Sri Lanka all-rounder Angelo Mathews, who's set to retire from Tests after the first game of the ongoing series against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-four-day-tests-2027-29-wtc-india-australia-england-five-day-matches-report-2741908-2025-06-17",
      "headline": "ICC plans 4-day Tests in 27-29 WTC cycle, Ind, Aus, Eng to play 5-day matchesThe ICC is set to sanction four-day Tests for smaller cricketing nations in the 2027-29 World Test Championship cycle. This change aims to help smaller countries play more Tests while traditional five-day matches will continue for India, Australia and England in major series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-will-be-a-perfect-mix-of-virat-kohli-and-rohit-sharma-as-captain-jos-buttler-2741887-2025-06-17",
      "headline": "Shubman Gill will be a perfect mix of Kohli and Rohit as captain: Jos ButtlerStar England batter Jos Buttler has predicted that Shubman Gill will be a perfect mix of Rohit Sharma and Virat Kohli as Test captain. Gill's first assignment as skipper will be the series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/paris-diamond-league-javelin-start-list-neeraj-chopra-peters-julian-weber-2741879-2025-06-17",
      "headline": "Neeraj Chopra, Anderson Peters lead javelin start list in ParisNeeraj Chopra will compete in the Paris Diamond League on June 20, aiming for his first major title of the season. The seven-man javelin field will also feature Germany's Julian Weber and Grenada's Anderson Peters, promising a high-quality contest in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-sophie-devine-to-retire-from-odis-after-women-world-cup-2025-2741856-2025-06-17",
      "headline": "New Zealand's Sophie Devine set to retire from ODIs after Women's World CupNew Zealand captain Sophie Devine has announced that she will retire from Women's One-Day Internationals (ODIs) after the upcoming 50-over World Cup in India and Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-four-day-tests-2027-29-wtc-india-australia-england-five-day-matches-report-2741908-2025-06-17",
      "headline": "ICC plans 4-day Tests in 27-29 WTC cycle, Ind, Aus, Eng to play 5-day matchesThe ICC is set to sanction four-day Tests for smaller cricketing nations in the 2027-29 World Test Championship cycle. This change aims to help smaller countries play more Tests while traditional five-day matches will continue for India, Australia and England in major series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-will-be-a-perfect-mix-of-virat-kohli-and-rohit-sharma-as-captain-jos-buttler-2741887-2025-06-17",
      "headline": "Shubman Gill will be a perfect mix of Kohli and Rohit as captain: Jos ButtlerStar England batter Jos Buttler has predicted that Shubman Gill will be a perfect mix of Rohit Sharma and Virat Kohli as Test captain. Gill's first assignment as skipper will be the series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/paris-diamond-league-javelin-start-list-neeraj-chopra-peters-julian-weber-2741879-2025-06-17",
      "headline": "Neeraj Chopra, Anderson Peters lead javelin start list in ParisNeeraj Chopra will compete in the Paris Diamond League on June 20, aiming for his first major title of the season. The seven-man javelin field will also feature Germany's Julian Weber and Grenada's Anderson Peters, promising a high-quality contest in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-sophie-devine-to-retire-from-odis-after-women-world-cup-2025-2741856-2025-06-17",
      "headline": "New Zealand's Sophie Devine set to retire from ODIs after Women's World CupNew Zealand captain Sophie Devine has announced that she will retire from Women's One-Day Internationals (ODIs) after the upcoming 50-over World Cup in India and Sri Lanka."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}