{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/muhurat-trading-ends-in-green-cipla-bajaj-finserv-among-top-gainers-2806126-2025-10-21",
      "headline": "Muhurat Trading ends in green; Cipla, Bajaj Finserv among top gainersThe BSE Sensex and NSE Nifty50 both closed in the green, led by gains in Cipla and Bajaj Finserv, even as mid-session profit booking trimmed early advances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/business-today/video/samvat-2082-experts-see-new-highs-bet-on-domestic-sectors-2806115-2025-10-21",
      "headline": "Samvat 2082: Experts see new highs, bet on domestic sectorsFor investors, Bandyopadhyay recommends focusing on domestic growth stories. \"Cement, infrastructure, construction, and capital goods will lead the charge,\" he noted, highlighting Ultratech Cement, L&T, and Bharti Airtel as top picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-250-points-nifty-above-25900-infosys-gains-over-1-2806070-2025-10-21",
      "headline": "Muhurat Trading 2025: Sensex, Nifty dip after strong opening; Infosys up 1%The BSE Sensex rose 180.76 points, or 0.21%, to 84,544.13, while the NSE Nifty50 climbed 62.60 points, or 0.24%, to 25,905.75 at 1:50 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-bonus-investment-tips-maximise-profit-growth-mistakes-to-avoid-2806011-2025-10-21",
      "headline": "How to make the most of your Diwali bonus and build long-term wealthTurn your Diwali bonus into a stepping stone for long-term financial security with these expert-backed tips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-rebound-buy-or-wait-dip-muhurat-trading-diwali-2805982-2025-10-21",
      "headline": "Gold hits Rs 1.30 lakh again, silver at Rs 1.58 lakh: Buy now or wait for a dip?Gold and silver are regaining momentum amid festive demand and global uncertainty. Investors should buy with discipline, stagger purchases, and treat bullion as a long-term hedge rather than chasing short-term spikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/diwali-muhurat-trading-2025-how-to-make-the-most-of-todays-one-hour-special-session-2805947-2025-10-21",
      "headline": "Muhurat Trading today: Your quick guide to today's one-hour special sessionAs Muhurat Trading 2025 begins this afternoon, optimism runs high on Dalal Street. With Nifty near record highs and liquidity improving, experts suggest discipline, stock selection, and long-term focus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-on-diwali-as-reliance-bank-stocks-shine-2805815-2025-10-20",
      "headline": "Sensex, Nifty end higher on Diwali as Reliance, bank stocks shineThe BSE Sensex rose 0.5% to 84,363.37, while the NSE Nifty50 gained 0.49% to 25,851—both hitting fresh one-year highs. Over the past four sessions, the indices have climbed 2.8%, leaving them less than 2% away from their all-time highs scaled in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesThe Chinese Commerce Ministry has alleged that the measures by India violate several WTO obligations, including the principle of national treatment, and constitute import substitution subsidies, which are explicitly prohibited under the multi-lateral trade rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-on-october-21-everything-investors-need-to-know-special-market-session-2805749-2025-10-20",
      "headline": "Muhurat Trading on October 21: Check timing, trade strategy and moreMuhurat Trading will take place on October 21 this year. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm, and a closing session until 3:05 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-shares-jump-q2-results-diwali-portfolio-buy-sell-explained-2805722-2025-10-20",
      "headline": "Reliance shares jump 3% after Q2 results. Should it be in your Diwali portfolio?Around 10:20 am, shares of Reliance Industries rose 3.22% to Rs 1,462.60 on the Bombay Stock Exchange (BSE). The stock's sharp upmove added to the broader market rally on Dalal Street as sentiment turned upbeat following a string of solid earnings reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-rare-earth-export-curbs-impact-eu-industries-auto-defence-response-glbs-2805666-2025-10-20",
      "headline": "EU to hold urgent talks on European industries hit by China's rare earth curbsChina, the world's leading producer of the minerals used to make magnets crucial to the auto, electronics and defence industries, this month announced new controls on the export of rare-earth technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zoho-sridhar-vembu-gold-price-warning-systemic-risk-global-economy-2805062-2025-10-18",
      "headline": "Gold flashing a big warning signal: Zoho's Sridhar Vembu says amid rising pricesAs gold prices soar globally, Zoho's Sridhar Vembu raises a red flag. Does the surge signal investor anxiety and eroding trust in the system or reveal a deeper economic fault line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yeonjun-solo-album-no-labels-part-1-release-november-2025-2806130-2025-10-21",
      "headline": "TXT's Yeonjun announces his first solo album NO LABELS: Part 1 Yeonjun of TXT is set to release his first solo album NO LABELS: Part 1 on November 7, 2025. The album marks a new phase in his career, highlighting artistic freedom and fresh collaborations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayan-mukerji-quits-dhoom-4-shifts-focus-brahmastra-sequel-report-2806108-2025-10-21",
      "headline": "Ayan Mukerji quits Dhoom 4, shifts focus to Brahmastra sequel: Report Director Ayan Mukerji reportedly left 'Dhoom 4' after his vision did not match the film's creative direction. Yash Raj Films is now likely to consider new talent for the directorial role and main cast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pavitra-punia-finds-love-again-celebrates-diwali-with-partners-family-usa-2806097-2025-10-21",
      "headline": "Pavitra Punia finds love again, celebrates Diwali in US Actor Pavitra Punia has confirmed she is in a new relationship with a US-based businessman and is set to celebrate Diwali with his family. Punia expressed mixed emotions about celebrating away from her own family for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/jennifer-aniston-father-films-nepotism-2806118-2025-10-21",
      "headline": "Jennifer Aniston says actor-father dissuaded her from films, snubs nepotism talk Jennifer Aniston says her father, actor John Aniston, told her to \"get a real job\" rather than pursue acting. The 'Friends' star has also addressed the nepotism debate.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vash-level-2-ott-release-when-and-where-to-watch-janki-bodiwala-supernatural-horror-film-2806104-2025-10-21",
      "headline": "Vash Level 2 OTT release: When and where to watch Janki Bodiwala's supernatural horror film 'Vash Level 2', the Gujarati supernatural psychological horror sequel, is set to release on Netflix on October 22 in both Gujarati and Hindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-first-diwali-married-couple-festive-photos-2806083-2025-10-21",
      "headline": "Naga Chaitanya-Sobhita's first Diwali together is all about love and light Naga Chaitanya and Sobhita Dhulipala celebrated their first Diwali as a married couple with intimate, colourful festivities at home. Their Hyderabad wedding was a grand affair, and both stars are now busy with exciting new projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-mourns-asranis-death-a-timeless-artist-remembered-always-2806080-2025-10-21",
      "headline": "Aamir Khan mourns Asrani's death: A timeless artist, remembered always Actor Aamir Khan on Tuesday condoled the death of veteran actor Govardhan Asrani on social media. Asrani, aged 84, died following a prolonged illness and was recently hospitalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thamma-movie-review-ayushmann-khurrana-turns-vampire-with-rashmika-mandanna-but-film-has-no-life-left-to-suck-2806085-2025-10-21",
      "headline": "Thamma review: Ayushmann turns vampire, but film has no life left to suckRelease Date:Tue Oct 21, 2025 Thamma movie review: Ayushmann Khurrana turns vampire in Aditya Sarpotdar's 'Thamma' -- a horror-romance that promises bite but lacks soul. Despite its ambitious link to Maddock's horror-comedy universe, the film feels lifeless, uneven, and drained of charm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-x-twitter-reviews-internet-divided-over-ayushmann-khurrana-rashmika-mandanna-horror-comedy-2806057-2025-10-21",
      "headline": "Thamma X reviews: Internet divided over Ayushmann-Rashmika's horror comedy Ayushmann Khurrana and Rashmika Mandanna's fantasy drama 'Thamma' has drawn mixed reactions, earning praise for its story and performances but criticism for its music and character arcs. The film's plot and star cast have made it a trending topic on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ilaiyaraaja-begin-second-symphony-mothers-death-anniversary-dubai-opera-success-2806060-2025-10-21",
      "headline": "Ilaiyaraaja to start work on his second western classical symphony. Watch video Ilaiyaraaja to begin work on his second symphony after marking his mother's death anniversary. The composer expressed gratitude to fans following his Dubai symphony performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/they-call-him-og-to-param-sundari-where-and-what-to-watch-on-ott-this-week-2806064-2025-10-21",
      "headline": "They Call Him OG to Param Sundari: Where and what to watch on OTT this week This week, OTT platforms bring a diverse lineup of releases, including crime thrillers, romantic comedies, action films, and high-stakes reality shows. Highlights include 'Mirage', 'Pitch To Get Rich', 'Harlan Coben's Lazarus', and 'They Call Him OG'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indian-police-force-honoured-by-rani-mukerji-on-police-day-2025-2806053-2025-10-21",
      "headline": "On Indian Police Day 2025, Rani Mukerji pays tribute ahead of Mardaani 3 On Indian Police Day 2025, actress Rani Mukerji expressed deep gratitude to the Indian Police Force. Her remarks highlight the selfless dedication of police personnel and aim to inspire greater respect for their sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-56-farrhana-bhatt-malti-chahar-clash-altaf-raja-concert-lights-up-the-house-2806036-2025-10-21",
      "headline": "BB19 episode 56: Farrhana-Malti clash, Altaf Raja's concert lights up the house Farrhana and Malti's ongoing verbal clashes dominated in the latest 'Bigg Boss' episode, with tensions rising over personal comments and alliances. Amid the drama, the house enjoyed a soulful live performance by Altaf Raja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-kabir-bahia-diwali-celebration-photos-dating-rumours-2806006-2025-10-21",
      "headline": "Kriti Sanon, Kabir Bahia's Diwali celebration fuel dating rumours. See photos Actor Kriti Sanon and her rumoured partner and businessman Kabir Bahia celebrated Diwali together. Their photos from the celebration at Kriti's home caught the attention of fans online, sparking further interest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lakshya-tiger-shroff-dharma-productions-revenge-drama-raj-mehta-2805989-2025-10-21",
      "headline": "Lakshya joins Tiger Shroff in Dharma's new revenge drama: Report Lakshya has reportedly signed a new Dharma Productions film following the success of 'The Ba***ds of Bollywood'. The project is expected to feature a face-off with Tiger Shroff and will be directed by Raj Mehta, not Karan Johar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govardhan-asrani-final-films-bhooth-bangla-and-haiwaan-to-release-in-2026-2805988-2025-10-21",
      "headline": "Late actor Asrani's final films Bhooth Bangla and Haiwaan to release in 2026 Late actor Govardhan Asrani will appear in 'Bhooth Bangla' and 'Haiwaan' after his death. Both films are directed by Priyadarshan and will be released in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-panics-after-losing-her-engagement-ring-talks-about-bond-with-govinda-2805996-2025-10-21",
      "headline": "Sunita Ahuja panics after losing her engagement ring, talks about bond with Govinda Sunita Ahuja shared in her vlog that she lost her engagement solitaire gifted by Govinda but later found it safely in her bag after praying at the Mumba Devi Temple. During her visit, she expressed deep love for her husband, dismissing ongoing rumours of their separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-nagarjuna-nayanthara-venkatesh-celebrate-diwali-hyderabad-2805978-2025-10-21",
      "headline": "Chiranjeevi celebrates Diwali with Nagarjuna, Nayanthara and Venkatesh. Viral pics Chiranjeevi hosted a Diwali celebration in Hyderabad, attended by Nagarjuna, Nayanthara, and Venkatesh and their families. The gathering was shared on social media, featuring moments of camaraderie among the stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-first-diwali-parents-joyful-video-2805981-2025-10-21",
      "headline": "Kiara-Sidharth celebrate 1st Diwali as parents, fans can't get enough of their glow Kiara Advani made her first public appearance after the birth of her baby girl, celebrating Diwali with husband Sidharth Malhotra in a joyful video shared online. The couple's happiness and festive greetings won the hearts of fans as they marked their first Diwali as parents."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chandigarh-former-dgp-son-akeel-akhtar-murder-mohammad-mustafa-affair-daughter-in-law-punjab-police-2806037-2025-10-21",
      "headline": "Ex-cop's son dies, family says drug overdose. Then, a bombshell video emergesPolice have registered a case against former Punjab DGP Mohammad Mustafa, his wife Razia Sultana, and family members after their late son's pre-recorded explosive video alleged abuse and murder conspiracy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/blamegame-over-delhi-pollution-bjp-claims-aap-pushing-punjab-farmers-to-burn-stubble-2806120-2025-10-21",
      "headline": "BJP claims AAP forcing Punjab farmers to burn stubble amid Delhi pollutionDelhi Minister Manjinder Singh Sirsa launched a sharp attack on the Aam Aadmi Party, accusing it of deliberately making Punjab farmers burn stubble to worsen Delhi's pollution and defame Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-dk-shivakumar-kiran-shaw-biocon-roads-garbage-civic-infrastructure-2805997-2025-10-21",
      "headline": "Damage control? Kiran Shaw, DK Shivakumar meet amid Bengaluru infra criticism rowKiran Mazumdar-Shaw met Karnataka Deputy Chief Minister DK Shivakumar at his residence. Sources said they discussed her criticism of Bengaluru's poor roads and garbage issues. Shivakumar reportedly assured her that the grievances would be addressed promptly"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mohsin-naqvi-official-mail-asia-cup-trophy-handover-2806079-2025-10-21",
      "headline": "BCCI warns Mohsin Naqvi of escalation to ICC if Asia Cup not handed to IndiaThe BCCI have written an official email to ACC chief Mohsin Naqvi to hand over the Asia Cup title to the champions India immediately. The Indian team refused to collect the trophy after the final win against Pakistan from Naqvi, prompting him to tell the ACC officials to take it away. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/thamma-movie-review-ayushmann-khurrana-turns-vampire-with-rashmika-mandanna-but-film-has-no-life-left-to-suck-2806085-2025-10-21",
      "headline": "Thamma review: Ayushmann turns vampire, but film has no life left to suckRelease Date:Tue Oct 21, 2025Thamma movie review: Ayushmann Khurrana turns vampire in Aditya Sarpotdar's 'Thamma' -- a horror-romance that promises bite but lacks soul. Despite its ambitious link to Maddock's horror-comedy universe, the film feels lifeless, uneven, and drained of charm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/diwali-2025-india-diwali-fireworks-set-off-alarm-in-pakistan-delhi-aqi-lahore-pollution-smog-2806007-2025-10-21",
      "headline": "India's Diwali fireworks set off alarm in PakistanAs Diwali fireworks lit up skies across India, toxic air and pollutants drifted across the border into Pakistan. Lahore's air quality plunged to alarming levels, trailing only Delhi as the most-polluted city in the world. Pakistan's Punjab government has blamed cross-border pollution for worsening the existing smog crisis."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-supreme-leader-ali-khamenei-aide-daughter-strapless-revealing-wedding-gown-hijab-crackdown-2806110-2025-10-21",
      "headline": "Revealing wedding dress of daughter of Iran's hijab enforcer sparks outrageThe video shows Ali Shamkhani – the senior adviser to the Iranian Supreme Leader – walking his daughter down the aisle. The bride is seen wearing a strapless white dress with a low neckline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-clarifies-on-h1b-visa-fee-big-relief-for-students-techies-l1-f1-company-transferee-student-visa-holders-2806028-2025-10-21",
      "headline": "US clarifies on H-1B visa fee, big relief for students, techiesThe Donald Trump administration has clarified the exemptions to the controversial $100,000 H-1B visa fee introduced via a presidential proclamation in September. Employers can now proceed with change-of-status filings. The proclamation's scope is limited to new petitions for individuals outside the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/not-just-paneer-india-has-an-egg-problem-as-well-2806035-2025-10-21",
      "headline": "Not just fake paneer, India has an egg problem as wellIndia has an egg problem. It is also a problem that mirrors our problem of low-quality and adulterated food, particularly on quick commerce apps where prices are high and yet quality is missing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bmw-330-li-acquisition-tender-lokpal-luxury-vehicles-india-2805980-2025-10-21",
      "headline": "Lokpal wants to acquire 7 luxury BMW cars, floats public tenderAs per sources, the total cost for all seven vehicles is expected to exceed Rs 5 crore and once the cars are delivered, BMW will provide at least seven days of training to the Lokpal's drivers and staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-diwali-air-quality-severe-pollution-why-firecrackers-persist-despite-smog-2806046-2025-10-21",
      "headline": "Delhi's Diwali defiance: Why firecrackers persist despite the smogDelhi wakes up each Diwali to prayers for light amid clouds of smoke. Despite bans and 'green' reforms, fireworks still rule the night, exposing governance gaps and collective complicity in pollution. To breathe better, Delhi needs to reimagine Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-grand-alliance-direct-contests-seat-sharing-deal-congress-rjd-2805991-2025-10-21",
      "headline": "Fireworks in Mahagathbandhan, allies to clash in 12 Bihar seatsBihar polls: The disarray in the opposition ranks, coming a fortnight before the first phase of the Bihar polls, has invited jabs from the NDA and Chirag Paswan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bengal-man-claims-swiggy-delivered-chicken-instead-of-vegetarian-meal-on-diwali-2806003-2025-10-21",
      "headline": "Bengal man claims Swiggy delivered chicken instead of vegetarian meal on DiwaliIn a now-viral post on LinkedIn, a man from Bengal narrated what he called a deeply distressing incident involving a food delivery on Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-press-secretary-leavitt-attacks-reporter-trump-putin-summit-glbs-2805879-2025-10-21",
      "headline": "Your mom did: Karoline Leavitt snaps at reporter over question on Trump-Putin meetWhite House press secretary Karoline Leavitt criticised a Huffington Post reporter during a heated exchange over the Trump-Putin summit location. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-election-2025-news-live-updates-nda-seat-sharing-jdu-rjd-congress-nitish-kumar-tejashwi-yadav-2805911-2025-10-21",
      "headline": "Live: Setback for Mahagathbandhan, VIP leader's nomination rejected from Sugauli seatBihar Election News Live Updates: As the nomination window closed for the second and final phase of Bihar Assembly polls yesterday, both the NDA and Mahagathbandhan unveiled their candidates. The BJP and JD(U) will each contest 101 seats, while Chirag Paswan's LJP has been allotted 29. Meanwhile, tensions are surfacing within the Mahagathbandhan, with the RJD fielding candidates on 143 seats and the Congress agreeing to contest 61. The two allies of the INDIA bloc will face off directly in six constituencies. Follow indiatoday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-workers-purify-pune-iconic-sanhiwar-wada-fort-after-namaz-video-goes-viral-sparks-row-2805929-2025-10-21",
      "headline": "BJP MP purifies Pune fort with gaumutra after namaz video goes viralIn response to the namaz viral video, BJP workers led by Rajya Sabha MP Medha Kulkarni protested at the site and performed a \"purification ritual\" by sprinkling cow urine and dung at the spot where the prayers were said to have taken place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/too-many-diwali-sweets-and-no-clue-what-to-do-shake-them-into-cocktails-2806051-2025-10-21",
      "headline": "Too many Diwali sweets and no clue what to do? Shake them into cocktailsAcross India's best bars and kitchens, chefs and mixologists are reimagining mithai as liquid inspiration. From Gulab Jamun Old Fashioneds to Kulfi Negronis, these drinks are sweet, nostalgic, and surprisingly sophisticated, if you do them right."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/agra-lucknow-expressway-toll-protest-workers-demand-higher-diwali-bonus-2805917-2025-10-21",
      "headline": "No Diwali bonus, no toll: Agra-Lucknow Expressway workers let vehicles pass freeSeveral vehicles passed through the Fatehabad toll on the Agra-Lucknow Expressway without paying tolls after employees, upset over the Diwali bonus, opened the gates. The incident disrupted traffic and prompted police intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-photo-imam-siraj-wahhaj-world-trade-centre-bombing-donald-trump-musk-2805938-2025-10-21",
      "headline": "Zohran Mamdani's photo with imam tied to 1993 bombing piques Trump, MuskNew York's mayoral front-runner Zohran Mamdani was seen smiling and standing hand-in-hand with imam Siraj Wahhaj, believed to be a co-conspirator in the 1993 World Trade Centre bombing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/germanys-pet-parking-pads-are-going-viral-is-india-ready-to-follow-2804666-2025-10-21",
      "headline": "Germany's pet parking pads are going viral. Is India ready to follow?Germany's pet parking pads are going viral and making pet lovers proud, but the big question is, could something like this actually work in India, too?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-diwali-post-rashmika-mandanna-voice-engagement-wedding-rumours-2805932-2025-10-21",
      "headline": "Vijay Deverakonda's Diwali post has fans convinced Rashmika Mandanna was thereVijay Deverakonda's Diwali celebration videos have fans convinced Rashmika Mandanna was present. The couple's engagement rumours and possible February wedding add excitement to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-rebound-buy-or-wait-dip-muhurat-trading-diwali-2805982-2025-10-21",
      "headline": "Gold hits Rs 1.30 lakh again, silver at Rs 1.58 lakh: Buy now or wait for a dip?Gold and silver are regaining momentum amid festive demand and global uncertainty. Investors should buy with discipline, stagger purchases, and treat bullion as a long-term hedge rather than chasing short-term spikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/stunning-camerawork-shows-bengaluru-skies-light-up-on-diwali-science-explained-2806021-2025-10-21",
      "headline": "Video: Stunning camera work shows Bengaluru skies light up on DiwaliThis spectacular visual was created using a photography technique called light painting, which artistically captures the movement of light sources over time through long exposure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-government-to-start-cloud-seeding-after-the-air-quality-falls-drastically-2806040-2025-10-21",
      "headline": "Delhi ready for cloud seeding as capital's AQI dips, awaits weather body nodThe government has completed all the technical and ground preparation for cloud seeding. It is now waiting for the approval of the India Meteorological Department. As soon as the Meteorological Department approves, the government will initiate the procedures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayan-mukerji-quits-dhoom-4-shifts-focus-brahmastra-sequel-report-2806108-2025-10-21",
      "headline": "Ayan Mukerji quits Dhoom 4, shifts focus to Brahmastra sequel: ReportDirector Ayan Mukerji reportedly left 'Dhoom 4' after his vision did not match the film's creative direction. Yash Raj Films is now likely to consider new talent for the directorial role and main cast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/jennifer-aniston-father-films-nepotism-2806118-2025-10-21",
      "headline": "Jennifer Aniston says actor-father dissuaded her from films, snubs nepotism talkJennifer Aniston says her father, actor John Aniston, told her to \"get a real job\" rather than pursue acting. The 'Friends' star has also addressed the nepotism debate.  \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/juergen-klopp-open-to-liverpool-return-backs-arne-slot-amid-challenging-phase-2806135-2025-10-21",
      "headline": "Klopp hints Liverpool return is possible but backs Slot to turn things around Jurgen Klopp says a return to Liverpool is 'theoretically possible' but rules out managing any other English club. He voices full confidence in Arne Slot as Liverpool face a challenging spell, having lost four matches in a row for the first time since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/trophy-war-erupts-bcci-threatens-icc-action-as-pak-chief-refuses-to-return-asia-cup-ytvd-2806117-2025-10-21",
      "headline": "Trophy War Erupts: BCCI Threatens ICC Action as Pak Chief Refuses to Return Asia Cup! This special report focuses on the escalating dispute over the Asia Cup trophy between the BCCI and ACC chief Mohsin Naqvi. After winning the tournament, the Indian team refused to accept the trophy from Naqvi, who is also the PCB chairman, in protest of the Pahalgam terror attack. BCCI Secretary Devjit Saikia stated, 'we have written to the ACC to give us the trophy to the champion team and we are awaiting a response. If there will be no response or negative response, then we will write to the ICC.' The trophy is now reportedly locked in the ACC's Dubai office, with the BCCI formally demanding its return and preparing to escalate the matter to the International Cricket Council if the standoff continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-batting-nets-adelaide-2806101-2025-10-21",
      "headline": "Perth setback behind, Virat Kohli looks million dollars in Adelaide nets Virat Kohli trained hard in the Adelaide nets ahead of the team's second ODI against Australia. The batter looked a million bucks as the sound of the ball striking his bat reverberated in the arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-ruled-out-england-odi-tahlia-mcgrath-captains-australia-world-cup-2806071-2025-10-21",
      "headline": "Australia suffer captain Alyssa Healy blow before business end Australia will be without their captain Alyssa Healy for their crucial top-of-the-table clash against England in Indore on Wednesday. Australia will be hoping to have their skipper back before the business end of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-india-vs-south-africa-tests-2806081-2025-10-21",
      "headline": "Where is Sarfaraz Khan? Batter's absence from India A squad baffles fans The BCCI announced India A's squad against South Africa for the upcoming series in November. Mumbai batter Sarfaraz Khan did not make it to the squad, baffling fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mohsin-naqvi-official-mail-asia-cup-trophy-handover-2806079-2025-10-21",
      "headline": "BCCI warns Mohsin Naqvi of escalation to ICC if Asia Cup not handed to India The BCCI have written an official email to ACC chief Mohsin Naqvi to hand over the Asia Cup title to the champions India immediately. The Indian team refused to collect the trophy after the final win against Pakistan from Naqvi, prompting him to tell the ACC officials to take it away. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/al-nassr-arrive-in-goa-without-cristiano-ronaldo-afc-champions-league-2806063-2025-10-21",
      "headline": "Watch: Ronaldo-less Al Nassr arrive in Goa ahead of AFC Champions League 2 clash The Al Nassr squad, minus Cristiano Ronaldo, arrived in Goa ahead of their AFC Champions League 2 clash against FC Goa on Tuesday, October 21. Ronaldo is yet to take part in the AFC Champions League 2 so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-slump-continues-pakistan-test-struggles-azhar-mahmood-confident-2806047-2025-10-21",
      "headline": "Babar Azam in crisis? Pakistan coach reflects on batter's lean patch in Tests Pakistan team management is confident Babar Azam will be able to score big, sooner than latter. Babar has endured a prolonged lean patch, failing in the second innings of the ongoing Test against South Africa in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravi-shastri-virat-kohli-rohit-sharma-legacy-2027-world-cup-2806041-2025-10-21",
      "headline": "Ro-Ko legacy will remain regardless of when they retire from game: Ravi Shastri Ravi Shastri said that Virat Kohli and Rohit Sharma's legacy will always remain irrespective of when they decide to retire from the game. Kohli and Rohit's future has been a question of debate with the 2027 ODI World Cup on the horizon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-india-vs-south-africa-tests-2806081-2025-10-21",
      "headline": "Where is Sarfaraz Khan? Batter's absence from India A squad baffles fans The BCCI announced India A's squad against South Africa for the upcoming series in November. Mumbai batter Sarfaraz Khan did not make it to the squad, baffling fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-mohsin-naqvi-official-mail-asia-cup-trophy-handover-2806079-2025-10-21",
      "headline": "BCCI warns Mohsin Naqvi of escalation to ICC if Asia Cup not handed to India The BCCI have written an official email to ACC chief Mohsin Naqvi to hand over the Asia Cup title to the champions India immediately. The Indian team refused to collect the trophy after the final win against Pakistan from Naqvi, prompting him to tell the ACC officials to take it away. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/al-nassr-arrive-in-goa-without-cristiano-ronaldo-afc-champions-league-2806063-2025-10-21",
      "headline": "Watch: Ronaldo-less Al Nassr arrive in Goa ahead of AFC Champions League 2 clash The Al Nassr squad, minus Cristiano Ronaldo, arrived in Goa ahead of their AFC Champions League 2 clash against FC Goa on Tuesday, October 21. Ronaldo is yet to take part in the AFC Champions League 2 so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-slump-continues-pakistan-test-struggles-azhar-mahmood-confident-2806047-2025-10-21",
      "headline": "Babar Azam in crisis? Pakistan coach reflects on batter's lean patch in Tests Pakistan team management is confident Babar Azam will be able to score big, sooner than latter. Babar has endured a prolonged lean patch, failing in the second innings of the ongoing Test against South Africa in Rawalpindi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-ravi-shastri-virat-kohli-rohit-sharma-legacy-2027-world-cup-2806041-2025-10-21",
      "headline": "Ro-Ko legacy will remain regardless of when they retire from game: Ravi Shastri Ravi Shastri said that Virat Kohli and Rohit Sharma's legacy will always remain irrespective of when they decide to retire from the game. Kohli and Rohit's future has been a question of debate with the 2027 ODI World Cup on the horizon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-captian-india-a-south-africa-tests-sai-sudharsan-kl-rahul-2806027-2025-10-21",
      "headline": "Pant back, to captain India A in four-day matches before South Africa TestsRishabh Pant will captain India A in two four-day matches against South Africa A before a Test series against the Proteas in November. Test specialists, including KL Rahul, Mohammed Siraj and Dhruv Jurel, will feature in the second four-day match, which will be played at BCCI Centre of Excellence in Bengaluru. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-kohli-rohit-out-demons-bgt-2806016-2025-10-21",
      "headline": "Demons of BGT 2024-25 still haunting Virat Kohli: Irfan PathanIndia vs Australia: Both Virat Kohli and Rohit Sharma failed in their return to international cricket. After the 1st ODI, former cricketer Irfan Pathan stated the obvious - the demons of BGT are still haunting the senior duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-rohit-sharma-ricky-ponting-world-cup-2027-2805974-2025-10-21",
      "headline": "Don't write off champions: Aussie great backs Kohli, Rohit for 2027 World CupIndia tour of Australia: Former Australia captain Ricky Ponting has backed both Virat Kohli and Rohit Sharma to feature in the 2027 World Cup. The legendary batters endured a disappointing return to international cricket as India's batting line-up collapsed in the series opener in Perth on Sunday, 19 October.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-sheffield-shield-ashes-steve-smith-2805960-2025-10-21",
      "headline": "The key piece of advice that changed Labuschagne's fortunes ahead of AshesMarnus Labuschagne has made a compelling case for a Test recall, hitting 4 hundreds in his last 5 Sheffield Shield games. What led to this sudden change in form after a prolonged lean patch in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-india-vs-australia-r-ashwin-2805918-2025-10-21",
      "headline": "IND vs AUS: For how long can Kuldeep Yadav put on a brave face?Spinner Kuldeep Yadav was not picked in the playing XI for the team's first ODI against Australia. Kuldeep, despite being carried for the majority of the series, has not been the preferred choice of the Gambhir management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-rohit-sharma-virat-kohli-2805909-2025-10-21",
      "headline": "India travel to Adelaide on Diwali, fans shower love with Rohit-Kohli chantsIndian cricket fans created a festive scene at Adelaide airport, singing chants for Rohit Sharma and Virat Kohli as the team arrived ahead of the second ODI. The team, led by Shubman Gill, looks to recover from their loss in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-team-odi-world-cup-smriti-mandhana-harmanpreet-2805820-2025-10-21",
      "headline": "Season of light and the problem of 80 per cent commitmentAs the country celebrates Diwali, there will be no gala dinner for India's women's team — only a search for fire and belief ahead of their clash with New Zealand.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-sheffield-shield-ashes-steve-smith-2805960-2025-10-21",
      "headline": "The key piece of advice that changed Labuschagne's fortunes ahead of AshesMarnus Labuschagne has made a compelling case for a Test recall, hitting 4 hundreds in his last 5 Sheffield Shield games. What led to this sudden change in form after a prolonged lean patch in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-india-vs-australia-r-ashwin-2805918-2025-10-21",
      "headline": "IND vs AUS: For how long can Kuldeep Yadav put on a brave face?Spinner Kuldeep Yadav was not picked in the playing XI for the team's first ODI against Australia. Kuldeep, despite being carried for the majority of the series, has not been the preferred choice of the Gambhir management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-rohit-sharma-virat-kohli-2805909-2025-10-21",
      "headline": "India travel to Adelaide on Diwali, fans shower love with Rohit-Kohli chantsIndian cricket fans created a festive scene at Adelaide airport, singing chants for Rohit Sharma and Virat Kohli as the team arrived ahead of the second ODI. The team, led by Shubman Gill, looks to recover from their loss in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-team-odi-world-cup-smriti-mandhana-harmanpreet-2805820-2025-10-21",
      "headline": "Season of light and the problem of 80 per cent commitmentAs the country celebrates Diwali, there will be no gala dinner for India's women's team — only a search for fire and belief ahead of their clash with New Zealand.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-new-odi-captain-shaheen-afridi-mohammad-rizwan-replaced-2805876-2025-10-20",
      "headline": "Shaheen Afridi replaces Mohammad Rizwan as Pakistan's new ODI captainShaheen Afridi has been named Pakistan's new ODI captain, replacing Mohammad Rizwan. He will lead the team in the upcoming series against South Africa starting November 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chamari-athapaththu-last-over-heroics-sri-lanka-win-bangladesh-womens-world-cup-2025-2805875-2025-10-20",
      "headline": "Bangladesh implode in dramatic last-over thriller as Sri Lanka keep semis hopes aliveChamari Athapaththu's brilliant final over secured a narrow seven-run victory for Sri Lanka over Bangladesh. The win keeps Sri Lanka's semi-final hopes alive but leaves Bangladesh rueing missed chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-afc-champions-league-2-manolo-marquez-stay-realistic-2805874-2025-10-20",
      "headline": "Manolo Marquez urges FC Goa fans to stay realistic about Al Nassr clashManolo Marquez has called for patience and perspective from FC Goa fans ahead of their clash with Al Nassr. The Spaniard reminded supporters that facing the Saudi heavyweights is far from an ordinary game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-pace-injuries-shamar-joseph-ruled-out-bangladesh-odi-series-2805868-2025-10-20",
      "headline": "After missing India tour, West Indies' Shamar Joseph ruled out of Bangladesh seriesWest Indies pace bowlers Shamar Joseph and Jediah Blades are ruled out of the Bangladesh ODI series due to injuries. The team brings in Akeal Hosein and Ramon Simmonds as reinforcements amid concerns over player fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-bcci-player-selector-clarity-mohammed-shami-ajit-agarkar-2805863-2025-10-20",
      "headline": "R Ashwin urges BCCI to practice player-selector clarity after Shami rowRavichandran Ashwin has called on the BCCI to improve clarity between players and selectors. He highlighted Mohammed Shami's recent ODI snub as an example of how indirect communication can create confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-manager-hansi-flick-emotional-change-injury-crisis-olympiakos-clash-2805855-2025-10-20",
      "headline": "Barcelona's Hansi Flick admits club changed him after emotional outburst against GironaBarcelona manager Hansi Flick has opened up on how his time at the club has changed him emotionally. The team faces a tough Champions League match with many key players sidelined due to injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-england-harry-brook-1000-t20i-runs-phil-salt-2805856-2025-10-20",
      "headline": "England captain Harry Brook completes 1000 T20I runs after New Zealand blitzEngland captain Harry Brook reached 1000 T20I runs with a spectacular 78 off 35 balls against New Zealand. His innings highlighted fearless strokeplay and leadership, cementing his place among England's elite T20I run-scorers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jurgen-klopp-manchester-united-manager-job-rejection-attitude-reason-2805852-2025-10-20",
      "headline": "Jurgen Klopp cites Manchester United's attitude as reason for rejecting manager roleJurgen Klopp has revealed why he turned down Manchester United, citing issues with the club's attitude and approach. He chose to wait for a project aligned with his philosophy, ultimately finding success with Liverpool."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}