{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-pitches-gujarat-as-investment-hub-karan-adani-mukesh-ambani-unveil-big-ticket-bets-saurashtra-kutch-2850260-2026-01-11",
      "headline": "PM pitches Gujarat as investment hub; Adani Group, Reliance unveil big-ticket betsPM Modi said that India's growth story is being powered by an expanding middle class and rising purchasing power, alongside structural reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-old-tax-regime-survival-new-tax-regime-deductions-income-expectations-2849988-2026-01-11",
      "headline": "Budget 2026: Will old tax regime survive and should new regime get deductions?Over the past few years, the government has steadily pushed the new tax regime as the default option while keeping the old regime alive for those with existing commitments and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-silent-debt-crisis-easy-loans-bnpl-apps-emi-burden-expert-panel-report-2849529-2026-01-10",
      "headline": "Drowning in debt: How easy loans are turning into an EMI nightmare for IndiansMonth after month, salaries go to EMIs, essentials shrink, and families realise that what once felt temporary has become the new normal. Read on to understand how this silent debt crisis is unfolding within Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sip-investments-hit-record-high-in-december-2025-amfi-2849472-2026-01-09",
      "headline": "SIP investments hit record high in December 2025: AMFIThe latest data from the Association of Mutual Funds in India (AMFI) for December 2025 shows steady participation from retail investors, record SIP contributions and sustained interest in equity and hybrid schemes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-it-possible-for-the-us-to-put-a-price-tag-on-greenland-2849404-2026-01-09",
      "headline": "Is it possible for the US to put a price tag on Greenland?In 1946, the US offered to buy the vast, mineral-rich Arctic island from Denmark for $100 million, an offer that was rejected back then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pf-keep-earning-interest-after-you-have-left-job-2849324-2026-01-09",
      "headline": "Will your PF keep earning interest after you have left job?Changing jobs is common today, but doubts around Provident Fund savings still linger. Many employees worry that their PF stops growing once they leave a job. The truth, however, is very different and often misunderstood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-income-tax-relief-expectations-middle-class-2849334-2026-01-09",
      "headline": "Tax relief on the cards? What to expect from Budget 2026Changes to tax slabs, a higher exemption limit and a continued push towards the new tax regime helped reduce the tax burden for many families and eased pressure on households in budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-600-points-lower-nifty-below-25700-ntpc-down-2-percent-2849312-2026-01-09",
      "headline": "Sensex closes 605 points lower, Nifty below 25,700; NTPC down 2%The S&P BSE Sensex tanked 604.72 points to close at 83,576.24, while the NSE Nifty50 lost 193.55 points to end at 25,683.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-rates-today-india-global-turmoil-investors-safe-haven-demand-mcx-2849288-2026-01-09",
      "headline": "Gold, silver rates today: What should investors know amid global turmoilGold prices in India moved higher across all major purity levels on January 9. The price of 24K gold stood at Rs 13,871 per gram, up by Rs 71 from the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/govt-ducks-imfs-c-grade-criticism-in-stunning-rti-stonewall-no-answers-no-fixes-2849264-2026-01-09",
      "headline": "Govt ducks IMF's 'C' grade criticism in stunning RTI stonewall: No answers, no fixesOn the estimation of GDP and Gross Value Added (GVA) for the unorganised sector, MoSPI said it follows methodologies outlined in official documents released in 2012 and 2015, both available in the public domain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-hoping-for-a-tax-makeover-why-you-might-be-disappointed-this-year-2849244-2026-01-09",
      "headline": "Budget 2026: Hoping for a tax makeover? Why you might be disappointed this yearHoping Budget 2026 will finally bring sweeping tax changes? Experts suggest this may not be the year for big announcements or dramatic relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-bccl-ipo-fully-subscribed-day-1-gmp-latest-2849238-2026-01-09",
      "headline": "Bharat Coking Coal IPO fully booked on Day 1. Should you subscribe?BCCL IPO: The allotment is expected to be finalised on January 14, 2026. Shares are proposed to list on the BSE and NSE on January 16, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-sector-rotation-what-truly-shapes-returns-in-indian-equity-markets-2849221-2026-01-09",
      "headline": "Is sector rotation the real driver of returns in Indian equity markets?Sector rotation in its simplest form is the reaction of the market to shifts in the economic environment. The various sectors are enjoyed at various stages of the cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-bloodbath-on-dalal-street-sensex-down-700-points-explained-2849218-2026-01-09",
      "headline": "Sensex falls over 600 points: What's behind the bloodbath on Dalal Street?Around 12:46 pm, the BSE Sensex was down 634.91 points to 83,546.05, while the NSE Nifty50 fell 188.80 points to 25,688.05. Most of the broader market indices also tumbled, reflecting the volatility on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-not-received-your-income-tax-refund-in-2026-here-is-why-it-is-taking-time-2849156-2026-01-09",
      "headline": "Still not received your income tax refund in 2026? Here's why it's taking timeWaiting endlessly for your tax refund can be stressful. If your FY 2024–25 income tax refund has not arrived yet in 2026, there are several common reasons behind the delay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumble-what-next-for-dalal-street-investors-2849163-2026-01-09",
      "headline": "Trump's 500% tariff threat rattles Dalal Street. What should investors do now?Around 11:55 am, the Sensex was down nearly 450 points, while the NSE Nifty 50 had tumbled over 130 points, pushing the benchmark indices deeper into the red after a bruising week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-insurance-sector-needs-more-than-an-fdi-reset-2849098-2026-01-09",
      "headline": "Budget 2026: Why insurance sector needs more than an FDI boostWith FDI reforms in place, Budget 2026 must prioritise affordability, trust and protection-led incentives to close India's insurance gap and turn reform momentum into real coverage for citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mutual-fund-inflows-december-2025-equity-mf-drop-amfi-data-2849130-2026-01-09",
      "headline": "Mutual fund inflows cool off in December, down 6% to Rs 28,054 croreData released by the Association of Mutual Funds in India, or AMFI, showed that inflows into equity mutual funds fell 6% in December to Rs 28,054 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bhel-share-price-rises-over-4-percent-why-bhel-stock-is-gaining-today-new-order-bcgcl-2849092-2026-01-09",
      "headline": "BHEL share price jumps over 4%. Why is the stock rising today?BHEL shares were trading at Rs 282.40, up Rs 10.10 or 3.71% as of 10:10 AM. The stock had closed at Rs 272.30 in the last session. It opened higher at Rs 279.10 and moved up further during the day.. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-gains-over-200-points-nifty-above-25900-bel-it-metal-up-2849062-2026-01-09",
      "headline": "Sensex gains over 200 points, Nifty above 25,900; BEL up 2%The S&P BSE Sensex was down by 35.21 points to 84,145.75, while the NSE Nifty50 lost 19.80 points to 25,857.50 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-defends-mahhi-nadeem-bond-jai-bhanushali-thanks-her-for-support-2850271-2026-01-11",
      "headline": "Ankita Lokhande defends Mahhi-Nadeem bond; Jai Bhanushali thanks her for support Actor Ankita Lokhande, disturbed by trolls commenting on Mahhi Vij and Salman Khan's manager Nadeem, defended their bond, calling Nadeem a father figure to Mahhi, Jai Bhanushali, and their daughter Tara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-conferred-tiger-of-martial-arts-title-achieves-kenjutsu-induction-2850248-2026-01-11",
      "headline": "Pawan Kalyan conferred Tiger of Martial Arts title, achieves Kenjutsu induction Pawan Kalyan achieved formal Kenjutsu induction, complementing his Fifth Dan and \"Tiger of Martial Arts\" title. He is the first Telugu-speaking individual inducted into the esteemed Takeda Shingen Clan outside Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-marks-7-years-of-uri-vicky-kaushal-grateful-for-his-faith-in-him-2850238-2026-01-11",
      "headline": "Aditya Dhar marks 7 years of Uri; Vicky Kaushal grateful for his faith in him Vicky Kaushal thanked Aditya Dhar on seven years of 'Uri: The Surgical Strike'. He expressed gratitude to Aditya for having faith in his abilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-stebin-ben-share-wedding-photos-exchange-i-do-vows-on-social-media-2850201-2026-01-11",
      "headline": "Nupur Sanon, Stebin Ben share wedding photos, exchange I do vows on social media Nupur Sanon and Stebin Ben shared pictures from their Christian wedding. The newlyweds shared their wedding vows on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-hails-order-curbing-reviews-of-chiranjeevi-film-on-ticketing-sites-2850166-2026-01-11",
      "headline": "Vijay Deverakonda hails order curbing reviews of Chiranjeevi film on ticketing sites Vijay Dereakonda reacted as ratings and reviews were blocked on ticketing sites for Chiranjeevi's 'Mana Shankara Vara Prasad Garu' as per court orders. The film is set for a theatrical release on Jnauary 12, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-praised-alia-bhatt-powerful-role-haq-gender-justice-2850150-2026-01-11",
      "headline": "Queen Yami you are pure craft in Haq: Alia Bhatt after watching film, actor reacts Alia Bhatt recently praised Yami Gautam's performance in 'Haq', which recently premiered on OTT after its theatrical run. The appreciation comes as 'Haq' garnered positive reviews from fans across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-8-minute-scene-of-prabhas-in-aged-look-added-amid-fan-criticism-2850139-2026-01-11",
      "headline": "The Raja Saab: 8-minute scene of Prabhas in aged look added amid fan criticism An eight-minute look of Prabhas in director Maruthi's horror-comedy 'The RajaSaab' has been added amid fan criticism. The film theatrically released on January 9, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/prashant-tamang-dies-singer-actor-indian-idol-cardiac-arrest-2850125-2026-01-11",
      "headline": "Prashant Tamang, Indian Idol 3, dies at 43; family has no suspicion, says police Prashant Tamang, winner of Indian Idol 3, died at 43 after a suspected cardiac arrest. West Bengal Chief Minister Mamata Banerjee offered her condolences. In the statement recorded by Delhi Police, the late singer's family denied suspicion on any person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-sukumar-inspiring-partnership-redefines-telugu-cinema-success-2850104-2026-01-11",
      "headline": "Allu Arjun's birthday wish for director Sukumar takes fans back to Pushpa days Actor Allu Arjun celebrated 'Pushpa' director Sukumar's 56th birthday with a special social media post. He highlighted their long-standing collaboration and the significance of their partnership in shaping both their careers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/his-hers-review-when-a-marriage-a-murder-and-a-town-full-of-secrets-collide-tessa-thompson-joe-bernthal-2850062-2026-01-11",
      "headline": "His & Hers review: When a marriage, a murder, and a town full of secrets collideRelease Date:Thu Jan 08, 2026 The six-episode adaptation of Alice Feeney's bestseller features suspenseful twists and a strong cast but lacks originality, with predictable plot mechanics and a forgettable finale. It premiered on Netflix on January 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/flipperachi-fa9la-viral-fame-india-dhurandhar-feature-india-tour-2850080-2026-01-11",
      "headline": "Rapper Flipperachi announces India tour after Dhurandhar success. Check dates After his viral song 'FA9LA' from 'Dhurandhar', Bahrain rapper Flipperachi announced his India tour dates. He is set to perform in Bengaluru on March 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/golden-globes-2026-priyanka-chopra-returns-family-holiday-star-award-ceremony-2850070-2026-01-11",
      "headline": "Priyanka Chopra leaves for Golden Globes after New Year celebration with family After celebrating the New Year with her family, Priyanka Chopra has resumed work and is preparing to serve as a presenter at the Golden Globes on January 11, joining a roster of international stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parasakthi-historical-drama-release-clears-censor-delays-sivakarthikeyan-25th-film-2850060-2026-01-11",
      "headline": "Parasakthi box office Day 1: Sivakarthikeyan film starts strong after censor row Sudha Kongara's historical drama 'Parasakthi', starring Sivakarthikeyan in his 25th film, premiered in cinemas on Saturday, January 10, following a period of uncertainty over its censor clearance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-stebin-ben-intimate-christian-wedding-ceremony-2850047-2026-01-11",
      "headline": "Nupur Sanon-Stebin Ben pop champagne, exchange vows in white wedding. Watch Nupur Sanon and Stebin Ben got married in a Christian ceremony on Saturday. The ceremony was attended by their close friends and family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-slashed-his-fees-by-33-for-the-raja-saab-report-2850037-2026-01-11",
      "headline": "Prabhas slashed his fees by 33% for The Raja Saab: Report As per reports, Prabhas has slashed his fee by 33 per cent for The Raja Saab. The film, which released on January 9, is now inching close to the Rs 100-crore mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-fan-celebrations-fire-raja-saab-screening-odisha-2850019-2026-01-11",
      "headline": "The Raja Saab: Fire breaks out in theatre after fans burst crackers inside A fire broke out during the screening of 'The Raja Saab' in an Odisha theatre after fans brought in aarti plates, lit lamps, and burst crackers, causing panic among attendees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/khans-srk-salman-aamir-box-office-fight-2849975-2026-01-11",
      "headline": "Khans at 60: Shah Rukh, Salman, Aamir and the tricky box office fight of 2026 In 2026, Ranveer Singh is back with Dhurandhar 2, Ranbir Kapoor stakes claim with Ramayana 1 while most South superstars have pan-India releases. Where do Shah Rukh, Salman and Aamir Khan stand?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-box-office-collection-drops-on-day-two-with-mixed-audience-response-2850005-2026-01-11",
      "headline": "The Raja Saab box office Day 2: Prabhas' film nears Rs 100 crore despite sharp dip After a strong opening, Prabhas' starrer 'The Raja Saab' experienced a significant decline in box office collections on its second day. Telugu markets lead the film's performance, while other language versions saw weaker numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/say-its-not-true-katie-leung-told-to-deny-racist-backlash-over-harry-potter-role-2849948-2026-01-10",
      "headline": "Say it's not true: Katie Leung told to deny racist backlash over Harry Potter role Actor Katie Leung recalled facing racist backlash over Harry Potter casting as Cho Chang. She said that online remarks from toxic fans made her \"less outgoing.\""
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-us-anti-terror-drills-122-pakistani-terrorists-active-jammu-kashmir-2850279-2026-01-11",
      "headline": "Pak, US hold anti-terror drills while 122 Pakistani terrorists still active in J&KThe US-Pakistan counter-terrorism exercise is taking place even as Indian forces continue intensified counter-infiltration and anti-terror operations along the Line of Control and the International Border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-odi-match-report-virat-kohli-harshit-rana-baroda-2850294-2026-01-11",
      "headline": "IND vs NZ: India survive scare in 301 chase after Virat Kohli's rare 90s blunderIndia survived an almighty scare from New Zealand in Baroda as Virat Kohli's 93 was enough to seal the win and take a 1-0 lead in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/will-marco-rubio-be-president-of-cuba-trump-says-sounds-good-to-me-shares-post-truth-social-latin-america-2850231-2026-01-11",
      "headline": "Marco Rubio as Cuba President? Trump says sounds good to meTrump warned Cuba that it will no longer receive oil or financial support and urged Havana to reach an agreement with the United States before it is \"too late,\" saying the island once relied heavily on Venezuelan oil and money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-warning-us-israel-protests-unrest-tehran-khamenei-masoud-pezeshkian-bagher-qalibaf-trump-2850233-2026-01-11",
      "headline": "Death to America: Iran vows to target US troops, Israel if attacked over protests  UpdatesIran's Parliament Speaker Mohammad Bagher Qalibaf said US military assets and Israel would be considered \"legitimate targets\" in the event of an American attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/for-indian-women-travel-is-more-work-than-rest-2850122-2026-01-11",
      "headline": "Vacation's gender bias? Why holiday is more work than rest for Indian womenFor many Indian women, this is the unspoken reality of vacations: the work does not stop, it simply relocates. The responsibilities simply travel with them on holidays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/prashant-tamang-dies-singer-actor-indian-idol-cardiac-arrest-2850125-2026-01-11",
      "headline": "Prashant Tamang, Indian Idol 3, dies at 43; family has no suspicion, says policePrashant Tamang, winner of Indian Idol 3, died at 43 after a suspected cardiac arrest. West Bengal Chief Minister Mamata Banerjee offered her condolences. In the statement recorded by Delhi Police, the late singer's family denied suspicion on any person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/amit-shah-warns-pfi-jamaat-emerging-threats-kerala-says-only-nda-can-ensure-safety-attacks-ldf-udf-2850239-2026-01-11",
      "headline": "Amit Shah warns of emerging threats in Kerala, says only NDA can ensure safetyUnion Home Minister Amit Shah said Kerala's law and order situation may appear calm, but \"several threats are slowly emerging\" that could turn dangerous in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-second-highest-run-getter-international-cricket-sachin-tendulkar-2850256-2026-01-11",
      "headline": "New year, same Virat Kohli: Indian great reaches new milestone, just behind TendulkarVirat Kohli started 2026 in impressive fashion as he became the second-highest run-getter in international cricket during the first ODI between India and New Zealand in Baroda on Sunday, January 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-news-doomsday-to-come-in-2026-why-prophets-like-baba-vanga-predict-the-end-of-the-earth-2849780-2026-01-11",
      "headline": "World will end in 2026: Why doomsday predictions are spreading this yearFrom Baba Vanga, known as the Nostradamus of the Balkans, to new freshly minted prophets who come and go on social media to harmless memes and jokes, everyone seems to be predicting the end of the world in 2026. They are either predicting a calamity of biblical proportions or a world war. Why so?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/from-soil-to-shell-casings-when-kabaddi-lost-its-soul-gangster-nexus-punjab-sport-corruption-drug-syndicates-players-murder-2849515-2026-01-11",
      "headline": "How kabaddi lost its soul with blood, bullets, big money and calls from CanadaKabaddi has undergone a jarring metamorphosis in the last 15 years. Once the enchanting heartbeat of rural Punjab, criminal syndicates infiltrated tournaments, brought big money, feuds and bullet deaths. At times, the violence has a Canada angle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nsa-ajit-doval-communicates-without-phone-internet-2850127-2026-01-11",
      "headline": "NSA Ajit Doval says he doesn't use phone or internet. Here's how he communicatesNational Security Advisor Ajit Doval said he largely avoids using phones and the internet, relying instead on alternative means of communication not known to the common man. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jaish-e-mohammed-terrorist-masood-azhar-thousands-of-suicide-bombers-threat-in-new-audio-2850140-2026-01-11",
      "headline": "Jaish chief Masood Azhar's 'thousands of suicide bombers' threat in new audioIn the audio, Jaish chief Masood Azhar is heard making sweeping claims about the strength of his cadre, and adding that revealing the actual number would cause an uproar in global media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/from-1979-to-2026-how-protests-reshaped-irans-landscape-over-50-years-2850099-2026-01-11",
      "headline": "From 1979 to 2026: How protests reshaped Iran's landscape over 50 yearsIran has witnessed many protests in the past, some of them deadly and some that even led to regime change. The 1979 uprising, which became the Islamic Revolution, remains the most prominent example. The people of Iran are familiar with unrest, and every wave of protest has been driven by a clear cause, from women's rights to student movements. Here is the timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/red-carpets-to-red-flags-why-celebrity-biohacking-is-a-health-blind-spot-gwyneth-paltrow-bryan-johnson-deepinder-goyal-2850040-2026-01-11",
      "headline": "Red carpets to red flags: Why celebrity biohacking is a health blind spotHandcrafted ByOur Editors When celebrities biohack in public, experimentation becomes an endorsement. Devices meant for controlled settings are quickly reframed as wellness upgrades, nudging millions to optimise their bodies and brains without fully understanding the risks involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-army-invites-me-let-deputy-chief-saifullah-kasuri-openly-admits-terror-army-nexus-2849979-2026-01-11",
      "headline": "India scared of me: Pahalgam kingpin brags about invites from Pak armySaifullah Kasuri, the deputy chief of Hafiz Saeed-led outfit and the mastermind of the Pahalgam terror attack, made the remarks while addressing school children in a function organised at a school in Pakistan. He also claimed that India is scared because of his presence and issued provocative threats against New Delhi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-to-launch-drdo-eos-n1-anvesha-satellite-on-pslv-c62-why-no-one-can-hide-from-it-2849701-2026-01-11",
      "headline": "Isro to launch DRDO's Anvesha satellite: No one can hide from itThe Indian Space Research Organisation (Isro) is all set to launch the EOS-N1 Anvesha satellite to space aboard the PSLV-C62 mission on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-559-09-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/troops-bled-from-nose-vomited-blood-did-us-use-a-sonic-weapon-in-venezuela-during-raid-2850066-2026-01-11",
      "headline": "Troops bled from nose, vomited blood: Did US use a sonic weapon in Venezuela?US forces reportedly used an advanced and previously unseen sonic weapon during a raid in Venezuela, incapacitating local troops with intense sound waves. This operation has sparked widespread attention and raised concerns about new military technologies in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/bmc-polls-mahayuti-manifesto-mumbai-devendra-fadnavis-eknath-shinde-2850098-2026-01-11",
      "headline": "Loan for women, slum-free city: Mahayuti unveils manifesto for Mumbai civic pollsSeveral key leaders, including Chief Minister Devendra Fadnavis, Deputy Chief Minister Eknath Shinde, Ramdas Athawale, Vinod Tawde, Ameet Satam, and Ashish Shelar were present during the launch of the electoral manifesto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-dogs-are-watching-us-333-10-01-2026",
      "headline": "The dogs are watching usIn three consecutive days of hearing as to whether streets must be cleared of stray dogs and if they must be sent away to shelters, Supreme Court observed much and lawyers argued a lot. The result: a slew of quotable quotes for both dog-loving and dog-baiting humans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-pitches-gujarat-as-investment-hub-karan-adani-mukesh-ambani-unveil-big-ticket-bets-saurashtra-kutch-2850260-2026-01-11",
      "headline": "PM pitches Gujarat as investment hub; Adani Group, Reliance unveil big-ticket betsPM Modi said that India's growth story is being powered by an expanding middle class and rising purchasing power, alongside structural reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-ind-vs-nz-cupboard-box-2850232-2026-01-11",
      "headline": "Rohit, Kohli's 'out of the box' felicitation has social media in splitsIndia vs New Zealand 1st ODI: Superstars Virat Kohli and Rohit Sharma were felicitated by the Baroda Cricket Association on Sunday, January 11. The unique manner of the celebration left the fans in splits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-violent-protest-ayatollah-ali-khamenei-speech-tehran-live-updates-2849275-2026-01-09",
      "headline": "Live: Deaths in Iran unrest cross 460 amid crackdown on demonstratorsIran Protests Live Updates: Nationwide protests challenging Iran's theocracy have crossed the two-week mark, with demonstrations continuing in Tehran and other major cities despite a sweeping communications blackout. Over 100 people have been killed and around 2,600 detained, activists say. As unrest deepened, Iran's parliament speaker warned that the US military and Israel would be \"legitimate targets\" if Washington intervenes. President Donald Trump voiced support for protesters while weighing military options, amid fears the blackout could enable a harsher crackdown."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nandini-sharma-first-hat-trick-delhi-capitals-wpl-gujarat-giants-2850291-2026-01-11",
      "headline": "Who is Nandini Sharma? Delhi Capitals bowler scripts history with WPL hat-trick WPL 2026, DC v GG: Nandini Sharma became the first Delhi Capitals' bowler to take a hat-trick in the history of the tournament. She finished with figures of 4-0-33-5 after dismissing Kanika Ahuja, Rajeshwari Gayakwad, and Renuka Singh in the last over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-misses-century-again-wpl-giants-vs-capitals-2850278-2026-01-11",
      "headline": "Sophie Devine struck by 90s curse again, falls short of historic WPL hundred WPL 2026, DC vs GG: Sophie Devine fell short of a Women's Premier League century again, scoring 95 off 42 balls against Delhi Capitals before succumbing to the 90s curse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-1st-odi-sanjay-bangar-hindi-national-language-social-media-backlash-vadodara-2850277-2026-01-11",
      "headline": "Sanjay Bangar calls Hindi national language during commentary, gets reality check IND vs NZ, 1st ODI: Sanjay Bangar sparked backlash after saying he preferred the \"national language\" during commentary, with many pointing out that the Constitution recognises 22 languages and India has no national language."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/conor-bradley-knee-injury-liverpool-right-back-sidelined-2850257-2026-01-11",
      "headline": "Liverpool's Bradley set to be out for the season after knee injury vs Arsenal Conor Bradley will undergo surgery and faces an uncertain timeline for return after suffering a knee injury during Liverpool's 0-0 Premier League draw with Arsenal. The defender was stretchered off following an off-the-ball incident in stoppage time, with media reports indicating the injury could be season-ending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-second-highest-run-getter-international-cricket-sachin-tendulkar-2850256-2026-01-11",
      "headline": "New year, same Virat Kohli: Indian great reaches new milestone, just behind Tendulkar Virat Kohli started 2026 in impressive fashion as he became the second-highest run-getter in international cricket during the first ODI between India and New Zealand in Baroda on Sunday, January 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-new-coach-ole-gunnar-solskjaer-premier-league-2850071-2026-01-11",
      "headline": "Ole back at the wheel? Can Solksjaer really rescue Manchester United? Ole Gunnar Solksjaer is edging close to a return to Manchester United as their interim manager till the end of the season. While he did some magic as the temporary boss in his first stint, can he do the same at United yet again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-umpire-sharfuddoula-saikat-officiates-india-new-zealand-odi-security-concerns-2850245-2026-01-11",
      "headline": "Bangladesh umpire officiates in India while team cites security fears for T20 World Cup Bangladesh umpire Sharfuddoula Saikat is officiating in the ongoing India-New Zealand ODI series despite Bangladesh's security concerns about India. This situation raises questions over the BCB's stance amid IPL controversies and government actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-2026-an-se-young-red-hot-form-wang-zhi-yi-2850237-2026-01-11",
      "headline": "An Se Young carries red-hot form into New Year, wins Malaysia Open  South Korea's An Se-young secured her third consecutive Malaysia Open women's singles title. After finishing 2025 with four titles in a row, the reigning Olympic champion picked up where she left off last year. An will now look to defend her India Open crown in New Delhi later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-vs-karnataka-vijay-hazare-quarterfinal-sarfaraz-khan-devdutt-padikkal-2850226-2026-01-11",
      "headline": "VHT 2025-26 quarterfinals: Schedule, teams, livestreaming details Sarfaraz Khan and Devdutt Padikkal headline the quarterfinal clash between Mumbai and Karnataka, while Uttar Pradesh meet Saurashtra in the other quarter-final on January 12. The second set of last 8 games will see Punjab face MP and Delhi take on Vidarbha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-ind-vs-nz-cupboard-box-2850232-2026-01-11",
      "headline": "Rohit, Kohli's 'out of the box' felicitation has social media in splits India vs New Zealand 1st ODI: Superstars Virat Kohli and Rohit Sharma were felicitated by the Baroda Cricket Association on Sunday, January 11. The unique manner of the celebration left the fans in splits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-brisbane-international-win-engagement-hint-2850216-2026-01-11",
      "headline": "Did Sabalenka propose to her boyfriend? World No.1 steals show after Brisbane winWorld No.1 Aryna Sabalenka sparked social media buzz about a possible engagement after joking about boyfriend Georgios Frangulis during her Brisbane International win on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ryan-rickelton-kl-rahul-kantaara-celebration-sa20-hundred-2850211-2026-01-11",
      "headline": "Rickelton's KL Rahul moment: South Africa star explains 2nd SA20 hundred celebrationRyan Rickleton admitted that he drew inspiration from KL Rahul's Kantaara celebration after getting his second hundred in the ongoing SA20 2026 season. Rickleton scored 113 off 60 balls to help MI Cape Town beat Jo'burg Super Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-men-shafali-verma-jemimah-promo-video-viral-2850205-2026-01-11",
      "headline": "Uno reverse: Shafali, Jemimah front men's T20 World Cup promo, ad goes viralStar Sports has launched a first-of-its-kind promotional campaign for the men's T20 World Cup 2026 featuring India's women cricketers, with Shafali Verma delivering a punchline that has since gone viral on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-host-bangladesh-matches-t20-world-cup-2026-security-concerns-india-2850176-2026-01-11",
      "headline": "Pakistan ready to host Bangladesh's T20 World Cup matches: ReportPakistan has reportedly offered to host Bangladesh's T20 World Cup 2026 matches amid security concerns over travel to India, as the ICC weighs venue options while Bangladesh await a final decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicola-carey-backed-australia-womens-t20-world-cup-squad-mumbai-indians-2850155-2026-01-11",
      "headline": "Nicola Carey for T20 World Cup? Ex-Australia captain backs MI star amid incredible WPLFormer Australia captain Alex Blackwell has backed in-form Mumbai Indians all-rounder Nicola Carey for a Women's T20 World Cup recall after her standout WPL and WBBL performances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-new-zealand-odi-2026-team-selection-debate-baroda-series-opener-2850142-2026-01-11",
      "headline": "Unjustifiable: Ex-cricketer slams constant snubbing of Arshdeep, Shami and AxarPriyank Panchal slammed the Indian team management for the constant snubbing of Arshdeep Singh and season campaigners like Axar Patel and Mohammed Shami for the ODIs against New Zealand. Arshdeep wasn't picked for the first ODI against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-retired-early-allan-donald-praises-work-ethic-world-cup-2850134-2026-01-11",
      "headline": "Virat Kohli retired too early from Tests, no doubt he'll play World Cup: Allan DonaldFormer South African speedster Allan Donald believes Virat Kohli retired from Test cricket too early, praising his unmatched work ethic and backing him to feature in the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/big-bash-league-babar-azam-steve-smith-sydney-sixers-hobart-hurricanes-rain-2850105-2026-01-11",
      "headline": "Babar Azam and Steve Smith open for first time, Pakistan batter strugglesBBL 2025-26: Babar Azam opened the batting for Sydney Sixers alongside Steve Smith in their Big Bash League match. Babar managed just 9 from 14 deliveries, struggling to break free before rain played spoilsport on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-arshdeep-singh-snub-fans-rage-reaction-harshit-rana-favouritism-gambhir-2850095-2026-01-11",
      "headline": "IND vs NZ: Arshdeep Singh snub for 1st ODI sparks fan fury over 'blatant favouritism'IND vs NZ: Arshdeep Singh was left out of India's playing XI for the first ODI against New Zealand in Vadodara. The decision sparked fan outrage, with many questioning selection logic despite his strong recent ODI and domestic form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-trophy-tour-india-aiff-president-kalyan-chaubey-isl-indian-football-burns-fan-reaction-2850087-2026-01-11",
      "headline": "While Indian football burns, AIFF chief kickstarts FIFA World Cup trophy tour in DelhiWith Indian football in crisis, AIFF chief Kalyan Chaubey and Sports Minister Mansukh Mandaviya launched the FIFA World Cup trophy tour in Delhi. The timing sparked fan backlash over optics amid the sport's ongoing domestic turmoil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-dhruv-jurel-replaces-rishabh-pant-wicketkeeper-2850036-2026-01-11",
      "headline": "Dhruv Jurel replaces injured Rishabh Pant, joins ODI team in VadodaraIndia vs New Zealand: Dhruv Jurel has been added to India's ODI squad following Rishabh Pant's injury setback. The Uttar Pradesh wicketkeeper has joined the squad in Vadodara, the BCCI confirmed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-injury-viral-video-series-ending-dhruv-jurel-replacement-2850035-2026-01-11",
      "headline": "Watch: Rishabh Pant suffers painful series-ending blow during IND vs NZ trainingIND vs NZ: A viral video has captured the moment Rishabh Pant suffered the abdominal blow during India's Vadodara training session. The injury, confirmed a day earlier, ruled him out of the ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-test-cricket-bcci-broadcast-fan-experience-comparison-ashes-australia-england-2850025-2026-01-11",
      "headline": "The Ashes was a spectacle. Why doesn't Test cricket in India feel the same?The Ashes reminded us that when the fan comes first, Test cricket still commands time, attention and awe even in a distracted world. In India, the format does not need saving in India, but it does need reimagining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mumbai-marathon-penav-mota-paralympics-journey-criminal-lawyer-2849982-2026-01-11",
      "headline": "Unstoppable: A criminal lawyer defying odds to chase Paralympics dreamA criminal lawyer by trade and a long-distance runner by heart, Penav Mota looks to break down the barriers and represent India in the Paralympics soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-odi-live-score-rohit-sharma-virat-kohli-shubman-gill-vadodara-2850014-2026-01-11",
      "headline": "1st ODI Live: KL Rahul guides India to a 4-wicket win in thrillerIndia (IND) vs New Zealand (NZ), Live score 1st ODI: KL Rahul seals off a nervy chase with a massive six over long on. India pull off a nervy chase with 4 wickets in hand. They take a 1-0 lead, after holding off a gritty New Zealand side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-varun-chakravarthy-key-role-sourav-ganguly-reacts-title-defence-2850011-2026-01-11",
      "headline": "Varun Chakravarthy will be key for India in T20 World Cup: Sourav GangulySourav Ganguly has underlined Varun Chakravarthy's importance to India's T20 World Cup title defence at home. The former captain believes India's strong spin attack could be the defining factor in familiar conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-rohit-sharma-odi-series-silence-critics-bcci-2849997-2026-01-11",
      "headline": "Beyond the Ro-Ko madness: Stars hope to maximise ODI series to cut out noiseIND vs NZ: Rohit Sharma and Virat Kohli are enjoying a purple patch in ODI cricket, as they get ready for the series against New Zealand. The star duo will need to ensure that they deliver a world-class performance to ensure that the noise around them will be kept on mute during their rest period. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fa-cup-manchester-city-10-goals-vs-exeter-city-antoine-semenyo-debut-goal-rodri-2849994-2026-01-11",
      "headline": "FA Cup: Manchester City score 10 past Exeter City, Antoine Semenyo bags a debut goalManchester City launched their FA Cup campaign with a brutal 10-1 rout of Exeter City at the Etihad Stadium. Debutant Antoine Semenyo starred with a goal and assist in a record-equalling third-round win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-pep-talk-nets-bowler-ball-autograph-vadodara-watch-video-2849991-2026-01-11",
      "headline": "Watch: Virat Kohli's special pep-talk, autographs ball for Vadodara nets bowelerVirat Kohli's pep-talk and signed ball for a Vadodara net bowler went viral after India's training session. The moment reflected the confidence and calm in the camp ahead of the first ODI against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-odi-series-preview-rohit-sharma-virat-kohli-season-end-vadodara-2849989-2026-01-11",
      "headline": "Ro-Ko aim to end season on high as ODI cricket readies for 4-month hibernationIND vs NZ 1st ODI: India are set to play a 3-match ODI series against New Zealand. This will be the team's last ODI assignment till June 2026. Rohit Sharma and Virat Kohli will be in focus."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}