{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-details-10-things-to-know-before-subscribing-issue-size-price-band-gmp-2618649-2024-10-17",
      "headline": "Waaree Energies IPO: 10 things to know before subscribingWaaree Energies Limited (WEL), founded in 1990 and headquartered in Mumbai, is India's leading manufacturer and exporter of solar modules. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-allotment-details-check-latest-subscription-expected-listing-gains-gmp-2618590-2024-10-17",
      "headline": "Hyundai IPO allotment tomorrow: Check final subscription, expected listing gainsHyundai Motor India IPO: The public issue was initially met with hesitation from investors, but by the close on Thursday, October 17, it had been subscribed more than twice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q2-results-it-firm-announces-11-bonus-share-issue-for-shareholders-financial-results-net-profit-2618542-2024-10-17",
      "headline": "Wipro Q2 results: IT firm announces 1:1 bonus share issue for shareholdersWipro reported a 21% increase in net profit, reaching Rs 3,209 crore for the quarter ending in September, compared to Rs 2,646 crore in the same period last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-declares-interim-dividend-q2fy25-results-net-profit-revenue-2618510-2024-10-17",
      "headline": "Infosys declares interim dividend of Rs 21 for shareholders. Check key details Infosys interim dividend: The Bengaluru-based IT giant has set October 29, 2024, as the record date, with the payout scheduled for November 8, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q2-results-net-profit-jumps-21-percent-to-rs-3209-crore-consolidated-revenue-falls-2618501-2024-10-17",
      "headline": "Wipro Q2 results: Net profit jumps 21% to Rs 3,209 croreWipro's consolidated revenue for the July-September quarter decreased by 1%, amounting to Rs 22,302 crore, down from Rs 22,543 crore in the same quarter the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q2fy25-results-net-profit-5-percent-rs-6505-crore-interim-dividend-21-2618495-2024-10-17",
      "headline": "Infosys Q2 results: Net profit up 5% to Rs 6,506 crore; Rs 21 dividend declaredInfosys Q2FY25 results: Revenue from operations for India's second-largest software services company also grew by 5% year-on-year, amounting to Rs 40,986 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-auto-stocks-drive-market-correction-2618492-2024-10-17",
      "headline": "Sensex, Nifty end lower as auto stocks drive market correctionThe S&P BSE Sensex was down 494.75 points to close at 81,006.61, while the NSE Nifty50 lost 221.45 points to end at 24,749.85.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-plunges-over-500-points-nifty-below-25000-amid-market-sell-off-2618434-2024-10-17",
      "headline": "Sensex plunges over 500 points, Nifty below 25,000 amid market sell-offThe Sensex fell by 525.34 points, or 0.64%, at 80,976.02. Similarly, the Nifty dropped 222 points, or 0.89%, below the 25,000 mark at 24,749.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/impact-of-bomb-threats-on-airlines-ytvd-2618388-2024-10-17",
      "headline": "How bomb threats affect airlines financiallySanjay Lazar delves into the effects of bomb threats on the aviation industry, examining both financial and emotional impacts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-fully-subscribed-on-day-3-latest-subscription-gmp-allotment-dates-details-2618426-2024-10-17",
      "headline": "Hyundai IPO fully booked: Check latest subscription, GMP, allotment detailsHyundai Motor India IPO: The company's shares are set to be listed on both the BSE and NSE, with a tentative listing date of Tuesday, October 22, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/skipping-hyundai-ipo-over-low-gmp-3-strong-reasons-to-apply-anyway-expert-view-review-analysis-2618362-2024-10-17",
      "headline": "Skipping Hyundai IPO over low GMP? 3 strong reasons to apply anywayHyundai Motor India IPO: Unlike some recent IPOs that experienced high demand, Hyundai's offering has seen limited interest from investors over valuation concerns, with the expected listing gains also taking a hit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-job-cut-whatsapp-instagram-teams-as-tech-layoffs-drag-on-2618337-2024-10-17",
      "headline": "Meta job cuts hit WhatsApp, Instagram teams as tech layoffs drag onThe recent layoffs follow a pattern of restructuring that Meta has been pursuing for more than a year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bomb-hoaxes-on-flights-air-india-indigo-vistara-aviation-industrys-new-financial-headache-2618314-2024-10-17",
      "headline": "Hoax bomb threat on flights: Aviation industry's new financial headacheIn the past few days, Indian airlines have faced multiple hoaxes, forcing flight diversions and delays, piling up massive operational costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-latest-gmp-subscription-details-should-you-subscribe-2618291-2024-10-17",
      "headline": "Hyundai IPO: Big drop in GMP on day 3, should you subscribe?Hyundai Motor IPO: Despite concerns about short-term gains, some brokerages are optimistic about Hyundai's future. Read on to know whether you should subscribe to the public issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-acs-alone-will-consume-more-power-than-all-of-mexico-by-2035-energy-consumption-iea-report-2618282-2024-10-17",
      "headline": "'New' India's ACs alone will consume more power than all of Mexico by 2035India's growing demand for energy will soon outpace that of many nations, with air conditioners alone expected to consume more electricity than the entire power usage of Mexico by 2035."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/auto-stocks-see-share-decline-bajaj-auto-hero-motocorp-maruti-mahindra-eicher-motors-2618266-2024-10-17",
      "headline": "Bajaj Auto, Hero MotoCorp, Maruti: Why auto stocks are falling todayAuto stocks, including Bajaj Auto, Hero MotoCorp, Maruti, Eicher Motors, and M&M, saw significant declines in early Thursday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-shares-fall-10-percent-q2-results-explained-weak-sales-outlook-2618253-2024-10-17",
      "headline": "Explained: Why Bajaj Auto shares crashed 10% todayBajaj Auto shares dropped over 10% in early trade, following the company's Q2FY25 financial results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-early-trade-infosys-tcs-bajaj-auto-eicher-motors-rvnl-2618237-2024-10-17",
      "headline": "Sensex, Nifty decline in early trade; Infosys gains, Bajaj Auto sinks 9%The S&P BSE Sensex was down 315.93 points to 81,185.43 at 9:52 am, while the NSE Nifty50 fell 143.15 points to trade at 24,828.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-day-2-check-latest-subscription-gmp-expected-listing-gains-2617934-2024-10-16",
      "headline": "Hyundai IPO Day 2: Check latest subscription, GMPHyundai Motors India IPO: The bidding for the public issue will close on Thursday, with the allotment expected to be finalised by October 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sip-at-rs-100-does-it-make-sense-investment-tips-money-wealth-2617902-2024-10-16",
      "headline": "Mutual Fund SIPs at Rs 100: Does it make sense?A lower investment amount makes investing more accessible to a broader section of the population, particularly small-scale and first-time investors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-pakistan-visit-india-pm-modi-nawaz-sharif-sco-meet-exclusive-2618644-2024-10-17",
      "headline": "S Jaishankar's Pak visit a start, would have loved if PM Modi came: Nawaz SharifFormer Pakistan's Prime Minister Nawaz Sharif hoped that with Jaishankar's visit to Islamabad, both India and Pakistan could put the past behind and tackle future problems like energy and climate change, among others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hamas-chief-yahya-sinwar-survived-israeli-jail-22-years-took-on-hotel-guys-qatar-gaza-israel-idf-2618690-2024-10-17",
      "headline": "Hamas chief Yahya Sinwar killed? Israel tries to verifyHamas chief Yahya Sinwar, who ordered the October 7 attack on Israel, might have been killed in an airstrike, said the Israeli Defense Forces (IDF), adding that its intelligence agencies are trying to verify the news. The October 7 attacks that killed 1,200 Israelis plunged the Middle East into chaos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/salman-khan-lawrence-bishnoi-code-of-conduct-blackbuck-case-apology-baba-siddique-murder-2618519-2024-10-17",
      "headline": "What is the Bishnoi clan's code of conduct for apology and repentanceIf a person prefers to seek an apology from the Bishnoi community, it shall be conducted as per the 29 Niyamas (Code of Conduct) given by Guru Jambheshwar, the 16th-century founder of the Bishnoi Panth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-day-2-46-all-out-rohit-sharma-brave-press-conference-2618607-2024-10-17",
      "headline": "Brave Rohit Sharma fronts up to face press after 46-all out in Bengaluru Test India vs New Zealand: Captain Rohit Sharma surprised quite a few by fronting up to the press after a horror day for India in the first Test. India were bowled out for 46 and they conceded a 134-run lead at Stumps in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/if-you-have-a-soft-drink-daily-write-an-obituary-for-your-bones-2618514-2024-10-17",
      "headline": "If you have a soft drink daily, write an obituary for your bonesDid anyone tell you that drinking copious amounts of soft drinks affects your bones?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-lawrence-bishnoi-gang-justin-trudeau-khalistan-2618516-2024-10-17",
      "headline": "Asked Canada to extradite Lawrence Bishnoi gang members, got no response: IndiaMEA spokesperson Randhir Jaiswal said that similar extradition requests of syndicates linked to the Bishnoi gang were made recently as well, but Canada has not responded yet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/video/liam-payne-death-one-direction-argentina-2618633-2024-10-17",
      "headline": "'We're afraid he'll do something': Chilling 911 call before Liam Payne's fatal fallThe hotel manager made a 911 call moments before the fall, expressing growing concern over Liam Payne's erratic behaviour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-pakistan-visit-ties-shehbaz-sharif-champions-trophy-fawad-khan-bollywood-2618599-2024-10-17",
      "headline": "Will S Jaishankar's Pakistan visit open a window of opportunity?The optics of S Jaishankar agreeing to visit Pakistan amid tensions with Canada and shaking of hands and a brief conversation with Prime Minister Shehbaz Sharif indicated the opening of a window of opportunity for further engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-new-lady-justice-without-blindfold-sword-sanjay-raut-attack-on-cji-chandrachud-calls-bjp-rss-propaganda-2618528-2024-10-17",
      "headline": "Lady Justice sheds blindfold, Sanjay Raut fails to seeThe new statue of Lady Justice in the Supreme Court library holding the Constitution without a blindfold is an attempt at projecting new imagery, shedding the colonial imprint. However, Shiv Sena's Sanjay Raut has gone ballistic with accusations, failing to see reason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bahraich-murder-uttar-pradesh-durga-puja-procession-police-encounter-accused-killed-fleeing-to-nepal-2618461-2024-10-17",
      "headline": "2 Bahraich violence accused shot during encounter while trying to flee to NepalAccused, Sarfaraz alias Rinku and Taleem were shot at during the encounter that broke out near the Handa Basehri Canal near the international border when they were trying to flee to Nepal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/why-canada-no-evidence-canadian-pm-justin-trudeau-csis-rcmp-age-old-problem-pierre-trudeau-2618585-2024-10-17",
      "headline": "No evidence but egg on face. Canada's age-old problemJustin Trudeau went out on a limb to accuse India of a role in the killing of a Khalistani terrorist. He admitted there was intel but no evidence. The intelligence-to-evidence gap is a decades-old problem, stemming from Canadian police's excesses during the term of Trudeau's father, Pierre Trudeau."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/railway-ticket-booking-reservation-time-reduced-60-days-from-120-days-cancellation-2618457-2024-10-17",
      "headline": "Railways reduces advance ticket booking period to 60 days from NovemberFrom November 1, passengers will be able to book train tickets up to 60 days in advance, instead of the previous 120 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kangana-ranaut-emergency-gets-censor-certificate-release-date-announcement-soon-2618539-2024-10-17",
      "headline": "Kangana Ranaut's Emergency gets censor certificate, release date announcement soonActor Kangana Ranaut announced that her film, Emergency, has been cleared by the censor board for screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yahya-sinwar-killed-prime-target-israel-hamas-chief-tunnel-gaza-metro-ismail-haniyeh-dead-iran-idf-mosad-profile-2615328-2024-10-17",
      "headline": "Where is Hamas leader Yahya Sinwar, Israel's prime target?While Israel is eliminating one enemy after another, one top target who seems to have managed to evade it is Yahya Sinwar, Hamas's new chief. From his hiding, Sinwar called for suicide attacks on Israeli targets. Now, Israel's Mossad and Shin Bet are checking if Sinwar has been killed in an airstrike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-ex-somy-ali-post-lawrence-bishnoi-zoom-call-rajsthan-temple-baba-siddique-2618379-2024-10-17",
      "headline": "Salman Khan's ex Somy Ali's message for Lawrence Bishnoi: Can we talk?Salman Khan's ex and actor, Somy Ali, has invited gangster Lawrence Bishnoi for a Zoom call. Based in the US, Somy reached out to Lawrence, who is currently incarcerated at Sabarmati Central Jail, through a social media post. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-jharkhand-assembly-election-congress-observers-coordinator-ashok-gehlot-charanjit-singh-channi-baghel-adhir-ranjan-2618386-2024-10-17",
      "headline": "Gehlot again! What's Congress's fascination with tired and retiredThe Congress, after humiliating setbacks in Haryana and Jammu and Kashmir, continues to rely on the same old leaders with questionable track records for upcoming elections in Maharashtra and Jharkhand. Despite promises to introspect, the party's fascination with the old guard is hard to fathom."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-israel-iron-dome-miss-missiles-protect-some-areas-arrow-3-shortage-netanyahu-iran-2618338-2024-10-17",
      "headline": "Why Israel might allow Iron Dome to miss some missilesLike doctors who had to make the cruel choice of letting some patients die during the Covid pandemic, Israel might have to pick which areas it wants to shield and which it doesn't from enemy missiles. With the cost of shooting down all missiles fired at residential areas taking a toll, Israel might have to make a cruel choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/baba-siddique-murder-salman-khan-threat-lawrence-bishnoi-conspiracy-family-source-2618463-2024-10-17",
      "headline": "Deeper conspiracy behind Bishnoi gang's threats to Salman Khan: Family sourcesA sources in the family said that while the Lawrence Bishnoi gang has taken credit for Baba Siddique's killing, they believe the latest threats against Salman Khan could be a ploy to conceal a deeper and more elaborate conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zoho-ceo-sridhar-vembu-reacts-to-former-infosys-cfo-mohandas-pai-ignored-bengaluru-post-2618324-2024-10-17",
      "headline": "Zoho CEO on Mohandas Pai's 'Bengaluru ignored' post: Stop North-South politicsZoho CEO Sridhar Vembu reacted to former Infosys CFO Mohandas Pai's post in which he slammed the Centre for 'ignoring' Bengaluru while launching a major AI initiative in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-row-justin-trudeau-ministry-of-external-affairs-mea-hardeep-singh-nijjar-murder-probe-2618149-2024-10-17",
      "headline": "India calls out Trudeau's cavalier behaviour after he admits to no proof on NijjarThe Ministry of External Affairs slammed Trudeau's handling of the situation, stating that Canada had failed to provide any evidence to support its allegations against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-moment-super-heavy-engines-light-up-to-slow-down-the-falling-200-ton-rocket-2618558-2024-10-17",
      "headline": "Video: Super Heavy engines light up to slow down the 200-ton rocketThe video, shot at an impressive 420 frames per second, reveals the sheer force required to slow down the massive 200-ton rocket as it approached the launch tower for a groundbreaking catch attempt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-delhi-emergency-signal-london-flight-tracker-2618569-2024-10-17",
      "headline": "Air India flight from Mumbai transmits emergency signal over London: Flight trackerAir India flight- AIC129- from Mumbai to London was squawking 7700 (sending emergency signal) while it was flying over the UK capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/electric-state-trailer-millie-bobby-brown-chris-pratt-star-in-dystopian-tale-russo-brothers-netflix-2618686-2024-10-17",
      "headline": "Electric State trailer: Millie Bobby Brown, Chris Pratt star in dystopian taleThe first full trailer of Electric State, starring Millie Bobby Brown and Chris Pratt in the lead, is out. The Russo Brothers film promises an action-packed tale set against a dystopian background. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-says-she-is-living-her-life-with-no-regrets-i-feel-fortunate-2618653-2024-10-17",
      "headline": "Malaika Arora says she's living her life with 'no regrets': I feel fortunate...In an interview recently, actor Malaika Arora spoke about making independent choices in life and standing by them without any regrets. The actor also wished to be doing a full-fledged role in a film soon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/video/liam-payne-death-one-direction-argentina-2618633-2024-10-17",
      "headline": "'We're afraid he'll do something': Chilling 911 call before Liam Payne's fatal fallThe hotel manager made a 911 call moments before the fall, expressing growing concern over Liam Payne's erratic behaviour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/shrutika-arjun-raaj-bigg-boss-18-salman-khan-weekend-ka-vaar-bigg-boss-tamil-2618625-2024-10-17",
      "headline": "Actor Shrutika talks about choosing Bigg Boss 18 over BB TamilTamil actor Shrutika Arjun Raaj, in an exclusive conversation with India Today Digital, discussed her decision to enter Bigg Boss 18. The actor revealed that she had decked Bigg Boss Tamil last year. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haddin-joshi-to-be-part-of-pontings-punjab-kings-hopes-likely-as-bowling-coach-2618691-2024-10-17",
      "headline": "Haddin, Joshi to be part of Ponting's Punjab Kings; Hopes likely as bowling coachPunjab Kings are set to retain the majority of their support staff after the arrival of new head coach Ricky Ponting, with fast bowling coach James Hopes likely to be the sole addition for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-responsibility-no3-bengaluru-test-rohit-sharma-2618671-2024-10-17",
      "headline": "Virat Kohli took responsibility of batting at No.3: Rohit Sharma IND vs NZ: Rohit Sharma said that Virat Kohli took the responsibility of batting at No.3 in the Bengaluru Test. Kohli scored a nine-ball duck before William O'Rourke accounted for his wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/i-didnt-read-the-pitch-in-bengaluru-test-well-enough-rohit-sharma-2618660-2024-10-17",
      "headline": "I didn't read the pitch in Bengaluru Test well enough: Rohit Sharma India vs New Zealand: Rohit Sharma showed a lot of courage and fronted up to face the press at the end of the second day's play in Bengaluru. India were bundled out for 46, the lowest total in Asia in a Test match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/denmark-open-pv-sindhu-beats-world-no7-yue-enter-quarterfinals-2618652-2024-10-17",
      "headline": "PV Sindhu battles past World No.7 Han Yue to enter quarterfinalsDenmark Open: Two-time Olympic medallist PV Sindhu defeated world number seven Han Yue of China in a thrilling contest to reach the quarterfinals of the Super 750 badminton tournament on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-injury-update-rohit-sharma-2618634-2024-10-17",
      "headline": "Rishabh Pant has swelling in knee: Captain Rohit Sharma shares injury updateIndia vs New Zealand, Bengaluru Test: Captain Rohit Sharma provided an update on wicketkeeper Rishabh Pant's injury, revealing that Pant was hit on the same knee that underwent surgery earlier in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-day-2-46-all-out-rohit-sharma-brave-press-conference-2618607-2024-10-17",
      "headline": "Brave Rohit Sharma fronts up to face press after 46-all out in Bengaluru Test India vs New Zealand: Captain Rohit Sharma surprised quite a few by fronting up to the press after a horror day for India in the first Test. India were bowled out for 46 and they conceded a 134-run lead at Stumps in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-shakib-al-hasan-farewell-test-mirpur-2618589-2024-10-17",
      "headline": "Shakib Al Hasan 'not going home' as uncertainty over farewell Test remainsBAN vs SA: Shakib Al Hasan won't be catching the flight from Dhaka on Thursday as doubts about his participation in the Mirpur Test against South Africa keep building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-matt-henry-ipl-experience-bengaluru-bowling-heroics-2618588-2024-10-17",
      "headline": "Matt Henry explains how IPL experience helped Kiwi pacers script India's collapseNew Zealand pacer Matt Henry has credited his experience in the Indian Premier League (IPL) for aiding the Kiwi bowlers in orchestrating India's batting collapse on Day 2 of the first Test in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-day-2-score-46-devon-conway-2618570-2024-10-17",
      "headline": "Bengaluru Test: Bowled out for 46, India concede control on rare off-day at homeIndia (IND) vs New Zealand (NZ), 1st Test: India had a rare off-day in a home Test. The hosts were bowled out for 46, their lowest Test total in familiar conditions. New Zealand sealed a 134-run lead after Devon Conway's stroke-filled 91 in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-injury-update-rohit-sharma-2618634-2024-10-17",
      "headline": "Rishabh Pant has swelling in knee: Captain Rohit Sharma shares injury updateIndia vs New Zealand, Bengaluru Test: Captain Rohit Sharma provided an update on wicketkeeper Rishabh Pant's injury, revealing that Pant was hit on the same knee that underwent surgery earlier in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-day-2-46-all-out-rohit-sharma-brave-press-conference-2618607-2024-10-17",
      "headline": "Brave Rohit Sharma fronts up to face press after 46-all out in Bengaluru Test India vs New Zealand: Captain Rohit Sharma surprised quite a few by fronting up to the press after a horror day for India in the first Test. India were bowled out for 46 and they conceded a 134-run lead at Stumps in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-shakib-al-hasan-farewell-test-mirpur-2618589-2024-10-17",
      "headline": "Shakib Al Hasan 'not going home' as uncertainty over farewell Test remainsBAN vs SA: Shakib Al Hasan won't be catching the flight from Dhaka on Thursday as doubts about his participation in the Mirpur Test against South Africa keep building. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-matt-henry-ipl-experience-bengaluru-bowling-heroics-2618588-2024-10-17",
      "headline": "Matt Henry explains how IPL experience helped Kiwi pacers script India's collapseNew Zealand pacer Matt Henry has credited his experience in the Indian Premier League (IPL) for aiding the Kiwi bowlers in orchestrating India's batting collapse on Day 2 of the first Test in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-bengaluru-test-day-2-score-46-devon-conway-2618570-2024-10-17",
      "headline": "Bengaluru Test: Bowled out for 46, India concede control on rare off-day at homeIndia (IND) vs New Zealand (NZ), 1st Test: India had a rare off-day in a home Test. The hosts were bowled out for 46, their lowest Test total in familiar conditions. New Zealand sealed a 134-run lead after Devon Conway's stroke-filled 91 in Bengaluru. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-ajinkya-rahane-training-video-bengaluru-batting-collapse-2618568-2024-10-17",
      "headline": "Message to selectors? Ajinkya Rahane shares training video after India 46-all outIndia vs New Zealand: Former vice-captain Ajinkya Rahane shared a training video of himself batting in the nets moments after India's shocking batting collapse against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-travel-pakistan-contingencies-england-cricket-board-chiefs-2618563-2024-10-17",
      "headline": "Contingencies ready if India don't travel for Champions Trophy: ECB chiefsECB chiefs expressed confidence that India and Pakistan's geopolitical tensions won't prevent India from participating in the 2025 Champions Trophy in Pakistan, emphasising the tournament's broadcast rights hinge on India's involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-devon-conway-bengaluru-test-2618562-2024-10-17",
      "headline": "Devon Conway equals McCullum in unlucky club with 91 in Bengaluru TestIND vs NZ: Devon Conway scored 91 runs off 105 balls after New Zealand bowled India out for 46 on Day 1 of the opening Test at the M Chinnaswamy Stadium in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-devon-conway-engage-in-banter-chinnaswamy-erupts-with-csk-chants-2618544-2024-10-17",
      "headline": "Mohammed Siraj-Devon Conway engage in banter: Chinnaswamy erupts with CSK chantsMohammed Siraj and Devon Conway engaged in a little banter during New Zealand's innings in Bengaluru. Conway scored a brilliant 91-run knock and missed out on a hundred. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-injury-left-knee-carried-off-bengaluru-test-2618537-2024-10-17",
      "headline": "IND vs NZ: On horror day, Rishabh Pant carried off field with knee injuryIndia's disastrous Bengaluru Test took a grim turn on Day 2 as Rishabh Pant was carried off the field with a left-knee injury, deepening concerns for the team after their batting collapse and raising doubts about his availability for upcoming crucial matches."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-angry-shouts-sarfaraz-khan-fielding-bengaluru-test-2618512-2024-10-17",
      "headline": "Watch: Angry Rohit Sharma scolds Sarfaraz Khan on field during Bengaluru TestIndia's horror show on Day 1 of the Bengaluru Test saw Rohit Sharma lash out at Sarfaraz Khan for being out of position while fielding. New Zealand bowlers, led by Tim Southee, wreaked havoc, bowling India out for their lowest home-Test total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uncertainty-looms-over-icc-champions-trophy-2025-amid-india-pakistan-tensions-2618506-2024-10-17",
      "headline": "Uncertainty looms over ICC Champions Trophy 2025 amid India-Pakistan tensionsChampions Trophy 2025: The future of the ICC tournament is increasingly uncertain as discussions surrounding India's potential participation in Pakistan continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-compares-indian-and-new-zealand-batters-approach-on-bengaluru-pitch-2618498-2024-10-17",
      "headline": "Anil Kumble compares Indian and New Zealand batters' approach on Bengaluru pitchAnil Kumble drew comparisons between the Indian and New Zealand batters' approach on the Bengaluru pitch, which had both pace and swing to offer. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-injury-left-knee-carried-off-bengaluru-test-2618537-2024-10-17",
      "headline": "IND vs NZ: On horror day, Rishabh Pant carried off field with knee injuryIndia's disastrous Bengaluru Test took a grim turn on Day 2 as Rishabh Pant was carried off the field with a left-knee injury, deepening concerns for the team after their batting collapse and raising doubts about his availability for upcoming crucial matches."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-angry-shouts-sarfaraz-khan-fielding-bengaluru-test-2618512-2024-10-17",
      "headline": "Watch: Angry Rohit Sharma scolds Sarfaraz Khan on field during Bengaluru TestIndia's horror show on Day 1 of the Bengaluru Test saw Rohit Sharma lash out at Sarfaraz Khan for being out of position while fielding. New Zealand bowlers, led by Tim Southee, wreaked havoc, bowling India out for their lowest home-Test total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uncertainty-looms-over-icc-champions-trophy-2025-amid-india-pakistan-tensions-2618506-2024-10-17",
      "headline": "Uncertainty looms over ICC Champions Trophy 2025 amid India-Pakistan tensionsChampions Trophy 2025: The future of the ICC tournament is increasingly uncertain as discussions surrounding India's potential participation in Pakistan continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anil-kumble-compares-indian-and-new-zealand-batters-approach-on-bengaluru-pitch-2618498-2024-10-17",
      "headline": "Anil Kumble compares Indian and New Zealand batters' approach on Bengaluru pitchAnil Kumble drew comparisons between the Indian and New Zealand batters' approach on the Bengaluru pitch, which had both pace and swing to offer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-schedule-political-tensions-2618494-2024-10-17",
      "headline": "When India vs Pakistan schedule had to be altered due to political tensions Schedule of matches between India and Pakistan have been changed several times due to political tensions between the two nations. The arch-rivals haven't played in a bilateral series since January 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hemang-badani-named-delhi-capitals-head-coach-venugopal-rao-director-of-cricket-2618465-2024-10-17",
      "headline": "Hemang Badani named Delhi Capitals head coach, Venugopal Rao Director of CricketFormer India batter Hemang Badani will take over as the new head coach at Delhi Capitals (DC) for IPL 2025. Along with Badani, DC has also appointed former India batter Venugopal Rao as the director of cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/asian-championship-powerlifting-gold-medal-mumbai-boy-down-syndrome-2618459-2024-10-17",
      "headline": "Mumbai boy with Down syndrome wins Commonwealth powerlifting goldSeventeen-year-old Prithviraj Sengupta, a rising star in powerlifting, won gold at the Commonwealth Powerlifting Championship. Despite his Down syndrome, he triumphed through sheer determination, mentorship, and support from his family, setting his sights on the Olympics while excelling in baking and dance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-director-of-cricket-jsw-sports-delhi-capitals-ipl-wpl-2618449-2024-10-17",
      "headline": "After operational change at Delhi Capitals, Sourav Ganguly gets new role at JSWHours after Delhi Capitals' owners JSW Group and GMR Group announced an operational restructuring, Sourav Ganguly was appointed as the Director of Cricket of the JSW Group. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}