{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-indian-tech-founders-can-register-a-global-company-online-in-4-hours-and-enjoy-0-percent-tax-on-reinvested-profits-2765929-2025-08-05",
      "headline": "Why Estonia is the new favourite for Indian startupsAccording to an investment banker, top business leaders have already adopted Estonia's unique e-residency, allowing them to do business across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-308-points-lower-nifty-below-24700-titan-up-2-2766579-2025-08-05",
      "headline": "Sensex ends over 308 points lower, Nifty below 24,700; Titan up 2%The S&P BSE Sensex ended the session 308.47 points lower at 80,710.25, while the NSE Nifty50 fell 73.20 points to settle at 24,649.55. All the broader market indices ended the trading session in negative territory after Trump said he would impose more tariffs on India over Russian oil imports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-property-seller-nearly-paid-rs-187-lakh-more-in-tax-due-to-a-common-capital-gains-error-2766498-2025-08-05",
      "headline": "How one tax mistake could have cost a real estate seller Rs 1.87 lakhReal estate sellers often ignore deductions that can help reduce capital gains tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blended-petrol-india-government-push-reason-explained-2766519-2025-08-05",
      "headline": "Why the government wants to blend more ethanol with petrolBy March 2025, the government hit its E20 blending target—20% ethanol in petrol—five years ahead of schedule. Average blending levels stood at 17.98% in February 2025, up from 14.6% the year before, according to official data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-do-this-before-anything-else-2766485-2025-08-05",
      "headline": "Filing ITR for the first time? Do this before anything elseThe last date to file your ITR for the financial year 2024–25 is September 15, 2025, so it's best to begin early and avoid the last-minute rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pan-20-to-go-live-in-18-months-what-it-means-and-how-it-affects-you-2766433-2025-08-05",
      "headline": "PAN 2.0 to go live in 18 months: What it means and how it affects youThe Rs 1,435 crore project will focus on simplifying taxpayer registration services and improving the overall experience through a new, unified online platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-p-b-balaji-jaguar-land-rover-new-ceo-2766412-2025-08-05",
      "headline": "Who is P B Balaji, Jaguar Land Rover's new CEO?The decision was confirmed in a stock exchange filing on August 4, 2025. Balaji's appointment marks a major shift, as he moves from a financial leadership role to the driver's seat of one of the world's most recognised car brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-investors-worried-trump-tariff-threat-sensex-nifty-fall-today-2766386-2025-08-05",
      "headline": "Sensex tumbles 400 points: Why is the stock market falling today?The S&P BSE Sensex was down 394.03 points to 80,614.50 at around 9:59 am, while the NSE Nifty50 fell 121.90 points to 24,600.85. Broader markets also mirrored the nervousness on Dalal Street, with mid- and small-cap indices under pressure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-regulator-irdai-fines-policybazaar-multiple-violations-key-details-2766375-2025-08-05",
      "headline": "Why insurance regulator fined Policybazaar Rs 5 crore? All you need to knowThe IRDAI noted that various insurance products were promoted as \"top\" or \"best\" in a manner that appeared biased and lacked substantiation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-below-24700-indusind-bank-gains-2-2766359-2025-08-05",
      "headline": "Sensex, Nifty fall after Trump's fresh tariff threat over Russian oil importsThe S&P BSE Sensex fell 156.96 points to 80,861.76 around 9:23 am, while the NSE Nifty50 fell 30.80 points to trade at 24,691.95. Most of the broader market indices also mirror the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-ethanol-blended-petrol-clarification-safe-for-old-new-vehicles-2766355-2025-08-05",
      "headline": "Government's big remark as ethanol-blended petrol has car owners fumingIn a post on X (formerly Twitter), the ministry responded to recent media reports questioning whether E20 fuel could damage older vehicles or degrade the driving experience. Citing multiple studies and expert assessments, it stated that E20 is both safe and beneficial."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summons-delhi-loan-fraud-case-reliance-group-pmla-2766344-2025-08-05",
      "headline": "Anil Ambani at ED office for questioning in multiple fraud casesThe summons against Anil Ambani followed a massive crackdown by the ED last month, during which the agency searched 35 premises linked to some top executives of the Reliance Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thousands-boeing-fighter-jet-workers-strike-after-rejecting-contract-offer-glbs-2766297-2025-08-05",
      "headline": "Thousands of Boeing fighter jet workers go on strike after rejecting contract offerOver 3,200 workers have walked off the job in what marks their first strike in nearly 30 years. The affected workers, primarily based in the St. Louis region, are responsible for assembling and maintaining military aircraft, including the F-15 fighter jet and various missile systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-mumbai-tesla-to-open-showroom-in-delhis-aerocity-on-august-11-2766180-2025-08-04",
      "headline": "After Mumbai, Tesla to open showroom in Delhi's Aerocity on August 11The Delhi showroom will be opened at Worldmark 3 in Aerocity for customers. Like the Mumbai showroom, this showroom is also expected to serve as a display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-brand-loyalty-rate-dropped-after-elon-musk-backed-donald-trump-as-us-president-2766155-2025-08-04",
      "headline": "Tesla's brand loyalty took a hit after Musk backed Trump as US President: ReportThe data shows Tesla's customer loyalty peaked in June 2024, when 73% of Tesla-owning households in the market for a new car bought another Tesla, according to an S&P analysis of vehicle-registration data in all 50 states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-kapurs-mother-says-his-death-could-be-part-of-coordinated-transnational-conspiracy-seeks-uk-probe-2766105-2025-08-04",
      "headline": "Sunjay Kapur's death: Mother alleges foul play, transnational conspiracy in letterSunjay Kapur passed away on June 12 while playing polo at the Duke's Ground of the Old Guards Polo Club in Surrey, UK. His death was officially described as a heart attack. However, his mother Rani now claims there may be more to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-activate-uan-via-umang-app-epfo-makes-aadhaar-face-authentication-mandatory-from-august-7-2766068-2025-08-04",
      "headline": "How to activate UAN via UMANG app to access EPFO servicesEPFO now requires everyone to activate their UAN through the UMANG app using Aadhaar-based face authentication to access provident fund services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-offers-elon-musk-29-billion-deal-to-stay-onboard-2766070-2025-08-04",
      "headline": "Tesla offers Elon Musk $29 billion deal to stay onboardIn 2018, Tesla had promised Musk a huge $50 billion pay package if he hit certain performance goals. But earlier this year, a court in Delaware cancelled that deal, saying the company's board didn't do a fair job protecting shareholders when they approved it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/eds-crackdown-on-anil-ambani-web-of-bank-frauds-all-you-need-to-know-2766076-2025-08-04",
      "headline": "ED's crackdown on Anil Ambani, web of bank frauds: All you need to knowThe fraud case centres around unpaid loans amounting to nearly Rs 17,000 crore, which were taken by various firms linked to Anil Ambani. Officials are now trying to trace the money trail and who were all involved in diverting it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-you-unemployed-or-studying-should-you-file-taxes-this-year-2766048-2025-08-04",
      "headline": "Are you unemployed or studying? Should you file taxes this yearIf your total income is below the basic exemption limit, Rs 2.5 lakh under the old tax regime or Rs 3 lakh under the new one, you are not legally required to file an ITR. This means many students and unemployed individuals fall outside the mandatory filing bracket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-418-points-higher-nifty-above-24700-tata-steel-ends-4-percent-up-2766024-2025-08-04",
      "headline": "Sensex closes 418 points higher, Nifty above 24,700; Tata Steel ends 4% upThe S&P BSE Sensex added 418.81 points to close at 81,018.72, while the NSE Nifty50 gained 157.40 points to end at 24,722.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-it-jobs-at-risk-ai-automation-entry-mid-level-why-reasons-expert-view-2766017-2025-08-04",
      "headline": "TCS to cut 12,000 jobs in FY26: Why are mid-level IT jobs at risk?Experts believe TCS layoffs point to a broader structural change where automation and AI are beginning to take over routine tasks, leading to a change in the type of roles companies want to retain and the kind of talent they want to hire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-probes-banks-in-rs-17000-crore-loan-fraud-linked-to-anil-ambani-2765906-2025-08-04",
      "headline": "ED probes banks in Rs 17,000 crore loan fraud linked to Anil AmbaniThe Enforcement Directorate (ED) is investigating why 39 banks failed to report a loan fraud of ₹17,000 crore linked to companies of businessman Anil Ambani. The agency suspects that the banks' silence may have been bought. The central question being investigated is, \"Was there a certain bribe that was paid to the banks to buy their silence?\" The ED has asked the banks to explain their inaction, especially when the loans turned into non-performing assets (NPAs). As the money laundering investigation mounts, Anil Ambani has been summoned to appear on the 5th of August. The ED has also summoned his top executives and close aides, including Amitabh Jhunjhunwala and Satish Seth, believing they hold key information on how the alleged frauds and payment of bribes occurred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-sector-banks-spending-on-recovery-agents-exclusive-rti-details-2765958-2025-08-04",
      "headline": "RTI reveals how much PSU banks spend on recovery agentsIndia Today filed a Right to Information (RTI) query with the Department of Financial Services (DFS) to uncover how much taxpayer-funded public sector banks are spending on recovery agents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-vs-new-tax-regime-whats-better-for-you-in-fy-2024-25-2765913-2025-08-04",
      "headline": "Old vs new tax regime: What's better for you in FY 2024–25?With the ITR filing deadline extended to September 15, 2025, you've got more time to pick the right tax regime. Should you stick to the old one with its deductions, or go for the new one with lower rates?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ed-probe-summons-anil-ambani-top-executives-questions-39-bank-rs-17000-crore-loan-fraud-2765902-2025-08-04",
      "headline": "ED summons Anil Ambani's top aides; probes banks over Rs 17,000 crore loan fraudDays after summoning Anil Ambani, the Enforcement Directorate (ED) has now issued summons to several of his top executives for questioning under the Prevention of Money Laundering Act (PMLA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mango-millionaire-radhika-gupta-niranjan-avasthi-sips-investing-financial-freedom-2765882-2025-08-04",
      "headline": "'Mango Millionaire' authors Radhika Gupta, Niranjan Avasthi on SIPs, investing and moreIn this exclusive Q&A interaction, Gupta and Avasthi reflect on the core ideas in their book, the pitfalls of social media-driven investing, why SIPs still matter, and what India needs to change in the way it talks about money and long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-dubai-property-with-credit-cards-why-many-indians-are-now-in-trouble-2765838-2025-08-04",
      "headline": "Buying Dubai property with credit cards? Why many Indians are now in troubleSeveral homebuyers either clicked on payment links shared by Dubai-based builders or swiped their credit cards during their visits to the UAE. It felt hassle-free, no paperwork, no visits to the bank. But there's a catch. Read here to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijaykumar-earned-rs-95-crore-who-are-india-top-highest-paid-it-bosses-tcs-infosys-wipro-2765847-2025-08-04",
      "headline": "HCLTech CEO earned Rs 95 crore: Here are India's highest-paid IT bossesHCLTech also reported a 17.6% increase in the median pay for its employees during the financial year. HCLTech currently has 1,67,316 permanent employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dehlivery-shares-rally-up-to-5-percent-after-q1-results-should-you-buy-2765822-2025-08-04",
      "headline": "Dehlivery shares rally up to 5% after Q1 results. Should you buy?Delhivery shares jumped 5% in early trade after the company posted its Q1FY26 results. Should you buy into the rally or wait and watch how the integration and margins play out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sri-lotus-developers-ipo-allotment-today-august-4-check-status-gmp-listing-date-expected-profit-2765804-2025-08-04",
      "headline": "Sri Lotus Developers IPO allotment today: Check your status, GMP, listing dateThe IPO of Sri Lotus Developers received a strong response during its three-day bidding window, with total subscriptions reaching 74.10 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-hurting-us-economy-jobs-inflation-data-explained-2765799-2025-08-04",
      "headline": "Explained: How Trump's tariffs are hurting the US economyWith inflation rising and global backlash mounting, data suggests Trump's tariff blitz is straining the American economy, casting doubt on his promise to 'make it great again'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-160-points-higher-nifty-above-24600-bel-up-1-2765783-2025-08-04",
      "headline": "Sensex opens 160 points higher, Nifty above 24,600; BEL up 1%The S&P BSE Sensex added 229.73 points to 80,829.64, while the NSE Nifty50 rose 81.55 points to 24,646.90 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-price-band-rs-139-147-details-august-7-opening-date-rs-3600-crore-2765781-2025-08-04",
      "headline": "JSW Cement IPO price band announced. Check other detailsJSW Cement's IPO includes a fresh issue of 10.88 crore shares worth Rs 1,600 crore and an offer for sale of 13.61 crore shares worth Rs 2,000 crore. The company had initially aimed to raise Rs 4,000 crore, but later reduced the issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-august-meeting-rate-cut-decision-us-tariff-worry-inflation-july-governor-sanjay-malhotra-2765771-2025-08-04",
      "headline": "RBI MPC begins today: Will US tariffs trigger a rate cut?The RBI's August MPC is meeting after cutting interest rates by 100 basis points across its last three policy meetings. The policy stance has remained 'neutral'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-allotment-today-out-check-your-status-gmp-listing-date-august-6-gains-expected-profit-2765763-2025-08-04",
      "headline": "NSDL IPO allotment today: Check your status, GMP and listing dateInvestors who applied for NSDL shares can check their allotment status either on the BSE website or the website of the registrar, MUFG Intime India Private Limited (Link Intime)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-for-wedding-why-borrowing-for-the-big-day-needs-rethinking-wedding-budget-planning-wedding-loan-interest-rates-2765508-2025-08-03",
      "headline": "Personal loan for wedding? Why borrowing for the big day needs rethinkingA wedding is a beautiful milestone, but is it worth starting your new life under a mountain of debt? With the rising trend of using personal loans to fund lavish celebrations, it's time to rethink the cost of saying \"I do.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/janaki-v-vs-state-of-kerala-on-ott-release-when-and-where-to-watch-suresh-gopi-film-2766607-2025-08-05",
      "headline": "Janaki V vs State of Kerala on OTT: When and where to watch Suresh Gopi's film'Janaki V vs State of Kerala', featuring Union Minister Suresh Gopi and Anupama Parameswaran, is now set to premiere on OTT from August 15. The legal drama, inspired by true events and highlighting a survivor's fight for justice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-shares-post-yuzvendra-chahal-divorce-remarks-podcast-2766578-2025-08-05",
      "headline": "Dhanashree Verma shares 1st post after Yuzvendra Chahal's divorce remarksChoreographer Dhanashree Verma shared first post after her ex-husband Yuzvendra Chahal's latest remarks on their divorce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-medha-rana-visit-golden-temple-wrap-border-2-shoot-diljit-dosanjh-ahan-shetty-2766601-2025-08-05",
      "headline": "Varun Dhawan, Medha Rana visit Golden Temple as they wrap Border 2 shoot. See picActors Varun Dhawan and his co-star Medha Rana visited the Golden Temple after they wrapped the shoot of their upcoming film 'Border 2'. The film also stars Ahan Shetty and Diljit Dosanjh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-ravie-dubey-and-the-emergence-of-new-hero-in-bollywood-2766594-2025-08-05",
      "headline": "Ahaan Panday, Ravie Dubey and the emergence of new hero in BollywoodFor the longest time, Bollywood's leading men arrived with drumrolls. They were groomed, positioned, and presented to an audience trained to applaud before the performance even began. But something seems to be shifting. In actors like Ahaan Panday and Ravie Dubey, we hope to see a new beginning that probably doesn't depend on legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/unspeakable-sins-review-netflix-mexican-erotic-drama-is-stylish-full-of-scandal-and-seductive-2766270-2025-08-05",
      "headline": "Unspeakable Sins review: A stylish, seductive and surprisingly sharp erotic dramaRelease Date:Wed Jul 30, 2025Unspeakable Sins Review: Netflix's 'Unspeakable Sins' is a gripping Mexican thriller that delves into the dark world of power, betrayal, and emotional manipulation within elite society. With strong performances and a slow-burning narrative, it offers a compelling watch despite its lengthy episodes and occasional melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-says-difficult-to-make-another-sholay-as-film-nears-50th-anniversary-2766543-2025-08-05",
      "headline": "Difficult to make another Sholay as film nears 50th anniversary, says Hema MaliniActor-politician Hema Malini dismissed the possibility of a remake of 'Sholay'. Malini also expressed that she didn't know the film would be such a hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-parasuram-has-begun-says-hombale-films-as-they-discuss-narsimhas-success-2766572-2025-08-05",
      "headline": "Mahavatar Parasuram has begun, says Hombale films as they discuss Narsimha's success'Mahavatar Narsimha' has surpassed Rs 100 crore globally in just 10 days. Hombale Films, who presented the film, exclusively spoke to India Today Digital, reflecting on the film's massive success and upcoming movies in the franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/is-vivian-dsena-returning-to-tv-ekta-kapoor-hints-at-new-collaboration-naagin-7-2766549-2025-08-05",
      "headline": "Is Vivian Dsena returning to TV? Ekta Kapoor hints at new collaborationVivian Dsena and Ektaa Kapoor have sparked excitement with a playful Instagram exchange hinting at a possible comeback of the cult supernatural series 'Pyaar Kii Ye Ek Kahaani'. Fans are eagerly hopeful as Vivian expresses his desire for a meaningful return to TV or OTT. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-mother-pinkie-70-nails-war-2-aavan-jaavan-song-hooksteps-kiara-advani-sussanne-khan-shower-praise-2766420-2025-08-05",
      "headline": "Hrithik's mother, 70, nails Aavan Jaavan hooksteps. Kiara, Sussanne shower praiseActor Hrithik Roshan recently shared a video of his mother dancing to the song 'Aavan Jaavan'. At 70, Pinkie's energetic performance to the song from his upcoming film 'War 2' has captivated not only her son but also several celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-air-india-gratitude-note-humour-brings-joy-onboard-standup-comedy-fool-volume-netflix-2766477-2025-08-05",
      "headline": "Vir Das receives gratitude note from Air India crew: Your humour brings joyActor Vir Das received a heartfelt gratitude note from the Air India crew onboard. The crew praised his humour and presence, highlighting the joy he brought during the journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-resumes-ssmb-29-shoot-mahesh-babu-rajamouli-hyderabad-south-african-schedule-2766544-2025-08-05",
      "headline": "Priyanka Chopra resumes SSMB 29 shoot in Hyderabad ahead of South Africa schedulePriyanka Chopra and Mahesh Babu have resumed the shooting of director SS Rajamouli's 'SSMB 29' in Hyderabad. After the brief Hyderabad schedule, the team will move on to a longer schedule in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-teaser-farhan-akhtar-major-shaitan-singh-biopic-1962-rezang-la-war-2766533-2025-08-05",
      "headline": "120 Bahadur teaser: Farhan Akhtar leads epic retelling of 1962 Rezang La warThe teaser of 120 Badhadur was released on August 5. Actor Farhan Akhtar portrays Major Shaitan Singh Bhati, PVC in the film based on 1962 Rezang La war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-mrunal-thakur-dating-viral-video-sparks-buzz-2766494-2025-08-05",
      "headline": "Dhanush and Mrunal Thakur's viral video from a party fuels dating rumoursActors Dhanush and Mrunal Thakur have sparked dating rumours after the duo was seen at the Sita Ramam actor's star-studded birthday bash on August 1. A video from the celebration quickly went viral, adding fuel to the speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jung-woo-sung-reportedly-marries-a-moment-to-remeber-2766531-2025-08-05",
      "headline": "South Korean actor Jung Woo-sung marries longtime partner, agency respods: ReportsSouth Korean actor Jung Woo Sung is making headlines once again, this time over reports of a quietly registered marriage and developments in his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-7-august-4-update-tulsi-meets-vrinda-pari-gets-dumped-2766527-2025-08-05",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot Ep 7: Tulsi meets Vrinda, Pari gets dumpedIn the new episode of 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot, Angad continues to be in jail and Pari gets dumped by her boyfriend. Meanwhile, Tulsi finally manages to meet Vrinda, the new character who's been positioned as the Tulsi of the new generation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-emerges-surprise-hero-of-mandala-murders-vaani-kapoor-vaibhav-gupta-2766465-2025-08-05",
      "headline": "Surveen Chawla emerges as the surprise hero of Mandala MurdersIn Mandala Murders, while the plot mainly revolves around Vaani Kapoor and Vaibhav Raj Gupta's characters, it's Surveen Chawla who quietly steals the show. Surveen delivers a powerful performance that grows stronger with each episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hidden-love-zhao-lusi-agency-controversy-c-drama-2766451-2025-08-05",
      "headline": "Hidden Love star Zhao Lusi accuses agency of financial abuse, blacklisting threatsChinese actor-singer Zhao Lusi claimed that Galaxy Cool Entertainment failed to support her. Known for her role in Hidden Role, the actor also accused them of wage theft and breach of contract. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-50-years-anniversary-amitabh-bachchan-dharmendra-salim-javed-amjad-khan-2766503-2025-08-05",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-kareena-kapoor-celebrities-india-beats-england-2766481-2025-08-05",
      "headline": "Suniel Shetty erupts in joy as India beats England at The Oval, celebs congratulateSuniel Shetty and his family, Kareena Kapoor and many Bollywood stars applauded Team India's stunning win over England at The Oval. The victory drew widespread praise for the team's spirit and strategy from fans and celebrities alike."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-weather-update-cloudburst-in-uttarkashi-triggers-massive-landslide-video-2766547-2025-08-05",
      "headline": "4 dead, over 50 missing as cloudburst triggers monster landslide in Uttarakhand Live UpdatesUttarkashi Dharali Village Cloudburst News:A cloudburst near Gangotri Dham unleashed a torrent of water and debris, overwhelming the region and triggering an emergency multi-agency response."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-us-arms-pakistan-1971-trump-russian-oil-tariff-threats-2766510-2025-08-05",
      "headline": "With 1971 war ammo, Indian Army fires back at US over Russian oil hypocrisyThe Indian Army highlighted historic US arms supplies to Pakistan during the 1971 war amid tensions over Trump's warning on Indian imports of Russian oil. This move underscores growing diplomatic friction as India pushes back against perceived double standards in US trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/latest-auto-news/story/ethanol-blended-fuel-for-your-vehicle-pros-and-cons-good-bad-ugly-2766453-2025-08-05",
      "headline": "No side effects of E20 fuel, government suggests. How true is that?As India adopts E20 blended fuel, it promises cleaner air and economic gains, but for older vehicles, the shift could mean performance dips, higher maintenance, and increased long-term running costs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariff-india-us-trade-deal-new-delhi-mea-response-europe-eu-russian-crude-oil-import-2766461-2025-08-05",
      "headline": "India looks Trump in the eye, says take a walkIn its strongest reaction yet, India has told the US it will hold its right to an independent foreign policy and put national interest first. It has countered the US and the EU with facts on their Russia trade, and questioned the morality of penalising India on the Russia-Ukraine war. In short, New Delhi has asked Trump to take a walk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-one-year-sheikh-hasina-regime-august-5-student-protests-army-role-urban-guerilla-tactics-2766569-2025-08-05",
      "headline": "Fall of Sheikh Hasina: An uprising, urban guerilla tactic or army inaction?August 5 marks one year when Bangladesh PM Sheikh Hasina was forced to flee amid a movement against her authoritarian regime. But was it just a students' agitation that brought her powerful government down, or was it urban guerilla tactics of attacking security personnel or the army's hands-off approach? Decoding what became the ultimate nemesis for Hasina."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-cloudburst-uttarkashi-flash-floods-missing-dead-damage-rescue-2766598-2025-08-05",
      "headline": "Live: Buildings, village swept away as flash flood wipes out Dharali, rescue ops underwayA powerful cloudburst triggered a devastating landslide in Dharali village of Uttarakhand's Uttarkashi on Tuesday afternoon, killing at least 4. Over 50 people remain missing as the disaster unleashed a surge of water and debris across the area, prompting a large-scale emergency response involving multiple agencies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/former-jk-governor-satyapal-malik-dies-at-79-after-prolonged-illness-2766508-2025-08-05",
      "headline": "Former J&K Governor Satyapal Malik dies at 79 after prolonged illnessFormer Jammu and Kashmir Governor Satyapal Malik, whose tenure saw the abrogation of Article 370 during his tenure, died at the age of 79 on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-india-tariff-threat-russian-oil-imports-real-reason-explained-2766445-2025-08-05",
      "headline": "Why is Trump threatening India over Russian oil? Here's the real reasonIs Donald Trump really upset about India buying Russian oil, or is this just a calculated move to boost US energy exports, appease oil lobbyists, and reshape global trade flows?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/uttarkashi-cloudburst-why-uttarakhand-is-so-vulnerable-to-such-catastrophes-2766590-2025-08-05",
      "headline": "Uttarkashi cloudburst: Why Uttarakhand is so vulnerable to such catastrophesApart from the geography of the region, human-induced factors have led to the increased cloudbursts in recent years. Rising global temperatures have further put the region under stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modis-swadeshi-call-gives-indias-economic-nationalism-a-new-voice-2765880-2025-08-04",
      "headline": "How Modi's 'swadeshi' call gives India's economic nationalism a new voiceThe Varanasi pitch looks timed to Donald Trump's new tariff threat. Yet, to become policy, Modi's 'swadeshi' must avoid the trappings of India's 'conservative' industrialism"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/surveen-chawla-emerges-surprise-hero-of-mandala-murders-vaani-kapoor-vaibhav-gupta-2766465-2025-08-05",
      "headline": "Surveen Chawla emerges as the surprise hero of Mandala MurdersIn Mandala Murders, while the plot mainly revolves around Vaani Kapoor and Vaibhav Raj Gupta's characters, it's Surveen Chawla who quietly steals the show. Surveen delivers a powerful performance that grows stronger with each episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/embassy-of-the-republic-of-khalistan-surrey-gurdwara-hardeep-singh-nijjar-support-india-canada-diplomatic-thaw-2766575-2025-08-05",
      "headline": "Khalistan 'embassy' at Nijjar's old stomping ground threatens India-Canada resetAn 'Embassy of the Republic of Khalistan' has been established in Surrey, Canada. Located on the premises of Guru Nanak Sikh Gurdwara, it openly supports Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-50-years-film-that-died-at-birth-to-live-forever-gabbar-singh-jai-veeru-amitabh-bachchan-dharmendra-283-05-08-2025",
      "headline": "Sholay@50: The film that died at birth to live foreverOn August 15, 1975, Sholay lit up Indian theatres, igniting a cultural fire that burns bright even today. To celebrate its golden jubilee, we revisit the legacy of the masterpiece, exploring the stories, struggles, and serendipity behind its creation. In part one, we revisit the chaos around its release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/uttarkashi-cloudburst-how-clouds-dump-over-a-billion-litres-of-rain-in-a-minute-2766576-2025-08-05",
      "headline": "Uttarkashi: How clouds burst with a billion litres of rain in a minuteThe cloudburst took place in the catchment area of the Kheer Ganga river, leading to the devastating floods, locals said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trump-tariffs-penalty-threat-russian-oil-purchase-pakistan-ceasefire-op-sindoor-strong-response-hypocrisy-2766403-2025-08-05",
      "headline": "Enough: India hits back at US after Russian oil threats, truce liesIf Donald Trump expected India to roll over, the message from South Block is loud and clear: India decides its interests, not Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/private-school-fee-hikes-india-salary-growth-parent-protests-2766488-2025-08-05",
      "headline": "When paying for class 3 feels like MBA tuitionPrivate school fees in Indian metros are rising sharply, far exceeding salary increases. This trend is causing financial stress for parents and sparking protests amid weak regulatory enforcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/what-is-ethanol-blended-petrol-and-should-you-be-worried-about-it-2766452-2025-08-05",
      "headline": "What is ethanol-blended petrol and should you be worried about it?The government is targeting 30% ethanol blending with petrol by 2030 to further reduce dependence on imported oil, while addressing environmental concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-police-deny-inaction-after-crpf-officer-weeps-over-wedding-jewellery-money-silk-sarees-theft-2766427-2025-08-05",
      "headline": "House robbed, cops refuse to act: Woman CRPF officer cries inconsolably on cameraA CRPF woman officer accused Tamil Nadu police of inaction in a wedding jewellery theft case. Police denied the allegation, saying an FIR was filed and investigation is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-red-ball-coach-record-2766351-2025-08-05",
      "headline": "Spirited India level England series, but Gambhir's Test reign must end nowIndia's Oval win was a testament to their grit and tenacity — but it came in spite of their head coach, not because of him. Individual brilliance papered over deep tactical flaws and inconsistent selections throughout the series. With just 3 wins in their last 13 Tests, Gautam Gambhir's tenure as Test coach should end sooner rather than later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/some-hate-chai-seeds-so-what-should-you-eat-instead-2766592-2025-08-05",
      "headline": "Why some people hate chia seeds and what to eat insteadFor some people, the gooey gelatinous texture of soaked chia seeds is such a let-down that they dare add it to their smoothies or acai bowl. For them, there are superb alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vivek-ramaswamy-hosts-cincinnati-townhall-public-safety-crime-cincinnati-beating-sarah-heringer-justice-system-holly-2766493-2025-08-05",
      "headline": "In Mamdani battle, Vivek Ramaswamy invites crime-hit to Ohio townhallRepublican gubernatorial candidate Vivek Ramaswamy held a townhall in Cincinnati to address rising public safety concerns. The event followed a Times Square billboard urging New Yorkers to escape Zohran Mamdani's \"socialist tyranny\" and relocate to Ohio. The campaign drew mixed reactions, with supporters backing his tough-on-crime stance and protesters accusing him of politicising a complex issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/most-erroneous-order-top-court-on-allahabad-high-court-allowing-civil-offence-to-be-treated-as-criminal-case-2766548-2025-08-05",
      "headline": "Most erroneous order: Top court slams High Court for criminalising civil disputeThe Supreme Court came down heavily on the Allahabad High Court for allowing a civil dispute to be treated as a criminal case, merely on the ground that civil recovery could take time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disruption-our-democratic-right-mallikarjun-kharge-vs-rajya-sabha-chair-over-cisf-personnel-in-house-claim-2766436-2025-08-05",
      "headline": "Who's running the House? You or Amit Shah? Mallikarjun Kharge's barb at Chairman Live UpdatesMallikarjun Kharge questioned whether the Rajya Sabha was being run by Deputy Chairman Harivansh or Amit Shah, triggering uproar from the treasury benches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-loving-post-for-kajol-on-51st-birthday-comes-with-an-eye-roll-warning-2766482-2025-08-05",
      "headline": "Ajay Devgn's loving post for Kajol on 51st birthday comes with an eye-roll warningOn the occasion of Kajol's birthday, actor Ajay Devgn shared a cheeky post on Instagram. He called Kajol 'his favourite' while extending birthday wishes. Kajol turned 51 on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-medha-rana-visit-golden-temple-wrap-border-2-shoot-diljit-dosanjh-ahan-shetty-2766601-2025-08-05",
      "headline": "Varun Dhawan, Medha Rana visit Golden Temple as they wrap Border 2 shoot. See picActors Varun Dhawan and his co-star Medha Rana visited the Golden Temple after they wrapped the shoot of their upcoming film 'Border 2'. The film also stars Ahan Shetty and Diljit Dosanjh in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-ravie-dubey-and-the-emergence-of-new-hero-in-bollywood-2766594-2025-08-05",
      "headline": "Ahaan Panday, Ravie Dubey and the emergence of new hero in BollywoodFor the longest time, Bollywood's leading men arrived with drumrolls. They were groomed, positioned, and presented to an audience trained to applaud before the performance even began. But something seems to be shifting. In actors like Ahaan Panday and Ravie Dubey, we hope to see a new beginning that probably doesn't depend on legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hema-malini-says-difficult-to-make-another-sholay-as-film-nears-50th-anniversary-2766543-2025-08-05",
      "headline": "Difficult to make another Sholay as film nears 50th anniversary, says Hema MaliniActor-politician Hema Malini dismissed the possibility of a remake of 'Sholay'. Malini also expressed that she didn't know the film would be such a hit."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/beyond-the-big-cities-punjab-fc-is-building-indias-next-football-stars-2766606-2025-08-05",
      "headline": "Beyond the big cities: Punjab FC is building India's next football starsWhile most professional sports clubs in India focus on the top tiers, Punjab FC is quietly rewriting the script—starting at the grassroots with 16 centres across Punjab's heartland and a fully integrated residential academy system, the club is nurturing a new generation of footballers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-tim-david-fined-umpire-dissent-2766599-2025-08-05",
      "headline": "Blot on AUS whitewash of WI: Tim David fined for umpire dissentAustralia's whitewash of the West Indies was nearly spotless, but Tim David's moment of frustration in the final T20I saw him penalised for umpire dissent, slightly marred an otherwise flawless series win.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-sourav-ganguly-day-4-miracle-2766585-2025-08-05",
      "headline": "Sourav Ganguly on Oval Test: After Day 4, had confidence India will winFormer India captain Sourav Ganguly suggested that he knew India were going to win the Oval Test after Day 4. His thoughts came to reality as Siraj led a miraculous comeback to level the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-coach-rafael-nadal-season-2766582-2025-08-05",
      "headline": "Emma Raducanu hires Rafael Nadal's former coach until 2025 season endWorld No.33 and 2021 US Open champion Emma Raducanu hired Rafael Nadal's former coach, Francisco Roig, in her coaching staff after parting ways with Mark Petchey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-kl-rahul-batting-virat-kohli-rohit-sharma-2766555-2025-08-05",
      "headline": "KL Rahul steps up big: Senior batter shines in Kohli and Rohit's absenceIndia vs England: KL Rahul was praised for his calm and smart batting in tough English conditions. With senior players retired, he stepped up as a leader, scoring important runs and guiding a young team as India fought hard to draw the five-match series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-r-ashwin-on-mohammed-siraj-oval-test-performance-2766550-2025-08-05",
      "headline": "We failed to recognise Siraj, he should be rested for inconsequential games: AshwinFormer India all-rounder Ravichandran Ashwin has urged the team management to manage Mohammed Siraj's workload and rest him for inconsequential games going forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-nca-return-training-sports-hernia-surgery-2766524-2025-08-05",
      "headline": "Suryakumar Yadav back at NCA for first nets session after sports hernia surgerySuryakumar Yadav has resumed training at the NCA following his sports hernia surgery, eyeing a return ahead of the Asia Cup 2025. The star batter's recovery is being closely managed in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-presence-panic-michael-vaughan-oval-test-2766487-2025-08-05",
      "headline": "If Ben Stokes was there, England would have won Oval Test: VaughanMichael Vaughan felt England's Oval Test defeat could've been avoided had Ben Stokes played, pointing out how the team panicked on Day 5 without his calming influence and leadership during their failed run-chase against India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-series-major-stats-shubman-gill-mohammed-siraj-2766466-2025-08-05",
      "headline": "Statpack: India's resilient performance on England tour told through numbersIndia drew the five-match series against England 2-2 after a thrilling six-run victory at the Oval. Here's a look at major stats from Shubman Gill's men's phenomenal show on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-captaincy-ajay-jadeja-2766462-2025-08-05",
      "headline": "Defensive but consistent: Shubman Gill's captaincy analysed by Ajay JadejaENG vs IND: Former Indian cricketer Ajay Jadeja feels that Shubman Gill has a defensive approach as a skipper but is open to making changes when required. Jadeja advised Gill to find a style and stick with it after drawing the series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-dance-oval-test-win-watch-video-2766442-2025-08-05",
      "headline": "Watch: Sunil Gavaksar hits special dance after India's trilling Oval Test winSunil Gavaskar celebrated India's dramatic Oval Test win in style, dancing and singing \"Meri Desh Ki Dharti\" alongside Cheteshwar Pujara and others, after India pulled off a thrilling six-run victory to level the series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-nca-return-training-sports-hernia-surgery-2766524-2025-08-05",
      "headline": "Suryakumar Yadav back at NCA for first nets session after sports hernia surgerySuryakumar Yadav has resumed training at the NCA following his sports hernia surgery, eyeing a return ahead of the Asia Cup 2025. The star batter's recovery is being closely managed in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-presence-panic-michael-vaughan-oval-test-2766487-2025-08-05",
      "headline": "If Ben Stokes was there, England would have won Oval Test: VaughanMichael Vaughan felt England's Oval Test defeat could've been avoided had Ben Stokes played, pointing out how the team panicked on Day 5 without his calming influence and leadership during their failed run-chase against India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-series-major-stats-shubman-gill-mohammed-siraj-2766466-2025-08-05",
      "headline": "Statpack: India's resilient performance on England tour told through numbersIndia drew the five-match series against England 2-2 after a thrilling six-run victory at the Oval. Here's a look at major stats from Shubman Gill's men's phenomenal show on English soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-shubman-gill-captaincy-ajay-jadeja-2766462-2025-08-05",
      "headline": "Defensive but consistent: Shubman Gill's captaincy analysed by Ajay JadejaENG vs IND: Former Indian cricketer Ajay Jadeja feels that Shubman Gill has a defensive approach as a skipper but is open to making changes when required. Jadeja advised Gill to find a style and stick with it after drawing the series against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-dance-oval-test-win-watch-video-2766442-2025-08-05",
      "headline": "Watch: Sunil Gavaksar hits special dance after India's trilling Oval Test winSunil Gavaskar celebrated India's dramatic Oval Test win in style, dancing and singing \"Meri Desh Ki Dharti\" alongside Cheteshwar Pujara and others, after India pulled off a thrilling six-run victory to level the series 2-2."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}