{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-ipo-listing-preview-latest-gmp-allotment-status-blackbuck-ipo-shares-listing-date-2636500-2024-11-20",
      "headline": "Zinka Logistics IPO listing preview: What to expect? Check latest GMPZinka Logistics IPO listing: Shares of Zinka Logistics are set to debut on Dalal Street on November 21, 2024, after having seen an overall subscription of 1.86 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-share-price-dips-30-percent-from-52-week-high-3-reasons-why-investors-should-not-worry-2636475-2024-11-20",
      "headline": "Suzlon shares dip 30% from 52-week high: 3 reasons why investors shouldn't worrySuzlon stock price: Suzlon stocks hit the upper circuit on Tuesday. Despite this uptick, the stock is still nearly 30% below its 52-week high of Rs 86.04. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-may-impose-40-percent-tariffs-on-china-in-early-2025-2636473-2024-11-20",
      "headline": "Donald Trump may impose 40% tariffs on China in early 2025: ReportDonald Trump, who is due to take office in January, pledged during campaigning to slap hefty tariffs on Chinese imports as part of a package of \"America First\" trade measures,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-price-high-usd94000-crypto-news-bitcoin-news-trump-rally-2636407-2024-11-20",
      "headline": "Bitcoin hits record high of $94,000. 3 things you should knowBitcoin hits $94,000, as Trump's victory and market moves boost investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-stock-market-no-listing-day-gains-hyundai-swiggy-any-more-3-things-to-know-2636404-2024-11-20",
      "headline": "Reality check: Why IPO listings are not making you rich any moreIn 2024, IPOs doubled wealth for many, but tides have shifted. Should you worry?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/24-carat-gold-price-today-in-metro-cities-delhi-mumbai-chennai-kolkata-global-rise-outlook-2636335-2024-11-20",
      "headline": "Gold price today: Check price of 24 carat gold in metro cities?Gold Price Today: The increase comes as the global gold market reacts to a weaker US dollar and rising geopolitical tensions, particularly between Russia and Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-breaches-usd-94000-for-first-time-record-all-time-high-etf-options-2636268-2024-11-20",
      "headline": "Bitcoin hits record high, breaches $94,000 markBitcoin rallied to a fresh all-time high of $94,000, driven by the debut of the first Bitcoin ETF options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-latest-gmp-3-risks-to-consider-is-it-worth-subscribing-review-analyst-view-2636247-2024-11-20",
      "headline": "NTPC Green Energy IPO GMP dips: Is it worth subscribing? 3 risks to considerNTPC Green Energy IPO: The price band has been set between Rs 102 and Rs 108 per share, with a minimum application size of 138 shares, amounting to Rs 14,904 for retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-goldman-sach-bullish-yellow-metal-why-is-it-set-to-outshine-in-2025-analyst-view-2636222-2024-11-20",
      "headline": "Goldman's bullish call: Why gold is set to outshine by 2025Goldman Sachs analysts are bullish on the prices and have set a target of $3,000 per ounce for gold by December 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-maharashtra-elections-bse-nse-closed-on-november-20-check-details-2636210-2024-11-20",
      "headline": " Is the stock market closed today for Maharashtra elections? Share Market Closed Today, NSE, BSE Holiday: The most recent holiday was on November 15 for Guru Nanak Jayanti. The next holiday is scheduled for December 25, Christmas Day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-day-1-check-latest-subscription-gmp-subscribe-skip-review-2635963-2024-11-19",
      "headline": "NTPC Green Energy IPO Day 1: Check latest subscription, GMPThe initial public offering (IPO) of NTPC Green Energy Limited opened for bidding on Tuesday looking to raise Rs 10,000 crore through a fresh issue entirely of 92.59 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-3-reasons-why-sensex-nifty-failed-to-sustain-stock-market-relief-rally-2635939-2024-11-19",
      "headline": "Explained: 3 reasons why Sensex, Nifty failed to sustain relief rallyThe benchmark indices, Sensex and Nifty, surged over 1% in early trade, with the Sensex climbing more than 1,000 points intraday. However, by the end of the session, most of these gains were erased."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-warns-public-about-deepfake-videos-of-top-officials-giving-financial-advice-2635922-2024-11-19",
      "headline": "RBI warns public about deepfake videos of top officials giving financial adviceIn a press release, the central bank clarified that these videos are fake and warned people not to engage with or believe in them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-but-bears-still-hold-control-ril-shares-down-2-percent-2635883-2024-11-19",
      "headline": "Sensex and Nifty bounce back but bears still hold control; RIL down 2%The S&P BSE Sensex added 239.37 points to close at 77,578.38, while the NSE Nifty50 was up 64.70 points to end at 23,518.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-crypto-replace-gold-which-is-better-to-buy-expert-comment-bitcoin-prices-2635826-2024-11-19",
      "headline": "Can cryptocurrency be the next gold? With strong support and remarkable returns, Bitcoin is now increasingly seen as a potential alternative to gold, despite its volatility and regulatory challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rebound-dalal-street-whats-next-2635848-2024-11-19",
      "headline": "Sensex, Nifty rebound: Will the relief rally on D-Street continue or fizzle out?Stock market today: While the market did show some signs of recovery today, the sharp decline in the final hours has left retail investors in an uncertain situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-surges-over-1000-points-all-you-need-to-know-in-5-points-2635828-2024-11-19",
      "headline": "Sensex surges 1,000 points. All you need to know in 5 pointsThe rally saw the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) jump by Rs 6.06 lakh crore to Rs 435.14 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-subscription-review-3-reasons-why-you-should-subscribe-latest-gmp-2635800-2024-11-19",
      "headline": "NTPC Green Energy IPO: 3 reasons why you should subscribeNTPC Green Energy IPO: The subscription for NTPC Green Energy IPO will close on November 22, 2024 and the price band is set between Rs 102 and Rs 108 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/honasa-consumer-mamaearth-share-price-today-30-percent-drop-two-sessions-what-next-for-stock-2635777-2024-11-19",
      "headline": "Honasa Consumer share price tumbles over 30% in two trading sessions. What next?Honasa Consumer share price: The sharp sell-off was triggered by a disappointing set of September quarter results and concerns over the company's near-term growth outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-jumps-morgan-stanley-upgrade-good-opportunity-to-buy-2635752-2024-11-19",
      "headline": "Explained: Why Suzlon Energy share price hit 5% upper circuit today Suzlon Energy share price: The jump in its share price came after brokerage Morgan Stanley upgraded the stock to 'Overweight' from 'Equal-weight.'"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-on-canada-media-report-claiming-pm-narendra-modi-knew-of-khalistani-terrorist-nijjar-killing-ludicrous-2636863-2024-11-20",
      "headline": "'Smear campaign': India on Canada media report claiming PM knew of Nijjar killingThe Ministry of External Affairs clamped down on the allegations levelled by the newspaper, calling such media reports \"ludicrous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-sena-ncp-alliance-to-retain-maharashtra-nda-to-wrest-jharkhand-predict-two-exit-polls-2636670-2024-11-20",
      "headline": "BJP-Sena-NCP to retain Maharashtra, edge for NDA in Jharkhand: Exit pollsExit polls predicted a win for the BJP-Sena-NCP alliance in Maharashtra, while the BJP-led NDA is likely to be in a neck-and-neck fight with the JMM-Congress alliance in Jharkhand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/board-exams-classes-10-12-february-15-cbse-full-schedule-2636807-2024-11-20",
      "headline": "CBSE Class 10, Class 12 board exam datesheets out, exams from February 15The CBSE has released the 2025 datesheet for Class 10 and 12 board exams on cbse.gov.in. Exams start on February 15, with Class 10 ending on March 18 and Class 12 on April 4, 2025.\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/supriya-sule-nana-patole-viral-audios-bitcoin-bjp-ai-detection-tools-deepfake-2636620-2024-11-20",
      "headline": "Supriya Sule, Nana Patole Bitcoin audios: What AI detection tools tell usDeepfakes expert and UC Berkeley professor Hany Farid analysed the audio clips and concluded at least three of them were AI-generated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/zomato-ceo-hiring-chief-of-staff-says-first-year-no-salary-and-employee-will-have-to-pay-rs-20-lakh-2636654-2024-11-20",
      "headline": "Zomato CEO hiring Chief of Staff, wants employee to pay Rs 20 lakh in first yearZomato CEO Deepinder Goyal has announced a job opening for a Chief of Staff position. The role comes with a striking condition: no salary in the first year, and a requirement for the selected candidate to pay Rs 20 lakh as a fee. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-fires-uk-made-storm-shadow-missile-into-russia-day-after-us-army-tactical-missile-systems-report-2636838-2024-11-20",
      "headline": "Ukraine fires UK-made 'Storm Shadow' into Russia day after US missile: ReportThe alleged use of the long-range cruise missiles came in response to Russia's recent deployment of North Korean troops to bolster its war effort"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jhansi-hospital-fire-infants-death-toll-rises-2636844-2024-11-20",
      "headline": "Jhansi hospital fire: Three rescued infants die of illness, says doctor10 of the 15 newborns had died on the day a massive fire broke out at the hospital, while five have died during treatment since Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-ms-dhoni-matthew-hayden-australia-vs-india-2636342-2024-11-20",
      "headline": "Dhoni once touted Bumrah as a potential captain: Matthew Hayden AUS vs IND: Responding to a query from IndiaToday.in during a virtual media interaction, former Australian batter Matthew Hayden heaped praise on Jasprit Bumrah before the Perth Test and said that MS Dhoni once identified his skills as a potential captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-old-video-son-barron-trump-saying-i-want-all-as-no-drugs-surfaces-2636796-2024-11-20",
      "headline": "'All A's, no drugs when you get older': Trump's old clip with son Barron is viralThe clip, which The Daily Mail reported was from Larry King's talk show on CNN, is from 2010, when Trump was better known as 'The Donald' from the hit series 'The Apprentice'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-air-pollution-aqi-survey-families-in-ncr-heath-issues-pollution-stubble-burning-2636804-2024-11-20",
      "headline": "3 in 4 Delhi-NCR families facing pollution-related health problems: SurveyA recent survey has revealed that 75% of families in Delhi-NCR are grappling with illnesses such as persistent cough and asthma, directly linked to toxic air pollution levels. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/story/up-bypolls-akhilesh-yadav-video-mirapur-police-threatening-voters-revolver-byelection-2636572-2024-11-20",
      "headline": "Did UP cop threaten voters? Akhilesh Yadav shares video, police deny chargeThe purported video, shared by Akhilesh Yadav, shows a cop intimidating female voters with a revolver and asking them to return to their homes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/maharashtra-assembly-exit-poll-jharkhand-vidhan-sabha-who-will-win-election-accuracy-2636658-2024-11-20",
      "headline": "Time to get over the addiction, exit the exit pollsAs voting ends for Maharashtra and Jharkhand Assembly elections, it would traditionally be the time for exit polls. But what is this urge for instant gratification? Let's savour the moment, it's the best time to exit the exit polls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/manipurs-endless-unrest-a-tragedy-of-mistrust-mayhem-and-missed-leadership-2636531-2024-11-20",
      "headline": "Manipur's endless unrest: A tragedy of mistrust, mayhem and missed leadershipThe fragile peace stands shattered with Jiribam, untouched so far, swept by deadly violence. The Meitei-Kuki strife has deepened, exposing governance failure and a spiralling humanitarian crisis"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/up-shooter-delhi-court-surrenders-burqa-businessman-house-shooting-encounter-shooting-2636802-2024-11-20",
      "headline": "Fearing 'police encounter', shooter walks into Delhi court wearing burqaSohail Khan, an Uttar Pradesh-based shooter, was arrested for firing at a businessman's house in northwest Delhi's Rani Bagh on October 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zomato-ceo-deepinder-goyal-trolled-no-salary-pay-rs-20-lakh-fee-job-offer-viral-post-2636811-2024-11-20",
      "headline": "Zomato CEO Deepinder Goyal trolled for 'no salary, pay Rs 20 lakh fee' job offerZomato CEO Deepinder Goyal was trolled after he announced a job offer for the Chief of Staff position at his company on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/ar-rahman-wife-saira-banu-separation-what-is-gray-divorce-2636562-2024-11-20",
      "headline": "AR Rahman-Saira Banu end 29 years of marriage: What is gray divorce?A look at the growing trend of gray divorce as musician AR Rahman and his wife Saira Banu announce their separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-india-air-pollution-smog-how-beijing-china-won-pollution-battle-won-aqi-today-2636314-2024-11-20",
      "headline": "How China won pollution battle as India allows Delhiites to choke to deathDelhi AQI: As India allows toxic air to choke Delhiites without even discussing what it would take to save its capital, Beijing in 2013 launched an all-out war with a $100-billion mission to clean its air. Beijing is no longer among the world's Top 10 polluted cities, while Delhi continues to gasp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/murshidabad-violence-bengal-mamata-banerjee-kim-jong-un-regime-giriraj-singh-bjp-2636825-2024-11-20",
      "headline": "Bengal running like Kim Jong Un regime: Union minister slams Mamata BanerjeeUnion Minister Giriraj Singh likened Mamata Banerjee's governance to Kim Jong Un regime in North Korea, citing violence in Murshidabad, law-and-order concerns and the alleged Rohingya influx. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-india-china-rajnath-singh-meeting-dong-jun-asean-2636622-2024-11-20",
      "headline": "Rajnath Singh meets Chinese counterpart, calls for 'cooperation over conflict'Indian and Chinese militaries completed the disengagement exercise in Demchok and Depsang late last month after the two sides reached an agreement following a series of negotiations to resolve the festering border row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vampire-diaries-actor-michael-malarkey-boycotts-starbucks-coffee-event-gaza-israel-palestine-2636846-2024-11-20",
      "headline": "Vampire Diaries actor Michael Malarkey refuses Starbucks coffee, calls for boycottThe Vampire Diaries actor Michael Malarkey refused to drink Starbucks coffee at an event and joined the clarion call to boycott the brand. A video of the actor from the event, urging fans to join the protest, has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-test-series-recap-2636011-2024-11-20",
      "headline": "Recapping India's history in Australia in Border Gavaskar TrophyAUS vs IND: India are all set to face Australia in a five-match Test series, starting November 22. India have won two out of seven Test series in the Border-Gavaskar Trophy on Australian soil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/world-bank-president-ajay-banga-time-magazine-cover-climate-list-2636795-2024-11-20",
      "headline": "Why TIME put Ajay Banga on its cover this monthWorld Bank President Ajay Banga, along with other leaders, Time magazine's list of the 100 most influential leaders shaping business-driven climate action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cbi-begins-probe-into-rs-6600-crore-maharashtra-bitcoin-scam-2636710-2024-11-20",
      "headline": "CBI begins probe into Rs 6,600-crore Maharashtra 'bitcoin scam', case against 2Amit Bharadwaj and Ajay Bharadwaj - the masterminds in the 'bitcoin scam', have been named in the CBI FIR. While Amit died of a heart attack earlier, Ajay is a fugitive who is on the lookout by multiple agencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vampire-diaries-actor-michael-malarkey-boycotts-starbucks-coffee-event-gaza-israel-palestine-2636846-2024-11-20",
      "headline": "Vampire Diaries actor Michael Malarkey refuses Starbucks coffee, calls for boycottThe Vampire Diaries actor Michael Malarkey refused to drink Starbucks coffee at an event and joined the clarion call to boycott the brand. A video of the actor from the event, urging fans to join the protest, has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bachchan-birthday-post-aaradhya-celebrations-abhishek-bachchan-2636830-2024-11-20",
      "headline": "Aishwarya Rai Bachchan's late birthday post for her 'eternal love' AaradhyaActor Aishwarya Rai Bachchan shared a late birthday post for her daughter Aaradhya on social media. Aishwarya and Abhishek Bachchan's daughter turned 13 on November 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/korean-actor-song-joong-ki-wife-katie-louise-welcome-second-child-2636808-2024-11-20",
      "headline": "Korean actor Song Joong-ki, wife Katie Louise welcome second childVincenzo actor Song Joong-ki and wife Katie Louise Saunders welcomed their second child, a baby girl, in Rome. The actor shared the joyful news through a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/photo/liam-payne-funeral-harry-styles-zayn-malik-one-direction-members-reunite-bid-adieu-2636763-2024-11-20",
      "headline": "Liam Payne laid to rest: Former One Direction members pay tributeBritish singer Liam Payne's funeral took place in England on November 20. Liam died after he reportedly fell from a hotel balcony in the Palermo district of Buenos Aires."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-virat-kohli-start-from-zero-matthew-hayden-border-gavaskar-trophy-2636849-2024-11-20",
      "headline": "Kohli will start from zero against Australia: Hayden dismisses form concernsMatthew Hayden believes Virat Kohli's stellar record in Australia will see him rise above recent struggles to deliver crucial performances in the Border-Gavaskar Trophy, especially with added pressure from Rohit Sharma's absence in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-davis-cup-finals-germany-vs-canada-quarterfinal-2636842-2024-11-20",
      "headline": "Daniel Altmaier, Jan-Lennard Struff power Germany to semi-final Davis Cup Finals 2024: Daniel Altmaier and Jan-Lennard Struff took Germany through to the semis where they will lock horns with the Netherlands, who earlier took down Spain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kolkatas-eden-gardens-to-have-a-stand-named-after-legendary-jhulan-goswami-2636810-2024-11-20",
      "headline": "Kolkata's Eden Gardens to have a stand named after legendary Jhulan GoswamiThe Cricket Association of Bengal decided to rename Block B of the Eden Gardens in Kolkata in honour of legendary fast bowler Jhulan Goswami. The inauguration of the stand will take place next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-gautam-gambhir-aggression-michael-clarke-defends-no-friends-on-the-field-2636809-2024-11-20",
      "headline": "Clarke defends Gautam Gambhir's aggression: No friends on the fieldMichael Clarke backed Gautam Gambhir's aggressive approach to the Border-Gavaskar Trophy, emphasising its role in India's recent successes and the need for players to prioritise national pride over IPL-fuelled friendships during high-stakes international clashes against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-psl-pcb-team-owners-player-availability-ipl-2636800-2024-11-20",
      "headline": "PSL team owners write to PCB over foreign players' availability in clash with IPLThe PSL team owners have asked the Pakistan Cricket Board (PCB) to give clarity on the availability of foreign players in the upcoming tournament. PSL is normally held in February-March, but next year's edition has been pushed to April-May "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/13-badminton-players-representing-rajasthan-accused-of-age-fraud-2636793-2024-11-20",
      "headline": "13 badminton players representing Rajasthan accused of age fraud13 out of 20 badminton players were allegedly found overage after they qualified to play for Rajasthan at the national level in Under-13 and Under-11 tournaments in November and December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-jasprit-bumrah-matthew-hayden-australia-vs-india-test-series-2636726-2024-11-20",
      "headline": "Jasprit Bumrah is intelligent and organised with good leadership instincts: Matthew HaydenAUS vs IND: Former Australian batter heaped praise on Indian fast bowler Jasprit Bumrah for having a matured head on his shoulders. Bumrah will lead India in Rohit Sharma's absence in the opening Test of the five-match series against the Aussies at the Perth Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-manchester-city-contract-extension-one-more-year-reports-premier-league-2636725-2024-11-20",
      "headline": "Guardiola to extend Manchester City contract for one more season: ReportsPep Guardiola will extend his Manchester City tenure until 2026, ending speculation about his future. Despite recent setbacks, the Spanish manager aims to lead City back to glory, solidifying his legacy as one of football's greatest tacticians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-womens-asian-champions-trophy-china-deepika-joint-highest-winner-bihar-2636635-2024-11-20",
      "headline": "India clinch third Women's Asian Champions Trophy after 1-0 win over ChinaIndia Women's Hockey Team claimed their third Asian Champions Trophy title with a hard-fought 1-0 victory over China in Bihar, as Deepika's decisive third-quarter strike sealed the win in a thrilling and closely contested final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-test-series-recap-2636011-2024-11-20",
      "headline": "Recapping India's history in Australia in Border Gavaskar TrophyAUS vs IND: India are all set to face Australia in a five-match Test series, starting November 22. India have won two out of seven Test series in the Border-Gavaskar Trophy on Australian soil. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-jasprit-bumrah-virat-kohli-kl-rahul-perth-test-morne-morkel-2636590-2024-11-20",
      "headline": "Bumrah will get help from Virat Kohli, KL Rahul in Perth Test: Morne MorkelAUS vs IND, 1st Test: Bowling coach Morne Morkel said that Jasprit Bumrah will get inputs from KL Rahul and Virat Kohli when he leads in the opening Test against Australia, starting November 22 at the Perth Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-jasprit-bumrah-matthew-hayden-australia-vs-india-test-series-2636726-2024-11-20",
      "headline": "Jasprit Bumrah is intelligent and organised with good leadership instincts: Matthew HaydenAUS vs IND: Former Australian batter heaped praise on Indian fast bowler Jasprit Bumrah for having a matured head on his shoulders. Bumrah will lead India in Rohit Sharma's absence in the opening Test of the five-match series against the Aussies at the Perth Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-manchester-city-contract-extension-one-more-year-reports-premier-league-2636725-2024-11-20",
      "headline": "Guardiola to extend Manchester City contract for one more season: ReportsPep Guardiola will extend his Manchester City tenure until 2026, ending speculation about his future. Despite recent setbacks, the Spanish manager aims to lead City back to glory, solidifying his legacy as one of football's greatest tacticians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-womens-asian-champions-trophy-china-deepika-joint-highest-winner-bihar-2636635-2024-11-20",
      "headline": "India clinch third Women's Asian Champions Trophy after 1-0 win over ChinaIndia Women's Hockey Team claimed their third Asian Champions Trophy title with a hard-fought 1-0 victory over China in Bihar, as Deepika's decisive third-quarter strike sealed the win in a thrilling and closely contested final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-test-series-recap-2636011-2024-11-20",
      "headline": "Recapping India's history in Australia in Border Gavaskar TrophyAUS vs IND: India are all set to face Australia in a five-match Test series, starting November 22. India have won two out of seven Test series in the Border-Gavaskar Trophy on Australian soil. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-jasprit-bumrah-virat-kohli-kl-rahul-perth-test-morne-morkel-2636590-2024-11-20",
      "headline": "Bumrah will get help from Virat Kohli, KL Rahul in Perth Test: Morne MorkelAUS vs IND, 1st Test: Bowling coach Morne Morkel said that Jasprit Bumrah will get inputs from KL Rahul and Virat Kohli when he leads in the opening Test against Australia, starting November 22 at the Perth Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-yash-dayal-india-squad-reverses-khaleel-ahmed-2636578-2024-11-20",
      "headline": "Yash Dayal replaces injured Khaleel Ahmed in India squad reservesBorder-Gavaskar Trophy: Yash Dayal, who was in South Africa with the T20I squad earlier this year, flew directly to Perth to join the Indian team. He replaced Khaleel Ahmed, who suffered an injury concern. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-parts-of-perths-wicket-can-be-terrifying-travis-head-warns-ahead-of-1st-test-2636576-2024-11-20",
      "headline": "Parts of Perth's wicket can be terrifying: Travis Head warns ahead of 1st TestTravis Head fired the pitch warning ahead of the Perth Test match at the Optus Stadium. He suggested that the Perth wicket could be terrifying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-morne-morkel-press-conference-2636525-2024-11-20",
      "headline": "Jasprit Bumrah is a natural leader, brings calmness into the team: MorkelAUS vs IND: Morne Morkel praised Jasprit Bumrah for his leadership skills before India's opening Test against Australia at the Perth Stadium. Back in 2022, Bumrah lost his only Test as the national Test captain. \t"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-former-australia-stars-hype-virat-kohli-ahead-of-border-gavaskar-test-series-2636516-2024-11-20",
      "headline": " How Aussie stars have hyped up India's batting star Kohli ahead of Test seriesHere is what all the former Australian cricketers have said about Virat Kohli in the lead-up to the Border Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-one-red-bull-pit-stop-vegas-hotel-valet-confused-watch-viral-video-max-verstappen-2636504-2024-11-20",
      "headline": "Watch: Red Bull F1 car pit stops at Vegas hotel, leaves valet confusedRed Bull's viral Las Vegas stunt left a valet baffled as their F1 car arrival added humour to the Grand Prix build-up. Meanwhile, Max Verstappen edged closer to securing his fourth consecutive Formula 1 World Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-billboard-eiffel-tower-nike-retirement-tribute-2636481-2024-11-20",
      "headline": "Nadal retires: Nike honours him with stunning billboard near Eiffel Tower Sportswear giant Nike paid a rich tribute to Rafael Nadal with a billboard near the Eiffel Tower, displaying the tennis great's photos and stats. Nadal played his last competitive tennis match in Malaga on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brad-hogg-picks-his-favourites-to-win-bgt-test-series-wants-ashwin-jadeja-to-play-2636451-2024-11-20",
      "headline": "Brad Hogg picks his favourites to win Test series, wants Ashwin-Jadeja to playBrad Hogg picked Australia as his favourites for the Border Gavaskar Trophy series vs India. He predicted the series result 3-2 in the favour of the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/argentina-football-team-match-kerala-ytvd-2636415-2024-11-20",
      "headline": "Argentina football team to play in Kerala next year for an international matchThe Argentina football team, including Messi, will play in Kerala next year following sponsorship agreements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-one-red-bull-pit-stop-vegas-hotel-valet-confused-watch-viral-video-max-verstappen-2636504-2024-11-20",
      "headline": "Watch: Red Bull F1 car pit stops at Vegas hotel, leaves valet confusedRed Bull's viral Las Vegas stunt left a valet baffled as their F1 car arrival added humour to the Grand Prix build-up. Meanwhile, Max Verstappen edged closer to securing his fourth consecutive Formula 1 World Championship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-rafael-nadal-billboard-eiffel-tower-nike-retirement-tribute-2636481-2024-11-20",
      "headline": "Nadal retires: Nike honours him with stunning billboard near Eiffel Tower Sportswear giant Nike paid a rich tribute to Rafael Nadal with a billboard near the Eiffel Tower, displaying the tennis great's photos and stats. Nadal played his last competitive tennis match in Malaga on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brad-hogg-picks-his-favourites-to-win-bgt-test-series-wants-ashwin-jadeja-to-play-2636451-2024-11-20",
      "headline": "Brad Hogg picks his favourites to win Test series, wants Ashwin-Jadeja to playBrad Hogg picked Australia as his favourites for the Border Gavaskar Trophy series vs India. He predicted the series result 3-2 in the favour of the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/argentina-football-team-match-kerala-ytvd-2636415-2024-11-20",
      "headline": "Argentina football team to play in Kerala next year for an international matchThe Argentina football team, including Messi, will play in Kerala next year following sponsorship agreements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-rankings-hardik-pandya-reclaims-no-1-t20i-all-rounder-spot-after-win-vs-south-africa-2636411-2024-11-20",
      "headline": "Hardik Pandya reclaims No. 1 T20I all-rounder spot after win vs South Africa Hardik Pandya has reclaimed the No. 1 spot as the top T20I all-rounder in the latest ICC Men's T20I player rankings. Tilak Varma became the highest-ranked Indian T20I batter after jumping 69 spots to the No. 3 position in the latest rankings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tilak-varma-icc-t20i-rankings-no-3-south-africa-centuries-suryakumar-2636408-2024-11-20",
      "headline": "Tilak Varma overtakes Suryakumar to  become India's highest-ranked T20I batterICC T20I Rankings: Tilak Varma became the highest-ranked Indian T20I batter after jumping 69 spots to the No. 3 position in the latest rankings. Tilak hit hundreds in back-to-back T20Is in South Africa in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-morne-morkel-nitish-reddy-hint-debut-perth-test-2636403-2024-11-20",
      "headline": "Nitish to debut in Perth Test? Morne Morkel hints at all-rounder's inclusionIndia's bowling coach, Morne Morkel, has offered the strongest indication that 21-year-old Nitish Reddy could make his Test debut in Perth. Praising the young all-rounder, Morkel expressed confidence in Reddy's ability to \"hold one end up\" for India during the upcoming five-Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mitchell-johnson-aims-to-end-feud-with-david-warner-ahead-of-aus-vs-ind-tests-2636405-2024-11-20",
      "headline": "Mitchell Johnson aims to end feud with David Warner ahead of AUS vs IND TestsMitchell Johnson aims at ending his feud with David Warner in the Border Gavaskar Trophy series. Earlier, Johnson had launched a sensational attack on David Warner and chief selector George Bailey, asking why the veteran opener was given the luxury of a farewell Test."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}