{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/these-3-banks-offer-special-fds-with-higher-interest-rates-till-september-2025-indian-bank-idbi-state-bank-of-india-sbi-2777597-2025-08-27",
      "headline": "These 3 banks offer special FDs with higher interest rates till September 2025For those planning to invest in FDs, three banks are running special schemes with better interest rates valid up to September 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-impact-gdp-us-tariff-50-percent-donald-trump-fastest-growing-economy-pm-modi-rbi-projection-2777572-2025-08-27",
      "headline": "How will Trump's 50% tariff impact India's growthThe 50% tariff by the US comes at a time when India has reported strong growth of 6.5% in 2024–25 and has been projected to remain the fastest-growing major economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-documents-ais-form-16-capital-gains-26-ad-pan-card-aadhar-tax-returns-fy25-2777547-2025-08-27",
      "headline": "Filing ITR for FY 2024-25? Keep these 6 documents handyKeeping your documents in order is the first step to a smooth filing process. Not having the documents in place not only delays the process but also increases the chance of errors in the return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-crypto-platforms-boom-in-grey-zone-says-zerodhas-nithin-kamath-2777489-2025-08-27",
      "headline": "Indian crypto platforms boom in grey zone, says Zerodha's Nithin KamathTraders are increasingly drawn to futures and options (F&O) products in digital assets, lured by high leverage and lower tax costs compared to traditional markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-50-percent-india-exporters-impact-gdp-trade-key-sectors-way-out-pm-modi-donald-trump-2777450-2025-08-27",
      "headline": "Trump's 50% tariff shock: How can exporters shield themselvesThe tariff was announced as a response to India's continued trade with Russia, and it now places Indian products at a disadvantage in the American market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-to-itr-filing-here-is-how-to-create-your-account-on-the-e-filing-portal-2777447-2025-08-27",
      "headline": "New to ITR filing? Here's how to create your account on the e-filing portalNew taxpayers often wonder how to start their ITR journey, and the answer is simple: create your account on the e-filing portal to access all tax-related services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-indian-leather-footwear-exports-impact-trade-cle-russia-africa-markets-kanpur-piyush-goyal-2777387-2025-08-27",
      "headline": "Indian leather industry eyes expansion in Russian, African markets amid US tariffsTrade delegations are set to visit Russia and Africa soon, with Commerce Minister Piyush Goyal expected to lead the mission in Russia. Buyer-seller meets are also planned in African countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-ganesh-chaturthi-2025-nse-bse-close-derivatives-trading-details-us-tariff-2777143-2025-08-27",
      "headline": "Ganesh Chaturthi 2025: Is stock market open for trading today?The stock market holiday list for 2025 is available on the official BSE (Bombay Stock Exchange) website. Earlier, markets were closed on August 15 for Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-will-trumps-50-tariff-impact-indian-economy-and-its-exports-2777315-2025-08-27",
      "headline": "How will Trump's 50% tariff impact Indian economy and its exports?The United States has escalated its trade dispute with India, imposing new tariffs that bring the total rate to 50% on certain goods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/what-impact-will-trumps-50-tariff-have-on-the-indian-economy-experts-weigh-in-2777272-2025-08-26",
      "headline": "How will Trump's 50% tariff impact Indian economy? Experts weigh inThe discussion centres on the implications of a 50% tariff threatened by Donald Trump on Indian goods. Experts analyse the potential impact on India's economy, particularly labour-intensive sectors such as textiles, leather, gems and jewellery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suchitra-accuses-lawyer-fiance-shunmugaraj-domestic-abuse-usurping-chennai-home-2777612-2025-08-27",
      "headline": "Singer Suchitra accuses fiance of abuse: He kicked me, usurped my home, moneySinger Suchitra, in an Instagram video, claimed that she was duped by her lawyer, fiance Shunmugaraj. She claimed to have faced domestic abuse and accused him of usurping her Chennai home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pooja-bhatt-slams-mumbai-pothole-ridden-roads-calls-out-civic-apathy-2777591-2025-08-27",
      "headline": "Pooja Bhatt slams Mumbai's pothole-ridden roads, calls out civic apathyPooja Bhatt criticised the worsening state of Mumbai's roads, especially in Bandra, slamming civic apathy and questioning prolonged repair work that has left potholes untouched. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/half-ca-2-review-ahsaas-channa-show-captures-exam-stress-but-misses-fresh-spark-2777471-2025-08-27",
      "headline": "Half CA 2 Review: Ahsaas's show captures exam stress but misses fresh sparkRelease Date:Wed Aug 27, 2025Half CA 2 review: Ahsaas Channa's series returns with strong performances and heartfelt moments, though its familiar plot makes it a predictable watch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-angad-bedi-go-on-their-first-honeymoon-after-8-years-of-marriage-2777497-2025-08-27",
      "headline": "Neha Dhupia-Angad Bedi go on their first honeymoon after 8 years of marriage. PicsNeha Dhupia and Angad Bedi finally went on their first honeymoon after eight years of marriage, celebrating her birthday with a Mediterranean getaway. The actor shared stunning photos from the trip, calling it a celebration of love, family, and new beginnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-rahul-vaidya-reacts-to-virat-kohli-avneet-kaur-row-says-dont-care-about-fragile-relations-2776948-2025-08-27",
      "headline": "Rahul Vaidya reacts to Virat Kohli row, says don't care about fragile relationsSinger Rahul Vaidya recently made history as he became the first artiste to perform live at the Lalbaugcha Raja Ganpati celebrations. He spoke about Maharashtrian festivities, singing regional songs, the controversy with Virat Kohli and more, in an exclusive interview with IndiaToday.in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehbaz-badesha-shehnaaz-gill-brother-denies-bigg-boss-19-secret-room-speculation-2777493-2025-08-27",
      "headline": "Shehbaz Badesha shuts down rumours of being in Bigg Boss 19 secret roomActor Shehnaaz Gill's brother, Shehbaz Badesha, clarified in a recent video that he is not locked inside the secret room in 'Bigg Boss 19'. His clarification came after an image surfaced on social media showing Badesha seated in an undisclosed location. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jimin-dating-song-da-eun-actor-posts-surprise-video-2777556-2025-08-27",
      "headline": "BTS' Jimin dating Song Da-eun? Actor posts surprise video. WatchKorean actor Song Da-eun has posted a video that has once again sparked rumours of a relationship with BTS's Jimin. The pair have been speculated to be romantically involved since 2022, although neither has confirmed the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-rents-luxury-property-mumbai-juhu-girlfriend-saba-azad-2777468-2025-08-27",
      "headline": "Hrithik Roshan rents luxury property in Mumbai's Juhu to girlfriend Saba AzadActor Hrithik Roshan has rented his sea-facing luxury property in Juhu to his girlfriend, Saba Azad, for Rs 75,000 monthly rent. The rental agreement also includes a security deposit of Rs 1.2 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-return-to-hyderabad-after-india-day-parade-in-us-2777551-2025-08-27",
      "headline": "Masks on: Vijay Deverakonda, Rashmika Mandanna return to Hyderabad after US tripActors Vijay Deverakonda and Rashmika Mandanna were seen at the Hyderabad airport on Wednesday after they returned from the US. The duo attended the India Day Parade and several other events in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lik-first-punch-love-meets-evolutionship-in-pradeep-ranganathan-2040-story-love-insurance-kompany-2777526-2025-08-27",
      "headline": "LIK first punch: Love meets evolutionship in Pradeep Ranganathan's 2040 storyWritten and directed by Vignesh Shivan, 'LIK' aka 'Love Insurance Kompany' stars Pradeep Ranganathan and Krithi Shetty in a rom-com set in the year 2040. The 'First Punch' teaser also revealed that the film is scheduled to release in theatres this Diwali."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-3-latest-written-update-day-2-gaurav-khanna-abhishek-bajaj-nominated-tanya-mittal-ashnoor-kaur-clash-2777452-2025-08-27",
      "headline": "Bigg Boss 19 episode 3: 7 contestants nominated, Tanya-Ashnoor's clash escalatesThe first nomination of 'Bigg Boss 19' took place on Tuesday, with Farrhana Bhatt observing the process from the secret room. Neelam Giri, Tanya Mittal, Abhishek Bajaj and Gaurav Khanna are some of the nominated contestants. Meanwhile, Tanya and Ashnoor Kaur clashed over house duties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-in-bigg-boss-19-is-annoying-entitled-but-absolute-tv-gold-2777511-2025-08-27",
      "headline": "Tanya Mittal in Bigg Boss 19 is annoying, entitled, but absolute TV goldLove her or hate her, Tanya Mittal is already the talking point of 'Bigg Boss 19'. From demanding to be called \"Ma'am\" and bragging about royal security to throwing around unsolicited knowledge, the self-proclaimed queen has become Miss Pick Me of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-travis-kelce-engaged-selena-gomez-gigi-hadid-celebs-congratulate-2777488-2025-08-27",
      "headline": "Taylor Swift-Travis Kelce engaged: Selena Gomez, Gigi Hadid and celebs send loveSinger Taylor Swift announced her engagement to boyfriend Travis Kelce on August 26. Several stars congratulated the duo and sent their love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vash-level-2-review-krishnadev-yagnik-film-amplifies-terror-2777484-2025-08-27",
      "headline": "Vash Level 2 review: Krishnadev Yagnik's sequel is raw, chaotic and unsettlingRelease Date:Wed Aug 27, 2025Vash Level 2, the sequel to the 2023 Gujarati hit, dives into a darker, chaotic horror narrative with themes of innocence corrupted\r\n The film offers intense visuals and performances but struggles with pacing in its latter half"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-went-the-extra-mile-preeti-jhangiani-recalls-his-humility-on-mohabbatein-sets-2777436-2025-08-27",
      "headline": "SRK helped me with lip-sync, sat on floor with spot boys: Actor Preeti JhangianiActor Preeti Jhangiani recalled how Shah Rukh Khan's humility and support on the sets of 'Mohabbatein' had a lasting impact on her. She shared that SRK never behaved like a superstar and even helped her overcome struggles during the song 'Soni Soni'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-removes-shoes-airport-fan-gifts-chhatrapati-sambhaji-maharaj-idol-watch-2777429-2025-08-27",
      "headline": "Vicky Kaushal removes shoes at airport as fan gifts Sambhaji Maharaj idol. WatchActor Vicky Kaushal's recent gesture of removing his shoes after a fan gifted him a Chhatrapati Sambhaji Maharaj idol has surfaced online. The clip has left fans impressed, with many praising his respectful move in the comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-opens-up-on-daughter-nysa-devgn-bollywood-debut-talks-about-nepo-babies-2777388-2025-08-27",
      "headline": "Kajol opens up on daughter Nysa Devgn's Bollywood debut, talks about nepo-babiesKajol, in a recent interaction, talked about daughter Nysa Devgan's plans to join Bollywood. She also shared her thoughts on the nepo-baby debate, saying scrutiny is an inevitable part of the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-daughter-misha-turns-9-mira-rajput-posts-adorable-birthday-wish-2777408-2025-08-27",
      "headline": "Shahid Kapoor's daughter Misha turns 9, Mira Rajput posts adorable birthday wishShahid Kapoor and Mira Rajput's daughter Misha turned nine on August 26, with Mira sharing a heartfelt birthday post and a rare picture of her. The post received warm wishes from celebrities, including Ananya Panday and Neha Dhupia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-chennai-express-comparisons-param-sundari-cant-group-all-south-indians-together-deepika-srk-2777401-2025-08-27",
      "headline": "Janhvi, Sidharth reject Chennai Express parallels with Param SundariJanhvi Kapoor and Sidharth Malhotra are gearing up for the release of their upcoming film, Param Sundari.' The two stars recently reacted to comparisons with Deepika Padukone and Shah Rukh Khan's 'Chennai Express.' "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-dead-several-injured-after-heavy-rain-triggered-landslide-on-vaishno-devi-yatra-route-in-jk-2777356-2025-08-27",
      "headline": "34 dead as rain pounds J&K, Jhelum over danger mark, landslide hits Vaishno Devi Yatra UpdatesA landslide triggered by heavy rain claimed 34 lives and left several others injured along the Mata Vaishno Devi Yatra track in Katra. The torrential rain has triggered widespread disruption across the region."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/twist-in-noida-dowry-case-victims-sister-in-law-accuses-her-family-of-harassment-2777581-2025-08-27",
      "headline": "Twist in Noida dowry case, victim's sister-in-law accuses Nikki's family of harassmentNikki Bhati's sister-in-law, Meenakshi, has alleged that she was harassed and assaulted over dowry demands by the victim's family, further claiming that Nikki herself also mistreated her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-stopped-india-pakistan-flare-up-threatening-high-tariffs-glbs-2777337-2025-08-27",
      "headline": "'7 jets were shot down': Trump doubles down on India-Pak truce mediation claimThe US President said he pressured Indian Prime Minister Narendra Modi to ease tensions with Pakistan, warning of steep tariffs if the conflict escalated. Trump claimed his blunt warning prompted quick action from New Delhi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/chatgpt-suicide-coaching-lawsuit-parents-sue-openai-teen-death-2777584-2025-08-27",
      "headline": "A struggling California teen asked ChatGPT for help. It showed him how to dieA California family filed a lawsuit against OpenAI, alleging that ChatGPT was to blame for their 16-year-old son's suicide. The lawsuit alleges that the chatbot acted as a \"suicide coach\" for their son and provided him with a \"step-by-step playbook\" on how to kill himself."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/floods-china-india-pakistan-heavy-rains-landslides-rainfall-flash-floods-2777523-2025-08-27",
      "headline": "Flood fury in India, China, Pakistan: Here's why it's raining so muchIndia, Pakistan, and China have witnessed massive landslides due to heavy rainfall. Urbanisation, industrialisation, and deforestation have escalated climate change, leading to changes in morning patterns. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jks-udhampur-logs-629-mm-rain-breaks-all-time-24-hour-record-jammu-sees-296-mm-highest-since-1973-2777576-2025-08-27",
      "headline": "J&K's Udhampur logs 629 mm rain, breaks all-time 24-hour record; Jammu sees 296 mmUdhampur smashed its all-time rainfall record with 629.4 mm in 24 hours, while Jammu logged its heaviest downpour since 1973 at 296 mm, triggering deadly landslides, flash floods and large-scale damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/did-donald-trump-us-president-call-american-economy-dead-now-after-india-russia-tariff-trade-2777542-2025-08-27",
      "headline": "Did Trump just call American economy dead?After declaring both the Indian and Russian economies dead, US President Trump said the US economy was \"dead\" too. That was before he made it the \"hottest\" under his leadership. The US economy has been the world's largest since the 19th century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/rishabh-agarwal-joined-meta-with-salary-of-millions-of-dollars-leaves-within-just-5-months-to-take-new-risk-2777564-2025-08-27",
      "headline": "Rishabh Agarwal joined Meta with millions is salary, leaves in just 5 monthsMeta's ambitious Superintelligence Lab is already facing turbulence as top AI scientists are resigning. The high-profile exits include AI researcher Rishabh Agarwal, who has announced his exit just five months after joining on a million-dollar package. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-engagement-ring-dress-details-travis-kelce-2777490-2025-08-27",
      "headline": "Taylor Swift's engagement ring: Co-designed with love, by Travis KelceTravis Kelce collaborated closely with Kindred Lubeck of Artifex Fine Jewelry to co-design the sparkling symbol of love for Taylor Swift."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dowry-violence-up-nurse-set-on-fire-by-police-constable-husband-six-accused-absconding-2777563-2025-08-27",
      "headline": "UP cop returns home for break, sets wife ablaze over dowry, fleesThe woman, who is a trained nurse, sustained severe burn injuries and has been referred to a hospital in Delhi due to the critical nature of her condition. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/khalistani-gurpatwant-singh-pannun-bats-for-punjab-origin-trucker-who-killed-3-us-canada-india-heres-more-2777529-2025-08-27",
      "headline": "Khalistani Pannun bats for Punjab-origin trucker who killed 3 in USKhalistani terrorist Gurpatwant Singh Pannun is now defending Punjab-origin truck driver Harjinder Singh, who killed three people in Florida after making an illegal U-turn and working in the US illegally. Singh faces three counts of vehicular homicide.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-swift-travis-kelce-engagement-us-open-celebration-2777590-2025-08-27",
      "headline": "Watch: Taylor Swift's engagement news interrupts Jannik Sinner's US Open matchTaylor Swift and Travis Kelce announced their engagement, exciting fans worldwide. US Open commentators paused their broadcast during Jannik Sinner's first-round match on Tuesday to celebrate the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tanya-mittal-in-bigg-boss-19-is-annoying-entitled-but-absolute-tv-gold-2777511-2025-08-27",
      "headline": "Tanya Mittal in Bigg Boss 19 is annoying, entitled, but absolute TV goldLove her or hate her, Tanya Mittal is already the talking point of 'Bigg Boss 19'. From demanding to be called \"Ma'am\" and bragging about royal security to throwing around unsolicited knowledge, the self-proclaimed queen has become Miss Pick Me of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-kolkata-urdu-academy-invitation-javed-akhtar-protests-jamiat-ulema-e-hind-wahyahin-foundation-muslims-2777527-2025-08-27",
      "headline": "Speaks against Allah, Islam: Jamiat warns Urdu Academy on hosting Javed AkhtarThe West Bengal Urdu Academy's decision to invite poet-lyricist Javed Akhtar as chief guest for a Kolkata mushaira has triggered protests from two Muslim groups. The Jamiat Ulema-e-Hind and the Wahyahin Foundation have claimed that Akhtar has repeatedly \"spoken against religion and God\" and demand the invitation be withdrawn."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-man-files-case-against-hyundai-deepika-padukone-srk-over-defective-car-2777358-2025-08-27",
      "headline": "Rajasthan man files case against Hyundai, Deepika Padukone, SRK over defective carKirti Singh, in his complaint, alleged that the dealership assured him the car was trouble-free, promising to take responsibility in case of any defect. However, soon after purchase, the car started showing serious technical faults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-impact-gdp-us-tariff-50-percent-donald-trump-fastest-growing-economy-pm-modi-rbi-projection-2777572-2025-08-27",
      "headline": "How will Trump's 50% tariff impact India's growthThe 50% tariff by the US comes at a time when India has reported strong growth of 6.5% in 2024–25 and has been projected to remain the fastest-growing major economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-guwahati-maharaja-prithu-flyover-gnb-road-himanta-biswa-sarma-king-who-defeated-invader-bakhtiyar-khilji-2777016-2025-08-27",
      "headline": "Who's King Prithu who destroyed Nalanda-raider Khilji, made him retire?The Himanta Biswa Sarma-led Assam government's decision to name Guwahati's GNB Flyover 'Maharaj Prithu Flyover' has revived the heroic tales of King Prithu, the 13th-century raja of Kamrupa. When Khilji, after attacking Nalanda and invading Bengal, was marching through Kamrupa with 12,000 cavalry and 20,000 infantry fighters, Raja Prithu led a multi-community force and decimated Khilji's army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/we-taught-ai-to-optimise-not-to-care-and-that-should-scare-us-2777443-2025-08-27",
      "headline": "We taught AI to optimise - not to care. And that should scare usAI doesn't understand ethics but it understands patterns. We like to call these systems \"intelligent,\" but they're not. At least not in any human sense. They don't know what's fair. They don't care what's just. They don't wrestle with ambiguity. They don't understand nuance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fiji-pm-sitiveni-rabuka-on-trump-tariffs-on-india-somebody-not-happy-but-you-will-weather-it-2777491-2025-08-27",
      "headline": "Somebody isn't happy with you: Fiji PM to PM Modi as Trump tariffs kick inThe South Pacific nation's Prime Minister reached New Delhi on Sunday for a three-day visit aimed at strengthening Fiji's partnership with India across sectors including maritime security, trade, and health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-open-lemonade-stand-adorable-video-shows-players-chatting-with-children-2777502-2025-08-27",
      "headline": "Video: Jannik Sinner, Aryna Sabalenka chat with children at US Open lemonade standVideos shared on the tournament's official social media handles went viral, documenting players' wholesome conversations with the children. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleep-deprivation-eye-health-corneal-repair-risks-2777481-2025-08-27",
      "headline": "Not just dark circles, sleepless nights can damage your visionIn this week's Health 6/6, we explore how disrupted sleep can cause serious corneal damage and vision problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-hit-dragged-for-metres-dies-in-crash-involving-16-year-old-driver-2777412-2025-08-27",
      "headline": "Caught on CCTV: Delhi man dies after being run over by car driven by 16-year-oldAccording to police, the car was being driven by a 16-year-old who suddenly swerved, causing the vehicle to hit the victim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/private-school-spending-almost-9-times-higher-than-public-government-survey-2777541-2025-08-27",
      "headline": "Families pay 9 times more for private than public school students: Government surveyA national government survey has shown that while government schools educate the majority of children, households spend vastly more per child in private schools. The average household outlay per student in non-government schools was Rs 25,002, compared with Rs 2,863 in government schools. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pardeep-narwal-retirement-pkl-season-12-felicitation-ceremony-2777603-2025-08-27",
      "headline": "Pardeep Narwal's legacy to be honoured by PKL ahead of Season 12 openerThe Pro Kabbaddi League will honour the legacy of Pardeep Narwal ahead of the season 12 opener on August 29. Pardeep retired from kabaddi in June of this year after not getting picked up by any team during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-swift-travis-kelce-engagement-us-open-celebration-2777590-2025-08-27",
      "headline": "Watch: Taylor Swift's engagement news interrupts Jannik Sinner's US Open matchTaylor Swift and Travis Kelce announced their engagement, exciting fans worldwide. US Open commentators paused their broadcast during Jannik Sinner's first-round match on Tuesday to celebrate the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-order-of-play-day-4-wednesday-djokovic-alcaraz-2777593-2025-08-27",
      "headline": "Day 4, Order of Play: Djokovic, Alcaraz in action on blockbuster dayThe second round fixtures of the US Open is upon us and the first day starts with some of the biggest names in the tournament. Novak Djokovic and Carlos Alcaraz are set to play their games at the Arthur Ashe Stadium today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-reacts-taylor-swift-travis-kelce-engagement-us-open-2025-2777568-2025-08-27",
      "headline": "Fangirl Swiatek wishes Taylor Swift on her engagement: Hopefully this will stickIga Swiatek was thrilled to learn of Taylor Swift's engagement to Travis Kelce on Tuesday, August 26. The Polish star, a devoted fan of the American singer, wished the couple the best while speaking to reporters in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-chennai-super-kings-tribute-retirement-ipl-2777544-2025-08-27",
      "headline": "CSK pays heartfelt tribute to 'thirupurra sundaran' R Ashwin after IPL retirementR Ashwin announced his retirement from the Indian Premier League, ending an illustrious stint with Chennai Super Kings. The five-time champions paid a rich tribute to the off-spinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-retires-ipl-top-moments-csk-punjab-kings-dc-rr-2777534-2025-08-27",
      "headline": "Ashwin retires from IPL: Top moments of spin great's Indian Premier League careerRavichandran Ashwin bid farewell to the Indian Premier League after an illustrious career spanning 221 matches and 187 wickets. He won back-to-back IPL titles with Chennai Super Kings in 2010 and 2011 and captained Punjab Kings in 2018, leading them to six victories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/prithipal-singh-murder-sundeep-mishra-book-gunned-down-2777525-2025-08-27",
      "headline": "Beyond the Podium: Are we failing our Champions?They brought India glory, but found little support after. As medals faded, so did respect. What do we really offer our sporting heroes once the spotlight is gone?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lockie-ferguson-recalls-ms-dhoni-key-delivery-leave-2019-world-cup-semi-final-2777496-2025-08-27",
      "headline": "MS Dhoni's shocking leave in the 2019 World Cup recalled by FergusonNew Zealand fast bowler Lockie Ferguson has revealed he was 'surprised' to see MS Dhoni leave deliveries during the 2019 World Cup semi-final against India at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-skin-cancer-surgery-urges-regular-skin-checks-2777456-2025-08-27",
      "headline": "Michael Clarke grateful after skin cancer removed in fresh health scareFormer Australia captain Michael Clarke has revealed that he has undergone another surgery to remove skin cancer, urging fans to prioritise health check-ups and stay vigilant about sun safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-bengaluru-bulls-team-preview-exclusive-2777372-2025-08-27",
      "headline": "Pressure and Promise: Bengaluru Bulls coach Ramesh lays out bold PKL 12 visionBengaluru Bulls hit the reset button ahead of Pro Kabaddi League Season 12, with new coach BC Ramesh taking charge after Randhir Singh Sehrawat's exit. Ramesh opens up on pressure, strategy, and building a balanced squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/prithipal-singh-murder-sundeep-mishra-book-gunned-down-2777525-2025-08-27",
      "headline": "Beyond the Podium: Are we failing our Champions?They brought India glory, but found little support after. As medals faded, so did respect. What do we really offer our sporting heroes once the spotlight is gone?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lockie-ferguson-recalls-ms-dhoni-key-delivery-leave-2019-world-cup-semi-final-2777496-2025-08-27",
      "headline": "MS Dhoni's shocking leave in the 2019 World Cup recalled by FergusonNew Zealand fast bowler Lockie Ferguson has revealed he was 'surprised' to see MS Dhoni leave deliveries during the 2019 World Cup semi-final against India at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-skin-cancer-surgery-urges-regular-skin-checks-2777456-2025-08-27",
      "headline": "Michael Clarke grateful after skin cancer removed in fresh health scareFormer Australia captain Michael Clarke has revealed that he has undergone another surgery to remove skin cancer, urging fans to prioritise health check-ups and stay vigilant about sun safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-bengaluru-bulls-team-preview-exclusive-2777372-2025-08-27",
      "headline": "Pressure and Promise: Bengaluru Bulls coach Ramesh lays out bold PKL 12 visionBengaluru Bulls hit the reset button ahead of Pro Kabaddi League Season 12, with new coach BC Ramesh taking charge after Randhir Singh Sehrawat's exit. Ramesh opens up on pressure, strategy, and building a balanced squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-csk-ipl-retirement-indian-premier-league-2777440-2025-08-27",
      "headline": "R Ashwin retires from IPL amid trade rumours, sets sight on overseas leaguesIndia spinner Ravichandran Ashwin announced his retirement from the Indian Premier League on Wednesday, August 27. Ashwin announced his retirement via a post on his social media accounts."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}