{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chinese-labour-not-cheap-why-china-still-worlds-manufacturing-hub-global-data-2854722-2026-01-20",
      "headline": "Chinese labour is no longer cheap. So how is it still world's manufacturing hub?Manufacturing labour costs in China have risen sharply over the past three decades. By around 2022, Chinese factory wages were close to $8 per hour. In comparison, wages stood at about $2.3 per hour in Vietnam, $2.1 in Malaysia, $1.9 in Thailand and just $1.1 in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-lower-trump-tariff-eu-us-greenland-it-stocks-down-2854679-2026-01-20",
      "headline": "Sensex, Nifty open lower over weak global cues; IT and financials drag marketThe S&P BSE Sensex was down by 269.93 points to 82,976.25, while the NSE Nifty50 lost 69.25 points to 25,516.25 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-ipo-opens-for-bidding-should-you-subscribe-check-latest-gmp-2854677-2026-01-20",
      "headline": "Shadowfax IPO opens for bidding: Should you subscribe? Check latest GMPShadowfax Technologies IPO is a book-built issue worth Rs 1,907.27 crores. The issue includes a fresh issue of 8.06 crore shares amounting to Rs 1,000.00 crores. It also has an offer for sale of 7.32 crore shares worth Rs 907.27 crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-price-record-high-rally-trump-tariff-chaos-us-2854540-2026-01-20",
      "headline": "Not America, but Trump is definitely making gold great againUS President Donald Trump isn't making America great again, but he is unquestionably making gold greater than ever. As uncertainty deepens, the world's confidence is shifting from Washington to bullion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upper-middle-income-country-2030-third-largest-economy-2028-sbi-glbs-2854618-2026-01-20",
      "headline": "India to be upper-middle income by 2030, third largest economy by 2028: SBIIndia is projected to become an upper-middle income country by 2030 and the third-largest economy by 2028. This economic transition reflects sustained growth and reform efforts but also poses challenges to maintain momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-contributing-to-20-of-overall-global-growth-wef-chief-borge-brende-2854566-2026-01-19",
      "headline": "India contributing to 20% of overall global growth: WEF chief Borge BrendeIn an exclusive interview with India Today, World Economic Forum President Borge Brende hailed India as the fastest growing of the large economies in the world, contributing to 20% of the overall global growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ranks-16th-responsible-nations-index-singapore-tops-global-list-2854538-2026-01-19",
      "headline": "India ranks above US, China in new Responsible Nations IndexThe Responsible Nations Index, or RNI, is an initiative of the World Intellectual Foundation and is the outcome of a three-year academic and policy exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-achieve-500-gw-renewable-energy-target-by-2030-pralhad-joshi-world-economic-forum-wef-meeting-in-davos-2854495-2026-01-19",
      "headline": "India on track to achieve 500 GW renewable energy target by 2030: Pralhad JoshiJoshi said investor interest in India's renewable sector has been strong, with over $145 billion invested in the past 10 years, including $20 billion in foreign direct investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijayakumar-explains-how-ai-is-reshaping-tech-jobs-and-revenues-wef-davos-2854420-2026-01-19",
      "headline": "HCLTech CEO explains how AI is reshaping IT jobs and revenuesVijayakumar said the global business environment has been turbulent over the past few years, but things now appear to be stabilising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/borge-brende-to-india-today-the-ukraine-war-possibly-could-end-this-year-after-four-years-ytvd-2854381-2026-01-19",
      "headline": "Børge Brende to India Today: 'The Ukraine war possibly could end this year' after four yearsWorld Economic Forum President Børge Brende joins India Today's Rajdeep Sardesai at Davos to discuss the most complex geopolitical landscape since 1945. Brende highlights that despite global tensions, including potential friction between Europe and the US over Greenland, global growth remains resilient at over 3%. He notes that 'the Ukraine war possibly could end this year' if there is sufficient willingness for a solution. The discussion covers India's rising economic influence, with Brende describing India as a 'US$10 trillion economy pretty soon' that contributes 20% to global growth. He addresses the 'Trumpian world order,' suggesting that while media focuses on the 'noise,' quiet bilateral cooperation continues to drive the global agenda. Brende identifies escalating conflict in the Gulf, debt bubbles, and 'black swan' events like cyber warfare as the primary risks to global stability in 2026. He emphasizes that the WEF remains an impartial platform where competing powers like the US, China, and India can engage in essential dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/aishwarya-paliwal-on-imf-revising-indias-fy26-gdp-growth-forecast-upward-to-73-ytvd-2854328-2026-01-19",
      "headline": "IMF Hikes India's GDP Growth Estimate to 7.3% for 2025-26The International Monetary Fund (IMF) has revised India's GDP growth estimate for the financial year 2025-26 upward to 7.3 percent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-linking-brics-digital-currencies-to-ease-trade-and-tourism-payments-report-2854346-2026-01-19",
      "headline": "RBI proposes linking BRICS digital currencies to ease cross-border trade: ReportIf accepted, it would mark the first formal attempt to link the central bank digital currencies (CBDCs) of BRICS members, a move that could reduce dependence on the US dollar at a time of heightened geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-trade-moving-towards-mini-lateral-and-plurilateral-deals-says-wefs-kimberley-botwright-2854341-2026-01-19",
      "headline": "Global trade moving towards mini-lateral and plurilateral deals, says WEF's Kimberley BotwrightGlobal trade is entering a new phase, with countries moving away from broad multilateral agreements and increasingly turning to smaller, targeted trade deals, says Kimberley Botwright."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-tanks-over-300-points-nifty-tumbles-amid-global-uncertainty-2854308-2026-01-19",
      "headline": "Sensex tanks over 300 points, Nifty tumbles amid global uncertaintyThe Sensex fell more than 300 points, while the Nifty slipped below the crucial 25,600 mark as investors remained cautious through the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-can-strike-trade-deals-on-its-own-terms-says-wef-chief-borge-brende-2854289-2026-01-19",
      "headline": "India can strike trade deals on its own terms, says WEF chief Borge BrendeBorge Brende said that India's rise over the past few years has reshaped its leverage in the global economy, giving New Delhi far more room to decide when and with whom it wants to sign trade deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-revises-indias-growth-outlook-upward-to-73-for-fy26-despite-tariffs-and-global-uncertainty-2854270-2026-01-19",
      "headline": "IMF lifts India's FY26 growth forecast to 7.3% amid global uncertaintyIn its latest World Economic Outlook report, the IMF said India's economy is now expected to grow by 7.3% in FY26, up 0.7 percentage points from its earlier estimate. The upgrade reflects better-than-expected growth in the third quarter and continued strength in the fourth quarter of the current fiscal year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-deliver-scale-skills-and-digital-growth-for-manufacturing-2854216-2026-01-19",
      "headline": "Can Budget 2026 deliver scale, skills and digital growth for manufacturing?Budget 2026 is expected to play a key role in shaping the future of India's manufacturing sector. From expanding scale to building skilled manpower and driving digital adoption, the industry has clear expectations from the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/taxes-jobs-credit-policies-what-consumers-can-expect-from-budget-2026-2854197-2026-01-19",
      "headline": "Taxes, jobs, credit policies: What consumers can expect from Budget 2026Budget 2026 is expected to touch everyday finances, from how much tax people pay to how easily they can access credit. Consumers are hoping for measures that ease costs and support stable income growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-real-estate-delays-homebuyers-uttar-pradesh-township-policy-stalled-projects-2854161-2026-01-19",
      "headline": "From ruin to reform: My 12-year real estate nightmare and why RERA is a lifelineA decade-long struggle through stalled projects reveals why strong regulation matters. RERA restored accountability in a sector where delays were normal and buyers carried all the risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-technologies-ipo-opens-tomorrow-check-price-gmp-and-other-details-2854168-2026-01-19",
      "headline": "Shadowfax Technologies IPO opens tomorrow: Check price, GMP and other detailsShadowfax Technologies is set to enter the primary market tomorrow with its much-watched IPO. The issue comes at a time when online shopping and same-day delivery services are seeing steady growth across India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-rumours-february-2026-udaipur-2854695-2026-01-20",
      "headline": "Here's what Rashmika Mandanna said on wedding rumours with Vijay Deverakonda Rashmika Mandanna has addressed ongoing rumours about her wedding with Vijay Deverakonda. stating she will speak about the matter when the time is right, amidst widespread speculation about an upcoming private ceremony in Udaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-nephew-vinay-anand-marital-rumours-family-privacy-appeal-social-media-speculation-2854692-2026-01-20",
      "headline": "Vinay Anand reacts to Govinda's affair rumours, prays his marriage remains strong Vinay Anand responded to speculation around Govinda and Sunita Ahuja's marriage, urging privacy and expressing hope for their relationship, while also addressing family remarks and the ongoing online debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-jailer-2-final-shoot-begins-kochi-nelson-dilipkumar-2854678-2026-01-20",
      "headline": "Rajinikanth, Nelson Dilipkumar arrive in Kochi for Jailer 2 shoot. Viral videos Superstar Rajinikanth and director Nelson Dilipkumar have arrived in Kochi to resume shooting for Jailer 2. The film's final schedule aims to wrap up by mid-February ahead of its anticipated June release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vir-das-happy-patel-khatarnak-jasoos-absurd-comedy-aamir-khan-productions-bollywood-film-2026-2854557-2026-01-20",
      "headline": "The brilliance of writing a stupid movie ft. Happy Patel: Khatarnak Jasoos From quirky jokes to heartwarming moments, Happy Patel shows how stupidity can be genius if written the right way. A rare win for Bollywood in absurd comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/amruta-khanvilkar-attempting-action-neeraj-pandey-taskaree-emraan-hashmi-2854653-2026-01-20",
      "headline": "Amruta Khanvilkar felt empowered doing stunts in Taskaree: I was one of the boys In an exclusive interview with India Today, Amruta Khanvilkar shared her experience of performing action sequences in the latest Netflix series 'Taskaree.' The actor said how it was something she always wished for. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-sets-new-record-one-million-interests-bookmyshow-legal-cethalapathy-vijay-jana-nayagan-sets-new-record-with-over-one-million-interests-on-bookmyshow-ahead-of-madras-high-court-2854651-2026-01-20",
      "headline": "Vijay's Jana Nayagan hits 1 million interests on BookMyShow ahead of court hearing Vijay's final film Jana Nayagan has surpassed one million expressions of interest on BookMyShow while audiences await its release. The film was delayed due to an ongoing legal dispute over Central Board of Film Certification clearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-addresses-marriage-rumours-requests-privacy-amid-social-media-speculation-2854642-2026-01-20",
      "headline": "Don't drag my innocent husband: Neha Kakkar addresses divorce rumours amid break Singer Neha Kakkar has addressed speculation about her marriage to Rohanpreet Singh, following social media posts about taking a break from responsibilities, relationships, and work. Kakkar requested privacy and urged people not to involve her family in public discussions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-begins-work-on-new-film-after-cancelled-wedding-with-smiriti-mandhana-directs-shreyas-talpade-2854641-2026-01-20",
      "headline": "Palaash Muchhal begins work on new film after cancelled wedding with Smriti Mandhana Composer and filmmaker Palasah Muchhal is set to work on a new film months after his wedding with Indian cricketer Smriti Mandhana was cancelled amid personal controversy. Muchhal has signed his next film project, which is expected to be announced soon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-season-of-red-flags-violence-negativity-and-no-restraint-2854303-2026-01-20",
      "headline": "Bigg Boss Tamil 9: Season of red flags, violence, negativity and no restraint Bigg Boss Tamil 9 concluded amid widespread controversies and contestant misconduct. The season highlighted failures in hosting and contestant management, raising concerns for future editions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikas-khannas-mumbai-meal-sparks-nostalgia-thanks-to-siddharth-chopra-2854632-2026-01-20",
      "headline": "Vikas Khanna's Mumbai meal sparks nostalgia, thanks to Siddharth Chopra Vikas Khanna shared his delectable experience of enjoying home-cooked food by Priyanka Chopra's brother Siddharth. In a post on social media, the celebrity chef gave a shout-out to Siddharth for making the meal truly memorable, evoking nostalgia, warmth, and flavors reminiscent of his childhood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-cast-reunion-saturday-night-live-finn-wolfhard-caleb-mclaughlin-gaten-matarazzo-2854628-2026-01-20",
      "headline": "Why Noah Schnapp skipped the Stranger Things reunion on Saturday Night Live Noah Schnapp missed joining Finn Wolfhard and his other 'Stranger Things' co-stars Caleb McLaughlin and Gaten Matarazzo during the January 17 episode of Saturday Night Live. While his absence was noted by fans, not many would know the reason behind it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brooklyn-beckham-alleges-parental-control-marriage-strain-david-victoria-beckham-2854627-2026-01-20",
      "headline": "Mum danced very inappropriately on me: Son Brooklyn's damning post on Beckhams Brooklyn Beckham has issued a detailed statement claiming that his parents, David and Victoria Beckham, attempted to control his life and harmed his relationship with his wife, Nicola Peltz. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imtiaz-ali-on-ar-rahman-controversy-i-dont-think-there-is-a-communal-bias-2854619-2026-01-20",
      "headline": "Imtiaz Ali on AR Rahman controversy: I don't think there is a communal bias Imtiaz Ali has said that AR Rahman's statements were likely misconstrued amid ongoing controversy. Speaking to India Today, he dismissed claims of communal bias in the film industry, describing Rahman as one of its brightest and most respected figures.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-knight-of-the-seven-kingdoms-showrunner-this-got-spin-off-needs-patience-2854617-2026-01-20",
      "headline": "A Knight of the Seven Kingdoms showrunner: This GoT spin-off needs patience A Knight of the Seven Kingdoms showrunner Ira Parker spoke to India Today on why this Game of Thrones spin-off needs patience. Parker highlighted how the prequel prioritises intimacy over dragons, focusing on the grounded bond between Dunk and Egg while remaining faithful to George R. R. Martin's original novellas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-explores-tokyo-with-wife-sneha-and-kids-amid-pushpa-2-promotions-2854563-2026-01-19",
      "headline": "Allu Arjun explores Tokyo with wife Sneha and kids amid Pushpa 2 promotions Actor Allu Arjun's wife Sneha Reddy shared a video of the family from their Tokyo trip. The actor is in Japan as the Japanese-dubbed version of his film Pushpa: The Rule has been released."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/akshay-kumar-convoy-hit-after-mercedes-crashes-into-auto-in-juhu-actor-wife-twinkle-khanna-in-another-car-2854590-2026-01-19",
      "headline": "Akshay Kumar's convoy vehicle in freak accident; actor and wife Twinkle unhurt Akshay Kumar's convoy vehicle was hit by an auto rickshaw involved in an accident with another car. The actor and his wife Twinkle Khanna were in a different car ahead, which suffered a minor impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-takes-away-fan-phone-for-trying-to-click-selfie-on-stage-protocol-say-users-2854546-2026-01-19",
      "headline": "SRK takes away fan's phone for trying to click selfie on stage: Protocol, say users Shah Rukh Khan took away a fan's phone as the latter tried to click selfie on stage. The internet defended the actor by highlighting that he was following protocol.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-is-jana-nayagan-actor-pooja-hegde-trending-all-you-need-to-know-2854486-2026-01-19",
      "headline": "Why is Jana Nayagan actor Pooja Hegde trending? All you need to know A reported interview attributed to Pooja Hegde, alleging misconduct by a co-star, has sparked intense discussion across social media platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-is-a-landmark-case-emraan-hashmi-on-why-the-film-will-age-well-on-ott-2854506-2026-01-19",
      "headline": "Haq is a landmark case: Emraan Hashmi on why the film will age well on OTT Emraan Hashmi expressed happiness over his legal drama 'Haq' being praised ever since its OTT release. The film also features Yami Gautam in a pivotal character."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/governor-rn-ravi-walks-out-tamil-nadu-assembly-govt-approved-address-inaccuracies-claims-dmk-stalin-2854723-2026-01-20",
      "headline": "Tamil Nadu Governor walks out of assembly over 'inaccuracies' in speechTamil Nadu Governor RN Ravi walked out of the assembly session on Tuesday after refusing to deliver a state government-prepared speech, which he claimed had \"inaccuracies\" and \"unsubstantiated claims\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-greenland-us-take-control-tension-european-union-france-mockery-open-scott-bessent-emmanuel-macron-denmark-2854682-2026-01-20",
      "headline": "Better burn the house now: France goes all out, openly mocks US over GreenlandFrance has now openly mocked its ally, the US, over Donald Trump's ambition to seize Greenland, under the control of Denmark, as tension between Washington and the European Union escalates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-dgp-ramachandra-rao-suspended-inappropriate-behaviour-intimate-act-office-videos-2854643-2026-01-20",
      "headline": "DGP-rank Karnataka cop Ramachandra Rao suspended over viral  sleaze videoThe Karnataka government suspended senior cop Ramachandra Rao after a video surfaced on social media showing his alleged intimate moments in his official chamber. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vande-bharat-sleeper-new-trash-viral-video-passengers-littering-saraighat-express-civic-sense-airlines-train-fare-2854490-2026-01-20",
      "headline": "India's trash sleeper cells now target Vande BharatWithin hours of its inauguration on Saturday, the Vande Bharat Sleeper express was strewn with plastic and spoons, as if civic sense had taken an early holiday. Though India is trying to upgrade to shiny Vande Bharat trains, old mail train habits seem difficult to shed for Indians. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vir-das-happy-patel-khatarnak-jasoos-absurd-comedy-aamir-khan-productions-bollywood-film-2026-2854557-2026-01-20",
      "headline": "The brilliance of writing a stupid movie ft. Happy Patel: Khatarnak JasoosFrom quirky jokes to heartwarming moments, Happy Patel shows how stupidity can be genius if written the right way. A rare win for Bollywood in absurd comedy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/australia-south-indian-origin-vikrant-thakur-pleads-guilty-manslaughter-denies-murder-wife-supriya-thakur-adelaide-magistrate-court-2854633-2026-01-20",
      "headline": "Yes, I killed my wife, but it wasn't murder: Indian-origin man to Australian courtAn Indian-origin man, Vikrant Thakur, has formally taken responsibility for his wife's killing but told the court that he is not guilty of her murder. The investigation into the case began in late December when Supriya Thakur was found unconscious at her home by police officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/airline-ceo-calls-elon-musk-an-idiot-musk-threatens-to-buy-his-company-and-fire-him-2854687-2026-01-20",
      "headline": "Airline CEO calls Elon Musk an idiot, Musk threatens to buy his company and fire himA brief outage on Elon Musk-owned X spiralled into a viral war of words after Ryanair's boss called Musk an \"idiot,\" prompting the billionaire to joke about buying the airline and firing him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/european-nato-troop-deployments-greenland-diplomatic-tensions-us-trump-admission-2854674-2026-01-20",
      "headline": "Trump fumes over EU troops in Greenland, later admits intel was wrong: ReportDonald Trump's admission reportedly came during a phone call with British Prime Minister Keir Starmer on Sunday, in which the latter criticised the US President's decision to impose new tariffs on European countries, including the UK, for their support of Greenland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brooklyn-beckham-alleges-parental-control-marriage-strain-david-victoria-beckham-2854627-2026-01-20",
      "headline": "Mum danced very inappropriately on me: Son Brooklyn's damning post on BeckhamsBrooklyn Beckham has issued a detailed statement claiming that his parents, David and Victoria Beckham, attempted to control his life and harmed his relationship with his wife, Nicola Peltz. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/norwegian-pm-responds-trump-greenland-nobel-prize-snub-message-glbs-2854629-2026-01-20",
      "headline": "Nobel awarded by independent committee: Norway PM responds to Trump's messageThe Norwegian PM said he responded by making clear that government has no role in selecting Nobel laureates, stressing that the prize is awarded independently of political authorities in Norway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-car-accident-jaguar-head-on-collision-with-truck-2854676-2026-01-20",
      "headline": "Jaguar crashes while trying to overtake truck in Noida, teen driver killedThe collision between the truck and the Jaguar occurred when the car driver tried to overtake and lost control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-metro-cleanliness-concerns-man-urinates-station-dmrc-urges-vigilance-2854630-2026-01-20",
      "headline": "Man caught urinating inside Delhi Metro station, outrage after video goes viralA video circulating online showing a man urinating inside a Delhi Metro station has led to widespread criticism on social media, raising concerns over civic sense and public hygiene in the capital's transport system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-dont-you-have-kids-this-question-needs-to-stop-2853722-2026-01-20",
      "headline": "Why don't you have kids? This question needs to stopIn today's time, when being child-free is a common reality rather than an exception, questioning someone about why they don't have kids is intrusive, hypocritical, deeply triggering, and simply insensitive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-price-record-high-rally-trump-tariff-chaos-us-2854540-2026-01-20",
      "headline": "Not America, but Trump is definitely making gold great againUS President Donald Trump isn't making America great again, but he is unquestionably making gold greater than ever. As uncertainty deepens, the world's confidence is shifting from Washington to bullion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/akshay-kumar-convoy-hit-after-mercedes-crashes-into-auto-in-juhu-actor-wife-twinkle-khanna-in-another-car-2854590-2026-01-19",
      "headline": "Akshay Kumar's convoy vehicle in freak accident; actor and wife Twinkle unhurtAkshay Kumar's convoy vehicle was hit by an auto rickshaw involved in an accident with another car. The actor and his wife Twinkle Khanna were in a different car ahead, which suffered a minor impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/dev-meena-kuldeep-yadav-pole-vault-tte-panvel-station-2854589-2026-01-19",
      "headline": "India's top pole-vaulter thrown off train by TTE, viral video sparks controversyNational record holder Dev Meena and fellow athlete Kuldeep Yadav were told to deboard the train at Panvel station. Their mistake? Carry the essential gear of their sport – the pole, while returning from a competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/layoffs-in-corporate-india-why-turning-40-is-becoming-a-workplace-risk-2854261-2026-01-19",
      "headline": "Is 40 the new layoff age in corporate India's job market?By 40, experience should be your greatest strength, yet in corporate India, it is increasingly becoming a hidden liability. As companies chase youth, speed, and lower costs, mid-career professionals are being pushed aside without explanation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ranks-16th-responsible-nations-index-singapore-tops-global-list-2854538-2026-01-19",
      "headline": "India ranks above US, China in new Responsible Nations IndexThe Responsible Nations Index, or RNI, is an initiative of the World Intellectual Foundation and is the outcome of a three-year academic and policy exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-bhakti-tamilakams-epic-counter-and-gift-to-bharath-part-15-338-19-01-2026",
      "headline": "Time, Tide & Tamil Part 15 | Bhakti: Tamilakam's Epic Counter and Gift to BharatThe Tamil landscape, for centuries, had been shaped by the self-denying, often severe, philosophies of Jainism and Buddhism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/palaash-muchhal-begins-work-on-new-film-after-cancelled-wedding-with-smiriti-mandhana-directs-shreyas-talpade-2854641-2026-01-20",
      "headline": "Palaash Muchhal begins work on new film after cancelled wedding with Smriti MandhanaComposer and filmmaker Palasah Muchhal is set to work on a new film months after his wedding with Indian cricketer Smriti Mandhana was cancelled amid personal controversy. Muchhal has signed his next film project, which is expected to be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/how-valentino-red-became-fashions-most-iconic-shade-by-valentino-garavani-2854686-2026-01-20",
      "headline": "How Valentino Red became fashion's most iconic shadeAce designer Valentino Garavani has left behind a lasting legacy, and a colour, Valentino Red, which became one of fashion's most recognisable and timeless signatures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/navarro-is-wrong-american-ai-companies-not-doing-any-charity-in-india-instead-they-are-using-indians-2854304-2026-01-19",
      "headline": "Navarro is wrong, American AI companies not doing any charity in IndiaPeter Navarro says Americans are paying for AI usage in India. That, all evidence suggests, can't be further from the truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/vande-bharat-train-littered-within-hours-of-launch-sparks-civic-sense-outrage-2854408-2026-01-19",
      "headline": "Vande Bharat train littered within hours of launch, sparks civic sense outrageThe new Vande Bharat Sleeper Express, connecting Howrah and Guwahati, began operations amid public interest and debate about passenger behavior after a viral video highlighted littering during its inaugural run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-pak-can-now-acheive-purpose-why-it-was-created-says-pakistan-army-cheif-asim-munir-thanks-allah-2854225-2026-01-19",
      "headline": "Pak can now achieve purpose of its creation, says Munir. What is he hinting at?Pakistan's Chief of Defence Forces, Asim Munir, said the country was at a juncture where it could achieve the purpose of its creation. He said Pakistan was created in the name of Islam and now enjoyed a special status among Islamic countries."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-jokes-carlos-alcaraz-serve-similarity-australian-open-2026-2854702-2026-01-20",
      "headline": "Has Alcaraz copied Djokovic's serve? Serbian great jokes about copyright claim Australian Open 2026: Novak Djokovic joked about Carlos Alcaraz's serve motion being similar to his own. The Serb spoke about the similarities in their serves after his dominant first-round win at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-beat-west-indies-38-runs-dubai-t20i-ibrahim-zadran-darwish-rasooli-2854671-2026-01-20",
      "headline": "Zadran, Rasooli star as Afghanistan stun West Indies ahead of T20 World Cup Afghanistan gave West Indies a reality check with a 38-run win in the first T20I in Dubai ahead of the T20 World Cup 2026. West Indies were restricted to 143/9 in their 20 overs, chasing a target of 182."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-badminton-venue-controversy-mansukh-mandaviya-sai-indias-olympic-dreams-2854657-2026-01-20",
      "headline": "After India Open chaos, Sports Minister pushes SAI to save Olympic dreams Sports Minister Mansukh Mandaviya held a meeting with the officials of the Sports Authority of India (SAI) to discuss the venue lapses during the India Open Badminton tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-t20i-comeback-ind-vs-nz-t20-world-cup-2026-tilak-varma-2854640-2026-01-20",
      "headline": "Shreyas Iyer's T20 comeback: Can he force his way into World Cup team? India vs New Zealand: Shreyas Iyer's return comes at a crucial time, just weeks before the T20 World Cup 2026. With the tournament less than a month away, India appear to be lining up Iyer as injury cover for Tilak Varma while also offering the right-hander a timely opportunity to push his case for a World Cup berth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-day-3-live-updates-coco-jannik-sinner-madison-keys-elena-rybakina-2854631-2026-01-20",
      "headline": "Day 3 Live Score: Keys, Musetti progress to Round 2, Shelton wins first set Australian Open 2026, Day 3 Live Score: Madison Keys has stormed her way into Round 2, beating Oleksandra Olinykova at the Rod Laver Arena. Meanwhile, Lorenzo Musetti has made his way into Round 2 after Raphael Collignon got retired hurt midway through the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-confirms-retirement-from-badminton-2854607-2026-01-19",
      "headline": "Saina Nehwal confirms retirement from badminton: Can't push it anymore Former world No.1 Saina Nehwal has confirmed her retirement from badminton, revealing her body can no longer handle the sport's physical demands after two years away from the court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-champions-league-monaco-fan-frustration-team-unity-2854555-2026-01-19",
      "headline": "Kylian Mbappe urges Real Madrid fans to back Vinicius Jr. amid poor form Kylian Mbappe has urged the Real Madrid fans to back Vinicius Jr. amidst the Brazilian's poor run of form in recent games. Mbappe said it wasn't good to blame just a player and the whole squad deserves to get stick with their performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-gujarat-giants-wpl-2026-playoffs-gautami-naik-2854591-2026-01-19",
      "headline": "RCB march into WPL 2026 playoffs with 5th straight win, thrash Gujarat in Vadodara RCB marched into the playoffs of the WPL 2026 season with a comprehensive 61-run win over a hapless Gujarat Giants side, who failed to deliver with the bat in Vadodara on Monday, Janaury 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/dev-meena-kuldeep-yadav-pole-vault-tte-panvel-station-2854589-2026-01-19",
      "headline": "India's top pole-vaulter thrown off train by TTE, viral video sparks controversy National record holder Dev Meena and fellow athlete Kuldeep Yadav were told to deboard the train at Panvel station. Their mistake? Carry the essential gear of their sport – the pole, while returning from a competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravichandran-ashwin-ravindra-jadeja-2854569-2026-01-19",
      "headline": "Ashwin urges Jadeja to reinvent, find joy like Virat Kohli in twilight phase Former India cricketer Ravichandran Ashwin has urged Ravindra Jadeja to reinvent himself in the twilight phase of his career. Ashwin's advice comes after Jadeja struggled to have any impact in the ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afcon-final-morocco-vs-senegal-legal-action-fifa-2854562-2026-01-19",
      "headline": "AFCON: Morocco threaten to take legal action against Senegal after final fiasco Morocco Football Federation has threatened legal action against Senegal after Sunday's fiasco in the AFCON final. The game between the two teams saw incredible chaos as Senegal threatened to walk out of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marc-guehi-joins-manchester-city-30-million-transfer-defensive-strength-2854558-2026-01-19",
      "headline": "Manchester City sign Marc Guehi from Palace, defender explains reason for moveManchester City has completed the transfer of England international Marc Guehi from Crystal Palace, with the 25-year-old defender joining the Premier League champions on a long-term contract after extensive negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gaurav-sawant-reports-icc-issues-ultimatum-to-bangladesh-over-world-cup-participation-in-india-ytvd-2854548-2026-01-19",
      "headline": "Gaurav Sawant Reports: ICC Issues Ultimatum to Bangladesh Over World Cup Participation in IndiaOn this Special Report, host Gaurav Sawant examines the escalating tension between the International Cricket Council (ICC) and the Bangladesh Cricket Board (BCB). The discussion centers on Bangladesh's hesitation to play World Cup matches in India, citing security concerns following the return of player Mustafizur Rahman. Gaurav Sawant notes, 'So the ICC has read the riot act to Bangladesh,' highlighting the ultimatum that the team must either participate or be replaced by Scotland. The panel, featuring sports editors Vikrant Gupta and Nikhil Naaz, explores whether these concerns are genuine or politically motivated by Bangladesh's interim government. Major Mohammad Ashraful Zaman defends the BCB's stance as a 'genuine concern' rather than politics, while other analysts suggest a potential 'logjam' that could split the cricketing world. The programme delves into the diplomatic friction and the potential long-term impact on bilateral cricket relations between India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-3-order-of-play-january-20-2854516-2026-01-19",
      "headline": "Australian Open 2026, Day 3 order of play: Defending champions Sinner, Keys in actionDefending champions Jannik Sinner and Madison Keys will be in action as the Australian Open 2026 rolls on to Day 3 on Tuesday, January 20. Naomi Osaka and Ben Shelton will also start their campaigns in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-gautam-gambhir-india-lose-odi-series-new-zealand-2854529-2026-01-19",
      "headline": "Did Ajinkya Rahane blame Gautam Gambhir for ODI series loss to New Zealand?Former India captain Ajinkya Rahane questioned the Gautam Gambhir-led team management for making frequent changes after the home ODI series loss to New Zealand, stressing the need for clarity and a settled XI ahead of the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-organiser-shatadru-dutta-2854505-2026-01-19",
      "headline": "Arrested for GOAT tour mismanagement, organiser Satadru gets bail after 37 daysLionel Messi's GOAT tour organiser, Satadru Dutta, was granted bail after 37 days in custody. Dutta was jailed after chaos broke out at the Salt Lake Stadium during Messi's event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-100th-match-win-reaction-2854494-2026-01-19",
      "headline": "Djokovic begins 25th Grand Slam quest with milestone 100th Australian Open victoryNovak Djokovic kick-started his quest for a record 25th Grand Slam title by registering his 100th career win at the Australian Open. The Serb defeated Spain's Pedro Martinez in straight sets in the opening round in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-olympics-batting-t20-world-cup-bbl-2854466-2026-01-19",
      "headline": "Steve Smith accepts T20 World Cup fate, targets LA Olympics 2028Australia's Steve Smith might have been snubbed from the T20 World Cup squad, but the 36-year-old is not ready to retire from the format yet. Smith has revealed that he wants to play in the LA Olympics, set to be played in 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-retirement-age-simon-doull-2854454-2026-01-19",
      "headline": "Virat Kohli still the fittest, he can play ODIs until he is 45: Simon DoullIndia vs New Zealand: Former New Zealand fast bowler Simon Doull said Virat Kohli has it in him to continue until the age of 45, noting that the India great remains one of the fittest cricketers around. Kohli has scored more than 600 runs in nine matches since returning to action in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priscilla-hon-advances-australian-open-second-round-opponent-retires-cramps-2854434-2026-01-19",
      "headline": "Pure class: Hon helps injured opponent Stakusic get off court in wheelchairPriscilla Hon showed pure class as she helped her opponent Marina Stakusic leave the court in a wheelchair after getting injured and being forced to retire from their first round clash on Monday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-slams-bcci-silence-after-gautam-gambhirs-india-loses-historic-odi-series-to-new-zealand-ytvd-2854450-2026-01-19",
      "headline": "Nikhil Naz Slams BCCI Silence After Gautam Gambhir's India Loses Historic ODI Series To New ZealandOn this India Today special report, sports journalist Nikhil Naz analyses the crisis in Indian cricket following a historic ODI series defeat against New Zealand. For the first time since 1988, New Zealand has secured a bilateral ODI series win on Indian soil, also marking India's first ever defeat at Indore's Holkar Stadium. Naz highlights that 'it definitely is a Gambhir situation', pointing to the turbulent tenure of head coach Gautam Gambhir, under whom India has now lost three ODI series. The discussion shifts to the perceived inaction of the Board of Control for Cricket in India (BCCI). Naz criticises the board for failing to hold review meetings or address systemic issues, contrasting their silence with the proactive approach of the English Cricket Board. The report questions whether the management and selectors are being held accountable for the team's declining performance across formats ahead of the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/icc-issues-ultimatum-to-bangladesh-over-t20-world-cup-participation-in-india-ytvd-2854447-2026-01-19",
      "headline": "ICC Issues Ultimatum To Bangladesh Over T20 World Cup Participation In IndiaThis report examines the escalating crisis surrounding the ICC Men's T20 World Cup 2026 as Bangladesh faces a potential exit from the tournament. The International Cricket Council (ICC) has reportedly issued a firm ultimatum, stating 'you let us know by Wednesday' if a solution can be reached regarding their participation in India. Bangladesh has expressed reluctance to travel to India, requesting a move to neutral venues or a group swap, both of which the ICC has rejected. The programme highlights that Scotland is on standby as a replacement team. Furthermore, the situation has 'snowballed' with reports that Pakistan may also review its participation if Bangladesh is removed. This marks a historic tension where a team faces complete removal rather than just forfeiting points for individual matches, threatening the integrity of the upcoming global event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/sonal-mehrotra-kapoor-on-how-pollution-is-shattering-indias-khelo-india-dream-ytvd-2854438-2026-01-19",
      "headline": "Nikhil Naz Discusses Impact Of Delhi's Toxic Air On India's Global Sporting ImageOn this Special Report, Sonal Mehrotra Kapoor and Nikhil Naz discuss the alarming impact of air pollution on India's status as a global sporting hub. The discussion follows reports of Danish shuttler Mia Blichfeldt withdrawing from the India Open and paying a heavy fine to avoid Delhi's toxic air. Indian chess grandmaster Vidit Gujrathi is also quoted, stating that 'People are slowly being poisoned in Delhi and nobody seems to care.' The programme highlights how environmental conditions and poor hygiene at venues are deterring international athletes and affecting the training of budding domestic sportspersons. Nikhil Naz points out that while international players voice concerns, Indian athletes often remain silent due to fear of social media trolling or administrative backlash. The report raises critical questions about India's preparedness for major upcoming events like the World Championships and the Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-squad-updates-cummins-out-opener-hazlewood-optimistic-tim-david-fit-2854363-2026-01-19",
      "headline": "Australia to do a Travis Head with Cummins at T20 World Cup? Bailey respondsAustralia's chief selector, George Bailey, has confirmed Pat Cummins will miss the T20 World Cup opener, while Tim David is expected to be fit despite a minor injury setback. Updates on Josh Hazlewood and squad selection deadlines were also provided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-australian-open-win-challenge-carlos-alcaraz-jannik-sinner-2854367-2026-01-19",
      "headline": "Medvedev says he can beat SinCaraz after winning first Grand Slam match in a yearFormer world No.1 Daniil Medvedev believes he can still take down Carlos Alcaraz and Jannik Sinner after ending a 370-day drought for a Grand Slam victory at the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/malinda-pushpakumara-becomes-fourth-sri-lankan-to-take-1000-first-class-wickets-2854262-2026-01-19",
      "headline": "Malinda Pushpakumara becomes fourth Sri Lankan to take 1,000 first-class wicketsMalinda Pushpakumara entered an exclusive club on Wednesday by becoming only the fourth Sri Lankan cricketer to claim 1,000 wickets in first-class cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-stanislas-wawrinka-marin-cilic-2854264-2026-01-19",
      "headline": "Fire still burning for Stan Wawrinka, Daniil Medvedev ends year-long waitAustralian Open 2026: Former champion Stan Wawrinka recovered from a set down to beat Laslo Djere and book his place in the second round. Daniil Medvedev ended a year's wait for a first-round win at a Grand Slam while 37-year-old Marin Cilic power through to the second round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-on-icc-ultimatum-to-bangladesh-over-india-hosted-t20-world-cup-ytvd-2854242-2026-01-19",
      "headline": "Nikhil Naz On ICC Ultimatum To Bangladesh Over India-Hosted T20 World CupOn this Special Report, sports editor Nikhil Naz discusses the escalating tension between the International Cricket Council (ICC) and the Bangladesh Cricket Board (BCB). The ICC has issued a firm ultimatum to Bangladesh, demanding confirmation by Wednesday, January 21, regarding their participation in the T20 World Cup hosted by India. Nikhil Naz notes, 'If you do not confirm your participation, then we will be forced to replace you with another team based on rankings.' The standoff follows the BCB's refusal to travel to India citing security concerns, a situation triggered after the BCCI reportedly requested an IPL franchise to drop Mustafizur Ahmed. While Bangladesh has proposed moving their matches to Sri Lanka or adopting a hybrid model, the ICC has rejected these alternatives. If Bangladesh fails to comply by the deadline, they risk being replaced by Scotland, marking an unprecedented logjam in international cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-odi-daryl-mitchell-explains-plan-to-attack-kuldeep-yadav-2854221-2026-01-19",
      "headline": "Targeting Kuldeep Yadav was part of New Zealand's plan, reveals Daryl MitchellNew Zealand's Indore ODI hero Daryl Mitchell revealed that going after \"world-class\" spinner Kuldeep Yadav from ball one was a planned move, aimed at preventing the wrist-spinner from settling into a match-controlling rhythm."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}