{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-how-indias-wealth-shifted-to-the-pockets-of-top-1-per-cent-2662386-2025-01-09",
      "headline": "Budget 2025: How India's wealth shifted to the pockets of top 1%About 11.4 per cent of India's total wealth was in the hands of the people in the bottom 50 per cent bracket in the year 1961, this nearly halved to 6.5 per cent in the year 2023, according to the World Inequality Database. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/national-savings-certificate-know-the-latest-rate-and-tax-benefits-under-section-80c-2662355-2025-01-09",
      "headline": "National Savings Certificate: Know the latest rate and tax benefitsNSCs are government-backed investments that provide attractive interest rates, tax benefits, and a five-year maturity, making them ideal for risk-averse investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-provident-fund-ppf-2025-benefits-interest-rates-and-other-details-2662329-2025-01-09",
      "headline": "PPF 2025: Benefits, interest rates, and other details PPF is a secure, tax-free savings option ideal for risk-averse investors seeking long-term financial growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-prepares-for-200000-job-cuts-as-artificial-intelligence-takes-over-report-2662298-2025-01-09",
      "headline": "Wall Street prepares for 200,000 job cuts as AI takes over: ReportAI's rise may cost 200,000 Wall Street jobs, boosting efficiency, profits, and reshaping roles in finance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-fy25-dividend-financial-results-it-giant-announces-special-dividend-rs-66-check-details-2662285-2025-01-09",
      "headline": " TCS Q3 FY25 results: IT giant announces special dividend. Check detailsThe TCS Board of Directors declared a third interim dividend of Rs 10 per equity share and a special dividend for Q3 FY25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-results-profit-rises-12-to-rs-12380-crore-announces-special-dividend-2662274-2025-01-09",
      "headline": "TCS Q3 Results: Profit rises 12% to Rs 12,380 crore; special dividend announcedTCS Q3 results: TCS's revenue for the quarter stood at Rs 63,973 crore, marking a 5.6% YoY increase (4.5% in constant currency). The operating margin was 24.5%, reflecting a YoY decline of 50 basis points but a sequential improvement of 40 basis points. The net margin for the quarter was 19.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-500-points-lower-nifty-falls-reasons-behind-market-volatility-today-2662255-2025-01-09",
      "headline": "Sensex closes 500 points lower: Key reasons behind market volatility todayThe S&P BSE Sensex tanked 528.28 points to close at 77,620.21, while the NSE Nifty50 lost 162.45 points to end at 23,526.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-women-taxpayers-can-expect-tax-relief-credit-access-housing-loans-education-loans-2662245-2025-01-09",
      "headline": "Budget 2025: What women taxpayers can expectWomen taxpayers hope the Union Budget 2025 will offer tax relief, credit access, and support for education, entrepreneurship, and retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-cash-transactions-may-trigger-100-percent-penalties-details-here-2662158-2025-01-09",
      "headline": "These cash transactions may trigger 100% penalties. Details hereThe Income Tax Department warns against excessive cash transactions, as violations can lead to heavy penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-leads-india-payments-from-disruption-to-monetisation-bernstein-2662157-2025-01-09",
      "headline": "Paytm leads India payments from disruption to monetisation: BernsteinBernstein's analysis underscores Paytm's potential for sustainable growth and profitability, citing key drivers of its success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-results-today-check-revenue-projection-dividend-key-expectations-2662148-2025-01-09",
      "headline": "TCS Q3 results today: Check revenue projection, dividend, key expectationsTCS Q3 results: Investor attention is likely to centre on TCS's commentary regarding client budgets and demand outlook for 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-long-can-you-stare-at-your-wife-lt-chairman-sn-subrahmanyan-wants-employees-to-work-on-sunday-2662134-2025-01-09",
      "headline": "'How long can you stare at wife?' L&T chief wants employees to work on SundaysL&T chairman SN Subrahmanyan's call for a 90-hour work week has reignited the work-life balance debate, adding to the uproar sparked by Narayana Murthy's 70-hour work week suggestion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-interest-fds-for-super-senior-citizens-check-sbi-pnb-rbl-indian-bank-union-bank-2662124-2025-01-09",
      "headline": "High-interest FDs for super senior citizens: Check SBI, PNB, RBL and more Banks like SBI, PNB, RBL, Indian Bank, and Union Bank are offering enhanced returns to help them secure a financially stable future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-donald-trump-wants-to-purchase-greenland-regain-control-of-panama-canal-2662081-2025-01-09",
      "headline": "Donald Trump wants Greenland: Here's what the island might costGreenland, a resource-rich Arctic gem, remains an ambitious dream amidst Trump's territorial aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capital-infra-trust-invit-ipo-check-latest-gmp-subscription-status-on-day-3-stmp-2662079-2025-01-09",
      "headline": "Capital Infra Trust InvIT IPO: Check latest GMP, subscription status on Day 3Capital Infra Trust InvIT IPO: The grey market premium (GMP) for the Capital Infra Trust InvIT IPO stood at Rs 0 on Thursday, indicating that the units were trading at their issue price of Rs 100 without any premium or discount in the grey market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-interim-dividend-q3-fy-2025-record-date-historical-payouts-details-expectations-financial-results-2662055-2025-01-09",
      "headline": "TCS to declare interim dividend today: Know record date and past dividendsTCS has already declared dividends totalling Rs 20 per share for FY25, with Rs 10 each announced in the first and second quarters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/srf-navin-fluorine-stock-price-jumps-nearly-14-percent-today-key-factors-explained-stmp-2662048-2025-01-09",
      "headline": "Explained: Why SRF and Navin Fluorine share price surged up to 14% todaySRF and Navin Fluorine stock price today: SRF Ltd's shares soared by 13.8% to a day's high of Rs 2,678.95 on the BSE in early trade, while Navin Fluorine International's shares surged 13.9% to Rs 3,974.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-down-today-sensex-nifty-fall-q3-results-tcs-volatility-on-dalal-street-2662039-2025-01-09",
      "headline": "Sensex falls 500 points, Nifty tumbles: Why is the stock market down today?Stock market today: Around 11:05 am, Sensex was trading 448.21 points lower at 77,700.28 and Nifty was down 142.85 points to 23,546.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quadrant-future-tek-ipo-closes-today-should-you-subscribe-latest-gmp-subscription-day-3-allotment-listing-date-2662038-2025-01-09",
      "headline": "Quadrant Future Tek IPO closes today: Should you subscribe? Check latest GMPQuadrant Future Tek IPO GMP: Quadrant Future Tek IPO (initial public offering) is a completely fresh equity issue of 1 crore shares. Investors can bid for the public issue at a price band of Rs 275-290 per share, with a minimum lot size of 50 shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wef-report-jobs-2030-do-you-need-to-learn-ai-check-fastest-growing-and-declining-jobs-2662030-2025-01-09",
      "headline": "Jobs in 2030: Do you need to learn AI? Check fastest growing and declining jobs The report examines the macro trends that will affect jobs, skills, and workforce transformation between 2025 and 2030."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chimney-collapse-under-construction-plant-chhattisgarh-dead-injured-2662340-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "One dead, many trapped as silo collapses at Chhattisgarh plantThe silo at the smelting plant collapsed on Thursday, trapping at least 25 workers under the debris. Rescue efforts are underway, with heavy machinery and manual labour being used to clear the debris and locate survivors. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-criticises-lt-chairmans-call-for-daily-work-commitment-calls-it-shocking-2662400-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shocking: Deepika Padukone slams L&T chairman's call for working SundaysDeepika Padukone has expressed her disapproval of L&T Chairman's suggestion that employees should work seven days a week. She found the idea shocking and unfeasible."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/caught-on-cctv-pune-man-kills-it-colleague-at-parking-lot-over-financial-dispute-2662213-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman stabbed by colleague at parking lot over financial dispute in PuneThe 28-year-old woman was stabbed by her colleague in the parking lot of their office. She succumbed to her injuries while undergoing treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/fancy-cars-alcohol-white-girls-uk-grooming-gang-rape-sexual-exploitation-pattern-explained-2662193-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fancy cars, drugs, white girls: Pattern of UK grooming gangs explained in 5 pointsCases of sexual exploitation by grooming gangs in the UK have been going on for decades now, and were recently highlighted by Tesla boss Elon Musk to attack UK Prime Minister Keir Starmer. There was an unmistakable pattern of how girls as young as 11 were trapped and exploited by older men of the grooming gangs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/how-the-michelangelo-phenomenon-can-shape-or-break-a-relationship-2662344-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How the Michelangelo Phenomenon can shape or break a relationshipThe Michelangelo Phenomenon is a fascinating psychological concept that likens the dynamic between partners to that of a sculptor and their art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-stampede-andhra-pradesh-chief-minsiter-chandrababu-naidu-suspends-officials-calls-for-improved-crowd-management-2662420-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tirupati stampede: Chandrababu Naidu suspends officials, calls DSP's actions wrongFollowing the stampede at Tirumala, Chief Minister Chandrababu Naidu suspended DSP Ramanakumar and Goshaala Director Harinath Reddy. He also transferred Tirupati SP Subbarayudu and Joint Commissioner Gouthami for lapses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/parents-can-be-legally-compelled-to-offer-education-money-to-daughter-supreme-court-2662478-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parents can be legally compelled to offer education money to daughter: Top courtParents can be compelled to provide necessary funds within their means for their daughter's education, the Supreme Court said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/palisades-wildfire-california-governor-gavin-newsom-shrugs-responsibility-for-empty-fire-hydrants-says-locals-will-figure-it-out-2662391-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Locals will figure out: California Governor shrugs responsibility for dry hydrantsCalifornia Governor Gavin Newsom deflected responsibility for fire hydrants running out of water during the devastating Pacific Palisades fire, saying the \"local folks will figure it out\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pune-entrepreneur-requests-blinkit-ceo-to-start-atm-like-service-sparks-debate-2662443-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pune entrepreneur requests Blinkit CEO to 'start ATM-like service', sparks debateThe suggested service would function like an ATM, enabling users to pay via UPI and receive cash at their doorstep within 10 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-a-sharad-pawar-ajit-reunion-may-be-in-the-works-2662106-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How a Sharad Pawar-Ajit reunion may be in the worksThe Pawar clan and rival NCP factions are making the right noises, but the course of events could rest on the results of local self-government body polls in Maharashtra this year\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/larsen-toubro-chairman-longer-work-hours-sundays-list-of-ceos-narayana-murthy-elon-musk-2662348-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "L&T chief not alone, these Indian CEOs have also batted for longer work hoursThe chairperson of multinational firm Larsen & Toubro advocated for a 90-hour work week, including on Sundays. He is among the growing list of CEOs who have called for longer working hours, first suggested by Infosys co-founder Narayana Murthy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oppo-reno-13-and-reno-13-pro-launched-in-india-pricing-starts-at-rs-37999-2662288-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oppo Reno 13 and Reno 13 Pro launched in India, pricing starts at Rs 37,999Oppo has launched its flagship Reno 13 and Reno 13 Pro smartphones in India, which are also the first ones to launch in India with MediaTek Dimensity 8350 chipset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-pattinson-suki-waterhouse-secretly-reportedly-get-married-intimate-ceremony-2662397-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Robert Pattinson, Suki Waterhouse secretly get married?British actor Robert Pattinson and actor-singer Suki Waterhouse are now reportedly married. The event, attended by close family and friends, remains unconfirmed by the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/ceasefire-in-gaza-hamas-needs-to-make-intelligent-choices-opinion-2662308-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ceasefire in Gaza: Hamas needs to make intelligent choicesThe heavy losses suffered by Iran's proxies, especially Hamas and Hezbollah, have put Iran on the back foot and forced it to recalibrate its regional strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-manoj-tiwary-hypocrite-explosive-interivew-kkr-harshit-rana-nitish-2662325-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gautam Gambhir a hypocrite, says Manoj Tiwary. KKR stars rally behind India coachFormer India batter Manoj Tiwary lashed out at Gautam Gambhir, accusing him of taking undue credit for Kolkata Knight Riders' successes in the IPL, both as captain and mentor, attributing these to effective PR. KKR pacer Harshit and former captain Nitish Rana responded to the comments in strongly worded statements on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/los-angeles-wildfire-is-so-big-that-its-visible-from-space-2662226-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Los Angeles wildfire is so big that it's visible from spaceAn image captured by the Copernicus Sentinel-2 mission vividly illustrates the scale of the disaster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-roorkee-clarifies-after-idly-chutney-no-sambar-mail-sent-to-gate-aspirants-2662460-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Roorkee clarifies after 'idly chutney no sambar' mail sent to GATE aspirantsIIT Roorkee has clarified and apologised for a technical glitch after GATE aspirants received emails addressed as \"Dear IDLI CHUTNEY NO SAMBHAR.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/harsh-goenka-reaction-lt-chief-sn-subrahmanyan-90-hour-work-week-employees-sundays-2662414-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Recipe for burnout: Harsh Goenka after L&T chief advocates 90-hour work weekSN Subrahmanyan's remarks were made during a recent interaction with employees, where he defended L&T's six-day work week policy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/hrithik-roshan-embarrassed-the-roshans-documentary-here-is-why-2662387-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hrithik Roshan was initially embarrassed about family documentary. Here's whyHrithik Roshan addressed his initial embarrassment with The Roshans documentary, highlighting his family's legacy and the inspiration it provided him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/did-anti-maoist-forces-slow-down-to-death-in-bastar-sop-slip-up-under-probe-2662110-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did anti-Maoist forces slow down to death in Bastar? SOP 'slip-up' under probeThe ill-fated District Reserve Guard vehicle had braked to below the mandated speed to negotiate a road bump; a road opening party failed to spot Maoists triggering the IED\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/los-angeles-wildfires-paris-hilton-mandy-moore-evacuate-after-losing-homes-2661991-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adam Brody, Paris Hilton lose homes to Los Angeles wildfires, celebs evacuateWildfires raging in and around Los Angeles have destroyed the homes of several celebrities, including Leighton Meester, Adam Brody and Paris Hilton among others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/oneplus-13-and-iphone-16-selling-at-same-prices-in-india-which-one-to-buy-2662382-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "OnePlus 13 and iPhone 16 selling at same prices in India, which one to buy?The iPhone 16, for instance, is priced at Rs 70,900 on Vijay Sales, making it the closest competitor to the OnePlus 13, with only a Rs 900 difference. Here's a quick comparison between the two to help you decide which one is a better option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hardeep-singh-nijjar-khalistani-terrorist-murder-case-all-four-accused-indians-granted-bail-canadian-court-2662135-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All 4 Indians accused of Hardeep Nijjar's murder granted bail by Canada courtHardeep Nijjar case: The four Indian nationals were arrested in May 2024 for the murder of Khalistani terrorist Hardeep Nijjar. Canada's Justin Trudeau has accused India of being involved in the murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/russia-born-telegram-ceo-pavel-durov-jabs-meta-ceo-mark-zuckerberg-over-free-speech-elon-musk-drops-a-comment-2662289-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia-born Telegram CEO jabs Meta over free speech, Elon Musk drops a commentTelegram CEO Pavel Durov questioned Meta's timing of dropping fact-checkers, saying that the decision may have been politically motivated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-juggles-studies-for-board-exams-during-azaad-shoot-2662482-2025-01-09",
      "headline": "Watch: Rasha Thadani juggles studies for board exams during Azaad shootRasha Thadani, in a viral video, was seen balancing her academic responsibilities with her Bollywood debut preparations, from Azaad's film set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaaved-jaaferi-actors-large-entourage-exclusive-2662467-2025-01-09",
      "headline": "Jaaved Jaaferi on actors having large entourages: It does more harmJaaved Jaaferi discussed the rising trend of large entourages among younger actors, comparing it to the 'ice-box syndrome' from his early days in the industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-raja-saab-actor-nidhhi-agerwal-files-cybercrime-complaint-over-threats-2662451-2025-01-09",
      "headline": "The Raja Saab actor Nidhhi Agerwal files cybercrime complaint over threatsNidhhi Agerwal has filed a complaint with cybercrime authorities due to threatening online comments affecting her mental health. The actor is also set to make a major comeback in Telugu cinema with two upcoming films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/alia-bhatt-enjoys-beach-day-in-swimsuit-rides-jet-ski-in-thailand-2662419-2025-01-09",
      "headline": "Pics: Alia Bhatt enjoys beach day in swimsuit, rides jet ski in ThailandActor Alia Bhatt had a great day by the beach with her sister, Shaheen Bhatt, in Thailand. She posted photos in a black swimsuit, enjoying a jet ski ride."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-ireland-women-pratika-rawal-psychology-2662435-2025-01-09",
      "headline": "How being a psychology student helped Pratika Rawal ace international cricketYoung India batter Pratika Rawal recently opened up on the role her psychology studies played in shaping her cricketing career. Rawal recently made her debut in the three-match ODI series vs West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-saint-germain-kvicha-kvaratskhelia-transfer-news-napoli-january-window-2662398-2025-01-09",
      "headline": "PSG looking to seal Kvicha Kvaratskhelia signing from Napoli in January: Reports Paris Saint-Germain intensify their pursuit of Napoli star Khvicha Kvaratskhelia amid uncertainty over his future. With contract talks stalled, Luis Enrique eyes the Georgian winger as a key addition to bolster PSG's attacking firepower and European ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-hs-prannoy-pre-quarters-defeat-indian-mens-singles-campaign-2662394-2025-01-09",
      "headline": "HS Prannoy out in pre-quarters as Indian men's singles campaign endsMalaysia Open 2025: HS Prannoy lost to higher-ranked Li Shi Feng of China after a valiant battle that lasted an hour and 22 minutes on Thursday. With that defeat, Indian men's singles campaign in the season-opening tournament in Kuala Lumpur came to an early end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-smriti-mandhana-reveals-reason-behind-harmanpreet-and-shafalis-absence-from-india-squad-2662380-2025-01-09",
      "headline": "Captain Smriti Mandhana explains Shafali Verma's absence from India's ODI squadSmriti Mandhana reveals why Harmanpreet Kaur, Shafali Verma, and Renuka Singh are missing from India's ODI squad against Ireland. Backing youngsters, she highlights Shafali's domestic exploits and emphasizes a positive mindset with a balanced squad for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-gilchrist-shares-his-thoughts-on-rohit-sharmas-test-and-odi-future-2662358-2025-01-09",
      "headline": "I don't see Rohit Sharma going to England: Adam Gilchrist on India captain's futureFormer Australia wicketkeeper-batter Adam Gilchrist recently shared his thoughts on India captain Rohit Sharma's future and said that the opening batter will not go to England later this year for the Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/juventus-priority-signing-ronald-araujo-fc-barcelona-january-transfer-window-arsenal-2662349-2025-01-09",
      "headline": "Juventus pushing to sign Barcelona's Araujo as priority defender: ReportsJuventus is targeting Barcelona's defensive star Ronald Araújo as a priority signing for January, but Arsenal's interest could spark a fierce battle. With contract talks stalled, Barcelona faces a tough decision on their prized centre-back's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-podcast-bgt-rohit-sharma-virat-kohli-future-gautam-gambhir-2662335-2025-01-09",
      "headline": "BGT gone: Should Rohit Sharma and Virat Kohli be part of India's Test future?India surrendered the Border-Gavaskar Trophy after seven years following a disappointing campaign that concluded in Sydney. The team unravelled after their loss in Melbourne, and Jasprit Bumrah's absence denied them the opportunity to push for a series-levelling win in Sydney. Is it fair to point fingers at individuals? Or is this a collective failure of the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-ireland-women-squads-schedule-live-streaming-smriti-mandhana-2661682-2025-01-09",
      "headline": "India Women vs Ireland Women ODI series: Squads, all you need to knowIND-W vs IRE-W: Smriti Mandhana's India and Gaby Lewis' Ireland will be up against each other in the upcoming three-match ODI series, starting January 10 at the Saurashtra Cricket Association Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-manoj-tiwary-hypocrite-explosive-interivew-kkr-harshit-rana-nitish-2662325-2025-01-09",
      "headline": "Gautam Gambhir a hypocrite, says Manoj Tiwary. KKR stars rally behind India coachFormer India batter Manoj Tiwary lashed out at Gautam Gambhir, accusing him of taking undue credit for Kolkata Knight Riders' successes in the IPL, both as captain and mentor, attributing these to effective PR. KKR pacer Harshit and former captain Nitish Rana responded to the comments in strongly worded statements on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-smashes-six-fours-in-an-over-against-rajasthans-aman-shekhawat-in-vijay-hazare-trophy-2662317-2025-01-09",
      "headline": "Watch: N Jagadeesan smashes 6 consecutive fours in an over in Vijay Hazare TrophyTamil Nadu opener Narayan Jagadeesan smashed six fours in an over against Rajasthan's Aman Shekhawat during the pre-quarterfinal game of Vijay Hazare Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shikhar-dhawan-shares-hilarious-instagram-reel-with-father-2662297-2025-01-09",
      "headline": "Watch: Shikhar Dhawan shares hilarious Instagram reel with fatherShikhar Dhawan's hilarious Instagram reel featuring a witty exchange with his father has gone viral. The playful banter and Dhawan's cheeky caption have left fans in splits, showcasing the cricketer's charm both on and off the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-podcast-bgt-rohit-sharma-virat-kohli-future-gautam-gambhir-2662335-2025-01-09",
      "headline": "BGT gone: Should Rohit Sharma and Virat Kohli be part of India's Test future?India surrendered the Border-Gavaskar Trophy after seven years following a disappointing campaign that concluded in Sydney. The team unravelled after their loss in Melbourne, and Jasprit Bumrah's absence denied them the opportunity to push for a series-levelling win in Sydney. Is it fair to point fingers at individuals? Or is this a collective failure of the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-ireland-women-squads-schedule-live-streaming-smriti-mandhana-2661682-2025-01-09",
      "headline": "India Women vs Ireland Women ODI series: Squads, all you need to knowIND-W vs IRE-W: Smriti Mandhana's India and Gaby Lewis' Ireland will be up against each other in the upcoming three-match ODI series, starting January 10 at the Saurashtra Cricket Association Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-manoj-tiwary-hypocrite-explosive-interivew-kkr-harshit-rana-nitish-2662325-2025-01-09",
      "headline": "Gautam Gambhir a hypocrite, says Manoj Tiwary. KKR stars rally behind India coachFormer India batter Manoj Tiwary lashed out at Gautam Gambhir, accusing him of taking undue credit for Kolkata Knight Riders' successes in the IPL, both as captain and mentor, attributing these to effective PR. KKR pacer Harshit and former captain Nitish Rana responded to the comments in strongly worded statements on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-smashes-six-fours-in-an-over-against-rajasthans-aman-shekhawat-in-vijay-hazare-trophy-2662317-2025-01-09",
      "headline": "Watch: N Jagadeesan smashes 6 consecutive fours in an over in Vijay Hazare TrophyTamil Nadu opener Narayan Jagadeesan smashed six fours in an over against Rajasthan's Aman Shekhawat during the pre-quarterfinal game of Vijay Hazare Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shikhar-dhawan-shares-hilarious-instagram-reel-with-father-2662297-2025-01-09",
      "headline": "Watch: Shikhar Dhawan shares hilarious Instagram reel with fatherShikhar Dhawan's hilarious Instagram reel featuring a witty exchange with his father has gone viral. The playful banter and Dhawan's cheeky caption have left fans in splits, showcasing the cricketer's charm both on and off the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-clarke-on-virat-kohlis-test-retirement-and-comparison-with-sachin-tendulkar-2662277-2025-01-09",
      "headline": "If Virat Kohli retires from Tests, India will lose big: Clarke backs star batterFormer Australia cricketer Michael Clarke feels if star Inia batter Virat Kohli retires from Test cricket, it will only be India's loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-abhijeet-tomar-rajasthan-batter-scores-ton-vs-tamil-nadu-in-vijay-hazare-trophy-2662264-2025-01-09",
      "headline": "Who Is Abhijeet Tomar? Rajasthan batter scores ton vs Tamil Nadu in Vijay HazareAbhijeet Tomar's stunning 111 off 125 balls powered Rajasthan to a competitive 267 in the Vijay Hazare Trophy pre-quarterfinal. His explosive century, marked by 12 fours and a six, showcased his resilience and set a strong platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-hopeful-cameron-green-will-play-world-test-championship-final-2662242-2025-01-09",
      "headline": "Australia 'hopeful' Cameron Green will play World Test Championship final Australian selector George Bailey hopes to have Cameron Green available for the World Test Championship final while preparing for him to return as a batter only.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-work-on-his-fitness-virat-kohli-will-know-what-to-do-navjot-singh-sidhu-2662223-2025-01-09",
      "headline": "Rohit just needs to work on his fitness. Kohli will know what to do: SidhuNavjot Singh Sidhu defends Rohit Sharma and Virat Kohli, urging patience amid criticism of their recent form. The cricketing stalwarts face pressure to deliver as India gears up for the Champions Trophy, with their resilience set to be tested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-stadium-rennovation-india-practice-game-dubai-2662192-2025-01-09",
      "headline": "India's practice game in Dubai, ICC monitors stadium renovation in PakistanChampions Trophy 2025: The International Cricket Council is working towards finalising the practice facilities and the venues for the warm-up matches. The ICC delegation is keeping a close eye on the renovation work at the three venues in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-transfer-news-january-window-real-madrid-trent-alexander-arnold-barcelona-johnathan-tah-2662155-2025-01-09",
      "headline": "LaLiga: 6 possible January transfer deals ft Real Madrid, BarcelonaLa Liga's January transfer window promises thrilling twists as top clubs, including Real Madrid, Barcelona, and Atletico Madrid, explore significant reinforcements. With financial struggles and strategic needs, fans anticipate high-profile moves and unexpected surprises shaping the league's second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-champions-trophy-squad-selection-vijay-hazare-tamil-nadu-vs-rajasthan-2662170-2025-01-09",
      "headline": "Varun Chakravarthy for Champions Trophy? Spinner dominates Vijay Hazare chartsVijay Hazare Trophy 2025: Varun Chakravarthy continued to impress, picking up a five-wicket haul for Tamil Nadu in their pre-quarterfinal against Rajasthan on January 9. Varun is the leading wicket-taker in the tournament with 18 wickets in six matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/west-ham-united-graham-potter-manager-sacking-julen-lopetegui-2662156-2025-01-09",
      "headline": "West Ham appoint Graham Potter as manager after sacking Julen LopeteguiGraham Potter has been appointed as the new manager of West Ham United, replacing Julen Lopetegui, who was sacked by the Premier League club on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-stadium-rennovation-india-practice-game-dubai-2662192-2025-01-09",
      "headline": "India's practice game in Dubai, ICC monitors stadium renovation in PakistanChampions Trophy 2025: The International Cricket Council is working towards finalising the practice facilities and the venues for the warm-up matches. The ICC delegation is keeping a close eye on the renovation work at the three venues in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-transfer-news-january-window-real-madrid-trent-alexander-arnold-barcelona-johnathan-tah-2662155-2025-01-09",
      "headline": "LaLiga: 6 possible January transfer deals ft Real Madrid, BarcelonaLa Liga's January transfer window promises thrilling twists as top clubs, including Real Madrid, Barcelona, and Atletico Madrid, explore significant reinforcements. With financial struggles and strategic needs, fans anticipate high-profile moves and unexpected surprises shaping the league's second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-champions-trophy-squad-selection-vijay-hazare-tamil-nadu-vs-rajasthan-2662170-2025-01-09",
      "headline": "Varun Chakravarthy for Champions Trophy? Spinner dominates Vijay Hazare chartsVijay Hazare Trophy 2025: Varun Chakravarthy continued to impress, picking up a five-wicket haul for Tamil Nadu in their pre-quarterfinal against Rajasthan on January 9. Varun is the leading wicket-taker in the tournament with 18 wickets in six matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/west-ham-united-graham-potter-manager-sacking-julen-lopetegui-2662156-2025-01-09",
      "headline": "West Ham appoint Graham Potter as manager after sacking Julen LopeteguiGraham Potter has been appointed as the new manager of West Ham United, replacing Julen Lopetegui, who was sacked by the Premier League club on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-deco-hits-back-athletic-club-president-ugly-spat-dani-olmo-registration-2662133-2025-01-09",
      "headline": "Barcelona's Deco hits out at Athletic Club chief for 'ugly' comment on OlmoBarcelona Sporting Director Deco hit back at Athletic Club President Jon Uriarte's criticism of Dani Olmo's registration saga, defending the club's actions amidst growing tensions over LaLiga's financial rules and the CSD's controversial intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-champions-trophy-vijay-hazare-trophy-knockout-bengal-2662131-2025-01-09",
      "headline": "Ahead of Champions Trophy squad selection, Shami shines in VHT knockoutSenior Indian pacer Mohammed Shami showcased his class with an impressive three-wicket haul in Bengal's Vijay Hazare Trophy knockout game against Haryana. Shami is eyeing a comeback for the upcoming white-ball series against England and the 2024 Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-olympics-2036-ahmedabad-hub-muti-city-hosts-cricket-hockey-2662129-2025-01-09",
      "headline": "Ahmedabad set to be 2036 Olympics hotspot as India considers multi-city GamesWhile Ahmedabad is set to be the hub of the Olympics if India wins the bid to host the 2036 Games, talks are ongoing to have multiple cities as hosts. India is bidding to host the biggest sporting spectacle for the first time in history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/young-newcastle-fan-spotted-tv-school-notice-unauthorised-absence-2662065-2025-01-09",
      "headline": "Young Newcastle fan spotted on TV, school sends notice for unauthorised absenceA young Newcastle United fan named Sammy became the talk of social media after being caught celebrating his team's historic win over Arsenal on live TV, having missed school for the match. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}