{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-and-reliance-jio-bp-partner-to-expand-fuel-access-across-india-2746044-2025-06-25",
      "headline": "Adani Total Gas and Jio-bp partner to expand fuel access across IndiaThis collaboration will see Jio-bp's premium petrol and diesel sold at select Adani fuel outlets, according to ATGL's statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-700-points-higher-nifty-above-25200-titan-up-4-mahindra-infosys-2746018-2025-06-25",
      "headline": "Sensex closes 700 points higher, Nifty above 25,200, Titan up 4%The S&P BSE Sensex added 700.40 points to end at 82,755.51, while the NSE Nifty50 gained 200.40 points to close at 25,244.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/jewellery-vs-gold-etfs-how-to-make-make-money-shine-not-just-wrists-explains-ca-2745981-2025-06-25",
      "headline": "Jewellery vs gold ETFs: How to make make money shine, not just wrists, explains CAGold jewellery may look beautiful, but it often comes with hidden costs, resale hassles, and emotional attachment that cloud financial judgement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-house-real-estate-most-affordable-houses-pune-ahmedabad-knight-frank-report-affordability-index-2745971-2025-06-25",
      "headline": "Planning to buy a house? This is India's most affordable city in 2025A report from Knight Frank India's latest Affordability Index highlights that RBI's decision to cut the repo rate by 100 basis points since February 2025 has played a key role in improving housing affordability across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-sip-success-do-this-every-month-says-stock-market-expert-rajnish-mehan-2745946-2025-06-25",
      "headline": "Want SIP success? Do this every month, says stock market expertSIP calculators do a fine job of showing projections. However, they don't account for emotions, self-doubt, or the unpredictability of life, mentioned a stock market expert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-56th-what-to-expect-rationalisation-tax-forms-appellate-tribunal-nirmala-sitharaman-cess-2745915-2025-06-25",
      "headline": "GST Council meeting: What to expect from upcoming meet?The previous GST Council meeting took place on December 21, 2024, in Jaisalmer. Since then, many matters have remained pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8-key-documents-you-must-keep-ready-before-filing-your-itr-for-fy-2024-25-2745875-2025-06-25",
      "headline": "8 key documents you must keep ready before filing your ITR for FY 2024–25One of the first documents you'll need is Form 16, which your employer gives you. It shows your total salary, how much tax was deducted, and what deductions were claimed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-raises-auto-settlement-limit-to-rs-5-lakh-for-faster-fund-access-2745819-2025-06-25",
      "headline": "EPFO raises auto-settlement limit to Rs 5 lakh for faster fund accessIn the fiscal year 2024-25, the EPFO processed a record 2.34 crore advance claims through the auto-settlement process, marking a 161% increase compared to the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-up-why-reason-iran-israel-ceasefire-stock-market-today-bse-nse-trading-2745804-2025-06-25",
      "headline": "Sensex jumps 700 points: Why is the stock market rising today? The S&P BSE Sensex jumped 722.55 points to 82,777.66, while the NSE Nifty50 added 209.15 points to 25,253.50 as of 2:25 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/hdb-financial-ipo-opening-today-subscribe-skip-biggest-ipo-2025-latest-gmp-details-price-band-2745787-2025-06-25",
      "headline": "HDB Financial opens today: Should you subscribe to the biggest IPO of 2025?HDB Financial IPO: The public listing consists of a fresh issue of 3.38 crore shares worth Rs 2,500 crore, and an offer-for-sale (OFS) of 13.51 crore shares, totalling Rs 10,000 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-325-points-higher-nifty-above-25100-titan-ril-up-2-percent-iran-israel-2745781-2025-06-25",
      "headline": "Sensex, Nifty rally continues for second day as geopolitical fears subsideThe S&P BSE Sensex jumped 442.13 points to 82,497.24, while the NSE Nifty50 added 127.10 points to 25,171.45 as of 9:32 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-25-sensex-nifty-today-trading-setup-bse-nse-trading-hdb-financial-2745771-2025-06-25",
      "headline": "Stock market opening: Sensex, Nifty to open higher? Check key trading levelsA fragile ceasefire between Iran and Israel has helped calm investor nerves and improve market sentiment across Asia and other major regions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-says-daughter-malti-is-a-total-princess-fan-calls-herself-moana-2745948-2025-06-25",
      "headline": "Priyanka Chopra says daughter Malti is a total princess fan, calls herself MoanaPriyanka Chopra revealed that her daughter, Malti, now calls herself \"Malti Marie Moana Chopra Jonas\" because she's obsessed with the Disney character Moana. The three-year-old also loves dressing up in Priyanka's clothes and playing princess games at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/president-droupadi-murmu-meets-sitaare-zameen-par-cast-aamir-khan-partner-gauri-spratt-2746049-2025-06-25",
      "headline": "President Murmu meets Sitaare cast, Aamir Khan and partner Gauri SprattThe entire cast of 'Sitaare Zameen Par' met President Droupadi Murmu for a special screening held at the Rashtrapati Bhavan on Tuesday. They were joined by Aamir Khan and his partner Gauri Spratt. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaideep-ahlawat-ranbir-kapoor-may-not-be-as-big-of-a-star-as-shah-rukh-khan-2745959-2025-06-25",
      "headline": "Jaideep Ahlawat says Ranbir Kapoor may not be as big of a star as Shah Rukh KhanActor Jaideep Ahlawat said Ranbir Kapoor may not be as big of a star as Shah Rukh Khan. However, he attributed King Khan's popularity to his connection with the masses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pedro-pascal-on-grief-mother-suicide-dog-that-saved-his-life-i-am-already-broken-2745996-2025-06-25",
      "headline": "I'm already broken: Pedro Pascal on grief, mother's suicide, dog that saved his lifePedro Pascal opens up in probably the most tell-all interview by him. He reveals his experience of being raised in an immigrant family, losing his mother to an untimely death, and those 'angels' who didn't give up on him when he was still struggling at 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-and-aditya-roy-kapur-turn-foodies-in-bengaluru-2745991-2025-06-25",
      "headline": "Sara Ali Khan, Aditya Roy Kapur turn foodies in Bengaluru with quirky rhyme jamActors Sara Ali Khan and Aditya Roy Kapur enjoyed a South Indian food break in Bengaluru while promoting their film 'Metro…In Dino'. The duo shared a fun video from a local restaurant, where they relished idli, dosa, and more, with a quirky rhyme jam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hombale-films-announce-mahavatar-cinematic-universe-to-start-with-narasimha-in-july-2745976-2025-06-25",
      "headline": "Hombale Films announce Mahavatar Cinematic Universe, to start with Narasimha in JulyThe Mahavatar Cinematic Universe, presented by Hombale Films, known for 'Kantara' and 'KGF', was recently announced, with its first film, 'Mahavatar Narasimha', set to release in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-cautions-about-jurassic-world-rebirth-scariest-in-the-franchise-2745905-2025-06-25",
      "headline": "Scarlett Johansson cautions about Jurassic World Rebirth: Scariest in the franchiseActor Scarlett Johansson described 'Jurassic World Rebirth' as the scariest film in the franchise. She also mentioned that despite the scares, the sci-fi action-thriller has a family-friendly theatrical experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-mammootty-fahadh-faasil-film-mahesh-narayanan-film-title-patriot-2745975-2025-06-25",
      "headline": "Mohanlal confirms title of his upcoming film with Mammootty, Fahadh FaasilThe tentative title of Mohanlal, Mammootty, Fahadh Faasil and Nayanthara's upcoming film with director Mahesh Narayanan is MMMN. In a recent interview, Mohanlal accidentally confirmed the film's title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aap-jaisa-koi-trailer-r-madhavan-fatima-sana-shaikh-in-love-story-defying-patriarchy-2745979-2025-06-25",
      "headline": "Aap Jaisa Koi trailer: R Madhavan-Fatima in a love story defying patriarchyR Madhavan returns in a romantic role in the Netflix film 'Aap Jaisa Koi'. He is joined by Fatima Sana Shaikh in a love story that seems age-appropriate for the two, quirky, and quite heartwarming. Watch the trailer inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-ex-manager-sonal-singh-backs-amid-row-casting-pak-actor-hnaia-aamir-sardaar-ji-3-2745955-2025-06-25",
      "headline": "Diljit Dosanjh's ex-manager backs him amid row over casting Pak actor in Sardaar Ji 3Diljit Dosanjh's former manager, Sonal Singh, came out in support of the Punjabi actor-singer amid backlash for appearing in a film that features Pakistani actor Hania Aamir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-bachchan-first-ever-screen-test-was-with-bipasha-basu-for-refugee-2745923-2025-06-25",
      "headline": "Abhishek Bachchan says his first screen test was with Bipasha for RefugeeAbhishek Bachchan recalled his first screen test with Bipasha Basu for Refugee and shared his fear of auditions despite 25 years in the film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-announces-big-screen-comeback-with-duniyadari-shares-dance-rehearsal-video-2745895-2025-06-25",
      "headline": "Govinda announces big-screen comeback with Duniyadari, shares dance rehearsal videoGovinda is set to return to the big screen with his upcoming film 'Duniyadari'. The actor shared a rehearsal video showcasing his dance moves. The details of the film have been kept under wraps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-visits-sri-sailam-temple-ahead-of-kannappa-release-2745933-2025-06-25",
      "headline": "Vishnu Manchu visits Sri Sailam temple ahead of Kannappa release, says heart is fullActor Vishnu Manchu recently visited the Sri Sailam Mallikarjuna Swamy Temple to seek blessings ahead of 'Kannappa' release. The film is scheduled to hit theatres on June 27. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-rejects-bollywood-says-he-lives-for-music-dont-need-superstar-approval-2745914-2025-06-25",
      "headline": "Diljit's old video rejecting Bollywood goes viral: Don't need superstar's approvalIn a video from his old interview which is now going viral, Diljit Dosanjh expressed his disinterest in working in the Hindi film industry, citing his deep love for music. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-emotional-letter-fan-thanking-him-for-sitaare-zameen-par-2745922-2025-06-25",
      "headline": "Aamir Khan gets emotional fan letter: My brother kept staring at screen with tearsAamir Khan received an emotional letter from a fan who shared his story of watching the film 'Sitaare Zameen Par' in theatres with his family. The fans also thanked the makers for choosing such a sensitive subject and bringing it into mainstream cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/emraan-hashmi-resumes-shooting-pawan-kalyan-og-recovering-dengue-2745881-2025-06-25",
      "headline": "Emraan Hashmi resumes shooting for Pawan Kalyan's OG after recovering from dengueBollywood actor Emraan Hashmi returned to the sets of the Telugu film 'They Call Him OG' after recovering from dengue, which was diagnosed on May 28. Directed by Sujeeth, the film stars Pawan Kalyan in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-cute-moment-of-daughter-malti-marie-watching-her-on-tv-2745845-2025-06-25",
      "headline": "My Mama: Priyanka Chopra shares cute moment of daughter Malti watching her on TVPriyanka Chopra got emotional as her daughter Malti recognised her on TV, sweetly saying, \"my mama.\"  She shared this moment on her Instagram Story. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-sufi-motiwala-clash-over-playing-victim-card-after-the-traitors-2745858-2025-06-25",
      "headline": "Uorfi Javed criticises The Traitors co-star Sufi Motiwala for abusing her sister'The Traitors' contestants Uorfi Javed and Sufi Motiwala have locked horns on social media. While Uorfi called out Sufi for abusing her sister Dolly, Sufi accused her of targeting him on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heads-of-state-first-reviews-priyanka-chopra-shines-with-john-cena-idris-elba-in-action-comedy-2745849-2025-06-25",
      "headline": "Heads of State first reviews: Priyanka Chopra impresses with John Cena, Idris ElbaThe first review of Heads of State praises Priyanka Chopra's incredible performance alongside John Cena and Idris Elba. The film is being hailed as a terrific addition to Bollywood cinema with strong international appeal."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-launches-into-space-india-on-space-station-sortie-2745861-2025-06-25",
      "headline": "Shubhanshu Shukla launches into space, feat by second Indian after 41 yearsBorn in 1985, a year after first Indian astronaut Rakesh Sharma's historic flight, Shubhanshu Shukla grew up not just under the stars — but aiming for them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-nato-summit-israel-iran-war-ceasefire-us-bombing-nuclear-sites-2746061-2025-06-25",
      "headline": "Israel-Iran like kids, had to use strong language: Trump on dropping F-bombIsrael-Iran like kids, had to use strong language: Trump on dropping F-bomb"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-cryptic-post-rift-congress-row-praise-pm-modi-2746035-2025-06-25",
      "headline": "Shashi Tharoor posts cryptic message minutes after taunt from Congress chiefCongress MP Shashi Tharoor shared a cryptic message amid differences with the Congress, minutes after Mallikarjun Kharge took a swipe at him for his repeated praise for Prime Minister Narendra Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-first-words-after-launch-to-space-kamaal-ki-ride-2745885-2025-06-25",
      "headline": "What a ride: Watch Shubhanshu Shukla's message to India en route to spaceAxiom-4 mission: Group Captain Shubhanshu Shukla, the second Indian in space, will spend 14 days aboard the International Space Station, conducting experiments on India's behalf."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-simply-loves-indira-gandhi-1975-national-emergency-50-years-narendra-modi-jana-sangh-janata-party-2745961-2025-06-25",
      "headline": "How Indira gave BJP a lethal weapon even before it was bornFifty years after Indira Gandhi imposed the national Emergency, the BJP continues to use it as proof of Congress's authoritarian past and its own legacy of resistance. From blunting attacks on its intentions to claiming a broader legacy and role, the Emergency remains the BJP's ultimate weapon of choice against the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-10-board-exams-twice-a-year-from-2026-check-full-details-2746039-2025-06-25",
      "headline": "Two CBSE Class 10 board exams from 2026; first in Feb, second in May. Check detailsThe CBSE Class 10 board exams will be held twice a year from 2026 onwards. The first exam which is mandatory will be held in mid-February while the second one will be in May. CBSE has shared full details at a press meet today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/we-are-told-india-threw-out-indira-in-an-electoral-revolt-really-emergency-at-50-2745963-2025-06-25",
      "headline": "We're told India threw out Indira in an electoral revolt. Really?Amidst the flood of \"never again\" proclamations, perhaps Indian society has collectively ignored — or rather avoided asking and trying to honestly answer — a question that would require uncomfortable introspection: What if Indira Gandhi had not lifted the Emergency; a sudden move that surprised even her fierce critics? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trumps-fresh-warning-after-strikes-on-nuke-sites-will-hit-iran-again-if-it-tries-to-restore-nuke-programme-2746001-2025-06-25",
      "headline": "Trump threatens new strikes if Iran rebuilds nuclear programme: They won't enrichUS President Donald Trump warned Iran against trying to rebuild its nuclear programme, saying, 'Iran will not enrich — the last thing they want to do is enrich.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/from-launch-to-docking-shubhanshu-shuklas-ax-4-flight-explained-in-graphics-2738050-2025-06-25",
      "headline": "Shubhanshu Shukla in space: We show you what happens nextIndia's Shubhanshu Shukla, who is the mission pilot, is joined by Commander Peggy Whitson and Mission Specialists Sławosz Uznanski-Wisniewski, and Tibor Kapu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-secret-nuclear-intercontinental-ballistic-missile-india-united-states-2745844-2025-06-25",
      "headline": "Pak working on long-range nuclear ballistic missile that can reach US: ReportA report, quoting US officials, said if Pakistan goes on to acquire an intercontinental ballistic missile, Washington would designate the country as a nuclear adversary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-bihar-voter-list-revision-documents-proof-of-birth-mandatory-new-voters-special-intensive-revision-2745956-2025-06-25",
      "headline": "Why voters in India must give proof of place of birth nowThe Election Commission has launched a Special Intensive Revision (SIR) of electoral rolls, starting with the Bihar polls, to weed out ineligible voters, including illegal immigrants. Those not on the last-conducted 2003 SIR, especially people born before July 1, 1987, must now furnish proof of place and date of birth to be on the voter list."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-british-f35b-stranded-kerala-thiruvananthapuram-airport-hydraulic-failure-10-days-olx-fake-fighter-jet-sale-2745548-2025-06-25",
      "headline": "Why UK's lethal F-35 jet, worth $110 million, is stranded in Kerala for 10 daysSince June 14, a $110-million British F-35B stealth jet has remained grounded at Kerala's Thiruvananthapuram airport after an emergency landing. Ten days on, with failed repair attempts, the jet remains in the monsoon-drenched tarmac. What will it take to get the F-35 to get it airborne?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-new-york-declares-mayoral-primary-win-andrew-cuomo-democratic-history-nelson-mandela-2745968-2025-06-25",
      "headline": "My friends, it's done: Zohran Mamdani declares win in New York mayoral primaryAddressing a cheering crowd, the grinning Indian-origin Zohran Mamdani, 33, invoked Nelson Mandela as he declared victory in the New York City Democratic mayoral primary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-faces-flak-for-response-to-rishabh-pants-twin-centuries-2746036-2025-06-25",
      "headline": "Gambhir faces flak for response to Rishabh Pant's twin centuries in Leeds TestIndia head coach Gautam Gambhir faced flak for his response to a question regarding Rishabh Pant in the post-match press conference after India's loss to England in the first test at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/axiom-4-mission-backup-pilot-prashanth-nair-on-shubhanshu-shukla-2745814-2025-06-25",
      "headline": "He's got that drive: Backup Axiom pilot Prashanth Nair on Shubhanshu ShuklaIndian Air Force pilot and Axiom Mission-4 backup astronaut Prashanth Nair shares his insights on Shubhanshu Shukla's journey to becoming India's second astronaut to go into space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mark-zuckerberg-betting-big-on-ai-talent-offering-rs-860-crore-salary-to-attract-top-minds-2745910-2025-06-25",
      "headline": "Mark Zuckerberg betting big on AI talent, offering Rs 860 crore salaryAccording to a report from WSJ, Mark Zuckerberg has been directly messaging top researchers, developers, and entrepreneurs across the world, offering them huge salary packages of up to $100 million, which is about Rs 860 crore when converted to Indian currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Live: Iran demands compensation from US over damaged nuclear facilitiesIsrael-Iran War News Live: The hostilities between Israel and Iran continued as Tel Aviv has now alleged that Tehran has violated the ceasefire, which both parties agreed upon earlier on Tuesday. The IDF said that Iran launched two ballistic missiles hours after the ceasefire deal. However, Iran denied the allegations of disrespecting the truce. Earlier too, Israel claimed that Iran launched continuous missile attacks despite US President Donald Trump announcing that the two countries had reached a ceasefire agreement early on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/muslim-man-allegedly-assaulted-forced-to-chant-jai-shri-ram-bengaluru-2746043-2025-06-25",
      "headline": "Muslim man assaulted, forced to chant 'Jai Shri Ram' in BengaluruA Muslim man in Bengaluru was allegedly assaulted and forced to chant \"Jai Shri Ram\" by unidentified individuals. Police have registered a case and launched a probe, but no arrests have been made."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-officer-major-moiz-abbas-shah-who-captured-abhinandan-varthaman-in-2019-killed-in-taliban-clash-2745846-2025-06-25",
      "headline": "Pak officer who captured Abhinandan Varthaman in 2019 killed in Taliban clashPakistani Major Moiz Abbas Shah, who was involved in the 2019 capture of Indian pilot Abhinandan Varthaman, was one of two personnel killed in a clash with Tehreek-e-Taliban Pakistan (TTP) terrorists in the Khyber Pakhtunkhwa region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-gesture-left-diljit-dosanjh-emotional-met-gala-2025-2745873-2025-06-25",
      "headline": "Priyanka's gesture left Diljit emotional at Met Gala 2025. Here's what she didSinger Diljit Dosanjh recently opened up about his experience at Met Gala 2025. He recalled a sweet gesture from Priyanka Chopra that left him emotional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-says-no-to-vladimir-putin-iran-offer-i-need-help-with-you-instead-watch-2745984-2025-06-25",
      "headline": "Trump says no to Putin's Iran offer: I need help with you instead. WatchUS President Donald Trump on Tuesday claimed that his Russian counterpart, Vladimir Putin, had offered to help him with Iran. However, Trump revealed that he instead asked Putin for help in resolving the ongoing war in Ukraine, signalling his intent to broker yet another truce."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shiromani-akali-dal-bikram-majithia-arrested-after-raids-at-his-amritsar-house-2745972-2025-06-25",
      "headline": "Akali Dal's Bikram Majithia arrested after raids at Amritsar homeMajithia and his wife claimed that members of the Vigilance Bureau barged into their house in Green Avenue in Amritsar. They claimed that a similar raid was conducted at their residence in Chandigarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-pg-owner-arrested-for-alleged-sexual-assault-on-woman-resident-in-mico-layout-2745917-2025-06-25",
      "headline": "Bengaluru PG owner sexually assaults resident after faking ring search, arrestedA PG owner in Bengaluru was arrested for sexually assaulting a woman resident. The incident reportedly happened when he summoned her over a missing ring. Police have filed a rape case and arrested him."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-edgbaston-test-dinesh-karthik-2746063-2025-06-25",
      "headline": "Doubt Jasprit Bumrah would want to play at Edgbaston: Dinesh KarthikDinesh Karthik feels that Jasprit Bumrah may choose not to play the Edgbaston Test against England, especially if it turns out to be a flat track. The second Test between India and England will start on July 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-faces-flak-for-response-to-rishabh-pants-twin-centuries-2746036-2025-06-25",
      "headline": "Gambhir faces flak for response to Rishabh Pant's twin centuries in Leeds TestIndia head coach Gautam Gambhir faced flak for his response to a question regarding Rishabh Pant in the post-match press conference after India's loss to England in the first test at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aarit-kapil-vs-magnus-carlsen-online-chess-delhi-9-year-old-2746019-2025-06-25",
      "headline": "Nine-year-old Delhi boy comes close to beating chess great Magnus CarlsenNine-year-old Aarit Kapil from Delhi nearly defeated reigning world champion Magnus Carlsen in an intense online chess match. The Indian wunderkind became the youngest from the country to defeat a Grandmaster last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-rankings-bowlers-ravindra-jadeja-top-ten-england-vs-india-leeds-2746024-2025-06-25",
      "headline": "ICC Rankings: Jadeja drops out of top 10 bowlers list after Leeds performanceRavindra Jadeja has dropped out of the top 10 bowlers list after his lacklustre performance in the Leeds Test. Jadeja struggled to create an impact in the first Test loss to England at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-simple-and-calm-ben-stokes-explains-englands-mantra-in-big-chases-after-leeds-win-2746002-2025-06-25",
      "headline": "Simple and calm: Ben Stokes explains England's mantra in big chases after Leeds winBen Stokes said that England's mantra when it comes to big chases is to keep things simple and remain calm after the Leeds Test win. England took the lead in the series by chasing down 371 at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-rankings-rishabh-pant-ben-duckett-leeds-centuries-test-rankings-2745970-2025-06-25",
      "headline": "ICC Rankings: Pant climbs to career-best spot, Gill back in top 20Rishabh Pant and Shubman Gill recorded significant strides following their impressive batting display at Leeds. The duo recorded their respective centuries and put India in the contest despite their defeat in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-ravindra-jadeja-slammed-sanjay-manjrekar-leeds-2745928-2025-06-25",
      "headline": "Sanjay Manjrekar slams tactically inept Ravindra Jadeja after Leeds lossSanjay Manjrekar has slammed Ravindra Jadeja for not using the conditions on Day 5 to his favour in the Leeds Test loss to England on Tuesday, June 24. Jadeja picked up just one wicket across both innings in the first Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kuldeep-yadav-shardul-thakur-dropped-sunil-gavaskar-leeds-test-defeat-2745878-2025-06-25",
      "headline": "Kuldeep for Thakur: Gavaskar backs spinner to start in BirminghamSunil Gavaskar suggested that India go on and pick Kuldeep Yadav to start in the second Test at Birmingham in place of Shardul Thakur. Despite making his return to Test cricket after two years, the all-rounder failed to impress in the opening Test at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-on-field-aura-nasser-hussain-assessment-eng-vs-ind-leeds-test-defeat-2745824-2025-06-25",
      "headline": "Gill didn't have that on-field aura: Hussain delivers brutal assessmentNasser Hussain slammed Shubman Gill's debut Test as captain and feels that he has a long way to go when it comes to matching the legacy left by the likes of Virat Kohli and Rohit Sharma. The ex-England cricketer has also slammed Ravindra Jadeja for his poor display at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/reason-behind-england-win-vs-india-2745874-2025-06-25",
      "headline": "Stokes analyses Leeds win: Knocking over Indian tail turned out to be keyEngland captain Ben Stokes believes dismissing the Indian tail was crucial in their 1st Test victory at Headingley. The win gives England a 1-0 lead while exposing weaknesses in India's bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-ravindra-jadeja-slammed-sanjay-manjrekar-leeds-2745928-2025-06-25",
      "headline": "Sanjay Manjrekar slams tactically inept Ravindra Jadeja after Leeds lossSanjay Manjrekar has slammed Ravindra Jadeja for not using the conditions on Day 5 to his favour in the Leeds Test loss to England on Tuesday, June 24. Jadeja picked up just one wicket across both innings in the first Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-kuldeep-yadav-shardul-thakur-dropped-sunil-gavaskar-leeds-test-defeat-2745878-2025-06-25",
      "headline": "Kuldeep for Thakur: Gavaskar backs spinner to start in BirminghamSunil Gavaskar suggested that India go on and pick Kuldeep Yadav to start in the second Test at Birmingham in place of Shardul Thakur. Despite making his return to Test cricket after two years, the all-rounder failed to impress in the opening Test at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-on-field-aura-nasser-hussain-assessment-eng-vs-ind-leeds-test-defeat-2745824-2025-06-25",
      "headline": "Gill didn't have that on-field aura: Hussain delivers brutal assessmentNasser Hussain slammed Shubman Gill's debut Test as captain and feels that he has a long way to go when it comes to matching the legacy left by the likes of Virat Kohli and Rohit Sharma. The ex-England cricketer has also slammed Ravindra Jadeja for his poor display at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/reason-behind-england-win-vs-india-2745874-2025-06-25",
      "headline": "Stokes analyses Leeds win: Knocking over Indian tail turned out to be keyEngland captain Ben Stokes believes dismissing the Indian tail was crucial in their 1st Test victory at Headingley. The win gives England a 1-0 lead while exposing weaknesses in India's bowling attack."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}