{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/womens-workforce-participation-is-very-low-kalpana-viswanath-ceo-safetipin-2764307-2025-07-31",
      "headline": "Women's workforce participation is very low; Kalpana Viswanath, CEO SafetipinIn a powerful discussion on women's rights and safety, a call was made for systemic change over waiting for patriarchal mindsets to shift. 'We just need the right to walk safely without looking over our shoulders,' one speaker emphasised, highlighting that safety is a right, not a form of protection. The conversation revealed that women hold less than 2% of jobs in the burgeoning gig economy, a stark contrast to their participation in the traditional economy. The panel also explored how urban infrastructure and product design often have a male-as-norm bias, from the height of bus handrails to the lack of pockets in women's clothing. The dialogue touched upon the 'pink tax' in transportation, where trip-chaining results in higher travel costs for women. The need for an enabling environment, including better public transport and services, was stressed as crucial for women's economic and social participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fenesta-cmo-susmita-nag-discusses-gender-bias-in-hiring-within-professional-workspaces-2764268-2025-07-31",
      "headline": "Fenesta CMO Susmita Nag discusses gender bias in hiring within professional workspacesA discussion highlights the stark reality for women in India's corporate sector, where they make up only 18% of the workforce in top NSE-listed companies. A woman leader recounted her early career in the late 90s, where she was told the company 'don't hire girls' and faced a lack of basic facilities like restrooms and proper safety gear in a factory setting. Another speaker addressed the issue of tokenism on corporate boards, suggesting that having three or more women in a group forms a cohort, whereas one is mere tokenism. The conversation delved into unconscious biases in hiring, noting that women's resumes are scrutinised for marital status more often than men's. The speakers emphasised that while policies like flexi-working exist, they can lead to subtle penalties and that a fundamental mindset shift, beyond just policy changes, is crucial for true gender equity in the workplace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-delayed-check-your-status-in-these-2-easy-ways-2764267-2025-07-31",
      "headline": "ITR refund delayed? Check your status in these 2 easy waysUsually, if your return is e-verified, the refund is credited within four to five weeks. But if you're still waiting, you can easily check your refund status online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lead-from-the-front-pallavi-shroff-on-breaking-barriers-building-legacies-2764235-2025-07-31",
      "headline": "Lead from the front: Pallavi Shroff on breaking barriers, building legaciesSpeaking at the India Today Woman Summit 2025, Pallavi S Shroff, Managing Partner, Shardul Amarchand Mangaldas said that when she began her practice in 1981, there were barely four or five women arguing cases in court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India set to be 3rd largest economy: Minister after Trump's 'dead economy' jabThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-296-points-lower-nifty-below-24800-hul-up-4-2764181-2025-07-31",
      "headline": "Sensex ends 296 points lower, Nifty below 24,800; HUL up 4%The S&P BSE Sensex was down by 296.28 points to end at 81,185.58, while the NSE Nifty50 lost 86.70 points to close at 24,768.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-how-avoiding-a-rs-5000-splurge-every-month-can-make-you-a-crorepati-2764129-2025-07-31",
      "headline": "CA explains how avoiding a Rs 5,000 splurge every month can make you a crorepatiYoung professionals often burn out chasing income, yet let their money idle. A Chartered Accountant suggests ditching one Rs 5,000 splurge a month and letting compounding turn it into crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indian-farm-market-is-coming-in-between-india-and-us-tariff-negotiations-2764038-2025-07-31",
      "headline": "Behind the delayed US-India trade deal: A standoff over farmsAt the centre of the friction is a long-standing issue that has repeatedly stalled negotiations between the two countries: agriculture."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-raghav-chadha-bring-laughter-and-love-the-great-indian-kapil-sharma-show-2764115-2025-07-31",
      "headline": "Parineeti Chopra-Raghav Chadha bring laughter and love to Kapil Sharma's showActor Parineeti Chopra and her politician-husband Raghav Chadha will feature in the upcoming episode of 'The Great Indian Kapil Show' season 3. The newly released promo shows Raghav and Parineeti playfully roasting each other. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-premiere-august-24-longer-season-salman-khan-hosting-2764323-2025-07-31",
      "headline": "Bigg Boss 19: What to expect from Salman Khan's new seasonBigg Boss 19 is set to premiere on August 24 with an extended season and new streaming format. Salman Khan returns as host, but an alternate host may join due to his busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-on-ahaan-panday-aneet-padda-overnight-stardom-feels-like-a-career-reset-for-me-2764305-2025-07-31",
      "headline": "Mohit Suri on Ahaan Panday-Aneet Padda's stardom: Feels like a career reset for meIn an exclusive conversation with India Today, Mohit Suri opened up about the overnight stardom of 'Saiyaara' stars Ahaan Panday and Aneet Padda. He expressed his joy in witnessing their journey and the fresh energy their success has brought to his own career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-supports-sitaare-zameen-par-pay-per-view-model-2764327-2025-07-31",
      "headline": "Hansal Mehta supports Sitaare Zameen Par's pay-per-view model, calls it smart moveFilmmaker Hansal Mehta praised Aamir Khan's decision to release 'Sitaare Zameen Par' on YouTube as a pay-per-view title. He called it a smart and progressive move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-bigg-boss-19-teaser-gharwalon-ki-sarkaar-twist-jiohotstar-colorstv-2764320-2025-07-31",
      "headline": "Bigg Boss 19 teaser: Salman Khan returns with a new twist, premiere date outActor Salman Khan launched the teaser for Bigg Boss 19 introducing the 'Gharwalon ki Sarkaar' twist. This new format promises a house run by collective decisions, adding fresh dynamics to the popular reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-mushy-birthday-wish-for-his-love-kiara-advani-is-all-heart-2764294-2025-07-31",
      "headline": "My favourite face, in any place: Sidharth Malhotra's birthday wish for Kiara AdvaniKiara Advani celebrated her 34th birthday on July 31. To mark the joyous occasion, her actor-husband Sidharth Malhotra showered love on her, with the most heartwarming post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-open-old-age-home-for-500-on-his-birthday-2764113-2025-07-31",
      "headline": "Sonu Sood announces old age home for 500 seniors on his birthdayOn his 52nd birthday, Sonu Sood announced the launch of an old age home to provide shelter and care for 500 senior citizens without family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-gets-bail-in-8-year-old-case-after-he-surrenders-before-court-2764292-2025-07-31",
      "headline": "Rajkummar Rao granted bail in 8-year-old case after surrendering in courtActor Rajkummar Rao was recently granted bail in an eight-year-old case after he surrendered before the Jalandhar court. His lawyers cited wrong address of delivery "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/conversations-with-a-killer-the-son-of-sam-tapes-delves-into-a-serial-killer-sinister-mindset-2764143-2025-07-31",
      "headline": "The Son of Sam Tapes delves into a serial killer's sinister mindsetNetflix's new offering, 'Conversations with a Killer: The Son of Sam Tapes', takes a deep dive into the disturbing psyche of an infamous serial killer. With rare tapes and firsthand accounts, the docu-series reflects on what turned a seemingly normal man, David Berkowitz, into a monster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shefali-shah-bhumi-pednekar-on-pay-parity-ott-fairer-to-women-2764257-2025-07-31",
      "headline": "Shefali Shah, Bhumi Pednekar on pay parity: OTT fairer to womenActors Shefali Shah and Bhumi Pednekar shared their views on pay gaps and praised OTT platforms for bringing more fairness and better roles for women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-spends-a-day-on-indian-navy-destroyer-2764148-2025-07-31",
      "headline": "Amitabh Bachchan spends a day on warship, calls it life-changing experienceAmitabh Bachchan spent a day aboard an Indian Navy Destroyer and shared a heartfelt tribute to the armed forces, praising their silent and selfless service. He shared his detailed experience in his blog and expressed pride in being an Indian and saluted the dedication of the nation's defenders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-sweet-message-kingdom-release-mixed-reviews-2764238-2025-07-31",
      "headline": "We've done it: Rashmika's message for Kingdom wins Vijay Deverakonda's heartRashmika Mandanna showed support and excitement for Vijay Deverakonda's 'Kingdom'. She shared a sweet message for her rumoured boyfriend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-reacts-to-sidharth-anands-demand-for-a-saiyaara-sequel-2764195-2025-07-31",
      "headline": "Exclusive: Mohit Suri reacts to Sidharth Anand's demand for a Saiyaara sequelMohit Suri clarifies there are no plans for a 'Saiyaara' sequel despite Sidharth Anand's interest. He emphasises the film was made organically without franchise goals, reflecting a unique filmmaking approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shefali-shah-stereotyping-in-cinema-dug-my-grave-playing-wife-to-older-man-waqt-amitabh-bachchan-akshay-kumar-2764237-2025-07-31",
      "headline": "Shefali Shah on stereotyping in films: Dug my grave playing wife to much older manShefali Shah recently shared her views on women being stereotyped in cinema. She discussed how OTT has changed the ball game altogether. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-claims-her-jewellery-worth-rs-70-lakh-stolen-from-london-airport-2764216-2025-07-31",
      "headline": "Urvashi Rautela claims her jewellery worth Rs 70 lakh stolen from London airportActor Urvashi Rautela reported the theft of jewellery worth Rs 70 lakh from London airport. The incident raised concerns over airport security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-directors-on-slaying-demons-surpassing-bts-blackpink-2764110-2025-07-31",
      "headline": "Exclusive: KPop Demon Hunters directors on slaying demons, surpassing BTS, BLACKPINK'KPop Demon Hunters', Netflix's most-watched animated film, brilliantly blends supernatural lore with K-pop energy, featuring fierce female demon hunters and a fictional boy band that topped global charts. The film's directors spoke to us about its unique animation that celebrates self-acceptance and sisterhood, and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-rani-mukerji-71st-national-awards-12th-fail-mrs-chatterjee-vs-norway-2764200-2025-07-31",
      "headline": "Rani Mukerji, Vikrant Massey frontrunners for 71st National AwardsVikrant Massey and Rani Mukerji are leading contenders for this year's National Awards. Their performances in '12th Fail' and 'Mrs Chatterjee vs Norway' have caught attention, while 'Rocky Aur Rani Kii Prem Kahaani' might earn the Best Film accolade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-lifetime-box-office-collection-prediction-detailed-report-biggest-love-story-of-2025-with-rs-400-crore-haul-starring-ahaan-panday-aneet-padda-2764194-2025-07-31",
      "headline": "Saiyaara lifetime box office: Biggest love story of 2025 with Rs 400 crore haulDespite the release of 'Son of Sardaar 2' and 'Dhadak 2', 'Saiyaara' will manage to continue its winning run at the box office. IndiaToday.in spoke to a trade expert to decode the film's lifetime business expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithiin-vikram-kumar-sports-drama-to-begin-in-late-2025-2764189-2025-07-31",
      "headline": "Nithiin-Vikram Kumar's sports drama to begin in late 2025? Here's what we knowTelugu star Nithiin and filmmaker Vikram Kumar are collaborating after more than a decade to create a big-budget sports drama. The film promises a fresh, emotionally charged narrative with extensive physical preparation and a pan-India release planned for mid-2026."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-wont-retaliate-to-trumps-25-tariffs-sees-no-need-to-panic-sources-2764205-2025-07-31",
      "headline": "India not worried, won't retaliate: Government sources on Trump's tariff-penaltyTrump on Wednesday announced imposing a 25% tariff along with additional penalties on Indian imports, effective August 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-tamil-nadu-chief-minister-o-panneerselvam-exits-nda-hours-after-meeting-mk-stalin-during-morning-walk-2764120-2025-07-31",
      "headline": "OPS exits NDA ahead of polls, move comes hours after morning walk with StalinIn a significant political development in Tamil Nadu, expelled AIADMK leader O Panneerselvam announced his exit from the NDA, just hours after a morning meeting with Chief Minister MK Stalin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-sold-on-pakistan-oil-deal-where-is-reserves-petrol-imran-khan-cryptocurrency-tariff-india-2764337-2025-07-31",
      "headline": "Trump is sold on Pak oil. But where's the oil?A day after declaring a 25% import duty and penalty on Indian exports, President Donald Trump said the US will work with Islamabad to develop Pakistan's \"massive oil reserves\". But where's Pakistan's oil that Trump got sold on? And why do Pakistanis pay 272 rupees a litre for petrol?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day1-live-score-updates-2764064-2025-07-31",
      "headline": "5th Test, Day 1 Live: Shubman Gill gets run out, Karun joins SudharsanIndia (IND) vs England (ENG), 5th Test, Day 1 Live Updates: India have lost the wicket of Shubman Gill via a run out after play resumed following the rain break. Karun Nair has joined Sai Sudharsan in the middle at Old Trafford. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariffs-penalty-india-neither-truth-nor-social-indian-exports-us-oil-russia-china-fta-uk-energy-defence-2764180-2025-07-31",
      "headline": "Trump's tariffs and penalty on India: Neither truth nor socialUS President Donald Trump used his Truth social platform to declare the tariff-penalty on India. But his arguments for the punitive measure are far from truth and distant from social. Trump is a tragedy on both counts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patna-horror-burnt-bodies-of-2-minor-siblings-found-at-home-family-alleges-murder-2764304-2025-07-31",
      "headline": "Patna horror: Burnt bodies of 2 minor siblings found at home, family alleges murderThe family members of the victims said that someone first killed the boys and then set their bodies on fire to hide their crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/a-for-akhilesh-yadav-b-for-babasaheb-lessons-at-samajwadi-party-run-school-in-up-2764191-2025-07-31",
      "headline": "A for Akhilesh Yadav, B for Babasaheb: Lessons at Samajwadi Party-run school in UPSP worker Faraz Alam Gada has started the first PDA Pathshaala — named after the Samajwadi Party's PDA - Pichhda (backward), Dalit, Alpsankhyak (minority) outreach in Ramnagar in Saharanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jat-conundrum-jagdeep-dhankars-exit-bares-bjps-struggle-with-community-2763641-2025-07-30",
      "headline": "Jat conundrum: Jagdeep Dhankar's exit bares BJP's struggle with communityEngineering a Jat breakthrough for long, the BJP has instead built a fragile edifice of borrowed faces and paper alliances, just one defection or protest away from collapse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-bigg-boss-19-teaser-gharwalon-ki-sarkaar-twist-jiohotstar-colorstv-2764320-2025-07-31",
      "headline": "Bigg Boss 19 teaser: Salman Khan returns with a new twist, premiere date outActor Salman Khan launched the teaser for Bigg Boss 19 introducing the 'Gharwalon ki Sarkaar' twist. This new format promises a house run by collective decisions, adding fresh dynamics to the popular reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/malegaon-blast-verdict-hindu-terror-congress-pragya-thakur-digvijay-singh-rss-chidambaram-sushilkumar-shinde-heres-how-2764072-2025-07-31",
      "headline": "When Congress leader, UPA-era NSA discussed Hindu terror with top US officialsAll seven accused in the 2008 Malegaon blast have been acquitted after 17 years of trial. The case was once used by Congress leaders to start a \"Hindu terror\" narrative, triggering years of political firestorms. Congress MP Rahul Gandhi discussed \"threats\" from \"Hindutva terrorism\" even with then US Ambassador to India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/another-indian-assaulted-by-teen-gang-dublin-ireland-tallaght-attack-santosh-yadav-hate-crime-linkdedin-gardai-irish-polish-2764150-2025-07-31",
      "headline": "Indian-origin man suffers facial fractures in racist assault in IrelandA 32-year-old Indian-origin man was attacked by six teenagers in Dublin, leaving him with a fractured cheekbone. The assault, similar to a recent gang attack in Tallaght, has raised concerns. The survivor, Santosh Yadav, accused Irish police of inaction, while activists warn that misinformation is fuelling rising anti-migrant violence. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjabi-singer-brandishes-gun-in-gym-after-equipment-dispute-arrested-video-surfaces-2764169-2025-07-31",
      "headline": "Video: Punjabi singer brandishes gun in gym after equipment dispute, arrestedA video of the incident, which has since surfaced, shows the accused brandishing the gun and shouting, even as others present at the gym tried to pacify the situation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/horror-at-saudi-amusement-park-as-ride-snaps-mid-air-with-people-on-board-terrifying-video-2764289-2025-07-31",
      "headline": "Video: Horror at Saudi amusement park as ride snaps mid-air with people on boardThe incident took place at Green Mountain Park in the Hada area on July 31 and was recorded in disturbing clips that went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/london-bound-air-india-flight-aborts-takeoff-at-delhi-airport-due-to-technical-snag-2764264-2025-07-31",
      "headline": "London-bound Air India flight aborts takeoff at Delhi airport due to technical snagAn Air India flight from Delhi to London on July 31 returned to the bay after the cockpit crew aborted takeoff due to a suspected technical issue, following standard operating procedures, the airline said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/partial-skeletal-remains-found-at-6th-site-in-dharmasthala-mass-burial-case-1st-location-to-provide-evidence-2764083-2025-07-31",
      "headline": "Dharmasthala case: Partial skeletal remains found at 6th site, first with evidencePartial skeletal remains have been found at the sixth site in Dharmasthala's mass burial probe as investigators intensify efforts to verify allegations made by a former sanitation worker about multiple burials in the temple town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-skin-you-alive-rohingya-bjp-leader-suvendu-adhikari-snaps-at-trinamool-congress-over-joy-bangla-slogan-2764239-2025-07-31",
      "headline": "Will skin you alive, Rohingya: Suvendu Adhikari's outburst over 'Joy Bangla' sloganAs BJP leader Suvendu Adhikari was on his way to join a march in Hooghly, Trinamool supporter Sheikh Moidul shouted \"Jai Bangla\" slogans. The situation escalated when Adhikari allegedly called Moidul a \"Rohingya,\" and his bodyguards reportedly pushed him, resulting in a minor hand injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-four-marriages-love-betrayal-tragedy-madhubala-yogeeta-bali-leena-chandavarkar-2763700-2025-07-31",
      "headline": "Love, Money, Madness and Fame: The Enduring Philosophy of Kishore KumarOn August 4, 2025, we celebrate what would have been the 96th birthday of Kishore Kumar—the legendary singer, actor, and filmmaker whose unparalleled talent and eccentric charm left an indelible imprint on Indian cinema. In this series, we explore the multifaceted life of this enigmatic genius, delving into his complex relationships with love, marriage, money, madness, and fame. The first part of this special series traces Kishore's quest for love—a journey marked by passion, heartbreak, and resilience—tragically cut short by his sudden death in 1987."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-nasa-launches-four-astronauts-on-six-month-mission-to-space-2764335-2025-07-31",
      "headline": "Watch LIVE: Nasa launches four astronauts on six-month mission to spaceThe Crew-11 team comprises Nasa astronauts Zena Cardman, serving as Commander on her first spaceflight, and Michael Fincke, the mission Pilot making his fourth voyage to space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/private-school-fees-rise-169-percent-impact-middle-class-families-india-2764003-2025-07-31",
      "headline": "From dual incomes to debt: The silent struggle of parents paying private school feesMiddle-class Indian families struggle with sharply rising private school fees and related lifestyle changes. Despite existing fee regulations, poor enforcement leaves parents bearing heavy financial and emotional costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-after-indus-waters-treaty-pause-chenab-sawalkote-dam-international-tender-hydropower-pakistan-2764173-2025-07-31",
      "headline": "After Indus treaty pause, India floats tender to tap Chenab's full potentialIndia has revived the six-decade-old Sawalkote hydropower project on River Chenab after keeping the Indus Waters Treaty with Pakistan in abeyance. The move reveals a shift in India's water and energy strategy, where New Delhi is asserting its rights over western rivers of the Indus Water System."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-returned-haji-pir-pass-pakistan-after-capturing-1965-pm-modi-congress-explained-2763676-2025-07-31",
      "headline": "Why India returned Haji Pir Pass to Pakistan after capturing it in 1965India captured the Haji Pir Pass in 1965 in a big military achievement, but returned it to Pakistan just months later under the Tashkent Agreement. Critics argue that the move compromised long-term security in Kashmir. But why did India give control of Haji Pir Pass to Pakistan despite wresting the strategic site from it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/no-proof-col-purohit-made-bomb-pragya-thakur-owned-bike-used-in-malegaon-blast-judge-while-reading-verdict-2764008-2025-07-31",
      "headline": "No evidence: All Malegaon blast accused, including Pragya Thakur, acquittedMalegaon blasts verdict: The blasts in Malegaon killed six people and injured over 100. Seventeen years later, all the seven accused have been acquitted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aimim-chief-asasuddin-owaisi-criticises-us-president-donald-trump-for-hike-in-tariffs-calls-it-attack-on-indias-sovereignty-and-economy-2764222-2025-07-31",
      "headline": "Buffoon-in-Chief: Owaisi tears into Trump over tariffs, doesn't spare PM eitherCriticising Trump for imposing high tariffs on India, Owaisi termed the measures a deliberate attack on India's sovereignty and economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-backs-donald-trump-dead-economy-remark-questions-pm-narendra-modi-silence-us-tariff-2764089-2025-07-31",
      "headline": "Glad Trump stated facts: Rahul Gandhi backs 'dead economy' remark on IndiaRahul Gandhi backed Donald Trump's \"dead economy\" remark, accusing PM Modi of destroying India's economy. He questioned Modi's silence on the 25 percent US tariff and said the government has failed on the economic front.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-on-ahaan-panday-aneet-padda-overnight-stardom-feels-like-a-career-reset-for-me-2764305-2025-07-31",
      "headline": "Mohit Suri on Ahaan Panday-Aneet Padda's stardom: Feels like a career reset for meIn an exclusive conversation with India Today, Mohit Suri opened up about the overnight stardom of 'Saiyaara' stars Ahaan Panday and Aneet Padda. He expressed his joy in witnessing their journey and the fresh energy their success has brought to his own career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-supports-sitaare-zameen-par-pay-per-view-model-2764327-2025-07-31",
      "headline": "Hansal Mehta supports Sitaare Zameen Par's pay-per-view model, calls it smart moveFilmmaker Hansal Mehta praised Aamir Khan's decision to release 'Sitaare Zameen Par' on YouTube as a pay-per-view title. He called it a smart and progressive move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-bigg-boss-19-teaser-gharwalon-ki-sarkaar-twist-jiohotstar-colorstv-2764320-2025-07-31",
      "headline": "Bigg Boss 19 teaser: Salman Khan returns with a new twist, premiere date outActor Salman Khan launched the teaser for Bigg Boss 19 introducing the 'Gharwalon ki Sarkaar' twist. This new format promises a house run by collective decisions, adding fresh dynamics to the popular reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-mushy-birthday-wish-for-his-love-kiara-advani-is-all-heart-2764294-2025-07-31",
      "headline": "My favourite face, in any place: Sidharth Malhotra's birthday wish for Kiara AdvaniKiara Advani celebrated her 34th birthday on July 31. To mark the joyous occasion, her actor-husband Sidharth Malhotra showered love on her, with the most heartwarming post. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jack-leach-nathan-lyon-england-best-spinner-2764343-2025-07-31",
      "headline": "Jack Leach is still England's best spinner in my eyes: Nathan LyonENG vs IND: Nathan Lyon said that Jack Leach remains the best spinner for England. Having last played back in October 2024, the left-armer Leach wasn't picked for the home series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/ferrari-fred-vasseur-contract-extension-team-principal-formula-one-2764336-2025-07-31",
      "headline": "Ferrari confirm Vasseur's multi-year contract extension as team principalFerrari extended team principal Fred Vasseur's contract, signalling firm backing for his leadership despite a 268-point gap to McLaren in the standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-viktor-gyokeres-thierry-henry-comparisons-2764321-2025-07-31",
      "headline": "Arsenal's new signing Viktor Gyokeres plays down Thierry Henry comparisonsArsenal's Viktor Gyokeres played down the comparisons with Thierry Henry after donning the iconic No.14 shirt since his move from Sporting CP. He now hopes to ensure that he can contribute to the club's season, which will have massive expectations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-womens-odi-world-cup-india-home-2764317-2025-07-31",
      "headline": "India will be tough to beat in Women's ODI World Cup: Alyssa HealyAlyssa Healy said that India will be tough to beat in the Women's ODI World Cup later this year, given how Harmanpreet Kaur's team has played in home conditions in the last few months. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-michael-atherton-on-gautam-gambhir-2764303-2025-07-31",
      "headline": "3 successive Test series defeats would be a problem for Gambhir: Michael AthertonFormer England captain Michael Atherton has said that losing the ongoing series against England would mount problems for India head coach Gautam Gambhir, as the team has already lost the last two series under his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anshul-kamboj-sourav-ganguly-england-vs-india-2764273-2025-07-31",
      "headline": "Don't judge Anshul Kamboj based on one Test match: Sourav GangulyENG vs IND: Former India captain Sourav Ganguly said Anshul Kamboj should not be judged based on just one Test and deserves a longer run of at least five matches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/breaking-barriers-bihars-new-sporting-heroes-show-the-way-forward-2764270-2025-07-31",
      "headline": "Breaking barriers: Bihar's new sporting heroes show the way forwardSpeaking at India Today's Woman Summit 2025, javelin thrower Nishi Kumari, archer Anshika Kumari, and rugby player Alpana Kumari shared their journeys toward sporting glory. The three athletes spoke about the unwavering support of their parents and highlighted their battles against the odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-arshdeep-singh-kuldeep-yadav-2764212-2025-07-31",
      "headline": "Oval Test: Gautam Gambhir faces heat for Arshdeep, Kuldeep omissionGautam Gambhir was slammed on social media for his selection calls in the final Test against England at the Oval where the likes of Kuldeep Yadav and Arshdeep Singh were ignored. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-playing-xi-karun-nair-returns-jasprit-bumrah-rested-2764178-2025-07-31",
      "headline": "No Bumrah, Karun Nair gets 2nd chance as India make 4 changes for Oval TestJasprit Bumrah has been rested for the Oval Test while Karun Nair has got a second chance in England as India make four changes for the match. There was no debut for Arshdeep Singh and Kuldeep Yadav had to sit out of the game yet again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/breaking-barriers-bihars-new-sporting-heroes-show-the-way-forward-2764270-2025-07-31",
      "headline": "Breaking barriers: Bihar's new sporting heroes show the way forwardSpeaking at India Today's Woman Summit 2025, javelin thrower Nishi Kumari, archer Anshika Kumari, and rugby player Alpana Kumari shared their journeys toward sporting glory. The three athletes spoke about the unwavering support of their parents and highlighted their battles against the odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-arshdeep-singh-kuldeep-yadav-2764212-2025-07-31",
      "headline": "Oval Test: Gautam Gambhir faces heat for Arshdeep, Kuldeep omissionGautam Gambhir was slammed on social media for his selection calls in the final Test against England at the Oval where the likes of Kuldeep Yadav and Arshdeep Singh were ignored. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-playing-xi-karun-nair-returns-jasprit-bumrah-rested-2764178-2025-07-31",
      "headline": "No Bumrah, Karun Nair gets 2nd chance as India make 4 changes for Oval TestJasprit Bumrah has been rested for the Oval Test while Karun Nair has got a second chance in England as India make four changes for the match. There was no debut for Arshdeep Singh and Kuldeep Yadav had to sit out of the game yet again. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}