{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/data-can-be-misleading-zerodha-founder-and-ceo-nithin-kamath-on-rise-of-tier-2-and-3-city-investors-2729307-2025-05-23",
      "headline": "'Data can be misleading': Nithin Kamath on rise of Tier 2 and 3 city investorsZerodha's Nithin Kamath explained that if you look at the addresses provided by users during their KYC process, it appears many traders are from Tier 2 and Tier 3 towns. However, this can be misleading because most people don't update their address when they move to a new city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-rises-rising-today-today-check-brokerage-views-should-you-buy-sell-hold-2729293-2025-05-23",
      "headline": "ITC share price rises 3% today. Check brokerage views and what should investors do?The stock was trading 2.78% higher at Rs 437.95, recovering from Thursday's close of Rs 426.10, as investors appeared to focus on the company's long-term fundamentals rather than short-term headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/some-individuals-do-not-need-to-file-an-itr-are-you-one-of-them-2729270-2025-05-23",
      "headline": "Some individuals don't need to file an ITR. Are you one of them?As the 2025–26 financial year begins, the Income Tax Department has released all the seven ITR forms along with the ITR-U form.  But did you know not everyone is required to file a return?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-loan-bailout-package-pakistan-usd-1-billion-why-reason-india-objection-terror-11-conditions-2729243-2025-05-23",
      "headline": "Explained: Why IMF gave Pakistan $1 billion despite India's objectionsThe IMF agreed to support Pakistan with a total of $7 billion under the EFF programme. So far, it has given $2.1 billion in two separate instalments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-appear-65-percent-lower-trading-apps-has-multibagger-stock-crashed-2729212-2025-05-23",
      "headline": "Have BSE shares really crashed? Here's why some apps show a 66% fallThe apparent crash was just a technical adjustment following the company's 2:1 bonus issue, which turned the stock ex-bonus today. Some trading platforms may not have accounted for this corporate action in their price charts, leading to misleading visuals of a steep 65% drop. In reality, the share price simply adjusted to reflect the bonus allotment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-key-reasons-behind-sensex-nifty-rebound-explained-2729199-2025-05-23",
      "headline": "Sensex jumps 900 points: Why stock market is rising today and what next?Market watchers suggest the current bounce is likely driven by a 'buy-on-dips' strategy that many investors have adopted amid recent volatility. Despite concerns about the global macro environment, the strength in domestic fundamentals seems to be offering support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/honasa-consumer-share-price-rise-13-percent-revenue-rise-decline-in-q4-net-profit-reason-why-2729197-2025-05-23",
      "headline": "Honasa shares rise 13% despite decline in Q4 net profitThe company's revenue from operations went up by 13% year-on-year (YoY), reaching Rs 534 crore in Q4FY25. However, despite the rise in revenue, Honasa's consolidated net profit fell by 18% YoY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-flat-nifty-below-24700-sun-pharma-falls-5-2729185-2025-05-23",
      "headline": "Sensex, Nifty move up in early session despite concerns over FII flowsThe S&P BSE Sensex went up by 289.27 points to 81,241.26, while the NSE Nifty50 added 119.15 points to 24,728.85 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-allotment-how-to-check-status-listing-date-expectation-gmp-online-guide-2729182-2025-05-23",
      "headline": "Borana Weaves IPO allotment: Step-by-step guide to check statusBorana Weaves IPO opened for subscription on May 20 and closed on May 22. The IPO saw strong demand from all investor groups. It was subscribed 147.85 times in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-change-tax-slab-revamp-talks-begin-government-officials-report-2729163-2025-05-23",
      "headline": "GST rates may change soon as fresh revamp talks begin: ReportGST, which was launched in July 2017, brought together many indirect taxes into one system and created a single national market. The latest round of talks follows the government's introduction of a bill in February this year to simplify income tax laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-may-23-trading-setup-sensex-nifty-nse-bse-2729159-2025-05-23",
      "headline": "Sensex, Nifty opening: Stock market likely to open higher today. Here's whyStock market opening: The Nifty50 index may open slightly above its previous close. Gift Nifty futures were trading at 24,692.5 at 7:59 am, showing a possible rise from Thursday's close of 24,609.7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-23-trading-tips-nse-bse-itc-ola-honasa-sun-pharma-jsw-steel-2729154-2025-05-23",
      "headline": "Stocks to watch on May 23: ITC, Ola, Honasa, Sun Pharma, JSW SteelA number of companies will release their January-March quarter results today. These include JSW Steel, Ashok Leyland, Glenmark Pharmaceuticals, Afcons Infrastructure, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-645-points-lower-nifty-below-24700-indusind-bank-gains-2-percent-it-auto-stocks-2728770-2025-05-22",
      "headline": "Sensex closes 645 points lower, Nifty below 24,700; IndusInd Bank gains 2%The S&P BSE Sensex lost 644.64 points to end at 80,951.99, while the NSE Nifty50 was down by 203.75 points to close at 24,609.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-day-3-subscription-bidding-over-100-times-check-latest-gmp-listing-date-2728751-2025-05-22",
      "headline": "Borana Weaves IPO booked over 100 times: Check latest subscription, GMPAllotment for the Borana Weaves IPO is expected to be finalised on Friday, May 23, 2025. The company is likely to list its shares on the stock exchanges on Tuesday, May 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-to-start-solar-module-factory-this-year-report-2728719-2025-05-22",
      "headline": "Reliance to start solar module factory this year: ReportThis year, Reliance Industries will launch its solar module factory, aiming to meet India's clean energy goals by producing 20 GW annually. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/most-happiest-and-unhappiest-careers-of-the-world-revealed-is-your-job-among-them-2728702-2025-05-22",
      "headline": "World's happiest and unhappiest careers revealed. Is your job among them?Researchers at the University of Tartu in Estonia looked at 263 different jobs and asked over 59,000 people about their work and life satisfaction. They also used health data from the Estonian Biobank to get a better picture of what really makes people happy in their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-down-rising-covid-cases-pause-dalal-street-bull-run-sensex-nifty-outlook-investor-expert-insight-2728677-2025-05-22",
      "headline": "Covid cases surge in India: Will it trigger a stock market crash?Stock market today: The S&P BSE Sensex had dropped by over 900 points to 80,681.76, while the NSE Nifty50 was down 266 points at 24,547.45 as of 12:45 pm. The fall in the market comes after days of strong performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-to-cut-1500-jobs-in-restructuring-move-report-employee-layoff-2728662-2025-05-22",
      "headline": "Walmart to cut 1,500 jobs in restructuring move: ReportThe job cuts will affect several areas, including Walmart's global tech team, the e-commerce section in US stores, and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-adds-1458-lakh-members-in-march-women-and-youth-lead-the-way-2728646-2025-05-22",
      "headline": "EPFO adds 14.58 lakh members in March. Women and youth lead the wayMost of the new members who joined EPFO for the first time in March were youngsters. Around 4.45 lakh people in the 18–25 age group signed up in March, making up nearly 59% of all new subscribers. Many in this age group are first-time jobseekers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-teleservices-shares-jumps-11-percent-today-whats-driving-the-rally-2728642-2025-05-22",
      "headline": "Tata Teleservices shares jumps 11% today. What's driving the rally?The trigger behind the rally appears to be growing speculation around a potential capital infusion by Tata Sons Ltd into its struggling telecom subsidiary, Tata Teleservices Ltd (TTSL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/abfrl-demerger-brokerages-assign-fair-value-to-new-fashion-twins-details-here-2728621-2025-05-22",
      "headline": "ABFRL demerger: Brokerages assign fair value to new fashion twins. Details hereBrokerages have begun breaking down the newly split entities, laying out distinct growth paths and fair value estimates for both ABFRL and ABLBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/all-itr-forms-are-out-but-you-still-cannot-file-what-causing-the-delay-e-filing-utilities-portal-2728606-2025-05-22",
      "headline": "All ITR forms are out, but you still can't file. What's causing the delay?While all seven ITR forms (ITR-1 to ITR-7) and even the updated ITR-U form are ready, the filing process can't begin until the government activates the utility software. These utilities are essential tools that help taxpayers fill in, check, and submit their returns online or offline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aditya-birla-fashion-and-retail-ltd-abfrl-business-demerger-stock-drop-66-percent-2728594-2025-05-22",
      "headline": "ABFRL stock drops 66% post demerger. What investors should know The sharp decline from Wednesday's close of Rs 268.95 reflects the market's adjustment for the value of the demerged entity, not a deterioration in Aditya Birla Fashion and Retail Ltd's fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vaibhav-taneja-salary-tesla-cfo-more-pay-than-sunder-pichai-google-satya-nadella-microsoft-2728585-2025-05-22",
      "headline": "Who is Vaibhav Taneja? Tesla CFO who made more than Pichai and NadellaWhile Sundar Pichai took home $10.73 million and Satya Nadella received $79.1 million in 2024, Taneja's total earnings far exceeded both. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/itc-q4-results-today-check-dividend-revenue-profit-expectations-2728571-2025-05-22",
      "headline": "ITC set to report Q4 results today: Earnings, dividend payout in focusSo far this financial year, the diversified FMCG and cigarette giant has already handed out an interim dividend of Rs 6.50 per share. Given its track record, investors are now eyeing another generous payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-fresh-record-high-us-dollar-stability-risks-other-key-reasons-explained-2728564-2025-05-22",
      "headline": "Explained: Why bitcoin has hit a fresh all-time high The world's most valuable cryptocurrency has gained over 50% since April, propelled by improving global risk appetite and a flight to alternatives as doubts over the US dollar's stability grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-notice-to-uber-over-advance-tipping-union-minister-calls-it-unethical-2728524-2025-05-22",
      "headline": "Government notice to Uber over advance tipping, Union Minister calls it 'unethical'The Consumer Protection Body has issued a notice to Uber regarding its practice of collecting advanced tips from users. Union Minister Prahlad Joshi has termed the practice 'deeply concerning', 'unethical and exploitative'. Uber has been given 15 days to respond to the notice. The government is widening its crackdown on practices violating consumer protection norms, with Rapido potentially facing a probe as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-300-acre-plant-devanahalli-building-dorms-women-workers-iphone-production-india-report-2728554-2025-05-22",
      "headline": "Foxconn building dorms at 300-acre iPhone campus in India: ReportThe dorms are part of the company's plan to support numerous workers at its plant, which is expected to play a major role in Apple's growing operations in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumbles-weak-global-cues-us-bonds-2728552-2025-05-22",
      "headline": "Sensex crashes 1,000 points: Why is stock market falling today?At around 12:51 pm, the BSE Sensex was down 966.37 points at 80,630.26, while the NSE Nifty50 slumped 269 points to 24,544.45. Market volatility spiked, dragging down broader indices and putting pressure on small- and mid-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-falls-stock-in-focus-fradu-q4-loss-2728548-2025-05-22",
      "headline": "IndusInd Bank shares in focus after Q4 loss amid fraud. Buy, hold or sell?The private lender reported a net loss of Rs 2,236 crore for the fourth quarter, a sharp reversal from a profit of Rs 2,347 crore in the same period last year. This marks a pivotal moment for the bank, which has now admitted that certain employees may have engaged in fraudulent activity that impacted its financial reporting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-465-points-lower-nifty-below-24700-indusind-bank-down-3-percent-2728539-2025-05-22",
      "headline": "Sensex, Nifty tank as IT stocks bleed over US deficit fearsThe S&P BSE Sensex was down by 753.42 points to 80,843.21, while the NSE Nifty50 fell by 209.65 points to 209.65 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-22-itc-indusind-bank-indigo-sun-pharma-rvnl-nse-bse-trading-2728506-2025-05-22",
      "headline": "Stocks to watch on May 22: ITC, IndusInd Bank, IndiGo, Sun Pharma, RVNLSeveral companies are set to announce their January–March quarter (Q4) earnings today, such as ITC, Sun Pharmaceutical Industries, Grasim Industries, Honasa Consumer, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-ceo-pieter-elbers-turkey-partnership-fully-compliant-q4-results-march-quarter-2728521-2025-05-22",
      "headline": "IndiGo CEO responds to Turkish lease concerns: 'Operations fully compliant'There has been rising attention to IndiGo's ties with Turkish Airlines amid reports that the Indian government may not extend the leasing agreement, which is due to end on May 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-trading-setup-sensex-nifty-today-bse-nse-fii-gift-nifty-2728514-2025-05-22",
      "headline": "Stock market opening: Will Sensex, Nifty continue their rally?After heavy selling in earlier sessions, FPIs turned net buyers and purchased shares worth Rs 2,201.79 corer in the last session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-accounting-fraud-employees-under-scanner-posts-1st-quarterly-loss-in-nearly-20-years-2728290-2025-05-21",
      "headline": "IndusInd Bank posts first loss in nearly 2 decades, flags employee fraudIndusInd Bank said its Q4 numbers reflect the impact of all the discrepancies identified so far through ongoing investigations."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/singer-keneeshaa-says-wont-run-faces-death-threats-amid-ravi-aarti-divorce-2729316-2025-05-23",
      "headline": "Singer Keneeshaa says 'won't run', faces death threats amid Ravi-Aarti's divorceSinger Keneeshaa Francis responded to the online death threats amid actor Ravi Mohan-Aarti's divorce battle. In a clear message to trolls, Keneeshaa wrote she 'won't run' or 'turn off comments.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyadarshan-says-akshay-was-heartbroken-over-pareshs-hera-pheri-3-exit-had-tears-2729374-2025-05-23",
      "headline": "Priyadarshan says Akshay was heartbroken over Paresh's Hera Pheri 3 exit: Had tears  'Hera Pheri 3' director Priyadarshan talked about the state of Akshay Kumar's mental health when he heard about Paresh Rawal's abrupt exit from the film. The filmmaker shared that the actor never suggested he cut Rawal or anyone else's role from the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-actor-vishal-jethwa-feels-like-a-misfit-in-new-world-of-bollywood-2729369-2025-05-23",
      "headline": "Homebound actor Vishal Jethwa feels like a 'misfit' in 'new world' of BollywoodActor Vishal Jethwa opened up about feeling like a misfit in the industry. He will next be seen in Neeraj Ghaywan's 'Homebound'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/helen-flaunts-her-fitness-game-at-85-2729368-2025-05-23",
      "headline": "Pilate to trampoline jumps: Helen flaunts her fitness game at 85Helen's recent video of working out in the gym has caught the attention of all. From Pilate to trampoline jumps, her workout regime is sure to motivate fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumbai-police-tighten-security-salman-khan-galaxy-apartments-trespassing-2729347-2025-05-23",
      "headline": "Mumbai Police tightens security at Salman Khan's Galaxy after trespassing casesMumbai police is set to enhance security protocols at Salman Khan's Galaxy Apartments following recent trespassing incidents. The new measures aim to protect the actor while maintaining privacy for other residents."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/kerala-high-court-refuses-to-quash-cheating-case-against-malayalam-film-manjummel-boys-producers-2729354-2025-05-23",
      "headline": "Kerala High Court refuses to quash cheating case against Manjummel Boys producersThe Kerala High Court has declined to quash criminal proceedings in a cheating case involving the producers of 'Manjummel Boys'. The ruling has now cleared the way for continued police investigation into the profit dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-makers-clarify-delay-rumours-2729346-2025-05-23",
      "headline": "Rishab Shetty's Kantara Chapter 1 makers clarify delay rumoursThe makers of Rishab Shetty's 'Kantara: Chapter One' clarified rumours of a possible delay in the film's release. They shared an official statement on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-karan-johar-brings-glitz-drama-betrayal-to-new-reality-show-2729335-2025-05-23",
      "headline": "The Traitors: Karan Johar brings glitz, drama and betrayal to new reality showKaran Johar is set to bring glitz and drama with his new reality show, 'The Traitors'. The show will premiere on Prime Video on June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/materialists-trailer-dakota-johnson-chris-evans-pedro-pascal-in-swooning-romance-with-the-prettiest-faces-in-business-2729314-2025-05-23",
      "headline": "Materialists trailer: A swooning romance with the prettiest faces in businessThe trailer of 'Materialists' establishes that it is a treat for the lovers of Hollywood rom-coms. The film features the most stunning faces in the industry - Dakota Johnson, Chris Evans, and Pedro Pascal - in a love triangle, making it all look more swoon-worthy than you had imagined. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-kid-cudi-testifies-against-sean-diddy-combs-alleges-break-in-and-arson-2729297-2025-05-23",
      "headline": "Rapper Kid Cudi testifies against Sean Diddy Combs, alleges break-in and arsonOn Day 9 of Sean Diddy's trial, rapper Kid Cudi took the stand and testified against him. Heb recalled instances where he alleged that the music mogul broke into his home and set his Porsche on fire. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-wishes-he-had-cut-unwanted-stuff-from-lindia-got-latent-2729275-2025-05-23",
      "headline": "Samay Raina wishes he had cut 'unwanted stuff' from life, shares update on LatentComedian Samay Raina reflected on the controversy surrounding his show 'India's Got Latent', expressing regret over not editing out sensitive content. While Raina hinted the show might return, he emphasised that it would take some time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-stands-out-ivory-gown-at-italy-event-with-korean-actor-kim-ji-won-2729218-2025-05-23",
      "headline": "Priyanka Chopra stands out in ivory gown at Italy event with K-actor Kim Ji-wonPriyanka Chopra stunned in a pearl-white strapless gown at the Bulgari event in Sicily, Italy. She attended the event alongside Korean actor Kim Ji-won. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-netflix-introduces-the-cast-ahead-of-priemere-2729203-2025-05-23",
      "headline": "Squid Game 3: Netflix introduces the cast ahead of premiere'Squid Game 3' makers introduced the cast with a new poster. The highly anticipated drama will premiere on June 27 on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bhool-chuk-maaf-review-rajkummar-rao-in-time-loop-of-misogyny-and-lopsided-love-2729179-2025-05-23",
      "headline": "Bhool Chuk Maaf review: Rajkummar Rao in time loop of misogyny and lopsided loveReleased-Fri May 23, 2025In 'Bhool Chuk Maaf', pregnancy jokes and outdated concepts of love are given way more importance than an attempt at bringing a progressive story from the heartland of India. Even Rajkummar Rao can't save this lost in a loop, lacking in love film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-goes-bold-in-golden-outfit-at-cannes-bikini-bust-clutch-2729189-2025-05-23",
      "headline": "Urvashi Rautela goes bold in gold at Cannes. Don't miss the bikini clutchActor Urvashi Rautela grabbed attention at Cannes in a gold outfit. However, it was the bikini-shaped clutch that truly stole the spotlight, sparking conversations across social media for its bold and quirky design.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ace-movie-review-vijay-sethupathi-rukmini-vasanth-convenient-storytelling-2729167-2025-05-23",
      "headline": "Ace review: Vijay Sethupathi is impressive, but uneven script bogs down heist filmReleased-Fri May 23, 2025Ace movie review: Director Arumugakumar's 'Ace', starring Vijay Sethupathi, Rukmini Vasanth and BS Avinash, is a heist drama that relies heavily on one character. The film's convenient writing is its biggest letdown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kshmr-not-into-k-pop-despite-his-samples-being-used-by-idols-like-lisa-exclusive-2728905-2025-05-23",
      "headline": "KSHMR 'not into K-pop' despite his samples being used by idolsKSHMR has become an unexpected yet significant contributor to the K-pop music scene through his sound samples. He revealed that he is not a K-pop fan personally and shared why his samples might have been a hit in the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-casts-magic-in-black-at-cannes-day-2-twins-with-daughter-aaradhya-2729161-2025-05-23",
      "headline": "Aishwarya Rai casts magic in black at Cannes, twins with daughter Aaradhya. WatchAishwarya Rai Bachchan impressed fans with her striking look on Day 2 of the Cannes Film Festival. The actor stole the spotlight in a black Gaurav Gupta creation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/2025-american-music-awards-jennifer-lopez-to-host-janet-jackson-to-receive-icon-award-glbs-2729129-2025-05-23",
      "headline": "2025 American Music Awards: Jennifer Lopez to host, Janet Jackson to receive icon awardThe 2025 AMAs will air live from Las Vegas on May 26, featuring performances by Jennifer Lopez, Janet Jackson, and more. Kendrick Lamar leads nominations. Tributes to US veterans included.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-to-raise-issue-of-world-bank-funding-to-pak-ahead-of-likely-20-billion-aid-approval-sources-2729372-2025-05-23",
      "headline": "India to strike Pak economy, approach World Bank and terror financing bodyIndia to raise issue of World Bank funding to Pak ahead of likely $20 billion aid approval: Sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/srinagar-indigo-flight-turbulence-pakistan-airspace-lahore-thunderstorm-inside-details-2729315-2025-05-23",
      "headline": "Refused by Lahore, IndiGo pilot decided to fly through storm: What went downThe New Delhi-Srinagar flight, carrying more than 220 people, including TMC MPs, landed safely at 6.30 pm on May 21, with the nose (radome) of the aircraft severely damaged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-pak-army-spokesperson-lieutenant-general-ahmed-sharif-chaudhry-speech-if-you-stop-water-hafiz-saeed-2729191-2025-05-23",
      "headline": "We will choke you..: Pak Army official threatens India in Hafiz Saeed's wordsA Pakistani military spokesperson's threatening remarks towards India, echoing Lashkar-e-Taiba chief Hafiz Saeed's inflammatory language about water, highlighted the alarming overlap between the Pakistan Army's rhetoric and the country's terror networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/harvard-university-indian-foreign-students-enrollment-future-trump-conditions-2729193-2025-05-23",
      "headline": "Harvard's Indian, foreign students can stay if they meet 6 conditions in 3 daysIn 72 hours, Harvard University has been asked by the Trump administration to comply with six strict conditions to enroll foreign students again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/haveri-gangrape-accused-karnataka-bail-roadshow-celebrations-outrage-2729306-2025-05-23",
      "headline": "Roadshow and open arms: Karnataka gang rape accused get heroes' welcome after bailSeven accused of a gangrape reported in January 2024 from Haveri, Karnataka, were recently granted bail by a local court. They were felicitated with a celebratory roadshow, sparking public outrage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-frees-man-convicted-of-sex-with-minor-using-special-powers-article-142-2729322-2025-05-23",
      "headline": "She didn't see it as crime: Supreme Court frees man convicted of sex with minorThe Supreme Court used extraordinary powers under Article 142 to order no sentencing for the man, now the victim's husband, observing, 'Society judged her, legal system failed her, family abandoned her. She is trying to save her husband.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncp-leader-rajendra-tukaram-hagawane-daughter-in-law-death-case-2728479-2025-05-23",
      "headline": "Suicide or murder? NCP leader on the run after daughter-in-law's death, 3 heldWhile the case initially appeared to be a suicide, physical injuries and marks on the neck of the deceased have led investigators to suspect foul play. The police have arrested three persons, including her husband."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-delegation-plane-forced-to-circle-delayed-by-hours-after-moscow-airport-shut-over-drone-attack-2729278-2025-05-23",
      "headline": "Op Sindoor delegation plane delayed as Moscow airport shut after drone attackA flight carrying the Operation Sindoor delegation led by DMK MP Kanimozhi was delayed for hours and forced to circle mid-air after a reported Ukrainian drone attack temporarily shut down Moscow airport. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/general-asim-munir-promoted-field-marshal-pakistan-power-consolidation-2729333-2025-05-23",
      "headline": "Field Marshal Asim Munir the Mungeri Lal of Pakistan?General Asim Munir was elevated to the rank of Field Marshal in the second such instance in Pakistan's history. This promotion is viewed as a strategic power consolidation rather than being a mere honorary position.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/national-herald-case-congress-leaders-donated-lakhs-to-rahul-gandhi-sonia-gandhi-young-indian-ed-enforcement-2729332-2025-05-23",
      "headline": "Congress leaders donated in lakhs to Rahul, Sonia Gandhi-led company on request: EDThe ED has alleged in its chargesheet that senior Congress leaders, acting on instructions from top party leaders, donated crores to the company involved in the National Herald case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/bhool-chuk-maaf-review-rajkummar-rao-in-time-loop-of-misogyny-and-lopsided-love-2729179-2025-05-23",
      "headline": "Bhool Chuk Maaf review: Rajkummar Rao in time loop of misogyny and lopsided loveReleased-Fri May 23, 2025In 'Bhool Chuk Maaf', pregnancy jokes and outdated concepts of love are given way more importance than an attempt at bringing a progressive story from the heartland of India. Even Rajkummar Rao can't save this lost in a loop, lacking in love film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/march-for-yunus-dhaka-to-witness-fresh-protests-as-army-chief-pushes-for-election-2729311-2025-05-23",
      "headline": "March for Yunus: Dhaka to witness fresh protests as Army chief pushes for electionYunus' supporters have announced 'March For Yunus' at Dhaka's Shahbagh after the Friday prayers. Posters have been put up in the capital city calling on people to join the march. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/liver-detox-supplements-juice-cleanse-herbal-products-liver-detox-medical-science-2725840-2025-05-23",
      "headline": "No, a juice cleanse won't detox your liver: Here's what willA new study reveals many liver detox supplements sold online could cause serious liver damage. The report calls for stricter regulations and greater public awareness in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/drg-jawans-who-gunned-down-naxals-in-operation-black-forest-welcomed-with-tilak-ceremony-2729279-2025-05-23",
      "headline": "Watch: Jawans, who neutralised 27 Naxals, welcomed with tilak in ChhattisgarhThe Naxal leaders gunned down by DRG had a combined bounty of Rs 13.5 crore. Following the operation, the Jawans were honoured by citizens in a grand civic reception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumbai-police-tighten-security-salman-khan-galaxy-apartments-trespassing-2729347-2025-05-23",
      "headline": "Mumbai Police tightens security at Salman Khan's Galaxy after trespassing casesMumbai police is set to enhance security protocols at Salman Khan's Galaxy Apartments following recent trespassing incidents. The new measures aim to protect the actor while maintaining privacy for other residents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-7",
      "headline": "Birth of social media jihadists, death of Article 370In part 7 of our series on the history of terrorism in Kashmir, we revisit the evolution of jihad on social media, and the end of Article-370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-casts-magic-in-black-at-cannes-day-2-twins-with-daughter-aaradhya-2729161-2025-05-23",
      "headline": "Aishwarya Rai casts magic in black at Cannes, twins with daughter Aaradhya. WatchAishwarya Rai Bachchan impressed fans with her striking look on Day 2 of the Cannes Film Festival. The actor stole the spotlight in a black Gaurav Gupta creation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/donald-trumps-golden-dome-plan-could-launch-new-era-of-weapons-in-space-2729362-2025-05-23",
      "headline": "Trump's Golden Dome plan could launch new era of weapons in spaceWhile the world's biggest space powers - the US, Russia and China - have put military and intelligence assets in orbit since the 1960s, they have done so mostly in secrecy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-invest-rs-50000-crore-in-northeast-over-next-decade-says-gautam-adani-2729269-2025-05-23",
      "headline": "Adani Group to invest Rs 50,000 crore in Northeast over next decadeThe fresh investment commitment comes just months after the Adani Group pledged Rs 50,000 crore in Assam alone, targeting sectors like airports, aero cities, city gas distribution, transmission, cement, and road infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-murshidabad-bengal-waqf-violence-anatomy-of-riot-politics-trinamool-congress-2729145-2025-05-23",
      "headline": "Operation Murshidabad Exclusive Part 1: Anatomy of a riot, politics behind itIndia Today's post-riot investigation—now corroborated by the findings of a Calcutta High Court-appointed fact-finding committee—reveals a troubling ecosystem of silence and complicity. India Today TV spoke to minors involved in the arson, eyewitnesses, and senior investigating officers who were privy to the developments from day one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/employee-shares-ridiculous-experience-of-manager-punishing-them-for-doing-more-work-2729323-2025-05-23",
      "headline": "Employee shares 'ridiculous' experience of manager punishing them for doing more workThe employee said their efforts to help coworkers and fill staffing gaps infuriated shift leads who view the initiative as a threat to their authority. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/basic-reproductive-rights-supreme-court-after-tamil-nadu-employee-denied-maternity-leave-on-re-marriage-2729266-2025-05-23",
      "headline": "Supreme Court says maternity leave vital part of women's reproductive rightsThe order came on a petition filed by a Tamil Nadu woman government teacher who was denied maternity leave after the birth of her child from a second marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dmk-leader-deivaseyal-kanimozhi-sexual-assault-marriage-bail-arrest-cbi-probe-2729187-2025-05-23",
      "headline": "DMK worker preyed on her vulnerability, sexually tortured her, says 'third wife'In an exclusive conversation, the woman who accused suspended DMK functionary Deivaseyal of sexually abusing and forcing her into an unregistered marriage, alleged that his wife was also involved. She claims more women were similarly exploited for sexual trafficking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/brs-mlc-k-kavitha-letter-to-ex-cm-kcr-sparks-bjp-brs-future-tie-up-buzz-2729344-2025-05-23",
      "headline": "You should've targeted BJP more, Daddy: Kavitha writes to former chief ministerA letter reportedly written by K Kavitha to her father K Chandrashekhar Rao criticises his silence on key issues. The letter suggesting grassroots discontent in BRS has set off political speculation in Telangana over the party's direction."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-legacy-trophies-laliga-worst-signing-ballon-dor-winner-2729345-2025-05-23",
      "headline": "From LaLiga's worst signing to Ballon d'Or icon: Luka Modric's Real Madrid legacyLuka Modric's Real Madrid journey defied every odd—transforming early criticism into legendary status. From benchwarmer to Ballon d'Or winner, his 13-year spell defined an era of dominance, humility, and unrivalled midfield mastery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luka-modric-real-madrid-exit-emotional-tributes-kylian-mbappe-vinicius-jr-jude-bellingham-2729276-2025-05-23",
      "headline": "Luka Modric gets emotional tributes from Real Madrid stars: Thank you legendLuka Modric bid an emotional farewell to Real Madrid, receiving heartfelt tributes from teammates and legends like Rafael Nadal, honoring his legendary career, unmatched leadership, and lasting impact on the club's historic success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-lsg-avesh-khan-every-game-for-a-win-2729248-2025-05-23",
      "headline": "LSG play every game for a win: Avesh Khan after GT winAfter a string of losses and playoff elimination, Avesh Khan said LSG focused on finishing strong, calling their 33-run win over GT a confidence booster ahead of their final IPL 2025 clash against RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-confidence-booster-avesh-khan-season-end-on-high-2729245-2025-05-23",
      "headline": "GT win was a boost: Avesh Khan says LSG aim to end IPL 2025 strongAvesh Khan believes LSG's morale-boosting win over Gujarat Titans showed their intent to finish IPL 2025 on a strong note, even after crashing out of the playoffs race earlier this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-team-news-lucknow-pitch-report-2729242-2025-05-23",
      "headline": "RCB aim to strengthen top two grip, out-of-form SRH look for prideIPL 2025, RCB vs SRH: Royal Challengers Bengaluru will be looking to secure a crucial win when they lock horns with the Sunrisers Hyderabad on May 23 at the Ekana Stadium in Lucknow. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-andy-flower-rcb-head-coach-andy-flower-press-conference-2729209-2025-05-23",
      "headline": "Not too concerned: RCB head coach on long 20-day break before SRH clashIPL 2025, RCB vs SRH: Royal Challengers Bengaluru haven't played any games in the last 20 days, but head coach Andy Flower said that it's not an area of concern for Rajat Patidar's men. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/two-tier-test-cricket-format-michael-vaughan-clarity-and-narrative-2729198-2025-05-23",
      "headline": "Two-tier Test cricket needed to give the format a narrative: VaughanFormer England captain Michael Vaughan has backed the introduction of a two-league Test cricket structure, arguing that the format needs narrative clarity and consistent top-tier competition to stay relevant in the modern era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-james-franklin-rcb-vs-srh-press-conference-2729200-2025-05-23",
      "headline": "After a poor start, it was a mountain to climb for SRH: James FranklinIPL 2025, RCB vs SRH: In the pre-match press conference, bowling coach James Franklin said that it was always going to be a tough ask for the Sunrisers Hyderabad to make a comeback after a poor start to their campaign.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-james-franklin-motivation-2729192-2025-05-23",
      "headline": "James Franklin upbeat for RCB clash: No lack of motivationIPL 2025, RCB vs SRH: Sunrisers Hyderabad bowling coach James Franklin said that there's no lack of motivation in the Orange Army camp despite their elimination from the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-matteo-arnaldi-geneva-open-semis-2729171-2025-05-23",
      "headline": "Novak Djokovic avenges Madrid defeat vs Arnaldi, storm into semisLast month, Djokovic lost to Matteo Arnaldi in the Italian Open, but the 24-time Grand Slam champion beat his Italian opponent in straight sets in the quarterfinal of the Geneva Open. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-justin-langer-lsg-2729157-2025-05-23",
      "headline": "Strong Rishabh Pant has my respect: Justin LangerLucknow Super Giants head coach Justin Langer said that Rishabh Pant had his respect for the way that he carried himself around in a tough personal season. Pant's numbers have seen historic lows in his first outing with the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/two-tier-test-cricket-format-michael-vaughan-clarity-and-narrative-2729198-2025-05-23",
      "headline": "Two-tier Test cricket needed to give the format a narrative: VaughanFormer England captain Michael Vaughan has backed the introduction of a two-league Test cricket structure, arguing that the format needs narrative clarity and consistent top-tier competition to stay relevant in the modern era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-james-franklin-rcb-vs-srh-press-conference-2729200-2025-05-23",
      "headline": "After a poor start, it was a mountain to climb for SRH: James FranklinIPL 2025, RCB vs SRH: In the pre-match press conference, bowling coach James Franklin said that it was always going to be a tough ask for the Sunrisers Hyderabad to make a comeback after a poor start to their campaign.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-james-franklin-motivation-2729192-2025-05-23",
      "headline": "James Franklin upbeat for RCB clash: No lack of motivationIPL 2025, RCB vs SRH: Sunrisers Hyderabad bowling coach James Franklin said that there's no lack of motivation in the Orange Army camp despite their elimination from the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-matteo-arnaldi-geneva-open-semis-2729171-2025-05-23",
      "headline": "Novak Djokovic avenges Madrid defeat vs Arnaldi, storm into semisLast month, Djokovic lost to Matteo Arnaldi in the Italian Open, but the 24-time Grand Slam champion beat his Italian opponent in straight sets in the quarterfinal of the Geneva Open. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-justin-langer-lsg-2729157-2025-05-23",
      "headline": "Strong Rishabh Pant has my respect: Justin LangerLucknow Super Giants head coach Justin Langer said that Rishabh Pant had his respect for the way that he carried himself around in a tough personal season. Pant's numbers have seen historic lows in his first outing with the team."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}