{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-up-700-points-nifty-gains-key-reasons-2671218-2025-01-28",
      "headline": "Sensex jumps 800 points: 3 things to know about today's stock market rally Share Market: While global markets were hit due to a slide in AI and tech stocks, Sensex and Nifty displayed resilience and surged sharply, supported by a rally in heavyweight banking and financial services stocks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/deepseek-china-ai-startup-global-technology-stocks-selloff-wall-street-nvidia-openai-microsoft-2671177-2025-01-28",
      "headline": "Explained: Why China's DeepSeek triggered a slide in global AI stocksChinese startup DeepSeek has turned up the heat in the global AI race and its new models have raised hard questions about whether US companies can keep their edge as the landscape shifts beneath their feet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-open-higher-despite-tech-sell-off-sparked-by-deepseek-2671137-2025-01-28",
      "headline": "Sensex, Nifty open higher despite global tech sell-off sparked by DeepSeek Share Market Today: The S&P BSE Sensex was up 366.45 points to 75,732.62 at around 9:16 am, while the NSE Nifty50 rose 111.25 points to trade at 22,940.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-us-chipmaker-biggest-market-loss-in-history-deepseek-china-tech-shockwaves-2671112-2025-01-28",
      "headline": "Nvidia plunges $593 billion as DeepSeek soars, biggest market loss in historyUS chipmaker Nvidia dived 17 per cent, wiping off nearly USD 593 billion in the biggest market capitalisation loss in history, following a wave of selling as China's DeepSeek developed a free AI assistant using lower-cost chips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-business-loan-differs-from-a-personal-loan-interest-emis-guideline-2670901-2025-01-27",
      "headline": "How business loan differs from a personal loan?Personal loans can be taken for almost anything, be it meeting medical expenses, buying a car or house, for marriage of a son or daughter, etc."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-oil-turns-to-sweet-crude-as-russian-oil-supplies-tighten-report-2670897-2025-01-27",
      "headline": "Indian Oil turns to sweet crude as Russian oil supplies tighten: ReportThe United States recently imposed sweeping sanctions on Russia, targeting its oil producers and shipping networks. This has made it difficult for many countries, including India, to continue sourcing Russian crude oil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-ceos-4-month-salary-beats-sunder-pichai-and-tim-cook-annual-pay-who-is-he-2670836-2025-01-27",
      "headline": "This CEO's 4-month salary beats Sunder Pichai and Tim Cook's annual pay. Who is he?Niccol, who was earlier the CEO of Chipotle, joined Starbucks in September 2024. He was granted a $5 million sign-on bonus within the first month of stepping into his new role as revealed in company filings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-founder-sridhar-vembu-to-take-new-role-steps-down-as-ceo-social-media-post-shailesh-kumar-davey-2670853-2025-01-27",
      "headline": "Zoho founder Sridhar Vembu to take new role, steps down as CEOSridhar Vembu resigns as Zoho CEO: As part of the leadership transition, Sridhar Vembu has handed over the role of group CEO to Shailesh Kumar Davey, a co-founder of the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-dalal-street-bleeds-sensex-tanks-824-points-nifty-below-23000-2670815-2025-01-27",
      "headline": "Dalal Street bleeds: Sensex tanks 824 points, Nifty below 23,000The S&P BSE Sensex was down 824.29 points to close at 75,366.17, while the NSE Nifty50 lost 263.05 points to end at 22,829.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-government-may-prioritise-infrastructure-and-introduce-supply-chain-reforms-2670760-2025-01-27",
      "headline": "Budget 2025: Will government prioritise infrastructure and supply-chain reforms? Budget 2025 Expectations: Experts hope that Budget 2025 might announce key reforms to strengthen the infrastructure sector, which is the backbone of the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shark-tank-india-judge-startups-losing-money-harsh-goenka-shares-post-x-2670790-2025-01-27",
      "headline": "Are Shark Tank India judges losing money? Harsh Goenka shares insightsHarsh Goenka, Chairman of RPG Group, recently shared insights about financial data that revealed losses in companies owned or co-founded by some of the Shark Tank India judges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-check-expected-salary-hike-fitment-factor-and-key-faqs-2670704-2025-01-27",
      "headline": "8th Pay Commission: Check expected salary hike, and key FAQs8th Pay Commission: The government will soon appoint a chairman and two members to the panel to recommend changes in the pay structure of central government employees."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-investors-lose-rs-10-lakh-crore-whats-ahead-for-dalal-street-sensex-nifty-2670712-2025-01-27",
      "headline": "Stock market crash: Investors lose Rs 10 lakh crore. What's ahead for D-Street? Investors on Dalal Street faced losses as stock markets continued to decline, bringing the market capitalisation of all listed companies on the Bombay Stock Exchange (BSE) down. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/unified-pension-scheme-central-government-scheme-check-eligibility-benefits-and-other-details-2670640-2025-01-27",
      "headline": "Unified Pension Scheme: Check eligibility, benefits and other details hereUnified Pension Scheme: The UPS was approved by the Union Cabinet on August 24, 2024 for nearly 23 lakh central government employees and aims to provide an assured pension benefit for the employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-invites-applications-open-for-new-sebi-chief-who-will-succeed-madhabi-puri-buch-2670636-2025-01-27",
      "headline": "Who will succeed Madhabi Puri Buch? Applications open for new Sebi chiefNew Sebi Chief: The Ministry of Finance has invited applications for the post, with the last date for submission being February 17."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-over-800-points-3-reasons-why-stock-market-is-falling-today-2670616-2025-01-27",
      "headline": "Sensex tanks over 800 points. 3 reasons why stock market is falling todayShare market crash: The S&P BSE Sensex fell 818.36 points to 75,372.10, while the NSE Nifty50 dropped by 257.35 points to 22,834.85 as of 10:35 AM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-sensex-nifty-extend-losses-it-and-metal-stocks-drag-markets-down-2670593-2025-01-27",
      "headline": "Sensex, Nifty extend losses; IT and metal stocks drag markets downStock Market Today: The S&P BSE Sensex tanked 378.29 points to 75,812.17, while the NSE Nifty50 was down by 92.40 points to 22,999.80 as of 9:45 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-to-expect-from-senex-nifty-will-bears-dominate-stock-market-5-things-investors-should-know-2670388-2025-01-26",
      "headline": "Will bears dominate stock market next week? 5 things investors should knowCorporate earnings and key economic data from around the world will likely shape the direction of the stock market, keeping investors on their toes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/70-hour-workweek-are-indians-working-more-or-less-than-the-world-report-work-life-balance-debate-2670331-2025-01-26",
      "headline": "70-hour workweek: Are Indians working more or less than the world?70-hour workweek: It started with Infosys founder Naryana Murthy's statement that young Indians should work 70-hour workweeks for India to develop, which was met with a lot of flak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-middle-class-expectations-5-top-expectations-for-tax-relief-savings-growth-2670054-2025-01-25",
      "headline": "Budget 2025: 5 top middle-class expectations for tax relief and savings growthExperts suggest scrapping the old tax regime and rationalising the income tax slabs under the new regime, would go a long way in making income tax simpler."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-wi-ha-joon-on-bts-v-cameo-rumours-in-squid-game-3-spills-the-beans-on-s2-2671155-2025-01-28",
      "headline": "IT Exclusive: Wi Ha-joon on BTS' V cameo rumours in Squid Game 3, spills the beans on S2In an exclusive chat with India Today's Bhavna Agarwal, Wi Ha-jun of Squid Game shared insights on staying grounded despite his meteoric rise to fame, addressed concerns about Jun-ho's reduced screen time in Season 2, and expressed his desire to star in a Bollywood action movie. He also reacted to rumors of BTS' V making a cameo in Squid Game 3."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-squid-game-2s-lee-byung-hun-on-frontman-gi-hun-bollywood-working-in-hollywood-2671151-2025-01-28",
      "headline": "IT Exclusive: Squid Game 2's Lee Byung-hun on Frontman-Gi-hun, BollywoodIn an exclusive chat with India Today's Bhavna Agarwal, Squid Game actor Lee Byung-hun explored his character's evolution into an active player this season, the nuanced dynamics with Gi-hun (Lee Jung-jae), and the rising global prominence of Korean content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-to-face-off-against-manoj-bajpayee-in-the-family-man-3-2671005-2025-01-27",
      "headline": "Jaideep Ahlawat to face off against Manoj Bajpayee in The Family Man 3: ReportPataal Lok's Jaideep Ahlawat is expected to play Manoj Bajpayee's nemesis in The Family Man 3. The makers wrapped up shooting the web series  in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sharda-sinha-son-calls-her-long-awaited-padma-vibhushan-honour-matter-of-pride-2670945-2025-01-27",
      "headline": "Sharda Sinha's son calls her 'long awaited' Padma Vibhushan honour 'matter of pride'Sharda Sinha, the legendary folk singer known for her Chhath songs, was posthumously awarded the Padma Vibhushan. Her son called it a proud moment for Bihar and a message to future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-and-actor-dakota-johnson-at-maha-kumbh-2670923-2025-01-27",
      "headline": "Watch: Coldplay's Chris Martin and actor Dakota Johnson at Maha KumbhColdplay's lead singer Chris Martin and his partner and actor Dakota Johnson were seen arriving at the Maha Kumbh Mela 2025. The band recently concluded the final leg of its Indian concert in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-actor-wi-ha-jun-wants-to-do-a-bollywood-action-film-2670878-2025-01-27",
      "headline": "Squid Game actor Wi Ha-jun wants to do a Bollywood action filmSouth Korean star Wi Ha-jun wants to do a Bollywood action film. In a conversation with India Today Digital, he also opened up about BTS singer V's rumoured cameo appearance in Squid Game Season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-trailer-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-premiere-on-february-7-2670852-2025-01-27",
      "headline": "Mrs trailer: Sanya Malhotra leads film about a woman's quest for her identityThe trailer of Mrs released on January 27. Featuring Sanya Malhotra in the main role, the film will release on Zee 5 on February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wont-perform-infrastructure-remark-social-media-criticism-reactions-coldplay-ahmedabad-concert-2670783-2025-01-27",
      "headline": "X users turn on Diljit Dosanjh after Coldplay's Ahmedabad triumph: Stop complainingAfter Coldplay's massive final concert in Ahmedabad, singer Diljit Dosanjh came under fire from X users for his remarks that he would not perform in India again due to inadequate infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-lee-byung-hun-on-squid-game-2-frontman-chemistry-with-gi-hun-hollywood-and-indian-cinema-2670759-2025-01-27",
      "headline": "Exclusive: Lee Byung-hun on Lee Jung-jae, Squid Game 2, working in BollywoodLee Byung-hun recently sat down with India Today Digital where he discussed Squid Game, his chemistry with Lee Jung-jae, and if he would work in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-video-singer-guru-randhawa-celebrates-republic-day-soldiers-in-baramulla-kashmir-2670727-2025-01-27",
      "headline": "Watch: Singer Guru Randhawa celebrates Republic Day with soldiers in KashmirGuru Randhawa marked Republic Day in Baramulla, Kashmir, with soldiers. He paid tribute to their service and was honoured by the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-makes-history-with-ahmedabad-concert-but-it-is-not-a-world-record-2670745-2025-01-27",
      "headline": "Coldplay makes history with Ahmedabad concert, but it's not a world recordColdplay on Sunday created history by delivering its biggest-ever concert in Ahmedabad, Gujarat. However, the band couldn't surpass the world record of having the largest number of attendees at a concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-trailer-pratik-gandhi-and-yami-gautam-promise-a-fun-valentines-film-2670729-2025-01-27",
      "headline": "Dhoom Dhaam trailer: Pratik Gandhi and Yami Gautam promise a fun Valentine's filmThe first trailer of the upcoming Netflix release, Dhoom Dhaam, is here. The film promises an exciting blend of romance and adventure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-dakota-johnson-stroll-in-ahmedabad-post-coldplays-biggest-concert-january-26-2670659-2025-01-27",
      "headline": "Chris Martin, Dakota Johnson stroll in Ahmedabad post Coldplay's biggest concertChris Martin and Dakota Johnson were seen strolling in Ahmedabad post Coldplay's grand concert. The couple was spotted on Judges Road, surrounded by fans and bodyguards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-upset-alka-yagnik-shreya-ghoshal-kishore-kumar-padma-awards-2025-2670672-2025-01-27",
      "headline": "Sonu Nigam upset over Alka Yagnik, Shreya Ghoshal not receiving Padma awardsPadma Awards 2025: Singer Sonu Nigam expressed his thoughts on Alka Yagnik, Shreya Ghoshal and other prominent Indian singers not receiving Padma awards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-becomes-first-international-artiste-to-perform-in-bhutan-2670655-2025-01-27",
      "headline": "Video: Ed Sheeran becomes first international artiste to perform in BhutanBritish singer Ed Sheeran has become the first international artiste to perform in Bhutan. Ed reflected on the experience on social media and said that he was happy and honoured to have held a concert in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-11-hanumantha-lamani-wins-trophy-kichcha-sudeep-bids-adieu-to-reality-show-2670577-2025-01-27",
      "headline": "Bigg Boss Kannada 11: Hanumantha Lamani wins trophy, Sudeep bids adieu to showHanumantha Lamani, who was a wild card entrant on the show, won Bigg Boss Kannada Season 11. Host Kichcha Sudeep bid adieu to the reality show after 11 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-wraps-india-tour-we-will-never-forget-two-weeks-chris-martin-2670548-2025-01-27",
      "headline": "Coldplay signs off after whirlwind India tour: We'll never forget these two weeksColdplay held its biggest-ever concert in Ahmedabad, India, on January 26. Sharing a photo of the packed stadium, the British rock band said that they will never forget the two weeks they spent in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-pauses-my-universe-to-ensure-fan-safety-at-ahmedabad-show-2670513-2025-01-26",
      "headline": "Chris Martin pauses My Universe to ensure fan safety at Ahmedabad showDuring Sunday's concert in Ahmedabad, Coldplay's lead singer Chris Martin paused mid-performance to ensure the safety of a fan. The moment was captured during the show's live-streaming on Disney+ Hotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/coldplay-chris-martin-indian-band-telangana-ahmedabad-concert-2670511-2025-01-26",
      "headline": "Chris Martin jokes he is from Telangana, calls Coldplay an Indian bandDuring their recent performance in India, Coldplay's lead singer, Chris Martin, joked about being born here. The British rock band concluded their India tour with a final concert in Ahmedabad on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-sings-everglow-with-fan-couple-at-ahmedabad-concert-2670485-2025-01-26",
      "headline": "Chris Martin sings Everglow with fan couple at Ahmedabad concertDuring the Ahmedabad concert, Chris Martin performed Coldplay's popular song Everglow with a fan couple. The heartfelt moment was streamed live on Disney+ Hotstar."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pm-modi-illegal-immigration-us-india-h1b-visa-issue-phone-call-2671168-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says PM 'will do what's right' in taking back undocumented Indians from USAmid reports that India and the US identified 18,000 undocumented Indians in America, President Donald Trump said Prime Minister Narendra Modi \"will do what's right\" when it came to taking back Indian immigrants who are living in the US illegally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baghpat-stage-collapse-jain-nirvana-mahotsav-deaths-injured-2671164-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 killed, 40 injured in stage collapse at Jain religious event in UP's BaghpatBaghpat Stage Collapse: A makeshift stage prepared for devotees collapsed under their weight, killing 5 and injuring at least 40 people, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/vivek-ramaswamy-elon-musk-doge-exit-us-ohio-governor-bid-donald-trump-presidency-2671190-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vivek Ramaswamy asked if Elon Musk fired him from DOGE. He respondsVivek Ramaswamy denied rumours of a rift with Elon Musk, a week after the Indian-origin entrepreneur quit the Department of Goverment Efficiency (DOGE) and teased an Ohio governor's bid, saying he would be running for elected office soon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/deepseek-china-ai-startup-global-technology-stocks-selloff-wall-street-nvidia-openai-microsoft-2671177-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Explained: Why China's DeepSeek triggered a slide in global AI stocksChinese startup DeepSeek has turned up the heat in the global AI race and its new models have raised hard questions about whether US companies can keep their edge as the landscape shifts beneath their feet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-border-czar-tom-homan-selena-gomez-tearful-video-on-raids-no-apologies-2671107-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump border czar reacts to Selena Gomez's tearful video on raids: No apologiesSelena Gomez posted - and then deleted - a video of her sobbing over the mass deportations that have taken place in President Donald Trump's first week back in office as part of his crackdown on illegal immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-up-700-points-nifty-gains-key-reasons-2671218-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex jumps 800 points: 3 things to know about today's stock market rally Share Market: While global markets were hit due to a slide in AI and tech stocks, Sensex and Nifty displayed resilience and surged sharply, supported by a rally in heavyweight banking and financial services stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/i-140-form-petition-h1b-visa-petition-indians-form-green-card-permanent-residency-new-executive-order-trump-2670952-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The I-140 gateway: How temporary H-1B visa leads to permanent residency in USThe H-1B visa system, used by mostly by American companies to hire Indians, is under the scanner after now-President Donald Trump made immigration and employment key campaign issues. How is the temporary H-1B visa, which affords a maximum six-year stay in the US, used for permanent residency? Here's all about the I-140 petition    that is the gateway to the US Green Card and permanent residency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/infosys-co-founder-kris-gopalakrishnan-sc-st-case-others-bengaluru-police-complaint-2671102-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against Infosys co-founder Kris Gopalakrishnan, 17 others for 'slurs'Infosys co-founder Senapathy Kris Gopalakrishnan and 17 others are facing a case under the SC-ST Act after the complainant, a former IISc professor, claimed he was unfairly targeted in a honey trap case in 2014, leading to his dismissal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/delhi-assembly-election-2025-aap-bjp-congress-who-is-promising-what-for-delhi-2670959-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP vs BJP vs Congress - who's promising what for DelhiDelhi Assembly Elections 2025: The Aam Aadmi Party, Bharatiya Janata Party, and Congress have unveiled a range of promises to attract Delhi voters in the lead-up to the upcoming assembly elections. Here's who's offering what."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-pm-modi-us-visit-fair-trade-ties-cooperation-white-house-phone-call-2671119-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says PM may visit US next month after 'productive' phone callPrime Minister Narendra Modi and US President Donald Trump, in their \"productive\" phone call, sought a move towards \"fair\" trade ties and deeper bilateral cooperation, the White House said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-us-chipmaker-biggest-market-loss-in-history-deepseek-china-tech-shockwaves-2671112-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nvidia plunges $593 billion as DeepSeek soars, biggest market loss in historyUS chipmaker Nvidia dived 17 per cent, wiping off nearly USD 593 billion in the biggest market capitalisation loss in history, following a wave of selling as China's DeepSeek developed a free AI assistant using lower-cost chips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/google-map-gulf-of-mexico-rename-gulf-of-america-us-users-2671101-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Google to change Gulf of Mexico to 'Gulf of America' in Maps for US usersThe change will be visible in the US, but the name will remain \"Gulf of Mexico\" in Mexico. Outside the two countries, users will see both names on Google Maps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/why-wellness-retreats-in-india-are-stealing-the-global-spotlight-2670961-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why wellness retreats in India are stealing the global spotlightIndia, with its deep-rooted wellness heritage and diverse offerings, is perfectly poised to cater to this growing demand for wellness retreats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-yamuna-water-poison-ammonia-kejriwal-haryana-nayab-saini-atishi-2671132-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP to sue Arvind Kejriwal over 'Yamuna poisoning' claim, 'Hang me,' he responds Delhi Assembly Elections 2025: Arvind Kejriwal, citing high levels of ammonia in the Yamuna, claimed that the Nayab Singh Saini-led BJP government in Haryana was deliberately mixing poison in the river to disrupt water supply in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dowry-law-misuse-society-has-to-change-sc-guidelines-2671159-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Society must change: Top court rejects plea for guidelines on dowry law misuseDowry Law Misuse: Rejecting a petition seeking guidelines to address the misuse of dowry laws, the Supreme Court highlighted that while Parliament has enacted the law, societal change is necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-ceo-sam-altman-calls-rival-deepseek-impressive-promises-to-deliver-agi-soon-2671152-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "OpenAI CEO Sam Altman calls rival DeepSeek impressive, promises to deliver AGIOpenAI CEO Sam Altman has praised its rival company, DeepSeek. He calls its R1 model \"impressive\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-and-mg-ramachandran-mgr-references-in-films-2670811-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cinema to politics: Thalapathy Vijay's Jana Nayagan and the MGR InfluenceThe two posters of Vijay's last films, Jana Nayagan, drew parallels with legendary actor-politician MGR (MG Ramachandran). In the past, Vijay used MGR references in his films and public speeches as well. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-olive-ridley-turtle-deaths-on-chennai-coast-have-raised-alarm-2670857-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Olive Ridley turtle deaths on Chennai coast have raised alarmWith over 1,000 deaths in January, the National Green Tribunal has threatened to impose a total ban on fishing during turtle nesting season if regulations continue to be flouted\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-prayagraj-mahakumbh-flight-tickets-expensive-travelling-maldives-2670942-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A roundtrip to Maha Kumbh can be more expensive than travelling to MaldivesMaha Kumbh 2025: High airfares during the key snan days of the Maha Kumbh could negatively impact Indian tourism, especially in comparison to leading international destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-joins-delhi-ranji-trophy-team-training-arun-jaitley-stadium-return-domestic-cricket-2671160-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli joins Delhi Ranji team, begins training at Arun Jaitley StadiumVirat Kohli joined Delhi Ranji Trophy squad in their training session at the Arun Jaitely Stadium on January 28, ahead of his return to domestic cricket in the side's upcoming clash against Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-confirms-relationship-partner-comment-does-not-mention-vijay-deverakonda-2671124-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Rashmika Mandanna confirms being in a relationshipRashmika Mandanna has confirmed being in a relationship but did not reveal her partner's name. She is rumoured to be dating her Dear Comrade co-star, Vijay Deverakonda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-income-tax-federal-import-duty-tariff-abolished-cuts-2671094-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump pushes to abolish income tax: Tax foreign nations, enrich our peopleUS President Donald Trump called for a return to a tariff-based economic system to boost revenue and enrich citizens as he reiterated his proposal to abolish income tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/revanth-reddy-pm-narendra-modi-mahmud-ghazni-bjp-demands-apology-2671086-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revanth Reddy likens PM to invader Mahmud of Ghazni, BJP demands apologyTelangana Chief Minister Revanth Reddy, addressing the 'Jai Bapu, Jai Bhim, Jai Samvidhaan' rally, alleged that Prime Minister Narendra Modi was attempting to change the Constitution and repeal job reservations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-pm-candidate-chrystia-freeland-donald-trump-tariff-retaliation-list-2671125-2025-01-28?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada's PM hopeful to fight against Trump's tariffs with 'retaliation list'A list of products worth 200 billion Canadian dollars would send a message to US exporters about the harm tariffs would cause them, former Finance Minister Chrystia Freeland said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/superboys-of-malegaon-theatrical-release-date-out-reema-kagti-zoya-akhtar-february-28-2671204-2025-01-28",
      "headline": "Superboys of Malegaon to release in theatres on this dateReema Kagti's film Superboys of Malegaon will premiere in theatres worldwide on February 28, 2025, and later stream on Prime Video. The film, inspired by real events, has been acclaimed at major film festivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-r-madhavan-begin-shooting-for-untitled-psychological-thriller-2671179-2025-01-28",
      "headline": "Kangana Ranaut, R Madhavan reunite after a decade, start filming their nextUpcoming Psychological Thriller: Actor and MP Kangana Ranaut is all set to reunite with R Madhavan for their untitled next. Kangana announced the same with a BTS picture from the shooting sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sky-force-box-office-collection-day-4-detailed-report-slow-monday-for-akshay-kumar-film-nears-rs-70-crore-2671172-2025-01-28",
      "headline": "Sky Force box office Day 4: Slow Monday for Akshay Kumar's film, nears Rs 70 croreSky Force box office collection Day 4: Sky Force performed well in its opening weekend at the box office. However, the Akshay Kumar-starrer slowed down on its first Monday, taking the four-day total to near Rs 70 crore nett in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-and-mg-ramachandran-mgr-references-in-films-2670811-2025-01-28",
      "headline": "Cinema to politics: Thalapathy Vijay's Jana Nayagan and the MGR InfluenceThe two posters of Vijay's last films, Jana Nayagan, drew parallels with legendary actor-politician MGR (MG Ramachandran). In the past, Vijay used MGR references in his films and public speeches as well. \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-amelia-kerr-smriti-mandhana-icc-womens-cricketer-of-the-year-award-new-zealand-2671225-2025-01-28",
      "headline": "New Zealand sensation Amelia Kerr named Women's Cricketer of the Year New Zealand all-rounder Amelia Kerr won the ICC Women's Cricketer of the Year award after a stellar 2024 where she also became the Player of the Tournament in the Women's T20 World Cup in the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/virat-kohli-joins-delhis-ranji-trophy-squad-ahead-of-return-to-domestic-cricket-2671219-2025-01-28",
      "headline": "Virat Kohli joins Delhi's Ranji trophy squad ahead of return to domestic cricketIndian batter Virat Kohli has joined Delhi's Ranji Trophy squad in preparation for his return to domestic cricket. Kohli returns to the Ranji Trophy after 12 years, set to play for Delhi against Railways, his first appearance since facing Uttar Pradesh in 2012."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-travis-head-opener-1st-test-2671207-2025-01-28",
      "headline": "Travis Head named opening partner for Usman Khawaja in 1st Test SL vs AUS: Australia skipper Steve Smith confirmed that Travis Head would open the batting alongside Usman Khawaja in the opening Test in Galle. Head was picked as the opener, ahead of Sam Konstas and Nathan McSweeney. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-atp-wta-rankings-eva-lys-paula-badosa-2671183-2025-01-28",
      "headline": "Novak Djokovic climbs in rankings, lucky loser gains big after dream runAustralian Open: Novak Djokovic climbed one place up to No.6 in the ATP rankings. Paula Badosa returned to the top 10 while lucky loser Eva Lys made her debut in the top 100 of the WTA rankings after advancing to the fourth round at Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/david-miller-injury-paarl-royals-vs-durban-super-gianst-south-africa-champions-trophy-scare-2671171-2025-01-28",
      "headline": "South Africa handed injury scare as David Miller picks niggle in SA20 clashDavid Miller's injury during SA20 raises concerns for South Africa's Champions Trophy campaign, compounded by ongoing fitness issues with fast bowler Lungi Ngidi. Both players are crucial to the Proteas' hopes for international glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-australia-cricket-test-series-squads-live-streaming-steve-smith-2671163-2025-01-28",
      "headline": "Sri Lanka vs Australia Test series: Squads and all you need to know SL vs AUS: Dhananjaya de Silva's Sri Lanka and Steve Smith's Australia will lock horns in a two-match Test series, starting Wednesday, January 29 in Galle. Australia have already qualified for the World Test Championship final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-joins-delhi-ranji-trophy-team-training-arun-jaitley-stadium-return-domestic-cricket-2671160-2025-01-28",
      "headline": "Virat Kohli joins Delhi Ranji team, begins training at Arun Jaitley StadiumVirat Kohli joined Delhi Ranji Trophy squad in their training session at the Arun Jaitely Stadium on January 28, ahead of his return to domestic cricket in the side's upcoming clash against Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rajkot-weather-forecast-smog-pitch-conditions-2671150-2025-01-28",
      "headline": "Will England batters face visibility issues in the 3rd T20I in Rajkot?India vs England, 3rd T20I: Rajkot is expected to offer ideal conditions for a high-scoring T20I contest on Tuesday, January 28. England batters are unlikely to face visibility issues at the Niranjan Shah Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-jos-buttler-t20i-record-rajkot-2671149-2025-01-28",
      "headline": "Jos Buttler eyes all-time T20I record in India before Rajkot clashIND vs ENG: Jos Buttler has a chance to become the leading run-scorer by a visiting batter on Indian soil when England take part in the third T20I on Tuesday, January 28 at the Niranjan Shah Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neymar-al-hilal-contract-mutual-termination-santos-return-transfer-news-2671126-2025-01-28",
      "headline": "Neymar and Al Hilal mutually terminate contract as Santos return imminentNeymar's injury-hit stint at Al Hilal ends as the Brazilian star edges closer to a nostalgic return to his boyhood club Santos, bringing hope for a revival of his career in Brazil's top-flight football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-3rd-t20i-predicted-11-shivam-shami-participation-2670984-2025-01-28",
      "headline": "3rd T20I Predicted 11: Shivam Dube in, Mohammed Shami's participation unclearIndia (IND) vs England (ENG) 3rd T20I Predicted Playing 11: World Cup-winning all-rounder Shivam Dube might replace Dhruv Jurel in India's playing XI for the Rajkot match. However, Mohammed Shami's participation will depend on coach Gautam Gambhir and captain Suryakumar Yadav.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-joins-delhi-ranji-trophy-team-training-arun-jaitley-stadium-return-domestic-cricket-2671160-2025-01-28",
      "headline": "Virat Kohli joins Delhi Ranji team, begins training at Arun Jaitley StadiumVirat Kohli joined Delhi Ranji Trophy squad in their training session at the Arun Jaitely Stadium on January 28, ahead of his return to domestic cricket in the side's upcoming clash against Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rajkot-weather-forecast-smog-pitch-conditions-2671150-2025-01-28",
      "headline": "Will England batters face visibility issues in the 3rd T20I in Rajkot?India vs England, 3rd T20I: Rajkot is expected to offer ideal conditions for a high-scoring T20I contest on Tuesday, January 28. England batters are unlikely to face visibility issues at the Niranjan Shah Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-jos-buttler-t20i-record-rajkot-2671149-2025-01-28",
      "headline": "Jos Buttler eyes all-time T20I record in India before Rajkot clashIND vs ENG: Jos Buttler has a chance to become the leading run-scorer by a visiting batter on Indian soil when England take part in the third T20I on Tuesday, January 28 at the Niranjan Shah Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neymar-al-hilal-contract-mutual-termination-santos-return-transfer-news-2671126-2025-01-28",
      "headline": "Neymar and Al Hilal mutually terminate contract as Santos return imminentNeymar's injury-hit stint at Al Hilal ends as the Brazilian star edges closer to a nostalgic return to his boyhood club Santos, bringing hope for a revival of his career in Brazil's top-flight football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-3rd-t20i-predicted-11-shivam-shami-participation-2670984-2025-01-28",
      "headline": "3rd T20I Predicted 11: Shivam Dube in, Mohammed Shami's participation unclearIndia (IND) vs England (ENG) 3rd T20I Predicted Playing 11: World Cup-winning all-rounder Shivam Dube might replace Dhruv Jurel in India's playing XI for the Rajkot match. However, Mohammed Shami's participation will depend on coach Gautam Gambhir and captain Suryakumar Yadav.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-ranji-trophy-return-live-broadcast-livestreaming-unlikely-delhi-vs-railways-2671116-2025-01-28",
      "headline": "Kohli Ranji Trophy return: Live broadcast unlikely for Delhi vs Railways matchVirat Kohli's Ranji Trophy return for Delhi against Railways has fans excited, but the lack of telecast or live-streaming options may leave them disappointed, marking a rare yet underwhelming moment for those eager to witness the cricket star's domestic comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-3rd-t20i-preview-bazball-suryakumar-yadav-2671064-2025-01-28",
      "headline": "England hope batter-friendly Rajkot aids Bazball, seek turnaround in T20I seriesRajkot is set to host the 3rd T20I of the 5-match series between India and England. Rajkot might be the venue most suited to England's strengths in this series, barring Mumbai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-defender-danilo-leaves-juventus-by-mutual-agreement-2671061-2025-01-27",
      "headline": "Brazil defender Danilo leaves Juventus by mutual agreement Danilo has left Juventus after five and a half years due to a mutual agreement to terminate his contract, the Serie A club announced on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-rajda-nainggolan-cocaine-arrest-2671051-2025-01-27",
      "headline": "Ex-Belgian footballer arrested in cocaine trafficking probeFormer Belgium footballer Radja Nainggolan has been arrested in a cocaine trafficking probe. Brussels federal police carried out thirty searches on Monday, seizing 2.7 kilos of cocaine along with cash and a large number of luxury items.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mumbai-set-to-miss-rohit-yashasvi-shreyas-iyer-for-next-ranji-clash-2671033-2025-01-27",
      "headline": "Mumbai set to miss Rohit Sharma, Yashasvi Jaiswal and Iyer for next Ranji clashRohit Sharma, Yashasvi Jaiswal, and Shreyas Iyer are likely to miss Mumbai's next Ranji Trophy group-stage match against Meghalaya, which begins on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-form-india-vs-england-batting-coach-sitanshu-kotak-2671022-2025-01-27",
      "headline": "Suryakumar playing selfless cricket: Coach says no slump in captain's formSuryakumar Yadav has not been able to dominate with the bat in the T20I series against England. India batting coach Sitanshu Kotak stressed that Suryakumar was not in any kind of slump and backed the captain to score big runs in the next T20I match in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/spain-coach-luis-de-la-fuente-extends-contract-to-2028-2671021-2025-01-27",
      "headline": "Spain coach Luis de la Fuente extends contract with national team to 2028Euro 2024-winning coach Luis de la Fuente has signed a contract extension with the Spanish national men's team to stay at the helm of La Roja till 2028.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-t20i-sanju-samson-training-rajkot-sitanshu-kotak-2671002-2025-01-27",
      "headline": "Troubled by Jofra Archer, Sanju Samson hones skills against bouncers in RajkotIndia vs England: Watched on by Sitanshu Kotak, wicketkeeper-batter Sanju Samson worked hard on Monday in Rajkot to improve his batting against short balls. Samson was dismissed by Jofra Archer in the first two T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mumbai-set-to-miss-rohit-yashasvi-shreyas-iyer-for-next-ranji-clash-2671033-2025-01-27",
      "headline": "Mumbai set to miss Rohit Sharma, Yashasvi Jaiswal and Iyer for next Ranji clashRohit Sharma, Yashasvi Jaiswal, and Shreyas Iyer are likely to miss Mumbai's next Ranji Trophy group-stage match against Meghalaya, which begins on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-form-india-vs-england-batting-coach-sitanshu-kotak-2671022-2025-01-27",
      "headline": "Suryakumar playing selfless cricket: Coach says no slump in captain's formSuryakumar Yadav has not been able to dominate with the bat in the T20I series against England. India batting coach Sitanshu Kotak stressed that Suryakumar was not in any kind of slump and backed the captain to score big runs in the next T20I match in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/spain-coach-luis-de-la-fuente-extends-contract-to-2028-2671021-2025-01-27",
      "headline": "Spain coach Luis de la Fuente extends contract with national team to 2028Euro 2024-winning coach Luis de la Fuente has signed a contract extension with the Spanish national men's team to stay at the helm of La Roja till 2028.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-3rd-t20i-sanju-samson-training-rajkot-sitanshu-kotak-2671002-2025-01-27",
      "headline": "Troubled by Jofra Archer, Sanju Samson hones skills against bouncers in RajkotIndia vs England: Watched on by Sitanshu Kotak, wicketkeeper-batter Sanju Samson worked hard on Monday in Rajkot to improve his batting against short balls. Samson was dismissed by Jofra Archer in the first two T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-sitanshu-kotak-press-conference-rohit-sharma-virat-kohli-ind-vs-eng-2671001-2025-01-27",
      "headline": "New batting coach Sitanshu Kotak to discuss batting plans for Rohit and ViratNewly-appointed India batting coach Sitanshu Kotak has said that he will discuss batting plans with Rohit Sharma and Virat Kohli at the right time. Kotak said that the senior duo come in with a lot of experience, and that he will also learn a lot while working with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-delhi-training-arrangements-spectators-2670987-2025-01-27",
      "headline": "Virat Kohli to train with Delhi team from Tuesday for Ranji Trophy return Ranji Trophy 2024-25: Virat Kohli will begin training with the Delhi squad on Tuesday. The former India captain will play for Delhi against Railways from Januaruy 30 at the Arun Jaitley Stadium in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-arshdeep-singh-haris-rauf-t20i-record-india-vs-england-2670969-2025-01-27",
      "headline": "Unstoppable Arshdeep Singh eyes Haris Rauf's all-time T20I record IND vs ENG: Indian youngster Arshdeep Singh is nearing the record for becoming the fastest pacer to the landmark of 100 wickets in Men's T20Is. Pakistan's Haris Rauf currently holds the record in 71 T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-shami-fitness-sitanshu-kotak-reaction-2670950-2025-01-27",
      "headline": "Shami fit but Suryakumar-Gambhir will decide if he plays in Rajkot: Sitanshu KotakIndia's new batting coach, Sitanshu Kotak, dismissed any fitness concerns surrounding Mohammed Shami but added that Suryakumar Yadav and Gautam Gambhir will decide the pacer's participation in the series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}