{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-corporate-taxpayers-extended-november-15-2623581-2024-10-26",
      "headline": "ITR filing deadline for corporate taxpayers extended till November 15ITR filing deadline: The extension applies to taxpayers covered under sub-Section (1) of Section 139 of the Income-tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-latest-gmp-dips-stock-market-debut-listing-expectations-investors-2623572-2024-10-26",
      "headline": "Waaree Energies IPO: GMP drops before listing; should investors worry?Waaree Energies listing expectations: With the company set to debut on October 28, Waaree Energies' GMP currently stands around Rs 1,320, reflecting a potential listing premium of 88% over the IPO issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rs-220-crore-bank-fraud-case-ed-raids-pharma-company-sharon-bio-medicine-limited-2623480-2024-10-26",
      "headline": "ED raids in Mumbai, Haryana against pharma company in Rs 220-crore fraud caseDuring the search operations in Mumbai and Haryana's Yamunanagar, movable assets including bank funds, Demat accounts valued at Rs 14.53 crore were seized or frozen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-1-check-latest-subscription-gmp-expected-listing-gains-2623281-2024-10-25",
      "headline": "Afcons Infrastructure IPO Day 1: Check latest subscription, GMP Afcons Infrastructure's IPO aims to raise Rs 5,430 crore and consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-dalal-street-losing-streak-foreign-investor-exodus-dull-q2-earnings-2623206-2024-10-25",
      "headline": "Sensex, Nifty continue losing streak amid ongoing FII exodus, dull Q2 earnings At the closing bell, the Sensex was down 662.87 points at 79,402.29, while the NSE Nifty50 settled 189.55 points lower at 24,209.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-view-will-it-double-your-money-gmp-here-what-experts-say-2623194-2024-10-25",
      "headline": "Waaree Energies IPO: Will it double your investment? Here's what experts sayWaaree Energies IPO attracted significant interest from investors and was subscribed 79.44 times by the end of the bidding process on October 23, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex falls 800 points: Should investors buy the dip or hold back?Stock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's estate worth Rs 10,000 crore: Who gets what in his will Ratan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dixon-technologies-shares-fall-over-9-percent-after-rally-short-lived-hit-record-high-should-you-buy-2623056-2024-10-25",
      "headline": "Explained: Why Dixon Technologies share price tumbled over 9% after early rallyThe company's stock reached a peak of Rs 15,999.95, rising by 6.21% after releasing impressive Q2 earnings on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-opens-for-bidding-subscribe-skip-good-bad-latest-gmp-review-2623022-2024-10-25",
      "headline": "Afcons Infrastructure IPO opens for bidding: Should you subscribe or skip? Afcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-check-latest-gmp-stock-market-debut-date-and-expected-listing-gains-2623028-2024-10-25",
      "headline": "Waaree Energies IPO: Check GMP, allotment details, listing date and expected gainsWaaree Energies IPO: With allotments finalised on October 24, the public issue is expected to have a bumper listing on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-key-reasons-behind-decline-foreign-investors-fiis-volatility-overvaluation-2622987-2024-10-25",
      "headline": "Sensex drops below 80,000 as market slide continues. What's behind the dip? Sensex plunges below 80,000. What's fueling the sharp decline? Check the key factors behind the distress on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-declines-18-percent-q2-net-profit-tumbles-buy-hold-sell-brokerage-views-2622974-2024-10-25",
      "headline": "IndusInd Bank share price dips 18% after Q2 results. Should you buy, sell or hold?In the second quarter, IndusInd Bank's net profit plunged 39% year-on-year to Rs 1,325 crore, falling significantly short of what the market had expected. In comparison, the profit stood at Rs 2,181.47 crore in the same quarter a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-volatility-itc-indusind-bank-share-price-q2-results-2622971-2024-10-25",
      "headline": "Sensex, Nifty continue slide amid volatility; IndusInd Bank tumbles 15%The S&P BSE Sensex was down 370.19 points to 79,694.97 at 10:02 am, while the NSE Nifty50 declined 141 points to trade at 24,258.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-25-2024-precious-metals-witness-dip-on-mcx-latest-rates-2622961-2024-10-25",
      "headline": "Gold, silver price today, October 25, 2024: Precious metals witness dip on MCXGold Price Today October 25, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-canada-tensions-hit-trade-leaving-business-owners-in-a-bind-2622688-2024-10-24",
      "headline": "India-Canada tensions hit trade, leaving business owners in a bindTotal trade between both nations since 2021, was at roughly $6 billion, increased to $9 billion in 2022, but dropped to $8 billion in 2023 as per data from the consulate general of India on commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-mukesh-ambani-nvidia-jensen-huang-partner-to-build-large-scale-ai-infrastructure-in-india-2622561-2024-10-24",
      "headline": "Reliance, Nvidia partner to build large-scale AI infrastructure in IndiaThe partnership will see Reliance deploying Nvidia's latest GB 200 supercomputer technology to build a massive AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-date-expectations-double-investors-wealth-listing-over-rs-3000-latest-gmp-2622558-2024-10-24",
      "headline": "Waaree Energies IPO to double investors wealth? Here is what we knowWith the latest grey market premium (GMP) suggesting a sharp increase, Waaree Energies IPO is expected to deliver substantial returns to investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-fmcg-stocks-hul-nestle-india-top-losers-2622526-2024-10-24",
      "headline": "Sensex, Nifty end flat as FMCG stocks fall; HUL, Nestle India top losersThe S&P BSE Sensex was down 16.82 points to 80,065.16 at the closing bell, while the NSE Nifty50 ended 36.10 points lower at 24,399.40."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-conducting-precise-strikes-on-military-targets-in-iran-says-israeli-defence-forces-2623484-2024-10-26",
      "headline": "Op Days of Repentance: Israel pounds Iranian military targets, two soldiers killed  Live UpdatesThe Israeli attack on Iran risks escalating the ongoing conflict into an all-out war across the Middle East, where Hamas in Gaza and Hezbollah in Lebanon are already engaged in a fight with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/washington-post-endorsement-us-president-subscription-cancellations-jeff-bezos-2623533-2024-10-26",
      "headline": "Washington Post's US poll decision sparks spree of subscription cancellationsWithin 24 hours of the Washington Post's decision not to endorse any candidate, a first in 36 years, more than 2,000 readers cancelled their subscriptions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-teen-jumps-off-roof-suicide-after-failing-to-clear-jee-leaves-note-jamia-nagar-2623606-2024-10-26",
      "headline": "Forgive me: Delhi teen jumps off roof after failing to clear JEE, leaves noteThe 17-year-old student jumped to her death from the seventh floor of a residential building, leaving a suicide note that read, \"Forgive me, I couldn't do it\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-female-producers-want-2623543-2024-10-26",
      "headline": "What female producers want? India Today Digital spoke to the leading female producers in the Hindi film industry to understand how they work differently than men, their creative conflicts, ideation processes, choices, and their idea of championing a change in the industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/commonwealth-leaders-slavery-equality-british-prime-minister-keir-starmer-2623632-2024-10-26",
      "headline": "'Time has come' for discussion on slavery reparations, Commonwealth leaders say The Commonwealth leaders agreed that the time has come for a meaningful, truthful and respectful conversation towards forging a common future based on equity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/gaza-at-a-crossroads-it-is-time-to-smell-the-arabica-opinion-2623414-2024-10-26",
      "headline": "Gaza at a crossroads, it's time to smell the ArabicaEven if the settler settlements don't make a comeback, Gazans won't see business as usual anytime soon, that is after the war ends. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-100-fighter-jets-lethal-missiles-strike-iran-military-drone-facilities-2623559-2024-10-26",
      "headline": "100 jets, 20 targets: How Israel hit Iran's military, drone facilitiesIsrael strikes Iran: A total of 100 Israeli fighter jets carried out the attacks in three waves on 20 missile and drone facilities of Iran. Here are the inside details of how 'Operation Days of Repentance' unfolded."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fake-desi-ghee-racket-investigation-amul-counterfeit-adulteration-festive-season-diwali-2623545-2024-10-26",
      "headline": "Why food adulterators have all five fingers in gheeEvery festive season, adulterated food products, including ghee, flood India. Dairy giant Amul has issued a public warning about counterfeit ghee circulating in the market. This is why food adulterers love ghee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-crime-news-pregnant-teen-killed-buried-haryana-rohtak-marriage-2623561-2024-10-26",
      "headline": "Pregnant teen from Delhi killed, buried by boyfriend over marriage pressureSonia, a 19-year-old girl from West Delhi's Nangloi, was active on social media, where she had over 6,000 followers and had posted images and videos of herself along with her boyfriend Sanju, aka Saleem, police said. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/diljit-dosanjh-coldplay-illegal-concert-ticket-sales-ed-enforcement-directorate-conducts-raids-states-2623598-2024-10-26",
      "headline": "Diljit Dosanjh, Coldplay fake ticket sales: ED conducts raids in 5 statesThe ED has launched a major search across five states to tackle unauthorised ticket sales for Coldplay and Diljit Dosanjh concerts, uncovering a network selling fake or overpriced tickets on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-test-rishabh-pant-run-out-virat-kohli-mitchell-santner-2623604-2024-10-26",
      "headline": "IND vs NZ: Fans bash Virat Kohli for Rishabh Pant's run out on Day 3 in PuneFans began bashing star India batter Virat Kohli after Rishabh Pant's run out on Day 3 of the second Test against New Zealand in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/nvidia-ceo-jensen-huang-says-pm-modi-ahead-of-others-on-ai-asked-him-to-address-ministers-6-years-ago-2623554-2024-10-26",
      "headline": "Nvidia CEO Jensen Huang says PM Modi ahead of others on AIIn a recent conversation with Reliance chairman Mukesh Ambani, Nvidia CEO Jensen Huang recollects how 6 years ago, when no one was talking about AI, PM Modi had asked him to address his cabinet about it. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-bjp-chief-virendra-sachdeva-yamuna-river-protest-toxic-pollution-aap-2623597-2024-10-26",
      "headline": "Delhi BJP chief takes dip in toxic Yamuna in protest against AAP, hospitalisedVirendra Sachdeva was suffering from severe itching and breathing difficulties after taking a dip in the toxic Yamuna River. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-viral-video-angry-ranbir-kapoor-pulls-a-photographer-by-arm-as-he-tries-to-click-him-with-alia-bhatt-2623615-2024-10-26",
      "headline": "Angry Ranbir pulls a photographer by arm as he tries to click him with AliaRanbir Kapoor and Alia Bhatt stepped out with their family for dinner on Friday night. A viral video showed the actor getting angry at a photographer and pulling him away from his car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-vidya-balan-falls-on-stage-but-continues-to-dance-gracefully-on-aami-je-tomar-with-madhuri-dixit-from-bhool-bhulaiyaa-3-2623635-2024-10-26",
      "headline": "Watch: Vidya Balan falls on stage, continues to dance gracefully on Ami Je TomarVidya Balan and Madhuri Dixit were performing on stage when the former stumbled down. The actor made a statement and was cheered on by the crowd as she got up and continued to dance beautifully on the song Ami Je Tomar 3.0 from Bhool Bhulaiyaa 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-business-sports-politics-entertainment-427-25-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/kerala-waynand-bypolls-priyanka-gandhi-congress-rahul-gandhi-2623619-2024-10-26",
      "headline": "Your brave spirit touched me: Priyanka Gandhi's open letter to Waynand The Wayanad bypoll was necessitated after Rahul Gandhi vacated it to retain his Rae Bareli seat in Uttar Pradesh, as he won both seats in the Lok Sabha polls this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/i-went-to-delhi-t3-to-find-out-how-long-airport-goodbyes-take-this-is-what-i-found-2623174-2024-10-26",
      "headline": "I went to Delhi T3 to find out how long airport goodbyes take. This is what I foundThe kiss-and-say-goodbye routine certainly seems to not work with Indians. Families coming to the airport to drop their loved ones off often stay for a minimum of 30 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/the-dogra-rulers-of-jammu-who-united-kashmir-and-ladakh-2622699-2024-10-26",
      "headline": "The Dogra rulers of Jammu who united Kashmir and LadakhFollowing the death of Maharaja Ranjit Singh in 1839, the Sikh empire collapsed, leading to major power shifts and deciding the path of British ambitions in the region. Amidst this chaos, Gulab Singh secured Jammu and Kashmir's sovereignty through the Treaty of Amritsar by paying 75 lakh Nanakshahe rupees to the British, establishing Dogra rule in Jammu and Kashmir with the help of his General, Zorawar Singh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dmk-mp-mm-abdulla-responded-to-hindi-letter-of-union-minister-ravneet-singh-bittu-in-tamil-2623527-2024-10-26",
      "headline": "DMK MP replies to Union Minister's Hindi letter in Tamil: Didn't understandDMK Rajya Sabha MP Pudukkottai MM Abdulla replied in Tamil to Union Minister Ravneet Singh's Hindi letter, saying that he did not understand a word of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-spider-man-4-to-release-in-july-2026-2623569-2024-10-26",
      "headline": "Tom Holland's Spider-Man 4 to release in July, 2026British star Tom Holland is super pumped about Spider-Man 4. The actor shared that he is elated about the script and the filming will begin sometime next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-2024-washington-post-jeff-bezos-kamala-harris-donald-trump-2623491-2024-10-26",
      "headline": "Jeff Bezos shot down Washington Post's endorsement of Kamala Harris, says paperIn a report by The Washington Post — reporting on its own inner workings — cited two anonymous people familiar with the event, saying that an endorsement of Democratic candidate Kamala Harris had been written but was not published."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-says-he-is-burnt-out-2623634-2024-10-26",
      "headline": "Kartik Aaryan says he is burnt out: Don't know anything else but workBollywood star Kartik Aaryan recently opened up about his work and said that he is so focused on his career that he doesn't care about the noise that surrounds him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/ayushmann-khurrana-diwali-party-karan-johar-ali-fazal-richa-chadha-bhumi-pednekar-2623639-2024-10-26",
      "headline": "Ayushmann Khurrana's Diwali party: KJo, Ali-Richa, Bhumi Pednekar, celebs attend Actor Ayushmann Khurrana and wife Tahira Kashyap hosted a Diwali bash for friends from the industry. Take a look at the stars who attended the grand bash. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/watch-vidya-balan-falls-on-stage-but-continues-to-dance-gracefully-on-aami-je-tomar-with-madhuri-dixit-from-bhool-bhulaiyaa-3-2623635-2024-10-26",
      "headline": "Watch: Vidya Balan falls on stage, continues to dance gracefully on Ami Je TomarVidya Balan and Madhuri Dixit were performing on stage when the former stumbled down. The actor made a statement and was cheered on by the crowd as she got up and continued to dance beautifully on the song Ami Je Tomar 3.0 from Bhool Bhulaiyaa 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/honey-singh-says-he-once-spent-rs-38-lakh-in-a-night-in-dubai-2623617-2024-10-26",
      "headline": "Singer Honey Singh says he once spent Rs 38 lakh in a night in DubaiSinger Honey Singh recently opened up about his Dubai escapades and disclosed that he once spent a whopping Rs 38 lakh in a night in Dubai in 2013."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-shan-masood-rawalpindi-2623614-2024-10-26",
      "headline": "Like London buses, they come together: Masood on series win   PAK vs ENG: Shan Masood was delighted after Pakistan won the Rawalpindi Test by nine wickets to claim the three-match Test series 2-1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-dismissed-by-mitchell-santner-pune-test-2623611-2024-10-26",
      "headline": "IND vs NZ: Virat Kohli's Mitchell Santner nightmare continues, out for 17Virat Kohli's woes against Mitchell Santner persist as he falls for 17 in the Pune Test. Santner shines with a career-best performance, unsettling India's batting lineup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-2nd-test-rishabh-pant-run-out-virat-kohli-mitchell-santner-2623604-2024-10-26",
      "headline": "IND vs NZ: Fans bash Virat Kohli for Rishabh Pant's run out on Day 3 in PuneFans began bashing star India batter Virat Kohli after Rishabh Pant's run out on Day 3 of the second Test against New Zealand in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-third-test-ben-stokes-reaction-rawalpindi-2623599-2024-10-26",
      "headline": "England weren't able to match challenges in last 2 Tests: Ben StokesA disappointed Ben Stokes admitted that England were unable to match up to the challenges thrown at them during the last 2 Tests against Pakistan. England ended up losing the series after defeat in Rawalpindi on October 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-series-noman-ali-sajid-khan-rawalpindi-2623594-2024-10-26",
      "headline": "Pakistan beat England by 9 wickets in Rawalpindi to win Test series 2-1 PAK vs ENG: Pakistan beat England by nine wickets in Rawalpindi and won the Test series 2-1 after initially going 1-0 down with an innings defeat in the opening game. Saud Shakeel won the Player of the Match award while Sajid Khan and Noman Ali picked up 19 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-mitchell-santner-anil-kumble-pune-test-2623586-2024-10-26",
      "headline": "How Rohit Sharma was outfoxed by Mitchell Santner, explains Anil KumbleFormer India spinner Anil Kumble revealed how Mitchell Santner planned Rohit Sharma's dismissal on Day 3 of the first Test in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-virat-kohli-run-chase-pune-saba-karim-2623571-2024-10-26",
      "headline": "India will heavily rely on Virat Kohli for Pune Test miracle chase: Saba KarimSaba Karim believes Virat Kohli's performance will be pivotal for India's success as they face a challenging run chase against New Zealand in the Pune Test, needing 359 runs to win. Kohli failed to make a mark in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2024-jemimah-rodrigues-brisbane-heat-2623567-2024-10-26",
      "headline": "Jemimah to miss first 2 games in WBBL, Brisbane Heat name replacement WBBL 2024: Jemimah Rodrigues will miss the first two matches for Brisbane Heat. In her place, the Heat have added Lauren Winfield Hill to their squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-on-t20-world-cup-2024-final-india-vs-south-africa-2623564-2024-10-26",
      "headline": "MS Dhoni reveals his jittery feelings while watching T20 World Cup 2024 finalLegendary India captain MS Dhoni recently opened up on his jittery feelings while watching the final of the T20 World Cup 2024 between India and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-seond-test-ravindra-jadeja-run-out-ms-dhoni-pune-2623560-2024-10-26",
      "headline": "Thala effect? Ravindra Jadeja's run-out effort make fans draw MS Dhoni parallelsRavindra Jadeja's spectacular run-out of Will O'Rourke in the Pune Test had fans reminiscing about MS Dhoni's legendary fielding skills. The all-rounder's quick reflexes helped India bundle out New Zealand for 255. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-mitchell-santner-anil-kumble-pune-test-2623586-2024-10-26",
      "headline": "How Rohit Sharma was outfoxed by Mitchell Santner, explains Anil KumbleFormer India spinner Anil Kumble revealed how Mitchell Santner planned Rohit Sharma's dismissal on Day 3 of the first Test in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-second-test-virat-kohli-run-chase-pune-saba-karim-2623571-2024-10-26",
      "headline": "India will heavily rely on Virat Kohli for Pune Test miracle chase: Saba KarimSaba Karim believes Virat Kohli's performance will be pivotal for India's success as they face a challenging run chase against New Zealand in the Pune Test, needing 359 runs to win. Kohli failed to make a mark in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wbbl-2024-jemimah-rodrigues-brisbane-heat-2623567-2024-10-26",
      "headline": "Jemimah to miss first 2 games in WBBL, Brisbane Heat name replacement WBBL 2024: Jemimah Rodrigues will miss the first two matches for Brisbane Heat. In her place, the Heat have added Lauren Winfield Hill to their squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-on-t20-world-cup-2024-final-india-vs-south-africa-2623564-2024-10-26",
      "headline": "MS Dhoni reveals his jittery feelings while watching T20 World Cup 2024 finalLegendary India captain MS Dhoni recently opened up on his jittery feelings while watching the final of the T20 World Cup 2024 between India and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-seond-test-ravindra-jadeja-run-out-ms-dhoni-pune-2623560-2024-10-26",
      "headline": "Thala effect? Ravindra Jadeja's run-out effort make fans draw MS Dhoni parallelsRavindra Jadeja's spectacular run-out of Will O'Rourke in the Pune Test had fans reminiscing about MS Dhoni's legendary fielding skills. The all-rounder's quick reflexes helped India bundle out New Zealand for 255. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rohit-sharma-pune-test-mitchell-santner-2623558-2024-10-26",
      "headline": "Rohit Sharma fails again as run of poor form prolongs for India skipperIND vs NZ: Rohit Sharma failed to get a big score in the Pune Test. After Tim Southee dismissed him in the first innings, Mitchell Santner got rid of him in the second. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-real-madrid-vs-barcelona-preview-live-streaming-details-santiago-bernabeu-2623536-2024-10-26",
      "headline": "Real Madrid vs Barcelona Live streaming: Table-top El Clasico clash setReal Madrid and Barcelona prepare for an intense El Clasico showdown on October 27, with both teams riding high after major Champions League victories and the top La Liga spot at stake in this highly-anticipated clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-thala-for-a-reason-meme-thanks-fans-chennai-2623532-2024-10-26",
      "headline": "Thala for a reason: MS Dhoni feels fans turned viral meme in his favourMS Dhoni, the cricketing icon, appreciated the viral 'Thala for a Reason' meme and feels his fans have turned it in his favour. The trend, linked to his jersey number seven, has gained massive popularity online, with even IPL teams joining the fun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-gifts-a-signed-bat-to-a-young-fan-in-pune-2623523-2024-10-26",
      "headline": "Watch: Kohli gifts a signed bat to a young fan in Pune  IND vs NZ: Virat Kohli gave a signed bat to a young fan in Pune during the second Test against New Zealand at the MCA Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-nitish-kumar-reddy-inclusion-anil-kumble-simon-doull-2623521-2024-10-26",
      "headline": "Nitish Kumar Reddy for Border-Gavaskar Trophy: Anil Kumble reveals reasonAnil Kumble explained why Nitish Kumar Reddy's maturity in white-ball cricket may have earned him a spot in India's squad for the Border-Gavaskar Trophy in Australia. Nitish was part of the 18 members selected for the series down under in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-virat-kohli-hall-of-fame-2623512-2024-10-26",
      "headline": "De Villiers responds to Kohli's 'kind words' after Hall of Fame induction AB de Villiers was recently inducted into the ICC Hall of Fame after which Virat Kohli paid tribute to him. Kohli and De Villiers played several match-winning knocks together for RCB in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-gifts-a-signed-bat-to-a-young-fan-in-pune-2623523-2024-10-26",
      "headline": "Watch: Kohli gifts a signed bat to a young fan in Pune  IND vs NZ: Virat Kohli gave a signed bat to a young fan in Pune during the second Test against New Zealand at the MCA Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-nitish-kumar-reddy-inclusion-anil-kumble-simon-doull-2623521-2024-10-26",
      "headline": "Nitish Kumar Reddy for Border-Gavaskar Trophy: Anil Kumble reveals reasonAnil Kumble explained why Nitish Kumar Reddy's maturity in white-ball cricket may have earned him a spot in India's squad for the Border-Gavaskar Trophy in Australia. Nitish was part of the 18 members selected for the series down under in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-virat-kohli-hall-of-fame-2623512-2024-10-26",
      "headline": "De Villiers responds to Kohli's 'kind words' after Hall of Fame induction AB de Villiers was recently inducted into the ICC Hall of Fame after which Virat Kohli paid tribute to him. Kohli and De Villiers played several match-winning knocks together for RCB in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-ipl-2025-retention-2623499-2024-10-26",
      "headline": "MS Dhoni to play in IPL 2025? Former CSK skipper opens up Former Chennai Super Kings captain and India legend MS Dhoni opened up on his chances of playing in IPL 2025 and his undying passion for the sport. CSK have the option of retaining Dhoni for Rs 4 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturajs-only-mistake-is-wearing-yellow-jersey-fans-upset-with-exclusion-2623468-2024-10-25",
      "headline": "Ruturaj's only mistake is wearing yellow jersey: Fans upset with exclusionA certain section of fans was upset about Ruturaj Gaikwad's exclusion from both of India's T20I and Test squads against South Africa and Australia respectively. He last featured in the Indian team during the T20I series against Zimbabwe in July 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimahs-father-rubbishes-claims-of-holding-religious-activities-at-gymkhana-2623466-2024-10-25",
      "headline": "Jemimah's father rubbishes claims of holding 'religious activities' at gymkhanaJemimah Rodrigues' father, Ivan, denied allegations of misusing her Khar Gymkhana membership for religious gatherings, clarifying that prayer meetings followed club protocols. Despite the controversy, the Gymkhana acknowledged Jemimah's cricketing achievements and wished her continued success in her career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-series-ramandeep-singh-vijay-kumar-vyshak-maiden-call-ups-2623465-2024-10-25",
      "headline": "Ramandeep and Vijaykumar Vyshak earn maiden India call-ups for SA T20IsRamandeep Singh and Vijaykumar Vyshak, IPL 2024 breakout stars, earned maiden call-ups for India's T20I squad against South Africa. Their performances provide fresh promise as India navigates key injuries ahead of the four-match series starting November 8."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}