{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-tax-cuts-updates-milk-chocolates-textiles-fertilizers-2778009-2025-08-28",
      "headline": "Cheaper milk, chocolates, clothes and more: How GST 2.0 could slash your billsThe proposed changes, to be discussed at the Council's meeting on September 3–4 in New Delhi, focus on widening the nil rate, scrapping the 12% slab, and reducing rates on selected 18% goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-sensex-tanks-600-points-nifty-falls-us-tariff-50-percent-2777990-2025-08-28",
      "headline": "Sensex tanks 600 points: Why is stock market falling today?The S&P BSE Sensex was down by 605.97 points to 80,180.57, while the NSE Nifty50 lost 173.50 points to 24,538.55, as both the indices continued their downward movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-nearly-500-points-nifty-below-24600-as-us-tariffs-hit-markets-2777962-2025-08-28",
      "headline": "Sensex nosedives 600 points, Nifty tumbles as US tariffs hit marketsThe Sensex shed 600 points to close at 81,074, while the Nifty ended below the 24,600 mark after slipping into bearish territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-end-electric-vehicles-likely-to-attract-18-gst-2777884-2025-08-28",
      "headline": "High-end electric vehicles likely to attract 18% GSTAccording to the proposals, GST on four-wheeled EVs priced between Rs 20 lakh and Rs 40 lakh will be raised from 5 per cent to 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chocolates-with-cocoa-pastries-ice-cream-likely-to-be-taxed-at-5-percent-gst-2777835-2025-08-27",
      "headline": "Chocolates with cocoa, pastries, ice cream likely to be taxed at 5% instead of 18%The proposed rationalisation stems from the Council's broader push to simplify the GST framework."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/condensed-milk-dates-jams-mushrooms-namkeens-to-get-cheaper-under-gst-2-0-2777830-2025-08-27",
      "headline": "Condensed milk, dates, jams, mushrooms, namkeens to get cheaper under GST 2.0The fitment committee has proposed that products such as butter, condensed milk, jams, mushrooms, dates, nuts, and namkeens move from the current 12 per cent GST slab to just 5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-extended-till-2030-higher-loans-and-credit-cards-for-vendors-2777686-2025-08-27",
      "headline": "PM SVANidhi scheme extended till 2030, higher loans and credit cards for vendorsThe move is expected to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. The scheme will continue to be implemented jointly by the Ministry of Housing & Urban Affairs (MoHUA) and the Department of Financial Services (DFS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-response-india-eyes-new-markets-export-textiles-jewellery-gems-outreach-program-trade-2777643-2025-08-27",
      "headline": "India eyes new markets amid US tariffs, aims to boost textile, jewellery exportsPlans are being drawn up to explore new markets, increase outreach, and give special attention to sectors such as textiles and gems and jewellery, which are likely to be among the hardest hit by the tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-10000-monthly-sip-make-you-a-crorepati-heres-the-timeline-2777633-2025-08-27",
      "headline": "Can a Rs 10,000 monthly SIP make you a crorepati? Here's the timelineCan Rs 10,000 a month really make you a crorepati? The maths of SIPs shows that with discipline and time, the answer is yes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/these-3-banks-offer-special-fds-with-higher-interest-rates-till-september-2025-indian-bank-idbi-state-bank-of-india-sbi-2777597-2025-08-27",
      "headline": "These 3 banks offer special FDs with higher interest rates till September 2025For those planning to invest in FDs, three banks are running special schemes with better interest rates valid up to September 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-impact-gdp-us-tariff-50-percent-donald-trump-fastest-growing-economy-pm-modi-rbi-projection-2777572-2025-08-27",
      "headline": "How will Trump's 50% tariff impact India's growth?The 50% tariff by the US comes at a time when India has reported strong growth of 6.5% in 2024–25 and has been projected to remain the fastest-growing major economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-documents-ais-form-16-capital-gains-26-ad-pan-card-aadhar-tax-returns-fy25-2777547-2025-08-27",
      "headline": "Filing ITR for FY 2024-25? Keep these 6 documents handyKeeping your documents in order is the first step to a smooth filing process. Not having the documents in place not only delays the process but also increases the chance of errors in the return. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ssunita-ahuja-denies-comparing-yash-and-ahaan-panday-2778000-2025-08-28",
      "headline": "Ssunita Ahuja denies comparing Yash and Ahaan Panday, says don't spread rumoursSsunita Ahuja clarified that she never compared her son Yash's debut with Ahaan Panday's 'Saiyaara', praising the young actor and urging fans not to spread rumours. She also wished success to all newcomers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-sidharth-malhotra-visit-shirdi-param-sundari-release-watch-2777999-2025-08-28",
      "headline": "Janhvi Kapoor, Sidharth Malhotra visit Shirdi ahead of Param Sundari release. WatchAhead of 'Param Sundari' release, Janhvi Kapoor and Sidharth Malhotra offered prayers at Shirdi. Video of the two stars seeking blessings has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-celebrates-daughter-alisah-sweet-16-birthday-with-emotional-note-2777941-2025-08-28",
      "headline": "Proud Maa Sushmita Sen rings in daughter Alisah's sweet 16 with emotional noteSushmita Sen celebrated her younger daughter Alisah's 16th birthday with a heartfelt Instagram post, sharing pictures and a loving note. She called herself a proud mother in the post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performs-aarti-ganesh-chaturthi-celebration-family-parents-salim-khan-salma-khan-arpita-khan-sharma-2777939-2025-08-28",
      "headline": "Salman Khan performs aarti during Ganesh Chaturthi celebration with family. WatchSalman Khan and his family celebrated Ganesh Chaturthi 2025 with devotion at Arpita Khan Sharma's Mumbai residence. Joined by parents Salim and Salma Khan, the actor performed the aarti, and the video has gone viral. \r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mrbeast-slammed-for-mocking-rolling-stone-list-after-caleb-hearon-outranks-him-glbs-2777898-2025-08-28",
      "headline": "MrBeast slammed for mocking Rolling Stone list after Caleb Hearon outranks himMrBeast faced backlash after mocking Rolling Stone's creator rankings, where Caleb Hearon ranked higher. Critics said he reduced influence to follower counts, while fans defended his unmatched reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ekta-kapoor-cautions-actors-against-fake-audition-calls-balaji-telefilms-casting-director-scam-2777808-2025-08-27",
      "headline": "Ekta Kapoor cautions actors against fake audition calls for Balaji TelefilmsProducer Ekta Kapoor issued an official statement through the social media handle of Balaji Telefilms warning actors against fraudulent casting directors impersonating their staff. The alert aims to protect aspiring actors from scams and misuse of the company's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/harry-potter-hagrid-shop-diagon-alley-new-set-pics-from-hbo-show-jk-rowling-2777660-2025-08-27",
      "headline": "Harry Potter shops with Hagrid at Diagon Alley and more in new pics from HBO showThe pictures from the new 'Harry Potter' series surfaced on the internet. The upcoming show is based on the original book while also introducing new elements like the full Weasley family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/google-marks-taylor-swift-travis-kelce-engagement-golden-hearts-diamonds-2777742-2025-08-27",
      "headline": "Google marks Taylor and Travis's engagement with golden hearts and diamondsTaylor Swift and Travis Kelce are engaged! Google celebrates the couple's big news with golden hearts and diamonds in search results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-ram-charan-to-mohanlal-south-stars-share-ganesh-chaturthi-wishes-2777752-2025-08-27",
      "headline": "Allu Arjun, Ram Charan to Mohanlal: South stars share Ganesh Chaturthi wishesSeveral South Indian stars, including Mohanlal, Allu Arjun, Ram Charan, Shiva Rajkumar, Chiranjeevi, and Sivakarthikeyan, took to social media to extend Ganesh Chaturthi greetings to their fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lakshmi-menon-tamil-actress-accused-kidnapping-assault-case-details-2777732-2025-08-27",
      "headline": "Tamil actor Lakshmi Menon named in kidnapping, assault case of IT professionalTamil actor Lakshmi Menon has been named as an accused in a kidnapping and assault case in Kochi. The incident has sparked controversy after visuals of the argument went viral and arrests were made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aishwarya-sharma-ganpati-celebration-without-neil-bhatt-separation-rumours-2777721-2025-08-27",
      "headline": "Aishwarya Sharma celebrates Ganpati without Neil Bhatt, reignites separation rumoursTelevision actor Aishwarya Sharma celebrated Ganesh Chaturthi without her actor husband Neil Bhatt, fueling speculation about a possible separation. The couple fell in love on the sets of 'Ghum Hai Kisikey Pyaar Meiin' and married in 2021."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-confession-shraddha-kapoor-bigg-boss-19-2777615-2025-08-27",
      "headline": "Amaal Mallik makes a cute confession about Shraddha Kapoor on Bigg Boss 19. WatchSinger Amaal Mallik made a confession about actor Shraddha Kapoor in 'Bigg Boss 19'. The clip is now going viral on social media and winning hearts. Mallik praised the actor's simplicity and charm and also talked about her Instagram popularity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-denies-divorce-rumours-with-govinda-even-god-cant-separate-us-2777683-2025-08-27",
      "headline": "Govinda's wife Sunita breaks silence on divorce reports: Even God can't separate usSunita Ahuja denies rumours of divorce from actor Govinda. She emphasises their strong bond and urges privacy amid speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/13-times-taylor-swift-manifested-her-engagement-in-songs-so-high-school-but-true-2777672-2025-08-27",
      "headline": "13 times Taylor Swift manifested her engagement in songs - so high school, but trueDiscover 13 Taylor Swift songs where she quietly manifested her engagement, from 'Love Story' to 'Lover' and beyond. Swifties saw it coming all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-sunita-ahuja-ganesh-chaturthi-celebration-divorce-rumours-2777671-2025-08-27",
      "headline": "Govinda, Sunita Ahuja's Ganesh Chaturthi celebration puts divorce rumours to restBollywood actor Govinda and his wife Sunita Ahuja put divorce rumours to rest as they welcomed Lord Ganpati on Wednesday. Dressed in coordinated outfits, the couple posed for paparazzi and celebrated the occasion with their son Yashvardhan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-on-playing-major-shaitan-in-120-bahadur-rezang-la-heroes-inspired-me-2777565-2025-08-27",
      "headline": "Farhan Akhtar on playing Major Shaitan in 120 Bahadur: Rezang La heroes inspired me Actor Farhan Akhtar unveiled the teaser of '120 Bahadur', where he plays Param Vir Chakra awardee Major Shaitan Singh Bhati, honouring the bravery of 120 soldiers in the 1962 Battle of Rezang La. He said the story inspired him deeply, calling it a timeless tale of patriotism and determination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-bihar-contestant-breaks-down-before-amitabh-bachchan-recalls-family-struggles-2777624-2025-08-27",
      "headline": "KBC 17: Bihar contestant breaks down before Big B, recalls family strugglesIn the latest episode of 'Kaun Banega Crorepati 17', a contestant from Bihar broke down in front of host Amitabh Bachchan. The contestant recalled his family struggles and spoke about the loss of his parents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-lil-nas-x-statement-arrest-cop-assault-charges-walking-in-underwear-2777606-2025-08-27",
      "headline": "Singer Lil Nas X's 1st statement on arrest over cop assault, walking naked chargesSinger Lil Nas X has addressed fans after his arrest in Los Angeles, confirming he is safe. The rapper faces serious felony charges amid disputes over alleged drug use."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-rajesh-keshav-on-ventilator-support-after-cardiac-arrest-in-kochi-2777616-2025-08-27",
      "headline": "Malayalam actor Rajesh Keshav on ventilator support after cardiac arrest in KochiVeteran Malayalam anchor and actor Rajesh Keshav is on ventilator support after suffering a cardiac arrest during a live event in Kochi. Doctors performed an emergency angioplasty, but his condition remains critical with suspected mild brain damage."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/modis-war-white-house-adviser-navarro-links-india-to-ukraine-war-glbs-2777904-2025-08-28",
      "headline": "This is Modi's war: Trump aide Peter Navarro's bizarre logic on Ukraine conflictWhite House adviser and a top Donald Trump aide, Peter Navarro, in an interview with Bloomberg, said the path to peace in Ukraine 'runs, in part, through New Delhi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-singling-out-india-china-buying-larger-amounts-of-russian-oil-democrats-on-us-house-panel-slam-tariffs-2777927-2025-08-28",
      "headline": "Seems like it's not about Ukraine: Democrats blast Trump for singling out IndiaThe criticism came a day after Donald Trump's revised tariff policy on India came into effect. The president had initially announced 25 per cent \"reciprocal tariffs\" on Indian goods but later doubled the figure to 50 per cent, calling it a penalty for New Delhi's continued oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-nobel-peace-prize-cabinet-powerful-world-pressing-norway-october-announced-steve-witkoff-2777628-2025-08-28",
      "headline": "Blatant, brazen: How Trump Cabinet is on the warpath for Peace NobelWhat earlier seemed to be Donald Trump's lone pursuit has now become a task for his Cabinet. All the President's men and women are singing his praise, which is unabashedly being broadcast, with the goal of cornering the Nobel Peace Prize for Trump. The brazen and unabashed lobbying comes at a time the Norwegian Nobel Committee must be working hard to pick a winner for an announcement in October."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/minnesota-catholic-school-shooting-suspect-wrote-nuke-india-mashallah-on-guns-robin-westman-2777913-2025-08-28",
      "headline": "Minneapolis shooter scrawled 'Nuke India', 'Mashallah' on guns used in attackThe Minneapolis school shooting left two children dead and 17 injured, with authorities confirming the gunman's weapons carried antisemitic, anti-India and anti-Israel slogans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-india-sprung-back-after-us-sanctions-atal-bihari-vajpayee-trump-modi-nuclear-test-tariffs-2777642-2025-08-28",
      "headline": "How India sprung back after US sanctions 27 years agoFrom economic sanctions to reciprocal tariffs, the US has many a time tried to pressurise India through aid cuts, blocking international loans, and bans on technology transfers. Yet, deft Indian diplomacy and indigenous growth not only ensured the rollback of these punitive actions but also resulted in stronger bilateral ties. Here's how India, over 25 years ago, shrugged off American sanctions and emerged stronger."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-police-high-alert-pakistan-jaish-terrorists-enter-india-nepal-border-2778002-2025-08-28",
      "headline": "Intel warns of 3 Jaish terrorists entering Bihar via Nepal, state on high alertThe Bihar Police Headquarters said three suspected members of the Pakistan-based terror outfit Jaish-e-Mohammed infiltrated Bihar through the Nepal border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/republican-candidate-vows-end-islam-texas-burns-quran-campaign-video-glbs-2777887-2025-08-28",
      "headline": "Republican candidate vows to 'end Islam in Texas,' burns Quran in campaign videoValentina Gomez sparked outrage after posting a now-deleted video on X in which she burned a Quran. The Republican hopeful, running for the 31st Congressional District in 2026, has a history of incendiary stunts and extremist rhetoric.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-to-add-parental-controls-emergency-contacts-in-chatgpt-after-teen-suicide-case-2777984-2025-08-28",
      "headline": "OpenAI to add parental controls, emergency contacts in ChatGPT after teen suicide caseOpenAI will add parental controls and emergency contact features to ChatGPT after a lawsuit alleged the chatbot contributed to a teenager's suicide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nikkis-death-social-media-families-flaunt-dowry-in-reels-while-brides-bear-the-brunt-2777736-2025-08-27",
      "headline": "Nikki's death and social media: Dowry flaunted in reels, brides bear the bruntWhat was once whispered as 'dahej' (dowry) is now flaunted online for all to see. The law calls dowry a crime. Yet in many homes, it is still wrapped as 'riwaz' (tradition), and on Instagram reels, it often goes viral as a display of status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-makhana-fields-to-missing-votes-rahul-gandhis-discovery-of-bihar-2777755-2025-08-27",
      "headline": "From makhana fields to missing votes, Rahul Gandhi's discovery of BiharRahul Gandhi's Voter Adhikar Yatra is perhaps the most sustained effort by the Congress in decades to touch the lived anxieties of Bihar and regain electoral relevance in the state"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-terrorists-killed-at-line-of-control-in-jk-as-army-foils-infiltration-attempt-search-op-on-in-area-2777918-2025-08-28",
      "headline": "Army foils infiltration bid in J&K, 2 terrorists dead, 5 more likely hiding in areaThe Indian Army foiled an infiltration attempt along the Line of Control in the Gurez sector of Jammu and Kashmir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-dies-after-distressing-call-from-husbands-alleged-second-wife-delhi-2777994-2025-08-28",
      "headline": "I'm his second wife: UP woman gets distressing call, dies on bus en route homeAfter receiving a distressing call from a woman claiming to be her husband's second wife, Rita expressed physical discomfort and remained visibly distressed, crying in her mother's lap until she suddenly collapsed and was later declared dead on the bus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-controversy-2777953-2025-08-28",
      "headline": "'No class, no education': Townsend, Ostapenko in ugly exchange at US Open 2025Taylor Townsend's stunning 7-5, 6-1 win over Jelena Ostapenko at the 2025 US Open was overshadowed by a heated post-match spat, where Ostapenko accused her of lacking \"class\" and \"education.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-reserve-bank-of-india-governor-raghuram-rajan-calls-us-tariffs-a-wake-up-call-for-india-2777883-2025-08-27",
      "headline": "Trade now weaponised: Raghuram Rajan calls US tariffs a wake-up call for IndiaAfter a staggering 50 per cent US tariffs took effect on many Indian products, ex-RBI Governor Raghuram Rajan remarked that trade has been increasingly weaponised in today's global order, and that India should tread carefully."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-couple-celebrates-daughters-1st-birthday-then-virar-building-collapse-2777917-2025-08-28",
      "headline": "Maharashtra couple celebrates daughter's 1st birthday. Then, building collapsesThe child, Utkarsha Joyal, and her 24-year-old mother, Aarohi Joyal, died in the incident, while her father, Omkar Joyal, remains missing as rescue operations continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-sensex-tanks-600-points-nifty-falls-us-tariff-50-percent-2777990-2025-08-28",
      "headline": "Sensex tanks 600 points: Why is stock market falling today?The S&P BSE Sensex was down by 605.97 points to 80,180.57, while the NSE Nifty50 lost 173.50 points to 24,538.55, as both the indices continued their downward movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-performs-aarti-ganesh-chaturthi-celebration-family-parents-salim-khan-salma-khan-arpita-khan-sharma-2777939-2025-08-28",
      "headline": "Salman Khan performs aarti during Ganesh Chaturthi celebration with family. WatchSalman Khan and his family celebrated Ganesh Chaturthi 2025 with devotion at Arpita Khan Sharma's Mumbai residence. Joined by parents Salim and Salma Khan, the actor performed the aarti, and the video has gone viral. \r\n "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-virar-building-collapse-death-toll-injured-feared-trapped-builder-arrested-2777938-2025-08-28",
      "headline": "15 dead as 'illegal' building collapses in Maharashtra's Virar, builder arrestedSeven of the 15 victims of the Virar building collapse have been identified, including a 24-year-old woman and her infant daughter, as rescue teams run against time to save those feared trapped in the debris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-visa-proposal-4-year-student-visas-240-day-limit-for-foreign-journalists-glbs-2777897-2025-08-28",
      "headline": "US visa proposal: 4-year student visas, 240-day limit for foreign journalistsThe Trump administration has proposed fixed visa terms for students, cultural exchange visitors, and foreign journalists, replacing open-ended stays with strict limits to increase oversight, reviving a measure first introduced in 2020.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-tariffs-modi-defiant-shield-protecting-india-farmers-and-msmes-2777540-2025-08-27",
      "headline": "In tariff war with Trump, Modi seizes opportunity to reconnect with farmers, MSMEsTrump's 50% tariffs threaten India's farmers and MSMEs, but Modi's defiant reforms and rhetoric aim to shield them, turning a trade war into political redemption for rural India.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/is-sunscreen-the-acne-fix-youve-been-looking-for-2777696-2025-08-28",
      "headline": "Is sunscreen the acne fix you've been looking for?Sunscreen is a skincare hero. But can it also help with acne? We asked the experts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/religious-conversion-gang-busted-in-bareilly-blind-professor-families-converted-madrasa-cleric-arrests-2777936-2025-08-28",
      "headline": "Chhangur Baba redux? Religious conversion gang busted in Bareilly; 4 arrestedThe alleged religious conversion gang was busted after a woman filed a missing person report for her son, a visually impaired professor. The probe led police to expose a wider network operating in Bareilly and other states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-tvk-member-alleges-foul-play-in-case-against-vijay-and-bouncers-after-madurai-conference-incident-2777961-2025-08-28",
      "headline": "Complainant instigated: TVK member cries foul in case against Vijay, bouncersA day after a case was filed against Vijay and his bouncers, a TVK functionary alleged foul play. He claimed the injured was not Sharath Kumar but another cadre, Ajay. He alleged someone instigated Kumar to file the complaint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/yamuna-river-crosses-danger-water-level-delhi-flood-warning-2777957-2025-08-28",
      "headline": "Yamuna breaches danger mark in Delhi, authorities on alertThe Yamuna River crossed the danger mark at 205.35 metres near the Old Railway Bridge, driven by heavy water discharge from Wazirabad and Hathnikund barrages. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-emotional-letter-fans-rcb-cares-breaks-social-media-silence-2778013-2025-08-28",
      "headline": "RCB break silence after stampede, launch initiative to honour and heal fansRoyal Challengers Bengaluru (RCB) on Thursday ended their three-month silence on social media following the horrific stampede that marred their maiden Indian Premier League (IPL) title celebrations in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/hs-prannoy-loss-anders-antonsen-world-championships-badminton-paris-2778001-2025-08-28",
      "headline": "Valiant HS Prannoy goes down in thriller against world No. 2 AntonsenHS Prannoy came agonisingly close to pulling off another famous upset at the World Championships in Paris before bowing out against world No. 2 Anders Antonsen in a dramatic second-round battle on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-racist-reaction-2777998-2025-08-28",
      "headline": "Jelena Ostapenko reacts to racial slurs after Taylor Townsend saga: Never a racistUS Open: Jelena Ostapenko defended herself against accusations of racism after her heated clash with Taylor Townsend, insisting her remarks were about sportsmanship and not race. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-athletes-world-athletics-championships-2025-qualified-full-list-neeraj-chopra-2777988-2025-08-28",
      "headline": "World Athletics Championships 2025: Full list of Indian athletes qualified for TokyoReigning world champion Neeraj Chopra will lead India's 19-member contingent at the World Athletics Championships 2025 in Tokyo next month, with rising sprinter Animesh Kujur creating history as the first Indian sprinter to qualify."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-aryna-sabalenka-ben-shelton-advance-third-round-2777956-2025-08-28",
      "headline": "Aryna Sabalenka, Ben Shelton advance to third round in straight setsDefending champion Aryna Sabalenka battled through a sluggish start to defeat unseeded Russian Polina Kudermetova 7-6(4), 6-2 on Wednesday and advance to the third round of the US Open, while American Ben Shelton thrilled the New York crowd a day later with a commanding 6-4, 6-2, 6-4 victory over Pablo Carreno-Busta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jelena-ostapenko-taylor-townsend-controversy-2777953-2025-08-28",
      "headline": "'No class, no education': Townsend, Ostapenko in ugly exchange at US Open 2025Taylor Townsend's stunning 7-5, 6-1 win over Jelena Ostapenko at the 2025 US Open was overshadowed by a heated post-match spat, where Ostapenko accused her of lacking \"class\" and \"education.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/grimsby-town-vs-manchester-united-carabao-cup-amorim-reaction-2777942-2025-08-28",
      "headline": "Man United's historic humiliation at Grimsby: Under-fire Amorim apologises to fansCarabao Cup 2025: Manchester United slipped to a new low when they lost 11-12 on penalties to Grimsby Town, suffering their first-ever defeat to a fourth-tier club. Manager Ruben Amorim was visibly shaken as he apologised to fans after the humiliation at Blundell Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-casper-ruud-mattia-bellucci-second-round-2777937-2025-08-28",
      "headline": "Carlos Alcaraz crushes Mattia Bellucci, Casper Ruud stunned by World No.107Carlos Alcaraz powered past Italy's Mattia Bellucci 6-1, 6-0, 6-3 to reach the US Open third round while Casper Ruud slumped to a defeat at the hands of World No.107 Raphael Collignon. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-daniil-medvedev-heavy-fine-benjamin-bonzi-2777916-2025-08-28",
      "headline": "Daniil Medvedev handed USD 42,500 fine for dramatic US Open meltdownDaniil Medvedev's turbulent 2025 season hit a low at the US Open, where a first-round loss to Benjamin Bonzi and a furious outburst cost him a hefty fine. The setback capped a miserable Grand Slam year, with the Russian advancing past the opening round only once all season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/diamond-league-armand-duplantis-no-world-record-zurich-mens-pole-vault-2777893-2025-08-28",
      "headline": "No world record, but Armand Duplantis wins 5th straight Diamond League titleArmand Duplantis won the men's pole vault at the Diamond League final in Zurich, clearing 6.00m before falling short of the meet record. The Swede now owns five Diamond League titles, just two shy of the all-time record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-novak-djokovic-2nd-round-win-zachary-svadja-injury-2777885-2025-08-28",
      "headline": "US Open: Novak Djokovic rolls into Round 3, equals Roger Federer's recordNovak Djokovic secured a second-round win over Zachary Svadja in the US Open men's singles competition. He will now be up against the winner between Cameron Norrie and Francisco Comesana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/grimsby-town-vs-manchester-united-carabao-cup-amorim-reaction-2777942-2025-08-28",
      "headline": "Man United's historic humiliation at Grimsby: Under-fire Amorim apologises to fansCarabao Cup 2025: Manchester United slipped to a new low when they lost 11-12 on penalties to Grimsby Town, suffering their first-ever defeat to a fourth-tier club. Manager Ruben Amorim was visibly shaken as he apologised to fans after the humiliation at Blundell Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-casper-ruud-mattia-bellucci-second-round-2777937-2025-08-28",
      "headline": "Carlos Alcaraz crushes Mattia Bellucci, Casper Ruud stunned by World No.107Carlos Alcaraz powered past Italy's Mattia Bellucci 6-1, 6-0, 6-3 to reach the US Open third round while Casper Ruud slumped to a defeat at the hands of World No.107 Raphael Collignon. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-daniil-medvedev-heavy-fine-benjamin-bonzi-2777916-2025-08-28",
      "headline": "Daniil Medvedev handed USD 42,500 fine for dramatic US Open meltdownDaniil Medvedev's turbulent 2025 season hit a low at the US Open, where a first-round loss to Benjamin Bonzi and a furious outburst cost him a hefty fine. The setback capped a miserable Grand Slam year, with the Russian advancing past the opening round only once all season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/diamond-league-armand-duplantis-no-world-record-zurich-mens-pole-vault-2777893-2025-08-28",
      "headline": "No world record, but Armand Duplantis wins 5th straight Diamond League titleArmand Duplantis won the men's pole vault at the Diamond League final in Zurich, clearing 6.00m before falling short of the meet record. The Swede now owns five Diamond League titles, just two shy of the all-time record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-novak-djokovic-2nd-round-win-zachary-svadja-injury-2777885-2025-08-28",
      "headline": "US Open: Novak Djokovic rolls into Round 3, equals Roger Federer's recordNovak Djokovic secured a second-round win over Zachary Svadja in the US Open men's singles competition. He will now be up against the winner between Cameron Norrie and Francisco Comesana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-emma-raducanu-second-round-win-jack-draper-pulls-out-2777877-2025-08-27",
      "headline": "Emma Raducanu into third round after 4 years, 5th seed Draper withdrawsEmma Raducanu stormed into the US Open third round with a 6-2, 6-1 win over Janice Tjen — her first deep run in New York since her 2021 title. The Brit hit 16 winners and 8 aces, while fellow Brit Jack Draper pulled out of the men's draw with injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-12-vaibhav-suryavanshi-headlines-season-opener-national-sports-day-2777865-2025-08-27",
      "headline": "Vaibhav Suryavanshi headlines PKL 12 season opener on National Sports DayPro Kabaddi League Season 12 kicks off on National Sports Day with sporting icons Pullela Gopichand, Dhanraj Pillay, Pardeep Narwal, and Vaibhav Suryavanshi uniting as kabaddi celebrates its roots with new formats and fierce rivalries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-squads-schedule-live-streaming-2777836-2025-08-27",
      "headline": "Duleep Trophy 2025: Full squads, schedule, livestreaming details and moreThe Indian domestic season is all set to start with the Duleep Trophy starting on August 28. With the selectors keeping a keen eye on domestic performances, the players will be eager to impress during the tournament being played in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-diamond-league-final-2025-zurich-javelin-lineup-streaming-details-2777811-2025-08-27",
      "headline": "Neeraj Chopra at Diamond League final: When and where to watch, all you need to knowNeeraj Chopra will return to action and aim for his second Diamond trophy as he steps onto the track against a strong lineup. Here's all you need to know about the Diamond League final event in Zurich. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-bwf-world-championships-round-of-16-karuputhevan-letshanaa-2777794-2025-08-27",
      "headline": "PV Sindhu reaches pre-quarters after 4 years, Satwik-Chirag into Round of 16BWF World Championships 2025: PV Sindhu came back from behind to beat Malaysia's Karupathevan Letshanaa in the second round. The 2019 champion will face a stern test in the pre-quarterfinals on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-flexible-india-batting-order-raiphi-gomez-2777787-2025-08-27",
      "headline": "Sanju Samson flexible enough to drop down batting order, says mentor Raiphi GomezFormer Kerala cricketer, Raiphi Gomez, suggested that Sanju Samson is more than flexible to bat lower down the order if the team needs it considering the return of Shubman Gill in the Asia Cup 2025 squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-4-updates-novak-djokovic-carlos-alcaraz-aryna-sabalenka-2777783-2025-08-27",
      "headline": "Day 4 Highlights: Sabalenka beats Kudermetova Alcaraz, Djokovic storm into Round 3US Open 2025 Day 4 Live Updates: Calos Alcaraz has made light work of his Italian opponent Mattia Bellucci to storm into the third round. Novak Djokovic and Taylor Fritz were made to work hard for their victories. Aryna Sabalenka also advanced to the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/dharambir-preeti-pal-lead-indian-para-athletics-team-world-championships-new-delhi-2777765-2025-08-27",
      "headline": "Dharambir and Preeti Pal lead India at World Para Athletics in New DelhiDharambir and Preeti Pal were named India's flag bearers for the World Para Athletics Championships. The showpiece event will be held in New Delhi from September 27 to October 5."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-bwf-world-championships-round-of-16-karuputhevan-letshanaa-2777794-2025-08-27",
      "headline": "PV Sindhu reaches pre-quarters after 4 years, Satwik-Chirag into Round of 16BWF World Championships 2025: PV Sindhu came back from behind to beat Malaysia's Karupathevan Letshanaa in the second round. The 2019 champion will face a stern test in the pre-quarterfinals on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-flexible-india-batting-order-raiphi-gomez-2777787-2025-08-27",
      "headline": "Sanju Samson flexible enough to drop down batting order, says mentor Raiphi GomezFormer Kerala cricketer, Raiphi Gomez, suggested that Sanju Samson is more than flexible to bat lower down the order if the team needs it considering the return of Shubman Gill in the Asia Cup 2025 squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-4-updates-novak-djokovic-carlos-alcaraz-aryna-sabalenka-2777783-2025-08-27",
      "headline": "Day 4 Highlights: Sabalenka beats Kudermetova Alcaraz, Djokovic storm into Round 3US Open 2025 Day 4 Live Updates: Calos Alcaraz has made light work of his Italian opponent Mattia Bellucci to storm into the third round. Novak Djokovic and Taylor Fritz were made to work hard for their victories. Aryna Sabalenka also advanced to the third round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/dharambir-preeti-pal-lead-indian-para-athletics-team-world-championships-new-delhi-2777765-2025-08-27",
      "headline": "Dharambir and Preeti Pal lead India at World Para Athletics in New DelhiDharambir and Preeti Pal were named India's flag bearers for the World Para Athletics Championships. The showpiece event will be held in New Delhi from September 27 to October 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pkl-12-ashu-malik-dabang-delhi-captain-exclusive-2777761-2025-08-27",
      "headline": "Fearless and go all out: Ashu Malik ready to lead Dabang Delhi's new era in PKLReady to go all out this season, Ashu Malik is all set to lead Dabang Delhi's charge for another Pro Kabaddi League title. The 23-year-old opens up on taking up captaincy, missing Naveen Kumar within the squad and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-diamond-league-final-interview-90m-biggest-rival-jan-zelezny-2777724-2025-08-27",
      "headline": "Neeraj Chopra names biggest rival, new 90m target ahead of Diamond League finalSpeaking to the press on the eve of the Diamond League Final in Zurich, Neeraj Chopra said he is hoping to consistently throw beyond the 90m mark. The two-time Olympic medalist said he is focusing on improving his technique under coach Jan Zelezny's guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-ipl-retirement-the-hundred-2026-report-2777699-2025-08-27",
      "headline": "After IPL retirement, R Ashwin keen to play in The Hundred: ReportAfter retiring from the IPL, Ravichandran Ashwin is eyeing overseas leagues, with reports linking him to The Hundred in 2026. The spin legend could boost the tournament's profile, though his participation is yet to be confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/pro-wrestler-syko-stu-assaulted-by-rampage-jackson-son-2777685-2025-08-27",
      "headline": "Pro-wrestler assault: Hospitalised Stu gets financial supportWWE Superstar Rusev showed strong support for injured wrestler Syko Stu after Raja Jackson's unscripted attack on him. Rusev boosted a GoFundMe that has already got around 138K US Dollars so far. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2030-commonwealth-games-bid-ahmedabad-host-2777629-2025-08-27",
      "headline": "Centre clears India's Commonwealth Games 2030 bid, names Ahmedabad as ideal hostThe Union Cabinet has approved India's bid to host the 2030 Commonwealth Games in Ahmedabad. This move aims to boost the country's sports profile and support its Olympic hosting ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kris-srikkanth-slams-india-t20-world-cup-2026-asia-cup-squad-selection-2777632-2025-08-27",
      "headline": "No chance for India to win T20 World Cup 2026: Kris SrikkanthFormer India selector Kris Srikkanth has said that with the current squad, India will not be able to win the T20 World Cup in 2026. He has criticised certain selection calls in the squad for the upcoming Asia Cup 2025 as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-wood-rohit-sharma-virat-kohli-rishabh-pant-india-battles-2777627-2025-08-27",
      "headline": "Bat felt wider: England pacer recalls battles against Rohit Sharma and Virat KohliEngland pacer Mark Wood opened up on his toughest Indian opponents, recalling why Rohit Sharma's short-ball game, Virat Kohli's fierce competitiveness, and Rishabh Pant's unpredictability made them three of the most difficult batters he has ever faced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/from-mohali-to-national-stage-six-punjab-fc-stars-earn-india-call-ups-2777601-2025-08-27",
      "headline": "From Mohali to national stage: Six Punjab FC stars earn India call-upsRoundglass and Punjab FC's youth-focused approach shone as six players earned national call-ups. Nikhil Prabhu and Muhammed Uvais were selected for India's CAFA Nations Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pardeep-narwal-retirement-pkl-season-12-felicitation-ceremony-2777603-2025-08-27",
      "headline": "Pardeep Narwal's legacy to be honoured by PKL ahead of Season 12 openerThe Pro Kabbaddi League will honour the legacy of Pardeep Narwal ahead of the season 12 opener on August 29. Pardeep retired from kabaddi in June of this year after not getting picked up by any team during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-swift-travis-kelce-engagement-us-open-celebration-2777590-2025-08-27",
      "headline": "Watch: Taylor Swift's engagement news interrupts Jannik Sinner's US Open matchTaylor Swift and Travis Kelce announced their engagement, exciting fans worldwide. US Open commentators paused their broadcast during Jannik Sinner's first-round match on Tuesday to celebrate the news."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-order-of-play-day-4-wednesday-djokovic-alcaraz-2777593-2025-08-27",
      "headline": "Day 4, Order of Play: Djokovic, Alcaraz in action on blockbuster dayThe second round fixtures of the US Open is upon us and the first day starts with some of the biggest names in the tournament. Novak Djokovic and Carlos Alcaraz are set to play their games at the Arthur Ashe Stadium today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-reacts-taylor-swift-travis-kelce-engagement-us-open-2025-2777568-2025-08-27",
      "headline": "Fangirl Swiatek wishes Taylor Swift on her engagement: Hopefully this will stickIga Swiatek was thrilled to learn of Taylor Swift's engagement to Travis Kelce on Tuesday, August 26. The Polish star, a devoted fan of the American singer, wished the couple the best while speaking to reporters in New York. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}