{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indigo-faces-scrutiny-after-1232-flight-cancellations-in-november-delays-drop-in-on-time-performance-2830280-2025-12-03",
      "headline": "1,232 IndiGo flight cancelled in November, aviation regulator probesThe Directorate General of Civil Aviation sought reasons from the airline over the cancellations of flight and delays in time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-ends-aadhaar-uan-extension-will-employers-now-face-stricter-ecr-rules-2830115-2025-12-03",
      "headline": "EPFO ends Aadhaar–UAN extension: Will employers now face stricter ECR rules?EPFO confirms there will be no further deadline extensions for Aadhaar seeding with UAN, affecting ECR filing from November 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-end-flat-sensex-nifty-rupee-fall-india-us-trade-deal-titan-bel-fall-2830062-2025-12-03",
      "headline": "Sensex, Nifty close flat as falling rupee sparks concern on Dalal StreetThe S&P BSE Sensex lost 31.46 points to close at 85,106.81, while the NSE Nifty50 lost 46.20 points to end at 25,986.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-save-tax-money-transfer-family-members-documents-limit-legal-risk-income-2830036-2025-12-03",
      "headline": "Transferring money to family to save tax: Smart move or legal risk?On the surface, it looks like easy tax efficiency. But experts say that while transferring money within the family is legal, using it as a tax-saving tool is far more complicated and can even invite scrutiny if not handled correctly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-a-rs-15-lakh-monthly-salary-in-metro-cities-really-enough-ca-answers-2829983-2025-12-03",
      "headline": "Is a Rs 1.5 lakh monthly salary in metro cities really enough? CA answersA high salary may create the impression of financial stability, but metro expenses tell a different story. A chartered accountant has explained how a Rs 1.5 lakh monthly income can shrink rapidly once daily costs and EMIs are taken into account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-subscription-fully-booked-day-1-strong-demand-listing-gains-latest-gmp-2829994-2025-12-03",
      "headline": "Aequs IPO fully subscribed: Is it a buy or skip?Aequs IPO has seen full subscription within hours of opening, drawing considerable interest from retail investors. Experts discuss the company's prospects, valuation, and investor considerations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-gold-and-silver-heading-towards-record-highs-this-week-rupee-weakens-us-rate-cut-expectations-2829945-2025-12-03",
      "headline": "Are gold and silver heading towards record highs this week?Gold and silver prices in India have climbed sharply as the rupee lost ground against the US dollar, with market observers attributing these patterns to global economic indicators and currency stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-the-eps-95-minimum-pension-be-raised-from-rs-1000-to-rs-7500-2829875-2025-12-03",
      "headline": "Will the EPS-95 minimum pension be raised from Rs 1,000 to Rs 7,500?As pensioner groups renew their demand for a hike, is the government finally considering raising the EPS-95 minimum pension?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-series-amravati-man-sister-treatment-insurance-rejected-star-health-fraud-allegation-2829895-2025-12-03",
      "headline": "If it was forged, why not tell us?: Man refutes insurer's fraud tag on sister's claimWhen a dangerous blood clot hospitalised Purvi Gupta, her family expected their insurer to stand by them. Instead, they recount months of bewildering paperwork, escalating confusion, and a sudden fraud tag they insist was never disclosed. This week's 'Claim Denied' story follows a family left stunned and fighting for answers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-why-reasons-us-india-trade-deal-fii-outflow-rbi-intervention-mpc-meeting-2829868-2025-12-03",
      "headline": "USD vs INR: Why is Rupee falling constantlyA weaker rupee makes imports more expensive, increases inflation risks and raises costs for companies dependent on foreign goods, especially fuel and machinery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/december-15-itr-deadline-do-you-need-to-pay-the-3rd-advance-tax-instalment-2829848-2025-12-03",
      "headline": "December 15 ITR deadline: Do you need to pay the 3rd advance tax instalment?The deadline for the third advance tax instalment for FY26 is approaching. Here's what taxpayers need to know about who must pay, what counts as advance tax liability, and the consequences of missing this important date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-retail-portion-fully-subscribed-check-latest-gmp-total-subscription-2829847-2025-12-03",
      "headline": "Meesho IPO retail portion fully subscribed. Check latest GMP, total subscriptionA fully subscribed retail book and a steady Rs 49 GMP have set strong early cues for Meesho's IPO, with eyes now on whether institutional demand will push valuations higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-past-90-against-us-dollar-to-hit-lifetime-low-what-next-2829813-2025-12-03",
      "headline": "Rupee in freefall, slides past 90 against US dollar: What next?The key question now is whether the rupee stabilises or slides deeper. All eyes are on the RBI's policy signal, foreign flows, and any movement in the India–US trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-review-subscribe-skip-good-bad-strength-key-risks-latest-gmp-price-band-allotment-2829782-2025-12-03",
      "headline": "Meesho IPO open for bidding: Should you subscribe? Check strength and key risksMeesho IPO is a book-built issue worth Rs 5,421.20 crore. This includes a fresh issue of 38.29 crore shares worth Rs 4,250 crore and an offer for sale (OFS) of 10.55 crore shares worth Rs 1,171.20 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rupee-hits-all-time-low-slips-past-90-to-the-us-dollar-for-the-first-time-2829770-2025-12-03",
      "headline": "Rupee hits all-time low, slips past 90 against US dollar for first timeThe rupee's slide to 90 heightens cost pressures for households and businesses, fuels import-driven inflation risks and leaves markets looking to the RBI for stronger support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-flat-rupee-fall-all-time-low-rbi-mpc-rate-cut-announcement-2829769-2025-12-03",
      "headline": "Sensex, Nifty open flat as rupee hits all-time lowThe S&P BSE Sensex was down by 281.56 points to 84,856.71, while the NSE Nifty50 lost 105.10 points to 25,927.10 as of 9:40 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/delhi-based-entrepreneur-vaibhav-chawla-closes-wherehouse-startup-after-frivolous-complaint-by-client-2829749-2025-12-03",
      "headline": "Delhi startup founder shuts down company after 'frivolous complaint' by clientAccording to its LinkedIn profile, Wherehouse was founded in 2021 as a supply chain intelligence company, helping brands move closer to their customers, enabling faster and more efficient deliveries, and driving business growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-today-start-rate-cut-25-bps-yes-no-home-loan-emi-governor-sanjay-malhotra-2829739-2025-12-03",
      "headline": "RBI MPC meet begins today: Will rate cuts finally return?In its October meeting, the MPC kept the repo rate steady at 5.5% for a fourth straight time. RBI Governor Sanjay Malhotra had then said that inflation had moderated sharply, giving the committee confidence to maintain its stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/european-commission-proposes-frozen-russian-assets-ukraine-funding-glbs-2829720-2025-12-03",
      "headline": "EU to push ahead with plan to use Russia's frozen assets for Ukraine: ReportEU leaders agreed in October to meet Ukraine's \"pressing financial needs\" for the next two years but stopped short of endorsing a plan to use 140 billion euros ($162 billion) in frozen Russian sovereign assets in Europe as a loan for Kyiv, due to concerns raised by Belgium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-and-hdfc-kotak-mahindra-bank-sbi-union-bank-of-india-here-is-what-5-major-banks-are-charging-on-personal-loans-2829535-2025-12-02",
      "headline": "From ICICI and HDFC to SBI: Here's what 5 major banks are charging on personal loansBefore applying for a personal loan, it's worth knowing how much the leading banks are charging at the moment. Whether you prefer a private lender or a public-sector bank, understanding the latest interest rates can guide you towards a smarter borrowing decision."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indias-most-streamed-artists-songs-albums-spotify-wrapped-2025-2830302-2025-12-03",
      "headline": "Arijit Singh tops Spotify Wrapped 2025 In India, also features in Global Top 10 Spotify Wrapped 2025 reveals Arijit Singh as India's top artist for the seventh consecutive year, with notable entries from independent musicians and a resurgence of older film albums in streaming charts. Pritam, Shreya Ghoshal and Mohit Suri also featured on the charts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-attend-cousins-wedding-goa-family-moments-2830277-2025-12-03",
      "headline": "Ranveer Singh turns emotional as he walks his sister down the aisle. Watch Bollywood actors Ranveer Singh and Deepika Padukone recently attended a family wedding in Goa, engaging actively in the ceremonies and garnering attention from relatives and guests. Videos from the event have surfaced online, capturing the couple's participation in traditional rituals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ready-or-not-2-trailer-samara-weaving-returns-to-gore-splattered-horror-comedy-2830261-2025-12-03",
      "headline": "Ready or Not 2 trailer: Samara Weaving returns to gore-splattered, horror-comedy The trailer for 'Ready or Not 2: Here I Come' was released on November 28, 2025. The film promises a violent and thrilling continuation featuring Samara Weaving, Elijah Wood, Sarah Michelle Gellar and others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shabana-azmis-diwali-gathering-unites-film-industry-friends-celebrating-achievements-2830240-2025-12-03",
      "headline": "Shabana Azmi shares joyful clip of Vidya, Divya, Sandhya owning the dance floor Shabana Azmi's recent social media posts reveal a joyful Diwali celebration with her circle of friends and colleagues, highlighting the camaraderie and appreciation within the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thudarum-malayalam-film-remake-ajay-devgn-aamir-khan-hindi-version-2830186-2025-12-03",
      "headline": "Aamir Khan and Ajay Devgn keen on Hindi remake of Mohanlal's Thudarum Director Tharun Moorthy confirms that discussions are in progress to remake the Malayalam hit Thudarum in Hindi, with major Bollywood studios and actors showing interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-calls-out-society-double-standards-men-move-on-women-are-judged-2830219-2025-12-03",
      "headline": "Malaika Arora calls out society's double standards: Men move on, women are judged Actor Malaika Arora highlighted societal double standards around divorce and remarriage. She pointed out how men face less judgement than women for similar personal choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-praises-yami-gautam-haq-role-actor-awaits-dhurandhar-2830220-2025-12-03",
      "headline": "Yami Gautam awaits husband's film Dhurandhar, director praises her Haq role Filmmaker Aditya Dhar praised his actor-wife Yami Gautam's acting in 'Haq' in an X post on Wednesday. While expressing her gratitude, Yami showcased excitement for Dhar's upcoming film 'Dhurandhar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shatrughan-sinha-pays-tribute-on-dev-anand-death-anniversary-2830231-2025-12-03",
      "headline": "Long live Dev saheb: Shatrughan Sinha pays tribute on Dev Anand's death anniversary Shatrughan Sinha paid a heartfelt tribute to Dev Anand on the legend's 13th death anniversary, recalling the life-changing advice the actor once gave him. Sharing old memories, Sinha said Dev Anand taught him to embrace his natural features and turn \"minus points\" into strengths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-sangeet-dance-rehearsal-viral-bollywood-wedding-season-2830216-2025-12-03",
      "headline": "Kartik Aaryan set to perform for free at a sangeet. Here's why Bollywood actor Kartik Aaryan's dance rehearsal for an upcoming sangeet ceremony has captured social media attention, with fans commenting on his moves and the festive spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakul-preet-talks-about-jackky-bhagnanis-financial-struggles-after-bade-miyan-2830211-2025-12-03",
      "headline": "Rakul Preet talks about Jackky Bhagnani's financial struggles after Bade Miyan Rakul Preet Singh has addressed rumours surrounding Pooja Entertainment's financial troubles, clarifying that the company is not shutting down despite losses after Bade Miyan Chote Miyan. She said sensational reporting exaggerated the situation and that financial ups and downs are common in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/magic-mike-earnings-retirement-benefits-divide-channing-tatum-jenna-dewan-divorce-settlement-2830170-2025-12-03",
      "headline": "Channing Tatum-Jenna Dewan divorce deal reveals who gets the Magic Mike millions Details of Channing Tatum and Jenna Dewan's divorce settlement, including the division of retirement benefits and ongoing disputes over Magic Mike earnings, have emerged following years of litigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reflects-on-early-struggles-says-she-had-no-idea-about-bollywood-2830111-2025-12-03",
      "headline": "Priyanka Chopra said the industry felt crazy when she entered Bollywood Priyanka Chopra spoke about navigating Bollywood as an outsider, the impact on her production choices, and her focus on supporting independent filmmakers through her company. She will be seen next in Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-scores-53rd-odi-hundred-raipur-celebrates-milestone-2830132-2025-12-03",
      "headline": "Anushka Sharma cheers as Virat Kohli hits his 53rd ODI century in Raipur Cricketer Virat Kohli scored his 53rd ODI century against South Africa in Raipur, and the internet is celebrating. His wife Anushka Sharma and fans shared their love and excitement online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ranveer-singhs-kantara-mimicry-lands-him-in-legal-trouble-complaint-filed-for-insulting-daiva-tradition-2830178-2025-12-03",
      "headline": "Ranveer Singh in legal trouble, complaint filed for insulting Daiva tradition A Bengaluru-based advocate has filed a complaint against Ranveer Singh for mimicking the Daiva scene from Kantara Chapter 1 at IFFI, alleging the act hurt religious sentiments of the Tulu-speaking community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-felt-half-naked-in-a-bodysuit-during-veere-di-wedding-song-tareefan-2829949-2025-12-03",
      "headline": "Swara Bhasker felt 'half-naked' in a bodysuit during Veere Di Wedding song Tareefan Swara Bhasker revealed the intense pressure to look glamorous during the filming of 'Veere Di Wedding'. Her struggle with wearing a bodysuit highlights the physical and emotional challenges faced on set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-savitri-directing-talent-gender-challenges-indian-film-industry-2830090-2025-12-03",
      "headline": "Kamal Haasan says Savitri was more talented than many directors she worked with At a recent art and literature festival, Kamal Haasan spoke about legendary actor-director Savitri, highlighting her skills and the challenges she faced in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lee-jung-ha-begin-marine-corps-military-service-january-2026-2830116-2025-12-03",
      "headline": "South Korean actor Lee Jung-ha enlists for military service, chooses Marines South Korean actor Lee Jung Ha, known for his roles in popular dramas, will commence his mandatory national service as a member of the Marine Corps on 26 January 2026, according to an announcement from his agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-ashes-immersed-ganga-haridwar-deol-family-private-rituals-2830084-2025-12-03",
      "headline": "Dharmendra's ashes immersed at Haridwar's Har Ki Pauri Legendary actor Dharmendra's ashes were immersed in the Ganga at Haridwar's Har Ki Paur. The rituals were performed by his grandsons. The family maintained utmost privacy during the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-to-return-to-tv-with-wheel-of-fortune-indian-version-source-2830082-2025-12-03",
      "headline": "Akshay Kumar to return to TV with Wheel of Fortune Indian version: Source Akshay Kumar is making a grand return to Indian television as the host of the Indian version of the iconic American game show Wheel of Fortune. The actor previously judged seasons of Khatron Ke Khiladi and Masterchef India. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indigo-faces-scrutiny-after-1232-flight-cancellations-in-november-delays-drop-in-on-time-performance-2830280-2025-12-03",
      "headline": "1,232 IndiGo flight cancelled in November, aviation regulator probesThe Directorate General of Civil Aviation sought reasons from the airline over the cancellations of flight and delays in time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pacts-on-health-trade-agriculture-media-cultural-exchange-to-be-signed-during-putins-india-visit-sources-2830243-2025-12-03",
      "headline": "Putin to visit India tomorrow: BrahMos, trade, media, agriculture on agendaPutin's first India visit since the Ukraine conflict, the trip includes a ceremonial welcome, bilateral summit with Prime Minister Narendra Modi, a business forum address and a state banquet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-airport-mosque-amit-malviya-bankra-history-location-secondary-runway-safety-concerns-relocation-deadlock-2830038-2025-12-03",
      "headline": "Mosque inside Kolkata airport kicks up storm. How did it actually get there?The century-old Bankra mosque, which is situated a few hundred metres from the secondary runway of Kolkata airport, has sparked a political row. BJP leaders have flagged safety and security concerns regarding the mosque. How did the mosque come to be in the airport in the first place?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-odi-raipur-dew-virat-kohli-ruturaj-gaikwad-aiden-markram-2830293-2025-12-03",
      "headline": "Virat Kohli, Ruturaj Gaikwad tons not enough as SA chase 359 in dewy RaipurIndia vs South Africa, 2nd ODI: South Africa scripted the joint-highest successful chase by a visiting team in ODIs in India when they gunned down 359 on a dewy evening. India finished second-best in Raipur despite hundreds from Virat Kohli and Ruturaj Gaikwad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/sanchar-saathi-is-unnecessary-app-and-waste-of-govt-money-it-serves-zero-purpose-except-data-collection-2830085-2025-12-03",
      "headline": "Sanchar Saathi is an unnecessary app and waste of govt moneyMandatory or not, Sanchar Saathi is an unnecessary app. This app solves zero cyber security issues because its functionality is superfluous and performative. In fact, Saathi is a waste of taxpayer's money."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-international-airlines-pia-airline-privatisation-flag-carrier-imf-international-monetary-fund-loan-islamabad-fauji-fertiliser-2830233-2025-12-03",
      "headline": "Pak to sell national carrier PIA for IMF loans, Munir's Fauji firm among biddersPakistan's sale of its flag carrier PIA is its first major privatisation in two decades. The divestment comes because of an IMF bailout condition. With four bidders, including military-led Fauji Fertiliser, the auction on December 23 is key for a debt-ridden economy and its crippled national carrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/scores-of-indigo-flights-cancelled-due-to-staff-crunch-tech-snag-many-stranded-2830205-2025-12-03",
      "headline": "IndiGo apologises as 85 flights cancelled, chaos at Delhi, Mumbai airportsAccording to sources, IndiGo's flight delays and cancellations stem from multiple factors, including the new regime of flight duty time limits (FDTL) introduced last month. These changes have altered pilot rosters and contributed to a crunch in available resources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-arrested-panipat-drowning-four-children-including-son-jealousy-2830087-2025-12-03",
      "headline": "Envious of their looks, Haryana woman drowns 3 girls, kills son to cover up crimeEach of the deaths took place in a similar manner, with the children found drowned in shallow water. In one case, the tub used was only one foot deep, leading investigators to question the likelihood of accidental death given the child's height. Officials said that after committing the crimes, the woman would celebrate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-series-amravati-man-sister-treatment-insurance-rejected-star-health-fraud-allegation-2829895-2025-12-03",
      "headline": "If it was forged, why not tell us?: Man refutes insurer's fraud tag on sister's claimWhen a dangerous blood clot hospitalised Purvi Gupta, her family expected their insurer to stand by them. Instead, they recount months of bewildering paperwork, escalating confusion, and a sudden fraud tag they insist was never disclosed. This week's 'Claim Denied' story follows a family left stunned and fighting for answers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/radical-islamic-movements-pose-imminent-threat-to-the-united-states-and-the-west-2830284-2025-12-03",
      "headline": "Seeks more territories: Marco Rubio warns of 'imminent threat' from radical IslamUnited States Secretary of State Marco Rubio pointed out that radical Islamic groups are willing to use any means to expand their influence, including assassinations and murders. He further noted that the overwhelming majority of attacks within the United States have been inspired by radical Islam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-war-with-india-imran-khan-sister-2829950-2025-12-03",
      "headline": "Asim Munir yearns for India war, Imran Khan wants to befriend BJP: Ex-PM's sisterIn an all-out attack on Pakistani army chief Asim Munir, Imran Khan's sister called him a radical Islamist and an Islamic conservative who yearned for a full-scale war with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/muslims-face-marginalisation-waqf-property-issues-samajwadi-party-mp-mohibullah-nadvi-2830249-2025-12-03",
      "headline": "How long will Muslims be oppressed? Samajwadi MP's 'jihad' remark in Lok SabhaSamajwadi Party MP Mohibullah Nadvi said the government's handling of the Waqf property verification process had deepened mistrust within the Muslim community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-weds-raj-nidimoru-isha-foundation-ceremony-2829742-2025-12-03",
      "headline": "Raj Nidimoru's sister welcomes Samantha: We stand by them without hesitationActor Samantha Ruth Prabhu and filmmaker Raj Nidimoru's wedding on December 1 in Coimbatore was followed by a warm family welcome, with Raj's sister sharing a heartfelt message and the first family portrait."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/hindu-groups-clash-with-cops-over-lighting-lamp-at-madurai-temple-2830236-2025-12-03",
      "headline": "Madurai temple showdown peaks: Hindu groups clash with cops over lighting lampThe members of these four groups, Hindu Makkal Katchi, ⁠Hindu Tamilar Katchi, ⁠Hanuman Senai, and Hindu Munnani, clashed with the police after they tried to climb the Thiruparankundram Hill to light up the lamp."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/ranveer-singhs-kantara-mimicry-lands-him-in-legal-trouble-complaint-filed-for-insulting-daiva-tradition-2830178-2025-12-03",
      "headline": "Ranveer Singh in legal trouble, complaint filed for insulting Daiva traditionA Bengaluru-based advocate has filed a complaint against Ranveer Singh for mimicking the Daiva scene from Kantara Chapter 1 at IFFI, alleging the act hurt religious sentiments of the Tulu-speaking community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/bharatiya-antariksh-station-configuration-completed-isro-2035-launch-2830039-2025-12-03",
      "headline": "Isro has readied the configuration of Bharatiya Antariksh StationThe Indian Space Research Organisation has finalised the overall configuration for the Bharatiya Antariksh Station, marking a significant milestone in India's human spaceflight ambitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-unveils-india-t20-world-cup-jersey-2026-heritage-design-2830159-2025-12-03",
      "headline": "Rohit Sharma unveils India's new jersey for 2026 T20 World CupRohit Sharma unveiled India's new jersey for the 2026 T20 World Cup during the mid-innings break of the second ODI against South Africa in Raipur on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/millets-in-your-burger-union-minister-praises-mcdonalds-desi-innovation-2830212-2025-12-03",
      "headline": "Millets in your burger? Union Minister praises McDonald's desi innovationUnion Minister Dr Jitendra Singh, shared his pride on X, highlighting how McDonald's India has contributed to the country's millet movement by bringing millets into their burger buns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/delhi-based-entrepreneur-vaibhav-chawla-closes-wherehouse-startup-after-frivolous-complaint-by-client-2829749-2025-12-03",
      "headline": "Delhi startup founder shuts down company after 'frivolous complaint' by clientAccording to its LinkedIn profile, Wherehouse was founded in 2021 as a supply chain intelligence company, helping brands move closer to their customers, enabling faster and more efficient deliveries, and driving business growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-break-into-pieces-bangladesh-peace-former-army-general-jamaat-chief-son-2829987-2025-12-03",
      "headline": "India must break into pieces for Bangladesh's peace: Ex-army officer's bombshellThe provocative remarks were made by Bangladeshi Brigadier General (retd) Abdullahil Amaan Azmi, the son of former Jamaat-e-Islami chief Ghulam Azam, during an online discussion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/gahmar-village-military-tradition-uttar-pradesh-defence-recruitment-legacy-2829510-2025-12-03",
      "headline": "The soldier village of India: Where nearly every home has a 'jawan'Gahmar, India's largest village of soldiers, continues to inspire generations with its deep-rooted military heritage. Despite modern challenges, the community's commitment to defence service remains unwavering and a source of collective pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-search-for-mh370-missing-for-12-years-is-starting-again-aviation-disaster-mystery-malaysia-airlines-deep-sea-search-2830057-2025-12-03",
      "headline": "Why search for MH370, missing for 12 years, is starting againThe search for Malaysia Airlines' ill-fated MH370 plane will resume on December 30, nearly 12 years after it went missing. US-based marine robotics company Ocean Infinity will conduct a deep-sea search in a high-probability zone. Here's why a 55-day search is starting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bryan-johnsons-heartfelt-confession-about-new-girlfriend-takes-internet-by-surprise-2830119-2025-12-03",
      "headline": "Bryan Johnson's heartfelt confession about new girlfriend takes internet by surpriseTech entrepreneur Bryan Johnson announced he finally has a girlfriend after 25 years of searching, and talked about their love story in a detailed post on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-pollution-aqi-dmk-mp-p-wilson-gas-chamber-winter-session-pollution-2830185-2025-12-03",
      "headline": "Gas chamber: DMK MP asks Centre to rethink winter session amid Delhi pollutionDMK MP P Wilson called Delhi a \"gas chamber\" amid worsening pollution and asked the government to avoid holding Parliament's winter session during peak smog. He urged decentralising administration and shifting institutions out of Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-attend-cousins-wedding-goa-family-moments-2830277-2025-12-03",
      "headline": "Ranveer Singh turns emotional as he walks his sister down the aisle. WatchBollywood actors Ranveer Singh and Deepika Padukone recently attended a family wedding in Goa, engaging actively in the ceremonies and garnering attention from relatives and guests. Videos from the event have surfaced online, capturing the couple's participation in traditional rituals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ready-or-not-2-trailer-samara-weaving-returns-to-gore-splattered-horror-comedy-2830261-2025-12-03",
      "headline": "Ready or Not 2 trailer: Samara Weaving returns to gore-splattered, horror-comedyThe trailer for 'Ready or Not 2: Here I Come' was released on November 28, 2025. The film promises a violent and thrilling continuation featuring Samara Weaving, Elijah Wood, Sarah Michelle Gellar and others."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-odi-raipur-dew-virat-kohli-ruturaj-gaikwad-aiden-markram-2830293-2025-12-03",
      "headline": "Virat Kohli, Ruturaj Gaikwad tons not enough as SA chase 359 in dewy Raipur India vs South Africa, 2nd ODI: South Africa scripted the joint-highest successful chase by a visiting team in ODIs in India when they gunned down 359 on a dewy evening. India finished second-best in Raipur despite hundreds from Virat Kohli and Ruturaj Gaikwad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sports-minister-mansukh-mandaviya-end-indian-football-deadlock-grill-aiff-2830297-2025-12-03",
      "headline": "Sports Minister leads talks to end Indian football impasse, confronts AIFF on issues Sports Minister Mansukh Mandaviya met AIFF officials, club representatives and prospective bidders to address Indian football's financial and structural crisis. He questioned leadership lapses, heard stakeholder concerns and promised a plan to end the ongoing stalemate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-ms-dhoni-smoke-shisha-talk-cricket-chennai-super-kings-michael-hussey-2830289-2025-12-03",
      "headline": "Smoke shisha, talk cricket: MS Dhoni's open-door CSK routine revealed by ex-teammate Michael Hussey lifts the lid on MS Dhoni's relaxed and welcoming team culture at CSK, sharing stories of open-room hangouts, shisha sessions and Dhoni's surprising lack of keeping practice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-e-scooter-helmet-breach-ashes-test-gabba-2830270-2025-12-03",
      "headline": "Irritated by media attention, Stokes snaps at Aussie reporter over e-scooter row Ashes: A tense standoff unfolded between Ben Stokes and a reporter in Brisbane after the England captain and teammates were questioned about not wearing helmets while riding e-scooters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aiden-markram-century-india-vs-south-africa-raipur-odi-2830263-2025-12-03",
      "headline": "Aiden Markram first visiting SA opener to hit hundred vs India in a decade Aiden Markram scored a superb 110 to become the first South African opener in ten years to make an ODI century in India. His dismissal marked a turning point as India regained control in a high-scoring match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/special-report-virat-kohlis-52nd-odi-century-and-roadmap-to-2027-world-cup-ytvd-2830238-2025-12-03",
      "headline": "Virat Kohli's 53rd ODI century and roadmap to 2027 World Cup IND vs SA: Virat Kohli scored his 53rd ODI hundred in Raipur on Wednesday. The former captain hit back-to-back hundreds against South Africa, raising the hopes of his place in the 2027 ODI World Cup squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-2nd-test-brisbane-all-you-need-to-know-pink-ball-pitch-conditions-weather-team-news-2830234-2025-12-03",
      "headline": "Ashes 2025-26: All you need to know about the pink-ball Test in Brisbane Australia aim to extend their dominance in day-night Tests as England looks to rebound from a heavy Perth defeat. With pitch conditions, twilight swing, and late-week storms in play, the Gabba pink-ball clash promises a decisive early twist in the 2025 Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohit-sharma-announces-retirement-from-all-formats-of-cricket-after-impactful-ipl-and-international-career-2830227-2025-12-03",
      "headline": "T20 specialist Mohit Sharma announces retirement from all formats of cricket Mohit Sharma, 37, retired from all formats of cricket on December 3. The former Delhi Capitals and Chennai Super Kings bowler made an impact as a death bowler in T20 cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-snubbed-fans-reaction-slam-gautam-gambhir-washington-sundar-india-vs-south-africa-t20is-2830218-2025-12-03",
      "headline": "Rinku Singh deserves a place: Fans slam batter's snub from IND vs SA T20I series IND vs SA: Rinku Singh's exclusion from India's T20I squad for the South Africa series has sparked widespread fan outrage. With the T20 World Cup 2026 looming, many believe his strike-rate and finishing skills made him indispensable — yet he remains overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-century-odi-addicted-former-cricketers-reaction-india-vs-south-africa-raipur-2830210-2025-12-03",
      "headline": "Virat Kohli addicted to scoring centuries: Cricket world celebrates 53rd ODI 100 IND vs SA: Virat Kohli's back-to-back centuries have reasserted his dominance in ODI cricket at the perfect moment. With a World Cup year approaching, the King looks firmly back in his most unstoppable rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-unveils-india-t20-world-cup-jersey-2026-heritage-design-2830159-2025-12-03",
      "headline": "Rohit Sharma unveils India's new jersey for 2026 T20 World Cup Rohit Sharma unveiled India's new jersey for the 2026 T20 World Cup during the mid-innings break of the second ODI against South Africa in Raipur on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-2nd-test-brisbane-all-you-need-to-know-pink-ball-pitch-conditions-weather-team-news-2830234-2025-12-03",
      "headline": "Ashes 2025-26: All you need to know about the pink-ball Test in Brisbane Australia aim to extend their dominance in day-night Tests as England looks to rebound from a heavy Perth defeat. With pitch conditions, twilight swing, and late-week storms in play, the Gabba pink-ball clash promises a decisive early twist in the 2025 Ashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohit-sharma-announces-retirement-from-all-formats-of-cricket-after-impactful-ipl-and-international-career-2830227-2025-12-03",
      "headline": "T20 specialist Mohit Sharma announces retirement from all formats of cricket Mohit Sharma, 37, retired from all formats of cricket on December 3. The former Delhi Capitals and Chennai Super Kings bowler made an impact as a death bowler in T20 cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-snubbed-fans-reaction-slam-gautam-gambhir-washington-sundar-india-vs-south-africa-t20is-2830218-2025-12-03",
      "headline": "Rinku Singh deserves a place: Fans slam batter's snub from IND vs SA T20I series IND vs SA: Rinku Singh's exclusion from India's T20I squad for the South Africa series has sparked widespread fan outrage. With the T20 World Cup 2026 looming, many believe his strike-rate and finishing skills made him indispensable — yet he remains overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-century-odi-addicted-former-cricketers-reaction-india-vs-south-africa-raipur-2830210-2025-12-03",
      "headline": "Virat Kohli addicted to scoring centuries: Cricket world celebrates 53rd ODI 100 IND vs SA: Virat Kohli's back-to-back centuries have reasserted his dominance in ODI cricket at the perfect moment. With a World Cup year approaching, the King looks firmly back in his most unstoppable rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-unveils-india-t20-world-cup-jersey-2026-heritage-design-2830159-2025-12-03",
      "headline": "Rohit Sharma unveils India's new jersey for 2026 T20 World Cup Rohit Sharma unveiled India's new jersey for the 2026 T20 World Cup during the mid-innings break of the second ODI against South Africa in Raipur on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20i-squad-shubman-gill-bcci-hardik-pandya-2830155-2025-12-03",
      "headline": "Shubman Gill and Hardik Pandya return as India announce T20I squadIndia vs South Africa: The BCCI announced a 15-man squad for a five-match T20I series, which will be played from December 9 to 19. Shubman Gill returned as vice-captain, but his availability will be subject to fitness. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/queensland-minister-slams-ben-stokes-co-for-ignoring-helmet-rules-on-e-scooter-2829972-2025-12-03",
      "headline": "Queensland minister slams Ben Stokes & co for driving e-scooter without helmetsLocal authorities and officials in Queensland have called out England cricket stars Ben Stokes, Mark Wood and Jamie Smith after they were seen riding electric two-wheelers without helmets in Brisbane, despite local regulations mandating protective gear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-odi-ruturaj-gaikwad-maiden-odi-hundred-reaction-gautam-gambhir-praise-2830113-2025-12-03",
      "headline": "Ruturaj Gaikwad's maiden ODI hundred draws praise for Gautam Gambhir. Here's whyRuturaj Gaikwad's first ODI hundred becomes a validation of head coach Gautam Gambhir's selection strategy, with cricketing voices praising the clarity of roles that enabled the batter to excel in an unfamiliar position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-ruturaj-gaikwad-escapes-being-hit-by-virat-kohlis-powerful-straight-hit-2830095-2025-12-03",
      "headline": "Watch: Ruturaj Gaikwad narrowly escapes being hit by Kohli's fierce straight hitRuturaj Gaikwad narrowly escaped injury from a powerful shot by Virat Kohli during their record partnership in the second ODI against South Africa. The duo added 195 runs for the third wicket to stabilise India's innings and set a new highest partnership record against South Africa."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/virat-kohli-hits-53rd-odi-century-vs-south-africa-ruturaj-gaikwad-slams-maiden-ton-ytvd-2830094-2025-12-03",
      "headline": "Virat Kohli Hits 53rd ODI Century vs South Africa; Ruturaj Gaikwad Slams Maiden TonIn this Special Report, India Today's Consulting Editor (Sports) Nikhil Naaz reports on Virat Kohli's record-breaking 53rd ODI century against South Africa in Raipur. Kohli, scoring his 84th international hundred, built a match-winning partnership with Ruturaj Gaikwad, who registered his maiden ODI ton. Naaz highlights Kohli's 'unbelievable' consistency and addresses speculations about his Test return. Quoting Kohli, Naaz confirms the star batter's decision to stick to one format: 'I'm focusing on the ODI format, that's the only format that I continue to play.' The report analyzes how the duo rescued India from a precarious 60 for 2 to dominate the 2nd ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-virat-kohli-53rd-odi-hundred-raipur-2830065-2025-12-03",
      "headline": "Virat Kohli roars again, hits back-to-back hundreds vs South AfricaIndia vs South Africa: Star India batter Virat Kohli extended his 50-over purple patch characteristically, scoring his 53rd ODI hundred and his second in succession against South Africa at the Shaheed Veer Narayan Singh International Stadium in Raipur on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-maiden-odi-hundred-south-africa-raipur-2830061-2025-12-03",
      "headline": "Ruturaj converts rare opportunity, smashes maiden ODI hundred in RaipurIndia vs South Africa: Ruturaj Gaikwad hit his maiden ODI hundred on Wednesday, bringing up the landmark in just 77 deliveries. The Chennai Super Kings captain stitched a 190-plus partnership with Virat Kohli in Raipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sg-pipers-jarmanpreet-singh-navneet-kaur-captains-hockey-india-league-season-2-2830045-2025-12-03",
      "headline": "Jarmanpreet Singh, Navneet Kaur to lead SG Pipers in HIL season 2SG Pipers have revealed their captaincy choices for Season 2 of the Hockey India League, appointing Jarmanpreet Singh to helm the men's squad and retaining Navneet Kaur for the women's side. Australians Ky Willott and Kaitlin Nobbs step in as vice-captains, as both teams look to rebound from last year's campaigns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-hockey-coaching-crisis-harendra-marijne-long-term-vision-2830050-2025-12-03",
      "headline": "The Coaching Quandary: Why Indian Hockey keeps failing the long-term vision testIndian hockey still seems to be stuck in terms of fixing their long-term vision when it comes to coaches. With Harendra Singh leaving the Women's team post, Hockey India are set to make an interesting call and go for former coach Sjoerd Marijne. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-1st-test-jacob-duffy-5-wicket-haul-tagenarine-chanderpaul-2830034-2025-12-03",
      "headline": "NZ vs WI, 1st Test: Jacob Duffy takes five as New Zealand seize control on Day 2Jacob Duffy took his maiden five-wicket haul to put New Zealand in control of the first Test against West Indies. His spell helped bundle out the visitors for 167 as the Kiwis finished the day with a lead of 96 runs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-maxwell-ashwin-faf-russell-withdrawals-jp-duminy-explains-2830031-2025-12-03",
      "headline": "Why senior pros are retiring from IPL ahead of 2026 mini auctionJP Duminy explained why senior pros like Glenn Maxwell and Faf du Plessis have decided to pull out of the IPL 2026 auction. The duo have been joined by the likes of Andre Russell and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-ashes-return-possible-steve-smith-gabba-test-2830023-2025-12-03",
      "headline": "Cummins fit for Gabba Test? Steve Smith tight-lipped on Australia's playing XIAshes: Pat Cummins may return as Australia's captain for the second Test against England, with stand-in skipper Steve Smith indicating that the fast bowler has a genuine chance of featuring in the pink-ball match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-overtakes-gill-icc-odi-rankings-ranchi-rohit-sharma-2829992-2025-12-03",
      "headline": "Virat Kohli leapfrogs Gill in ICC ODI rankings, Rohit maintains top spotVirat Kohli went past India captain Shubman Gill in the latest ICC ODI rankings while Rohit Sharma maintained his grip at the top. Kohli scored a brilliant 135 against South Africa in Ranchi in his return game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-kl-rahul-loses-20th-straight-toss-raipur-bavuma-2829941-2025-12-03",
      "headline": "Watch: KL Rahul left frustrated as India lose 20th straight ODI toss in RaipurIndia captain KL Rahul was left gutted as the Indian team lost their 20th straight toss in ODIs with South Africa getting the luck of the coin in Raipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-harshit-rana-reprimanded-for-aggressive-send-off-to-dewald-brevis-in-ranchi-2829915-2025-12-03",
      "headline": "Harshit Rana reprimanded for aggressive send-off to Dewald Brevis in RanchiHarshit Rana has been reprimanded for breaching Level 1 of the ICC Code of Conduct during the first ODI against South Africa in Ranchi on Sunday. Rana admitted to the offence, which involved a gesture after dismissing Dewald Brevis in the 22nd over of South Africa's innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pickleballindian-pickleball-league-launch-delhi-six-franchises-ipbl-2025-2829899-2025-12-03",
      "headline": "How an IPL- styled league is bringing about a revolution in Pickleball in India?Pickleball as a sport is capturing the imagination of many people in India, and to capitalise on that, a new Indian Pickleball League was inaugurated in New Delhi and one hopes that the league taps into the exponential growth of Pickleball in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-fitness-update-india-south-africa-t20i-series-2025-2829890-2025-12-03",
      "headline": "Shubman Gill's injury rehab timeline: Batter set for final test on December 5India opener Shubman Gill is on track with his neck injury recovery ahead of the South Africa T20I series. His final fitness clearance hinges on a Return to Play match scheduled for December 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-mohammed-kaif-comments-india-vs-south-africa-2829865-2025-12-03",
      "headline": "Kohli won't come back to Tests now: Kaif rules out retirement U-turn for starFormer cricketer Mohammed Kaif feels that Virat Kohli will never make a retirement U-turn in Test cricket. There were rumours that BCCI were thinking about bringing back Kohli into the long format after recent results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/scott-boland-on-horrendous-spell-in-ashes-test-perth-2829840-2025-12-03",
      "headline": "How Boland bounced back from a horrific 1st innings in Perth? Pacer revealsScott Boland bounced back from a tough first innings in the first Ashes Test against England. He went on to pick a four-wicket haul in the second innings, playing a key role in Australia's win."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}