{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-review-investors-subscription-long-term-growth-not-listing-gains-experts-2617144-2024-10-15",
      "headline": "Hyundai IPO: Why investors should focus on long-term growth, not listing gainsHyundai Motor IPO: While Hyundai's IPO is undoubtedly generating excitement, experts are saying this is more of a marathon than a sprint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-day-1-check-latest-subscription-gmp-key-details-2617105-2024-10-15",
      "headline": "Hyundai IPO: Check latest subscription and GMP on Day 1Hyundai Motor India IPO: India's biggest public offering opened for subscription on Monday, looking to raise Rs 27,870.16 crore with an offer for sale of 14.22 crore shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-share-price-drops-q2-results-net-profit-investor-trading-strategy-brokerage-views-2617086-2024-10-15",
      "headline": "RIL shares dip 1% after Q2 results. What should investors do? Reliance Industries share price: The dip, driven by weaker-than-expected performance in its oil-to-chemicals (O2C) segment, has left investors and analysts contemplating their next move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-subscription-latest-gmp-price-band-issue-size-subscribe-or-not-2617010-2024-10-15",
      "headline": "Hyundai IPO opens for subscription: Check GMP, price band, other key detailsHyundai Motor India IPO: The price band for the IPO has been set between Rs 1,865 and Rs 1,960 per share. Through this public offering, Hyundai aims to raise Rs 27,856 crore"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blinkit-scraps-zero-notice-policy-amid-talent-war-in-quick-commerce-zomato-swiggy-report-2617005-2024-10-15",
      "headline": "Blinkit scraps 'zero notice' policy amid talent war in quick commerce: ReportThe change in policy comes in response to growing competition in the quick commerce industry as Blinkit faces stiff competition from other players like Zepto, Flipkart, and Swiggy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-view-book-profit-or-hold-for-long-term-2617002-2024-10-15",
      "headline": "Garuda Construction and Engineering listing: Book profit or hold?Garuda Construction and Engineering listing: Despite a sluggish outlook in the grey market, which had indicated a flat or negative listing, the company surprised many with its strong opening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-stock-market-listing-gain-premium-rs-105-2616990-2024-10-15",
      "headline": "Garuda Construction and Engineering shares list at 10.5% premium at Rs 105Garuda Construction and Engineering IPO listing: The company's market debut has exceeded expectations, particularly given the flat to negative outlook in the grey market before the listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-close-to-surpassing-apple-worlds-most-valuable-company-market-value-stock-surge-2616986-2024-10-15",
      "headline": "Nvidia inches closer to overtaking Apple as world's most valuable companyNvidia share price: The latest stock jump pushed Nvidia's market value to $3.39 trillion, just shy of Apple's $3.52 trillion, but ahead of Microsoft's $3.12 trillion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-reliance-industries-hcltech-q2-results-cpi-retail-inflation-2616983-2024-10-15",
      "headline": "Sensex, Nifty gain in early trade, RIL shares drop after Q2 resultsThe S&P BSE Sensex was up 194.75 points at 82,167.80 at around 9:39 am, while the NSE Nifty50 was up 38.30 points to 25,166.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-limited-q2fy25-results-earnings-net-profit-revenue-2616792-2024-10-14",
      "headline": "RIL Q2 profit slips 5% to Rs 16,563 crore, still beats market expectationsRIL Q2 results: Reliance Industries beat street expectations in Q2 despite a 5% drop in profit, driven by strong digital and upstream growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcl-technologies-q2-fy25-net-profit-revenue-rs-12-interim-dividend-declared-2616703-2024-10-14",
      "headline": "HCLTech Q2 results: Net profit jumps 11% to Rs 4,235 crore, dividend declaredHCLTech declared another interim dividend of Rs 12 per share, taking the total interim dividend for the fiscal year so far to Rs 42 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-increases-549-per-cent-september-2616687-2024-10-14",
      "headline": "Retail inflation jumps to 9-month high of 5.49% in SeptemberFood prices saw an even more significant spike, with the Consumer Food Price Index (CFPI) recording a year-on-year inflation rate of 9.24%. Rural areas faced food inflation of 9.08%, while urban areas experienced an increase of 9.56%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-opens-tomorrow-latest-gmp-price-band-brokerage-views-subscribe-or-not-2616672-2024-10-14",
      "headline": "Hyundai Motor IPO opens tomorrow: Check latest GMP, brokerage reviews and moreHyundai Motor India IPO: Priced between Rs 1,865 and Rs 1,960 per share, the IPO is expected to raise Rs 27,856 crore through an offer for sale of 14.2 crore shares, representing a 17.5% stake."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-update-sensex-600-points-nifty-above-25000-hdfc-wipro-reliance-industries-2616626-2024-10-14",
      "headline": "Sensex ends 600 points higher, Nifty gains; Wipro, HDFC Bank stocks rallyThe S&P BSE Sensex was up 591.69 points to 81,973.05 at the closing bell, while the NSE Nifty50 gained 163.70 points to settle at 25, 127.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/daron-acemoglu-simon-johnson-james-a-robinson-award-nobel-economics-prize-2616586-2024-10-14",
      "headline": "Daron Acemoglu, Simon Johnson, James A. Robinson awarded Nobel Economics Prize 2024Nobel Economics Prize 2024: This year's laureates provide valuable insights into how institutions are formed and their crucial role in fostering sustainable development and prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-update-before-diwali-central-government-employees-pensioners-october-31-2616535-2024-10-14",
      "headline": "DA hike before Diwali? Big update for central government employeesDearness Allowance (DA) is revised twice a year, providing employees with financial support that helps maintain their purchasing power as living costs rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-14-2024-precious-metals-witness-dip-on-mcx-latest-rates-2616463-2024-10-14",
      "headline": "Gold, silver price today, October 14, 2024: Precious metals witness dip on MCXGold Price Today October 14, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-share-price-jump-q2-results-investors-buy-or-sell-2616443-2024-10-14",
      "headline": "HDFC Bank shares rise 2% ahead of Q2 results. What should investors do? HDFC Bank share price: Investors are showing increased interest in HDFC Bank shares, anticipating a positive performance in the upcoming quarterly results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dmart-avenue-supermarts-share-price-plunges-q2-results-brokerage-downgrades-2616419-2024-10-14",
      "headline": "Explained: Why DMart shares plunged 9% in early trade todayThe sharp decline in shares came after DMart's second-quarter earnings failed to meet the market's expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-gain-wipro-hdfc-dmart-shares-in-focus-inflation-data-q2-results-2616404-2024-10-14",
      "headline": "Sensex jumps 500 points, Nifty above 25,000; Wipro, HDFC Bank gain The S&P BSE Sensex was up 409.75 points to 81,791.11 at 10:20 am, while the NSE Nifty50 rose 126.45 points to trade at 25,090.70. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-announce-dates-assembly-elections-maharashtra-jharkhand-2616961-2024-10-15",
      "headline": "Maharashtra, Jharkhand election dates to be announced shortly Live updatesThe Election Commission is announcing the schedule for Assembly elections in Maharashtra and Jharkhand. Besides the polls for the two assemblies, the poll panel might also announce bypolls for three Lok Sabha seats and 12 Assembly seats of UP and Gujarat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/holiday-schools-colleges-bengaluru-heavy-rain-work-from-home-officials-2617213-2024-10-15",
      "headline": "Bengaluru schools shut tomorrow amid heavy rain, work from home advised for officesHoliday for schools, colleges in Bengaluru tomorrow due to heavy rain, work from home advised for officials"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ajit-doval-canada-secret-meeting-lawrence-bishnoi-khalistan-separatists-hardeep-nijjar-2616998-2024-10-15",
      "headline": "India, Canada discussed Bishnoi gang at secret meet, claims US reportIn the meeting, Ajit Doval acknowledged that Lawrence Bishnoi was capable of orchestrating violence from wherever he was incarcerated, according to a report in The Washington Post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shanghai-cooperation-organisation-sco-summit-begin-pakistan-islamabad-lockdown-heavy-security-external-affairs-minister-s-jaishankar-attendance-2617012-2024-10-15",
      "headline": "SCO Summit in Pakistan: S Jaishankar arrives in Islamabad to attend meet  LIVE UPDATESExternal Affairs Minister S Jaishankar landed in Pakistan today to attend the two-day SCO meet. It's the first time in nearly nine years that an Indian foreign minister has visited Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-row-affect-visa-services-students-2617192-2024-10-15",
      "headline": "Will the India-Canada diplomatic standoff affect visa services?India-Canada row: The downturn in the already frosty ties between India and Canada may have a bearing on how visa processes are handled, potentially affecting students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-diwali-bonus-government-employees-assembly-election-dates-2617212-2024-10-15",
      "headline": "Maharashtra announces Diwali bonus for government staff minutes before poll datesMaharashtra announces Diwali bonus for government staff minutes before poll dates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/justin-trudeau-kamala-harris-and-donald-trump-india-canada-tango-opinion-2617195-2024-10-15",
      "headline": "Trudeau twirl - Can Harris, Trump dance to India-Canada tango?With Justin Trudeau now claiming India is running covert operations on Canadian soil, it's got all the elements of a drama nobody saw coming — especially not Kamala Harris and Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-sign-deal-predator-drones-military-enhancement-cooperation-2617117-2024-10-15",
      "headline": "India, US sign Rs 32,000-crore deal for 31 Predator dronesThe development comes less than a month after Prime Minister Narendra Modi and US President Joe Biden held talks about the acquisition of the Predator drones on the sidelines of the Quad Leaders' Summit held in Delaware. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-rajasthan-bollywood-salman-khan-why-blackbucks-chinkara-important-for-bishnoi-community-2616720-2024-10-15",
      "headline": "Why blackbucks are so dear to Bishnoi communityThe 1998 killing of two blackbucks continues to haunt actor Salman Khan. Gangster Lawrence Bishnoi has repeatedly threatened to kill him over the incident. While the gangster could be using the case as a ruse, the Bishnois have shared a deep bond with blackbucks and chinkaras for centuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/rajasthan-the-royal-canvas-for-dream-weddings-2615738-2024-10-12",
      "headline": "Rajasthan: The Royal Canvas for Dream WeddingsWhether it's the grandeur of a palace wedding in Udaipur, the mystique of a desert wedding in Jaisalmer, or the creativity of a themed wedding in Jaipur, Rajasthan offers a wedding experience that is truly out of the ordinary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/india-canada-diplomatic-row-lawrence-bishnoi-group-khalistanis-justin-trudeau-2616890-2024-10-15",
      "headline": "Canada throws in 'Bishnoi gang' to push old charge against IndiaCanada alleged that Indian agents present on its soil are working with the Lawrence Bishnoi gang to target pro-Khalistan elements. Incidentally, the allegations come at a time when Lawrence Bishnoi is in the news in India for his alleged involvement in the murder of NCP leader Baba Siddique."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-chennai-rains-imd-mk-stalin-monsoon-preparedness-schools-shut-it-firms-work-from-home-2616939-2024-10-15",
      "headline": "Chennai rain alert: Heavy showers hit city, 5 flights cancelled, schools shut  Live UpdatesTamil Nadu Chief Minister MK Stalin has asked the information technology (IT) companies to allow their employees to work from home till October 18, amid a heavy rain alert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-joint-parliamentary-panel-meeting-scuffle-bjp-opposition-mps-2617119-2024-10-15",
      "headline": "Brawl between NDA, Opposition MPs during Waqf bill panel meetingThe Opposition accused the BJP MPs of using offensive language against them and walked out of the meeting for the second consecutive day.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-maharashtra-mlas-likely-dropped-reshuffle-election-strategy-haryana-loss-2617136-2024-10-15",
      "headline": "10 Congress MLAs on the chopping block ahead of Maharashtra polls: SourcesAt least 10 sitting MLAs are likely to be left off the Congress's candidate list for the upcoming Maharashtra assembly elections, sources told India Today TV. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-canada-diplomatic-row-demoted-downgrade-relation-justin-trudeau-naya-new-pakistan-imran-khan-2617023-2024-10-15",
      "headline": "How Trudeau turned Canada into naya Pakistan for IndiaAs India recalls its envoy from Ottawa and expels diplomats, it has demoted Canada to Pakistan's status. This is how Canada has been harbouring terrorists, resorting to the blame game to become the naya Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/gujarat-video-narrow-escape-for-surat-woman-after-water-tank-falls-on-her-2617181-2024-10-15",
      "headline": "Video: Narrow escape for Gujarat woman after water tank falls on herA woman in Gujrat's Surat district escaped unhurt after an empty water tank fell on her. According to the details, the incident happened on October 10 when the woman was roaming outside her home. A video of the incident showed the water tank coming crashing down on the woman and covered her, but she narrowly escaped what could have been a fatal incident. After the incident, locals came to the spot and rescued the woman from the water tank."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-case-ncp-leader-mumbai-police-detained-up-bahraich-accused-2617145-2024-10-15",
      "headline": "Fourth accused arrested in UP in Baba Siddique murder caseA fourth accused in the murder of NCP leader Baba Siddique was arrested by the Mumbai Police in Uttar Pradesh's Bahraich. One individual was also detained in connection with the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-not-take-undercooked-mohammed-shami-to-australia-rohit-sharma-2617059-2024-10-15",
      "headline": "India will not take 'undercooked' Mohammed Shami to Australia: Rohit SharmaIndia will not carry an injured Mohammed Shami to Australia in the Border-Gavaskar Trophy, said Rohit Sharma. Shami has been rehabilitating at the National Cricket Academy in Bengaluru since his ankle surgery.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-obstacle-course-racing-zahabiya-merchant-exclusive-2617054-2024-10-15",
      "headline": "With Olympics 2028 as goal, India's Zahabiya Merchant racing through obstaclesIn an exclusive interview with IndiaToday, Obstacle Course Racer Zahabiya Merchant discusses her dream of competing at the Los Angeles Olympics. The 27-year-old recalls how she fell in love with the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/video-man-attends-client-meeting-at-durga-puja-pandal-bengaluru-leaves-internet-furious-2617188-2024-10-15",
      "headline": "Video of man attending client meeting at Durga Puja pandal leaves Internet furiousA video of a man attending a client meeting while offering prayers at a Durga Puja pandal in Bengaluru has left social media users furious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/royal-canadian-mounted-police-nijjar-murder-sikh-canadians-khalistani-elements-canada-india-tensions-2616975-2024-10-15",
      "headline": "Watch: Canada cops' self-goal on charges of India targeting Sikh CanadiansThe Royal Canadian Mounted Police seemingly shot itself in the foot with an inadvertent admission while detailing its investigation into Nijjar's murder and related cases and their links to \"agents of the Indian government\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bahraich-violence-durga-immerssion-procession-yogi-adityanath-to-meet-family-of-man-akhilesh-yadav-congress-priyanka-gandhi-2616958-2024-10-15",
      "headline": "Bahraich violence: Yogi Adityanath meets riot victim's family, situation tenseUttar Pradesh Chief Minister Yogi Adityanath met the family of the 22-year-old man who was shot dead during a Goddess Durga idol immersion procession in the state's Bahraich district. The local BJP MLA was also present during the meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-saket-gokhale-lawrence-bishnoi-gang-india-canada-row-2617087-2024-10-15",
      "headline": "Who is protecting Lawrence Bishnoi? Trinamool MP to Centre on Canada's chargeSaket Gokhale questioned how Lawrence Bishnoi was able to allegedly carry out murders and extortion in India and abroad from jail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/varun-dhawan-samantha-citadel-honey-bunny-trailer-launch-kashvi-majmundar-2617204-2024-10-15",
      "headline": "Varun, Samantha at Citadel Honey Bunny trailer launch, little Kashvi steals the showVarun Dhawan and Samantha, along with the team of their upcoming series Citadel Honey Bunny, attended the trailer launch on October 15. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/sara-arfeen-khan-bigg-boss-18-exclusive-2617203-2024-10-15",
      "headline": "Sara Arfeen Khan: Didn't take up Bigg Boss 18 because I was out of work Sara Arfeen Khan, before entering Bigg Boss 18, spoke to India Today and shared why she said yes to the reality show. The show also marks her comeback to television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/italian-filmmaker-giuseppe-tornatore-on-indian-films-similarities-between-both-countries-2617154-2024-10-15",
      "headline": "Italian filmmaker Giuseppe Tornatore on India visit: One week wasn't enoughItalian filmmaker Giuseppe Tornatore visited India for the premiere of his film Cinema Paradiso. During an interview with India Today Digital, he discussed its lasting impact, similarities between Indian and Italian cinema, and his future film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-varma-on-acting-opportunities-in-hollywood-2617150-2024-10-15",
      "headline": "Vijay Varma on acting opportunities in Hollywood: Time to make that jumpIndian actor Vijay Varma wants to explore acting opportunities in Hollywood. He was last seen in the acclaimed Netflix series, IC 814. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsofts-vice-president-of-genai-research-is-leaving-the-company-to-join-openai-2617200-2024-10-15",
      "headline": "Microsoft's VP of GenAI research is leaving the company to join OpenAIBubeck's departure follows his contribution to Microsoft's development of Phi LLMs — more compact models compared to traditional large language models (LLMs)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/jio-launches-jiobharat-v3-and-v4-in-india-price-starts-at-rs-1099-2617146-2024-10-15",
      "headline": "IMC 2024: Jio launches JioBharat V3 and V4 in India, price starts at Rs 1,099 Reliance Jio has launched the JioBharat V3 and V4 models at the India Mobile Congress 2024, priced at Rs 1,099, aiming to provide affordable 4G connectivity to 2G users in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/pixel-9-pro-pre-orders-start-october-17-listing-goes-live-on-flipkart-2617120-2024-10-15",
      "headline": "Pixel 9 Pro pre-orders start October 17, listing goes live on Flipkart The Pixel 9 Pro, available for pre-orders from October 17 on Flipkart, promises to captivate tech enthusiasts with its advanced features and sleek design, priced at Rs 1,09,999 for the 16GB + 256GB variant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-se4-vs-iphone-16-here-is-how-apple-will-make-its-new-se-affordable-2617114-2024-10-15",
      "headline": "iPhone SE 4 vs iPhone 16: Here is how Apple will make its new SE affordable Apple is likely to launch the new iPhone SE 4 in early 2025 offering a budget-friendly option with features from the premium iPhone 16 series. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-india-vs-new-zealand-yashasvi-jaiswal-success-not-surprise-2617186-2024-10-15",
      "headline": "Yashasvi Jaiswal's early success not a 'surprise at all' for Rohit SharmaIndia vs New Zealand: Speaking to the press in Bengaluru on Tuesday, Rohit Sharma heaped praise on Yashasvi Jaiswal, reiterating the youngster's potential to become one of India's batting mainstays in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-dropping-babar-azam-will-get-sponsors-worried-says-ramiz-raja-2617183-2024-10-15",
      "headline": "Dropping Babar Azam will get sponsors worried: Ramiz RajaFormer Pakistan Cricket Board president Ramiz Raja said that dropping Babar Azam will worry the sponsors of Pakistan cricket. Speaking during Day 1 of the 2nd Test, Raja said that Babar is the only saleable commodity in Pakistan cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-india-and-new-zealand-training-marred-by-intense-rains-in-bengaluru-2617179-2024-10-15",
      "headline": "Watch: India and New Zealand training marred by intense rains in BengaluruThe practice session of the Indian team and the Kiwis was interrupted at the M Chinnaswamy Stadium amid intense rains in Bengaluru. The two teams will face each other in the opening Test on October 16, Wednesday with rain predicted through the course of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pro-kabaddi-league-u-mumba-swot-analysis-sunil-kumar-2617177-2024-10-15",
      "headline": "U Mumba bank on new faces and defence for revival in season 11With some new faces and a rejuvenated defence, U Mumba will be on the hunt to revive their fortunes after multiple league stage exits in the past few seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-joe-root-shines-ball-with-jack-leachs-shiny-head-in-multan-2617174-2024-10-15",
      "headline": "Watch: Joe Root shines ball with Jack Leach's 'shiny' head in MultanJoe Root was spotted shining the red ball with Jack Leach's bald yet shiny head during the 2nd Test between England and Pakistan. The use of saliva to shine the ball was banned during Covid-19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-bengaluru-test-rohit-sharma-press-conference-2617168-2024-10-15",
      "headline": "India keen on building pace-bowling bench strength for Australia tour: Rohit SharmaIndia vs New Zealand, 1st Test: Speaking to the press in Bengaluru on the eve of the Test, Rohit Sharma confirmed the team combination will be influenced by the weather conditions. Rohit also gave an update on Mohammed Shami's latest injury setback and how the team is planning to build a strong fast-bowling bench strength ahead of the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-replacement-kamran-ghulam-slams-fifty-in-maiden-test-outing-vs-england-2617156-2024-10-15",
      "headline": "Babar Azam replacement Kamran Ghulam slams fifty in maiden Test outingBabar Azam replacement Kamran Ghulam hit a gritty half-century on his debut. Batting against England on Day 1 of the 2nd Test match, Ghulam saved Pakistan from a top-order failure alongside Saim Ayub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-shubman-gill-stiff-neck-bengaluru-test-team-playing-11-2617149-2024-10-15",
      "headline": "Shubman Gill in doubt for Bengaluru Test due to stiff neckIndia vs New Zealand: Shubman Gill complained of pain in his neck and shoulders on Monday. A call on his availability will be taken on Wednesday morning before the toss, sources have said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-obstacle-course-racing-zahabiya-merchant-exclusive-2617054-2024-10-15",
      "headline": "With Olympics 2028 as goal, India's Zahabiya Merchant racing through obstaclesIn an exclusive interview with IndiaToday, Obstacle Course Racer Zahabiya Merchant discusses her dream of competing at the Los Angeles Olympics. The 27-year-old recalls how she fell in love with the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-mayank-yadav-travelling-reserves-rohit-sharma-press-conference-2617141-2024-10-15",
      "headline": "India thinking of taking Mayank Yadav, other reserves to Australia: Rohit SharmaIndia captain Rohit Sharma has claimed that the team management is thinking about taking Mayank Yadav and the other travelling reserves to Australia for the Border Gavaskar Trophy. Mayank impressed during the Bangladesh series recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-always-part-of-leadership-rohit-sharma-amid-perth-test-captaincy-rumours-2617134-2024-10-15",
      "headline": "Bumrah always part of leadership: Rohit Sharma amid Perth Test captaincy rumoursRohit Sharma opened up about the ongoing rumours of Jasprit Bumrah becoming India's captain for the 1st Test vs Australia in Perth in his absence. Rohit hailed the pacer for his experience and said that Bumrah has always been part of the leadership group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-replacement-kamran-ghulam-slams-fifty-in-maiden-test-outing-vs-england-2617156-2024-10-15",
      "headline": "Babar Azam replacement Kamran Ghulam slams fifty in maiden Test outingBabar Azam replacement Kamran Ghulam hit a gritty half-century on his debut. Batting against England on Day 1 of the 2nd Test match, Ghulam saved Pakistan from a top-order failure alongside Saim Ayub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-shubman-gill-stiff-neck-bengaluru-test-team-playing-11-2617149-2024-10-15",
      "headline": "Shubman Gill in doubt for Bengaluru Test due to stiff neckIndia vs New Zealand: Shubman Gill complained of pain in his neck and shoulders on Monday. A call on his availability will be taken on Wednesday morning before the toss, sources have said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/los-angeles-olympics-2028-obstacle-course-racing-zahabiya-merchant-exclusive-2617054-2024-10-15",
      "headline": "With Olympics 2028 as goal, India's Zahabiya Merchant racing through obstaclesIn an exclusive interview with IndiaToday, Obstacle Course Racer Zahabiya Merchant discusses her dream of competing at the Los Angeles Olympics. The 27-year-old recalls how she fell in love with the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-mayank-yadav-travelling-reserves-rohit-sharma-press-conference-2617141-2024-10-15",
      "headline": "India thinking of taking Mayank Yadav, other reserves to Australia: Rohit SharmaIndia captain Rohit Sharma has claimed that the team management is thinking about taking Mayank Yadav and the other travelling reserves to Australia for the Border Gavaskar Trophy. Mayank impressed during the Bangladesh series recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-always-part-of-leadership-rohit-sharma-amid-perth-test-captaincy-rumours-2617134-2024-10-15",
      "headline": "Bumrah always part of leadership: Rohit Sharma amid Perth Test captaincy rumoursRohit Sharma opened up about the ongoing rumours of Jasprit Bumrah becoming India's captain for the 1st Test vs Australia in Perth in his absence. Rohit hailed the pacer for his experience and said that Bumrah has always been part of the leadership group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamil-nadu-has-best-infrastructure-jaydev-unadkat-hails-drainage-during-ranji-trophy-match-2617108-2024-10-15",
      "headline": "Tamil Nadu has best infrastructure: Unadkat hails drainage during Ranji matchSaurashtra captain Jaydev Unadkat hailed the drainage facilities of the Tamil Nadu Cricket Association. The ground was completely dried up despite a day off full of rain before that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-not-take-undercooked-mohammed-shami-to-australia-rohit-sharma-2617059-2024-10-15",
      "headline": "India will not take 'undercooked' Mohammed Shami to Australia: Rohit SharmaIndia will not carry an injured Mohammed Shami to Australia in the Border-Gavaskar Trophy, said Rohit Sharma. Shami has been rehabilitating at the National Cricket Academy in Bengaluru since his ankle surgery.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/stranded-for-16-hours-at-airport-frustrated-nigeria-pull-out-of-match-vs-libya-2617099-2024-10-15",
      "headline": "Stranded for 16 hours at airport, frustrated Nigeria pull out of match vs LibyaNigeria have pulled out of their Africa Cup of Nations qualifier in Libya and were heading home after being stranded for 16 hours at an airport, 250 kilometres away from the venue. Nigeria players made the incident public via their social media accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/unmukt-chand-meets-sachin-tendulkar-in-the-usa-god-in-dallas-today-2617081-2024-10-15",
      "headline": "Unmukt Chand meets Sachin Tendulkar in the USA: God in Dallas todayUnmukt Chand met Sachin Tendulkar at Dallas in the USA and shared the snippets on social media. Unmukt has been participating in the USA leagues after his retirement from Indian cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-on-babar-shaheen-getting-dropped-theres-stuff-we-cannot-control-2617068-2024-10-15",
      "headline": "Shan Masood on Babar, Shaheen getting dropped: There's stuff we cannot controlPakistan captain Shan Masood reacted to the wholesale changes in the side for the 2nd Test against England in Multan. Masood said that there were things that the team could not control.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-on-test-series-win-vs-india-only-thing-i-havent-really-ticked-off-2617041-2024-10-15",
      "headline": "Pat Cummins on Test series win vs India: Only thing I haven't really ticked offPat Cummins revealed that winning a Test series against India is close to one of the only thing that hasn't been ticked off his list. He will lead Australia in the upcoming five-match Test series against India, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-to-decide-playing-xi-last-minute-due-to-rain-threat-in-bengaluru-2617039-2024-10-15",
      "headline": "Rohit Sharma to decide playing XI last minute due to rain-threat in BengaluruIndia will decide their playing XI on the morning of the Test match, said Rohit Sharma in the pre-match press conference. Rohit said that depending on the conditions, India will either go with 2 or 3 spinners in their line-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zeland-ben-sears-ruled-out-jacob-duffy-in-gary-stead-bengaluru-2617040-2024-10-15",
      "headline": "IND vs NZ: New Zealand's Ben Sears ruled out of series, Jacob Duffy called inNew Zealand suffered a big blow ahead of the Bengaluru Test as pacer Ben Sears was ruled out of the entire series due to an injury. The Blackcaps have roped in Jacob Duffy as the replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-on-babar-shaheen-getting-dropped-theres-stuff-we-cannot-control-2617068-2024-10-15",
      "headline": "Shan Masood on Babar, Shaheen getting dropped: There's stuff we cannot controlPakistan captain Shan Masood reacted to the wholesale changes in the side for the 2nd Test against England in Multan. Masood said that there were things that the team could not control.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-on-test-series-win-vs-india-only-thing-i-havent-really-ticked-off-2617041-2024-10-15",
      "headline": "Pat Cummins on Test series win vs India: Only thing I haven't really ticked offPat Cummins revealed that winning a Test series against India is close to one of the only thing that hasn't been ticked off his list. He will lead Australia in the upcoming five-match Test series against India, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-to-decide-playing-xi-last-minute-due-to-rain-threat-in-bengaluru-2617039-2024-10-15",
      "headline": "Rohit Sharma to decide playing XI last minute due to rain-threat in BengaluruIndia will decide their playing XI on the morning of the Test match, said Rohit Sharma in the pre-match press conference. Rohit said that depending on the conditions, India will either go with 2 or 3 spinners in their line-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zeland-ben-sears-ruled-out-jacob-duffy-in-gary-stead-bengaluru-2617040-2024-10-15",
      "headline": "IND vs NZ: New Zealand's Ben Sears ruled out of series, Jacob Duffy called inNew Zealand suffered a big blow ahead of the Bengaluru Test as pacer Ben Sears was ruled out of the entire series due to an injury. The Blackcaps have roped in Jacob Duffy as the replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/otd-in-2021-csk-scripted-redemption-to-win-4th-ipl-trophy-beat-kkr-in-final-2617009-2024-10-15",
      "headline": "OTD in 2021: CSK scripted redemption to win 4th IPL trophy, beat KKR in finalChennai Super Kings scripted their redemption by winning their 4th IPL title in Dubai. The MS Dhoni-led side beat Eoin Morgan's KKR in the final by 27 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/was-pakistan-right-in-dropping-babar-azam-from-test-team-sledging-room-s02-ep-57-2617018-2024-10-15",
      "headline": "Babar Azam's stardom punctured? Sledging Room, S02 Ep 57On Sunday, the Pakistan Cricket Board (PCB) dropped a bombshell by leaving out former captain Babar Azam, along with fast bowling stars Shaheen Afridi and Naseem Shah, for the last two Tests against England. Akshay Ramesh, Saurabh Kumar and Kingshuk Kusari discuss the big Pakistan bombshell and India's T20 World Cup show in the latest episode of the Sledging Room.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-happened-the-last-time-india-hosted-new-zealand-in-bengaluru-test-in-2012-2616999-2024-10-15",
      "headline": "What happened the last time India hosted New Zealand in Bengaluru Test in 2012India host New Zealand for the 1st Test match at the M Chinnaswamy Stadium, Bengaluru from October 16, Wednesday. Let us a have a look as to what happened the last time these two teams faced each other at this venue in 2012. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-1st-test-bengaluru-weather-report-chinnaswamy-stadium-2616995-2024-10-15",
      "headline": "IND vs NZ 1st Test, Bengaluru weather report: Will rain play spoilsport?India and New Zealand are all set to renew their rivalry in the Test arena with the first match of the series happening at the iconic Chinnaswamy stadium on October 16. Will the weather in Bengaluru play spoilsport?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}