{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-under-us-tariff-pressure-refiners-hits-pause-on-russian-oil-imports-report-2767781-2025-08-07",
      "headline": "Under US pressure, India hits pause on Russian oil imports: ReportRefiners like Indian Oil Corporation, Bharat Petroleum Corporation and Hindustan Petroleum Corporation have decided not to buy Russian oil on the spot market in the upcoming buying cycle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-in-green-as-d-street-investors-ignore-trumps-50-tariffs-2767779-2025-08-07",
      "headline": "Sensex, Nifty end in green as D-Street investors ignore Trump's 50% tariffsSensex, Nifty end in green as D-Street investors ignore Trump's 50% tariffs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-stp-and-swp-matter-more-than-sip-systematic-investment-plan-explains-stock-market-expert-2767715-2025-08-07",
      "headline": "Why STP and SWP matter more than SIP, explains stock market expertSIPs help you enter the world of investing. But STPs and SWPs help you navigate it wisely, especially when you have a big lump sum to invest or need steady income without eating into your entire savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-us-trade-war-timeline-pm-modi-india-response-ally-dead-economy-2767728-2025-08-07",
      "headline": "From ally to 'dead economy': Timeline of Trump's tariff turn on IndiaTrump signed an executive order imposing an additional 25% tariff on Indian goods, bringing the total to 50% on August 6, putting India among the most heavily tariffed nations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nayara-energy-seeks-ships-from-india-to-ferry-refined-fuels-report-2767717-2025-08-07",
      "headline": "Nayara Energy seeks ships from India to ferry refined fuels: ReportSanctions-hit Nayara is struggling to get vessels for the supply of refined fuels for its retail stations in India. The private refiner has already cut crude runs at its refinery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-to-build-indias-biggest-privately-funded-coal-power-plant-in-a-decade-2767714-2025-08-07",
      "headline": "Adani to build India's biggest privately funded coal power plant in a decadeThe first of three units at the plant will be commissioned within four years, with the last expected to come online in five years' time, Adani Power said.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-hikes-salaries-for-80-percent-staff-amid-layoffs-report-2767655-2025-08-07",
      "headline": "TCS hikes salaries for 80% staff amid layoffs: ReportIn a message sent to employees, the company confirmed that the salary increase will apply to around 80% of the workforce and will take effect from September 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-100-percent-chip-tariff-plan-has-shaken-the-global-semiconductor-industry-2767632-2025-08-07",
      "headline": "How Trump's 100% chip tariff plan has shaken the global semiconductor industrySpeaking from the Oval Office, Trump said the move is aimed at boosting local manufacturing and reducing reliance on foreign-made chips. He added that companies like Apple, which recently committed an extra $100 billion investment in the US, would not be charged the new tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariffs-50-percent-impact-on-india-key-sectors-what-nex-2767626-2025-08-07",
      "headline": "Trump hits India with 50% tariffs: What's at stake and what next?A sweeping 50% tariff could significantly impact India's export economy, threatening jobs and trade ties. As Donald Trump ramps up pressure, all eyes are now on New Delhi's next move.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-impact-india-economy-sectors-hardest-hit-gem-jewellery-auto-labour-textile-seafood-export-2767607-2025-08-07",
      "headline": "From seafood to auto: How will Trump's 50% tariff impact different sectorsThe tariff hike, set to take effect from August 27, follows a warning issued by Trump earlier over India's continued oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/skipped-your-itr-for-years-here-is-how-it-can-impact-you-legally-and-financially-itr-filing-2767583-2025-08-07",
      "headline": "Skipped your ITR for years? Here's how it can impact you legally and financiallyIt might feel harmless to skip filing your Income Tax Return once or twice, but if you've been ignoring it for years, you could be heading for serious trouble. From steep penalties to even jail time, here's what you need to know before it's too late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-opens-for-subscription-should-you-apply-or-skip-2767578-2025-08-07",
      "headline": "JSW Cement IPO opens for subscription. Should you apply or skip?Brokerages are mostly positive about JSW Cement IPO, though some advise caution due to the stretched valuation and inconsistent profitability."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-on-how-fatherhood-changed-his-approach-in-life-wanted-roles-that-pushed-me-2767734-2025-08-07",
      "headline": "Wanted roles that pushed me: Jr NTR on how fatherhood changed his approach in lifeTelugu superstar Jr NTR shared heartfelt insights on his journey through fatherhood and legacy. He emphasised giving his children freedom to choose their paths while preparing for new cinematic challenges ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-warns-ai-dangers-predicts-terminator-style-apocalypse-nuclear-threat-2767678-2025-08-07",
      "headline": "James Cameron warns against AI dangers, predicts Terminator-style apocalypseDirector James Cameron has warned that AI integrated with weapons systems could trigger a Terminator-style apocalypse. He highlighted the urgent risks posed by AI, nuclear arms, and climate change converging simultaneously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-two-part-one-review-colder-creepier-irresistible-jenna-ortega-netflix-series-rating-2767735-2025-08-07",
      "headline": "Wednesday Season Two Part One review: Colder, creepier, irresistibleRelease Date:Wed Aug 13, 2025Wednesday Season Two Part One review: She may have lost her visions, but not her bite. Part One of 'Wednesday' Season Two trades jump scares for emotional depth, family secrets, and a slow-burning mystery that promises chaos ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-tops-ratings-beats-anupamaa-2767720-2025-08-07",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot tops ratings chart, beats AnupamaaKyunki Saas Bhi Kabhi Bahu Thi reboot has returned strongly on Star Plus, leading the TV ratings. The show surpassed Anupamaa, which slipped to the second spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-tanvi-the-great-box-office-competition-saiyaara-ahaan-panday-aneet-padda-2767564-2025-08-07",
      "headline": "Tanvi The Great is still priceless: Anupam Kher on competition with SaiyaaraAfter the release of 'Tanvi: The Great', actor Anupam Kher spoke about his film's box office competition with 'Saiyaara'. He emphasised that commercial success is not the sole measure of a film's worth. The actor said 'Tanvi The Great' didn't mint much money, but it is still priceless. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/confidence-queen-star-park-min-young-on-bollywood-fan-meeting-in-india-interview-eng-sub-2767618-2025-08-07",
      "headline": "Confidence Queen star Park Min-young on Bollywood, fan-meeting in India | Interview [Eng Sub]The lead trio of Confidence Queen- Park Min-young, Park Hee-soon and Joo Jong-hyuk, spoke to India Today's Bhavna Agarwal during a global roundtable chat about bonding behind the scenes, and their surprising wish to someday take on Bollywood. Min-young also promises to visit India for a fan-meet in the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-visits-tiruvannamalai-temple-before-coolie-release-rajinikanth-gets-angry-at-paparazzi-2767710-2025-08-07",
      "headline": "Lokesh Kanagaraj visits Tiruvannamalai temple before Coolie release, snaps at paps'Coolie' director Lokesh Kanagaraj visited Tiruvannamalai temple ahead of the film's release. In one of the viral videos, the filmmaker was seen getting angry at the photographers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-advance-booking-kerala-early-shows-6-am-tamil-nadu-at-9-am-2767706-2025-08-07",
      "headline": "Coolie advance booking: Kerala shows to begin at 6 am, Tamil Nadu shows at 9 amRajinikanth's 'Coolie', directed by Karthik Subbaraj, is all set to release in theatres on August 14. The advance booking has begun in selected theatres with early shows in Kerala at 6 am and 5 am shows in the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-announces-new-film-inspector-zende-with-manoj-bajpayee-jim-sarbh-2767677-2025-08-07",
      "headline": "Netflix announces new film Inspector Zende with Manoj Bajpayee, Jim Sarbh'Inspector Zende', a crime drama inspired by true events, will premiere in September. Starring Manoj Bajpayee and Jim Sarbh, the film celebrates the gritty, instinct-driven detective work of a determined police officer chasing the notorious 'Swimsuit Killer'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/angelina-jolie-reveal-brad-pitt-secrets-memoir-amid-legal-battle-report-2767670-2025-08-07",
      "headline": "Angelina Jolie may reveal Brad Pitt secrets in memoir amid legal battle: ReportActor Angelina Jolie has reportedly warned that she's ready to reveal explosive details about her ex-husband Brad Pitt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-house-help-daughter-found-safe-after-fir-actor-thanks-mumbai-police-2767634-2025-08-07",
      "headline": "Ankita Lokhande's house help's daughter found safe after FIR, actor thanks policeAnkita Lokhande shared that two missing girls, including her house help's daughter, have been found safe after she filed a complaint and sought public help. She thanked the Mumbai Police and Mumbaikars for their swift support and prayers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-release-in-tamil-in-sri-lanka-amid-protests-over-tamil-representation-2767659-2025-08-07",
      "headline": "Kingdom to release in Sri Lanka amid protests over Tamil representationVijay Deverakonda's action drama 'Kingdom' is set to release in Sri Lanka on August 8. This comes amid protests against the film over the misrepresentation of Sri Lankan Tamils."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-padda-saiyaara-success-grateful-nervous-what-lies-ahead-2767588-2025-08-07",
      "headline": "Ahaan and Aneet on Saiyaara success: Grateful, but nervous about what lies aheadActors Ahaan Panday and Aneet Padda thanked fans and shared their apprehensions after the massive success of 'Saiyaara'. In an emotional note, the actors said they fear what's next and if they'd be enough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-says-hes-been-after-anurag-kashyap-for-no-smoking-sequel-2767594-2025-08-07",
      "headline": "Exclusive: John Abraham says he's been after Anurag Kashyap for No Smoking sequelJohn Abraham expressed interest in making a sequel to the cult classic 'No Smoking'. He also praised Anurag Kashyap's disturbing new film 'Bandar', highlighting his love for unique storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shweta-menon-case-acting-obscene-vulgar-films-amma-elections-2767635-2025-08-07",
      "headline": "Case against Malayalam actor Shwetha Menon for allegedly acting in vulgar filmsErnakulam Central Police have registered a case against Malayalam actor Shweta Menon for alleged obscene and vulgar content in films and ads. The case comes as she is contesting for the AMMA president post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/janaabe-aali-teaser-hrithik-roshan-jr-ntr-song-epic-war-on-dance-floor-kiara-advani-2767625-2025-08-07",
      "headline": "Janaabe Aali teaser: Hrithik Roshan, Jr NTR's song is an epic war on dance floorHrithik Roshan and Jr NTR's latest song 'Janaabe Aali' teaser from 'War 2' is out. The video gives a stunning glimpse of the dance face-off between the two actors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mayasabha-the-rise-of-the-titans-review-aadhi-pinisetty-chaitanya-rao-telugu-poltical-thriller-fiery-plays-long-game-2767570-2025-08-07",
      "headline": "Mayasabha review: Friendship, betrayal and power in this gutsy political dramaRelease Date:Thu Aug 07, 2025'Mayasabha: The Rise of the Titans' Review: The Telugu political thriller, streaming on SonyLIV, offers a bold, intense narrative with strong performances, making it a compelling watch for fans of high-stakes drama with a regional flavour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-episode-9-detailed-update-mihir-rejects-misogyny-in-powerful-episode-2767592-2025-08-07",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi Ep 9: Mihir rejects misogyny in powerful episodeWhen a marriage proposal to Pari turns into a test of her freedom, it's Mihir who delivers the final word. A progressive episode of 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot puts gender roles, kitchen politics, and regressive in-laws in their place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-hosts-lunch-for-salman-khan-sisters-alvira-khan-agnihotri-arpita-khan-sharma-2767560-2025-08-07",
      "headline": "Malaika Arora hosts lunch for Salman Khan's sisters Alvira, Arpita. VideoMalaika Arora hosted a special lunch for Salman Khan's sisters, Alvira and Arpita, and their children at her new restaurant in Mumbai. Even after her divorce from Arbaaz Khan, she shares a close and friendly bond with the Khan family."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-colluding-with-bjp-to-steal-elections-rahul-gandhis-fresh-attack-on-poll-rigging-2767724-2025-08-07",
      "headline": "Duplicate voters, fake addresses: Rahul Gandhi claims fraud in Karnataka rollsRahul Gandhi alleged that fake people were being added to voter lists by the ECI in collusion with the BJP and attempted to validate his point by showing the Karnataka electoral rolls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ready-to-pay-heavy-price-shielding-farmers-pm-modi-us-india-trade-deal-agriculture-dairy-deadlock-trump-tariffs-russian-oil-2767558-2025-08-07",
      "headline": "PM Modi's stern message to Trump: We will pay any price to protect our farmersPrime Minister Narendra Modi's remarks were seen as a direct response to US President Donald Trump, who slapped a 50 per cent tariff on India for its continued purchases of Russian oil. Read the full story below and join the conversation: Should India hold its ground as the US ratchets up its tariff war?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-will-visit-india-later-this-month-reports-russias-interfax-news-agency-2767777-2025-08-07",
      "headline": "Putin to visit India later this year, dates being finalised: Ajit Doval in MoscowIn talks with Russian Security Council Secretary Sergei Shoigu, National Security Adviser Ajit Doval confirmed that the visit is on track and said New Delhi is \"excited and delighted\" about the upcoming engagement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-tariffs-on-indian-goods-tharoor-calls-for-reciprocal-duties-and-trade-diversification-2767685-2025-08-07",
      "headline": "Tit for tat: Shashi Tharoor wants India to match Trump's 50% tariff hikeCongress MP Shashi Tharoor criticises US tariff hike on Indian exports citing unfair targeting. He urges Modi government to impose reciprocal duties and explore alternative trade markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-tariff-bomb-india-pm-modi-china-visit-jaishankar-ajit-doval-russia-2767708-2025-08-07",
      "headline": "Will Trump's tariff bombs see India, Russia, China gang-up on US?Trump India tariffs: August is already seeing hectic diplomatic activity as Trump drops tariff bombs on India. NSA Ajit Doval is in Russia, and Jaishankar will head there in a few days. Meanwhile, PM Modi will visit China later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-former-hassan-mp-prajwal-revanna-sentenced-to-life-for-rape-as-hidden-saree-with-dna-evidence-proves-crucial-2767587-2025-08-07",
      "headline": "How a saree hidden in Prajwal Revanna's farmhouse sealed his fate in rape caseA hidden saree helped convict former MP Prajwal Revanna for raping a 47-year-old domestic worker. The forensic evidence on it proved crucial to the case. He was sentenced to life imprisonment and fined Rs 11 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-assembly-vidhan-sabha-phansi-ghar-secret-tunnel-red-fort-kejriwal-rekha-gupta-monsoon-session-historian-explain-2767675-2025-08-07",
      "headline": "Delhi Assembly's mysterious chamber really a phansi ghar?The previous Aam Aadmi Party government in Delhi claimed that two underground chambers and a tunnel beneath the Assembly building were British-era gallows, possibly connected to the Red Fort. The BJP junked AAP's claims that the chamber was a 'phansi ghar' and called out its spend of Rs 1 crore to turn it into an exhibit. This is what historians and archaeologists have to say about the mysterious chamber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-justice-yashwant-varma-plea-challenging-in-house-cash-row-probe-report-2767573-2025-08-07",
      "headline": "Supreme Court rejects Justice Varma's plea in cash row, clears decks for removalJustice Yashwant Varma had challenged the in-house inquiry report that recommended his removal after a large cash stash was found in his residence earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kartavya-bhavan-common-central-secretariat-central-vistas-no-cabin-no-cry-cabin-office-bureaucrats-new-delhi-2767218-2025-08-07",
      "headline": "Open office, closed minds? Why babus feel exposed in Kartavya BhavanPrime Minister Narendra Modi inaugurated the Kartavya Bhavan-3, which will house several ministries of the Central government. However, top Central government officers have written to the PMO over the lack of private cabins in the building. They say the open-seating arrangement compromises confidentiality, affects efficiency and is demoralising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dharavi-revamp-can-gautam-adani-transform-asias-largest-slum-2767186-2025-08-06",
      "headline": "Dharavi revamp: Can Gautam Adani transform Asia's largest slum?How the Adani Group's Rs 2.5 lakh crore redevelopment and rehabilitation plan promises to play out for Dharavi's 1.2 million residents\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-crpf-jawans-killed-many-injured-as-bus-carrying-23-personnel-plunges-into-deep-gorge-in-udhampur-2767606-2025-08-07",
      "headline": "3 CRPF jawans killed, many injured as bus with 23 plunges into gorge in J&KThree CRPF personnel died and 16 were injured after a bunker vehicle overturned in Jammu and Kashmir's Udhampur. The vehicle was carrying 23 jawans. Rescue efforts were launched immediately."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-workload-how-tired-pacers-2767557-2025-08-07",
      "headline": "How tired is Mohammed Siraj?Mohammed Siraj's tireless bowling across formats has made him India's most dependable pacer, but his staggering workload raises red flags about long-term sustainability. Is India over-relying on Siraj at the cost of his fitness?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-us-singled-out-india-over-russia-trade-trumps-8-hour-dodge-fuels-suspense-2767731-2025-08-07",
      "headline": "Why US singled out India over Russia trade? Trump's 8-hour dodge fuels suspenseAfter imposing double tariffs on India for its oil trade with Russia, President Trump was asked why India was being singled out while others, like China, were not. He gave a vague response, hinting at the possibility of more sanctions to come."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-always-on-lifestyle-is-damaging-our-heart-health-cardiac-surgeon-dr-shriram-nene-2767323-2025-08-07",
      "headline": "'Always on' lifestyle is damaging our hearts: Dr Shriram NeneThere's a growing heart disease crisis in India and inactive habits and digital overload are mostly to blame. Renowned cardiac surgeon Dr Shriram Nene warns how young professionals are especially vulnerable to the dangers of the \"always on\" culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-will-break-sachin-tendulkars-record-score-18000-runs-monty-panesar-2767757-2025-08-07",
      "headline": "Joe Root will break Tendulkar's record and score 18000 Test runs: Former spinnerStar England batter Joe Root has been backed by former England spinner Monty Panesar to break Sachin Tendulkar's record for most Test runs and score 18000 runs in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/is-pip-the-new-pink-slip-for-it-companies-experts-on-silent-exit-door-trend-2767673-2025-08-07",
      "headline": "Is PIP the new pink slip for IT companies? Experts on 'silent exit door' trendWhen performance improvement plans (PIP) in organisations become sudden ultimatums after months of silence, they risk being seen as punishment rather than support. But what happens when this perception is already rooted in an organisation's culture? A deeper look reveals why timing, clarity, and intent matter more than policy. Behind closed cabins and templated HR emails, the PIP has quietly changed shape.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/urban-india-most-relatable-crisis-peace-is-a-lie-when-pigeons-bomb-your-balcony-2767639-2025-08-07",
      "headline": "Pigeon vs balcony: Urban India's most relatable crisisBalconies are sacred. And this is something pigeons are not in agreement with. It is a shared space. These gutar-goo drones ensure that the space is bombed by their faecal projectiles, so that you never dare to put anything of value in the balcony. That fake grass carpet? Pigeons love it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-pakistan-military-integration-intelligence-gathering-centaic-pak-air-force-concern-india-explained-2763996-2025-08-07",
      "headline": "China-Pak military integration: What is CENTAIC and should India be concerned?CENTAIC, a China-backed AI and computing centre in Pakistan, aims to transform the Pakistan Air Force (PAF) into a network-centric force integrated with China's military systems. Congress MP Rahul Gandhi mentioned CENTAIC in his Op Sindoor speech. Here's more about CENTAIC and if it should be a concern for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariffs-50-percent-impact-on-india-key-sectors-what-nex-2767626-2025-08-07",
      "headline": "Trump hits India with 50% tariffs: What's at stake and what next?A sweeping 50% tariff could significantly impact India's export economy, threatening jobs and trade ties. As Donald Trump ramps up pressure, all eyes are now on New Delhi's next move.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/lifafas-laddoos-and-love-a-nostalgic-walk-through-rakhi-celebrations-2767559-2025-08-07",
      "headline": "Lifafas, laddoos and love: A nostalgic walk through rakhi celebrationsRakhi is more than just a thread; it's a symbol of memories, traditions, and emotions. This nostalgic piece reflects how we celebrated Raksha Bandhan in the '90s and how it still continues in 2025 in new ways, with the same love.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/a-nation-without-school-teachers-who-will-teach-the-next-generation-2767692-2025-08-07",
      "headline": "A nation without school teachers: Who will teach the next generation?From Delhi to Dubai, Boston to Brisbane, teachers are walking out, and classrooms are paying the price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mayasabha-the-rise-of-the-titans-review-aadhi-pinisetty-chaitanya-rao-telugu-poltical-thriller-fiery-plays-long-game-2767570-2025-08-07",
      "headline": "Mayasabha review: Friendship, betrayal and power in this gutsy political dramaRelease Date:Thu Aug 07, 2025'Mayasabha: The Rise of the Titans' Review: The Telugu political thriller, streaming on SonyLIV, offers a bold, intense narrative with strong performances, making it a compelling watch for fans of high-stakes drama with a regional flavour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/lightning-strikes-deaths-india-climate-change-urbanisation-global-warming-2767651-2025-08-07",
      "headline": "Lightning strikes are getting deadlier in India: Here's whyIt accounts for 35.8% of all weather-related deaths, making it the leading cause of death due to natural forces in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rani-mukerji-national-award-win-mrs-chatterjee-vs-norway-director-exclusive-interview-2767690-2025-08-07",
      "headline": "Rani Mukerji's award win was always destined, says director Ashima ChibberRani Mukerji won the Best Actress at the 71st National Awards for 'Mrs Chatterjee vs Norway'. The film's director, Ashima Chibber, reveals her confidence in Rani's performance and the film's international acclaim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-recalls-wear-tight-clothes-during-early-pregnancy-days-2767784-2025-08-07",
      "headline": "Radhika Apte recalls lack of empathy in Bollywood during early pregnancy daysActor Radhika Apte recalled early pregnancy days when she was asked to wear tight clothes by a producer despite her discomfort. She also opened up about her emotional and physical challenges in the entertainment industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-on-how-fatherhood-changed-his-approach-in-life-wanted-roles-that-pushed-me-2767734-2025-08-07",
      "headline": "Wanted roles that pushed me: Jr NTR on how fatherhood changed his approach in lifeTelugu superstar Jr NTR shared heartfelt insights on his journey through fatherhood and legacy. He emphasised giving his children freedom to choose their paths while preparing for new cinematic challenges ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-cameron-warns-ai-dangers-predicts-terminator-style-apocalypse-nuclear-threat-2767678-2025-08-07",
      "headline": "James Cameron warns against AI dangers, predicts Terminator-style apocalypseDirector James Cameron has warned that AI integrated with weapons systems could trigger a Terminator-style apocalypse. He highlighted the urgent risks posed by AI, nuclear arms, and climate change converging simultaneously."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-will-break-sachin-tendulkars-record-score-18000-runs-monty-panesar-2767757-2025-08-07",
      "headline": "Joe Root will break Tendulkar's record and score 18000 Test runs: Former spinnerStar England batter Joe Root has been backed by former England spinner Monty Panesar to break Sachin Tendulkar's record for most Test runs and score 18000 runs in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-did-kuldeep-yadav-not-play-in-england-gautam-gambhir-2767747-2025-08-07",
      "headline": "When Gautam Gambhir explained Kuldeep Yadav's omission in England Test seriesSpecialist spinner Kuldeep Yadav did not play a single Test match in England. Former cricketer Deep Dasgupta revealed that Gautam Gambhir and the Indian team management explained to him why they were not able to find a spot for him in the playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-praises-virat-kohli-singing-dancing-skills-leadership-bond-2767722-2025-08-07",
      "headline": "MS Dhoni talks 'ultimate package' Virat Kohli: Sings well, good dancerLegendary MS Dhoni has opened up on a very different side of Virat Kohli. Dhoni says that off the field, Kohli is a proper entertainer, a full package, who can dance and sing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-chris-woakes-injury-replacement-ben-stokes-2767707-2025-08-07",
      "headline": "Chris Woakes sides Ben Stokes on injury replacements: You have to find a wayEngland seamer Chris Woakes came out to bat on Day 5 of the final Test, despite having a dislocated shoulder. Asked if there should be injury replacements for freak accidents, Woakes did not seem to be keen about the idea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/son-heung-min-lafc-transfer-president-call-tottenham-hotspur-exit-2767702-2025-08-07",
      "headline": "Son ready for new chapter with LAFC after Spurs exit: Still got qualitySon Heung-min has begun a new chapter in his career, swapping Premier League prestige for an ambitious MLS stint with LAFC, aiming to bring titles and global spotlight to the American soccer landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-james-anderson-mixed-debut-dale-steyn-fans-reaction-2767681-2025-08-07",
      "headline": "James Anderson's ordinary debut in The Hundred sparks mixed reactionsJames Anderson became the second-oldest player to feature in The Hundred at 43. He gave away 36 runs in 20 balls in his maiden outing for Manchester Originals in their defeat to Southern Brave. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shabbir-ahmed-alleged-india-used-vaseline-eng-vs-ind-oval-test-2767684-2025-08-07",
      "headline": "India used Vaseline for ball tampering during Oval Test, says ex-Pakistan pacerENG vs IND: Former Pakistan pacer Shabbir Ahmed has alleged India of using 'Vaseline' to tamper with the ball during the Oval Test against England. India bowled out England's final four wickets on the last day with the old ball to draw the five-match series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-stopped-yashasvi-jaiswals-shift-from-mumbai-to-goa-2767663-2025-08-07",
      "headline": "How Rohit Sharma intervened to stop Yashasvi Jaiswal from quitting MumbaiIndia's ODI captain Rohit Sharma urged Yashasvi Jaiswal to continue playing for Mumbai in domestic cricket and stop his move to Goa, revealed Mumbai Cricket Association (MCA) President Ajinkya Naik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-aakash-chopra-excludes-washington-sundar-2767638-2025-08-07",
      "headline": "ENG vs IND: Washington Sundar snubbed from Aakash Chopra's combined XIWashington Sundar could not find a place in the combined XI picked by Aakash Chopra from the recent five-match Test series between England and India. Sundar scored 284 runs in 4 matches at an average of 47.33 and also scalped seven wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-chris-woakes-injury-rishabh-pant-message-oval-test-2767610-2025-08-07",
      "headline": "Pant's voice note, Gill's message: When Oval Test warrior Woakes felt India's loveIndia vs England: Chris Woakes bravely batted with a dislocated shoulder on the dramatic final day of the Oval Test against India. His courage earned respect from Indian players and fans despite England's narrow loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-james-anderson-mixed-debut-dale-steyn-fans-reaction-2767681-2025-08-07",
      "headline": "James Anderson's ordinary debut in The Hundred sparks mixed reactionsJames Anderson became the second-oldest player to feature in The Hundred at 43. He gave away 36 runs in 20 balls in his maiden outing for Manchester Originals in their defeat to Southern Brave. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shabbir-ahmed-alleged-india-used-vaseline-eng-vs-ind-oval-test-2767684-2025-08-07",
      "headline": "India used Vaseline for ball tampering during Oval Test, says ex-Pakistan pacerENG vs IND: Former Pakistan pacer Shabbir Ahmed has alleged India of using 'Vaseline' to tamper with the ball during the Oval Test against England. India bowled out England's final four wickets on the last day with the old ball to draw the five-match series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-stopped-yashasvi-jaiswals-shift-from-mumbai-to-goa-2767663-2025-08-07",
      "headline": "How Rohit Sharma intervened to stop Yashasvi Jaiswal from quitting MumbaiIndia's ODI captain Rohit Sharma urged Yashasvi Jaiswal to continue playing for Mumbai in domestic cricket and stop his move to Goa, revealed Mumbai Cricket Association (MCA) President Ajinkya Naik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-aakash-chopra-excludes-washington-sundar-2767638-2025-08-07",
      "headline": "ENG vs IND: Washington Sundar snubbed from Aakash Chopra's combined XIWashington Sundar could not find a place in the combined XI picked by Aakash Chopra from the recent five-match Test series between England and India. Sundar scored 284 runs in 4 matches at an average of 47.33 and also scalped seven wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-chris-woakes-injury-rishabh-pant-message-oval-test-2767610-2025-08-07",
      "headline": "Pant's voice note, Gill's message: When Oval Test warrior Woakes felt India's loveIndia vs England: Chris Woakes bravely batted with a dislocated shoulder on the dramatic final day of the Oval Test against India. His courage earned respect from Indian players and fans despite England's narrow loss."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}