{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-transfers-rs-583-crore-to-haryana-following-fraud-incident-2873557-2026-02-24",
      "headline": "IDFC First Bank transfers Rs 583 crore to Haryana following fraud incidentAccording to a stock market filing, IDFC bank has paid out 100% of the principal and interest to the relevant departments of Haryana Government as claimed, which works out to a net amount of INR 583 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taken-a-home-loan-heres-what-happens-if-you-miss-3-emis-2873540-2026-02-24",
      "headline": "Taken a home loan? Here's what happens if you miss 3 EMIsA home loan EMI is a long-term responsibility that borrowers usually plan for carefully. But income disruptions or unexpected expenses can affect repayments. If EMIs are missed repeatedly, how do lenders react, and how serious can it become? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1068-points-lower-nifty-below-25500-hcltech-down-it-shares-tank-2873525-2026-02-24",
      "headline": "Sensex ends 1,068 points lower, Nifty below 25,500; HCLTech down 6%The S&P BSE Sensex lost 1,068.74 points to close at 82,225.92, while the NSE Nifty50 was down by 288.35 points to end at 25,424.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-indias-ultra-rich-are-buying-rs-10-crore-homes-in-gurugram-over-mumbai-2025-2873514-2026-02-24",
      "headline": "Why are India's ultra-rich preferring Gurugram over Mumbai for their homesMumbai recorded ultra-luxury home sales worth Rs 24,120 crore during the calendar year. This is the highest ever value achieved by any Indian city in this segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paying-rent-to-parents-or-spouse-to-save-tax-new-rules-mean-think-twice-hra-claim-2873443-2026-02-24",
      "headline": "Paying rent to parents or spouse to save tax? New rules tighten HRA claimsClaiming HRA by paying rent to family members has been a common tax-saving method. Yet, changes expected from April 2026 could make these claims more closely examined than before.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/redevelopment-future-urban-real-estate-india-investment-risks-opportunities-2873447-2026-02-24",
      "headline": "Is redevelopment a safe bet for real estate investors?Redevelopment today is not just about replacing old buildings. It is about creating larger, more valuable assets that align with how people live and work now, closer to transport, offices, and social infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-fraud-rs-590-crore-fraud-what-went-wrong-how-bad-is-the-financial-damage-2873442-2026-02-24",
      "headline": "IDFC First Bank's Rs 590-crore fraud: What went wrong and how bad is the damage?A fraud this size should never have slipped past routine controls. This article attempts to explain just how sharply the Rs 590-crore fraud impacts IDFC First Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/using-groww-zerodha-or-other-trading-platforms-heres-why-dp-charges-matter-nithin-kamath-2873402-2026-02-24",
      "headline": "Using Groww, Zerodha or other trading platforms? Here's why DP charges matterMany investors focus on brokerage fees but often miss another cost, i.e., DP charges. Whether you trade on Groww, Zerodha, or similar platforms, knowing these fees can help you avoid surprises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/it-stocks-under-pressure-infosys-tcs-hcltech-ai-disruption-tariff-uncertainty-explained-2873333-2026-02-24",
      "headline": "Infosys, HCLTech, Tech Mahindra sink up to 7%: Why are IT stocks falling today?A sharp slide in India's biggest tech stocks has once again put the spotlight on global uncertainty and the growing fear that artificial intelligence is reshaping the industry faster than expected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-500-points-nifty-tank-market-crash-it-shares-ai-disruption-tariff-2873319-2026-02-24",
      "headline": "Sensex plunges 1,000 points: Why is the stock market falling today?By the closing bell, the BSE Sensex had dropped 1,068.74 points to 82,225.92, while the NSE Nifty50 settled at 25,424.65, down 288.35 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-tanks-over-450-points-nifty-below-25600-infosys-down-it-stocks-crash-2873316-2026-02-24",
      "headline": "Sensex, Nifty tank in early trade as IT stocks bleed; Infosys down 3%The S&P BSE Sensex was down by 722.19 points to 82,572.47, while the NSE Nifty50 plummeted 203.60 points to 25,509.40 as of 10:04 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-sues-us-government-seeks-refund-trump-emergency-tariffs-supreme-court-ruling-2873313-2026-02-24",
      "headline": "FedEx seeks refund, sues US over Trump's emergency tariff order: ReportFedEx said that it has filed a lawsuit in the US Court of International Trade seeking a refund of tariffs imposed under Trump's emergency powers. The case follows a recent ruling by the US Supreme Court, which found that the tariffs were unlawful. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paramount-raises-offer-for-warner-bros-discovery-amid-netflix-bid-war-reuters-report-2873299-2026-02-24",
      "headline": "Paramount raises offer for Warner Bros Discovery amid Netflix threat: ReportThe fresh bid marks another twist in what has become one of the biggest deal battles in the global media industry. Warner Bros Discovery owns some of Hollywood's most recognised titles, including the Harry Potter and Game of Thrones franchises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finance-minister-mis-selling-is-an-offence-rbi-insurance-guidelines-warns-banks-2873250-2026-02-24",
      "headline": "Banks can't afford to mis-sell, it is an offence: Nirmala SitharamanFinance Minister Nirmala Sitharaman said banks cannot treat mis-selling as routine business and called it an offence. Her remarks come as the Reserve Bank of India is preparing to issue guidance aimed at curbing mis-selling practices by banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-says-rs-590-crore-fraud-due-to-staff-collusion-2873108-2026-02-23",
      "headline": "IDFC First Bank says Rs 590 crore fraud due to staff collusionThe issue first came to light when a Haryana government department asked the bank to close its account and transfer funds. During this process, the bank noticed a mismatch between its records and the department's figures. This led to a wider internal review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-refund-rs-1000-or-less-in-inactive-accounts-who-is-eligible-2873071-2026-02-23",
      "headline": "EPFO to refund Rs 1,000 or less in inactive accounts: Who is eligible?At present, there are around 31 lakh inoperative EPFO accounts. Out of these, nearly six lakh accounts have Rs 1,000 or less deposited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-ai-impact-your-appraisals-this-year-heres-how-much-you-can-expect-2873033-2026-02-23",
      "headline": "Will AI impact your appraisals this year? Here's how much you can expectArtificial intelligence is playing a growing role in shaping compensation models. Around 50 to 60% of large organisations now use data analytics when planning salaries and bonuses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-after-strong-rally-but-it-stocks-limit-gains-2872953-2026-02-23",
      "headline": "Sensex, Nifty end after strong rally, but IT stocks limit gainsThe S&P BSE Sensex gained 479.95 points to end at 83,290.81, while the NSE Nifty50 added 141.75 points to close at 25,713.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-hra-for-rent-to-family-what-draft-tax-rules-may-change-2872936-2026-02-23",
      "headline": "Claiming HRA for rent to family? What draft tax rules may changeMany salaried employees claim HRA for rent paid to family members. While the practice remains allowed, proposed tax rules may bring an extra layer of scrutiny. Here's what could change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/rising-gold-silver-prices-india-should-you-worry-fm-nirmala-sitharaman-rbi-governor-response-2872913-2026-02-23",
      "headline": "Should India be concerned about the rise in gold and silver prices?The Finance Minister said gold has always been a favoured investment for Indian households. Demand often rises during festival seasons such as Akshaya Tritiya and other auspicious occasions. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-reacts-to-dhurandhar-2-toxic-clash-says-its-a-win-win-situation-2873587-2026-02-24",
      "headline": "Huma Qureshi reacts to Dhurandhar 2-Toxic clash, says it's a win-win situation Huma Qureshi has reacted to the box office clash between Dhurandhar 2 and Toxic, calling it a \"win-win\" for the Indian film industry. The actor believes the Eid release will be a fantastic time for moviegoers, with space for both films to succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-clears-air-on-ram-charan-attending-cocktail-party-in-ayyappa-deeksha-2873543-2026-02-24",
      "headline": "Allu Sirish clears air on Ram Charan attending cocktail party in Ayyappa deeksha Allu Sirish has responded to the online debate over Ram Charan's brief appearance at his pre-wedding cocktail party. He clarified that Charan arrived before any alcohol was served while observing Ayyappa deeksha. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/i-keep-asking-if-hes-really-gone-hema-malini-reacts-to-baftas-dharmendra-tribute-2873555-2026-02-24",
      "headline": "I keep asking if he's really gone: Hema Malini reacts to BAFTA's Dharmendra tribute Hema Malini called Dharmendra's BAFTA recognition \"heartening\" in an interview. The 79th BAFTA ceremony highlighted India's achievements, with Boong winning Best Children's and Family Film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-praises-anil-kapoor-subedaar-trailer-chachu-is-back-2873552-2026-02-24",
      "headline": "Janhvi Kapoor praises Anil Kapoor's Subedaar trailer: Chachu is back Janhvi Kapoor cheered for uncle Anil Kapoor as the trailer of Subedaar was released, praising his powerful performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-exclusive-guest-arrivals-udaipur-wedding-tharun-bhascker-eesha-rebba-2873533-2026-02-24",
      "headline": "Rashmika-Vijay wedding: Tharun Bhascker, Eesha Rebba and celebs arrive in Udaipur Director Tharun Bhascker, actor Eesha Rebba and stylist Shravya Varma were among the first guests to arrive in Udaipur ahead of actors Rashmika Mandanna and Vijay Deverakonda's wedding. Their wedding will take place on February 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shalini-pandey-on-working-with-zahan-kapoor-in-bandwaale-he-is-a-very-sweet-guy-2873507-2026-02-24",
      "headline": "Shalini Pandey on working with Zahan Kapoor in Bandwaale: He is a very sweet guy Shalini Pandey expressed her delight at collaborating with Zahan Kapoor on Bandwaale. The actor said their instant rapport helped create a natural and effortless chemistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-confirms-april-release-of-bhooth-bangla-with-eerie-throne-poster-2873524-2026-02-24",
      "headline": "Akshay Kumar confirms April release of Bhooth Bangla with eerie throne poster Akshay Kumar's new motion poster for Bhooth Bangla heightens anticipation. The actor confirmed the April release for Priyadarshan's horror-comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-intimate-family-games-before-mehendi-udaipur-wedding-2873500-2026-02-24",
      "headline": "Rashmika-Vijay wedding update: Fun family games at venue before mehndi ceremony Rashmika Mandanna and Vijay Deverakonda's wedding celebrations have started in Udaipur and the mehndi ceremony was preceded by fun family games. They will get married on February 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varanasi-release-date-ai-mahesh-babu-fight-clip-cinema-debate-2873488-2026-02-24",
      "headline": "AI fight video of Mahesh Babu and Rajamouli draws RGV's reaction: Death of cinema Fan-made AI visuals have been gaining popularity ever since the makers of Varanasi confirmed the film's release date. Filmmaker Ramgopal Varma has reacted to one such video featuring Varanasi actor Mahesh Babu and director Rajamouli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-itc-mementos-udaipur-february-26-2873465-2026-02-24",
      "headline": "Rashmika-Vijay's wedding venue: All you need to know about plush hillside resort Rashmika Mandanna and Vijay Deverakonda will marry on February 26, and approximately 100 guests are expected to attend. Here's all you need to know about the wedding venue, ITC Mementos Udaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-reunion-anirudh-breaking-bad-tribute-tamil-cinema-2873428-2026-02-24",
      "headline": "Bablu, Chintu, Sonu-Monu: Mystery credits of Anirudh's Aaja Raja in KH X RK reunion Rajinikanth and Kamal Haasan reunite on the Tamil screen after nearly five decades in Nelson's upcoming film tentatively being called KH X RK reunion. The promo has Anirudh Ravichander's playful Breaking Bad references, besides mystery credits for singers and lyricist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-sanjay-leela-bhansali-turned-film-music-into-his-signature-strength-ram-leela-gangubai-kathiadwadi-2873462-2026-02-24",
      "headline": "How Sanjay Leela Bhansali turned film music into his signature strength On Sanjay Leela Bhansali's birthday, we take a closer look at how the celebrated filmmaker has quietly emerged as one of Hindi cinema's most distinctive music composers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannot-be-loose-tongued-like-this-karnataka-high-court-raps-actor-ranveer-singh-over-kantara-mimicry-row-2873472-2026-02-24",
      "headline": "You are reckless: Karnataka High Court raps Ranveer Singh over Kantara mimicry row The Karnataka High Court rapped actor Ranveer Singh over the Kantara mimicry row during a hearing on Tuesday, while also granting him interim relief. The matter is scheduled to be heard next on March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandanna-vijay-deverakonda-stayed-silent-until-wedding-why-celebs-now-announce-love-at-mandap-2873366-2026-02-24",
      "headline": "Rashmika-Vijay stayed silent until wedding: Why celebs now announce love at mandap? Why did Rashmika Mandanna and Vijay Deverakonda confirm their relationship only days before their wedding? From fear of public fallout to brand value and performance pressure, experts decode why celebrity couples today are choosing silence over buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lizzie-mcguire-star-robert-carradine-dies-at-71-family-issues-statement-2873436-2026-02-24",
      "headline": "Lizzie McGuire star Robert Carradine dies at 71; family issues statement Robert Carradine, known for Revenge of the Nerds and Lizzie McGuire, died at 71. His family shared a statement to raise awareness about mental health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bluff-review-priyanka-chopra-powers-a-pirate-drama-that-rarely-sets-sail-2873437-2026-02-24",
      "headline": "The Bluff review: Priyanka Chopra powers a pirate drama that rarely sets sailRelease Date:Wed Feb 25, 2026 The Bluff places Priyanka Chopra at the centre of a gritty 19th-century Caribbean revenge tale, mixing high-stakes action with raw emotion. While the film looks ambitious and benefits from a commanding lead performance, uneven writing holds it back from truly packing a punch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-director-siva-reunite-for-new-tamil-film-after-racing-stint-2873247-2026-02-24",
      "headline": "Kanguva director Siva confirms fifth collaboration with Ajith Kumar Ajith Kumar recently competed in the Asian Le Mans Series while plans for his next film with director Siva are underway. The collaboration could mark an important comeback for the director after his last film's performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-bloody-romeo-animated-promo-chef-gangster-pan-indian-action-2873419-2026-02-24",
      "headline": "Little bit of action, fun, madness, love: Nani announces Sujeeth's film with promo Director Sujeeth officially announced Bloody Romeo on Nani's 41st birthday with an animated promo. The film promises a fresh take on action and dark humour featuring Nani as a chef-gangster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-to-perform-icc-anthem-at-india-vs-zimbabwe-match-in-chennai-2873399-2026-02-24",
      "headline": "Anirudh Ravichander to perform ICC anthem at India vs Zimbabwe match in Chennai Singer Anirudh Ravichander will deliver a live performance of the energetic official ICC event song Feel the Thrill at Chepauk on February 26. India will clash with Zimbabwe for their next T20 match."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lucknow-murder-case-son-killed-father-in-blue-drum-murder-to-take-over-pathology-labs-alcohol-business-2873508-2026-02-24",
      "headline": "Lucknow blue drum murder: Man eyed father's path lab, liquor businessesThe father, a successful businessman with labs and liquor shops, wanted his son to be a doctor, but the son aimed to take over the family business, leading to tragedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/union-cabinet-approves-proposal-renaming-kerala-to-keralam-2873528-2026-02-24",
      "headline": "Kerala will now be called KeralamThe Kerala Assembly unanimously adopted the resolution for the second time in June 2024, urging the renaming of the state to Keralam, after the central government reviewed the earlier one and suggested some technical changes for better clarity and compliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-aircraft-carrier-gerald-ford-clogged-toilets-sewage-system-iran-war-threat-2873526-2026-02-24",
      "headline": "Toilet war on US warship amid Iran tensions raises a stinkThe US may be planning a strike on Iran, but aboard its largest aircraft carrier, the USS Gerald R Ford, the crew are preoccupied with a more pressing issue -- finding a working toilet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/racial-slurs-assault-nagaland-doctor-aiims-gorakhpur-outrage-calls-action-conrad-action-2873529-2026-02-24",
      "headline": "Stalked, harassed, racially abused: Nagaland doctor at AIIMS Gorakhpur targetedThe incident occurred around 8 pm on February 22 as the female resident doctor was returning to campus and walking towards Gate No. 2 near the Army camp. Police have registered a case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iit-bombay-bullets-recovered-he-posed-as-resident-lived-in-hostel-for-months-security-breach-fake-identity-2873429-2026-02-24",
      "headline": "How struggling actor posed as IIT Bombay student, lived in hostel for monthsA struggling actor stayed in one of IIT Bombay's hostels for four months without anyone getting a whiff that he wasn't a student. The account of the person, who spoke exclusively to India Today Digital, reveals gaps in the security at one of India's premier institutes, where five live bullets were recovered from a BTech student's bag last week. He was accommodating a visitor illegally in his room."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/caught-on-cctv-man-shot-dead-outside-home-broad-daylight-greater-noida-video-2873471-2026-02-24",
      "headline": "Murder in Greater Noida alley, gunmen open fire on man as woman, children screamTwo suspects have been taken into custody for questioning, police said, adding that heavy police deployment has been made in the village to maintain law and order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/did-donald-trump-threaten-india-higher-tariffs-trade-deal-2873430-2026-02-24",
      "headline": "Is Trump's 'higher tariff' threat directed at India?With the US Supreme Court striking down his global tariffs, a bruised Trump has warned countries against 'playing games' by trying to back away from trade commitments. The post came hours after India postponed its trade delegation's visit. Was Trump's rant directed at India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-bharat-taxi-nembharat-to-launch-in-india-challenge-uber-and-ola-with-zero-driver-commissions-2873581-2026-02-24",
      "headline": "After Bharat Taxi, Nembharat to launch in India, challenge Uber and OlaNembharat, a new ride-booking platform, is set to launch soon. WEML, which is the behind the service, is promising a commission-free model for cab drivers and aims to eliminate surge pricing for riders during peak hours. More details are awaited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/fact-check/story/more-brutal-than-rehman-dakait-infamous-torture-techniques-of-mexican-drug-lords-2873482-2026-02-24",
      "headline": "More brutal than Rehman Dakait: Infamous torture techniques of Mexican drug lordsRead at your own risk: this story isn't for the weak of stomach. It has graphic details of extreme violence.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-down-500-points-nifty-tank-market-crash-it-shares-ai-disruption-tariff-2873319-2026-02-24",
      "headline": "Sensex plunges 1,000 points: Why is the stock market falling today?By the closing bell, the BSE Sensex had dropped 1,068.74 points to 82,225.92, while the NSE Nifty50 settled at 25,424.65, down 288.35 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsnl-director-prayagraj-visit-cancelled-vip-protocol-sangam-bath-goes-viral-2873357-2026-02-24",
      "headline": "50 staff, bath kits: BSNL official's Prayagraj visit in limelight over trip planThe visit was cancelled shortly after the internal document outlining elaborate arrangements for the visit went viral, drawing sharp reactions over what many users described as excessive VIP treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-reports-one-third-of-global-cervical-cancer-cases-why-hpv-vaccination-offers-hope-2873519-2026-02-24",
      "headline": "India reports one-third of global cervical cancer cases: Why HPV vaccination offers hope India set to soon launch a nationwide HPV vaccination programme to prevent cervical cancerThe roll-out of HPV vaccination is aimed at bringing down cervical cancer cases and mortalities over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/punch-the-monkeys-story-isnt-unusual-in-nature-then-why-does-it-feel-so-personal-2873450-2026-02-24",
      "headline": "Punch the monkey's story isn't unusual, then why does it feel so personal?Punch, the baby monkey at Japan's Ichikawa Zoo, has tugged at many heartstrings, but his story also reveals something deeper about human emotion and connection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/water-harvesting-machine-omar-yaghi-atoco-reticular-chemistry-narendra-modi-nobel-laureate-2025-chemistry-2872616-2026-02-24",
      "headline": "Making water from air: Nobel laureate makes PM Modi's vision a realityProf Omar Yaghi, who won the 2025 Nobel Prize in Chemistry, has developed a technology to extract 1,000 litres of water daily from dry air. This breakthrough aligns with PM Modi's 2020 suggestion of harvesting water from moisture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/youth-congress-chief-uday-bhanu-chib-arrested-over-shirtless-protest-at-ai-summit-to-be-produced-before-court-2873326-2026-02-24",
      "headline": "Youth Congress chief arrested for masterminding shirtless AI Summit protest: CopsSources said the Youth Congress chief, Uday Bhanu Chib, was arrested after being grilled for nearly 20 hours. He faces charges of criminal conspiracy, voluntarily causing harm to a public servant, obstructing a public servant on duty, and wilful disobedience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-fraud-rs-590-crore-fraud-what-went-wrong-how-bad-is-the-financial-damage-2873442-2026-02-24",
      "headline": "IDFC First Bank's Rs 590-crore fraud: What went wrong and how bad is the damage?A fraud this size should never have slipped past routine controls. This article attempts to explain just how sharply the Rs 590-crore fraud impacts IDFC First Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/i-keep-asking-if-hes-really-gone-hema-malini-reacts-to-baftas-dharmendra-tribute-2873555-2026-02-24",
      "headline": "I keep asking if he's really gone: Hema Malini reacts to BAFTA's Dharmendra tributeHema Malini called Dharmendra's BAFTA recognition \"heartening\" in an interview. The 79th BAFTA ceremony highlighted India's achievements, with Boong winning Best Children's and Family Film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-orders-food-to-office-stops-delivery-boy-to-make-a-weird-request-2873558-2026-02-24",
      "headline": "Woman orders food to office, stops delivery boy to make a weird requestA woman ordered food delivery to her office, and then proceeded to ask the delivery boy for an unexpected favour that triggered discussions on unfair exploitation in India's gig economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-air-ambulance-victims-family-took-rs-8-lakh-loan-to-save-him-2873331-2026-02-24",
      "headline": "Jharkhand couple killed in air ambulance crash had taken Rs 8 lakh loan for planeIn a desperate attempt to save the life of 41-year-old Sanjay, the family took a loan of 8 lakh from friends and relatives. Sanjay, along with 6 others, died in the air ambulance crash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/airfares-shoot-up-185-percent-holi-festival-travel-rush-delhi-kolkata-patna-gorakhpur-bengaluru-rs-20000-2873434-2026-02-24",
      "headline": "Airfares shoot up by 185% for Holi travel; a seat costs up to Rs 20,000With Holi around the corner, airfares on key domestic routes have surged as demand for tickets peaked. On routes from New Delhi and Bengaluru to Gorakhpur and Patna, ticket prices have surged by up to 185%. In some sectors, one-way fares are nearing Rs 20,000 on the weekend before Holi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/intense-lightning-seen-from-space-as-blizzard-buries-us-under-thick-snow-2873534-2026-02-24",
      "headline": "Intense lightning seen from space as historic blizzard hits the USMeteorologists say the storm underwent rapid intensification, meaning its central pressure dropped quickly in a short period of time, a sign of strengthening.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-villa-gang-rape-case-accuses-extortion-woman-sexual-assault-police-valentines-day-party-2872995-2026-02-23",
      "headline": "She wanted sugar daddy: Bengaluru gang-rape accused alleges extortionPolice are investigating conflicting claims in the Bengaluru villa case, where an accused has alleged an extortion attempt, while the woman has accused two men of gang-raping her during a Valentine's Day party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-namo-bharat-delhi-meerut-rrts-metro-share-tracks-launch-alwar-panipat-karnal-neemrana-2873080-2026-02-24",
      "headline": "How India rolled out high-speed rail, metro using common tracksPM Narendra Modi inaugurated both, India's first full RRTS corridor connecting New Delhi and Meerut, and a metro system for the city in western Uttar Pradesh. The shared-track model, with both the services using the same infrastructure, will deliver high-speed regional travel and a seamless urban commute."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/anthropic-says-claude-can-understand-cobol-ibm-stock-suffers-worst-fall-in-25-years-2873406-2026-02-24",
      "headline": "Anthropic says Claude can understand COBOL, IBM stock suffers worst fall in 25 yearsIBM shares saw their sharpest fall in over 25 years after AI startup Anthropic said its Claude Code tool can understand and modernise COBOL, a language deeply tied to IBM's mainframe business. Here is everything that you need to know."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-beat-india-six-wickets-first-odi-alyssa-healy-shines-2873575-2026-02-24",
      "headline": "India Women falter in world champion era, suffer 6-wicket defeat to Australia INDW vs AUSW, 1st ODI: Harmanpreet Kaur's India slumped to a six-wicket defeat to Alyssa Healy's Australia on Tuesday at the Allan Border Field in Brisbane. Beth Mooney, who completed 3000 ODI runs, won the Player of the Match award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/squash-cci-brabourne-stadium-to-host-the-indian-open-2026-from-march-18-to-22-2873538-2026-02-24",
      "headline": "Squash: CCI Brabourne Stadium to host the Indian Open 2026 from March 18 to 22 The historic CCI Brabourne Stadium will host the second edition of the Indian Open, a PSA Copper event, from March 18 to 22, 2026, with tickets for the tournament now live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-aus-w-1st-odi-harmanpreet-kaur-injury-blow-smriti-mandhana-brisbane-2873517-2026-02-24",
      "headline": "India suffer injury blow as Harmanpreet Kaur does not come out to field in Brisbane IND-W vs AUS-W, 1st ODI: Harmanpreet Kaur suffered a left knee injury during the first ODI in Brisbane and did not field in the second innings, with Smriti Mandhana stepping in to lead India against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-t20-world-cup-schedule-india-pakistan-clash-confirmed-lords-final-2873515-2026-02-24",
      "headline": "India vs Pakistan clash confirmed as ICC unveils Women's T20 World Cup schedule Bangladesh will be slotted alongside India and Pakistan in an explosive Group 1 after the International Cricket Council on Tuesday announced the complete list of fixtures for the upcoming Women's T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-politics-ahmed-shehzad-india-t20-world-cup-2873502-2026-02-24",
      "headline": "Gautam Gambhir's politics has damaged Indian team's image: Ex-PAK batter T20 World Cup: Former Pakistan batter Ahmed Shehzad has slammed India coach Gautam Gambhir and claimed that he has brought politics into the Indian team environment. Gambhir is facing mounting pressure after India's loss to South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-bucknor-admits-mistake-sachin-tendulkar-2004-lbw-decision-ind-aus-test-2873473-2026-02-24",
      "headline": "Steve Bucknor regrets giving Sachin Tendulkar out lbw in 2004 Gabba Test Legendary West Indies umpire Steve Bucknor has admitted that giving Sachin Tendulkar out LBW in the 2003-04 Gabba Test was a mistake. Bucknor, now 79, was one of the most respected match officials of his time, having officiated in over 120 Tests and served on the umpiring panel at multiple World Cups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-shai-hope-wi-vs-zim-india-south-africa-2873469-2026-02-24",
      "headline": "Focus only on playing good cricket: Hope backs West Indies before SA, IND ties T20 World Cup: After their thrilling win against Zimbabwe, Shai Hope has backed the West Indies in the upcoming matches against South Africa and India in the T20 World Cup. Hope also refused to reveal the spin plans against India and how the focus is on getting wins for the team and not records. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-shot-selection-criticism-t20-world-cup-2026-super-8-2873335-2026-02-24",
      "headline": "Play like Virat Kohli: Tilak Varma gets advice from EX-IND batter amid poor form Former India cricketer Mohammed Kaif has urged Tilak Varma to shut out the noise and stick to his original gameplan of being an anchor in the T20I side. Tilak has struggled for runs during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/benjamin-sesko-reaction-manchester-united-beat-everton-premier-league-2873423-2026-02-24",
      "headline": "Super Sub Sesko ready to deliver for Manchester United whenever Carrick calls Benjamin Sesko insists he is unfazed by his role under Michael Carrick and is ready to make an impact for Manchester United whenever called upon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/zimbabwe-needs-to-focus-on-getting-small-wins-ahead-of-india-clash-justin-sammons-2873427-2026-02-24",
      "headline": "Zimbabwe needs to focus on getting small wins ahead of India clash: Justin Sammons T20 World Cup: Zimbabwe's head coach Justin Sammons talked about how the side needs to focus on winning those small battles rather than getting overwhelmed by the bigger picture. They now face India in the Super 8s, where it is a do-or-die clash for both teams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-super-8s-zimbabwe-learn-west-indies-defeat-fearless-india-chennai-2873411-2026-02-24",
      "headline": "T20 World Cup: Zimbabwe aim to learn from West Indies loss to counter ruthless India T20 World Cup: Zimbabwe hope to apply lessons from their heavy loss to West Indies as they prepare for a must-win Super 8 clash against defending champions India in Chennai on February 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-shai-hope-west-indies-spin-attack-india-t20-world-cup-2026-2873388-2026-02-24",
      "headline": "Will West Indies target India's spin weakness? Hope keeps everyone guessingT20 World Cup: West Indies captain Shai Hope remained coy about his spin plans against India when both teams battle it out in the Super 8 stage of the T20 World Cup 2026. West Indies spinners have been on top of their game during the ICC event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-t20-world-cup-super-8s-rain-washout-pakistan-weather-forecast-semifinal-qualification-pallekele-2873361-2026-02-24",
      "headline": "PAK vs ENG: Will rain washout yet another Super 8s game for Pakistan in Pallekele?PAK vs ENG, T20 World Cup 2026 Super 8s: Pakistan's second Super 8s game against England in Pallekele looks set to avoid the rain that washed out their opener, with forecasts showing just a 2 per cent chance of showers on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-abhishek-sharma-sanju-samson-selection-dilemma-2873354-2026-02-24",
      "headline": "Spin troubles aside, India should stay patient with Abhishek SharmaT20 World Cup: Abhishek Sharma's continuous poor form in T20 World Cup 2026 has intensified calls for change, with Sanju Samson emerging as a possible alternative. With India in a do-or-die situation, their next selection move could determine the fate of their World Cup campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/angkrish-raghuvanshi-interview-rohit-sharma-kkr-india-ipl-2026-abhishek-nayar-2873276-2026-02-24",
      "headline": "With lessons from Rohit, Raghuvanshi embraces the long road to India capAn Under-19 World Cup winner and now a rising force at Kolkata Knight Riders, Angkrish Raghuvanshi is navigating the early years of his career with clarity and patience. The Mumbai youngster speaks about growth, mentorship under Abhishek Nayar, learning alongside Rohit Sharma, and his ambitions for IPL 2026 and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-vs-jammu-and-kashmir-live-score-ranji-trophy-final-updates-hubli-2873305-2026-02-24",
      "headline": "Ranji Trophy final Day 1 Live: Shubham Pundir hits centuryKarnataka (KAR) vs Jammu and Kashmir (J&K) Live Score, Ranji Trophy final: Jammu and Kashmir are in a good position as Shubham Pundir has slammed a brilliant century for his team on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-no-3-irfan-pathan-ind-vs-zim-t20-world-cup-axar-patel-2873285-2026-02-24",
      "headline": "Suryakumar at No.3: Irfan Pathan urges batting shake-up for IND vs ZIMT20 World Cup: Irfan Pathan suggested that India captain Suryakumar Yadav should think about coming in at No.3 for India during their clash against Zimbabwe in Chennai. Pathan also said the hosts need Axar Patel back in the lineup but warned against making too many changes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-t20-world-cup-super-8-match-preview-pallekele-2873229-2026-02-24",
      "headline": "ENG vs PAK, Super 8 preview: Pakistan out to break England curse in tricky clashT20 World Cup, ENG vs PAK: England will look to seal their semi-final berth when they face Pakistan on Tuesday in Pallekele International Cricket Stadium. Pakistan, who have never beaten England in the tournament's history, face a tough challenge heading into the contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-odi-series-against-australia-world-champions-alyssa-healy-2873098-2026-02-24",
      "headline": "World champions India Women resume ODI duties in Alyssa Healy's farewell festivalINDW vs AUSW: Harmanpreet Kaur's India will be taking the field for the first time as the world champions when they meet Australia in the first ODI on Tuesday in Brisbane. Alyssa Healy is also set to play in her last white-ball series for the Aussies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-slams-false-narratives-about-personal-life-after-second-marriage-2873240-2026-02-23",
      "headline": "Shikhar Dhawan slams false narratives about personal life after second marriageShikhar Dhawan has slammed people for circulating false statements about his personal life after his second marriage. Dhawan recently married his girlfriend Sophie Shine in a private ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-west-indies-crush-zimbabwe-india-in-trouble-hetmyer-record-fifty-2873212-2026-02-23",
      "headline": "T20 World Cup: West Indies add to India's woes with thumping win over ZimbabweWest Indies secured a commanding 107-run victory over Zimbabwe in their Super 8 T20 World Cup match at Mumbai. The victory has intensified the pressure on India, who face a challenging path ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-womens-cricket-rashid-khan-support-exile-challenges-2873183-2026-02-23",
      "headline": "How Rashid Khan lent his helping hand for Afghanistan women's teamFirooza Amiri has revealed how Rashid Khan supported the Afghanistan women's team. Recently, Rashid also spoke in their favour during a press conference at the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-pakistan-t20-world-cup-liam-dawson-press-conference-2873155-2026-02-23",
      "headline": "England in a good place despite not being at their best: Liam Dawson before Pakistan clashT20 World Cup 2026, ENG vs PAK: Speaking to the reporters before the match against Pakistan on Tuesday, Liam Dawson said that England can play much better cricket, but are in good shape after their win against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-suspends-gianluca-prestianni-racist-abuse-vinicius-junior-champions-league-2873152-2026-02-23",
      "headline": "UEFA suspends Benfica's Prestianni for 2nd leg tie with Madrid over alleged racismUEFA has provisionally suspended Benfica's Gianluca Prestianni for Wednesday's Champions League match against Real Madrid following the alleged racist incident involving Vinicius Junior in last week's first leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sahibzada-farhan-england-vs-pakistan-t20-world-cup-super-8-press-conference-2873151-2026-02-23",
      "headline": "Pakistan will give England a tough time in Super 8s: Sahibzada FarhanT20 World Cup 2026, ENG vs PAK: Speaking to the reporters, Sahibzada Farhan said that Pakistan are not bothered about their winless run against England in the history of the tournament. Pakistan have lost all three matches against the Brits in the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-sitanshu-kotak-axar-patel-selection-2873132-2026-02-23",
      "headline": "Suryakumar and Gambhir explained Sundar's selection for SA clash to Axar: KotakT20 World Cup: Batting coach Sitanshu Kotak said that India captain Suryakumar Yadav and head coach Gautam Gambhir spoke to Axar Patel before the Super Eight match against South Africa"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-jammu-kashmir-live-streaming-2873134-2026-02-23",
      "headline": "Ranji Trophy Final, Karnataka vs Jammu and Kashmir: When and where to watchRanji Trophy Final: Karnataka and Jammu and Kashmir are all set to lock horns in the grand finale, starting Tuesday, February 24 at the KSCA Rajnagar Stadium in Hubballi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-england-vs-pakistan-liam-dawson-presser-usman-tariq-2873121-2026-02-23",
      "headline": "England wary of Pakistan as a unit, not only spinner Usman Tariq: Liam DawsonEngland spinner Liam Dawson insisted his side will not be distracted by the growing hype around Pakistan's mystery spinner Usman Tariq ahead of their crucial T20 World Cup Super 8 clash in Pallekele."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sahibzada-farhan-reaction-ipl-owned-hundred-teams-pakistan-players-2873101-2026-02-23",
      "headline": "Sahibzada reacts to reports of IPL-owned Hundred teams snubbing Pakistani playersPakistani batter Sahibzada Farhan brushed aside questions related to speculation that players from his country could be ignored by at least four Indian-owned franchises in The Hundred auction, saying the matter was beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-zimbabwe-live-score-super-8s-t20-world-cup-mumbai-2873063-2026-02-23",
      "headline": "ZIM vs WI Super 8 Highlights: West Indies hammer Zimbabwe by 107 runs in MumbaiZimbabwe (ZIM) vs West Indies (WI), T20 World Cup Super 8 Highlights: West Indies beat Zimbabwe by 107 runs at the Wankhede Stadium in Mumbai after Gudakesh Motie picked up four wickets and Shimron Hetmyer played a stupendous knock. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}