{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ministry-of-corporate-affairs-probes-gensol-over-loan-fraud-filings-accounts-under-scanner-sources-2711754-2025-04-20",
      "headline": "Gensol faces government inquiry after Rs 975 crore EV loan misuse: SourcesAccording to sources, the MCA's move is an independent action aimed at investigating potential corporate governance lapses and financial irregularities. There is no fixed timeline for the inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-from-april-23-tariffs-and-customs-negotiations-on-agenda-2711580-2025-04-19",
      "headline": "India-US trade talks from April 23, tariffs, customs negotiations on agenda: ReportThe Indian official team is visiting the US to give further impetus to the negotiations in the 90-day tariff pause window and discuss these terms of reference to iron out differences on certain issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-kajol-share-sweetest-wishes-for-daughter-nysa-on-her-22nd-birthday-2711892-2025-04-20",
      "headline": "Ajay Devgn, Kajol share sweetest wishes for daughter Nysa on her 22nd birthdayNysa Devgan, daughter of Kajol and Ajay Devgn, turned 22 on April 20. To mark the occasion, her parents shared heartfelt birthday wishes along with beautiful pictures of her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-stuns-with-vicky-kaushal-mehndi-at-friends-wedding-video-2711875-2025-04-20",
      "headline": "Katrina Kaif stuns with Vicky Kaushal mehndi at friend's wedding. VideoAt a friend's wedding, actor Katrina Kaif showcased a special mehndi design dedicated to her husband, Vicky Kaushal. The intricate 'VK' mehndi left fans in awe and quickly became the talk of the town."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhinav-shukla-death-threat-by-alleged-lawrence-bishnoi-gang-amid-rubina-row-with-asim-riaz-battleground-2711863-2025-04-20",
      "headline": "Abhinav Shukla gets death threats 'from Bishnoi gang' post Rubina's spat with AsimActor Abhinav Shukla has been threatened on Instagram by a person claiming to be a member of the Lawrence Bishnoi gang. The threat follows his wife Rubina Dilaik's controversy with Asim Riaz on 'Battleground'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simran-criticises-co-actor-for-insensitive-remark-on-doing-aunty-roles-2711849-2025-04-20",
      "headline": "Simran criticises co-actor for insensitive remark on doing 'aunty roles'Tamil actor Simran publicly called out a fellow actor for making an insensitive remark about 'aunty roles'. Expressing her shock, Simran stated that she'd rather portray such roles with dignity than take on a meaningless or 'dabba' role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-posts-video-of-rescuing-abandoned-girl-behind-house-2711802-2025-04-20",
      "headline": "Disha Patani's sister Khushboo posts video of rescuing abandoned girl behind houseActor Disha Patani's sister, Khushboo Patani, a former army officer, shared a video in which she was seen rescuing a girl child lying in the dirt behind her house. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-exposes-south-industry-navel-obsession-shares-her-experience-2711796-2025-04-20",
      "headline": "Malavika Mohanan exposes South industry's 'navel obsession', shares her experienceActor Malavika Mohanan recalled being body-shamed in both the South Indian and the Hindi film industry. She also talked about the South Indian industry's 'naval' obsession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-too-profound-for-words-moment-a-signed-jersey-by-lionel-messi-watch-viral-video-2711792-2025-04-20",
      "headline": "In Mohanlal's 'too profound for words' moment, a signed jersey by Lionel MessiMalayalam superstar Mohanlal couldn't contain his joy when his friends brought him one of the biggest gifts of his life - a signed jersey by football legend Lionel Messi. Here's what he had to say about that 'unforgettable moment'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-brother-defends-him-in-drugs-case-with-sarcasm-2711752-2025-04-20",
      "headline": "Malayalam actor Shine Tom Chacko's brother defends him in drugs case with sarcasmMalayalam actor Shine Tom Chacko was arrested and later released on bail in a drug-related case. His brother, Joe John Chako, now spoke to the media, and defended the actor by asking if none of them had ever visited a de-addiction centre before. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-10-detailed-report-sunny-deol-film-faces-kesari-2-with-grace-and-strength-2711745-2025-04-20",
      "headline": "Jaat box office Day 10: Sunny Deol's film faces Kesari 2 with grace and strengthSunny Deol's 'Jaat' has slowed down at the box office with the release of Akshay Kumar's 'Kesari Chapter 2' this weekend. A slight dip was expected, but it will be interesting to see how far the film can go now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-calls-anurag-kashyap-sick-you-cant-pollute-brahmin-legacy-watch-viral-video-2711734-2025-04-20",
      "headline": "Manoj Muntashir calls Anurag Kashyap 'sick': You can't pollute Brahmin legacyLyricist Manoj Muntashir shared a video on social media, slamming Anurag Kashyap for his alleged casteist remark against Brahmins. He also issued an open challenge to him in the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-thanks-fans-for-jaat-enjoys-nature-walk-before-border-2-shoot-2711732-2025-04-20",
      "headline": "Sunny Deol enjoys nature walk before Border 2 shoot, thanks fans for JaatAmid the massive success of his film 'Jaat', Sunny Deol is unwinding in the valleys. Sharing a serene video on Sunday, the actor thanked fans for their overwhelming love and promised that the sequel would be even more entertaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bombai-ka-babu-incest-identity-inner-conflict-in-dev-anand-suchitras-bold-film-2711699-2025-04-20",
      "headline": "Bombai Ka Babu: Incest, identity, inner conflict in Dev Anand-Suchitra's bold filmIn 'Retro Review' this weekend, we explore 'Bombai Ka Babu', a film starring Dev Anand and Suchitra Sen. It is a hauntingly beautiful setup with the themes of incest and identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-joins-chris-martin-in-surprise-jig-his-1st-after-military-discharge-watch-viral-videos-2711692-2025-04-20",
      "headline": "BTS Jin joins Chris Martin in surprise jig, his 1st after military discharge. VideosBTS Jin surprised his fans when he joined Coldlay's Chris Martin at a concert in Seoul on Saturday. The two performed 'The Astronaut' and 'My Universe' for the crowd, and their videos are now going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-2-detailed-report-akshay-kumar-film-poised-for-a-fantastic-rs-30-crore-weekend-2711669-2025-04-20",
      "headline": "Kesari 2 box office Day 2: Akshay's film poised for a fantastic Rs 30 crore weekendAkshay Kumar's 'Kesari Chapter 2' saw fabulous growth in its collection on the second day, which raised the expectations for its overall run. The film has largely received positive reviews on social media, which will help boost its collection further. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-says-films-cant-be-blamed-for-drug-abuse-amid-shine-tom-chacko-row-2711548-2025-04-19",
      "headline": "Unni Mukundan says films can't be blamed for drug abuse amid Shine Tom Chacko rowAmid the arrest of Malayalam actor Shine Tom Chacko in a drugs case, fellow actor Unni Mukundan has come forward to defend the film industry. He argued that cinema alone should not be blamed for such incidents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/resident-playbook-review-a-spin-off-that-honours-the-legacy-of-hospital-playlist-2711544-2025-04-19",
      "headline": "Resident Playbook review: A spin-off that honours the legacy of Hospital PlaylistReleased-Sat Apr 12, 2025'Resident Playbook' offers a gritty take on the medical drama genre, focusing on the challenges faced by young residents. With emotional depth and realistic portrayals, it stands as a compelling addition to the 'Hospital Playlist' universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-x-twitter-account-gets-hacked-alerts-fans-about-suspicious-activity-2711515-2025-04-19",
      "headline": "Khushboo Sundar alerts fans about suspicious activity after X account gets hackedActor and politician Khushboo Sundar's X account has been hacked. She shared an Instagram post to alert fans about any suspicious activity on her account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-nicola-coughlan-slams-jk-rowling-for-celebratory-post-over-trans-ruling-harry-potter-series-2711510-2025-04-19",
      "headline": "Bridgerton's Nicola Coughlan slams JK Rowling for celebratory post over trans rulingActor Nicola Coughlan on Friday shared a note in her Instagram stories, asking 'Harry Potter' writer JK Rowling to keep her 'Harry Potter lads', after the latter made a celebratory post following the Supreme Court's trans-woman ruling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-visits-tirupati-temple-with-director-raj-nidimoru-2711481-2025-04-19",
      "headline": "Samantha visits Tirupati temple with director Raj NidimoruSamantha visited the Tirupati Balaji Temple along with filmmaker Raj Nidimoru on Saturday. Videos from their divine visit have surfaced on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nishikant-dubey-waqf-act-row-muslim-commissioner-ex-cec-sy-quraishi-bjp-2711855-2025-04-20",
      "headline": "Muslim Commissioner: BJP's Nishikant Dubey now targets former poll panel chiefResponding to former Chief Election Commissioner SY Quraishi's post on X over the Waqf Amendment Act, BJP MP Nishikant Dubey called him \"not an Election Commissioner, but a Muslim Commissioner\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-dgp-former-found-dead-bengaluru-house-murder-wife-detained-cops-2711852-2025-04-20",
      "headline": "Ex-Karnataka police chief found dead with stab wounds, wife detainedFormer Karnataka DGP Om Prakash was found dead under mysterious circumstances at his residence in Bengaluru. Police have detained his wife in connection with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-political-alliance-maharashtra-raj-uddhav-thackeray-talks-only-emotional-sanjay-raut-2711743-2025-04-20",
      "headline": "No alliance yet, only emotional talk: Sanjay Raut on Thackerays' patch-up buzzWhile talking about the reunion, Sanjay Raut did not completely shoot down the possibility of Raj Thackeray and Uddhav Thackeray joining hands on the political pitch and placed the onus on the two cousins for future alliance talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-score-virat-kohli-devdutt-padikkal-mullanpur-win-2711853-2025-04-20",
      "headline": "Virat Kohli masterminds revenge vs PBKS as RCB win 5th successive away gameIPL 2025, PBKS vs RCB: Virat Kohli and Devdutt Padikkal fired with the bat after a collective bowling performance as Royal Challengers Bengaluru hammered Punjab Kings in Mullanpur on Sunday. RCB have won all their matches away from home so far this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-got-protein-fetish-protein-fortified-coffee-pasta-bread-milk-yogurt-calorie-activity-level-what-to-do-2711538-2025-04-20",
      "headline": "India's protein paradox: A marketing flood amid deficit dietThe current list of protein-fortified foods being marketed in India is long. Protein jumbo yogurt, protein mueseli, protein coffee, protein cereals, protein pasta and protein water are just a few. Given that Indian diet is protein-deficient, is such consumption of protein-fortified foods good for health? This is what experts say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hindu-minister-kheal-das-kohistani-attacked-protest-sindh-pakistan-pm-shehbaz-sharif-probe-2711803-2025-04-20",
      "headline": "Hindu minister attacked during protest in Pakistan, Shehbaz Sharif assures probeKheal Das Kohistani, a Pakistani Hindu minister, was attacked in Sindh by protesters opposing the government's irrigation canal projects in the province. Prime Minister Shehbaz Sharif condemned the attack and assured of a thorough probe into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-nitesh-rane-uddhav-thackeray-raj-thackeray-reunion-buzz-mns-sena-ubt-maharashtra-2711867-2025-04-20",
      "headline": "Did he ask his wife? Nitish Rane jabs Uddhav amid Thackerays' reunion buzzReacting to the reunion buzz between estranged cousins Uddhav Thackeray and Raj Thackeray, BJP's Nitesh Rane jabbed at the Shiv Sena (UBT) chief and asked whether he had consulted his wife Rashmi Thackeray on the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-mumbai-indians-vs-chennai-super-kings-updates-today-match-2711830-2025-04-20",
      "headline": "MI vs CSK Live: MI get closer after Surya hits 26-ball fiftyIPL 2025, MI vs CSK Live Score in Mumbai: Ravindra Jadeja has got the wicket of Ryan Rickelton as Mumbai are off to a flying start. Suryakumar Yadav has joined Rohit Sharma in the middle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-ramban-floods-cloudburst-shops-houses-destroyed-special-package-2711889-2025-04-20",
      "headline": "Houses, shops washed away overnight; need special aid: Residents on Ramban floodsResidents of Jammu and Kashmir's Ramban district, where heavy rain triggered flash floods, said their shops and houses were damaged due to landslides and urged the government to announce a special package to compensate their losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-president-mallikarjun-kharge-bjp-jdu-opportunistic-nitish-kumar-bihar-elections-2711811-2025-04-20",
      "headline": "Nitish Kumar changes party for kursi: Congress targets BJP-JDU allianceAddressing a Congress rally in Buxur, the party president urged voters to oust BJP and JD(U) from power and elect the Mahagathbandhan in the elections scheduled later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-nishikant-dubey-supreme-court-lawyer-seeks-contempt-proceedings-2711842-2025-04-20",
      "headline": "Lawyer seeks contempt action against BJP MP for remarks against Supreme CourtAdvocate Anas Tanveer has written to Attorney General R Venkatramani seeking consent to initiate contempt proceedings against BJP MP Nishikant Dubey for his remarks against the Chief Justice of India and Supreme Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-rohit-sharma-first-fifty-2711891-2025-04-20",
      "headline": "Rohit Sharma returns to form one pull at a time, hits 33-ball fifty in MI vs CSKMumbai Indians opener Rohit Sharma returned to form with a 33-ball fifty. Playing against CSK, Rohit hit 4 sixes en route to his first half century of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/paneer-iodine-test-viral-social-media-food-scientists-2711674-2025-04-20",
      "headline": "The problem with 'iodine' paneer policingIodine paneer tests are going viral on social media, but they may not be revealing the real truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ministry-of-corporate-affairs-probes-gensol-over-loan-fraud-filings-accounts-under-scanner-sources-2711754-2025-04-20",
      "headline": "Gensol faces government inquiry after Rs 975 crore EV loan misuse: SourcesAccording to sources, the MCA's move is an independent action aimed at investigating potential corporate governance lapses and financial irregularities. There is no fixed timeline for the inquiry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhinav-shukla-death-threat-by-alleged-lawrence-bishnoi-gang-amid-rubina-row-with-asim-riaz-battleground-2711863-2025-04-20",
      "headline": "Abhinav Shukla gets death threats 'from Bishnoi gang' post Rubina's spat with AsimActor Abhinav Shukla has been threatened on Instagram by a person claiming to be a member of the Lawrence Bishnoi gang. The threat follows his wife Rubina Dilaik's controversy with Asim Riaz on 'Battleground'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aligharh-man-finds-missing-wife-with-another-man-taj-mahal-whatsapp-video-police-search-2711861-2025-04-20",
      "headline": "Husband reports wife missing, later spots her with another man at Taj MahalThe complainant, Shakir, filed a complaint with the police on April 18, saying that his wife Anjum had been missing since April 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-stuns-with-vicky-kaushal-mehndi-at-friends-wedding-video-2711875-2025-04-20",
      "headline": "Katrina Kaif stuns with Vicky Kaushal mehndi at friend's wedding. VideoAt a friend's wedding, actor Katrina Kaif showcased a special mehndi design dedicated to her husband, Vicky Kaushal. The intricate 'VK' mehndi left fans in awe and quickly became the talk of the town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-474-18-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-flash-floods-3-dead-dozens-rescued-as-flash-floods-ravage-ramban-2711725-2025-04-20",
      "headline": "3 dead, hundreds rescued in J&K flash floods and landslides; major roads cut offTen houses were completely destroyed, while 25 to 30 others suffered partial damage. Despite the destruction, a swift response by the Dharamkund police and district administration ensured the safe evacuation of nearly 90 to 100 people. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dalit-man-sexually-assaulted-urinated-on-thrashed-rajasthans-sikar-filming-of-act-2711848-2025-04-20",
      "headline": "Dalit man sexually assaulted, urinated upon in Rajasthan; accused filmed actThe young man told his family about the incident eight days later, following which a police complaint was filed, and a case was registered against the two accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-unveils-its-first-global-electric-sedan-the-ev4-2711741-2025-04-20",
      "headline": "Kia unveils its first global electric sedan, the EV4Kia has unveiled the EV4 at the ongoing New York International Auto Show. The EV4 comes with two battery choices: a 58.3kWh unit offering up to 378km range and an 81.4kWh option delivering up to 531km on Wind and GT-Line trims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-chhatarpur-doctor-drags-slaps-77-year-old-elderly-patient-video-2711795-2025-04-20",
      "headline": "Madhya Pradesh doctor slaps, drags elderly man for demanding quicker treatmentA video, which went viral on social media, shows a doctor and a Red Cross worker dragging and slapping a 77-year-old man at the district hospital in Madhya Pradesh's Chhatarpur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/banned-meitei-outfit-wanted-militant-manipur-arrested-hotel-raid-guwahati-2711844-2025-04-20",
      "headline": "Wanted militant of banned Meitei outfit arrested in Guwahati hotel raidA wanted member of the People's Liberation Army (PLA), a banned Meitei militant outfit, was arrested in a hotel raid operation led by the Guwahati Police. The accused was sent to police custody and was being questioned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-comments-glenn-maxwell-holiday-2711846-2025-04-20",
      "headline": "Maxwell, Livingstone come to India to spend holiday, not win IPL: SehwagVirender Sehwag has hit out against IPL's overseas stars Glenn Maxwell and Liam Livingstone. Sehwag has claimed that overseas players come to holiday in India and do not care about winning trophies."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/barcelona-open-holger-rune-carlos-alcaraz-final-2711893-2025-04-20",
      "headline": "Rune stuns Alcaraz in straight sets to win Barcelona Open titleBarcelona Open 2025: Holger Rune beat Carlos Alcaraz 7-6 (6), 6-2 in the grand finale on Sunday, April 20 to claim the ATP 500 championship. Alcaraz won the title in 2022 and 2023 before missing out in 2024 due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-rohit-sharma-first-fifty-2711891-2025-04-20",
      "headline": "Rohit Sharma returns to form one pull at a time, hits 33-ball fifty in MI vs CSKMumbai Indians opener Rohit Sharma returned to form with a 33-ball fifty. Playing against CSK, Rohit hit 4 sixes en route to his first half century of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-kkr-vs-gt-ajinkya-rahane-carl-crowe-press-conference-2711881-2025-04-20",
      "headline": "KKR not focusing on just negatives after PBKS loss: Spin bowling coachKKR's bowling coach Carl Crowe has said that the team isn't just focusing on the negatives after their humiliating loss against PBKS. KKR were bundled out for 95 as PBKS defended 111 runs, an IPL record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ravindra-jadeja-trolled-social-media-csk-vs-mi-2711880-2025-04-20",
      "headline": "Evolving backwards: Ravindra Jadeja trolled after woeful innings in MI vs CSKDespite guiding Chennai Super Kings to a respectable total of 176 in Mumbai, Ravindra Jadeja was brutally trolled by the fans on Sunday, April 20. Promoted to No.4 Jadeja struggled yet again to up the ante for the majority of his innings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-troll-mullanpur-old-tweet-2711878-2025-04-20",
      "headline": "RCB brutally troll PBKS after digging out 11-year-old Salman Khan tweetIPL 2025, PBKS vs RCB: Punjab Kings trolled Royal Challengers Bengaluru following their seven-wicket win on Sunday at the Maharaja Yadavindra Singh International Cricket Stadium in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-reaction-ayush-mhatre-debut-mi-vs-csk-2711873-2025-04-20",
      "headline": "Watch: MS Dhoni's wholesome reaction to Ayush Mhatre's fearless debutIPL 2025, MI vs CSK: 17-year-old Ayush Mhatre thrilled the world, including MS Dhoni, with his fearless knock on IPL debut. The Mumbai boy smashed 32 off just 15 balls for CSK at the Wankhede Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-neeraj-chopra-mondo-duplantis-india-visit-2711872-2025-04-20",
      "headline": "Neeraj Chopra huge inspiration, remains same nice guy I met in 2016: Mondo DuplantisMondo Duplantis heaped praise on Neeraj Chopra and called him a huge inspiration for him. Duplantis recalled his initial interaction with the Indian star and said that Neeraj remains the same nice caring guy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-player-of-match-devdutt-mullanpur-2711869-2025-04-20",
      "headline": "Virat Kohli follows MS Dhoni, says teammate deserved Player of Match awardIPL 2025, PBKS vs RCB: Virat Kohli was named the Player of the Match award for his unbeaten 73 in RCB's successful chase of 158. However, he felt Devdutt Padikkal deserved the award for his quick-fire 61 in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-ms-dhoni-toss-wankhede-stadium-mumbai-2711865-2025-04-20",
      "headline": "Watch: Dhoni, Dhoni chants ring around Wankhede stadium for CSK skipper at tossThe fans at Wankhede stadium gave CSK skipper MS Dhoni a warm reception as his name was ringing around the iconic venue after the toss against MI on Sunday, April 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-shreyas-iyer-celebration-video-2711864-2025-04-20",
      "headline": "Did Virat Kohli's wild celebration trigger Shreyas Iyer?IPL 2025: Virat Kohli celebrated animatedly while facing Shreyas Iyer after Royal Challengers Bengaluru beat the Punjab Kings by seven wickets on Sunday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-record-david-warner-rcb-vs-pbks-match-today-2711857-2025-04-20",
      "headline": "Virat Kohli shatters David Warner's all-time IPL recordVirat Kohli shattered David Warner's all-time IPL record of most 50+ scores in the tournament with yet another half century. Kohli anchored RCB's innings to help them to their 5th straight away win of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-neeraj-chopra-mondo-duplantis-india-visit-2711872-2025-04-20",
      "headline": "Neeraj Chopra huge inspiration, remains same nice guy I met in 2016: Mondo DuplantisMondo Duplantis heaped praise on Neeraj Chopra and called him a huge inspiration for him. Duplantis recalled his initial interaction with the Indian star and said that Neeraj remains the same nice caring guy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-player-of-match-devdutt-mullanpur-2711869-2025-04-20",
      "headline": "Virat Kohli follows MS Dhoni, says teammate deserved Player of Match awardIPL 2025, PBKS vs RCB: Virat Kohli was named the Player of the Match award for his unbeaten 73 in RCB's successful chase of 158. However, he felt Devdutt Padikkal deserved the award for his quick-fire 61 in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-ms-dhoni-toss-wankhede-stadium-mumbai-2711865-2025-04-20",
      "headline": "Watch: Dhoni, Dhoni chants ring around Wankhede stadium for CSK skipper at tossThe fans at Wankhede stadium gave CSK skipper MS Dhoni a warm reception as his name was ringing around the iconic venue after the toss against MI on Sunday, April 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-shreyas-iyer-celebration-video-2711864-2025-04-20",
      "headline": "Did Virat Kohli's wild celebration trigger Shreyas Iyer?IPL 2025: Virat Kohli celebrated animatedly while facing Shreyas Iyer after Royal Challengers Bengaluru beat the Punjab Kings by seven wickets on Sunday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-record-david-warner-rcb-vs-pbks-match-today-2711857-2025-04-20",
      "headline": "Virat Kohli shatters David Warner's all-time IPL recordVirat Kohli shattered David Warner's all-time IPL record of most 50+ scores in the tournament with yet another half century. Kohli anchored RCB's innings to help them to their 5th straight away win of the season.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}