{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-is-king-says-mark-mobius-amid-trade-war-fears-backs-india-over-china-2717526-2025-04-30",
      "headline": "'Cash is king,' says Mark Mobius amid trade war fears, backs India over ChinaVeteran investor Mark Mobius believes that the uncertainty around the trade wars makes it risky to invest right now. However, he does see hope in countries like India, which he says could benefit as global supply chains shift away from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-46-points-lower-nifty-below-24400-bajaj-twins-fall-5-percent-2717501-2025-04-30",
      "headline": "Sensex closes 46 points lower, Nifty below 24,400; Bajaj twins fall 5%The S&P BSE Sensex was down by 46.14 points to end at 80,242.24, while the NSE Nifty50 lost 1.75 points to close at 24,334.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-today-fall-stock-market-investment-akshaya-tritiya-safe-haven-2717498-2025-04-30",
      "headline": "Can gold retain its glitter as Dalal Street gets back its glow?Just a week ago, gold was trading at record levels due to global uncertainty. Concerns over trade tensions, US tariffs, and geopolitical issues had pushed investors towards gold, a common choice during uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-public-listing-market-buzz-dalal-street-trading-lg-tata-zepto-reliance-hdfc-2717462-2025-04-30",
      "headline": "New wave of IPOs is coming. Is Dalal Street ready?Tata Capital, PhonePe, and Zepto are also said to be in the pipeline. Financial firms like HDB Financial Services and Hero FinCorp are planning to raise Rs 12,500 crore and Rs 3,668 crore, respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rakuten-to-invest-over-100-million-dollars-in-india-plans-to-boost-hiring-by-8-percent-2717447-2025-04-30",
      "headline": "Rakuten to invest over $100 million in India, plans to boost hiring by 8%Rakuten currently employs 4,000 people in India, 90% of whom are tech staff, and plans to recruit people who it considers \"power users\" of AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-raises-atm-charges-rs-23-from-may-1-know-the-details-here-2717434-2025-04-30",
      "headline": "RBI's raises ATM charges to Rs 23 from May 1: Know the details herePeople living in metro cities would get three free transactions per month, while those living in non-metro areas would get five free transactions per month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-rallies-strongest-2025-level-foreign-inflows-dollar-sales-2717421-2025-04-30",
      "headline": "Rupee jumps to highest level in 2025. Check factors behind strong rallyThe Indian rupee reached its highest level of 2025, driven by foreign inflows and exporter dollar sales. Optimism over US-India trade talks and a weakening US dollar further supported the currency's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-group-stocks-trading-price-target-q4-results-brokerage-reports-2717352-2025-04-30",
      "headline": "5 Adani stocks get new targets after Q4 results: What should investors do?With Gautam Adani-led Adani Enterprises Ltd set to announce its earnings report soon, stock brokerages have already reviewed the performance of five listed companies from the group and shared fresh price targets and advice for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/varun-beverages-q4-results-key-things-to-expect-from-pepsico-bottler-2717316-2025-04-30",
      "headline": "Varun Beverages Q4 net profit at Rs 726 crore; firm announces interim dividendThe company posted a net profit of Rs 726 crore, up 35% year-on-year, driven by higher volumes and peak-season demand. Revenue for the quarter came in at Rs 5,680 crore, a 29% jump YoY, slightly ahead of most analyst estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-20-deadline-ends-today-last-call-to-settle-income-tax-disputes-2717298-2025-04-30",
      "headline": "Vivad Se Vishwas 2.0 deadline ends today: Last call to settle income tax disputesVivad Se Vishwas 2.0 is a dispute resolution scheme run by the Income Tax Department. It gives taxpayers a chance to settle ongoing tax-related cases by avoiding the prolonged litigation process and simply paying the disputed tax amount."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/akshaya-tritiya-2025-gold-price-today-should-you-buy-or-avoid-yellow-metal-rate-2717296-2025-04-30",
      "headline": "Akshaya Tritiya 2025: Is falling gold price an opportunity to buy more?Akshaya Tritiya is considered a good day to buy gold. But with gold prices now close to all-time highs, near Rs 96,000 per 10 grams, many buyers are thinking twice before making big purchases this year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/who-was-costao-fernandes-nawazuddin-siddiqui-costao-brings-heroic-life-customs-officer-2717593-2025-04-30",
      "headline": "Who's Costao Fernandes? Nawazuddin brings heroic life of customs officer to screen'Costao' tells the true story of Tony da Costa Fernandes, a brave officer who took down smugglers and paid a heavy price for justice. Featuring Nawazuddin Siddiqui, the film covers the themes of courage, corruption, and honour. Here's all you need to know about the gutsy customs officer.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/influencer-ishita-mangal-slams-ranveer-singh-nitanshi-goel-sidharth-malhotra-celebs-for-disrespecting-designers-2717492-2025-04-30",
      "headline": "Influencer slams Ranveer Singh, Nitanshi Goel, and celebs for disrespecting designersInfluencer Ishita Mangal recently called out Bollywood actors for showing disrespect towards designers during fashion shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ground-zero-actor-emraan-hashmi-attack-on-ghazi-baba-most-crucial-counter-terror-attack-india-2717568-2025-04-30",
      "headline": "Exclusive: Emraan Hashmi revisits India's most crucial counter-terror attackActor Emraan Hashmi discusses his role in 'Ground Zero', highlighting its focus on one of the most crucial anti-terror operation in early 2000s Kashmir, a volatile period marked by significant terrorist activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-shah-rukh-khan-kiara-advani-diljit-dosanjh-indian-fans-expect-this-year-isha-ambani-2717551-2025-04-30",
      "headline": "Met Gala 2025: What can Indian fans expect this yearMet Gala 2025 is just around the corner, and fans are quite excited about the same. With several prominent names from the Indian circuit, including Shah Rukh Khan, Kiara Advani, and more on the list, this year's fashionable event is shaping up to be a glamorous global affair.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sheena-bajaj-expecting-first-child-with-husband-rohit-purohit-2717500-2025-04-30",
      "headline": "Best of Luck Nikki's Sheena Bajaj expecting first child with husband Rohit PurohitActor Sheena Bajaj is pregnant with her first child. The actor shared the news with her fans on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-telegana-representation-in-films-paradise-dasara-2717511-2025-04-30",
      "headline": "Actor Nani defends portrayal of Telangana people in Dasara | ExclusiveTelugu actor Nani addresses the portrayal of Telangana in films, promising a fresh perspective in his upcoming movie 'The Paradise'. In an interview, he defends his previous work while assuring a new narrative in his latest project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vvan-force-of-the-forest-tamannaah-bhatia-joins-sidharth-malhotras-upcoming-folk-thriller-2717473-2025-04-30",
      "headline": "Vvan: Tamannaah Bhatia joins Sidharth Malhotra's upcoming folk thrillerTamannaah Bhatia is set to star alongside Sidharth Malhotra in the folk thriller 'Vvan-Force of the Forest.' A teaser showcasing her mysterious new avatar was released, coinciding with Chhath 2024 festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-hospitalised-minor-leg-injury-chennai-airport-after-padma-bhushan-2717445-2025-04-30",
      "headline": "Ajith Kumar hospitalised after minor leg injury in ChennaiActor Ajith Kumar has been hospitalised in Chennai after his return from New Delhi. The actor suffered a minor injury at the Chennai airport on Tuesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/now-you-see-me-now-you-dont-trailer-jesse-eisenberg-returns-with-his-horsemen-isla-fisher-woody-harrelson-dave-franco-2717437-2025-04-30",
      "headline": "Now You See Me 3 trailer: Jesse Eisenberg returns with his Horsemen for another heistThe 'Now You See Me 3' trailer has been released, reuniting the original cast with some new additions. Fans are in for a thrilling ride as the Four Horsemen take on a new heist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-2717440-2025-04-30",
      "headline": "It's a high-risk profession: Emraan Hashmi on emotional toll of playing BSF jawanIn an exclusive interview with India Today, Emraan Hashmi shared his experience of preparing for the role of a BSF officer in 'Ground Zero'. The actor talked about the physical and emotional challenges he faced during the filming"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/costao-movie-review-nawazuddin-siddiqui-holds-half-baked-film-about-unsung-hero-2717439-2025-04-30",
      "headline": "Costao movie review: Nawazuddin Siddiqui holds half-baked film about unsung heroReleased-Wed Apr 30, 2025In 'Costao', Nawazuddin Siddiqui plays an honest customs officer who is caught in the web of power and politics and is robbed of eight years of life after being accused of murder. While the actor performs fabulously, the story doesn't hold on its own despite being inspired by a heroic real-life incident. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/mouni-roy-on-botched-surgery-claims-people-are-writing-rubbish-vicious-things-2717332-2025-04-30",
      "headline": "Mouni Roy on botched surgery claims: People are writing rubbish, vicious thingsActor Mouni Roy recently responded to trolls who accused her of having cosmetic surgery, saying she feels sorry for them.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/content-creator-misha-agrawal-suicide-sister-she-felt-worthless-when-followers-fell-2717324-2025-04-30",
      "headline": "Content creator Misha Agrawal died by suicide, reveals sisterContent creator Misha Agrawal died by suicide just before her 25th birthday, her sister revealed. She shared that Misha had been under immense pressure due to decline in her social media followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-says-parents-lost-respect-in-a-second-i-put-them-through-that-2717320-2025-04-30",
      "headline": "Apoorva Mukhija says parents 'lost respect in a second': I put them through thatApoorva Mukhija became emotional in a promo for her interview with We Are Yuvaa, discussing the backlash from the India's Got Latent controversy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-deaddiction-centre-drug-abuse-claims-2717314-2025-04-30",
      "headline": "Actor Shine Tom Chacko admitted to de-addiction centre amid drug abuse claimsMalayalam actor Shine Tom Chacko has been admitted to a rehab centre following drug abuse allegations by co-star Vincy Aloshious. He was earlier arrested and released on bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-teaser-akshay-kumar-abhishek-bachchan-riteish-deshmukh-nana-patekar-laugh-riot-killer-twist-this-time-2717287-2025-04-30",
      "headline": "Housefull 5 teaser: Akshay Kumar's laugh riot gets a killer twist this timeAkshay Kumar's family entertainer, 'Housefull 5' teaser is finally out. The film will release in theatres on June 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-shah-rukh-khan-to-reunite-for-5th-time-in-king-shooting-details-out-report-2717250-2025-04-30",
      "headline": "Deepika Padukone-SRK to reunite for 5th time in King, shooting details out: ReportShah Rukh Khan and Deepika Padukone seem to be paired together for the fifth time. The two will reportedly be seen alongside Suhana Khan in her debut film 'King'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-not-in-favour-of-pakistani-artistes-in-india-at-this-moment-i-would-say-no-2717274-2025-04-30",
      "headline": "Javed Akhtar on Pakistani artistes in India: At this moment, I would say noVeteran screenwriter and lyricist Javed Akhtar shared his views on whether Pakistani artistes should be allowed to perform in India. He stated that it's a 'one-way traffic'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-melbourne-concert-delay-700-people-wont-perform-2717235-2025-04-30",
      "headline": "Neha Kakkar refused to perform for just '700 people' in Melbourne: Event plannerSinger Neha Kakkar allegedly refused to perform at the Melbourne concert. One of the event organisers claimed that she wasn't satisfied with the turnout of 700 people and wanted to wait till the stadium filled up."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/caste-census-to-be-included-in-national-census-announces-union-minister-ashwini-vaishnaw-2717516-2025-04-30",
      "headline": "Caste census to be included in population survey: Cabinet's big decisionWhile announcing the big Cabinet decision, Vaishnaw trained guns on the Congress, saying the party always opposed the caste census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-in-india-for-17-years-among-those-sent-back-had-aadhaar-voted-too-osama-pahalgam-heres-what-2717510-2025-04-30",
      "headline": "Voted, studied in India, says Pakistan's Osama, sent back after 17 yearsOf the around 900 Pakistanis sent back by India after the Pahalgam massacre, some are said to have been here for five decades. Osama, originally from the twin cities of Islamabad-Rawalpindi, said he was in India for 17 years and even voted in Indian elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-senator-palwasha-zai-khan-brick-new-babri-mosque-in-ayodhya-2717589-2025-04-30",
      "headline": "First brick of Babri mosque in Ayodhya will be laid by Pak soldiers: SenatorA video of Senator Palwasha Khan's inflammatory speech in Pakistan's Upper House has gone viral amid tensions between the two countries over the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lashkar-chief-hafiz-saeed-residence-pakistan-posh-locality-lahore-pahalgam-terror-attack-2717464-2025-04-30",
      "headline": "How Hafiz Saeed's hideout is different from that of bin Laden, Masood AzharSatellite images and footage exclusively accessed by India Today show the expansive compound where Lashkar chief Hafiz Saeed resides is situated in a posh locality in Pakistan's second-largest city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-diplomats-meet-afghanistan-taliban-kabul-takes-them-on-side-before-military-offensive-on-pakistan-2717428-2025-04-30",
      "headline": "India takes Taliban on its side, pushes Pak into corner after PahalgamAs Pakistan is scrambling to shield itself diplomatically and militarily, India has quietly reached out to Kabul, Islamabad's worst friend-turned-foe. With this smart tactical move, India further cornered Pakistan after the Pahalgam terror attack. The Taliban have condemned the dastardly terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-vs-punjab-kings-live-score-updates-2717596-2025-04-30",
      "headline": "CSK vs PBKS Live: Can Chennai seek revenge in survival clash vs Punjab?CSK vs PBKS, IPL 2025 Live score: Chennai Super Kings will have to fight for their survival in IPL 2025 when they face off against Punjab Kings on April 30, as the MS Dhoni-led side also have the chance to stage a revenge after losing their away clash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-warns-pakistan-ceasefire-violations-line-of-control-international-border-2717555-2025-04-30",
      "headline": "India warns Pakistan against ceasefire violations along LoC during talks over hotlineThe Director Generals of Military Operations of India and Pakistan had a hotline conversation on Tuesday to address unprovoked ceasefire violations by the Pakistan Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-today-tracks-hafiz-saeeds-safe-haven-in-lahore-2717350-2025-04-30",
      "headline": "Exclusive video of India's most wanted Hafiz Saeed's top-security Lahore hideoutIndia Today has accessed satellite pictures and videos that show how terror mastermind Hafeez Saeed is living a comfortable life in a upscale Lahore neighbourhood under tight security by the Pakistani government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-3/story/chandrayaan-3-makes-big-discovery-on-moons-shiv-shakti-point-2717566-2025-04-30",
      "headline": "Chandrayaan-3 makes big discovery on Moon's Shiv Shakti PointThe findings reinforce the Shiv Shakti Point's value as a site for sampling primitive mantle materials."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-mobilises-army-along-border-amid-indian-retaliation-fears-after-pahalgam-attack-2717517-2025-04-30",
      "headline": "Pakistan scrambles troops along border fearing military action by IndiaThis comes amid repeated ceasefire violations by the Pakistani Army along the Line of Control (LoC) and the international border in Jammu and Kashmir over the last six days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-students-train-loc-line-of-control-schools-safety-training-2717515-2025-04-30",
      "headline": "J&K schools along LoC train students for wartime safety after Pahalgam attackThe training program includes safety drills, techniques to shield against artillery fire, and awareness sessions on what to do in the event of war. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-blusmart-hard-brake-is-heartbreak-for-the-urban-indian-commuter-2717478-2025-04-30",
      "headline": "Why BluSmart hard-brake is heartbreak for the urban Indian commuterIts sudden exit leaves riders looking for clean and reliable cabs with fewer choices and poses sobering questions for our EV mobility policymakers"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-shah-rukh-khan-kiara-advani-diljit-dosanjh-indian-fans-expect-this-year-isha-ambani-2717551-2025-04-30",
      "headline": "Met Gala 2025: What can Indian fans expect this yearMet Gala 2025 is just around the corner, and fans are quite excited about the same. With several prominent names from the Indian circuit, including Shah Rukh Khan, Kiara Advani, and more on the list, this year's fashionable event is shaping up to be a glamorous global affair.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/alok-joshi-appointed-national-security-advisory-baord-chief-india-pakistan-tensions-2717404-2025-04-30",
      "headline": "Security advisory board revamped after Pahalgam attack, ex-RAW chief to head itThe move to revamp the National Security Advisory Board comes in the aftermath of the Pahalgam terrorist attack and amid tensions with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mary-kom-divorce-confirms-official-statement-denies-affair-rumours-2717560-2025-04-30",
      "headline": "Mary Kom confirms divorce with husband, denies affair rumours in new statementMary Kom breaks her silence on divorce and affair rumours, revealing she and her husband parted ways in 2023. The Olympic legend strongly denied any link with her business associate, calling rumours baseless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pm-modi-to-chair-super-cabinet-ccpa-ccs-meet-today-first-since-pulwama-attack-2717228-2025-04-30",
      "headline": "PM's 'super cabinet' meets just after top security body huddle over J&K attack Live UpdatesPrime Minister Narendra Modi chaired key Cabinet Committee on Security (CCS) and Cabinet Committee on Political Affairs (CCPA) meetings today amid tensions with Pakistan after the Pahalgam terror attack that killed 26 people. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-3/???#google_vignette",
      "headline": "When Kashmir turned crimson with blood of PanditsIn part 3 of our series on the history of terror in Kashmir, we revisit the winter of 1989, when the blood of Kashmiris flowed through the Valley, leading to the biggest exodus in Independent India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ishaq-dar-pakistan-got-the-resistance-front-removed-un-security-council-statement-pahalgam-attack-2717266-2025-04-30",
      "headline": "How Pak got terror outfit's name dropped from UN statement on Pahalgam attackPakistani Foreign Minister Ishaq Dar said as a non-permanent member of the UN Security Council, Islamabad pushed to water down the language in the US-proposed statement, which originally named and shamed The Resistance Front."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-convict-dashwanth-acquitted-in-mother-murder-case-remains-death-row-child-rape-case-2017-2717430-2025-04-30",
      "headline": "Tamil Nadu techie on death row for minor's rape-murder acquitted of killing motherA Tamil Nadu techie sentenced to death for a child's rape and murder in 2017, has been acquitted in the murder of his mother by a Chengalpattu court citing lack of evidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-prohibition-is-back-in-focus-in-bihar-2717455-2025-04-30",
      "headline": "Why prohibition is back in focus in BiharHas CM Nitish Kumar's total ban on liquor since 2016 been a triumph of moral governance or an ill-conceived gambit? Voters will judge soon"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/costao-movie-review-nawazuddin-siddiqui-holds-half-baked-film-about-unsung-hero-2717439-2025-04-30",
      "headline": "Costao movie review: Nawazuddin Siddiqui holds half-baked film about unsung heroReleased-Wed Apr 30, 2025In 'Costao', Nawazuddin Siddiqui plays an honest customs officer who is caught in the web of power and politics and is robbed of eight years of life after being accused of murder. While the actor performs fabulously, the story doesn't hold on its own despite being inspired by a heroic real-life incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakisitan-panic-fear-bunker-hide-radar-system-pahalgam-terror-attacks-pm-modi-was-shehbaz-sharif-asim-munir-2717076-2025-04-30",
      "headline": "Pakistan turns panicistanIndia's display of resolve after the Pahalgam terror attacks in which 26 people were killed has spread panic among Pakistan's military and civilian authorities. The panic mode is on full display as Islamabad scurries officials to several world capitals, moves terrorists nourished by it into bunkers, pleads for a neutral probe and rushes forces to the border with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/harvard-university-top-pakistan-officials-after-pahalgam-terror-attack-glbs-2717160-2025-04-30",
      "headline": "Harvard distances itself from event that hosted Pak officials after J&K attackA recent Pakistan conference at Harvard's South Asia Institute drew backlash from Indian students after top Pakistani officials attended just days after the Pahalgam terror attack. Harvard later removed event details online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-ipl-2025-vaibhav-suryavanshi-age-records-2717547-2025-04-30",
      "headline": "Exercise restraint in praise and criticism of Vaibhav Suryavanshi: Rahul DravidRajasthan Royals head coach Rahul Dravid has asked for restraint while praising or criticising Vaibhav Suryavanshi. Vaibhav grabbed global headlines after hitting the 2nd fastest century in the history of the IPL, against Gujarat Titans.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-how-perth-test-snub-made-him-ponder-retirement-2717598-2025-04-30",
      "headline": "R Ashwin reveals how Perth Test snub during BGT made him ponder retirementFormer India all-rounder Ravichandran Ashwin recently revealed how the Perth Test snub during the Border Gavaskar Trophy 2024-25 made him ponder retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-vs-punjab-kings-live-score-updates-2717596-2025-04-30",
      "headline": "CSK vs PBKS Live: Can Chennai seek revenge in survival clash vs Punjab?CSK vs PBKS, IPL 2025 Live score: Chennai Super Kings will have to fight for their survival in IPL 2025 when they face off against Punjab Kings on April 30, as the MS Dhoni-led side also have the chance to stage a revenge after losing their away clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mary-kom-divorce-confirms-official-statement-denies-affair-rumours-2717560-2025-04-30",
      "headline": "Mary Kom confirms divorce with husband, denies affair rumours in new statementMary Kom breaks her silence on divorce and affair rumours, revealing she and her husband parted ways in 2023. The Olympic legend strongly denied any link with her business associate, calling rumours baseless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-high-court-issues-notice-to-bcci-over-naming-ai-robot-dog-champak-2717549-2025-04-30",
      "headline": "Delhi High Court issues notice to BCCI over naming AI robot dog 'Champak'The Delhi High Court has issued a notice to the Board of Control for Cricket in India (BCCI) for naming their AI robot dog 'Champak', claiming that it constitutes trademark infringement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-ipl-2025-vaibhav-suryavanshi-age-records-2717547-2025-04-30",
      "headline": "Exercise restraint in praise and criticism of Vaibhav Suryavanshi: Rahul DravidRajasthan Royals head coach Rahul Dravid has asked for restraint while praising or criticising Vaibhav Suryavanshi. Vaibhav grabbed global headlines after hitting the 2nd fastest century in the history of the IPL, against Gujarat Titans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ipl-2025-rahul-dravid-vvs-laxman-2717507-2025-04-30",
      "headline": "From tears to triumph: How VVS Laxman groomed IPL prodigy Vaibhav SuryavanshiVaibhav Suryavanshi's personal coach Manish Ojha revealed how VVS Laxman played a key role in Vaibhav Suryavanshi's career. Ojha revealed that Laxman recommended Rahul Dravid to have a look at the young batter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-azharuddin-name-removal-stay-uppal-stadium-telangana-high-court-2717503-2025-04-30",
      "headline": "Telangana High Court stays removal of Azharuddin's name from Uppal StadiumThe Telangana High Court has put a stay on the decision to remove Mohammed Azharuddin's name from the north stand at the Uppal stadium. HCA Ombudsman Justice Eswaraiah ordered the removal of Azharuddin's name from the stand earlier in the month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-top-youngest-sporting-stars-in-world-2717466-2025-04-30",
      "headline": "Vaibhav Suryavanshi and 5 other teenage sporting prodigies who made a big splashVaibhav Suryavanshi made himself a household name with a sensational IPL hundred at the ridiculous age of 14 years old. Here is a list of some of the youngest talents in the world who found recognition at a very young age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-vaibhav-suryavanshi-priyansh-arya-top-young-batters-2717456-2025-04-30",
      "headline": "Rare ball-hitting talents: Manjrekar names his top young battersThe new generation of power-hitters in the IPL has impressed former cricketer Sanjay Manjrekar. In his column, Manjrekar has named his top young batters this season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-vaibhav-suryavasnhi-hundred-oscar-piastri-formula-one-2717451-2025-04-30",
      "headline": "Vaibhav Suryavanshi maiden IPL hundred: F1 driver Oscar Piastri praises RR batterFormula One driver Oscar Piastri heaped praise on Vaibhav Suryavanshi after his record-breaking hundred against GT. Suryavanshi shattered many records and his efforts pleased Piastri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-brother-sanjay-manjrekar-jibe-rcb-2717424-2025-04-30",
      "headline": "Virat Kohli's brother takes a dig at Sanjay Manjrekar after IPL strike-rate talkVirat Kohli's brother has taken a jibe at Sanjay Manjrekar after his talk about strike-rates in IPL 2025. Manjrekar has been praising the young batters for their fearless approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-azharuddin-name-removal-stay-uppal-stadium-telangana-high-court-2717503-2025-04-30",
      "headline": "Telangana High Court stays removal of Azharuddin's name from Uppal StadiumThe Telangana High Court has put a stay on the decision to remove Mohammed Azharuddin's name from the north stand at the Uppal stadium. HCA Ombudsman Justice Eswaraiah ordered the removal of Azharuddin's name from the stand earlier in the month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-top-youngest-sporting-stars-in-world-2717466-2025-04-30",
      "headline": "Vaibhav Suryavanshi and 5 other teenage sporting prodigies who made a big splashVaibhav Suryavanshi made himself a household name with a sensational IPL hundred at the ridiculous age of 14 years old. Here is a list of some of the youngest talents in the world who found recognition at a very young age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-vaibhav-suryavanshi-priyansh-arya-top-young-batters-2717456-2025-04-30",
      "headline": "Rare ball-hitting talents: Manjrekar names his top young battersThe new generation of power-hitters in the IPL has impressed former cricketer Sanjay Manjrekar. In his column, Manjrekar has named his top young batters this season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-vaibhav-suryavasnhi-hundred-oscar-piastri-formula-one-2717451-2025-04-30",
      "headline": "Vaibhav Suryavanshi maiden IPL hundred: F1 driver Oscar Piastri praises RR batterFormula One driver Oscar Piastri heaped praise on Vaibhav Suryavanshi after his record-breaking hundred against GT. Suryavanshi shattered many records and his efforts pleased Piastri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-brother-sanjay-manjrekar-jibe-rcb-2717424-2025-04-30",
      "headline": "Virat Kohli's brother takes a dig at Sanjay Manjrekar after IPL strike-rate talkVirat Kohli's brother has taken a jibe at Sanjay Manjrekar after his talk about strike-rates in IPL 2025. Manjrekar has been praising the young batters for their fearless approach. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}