{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-friday-2025-stock-market-holiday-sensex-nifty-closed-no-trading-today-april-18-nse-bse-2710808-2025-04-18",
      "headline": "Good Friday 2025: Are Sensex and Nifty closed for trading today?This week has been a short one for stock market participants. The markets opened only for three days, from April 15 to April 17. They were shut on Monday, April 14, in observance of Dr. Baba Saheb Ambedkar Jayanti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-you-should-watch-court-state-vs-a-nobody-priyadarshi-pulikonda-nani-2711037-2025-04-18",
      "headline": "Why Telugu courtroom drama 'Court' deserves your undivided attention'Court - State vs. A Nobody' on Netflix is a gripping Telugu film that delves deep into the harsh realities of love and societal biases. It powerfully portrays the misuse of the POCSO Act while highlighting class divides, making it a thought-provoking watch that lingers long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crushology-101-review-roh-jeong-eui-k-drama-is-no-stress-high-flirt-2711096-2025-04-18",
      "headline": "Crushology 101 review: Roh Jeong-eui's K-drama is all flirt, no stressReleased-Mon Apr 14, 2025Crushology 101 review: 'Crushology 101' brings back the classic K-drama rom-com vibe with its light-hearted plot and charming characters, making it a perfect escape from intense drama, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-hero-academia-youre-next-ott-release-when-where-to-watch-upcoming-film-2711064-2025-04-18",
      "headline": "My Hero Academia You're Next OTT release: When, where to watch upcoming film'My Hero Academia: You're Next' hits Netflix India on April 20, 2025. The anime film follows Izuku Midoriya post-UA Traitor arc as he faces a new villain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-enjoy-evening-shikhar-dhawan-and-his-rumoured-girlfriend-2711078-2025-04-18",
      "headline": "Aamir Khan-Gauri enjoy evening with Shikhar Dhawan and his rumoured girlfriendAamir Khan and Gauri Sgirlfind pratt enjoyed an evening with cricketer Shikhar Dhawan and his rumoured girlfriend Sophie Shine. A picture from their outing has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/salman-khan-we-fell-in-love-with-chal-mere-bhai-re-release-2710928-2025-04-18",
      "headline": "The Salman Khan we fell in love with: A rewatch, a reminder, and a quiet longingSalman Khan's re-release of 'Chal Mere Bhai' rekindles nostalgia, showcasing his effortless charm and iconic presence that once captivated audiences. As fans reminisce about the actor's authentic performances, they yearn for a revival of the Salman who connected deeply with viewers, beyond the spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-gosling-led-star-wars-starfighter-set-for-memorial-day-2027-release-glbs-2711068-2025-04-18",
      "headline": "Ryan Gosling-led Star Wars Starfighter set for Memorial Day 2027 releaseRyan Gosling stars in Star Wars: Starfighter, a new standalone film directed by Shawn Levy, set to hit theatres on May 28, 2027. Unveiled at Star Wars Celebration 2025, the movie promises fresh characters and epic adventure beyond the Skywalker saga.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-review-akshay-kumar-leads-indias-humble-roar-for-apology-in-important-film-2711041-2025-04-18",
      "headline": "Kesari 2 review: Akshay Kumar leads India's humble roar for apology in important filmReleased-Fri Apr 18, 2025'Kesari Chapter 2' tells you that you've mourned enough. Set in the aftermath of the Jallianwala Bagh massacre, the Akshay Kumar-led film stirs your emotions by demanding an apology from the British Empire that is due for over 106 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-announces-debut-solo-world-tour-everything-you-need-to-know-cities-tickets-2711016-2025-04-18",
      "headline": "BTS Jin announces debut solo world tour: Everything you need to knowBTS member Jin is set to launch a solo world tour following his new album 'Echo'. The tour will start in South Korea this June and cover multiple countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kull-teaser-nimrat-kaur-ridhi-dogra-star-in-a-tale-of-betrayal-mind-games-2711008-2025-04-18",
      "headline": "Kull teaser: Nimrat Kaur, Ridhi Dogra star in a tale of betrayal, mind gamesNimrat Kaur and Ridhi Dogra starrer 'Kull' teaser is out. The JioHotstar Special will premiere on May 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gopichand-malineni-reacts-to-online-trolling-amid-jaat-controversy-randeep-hooda-sunny-deol-2710924-2025-04-18",
      "headline": "Jaat director Gopichand Malineni reacts to online trolling amid controversy'Jaat' director Gopchant Malineni, in an exclusive interview with India Today, spoke about actors being subjected to online trolling amid the film's ongoing controversy. He shared his views on the film's sequel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-simbu-mani-ratnam-kamal-haasan-thug-life-2710971-2025-04-18",
      "headline": "Actors Trisha, Simbu discuss reuniting for Thug Life after 15 years. WatchActors Trisha and Simbu have reunited for Mani Ratnam's 'Thug Life'. The two, who worked in 'Vinnaithaandi Varuvaayaa', are coming together after 15 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaideep-ahlawat-on-comparisons-with-irrfan-its-a-very-personal-feeling-exclusive-2710977-2025-04-18",
      "headline": "Jaideep Ahlawat on comparisons with Irrfan: It's a very personal feeling | ExclusiveJaideep Ahlawat, in an exclusive interview, shares his thoughts on being compared to the late Irrfan, expressing a mix of honour and responsibility while discussing his role in the upcoming Netflix film, 'Jewel Thief.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mizuki-itagaki-japanese-actor-found-dead-at-24-after-missing-for-3-months-2710964-2025-04-18",
      "headline": "Mizuki Itagaki, Japanese actor missing for 3 months, found dead at 24Japanese actor Mizuki Itagaki, who had been missing for three months, has been found dead at the age of 24. The family shared the news in a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sister-midnight-radhika-apte-new-poster-out-fans-are-reminded-of-taxi-driver-2710915-2025-04-18",
      "headline": "Sister Midnight: Radhika Apte's new poster out, fans are reminded of Taxi DriverThe makers of the upcoming film 'Sister Midnight' unveiled an intriguing poster of actor Radhika Apte. Excited fans quickly noted the resemblance to the poster of the 1976 hit 'Taxi Driver'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-k-balachander-thug-life-2710913-2025-04-18",
      "headline": "Kamal Haasan says Mani Ratnam reminds him of K Balachander at Thug Life eventKamal Haasan, speaking at the 'Thug Life' event in Chennai, spoke about his association with director Mani Ratnam. He said that Ratnam's work style reminds him of his guru and legendary Tamil director, K Balachander."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sinners-review-michael-b-jordan-gripping-vampire-drama-2710879-2025-04-18",
      "headline": "Sinners review: Michael B Jordan's twin engine roars loud in this gripping vampire dramaReleased-Fri Apr 18, 2025Sinners movie review: Michael B Jordan delivers a captivating performance in Ryan Coogler's 'Sinners,' where he plays the Smokestack twins in a 1930s vampire drama. Coogler creates a suspenseful and dramatic narrative enriched with music and unexpected twists, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-rasha-thadani-enjoy-ipl-match-together-veer-pahariya-joins-2710894-2025-04-18",
      "headline": "Ibrahim Ali Khan, Rasha Thadani enjoy IPL match together, Veer Pahariya joinsActors Ibrahim Ali Khan and Rasha Thadani were clicked together, enjoying the IPL match in Mumbai. They were also joined by Veer Pahariya."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vincy-aloshious-withdraws-complaint-against-shine-tom-chacko-requests-anonymity-2710884-2025-04-18",
      "headline": "Malayalam actor retracts complaint against Shine Tom Chacko, requests anonymityMalayalam actor Vincy Aloshious has reportedly decided to withdraw her complaint against fellow actor Shine Tom Chacko. She had accused her co-star of using drugs on set and misbehaving with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/adolesence-court-state-vs-nobody-nani-priyadarshi-2710525-2025-04-18",
      "headline": "Liked Adolescence? Telugu film Court has important message, pertinent in IndiaIf you liked Netflix's 'Adolescence', which talked about teenage sexuality and alpha male syndrome, here's a Telugu film, Court: State vs A Nobody, that talks about the POCSO Act. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kapil-sibal-president-personal-right-jagdeep-dhankhar-judiciary-2711117-2025-04-18",
      "headline": "If executive not doing its job...: Kapil Sibal on Vice President's judiciary remarkKapil Sibal launched a scathing criticism of Vice President Jagdeep Dhankhar over his remark that the judiciary cannot become a 'super parliament' and direct the President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-elon-musk-donald-trump-collaboration-speaks-technology-innovation-2710965-2025-04-18",
      "headline": "PM speaks to Elon Musk ahead of Tesla's India entry, discusses tech, innovationPM Modi and Elon Musk discussed a wide range of topics, building upon their earlier meeting in Washington DC earlier this year. The conversation highlighted the growing synergy between India's rapidly evolving tech ecosystem and Musk's ventures in cutting-edge innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-shrivastava-appointed-revenue-secretary-2711124-2025-04-18",
      "headline": "Bureaucratic reshuffle at government departments, new Revenue Secretary appointedSenior bureaucrat Arvind Shrivastava, a 1994 batch Karnataka cadre Indian Administrative Service (IAS) officer, has been appointed as the new Revenue Secretary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-fund-cuts-us-harvard-university-striking-very-idea-international-students-american-education-2711045-2025-04-18",
      "headline": "Trump is striking at the very idea of Harvard, its international studentsPresident Donald Trump is out with a sledgehammer and striking at the very core of Harvard University, an institution older than the USA. Harvard has been synonymous with American education, politics and society. The reason why Harvard is world-class is that it attracts the world's best brains. That's what Trump is seeking to pull the plug on.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-review-akshay-kumar-leads-indias-humble-roar-for-apology-in-important-film-2711041-2025-04-18",
      "headline": "Kesari 2 review: Akshay Kumar leads India's humble roar for apology in important filmReleased-Fri Apr 18, 2025'Kesari Chapter 2' tells you that you've mourned enough. Set in the aftermath of the Jallianwala Bagh massacre, the Akshay Kumar-led film stirs your emotions by demanding an apology from the British Empire that is due for over 106 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-peace-deal-us-abandon-if-no-clear-signs-of-progress-marco-rubio-donald-trump-other-priorities-ultimatum-2710962-2025-04-18",
      "headline": "US ultimatum on Russia-Ukraine peace deal: Will move on if no progress madeUS Secretary of State Marco Rubio warned that peace efforts between Russia and Ukraine may be halted soon if no progress is seen.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-woman-kills-two-sons-with-coconut-chopping-axe-jumps-to-death-2711067-2025-04-18",
      "headline": "Genetic eye disorder passed to sons, Hyderabad mother kills them, jumps to deathA woman, Tejaswini, killed her two young sons and then jumped to her death in Hyderabad. She also left a suicide note explaining her actions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-raps-madhya-pradesh-high-court-for-denying-convict-bail-under-new-law-2711103-2025-04-18",
      "headline": "Supreme Court raps High Court for refusing bail: 'You invented new law'The court said that a convict should be granted bail if there was no chance of appeal against conviction being heard in the near future in the high courts due to a huge pendency of cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-you-should-watch-court-state-vs-a-nobody-priyadarshi-pulikonda-nani-2711037-2025-04-18",
      "headline": "Why Telugu courtroom drama 'Court' deserves your undivided attention'Court - State vs. A Nobody' on Netflix is a gripping Telugu film that delves deep into the harsh realities of love and societal biases. It powerfully portrays the misuse of the POCSO Act while highlighting class divides, making it a thought-provoking watch that lingers long after the credits roll."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-rohith-vemula-act-rahul-gandhi-caste-discrimination-education-2711111-2025-04-18",
      "headline": "Siddaramaiah backs Rahul Gandhi's call, vows 'Rohith Vemula Act' in KarnatakaAfter Rahul Gandhi's appeal to end caste-based discrimination in education, Karnataka Chief Minister Siddaramaiah has pledged to bring the Rohith Vemula Act at the earliest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/harvard-university-increase-in-donations-alumni-trump-fund-freeze-2711069-2025-04-18",
      "headline": "Harvard's Trump defiance sees donor surge, gets $1 million in 24 hoursIn the 24 hours after Harvard's president said he wouldn't buckle to Trump's demands, the prestigious university received 4,000 donations totalling $1.14 million."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/350-pedapadu-village-residents-asr-district-get-slippers-from-ap-deputy-cm-pawan-kalyan-2711115-2025-04-18",
      "headline": "Pawan Kalyan sends footwear to entire Andhra village after seeing barefoot womenDuring a visit to Pedapadu village, Andhra Pradesh Deputy Chief Minister Pawan Kalyan arranged slippers for 350 barefoot residents after noticing many villagers didn't have footwear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-athiya-shetty-reveal-daughter-evaaran-name-meaning-2711027-2025-04-18",
      "headline": "KL Rahul, Athiya Shetty reveal name of daughter. Meaning explainedKL Rahul and Athiya Shetty have revealed the name of their daughter. The duo have named their child Evaarah Vipula Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/why-indian-parents-are-torn-between-cbse-and-international-boards-2711033-2025-04-18",
      "headline": "Why Indian parents are torn between CBSE and international boardsIn the past ten years, India has witnessed a 300% growth in IB and Cambridge schools, particularly in urban areas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himachal-pradesh-chief-secretary-prabodh-saxena-holi-party-bill-controversy-2710926-2025-04-18",
      "headline": "Himachal top bureaucrat's Holi bash cost Rs 1.22 lakh, he asks government to payHimachal Pradesh chief secretary's Holi party has sparked outrage among retired IAS officers, who are questioning the use of taxpayer money for a 'personal event'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-says-raising-daughters-in-india-is-a-revolution-viral-linkedin-post-2711107-2025-04-18",
      "headline": "Raising daughters in India is a revolution: Bengaluru man's powerful post goes viralA Bengaluru man's heartfelt note on parenting his daughters has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/female-genital-mutilation-health-impact-childbirth-risk-menstural-pain-depression-anxiety-sex-who-un-study-2711108-2025-04-18",
      "headline": "Painful sex, anxiety: WHO study exposes harsh toll of female genital mutilationFemale genital mutilation causes lifelong health and psychological harm, including pain, infections, childbirth risks, and trauma. A WHO study urges global action to prevent and treat its devastating effects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/soviet-ussr-factory-worker-valentina-tereshkova-first-woman-in-space-60-years-before-katy-perry-blue-origins-new-shepard-2710856-2025-04-18",
      "headline": "Secret hobby helped in first woman astronaut's safe return after 3 days in spaceSixty years before pop star Katy Perry's 10-minute spaceflight, a factory worker from the Soviet Union created history, becoming the first woman in space. In 1963, Valentina Tereshkova, who worked in textile and tyre factories, went into space on a solo mission that lasted three days. Tereshkova's secret hobby helped her land back safely after orbiting the earth 48 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mark-zuckerberg-explains-why-he-feels-facebook-is-losing-its-relevance-2711121-2025-04-18",
      "headline": "Mark Zuckerberg explains why he feels Facebook is losing its relevanceMeta CEO Mark Zuckerberg appears to have been grappling with Facebook's fading cultural impact for quite some time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/salman-khan-we-fell-in-love-with-chal-mere-bhai-re-release-2710928-2025-04-18",
      "headline": "The Salman Khan we fell in love with: A rewatch, a reminder, and a quiet longingSalman Khan's re-release of 'Chal Mere Bhai' rekindles nostalgia, showcasing his effortless charm and iconic presence that once captivated audiences. As fans reminisce about the actor's authentic performances, they yearn for a revival of the Salman who connected deeply with viewers, beyond the spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gangster-happy-passia-punjab-grenade-attack-detained-in-us-exclusive-2710722-2025-04-17",
      "headline": "Terrorist behind Punjab attacks arrested in US, to be extradited to India: SourcesHappy Passia was carrying a Rs 5 lakh reward announced by the National Investigation Agency (NIA) and had become a major headache for both Punjab Police and central intelligence units. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-agent-naresh-kumar-helped-indians-enter-us-dunki-route-arrested-delhi-airport-2711110-2025-04-18",
      "headline": "Punjab agent who helped Indians enter US illegally arrested at Delhi airportThe accused, identified as Naresh Kumar, a resident of Matoulli village in Punjab's Patiala, was apprehended following the deportation of an Indian passenger from the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-man-bludgeons-mother-to-death-injures-wife-over-rs-200-to-buy-dog-2711055-2025-04-18",
      "headline": "Chhattisgarh man kills mother with hammer, injures wife over Rs 200 to buy dogA 45-year-old man asked his mother for Rs 200 to buy a dog. When she refused, he attacked her with a hammer and killed her. His wife was injured when she tried to intervene."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-babar-azam-virat-kohli-karachi-kings-viv-richards-2711105-2025-04-18",
      "headline": "Babar Azam will become a bigger player than Virat Kohli: Karachi Kings ownerPSL 2025: Karachi Kings owner Salman Iqbal backed Babar Azam to make a strong comeback and become a bigger player than Virat Kohli. Babar is currently playing for Peshawar Zalmi and has scored one run from two matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-rohit-sharma-form-mark-boucher-2711100-2025-04-18",
      "headline": "Rohit Sharma looking in the zone, big score coming soon: Mark BoucherFormer MI coach Mark Boucher has said that Rohit Sharma is looking in the zone and a big score is coming soon for the opener. Rohit showed some form during his knock in the win over SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-fifa-world-cup-2026-news-2711095-2025-04-18",
      "headline": "Will Lionel Messi play 2026 FIFA World Cup? Argentina legend clarifiesLegendary Lionel Messi has opened up on the chances of him playing the FIFA World Cup 2026. Messi has said that he has not set any goals for himself and his participation would depend on his fitness.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-srh-ipl-2025-airport-2711054-2025-04-18",
      "headline": "Pat Cummins leaving IPL 2025? Airport photo has fans in frenzySunRisers Hyderabad captain Pat Cummins is leaving IPL midway through the season? Cummins' wife's Instagram story had the fans in a frenzy after the match vs Mumbai Indians.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-sign-dewald-brevis-injury-replacement-2711052-2025-04-18",
      "headline": "IPL 2025: Chennai Super Kings sign Dewald Brevis as injury replacementChennai Super Kings have roped in South Africa batter Dewald Brevis as an injury replacement for Gurjapneet Singh for the ongoing IPL 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-athiya-shetty-reveal-daughter-evaaran-name-meaning-2711027-2025-04-18",
      "headline": "KL Rahul, Athiya Shetty reveal name of daughter. Meaning explainedKL Rahul and Athiya Shetty have revealed the name of their daughter. The duo have named their child Evaarah Vipula Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-chennai-super-kings-hints-cryptic-post-yellow-2711023-2025-04-18",
      "headline": "Dewald Brevis to CSK? Baby AB's Instagram post has fans buzzingDewald Brevis has got fans excited by sparking speculation around him potentially joining the Chennai Super Kings for IPL 2025 with his recent Instagram post. Brevis can fill CSK's remaining overseas slot for the rest of the ongoing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-2025-match-preview-predicted-11s-team-news-pitch-report-2710981-2025-04-18",
      "headline": "After historic defence vs KKR, can Punjab gun down RCB in Chinnaswamy?Punjab Kings have travelled to Bengaluru to play their 7th game of the season. Both sides have 8 points from 6 games and would be attempting to pull clear towards the top of the table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-mumbai-indians-batter-will-jacks-press-conference-2710972-2025-04-18",
      "headline": "Coach Mahela wants me to go and express myself: Will Jacks happy after SRH winMumbai Indians' all-rounder Will Jacks credited coach Mahela Jayawardene after starring in an all-round performance as the hosts defeated Sunrisers Hyderabad by four wickets in their IPL 2025 clash on Thursday.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-brendon-mccullum-158-carnival-new-era-indian-premier-league-2710893-2025-04-18",
      "headline": "IPL turns 18: When Brendon McCullum's record 158 kickstarted cricket's new eraThe Indian Premier League started in 2008 with KKR opener Brendon McCullum lighting up the M. Chinnaswamy Stadium with an unforgettable 158* off just 73 deliveries, smashing ten fours and thirteen sixes against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-captaincy-calm-bhuvneshwar-kumar-2710909-2025-04-18",
      "headline": "Calm Rajat Patidar has been superb with RCB captaincy: Bhuvneshwar KumarIPL 2025: Bhuvneshwar Kumar heaped praise on Rajat Patidar's RCB captaincy and said that the MP batter remains calm irrespective of the results. Patidar has been sensational as RCB skipper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-chennai-super-kings-hints-cryptic-post-yellow-2711023-2025-04-18",
      "headline": "Dewald Brevis to CSK? Baby AB's Instagram post has fans buzzingDewald Brevis has got fans excited by sparking speculation around him potentially joining the Chennai Super Kings for IPL 2025 with his recent Instagram post. Brevis can fill CSK's remaining overseas slot for the rest of the ongoing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-pbks-ipl-2025-match-preview-predicted-11s-team-news-pitch-report-2710981-2025-04-18",
      "headline": "After historic defence vs KKR, can Punjab gun down RCB in Chinnaswamy?Punjab Kings have travelled to Bengaluru to play their 7th game of the season. Both sides have 8 points from 6 games and would be attempting to pull clear towards the top of the table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-srh-mumbai-indians-batter-will-jacks-press-conference-2710972-2025-04-18",
      "headline": "Coach Mahela wants me to go and express myself: Will Jacks happy after SRH winMumbai Indians' all-rounder Will Jacks credited coach Mahela Jayawardene after starring in an all-round performance as the hosts defeated Sunrisers Hyderabad by four wickets in their IPL 2025 clash on Thursday.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-brendon-mccullum-158-carnival-new-era-indian-premier-league-2710893-2025-04-18",
      "headline": "IPL turns 18: When Brendon McCullum's record 158 kickstarted cricket's new eraThe Indian Premier League started in 2008 with KKR opener Brendon McCullum lighting up the M. Chinnaswamy Stadium with an unforgettable 158* off just 73 deliveries, smashing ten fours and thirteen sixes against Royal Challengers Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-rajat-patidar-captaincy-calm-bhuvneshwar-kumar-2710909-2025-04-18",
      "headline": "Calm Rajat Patidar has been superb with RCB captaincy: Bhuvneshwar KumarIPL 2025: Bhuvneshwar Kumar heaped praise on Rajat Patidar's RCB captaincy and said that the MP batter remains calm irrespective of the results. Patidar has been sensational as RCB skipper. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}