{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-stocks-drop-as-moodys-downgrades-outlook-for-7-entities-2640712-2024-11-26",
      "headline": "Adani stocks drop as Moody's downgrades outlook for 7 entitiesShares of Adani Group stocks dropped during Tuesday's session after Moody's downgraded the outlook for seven of its companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-on-china-can-india-gain-import-duty-explained-experts-factors-exports-2640315-2024-11-26",
      "headline": "Will India gain as Trump points tariff bazooka at China?US President-elect Donald Trump has announced punitive tariff measures against China, Canada and Mexico. Will India be able to overcome its challenges and seize this opportunity? This is what experts say.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/youth-unemployment-in-india-at-102-percent-says-union-labour-minister-shobha-karandlaje-2640498-2024-11-26",
      "headline": "Youth unemployment in India at 10.2%, says Union Labour ministerA report by the International Labour Organisation's (ILO) Institute for Human Development (IHD) shows the worldwide youth unemployment rate was 15.6% in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-listing-date-share-price-latest-gmp-market-debut-strong-or-muted-expert-view-2640484-2024-11-26",
      "headline": "NTPC Green Energy listing: What does latest GMP signal ahead of market debut? NTPC Green Energy listing: Shares of NTPC Green Energy Limited will make their debut on Dalal Sreet on Wednesday with investors eyeing a strong opening on the stock exchanges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-lower-adani-green-shares-down-7-percent-moody-ratings-2640430-2024-11-26",
      "headline": "Sensex, Nifty end marginally lower; Adani Green shares down 7%The S&P BSE Sensex was down 105.79 points to 80,004.06, while the NSE Nifty50 lost 27.40 points to 24,194.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/moody-ratings-downgrade-negative-adani-group-7-firms-adani-green-apsez-2640389-2024-11-26",
      "headline": "More trouble for Adani Group as Moody's downgrades outlook for 7 firmsThe downgrade comes in the wake of legal troubles involving Gautam Adani, the chairman of Adani Group, and his associates after charges of bribery by US authorities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-ceo-deepinder-goyal-forgoes-rs-35-crore-salary-till-fy26-2640358-2024-11-26",
      "headline": "Zomato CEO Deepinder Goyal forgoes Rs 3.5 crore salary till FY26Despite waiving his salary, Goyal will continue to serve as Zomato's Managing Director (MD) and CEO, fulfilling all his responsibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-under-scrutiny-again-government-launches-new-investigation-into-finances-2640327-2024-11-26",
      "headline": "Byju's under scrutiny again: Government launches new investigation into financesByjus News: The probe aims to determine if the company misrepresented its financial statements or if funds were improperly diverted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-global-deals-at-risk-countries-france-sri-lanka-bangladesh-kenya-reaction-bribery-charges-2640280-2024-11-26",
      "headline": "Adani Group deals at risk: How countries have reacted after bribery chargesAdani Bribery Case: The recent bribery charges by US authorities, made public last week, have led to several countries revisiting or cancelling deals with the group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-total-energies-france-oil-major-pauses-investment-clarifies-no-new-financial-commitment-talks-2640297-2024-11-26",
      "headline": "Adani Green clarifies on French oil major's 'pausing new funding' messageThe statement by Adani Green Energy came a day after TotalEnergies said it was pausing new investments into the Adani Group over US bribery charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-shares-jump-18-percent-today-mtnl-telecom-sector-stocks-bharti-airtel-bank-guarantees-waiver-2640201-2024-11-26",
      "headline": "Explained: Why Vodafone Idea shares jumped 18% todayVodafone Idea Share Price: Vodafone Idea, MTNL shares rise: An announcement from the Department of Telecommunications (DoT) to provide relief to telecom operators resulted in a surge for telecom sector stocks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shashi-ruia-essar-group-co-founder-dies-at-81-2640173-2024-11-26",
      "headline": "Essar Group co-founder Shashi Ruia dies at 81Shashi Ruia Death: The Ruia family described Shashi Ruia's legacy as a guiding light for future generations, vowing to uphold the values and vision he championed throughout his life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-extend-gains-but-earnings-concerns-loom-infosys-gains-2-percent-2640159-2024-11-26",
      "headline": "Sensex, Nifty extend gains but earnings concerns loom; Infosys gains 2% Sensex Today: The S&P BSE Sensex was up 238.80 points to 80,348.65, while the NSE Nifty50 added 79.70 points to 24,301.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-admitted-to-chennais-apollo-hospital-health-concern-2640149-2024-11-26",
      "headline": "RBI Governor Shaktikanta Das admitted to Chennai's Apollo Hospital: SourcesRBI Governor Shaktikanta Das was admitted to Chennai's Apollo Hospital after he experienced acidity and is currently under observation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/totalenergies-pauses-business-with-adani-group-amid-us-bribery-corruption-charges-2639807-2024-11-25",
      "headline": "TotalEnergies pauses business with Adani Group amid bribery rowTotalEnergies has paused new financial investments in the Adani Group amid corruption allegations against Adani Green Energy executives, emphasising its zero-tolerance policy on misconduct. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-shares-tank-11-percent-today-totalenergies-halts-investments-2639749-2024-11-25",
      "headline": "Adani Green Energy shares tank 11% today. Here's why Adani Green Energy share price: Adani Green Energy shares dropped 11% after TotalEnergies made a crucial announcement during late trading hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-higher-amid-bull-run-adani-green-shares-down-9-percent-2639732-2024-11-25",
      "headline": "Sensex, Nifty close higher amid market rally, Adani Green shares down 9% The S&P BSE Sensex added 992.84 points to end at 80,109.85, while the NSE Nfity50 gained 314.65 points to close at 24,221.90. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cng-price-hiked-by-rs-2-in-mumbai-other-cities-election-bound-delhi-spared-2639723-2024-11-25",
      "headline": "CNG prices hiked by Rs 2 in Mumbai, other cities; election bound-Delhi sparedPrices were hiked in Noida, Greater Noida, Ghaziabad, Gurugram and other cities but Delhi, which goes to polls in a few weeks from now, was spared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-listing-date-share-price-strong-market-debut-or-muted-listing-expert-view-2639668-2024-11-25",
      "headline": "NTPC Green Energy IPO share price: Strong debut on D-Street or muted listing? NTPC Green Energy IPO listing: Shares of NTPC Green Energy Limited are expected to make its debut on the stock exchanges on Wednesday after having been subscribed over 200%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-rise-energy-solutions-enterprises-port-sez-gautam-adani-bribery-market-rally-2639576-2024-11-25",
      "headline": "Adani Group shares rise for 2nd straight session: 2 reasons behind bull runAdani group stocks: Adani stocks continued their upward movement, with Adani Energy Solutions being among the top performers. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-ceasefire-hezbollah-ceasefire-deal-benjamin-netanyahu-warning-lebanon-us-france-take-effect-2640740-2024-11-26",
      "headline": "Israel-Hezbollah ceasefire comes into effect with a warning from NetanyahuAfter approval by Israel's security cabinet, French President Emmanuel Macron and his US counterpart issued a joint statement, committing both nations to work with Israel and Lebanon to ensure that the ceasefire deal gets fully implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-devendra-fadnavis-eknath-shinde-sena-maharashtra-chief-minister-dillemma-mahayuti-mva-ajit-pawar-ncp-2640771-2024-11-27",
      "headline": "BJP firm on Devendra Fadnavis, Eknath Shinde may have to swallow bitter pillDays after the Mahayuti secured a thumping win in Maharashtra, the alliance wasn't able to reach a consensus on the chief ministerial face yet. The BJP remained firm on Devendra Fadnavis for the top post, while Shiv Sena clamoured for Eknath Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dy-chandrachud-former-cji-supreme-court-maharashtra-assembly-polls-maha-vikas-aghadi-sanjay-raut-shiv-sena-ubt-2640633-2024-11-26",
      "headline": "Will a party decide priority of Supreme Court cases? Ex-CJI on Sanjay Raut's remarkFormer chief justice DY Chandrachud said that the Supreme Court \"refused to be dictated by any third party\" on the cases to be decided during his tenure as the chief justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-protest-chinmoy-das-arrest-hindu-monk-clashes-police-dead-injured-2640713-2024-11-26",
      "headline": "Lawyer killed during protests to release arrested Hindu monk in Bangladesh: ReportSix others were injured in the clashes that erupted after Chattogram's Sixth Metropolitan Magistrate court denied bail to prominent Hindu leader Chinmoy Krishna Das Brahmachari, arrested on sedition charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jay-bhattacharya-kolkata-born-stanford-academic-covid-19-policy-critic-donald-trump-national-institutes-of-health-head-2640769-2024-11-27",
      "headline": "Stanford academic Jay Bhattacharya is Trump's pick to lead US health agencyThe National Institutes of Health director oversees 27 institutes and centres that conduct early stage research on everything from vaccines for emerging pandemic threats to targets for new drugs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-to-form-today-over-bay-of-bengal-tamil-nadu-on-high-alert-mk-stalin-calls-meeting-2640754-2024-11-27",
      "headline": "Cyclone Fengal approaches Tamil Nadu, heavy rain likely; schools, colleges shutThe weather department predicted that the deep depression over the Bay of Bengal would turn into a cyclonic storm on November 27 and is expected to impact parts of Tamil Nadu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-city-palace-clashes-lakshyaraj-singh-mewar-warns-bjp-mla-vishvaraj-singh-rajasthan-2640763-2024-11-27",
      "headline": "Udaipur feud spills as cousin warns BJP MLA: Can't force themselves into our homeAfter clashes in Udaipur, Lakshyaraj Singh Mewar warned his cousin and BJP MLA Vishvaraj Singh against misusing his power and position within the Rajasthan government to forcefully enter City Palace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mexico-announces-plan-to-impose-own-tariffs-following-us-president-elect-donald-trump-25-percent-tariff-threat-2640636-2024-11-26",
      "headline": "For every tariff, there'll be a response in kind: Mexico fires back after Trump's threatDonald Trump had threatened to impose a 25 percent tariff on Mexican goods if the flow of drugs from the country wasn't controlled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-michael-atherton-nasser-hussain-2640727-2024-11-26",
      "headline": "Jasprit Bumrah is a nightmare, thank goodness I didn't face him: Michael AthertonMichael Atherton and Nasser Hussain heaped praise on Jasprit Bumrah and admitted that they were happy not to face the Indian pacer during their respective playing careers. Bumrah led from the front in India's Perth Test win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestling-bajrang-punia-slapped-with-4-year-ban-for-violation-of-anti-doping-code-2640742-2024-11-26",
      "headline": "Bajrang Punia slapped with 4-year ban for violation of anti-doping codeOlympics bronze medallist Bajrang Punia has been handed a 4-year suspension by the National Anti-Doping Agency (NADA) for refusing to provide a urine sample during the selection trials for the national team. Bajrang was given a provisional suspension in April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/china-outreach-to-bangladesh-islamists-alarms-india-amid-anti-hindu-wave-opinion-2640608-2024-11-26",
      "headline": "China's outreach to Bangladesh Islamists alarms India amid anti-Hindu waveChina believes in engaging with those in power. They have no political favourites in Bangladesh or anywhere else, unlike India which has visibly enjoyed a special relationship with the Awami League and Sheikh Hasina for historical reasons and otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-sobhita-dhulipala-wedding-streaming-rights-sold-to-netflix-report-2640609-2024-11-26",
      "headline": "Naga Chaitanya-Sobhita's wedding streaming rights sold to Netflix: ReportActors Naga Chaitanya and Sobhita Dhulipala's wedding streaming rights have been reportedly sold to Netflix for Rs 50 crore. The couple is getting married on December 4 in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ex-bank-of-china-chairman-liu-liange-death-sentence-bribery-2640715-2024-11-26",
      "headline": "Ex-Bank of China chairman sentenced to death for accepting $16.8 million in bribesLiu Liange was sentenced to death with a two-year reprieve for corruption and illegal issuance of loans. He was found to have accepted bribes worth over 121 million yuan (USD 16.8 million), a court in Jinan city in China's eastern Shandong Province said in its verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/smokescreen-or-reality-the-truth-about-stubble-burning-in-punjab-2640663-2024-11-26",
      "headline": "Smokescreen or reality? The truth about stubble burning in PunjabIndia Today's investigation reveals a startling reality: Stubble burning hasn't disappeared; it's merely shifted to time windows and methods designed to evade detection.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mp-imran-masood-on-sambhal-violence-police-distorted-facts-involved-unrest-rahul-gandhi-to-visit-area-2640707-2024-11-26",
      "headline": "Congress MP on Sambhal violence: Police distorted facts, involved in unrestCongress MP Imran Masood said that Rahul Gandhi will visit Sambhal in the coming days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-on-how-she-learnt-about-her-autoimmune-disease-myositis-2640753-2024-11-27",
      "headline": "Samantha on how she learnt about her autoimmune diseaseActor Samantha recently opened up about her autoimmune disease, Myositis. She shared that she learnt about it after shooting for Karan Johar's Koffee with Karan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/silicone-patches-for-acne-and-anti-ageing-are-viral-but-do-they-work-2640489-2024-11-26",
      "headline": "Silicone patches for acne and anti-ageing are viral. But do they work?Initially developed for healing surgical scars and wounds, silicone tapes have now become a viral solution for various skin concerns like acne and wrinkles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-clashes-crisis-nia-kuki-meitei-conflict-investigation-home-ministry-2640508-2024-11-26",
      "headline": "Anti-terror agency files three cases linked to ongoing violence in ManipurThe NIA said in a release that it registered the three cases on November 13, after the Home Ministry handed over the investigations to the agency amid the escalating violence in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-election-result-mahayuti-kirtankars-warkaris-efforts-bjp-hindu-unity-rss-2640354-2024-11-26",
      "headline": "How kirtankars, Warkaris fuelled a silent tsunami for BJP in MaharashtraWhile political leaders are being credited for the landslide victory of the BJP-led Mahayuti in Maharashtra, Warkaris and kirtankars, who hold huge sway in Maratha society, and helped consolidate Hindu votes have gone unnoticed. This is how the elements of the Bhakti Movement brought about a silent movement by spreading the 'Hindu unity' message across Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-ipl-youngest-crorepati-rajasthan-royals-13-years-age-social-media-2640433-2024-11-26",
      "headline": "Vaibhav Suryavanshi hits IPL jackpot. What were you doing when you were 13?13-year-old Vaibhav Suryavanshi etched his name in the IPL record books by becoming the youngest crorepati after being bought by Rajasthan Royals for Rs 1.1 crore. It has prompted hilarious responses from people on their own less glamorous teen years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stubble-burning-why-subsidised-parali-tiller-machines-have-no-takers-2640677-2024-11-26",
      "headline": "Stubble burning: Why subsidised parali-tiller machines have no takersIndia Today's investigation found why most farmers have discarded the Super Seeder machines: Practical challenges render these machines ineffective – they require heavy-duty tractors to operate, besides the operational cost.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-on-china-can-india-gain-import-duty-explained-experts-factors-exports-2640315-2024-11-26",
      "headline": "Will India gain as Trump points tariff bazooka at China?US President-elect Donald Trump has announced punitive tariff measures against China, Canada and Mexico. Will India be able to overcome its challenges and seize this opportunity? This is what experts say.   "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/77-year-old-mumbai-woman-loses-rs-4-crore-whatsapp-call-then-month-long-digital-arrest-2640590-2024-11-26",
      "headline": "WhatsApp call, then month-long 'digital arrest': How Mumbai woman lost Rs 4 croreThe ordeal began when the woman received a WhatsApp call claiming that a parcel she had allegedly sent to Taiwan had been intercepted by authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/freedom-at-midnight-criticises-jinnah-politics-gandhi-nehru-patel-say-writers-exclusive-2640413-2024-11-27",
      "headline": "Exclusive: Freedom at Midnight criticises Jinnah's politics, not him, say writersSonyLIV's Freedom at Night dives into India's Partition, exploring historical figures like Jawaharlal Nehru, Mahatma Gandhi and Mohammed Ali Jinnah. Writers discuss the creative challenges, nuanced portrayals, and plans for Season 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/viduthalai-2-trailer-review-vijay-sethupathi-soori-liberation-vetri-maaran-2640775-2024-11-27",
      "headline": "Viduthalai 2 trailer: Vijay Sethupathi fights for liberation in Vetri Maaran filmThe trailer of director Vetri Maaran's much-awaited film, Viduthalai 2, was released on November 26. The film is all set to hit theatres on December 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/samantha-on-how-she-learnt-about-her-autoimmune-disease-myositis-2640753-2024-11-27",
      "headline": "Samantha on how she learnt about her autoimmune diseaseActor Samantha recently opened up about her autoimmune disease, Myositis. She shared that she learnt about it after shooting for Karan Johar's Koffee with Karan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-elderly-man-paparazzi-viral-video-2640744-2024-11-27",
      "headline": "Sara Ali Khan surprised as elderly man protects her from papsDuring a recent outing in Mumbai, actor Sara Ali Khan received unexpected protection from an elderly man against the paparazzi. The heartwarming gesture has been widely appreciated by fans and social media users."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Explained: How ever-evolving Virat Kohli silenced doubters in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-ravi-shastri-2640774-2024-11-27",
      "headline": "Bumrah enjoys the responsibility of captaincy: Ravi Shastri AUS vs IND: Jasprit Bumrah drew praise from Wasim Akram and Ravi Shastri for his match-winning performance in the Perth Test which India won by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-venkatesh-iyer-kkr-captaincy-conundrum-ipl-2025-mega-auction-2640770-2024-11-27",
      "headline": "Beyond Venkatesh Iyer: KKR face captaincy conundrum despite impressive IPL auctionDespite an impressive IPL 2025 Auction, KKR does seem to have a captaincy hole to fill in their new-look squad. While Venkatesh Iyer seems to be the main candidate, he may not be the only choice they have in their ranks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/world-chess-championship-final-d-gukesh-ding-liren-game-two-draw-analysis-2640751-2024-11-27",
      "headline": "Analysis: How D Gukesh held Ding Liren to draw with black pieces in Game 2Indian Grandmaster D. Gukesh demonstrated resilience by securing a draw in the second game against reigning champion Ding Liren in the ongoing World Chess Championship on Tuesday. The game, largely uneventful, saw Gukesh, playing with black pieces, recover composure following his loss in the opening game due to a critical blunder in the French Defense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestling-bajrang-punia-slapped-with-4-year-ban-for-violation-of-anti-doping-code-2640742-2024-11-26",
      "headline": "Bajrang Punia slapped with 4-year ban for violation of anti-doping codeOlympics bronze medallist Bajrang Punia has been handed a 4-year suspension by the National Anti-Doping Agency (NADA) for refusing to provide a urine sample during the selection trials for the national team. Bajrang was given a provisional suspension in April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-michael-atherton-nasser-hussain-2640727-2024-11-26",
      "headline": "Jasprit Bumrah is a nightmare, thank goodness I didn't face him: Michael AthertonMichael Atherton and Nasser Hussain heaped praise on Jasprit Bumrah and admitted that they were happy not to face the Indian pacer during their respective playing careers. Bumrah led from the front in India's Perth Test win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-championship-d-gukesh-second-game-draw-ding-liren-2640678-2024-11-26",
      "headline": "World Chess Championship: D Gukesh hopeful of 'more good days' after drawIndian chess Grandmaster D Gukesh is hoping that more good days will follow as he was able to draw the second game of the World Chess Championship against Ding Liren on Tuesday, November 26.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-tour-of-pakistan-cricket-team-leave-midway-political-protests-2640673-2024-11-26",
      "headline": "Sri Lanka A cricket team to leave Pakistan tour midway due to political protestsSri Lanka's A team will return home midway from their ongoing series against Pakistan Shaheens due to intense political protests in Islamabad. The 2nd one-day game of a three-match series was suspended on Tuesday, hours before the start of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-antigua-test-score-wtc-standings-2640662-2024-11-26",
      "headline": "Bangladesh slip to last in WTC table after 201-run loss in Antigua TestWest Indies (WI) vs Bangladesh (BAN). 1st Test: West Indies hammered Bangladesh by 201 runs in the series opener in Antigua. With their 8th defea in 11 matches in this cycle, Bangladesh slipped to the last spot in the World Test Championship standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-mohammed-siraj-emotional-farewell-letter-rcb-fans-2640659-2024-11-26",
      "headline": "Siraj bids emotional goodbye to RCB: 'Thank you for believing in me'IPL 2025: After securing a Rs 12.25 crore deal with Gujarat Titans, Mohammed Siraj wrote a heartfelt letter to RCB and their fans. Siraj's seven-year-long association with RCB came to an end during the mega auction in Jeddah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-test-series-full-squads-schedule-live-streaming-details-2640629-2024-11-26",
      "headline": "South Africa vs Sri Lanka Test series: Squads, all you need to knowWith crucial World Test Championship points up for grabs, South Africa and Sri Lanka will start the 2-match series on Wednesday, November 27. Both teams will be going for the win as the race for the WTC Final heats up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-championship-d-gukesh-second-game-draw-ding-liren-2640678-2024-11-26",
      "headline": "World Chess Championship: D Gukesh hopeful of 'more good days' after drawIndian chess Grandmaster D Gukesh is hoping that more good days will follow as he was able to draw the second game of the World Chess Championship against Ding Liren on Tuesday, November 26.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-tour-of-pakistan-cricket-team-leave-midway-political-protests-2640673-2024-11-26",
      "headline": "Sri Lanka A cricket team to leave Pakistan tour midway due to political protestsSri Lanka's A team will return home midway from their ongoing series against Pakistan Shaheens due to intense political protests in Islamabad. The 2nd one-day game of a three-match series was suspended on Tuesday, hours before the start of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-antigua-test-score-wtc-standings-2640662-2024-11-26",
      "headline": "Bangladesh slip to last in WTC table after 201-run loss in Antigua TestWest Indies (WI) vs Bangladesh (BAN). 1st Test: West Indies hammered Bangladesh by 201 runs in the series opener in Antigua. With their 8th defea in 11 matches in this cycle, Bangladesh slipped to the last spot in the World Test Championship standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-mohammed-siraj-emotional-farewell-letter-rcb-fans-2640659-2024-11-26",
      "headline": "Siraj bids emotional goodbye to RCB: 'Thank you for believing in me'IPL 2025: After securing a Rs 12.25 crore deal with Gujarat Titans, Mohammed Siraj wrote a heartfelt letter to RCB and their fans. Siraj's seven-year-long association with RCB came to an end during the mega auction in Jeddah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-test-series-full-squads-schedule-live-streaming-details-2640629-2024-11-26",
      "headline": "South Africa vs Sri Lanka Test series: Squads, all you need to knowWith crucial World Test Championship points up for grabs, South Africa and Sri Lanka will start the 2-match series on Wednesday, November 27. Both teams will be going for the win as the race for the WTC Final heats up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-vaihav-suryavanshi-age-crorepati-teenager-sports-others-2640610-2024-11-26",
      "headline": "Vaibhav Suryavanshi bags Rs 1.1 crore at 13: Other teen crorepatis in sportsA 13-year-old from Bihar, Vaibhav Suryavanshi, earned Rs 1.10 crore at the IPL 2025 mega auction. Here's a look at other teen sports stars who earned a massive sum of money with their rookie contracts across the world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-unsold-xi-impact-player-david-warner-prithvi-shaw-headline-list-2640592-2024-11-26",
      "headline": "IPL mega auction unsold XI, impact player: David Warner, Prithvi Shaw headline listIPL 2025 mega auction: Here is how a playing XI from the top and unexpected unsold players in the auction would look like. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/crikcet-rishabh-pant-delhi-capitals-ipl-auction-parth-jindal-breaks-silence-2640589-2024-11-26",
      "headline": "Delhi co-owner explains Pant exit, reveals late change of heart in IPL auctionIPL 2025 auction: Delhi Capitals co-owner Parth Jindal revealed that the ownership group had respected Rishabh Pant's decision to leave the franchise and promised not to bid for him in the auction. However, Delhi decided to use the Right To Match card for the wicketkeeper-batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-satwik-chirag-withdraws-from-syed-modi-international-super-300-tournament-2640554-2024-11-26",
      "headline": "Satwik-Chirag withdraws from Syed Modi International Super 300 tournamentIndia's top men's doubles pair, Satwiksairaj Rankireddy and Chirag Shetty, have withdrawn from the Syed Modi International citing injury concerns. The duo, once world No. 1, recently returned to form at the China Masters but are prioritising recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-test-series-joe-root-response-darren-lehmann-2640541-2024-11-26",
      "headline": "Joe Root hits back at Darren Lehmann's claim he is not an 'all-time great'England's Joe Root has responded to former Australia coach Darren Lehmann's remarks about his status as an all-time great. Root emphasises his focus on scoring runs, while acknowledging Lehmann's right to his opinion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-liren-result-game-2-singapore-2640502-2024-11-26",
      "headline": "India's D Gukesh bounces back, holds Ding Liren to a draw in Game 2 FIDE Chess World Championship: Indian Grandmaster D Gukesh held defending champion Ding Liren to a draw in Game 2 with black pieces. Gukesh lost the opening game with white pieces on Monday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-saim-ayub-century-odi-series-2640497-2024-11-26",
      "headline": "Saim Ayub blasts 53-ball hundred, helps Pakistan bounce back ZIM vs PAK: Saim Ayub smacked a 53-ball century as Pakistan beat Zimbabwe by 10 wickets on Tuesday to draw level in the three-match series. Ayub also won the Player of the Match award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-satwik-chirag-withdraws-from-syed-modi-international-super-300-tournament-2640554-2024-11-26",
      "headline": "Satwik-Chirag withdraws from Syed Modi International Super 300 tournamentIndia's top men's doubles pair, Satwiksairaj Rankireddy and Chirag Shetty, have withdrawn from the Syed Modi International citing injury concerns. The duo, once world No. 1, recently returned to form at the China Masters but are prioritising recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-test-series-joe-root-response-darren-lehmann-2640541-2024-11-26",
      "headline": "Joe Root hits back at Darren Lehmann's claim he is not an 'all-time great'England's Joe Root has responded to former Australia coach Darren Lehmann's remarks about his status as an all-time great. Root emphasises his focus on scoring runs, while acknowledging Lehmann's right to his opinion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-liren-result-game-2-singapore-2640502-2024-11-26",
      "headline": "India's D Gukesh bounces back, holds Ding Liren to a draw in Game 2 FIDE Chess World Championship: Indian Grandmaster D Gukesh held defending champion Ding Liren to a draw in Game 2 with black pieces. Gukesh lost the opening game with white pieces on Monday in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-saim-ayub-century-odi-series-2640497-2024-11-26",
      "headline": "Saim Ayub blasts 53-ball hundred, helps Pakistan bounce back ZIM vs PAK: Saim Ayub smacked a 53-ball century as Pakistan beat Zimbabwe by 10 wickets on Tuesday to draw level in the three-match series. Ayub also won the Player of the Match award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-mumbai-indians-bevon-jacobs-purchase-reaction-full-squad-2640491-2024-11-26",
      "headline": "New Zealand's Bevon Jacobs shocked by MI purchase: Thought family was pranking meNew Zealand's uncapped star Bevon Jacobs has claimed that he was left shocked by Mumbai Indians purchasing him during Day 2 of the IPL 2025 Auction. Jacobs was bought for his base price by the 5-time IPL Champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-schedule-icc-board-meeting-nov-29-schedule-hybrid-model-2640465-2024-11-26",
      "headline": "ICC Board to meet on November 29 to discuss Champions Trophy schedule: Sources The International Cricket Council Board will meet on Friday, November 29 to finalise the schedule for the Champions Trophy. There has been a delay in announcing the schedule after India refused to travel to Pakistan, who have the hosting rights for the 50-over tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-premier-league-manchester-united-goalkeeper-andre-onana-wins-fifpro-award-for-charity-work-2640462-2024-11-26",
      "headline": "Manchester United goalkeeper Andre Onana wins FIFPRO Award for charity workManchester United's André Onana wins the FIFPRO Impact Award for his humanitarian work in Africa. Through his foundation, he has facilitated over 1,200 surgeries, focusing on healthcare for underprivileged communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/liam-livingstone-hits-15-ball-50-after-rs-875-crore-rcb-deal-in-ipl-auction-2640457-2024-11-26",
      "headline": "Liam Livingstone hits 15-ball 50 after Rs 8.75 crore RCB deal in IPL auctionIPL 2025 mega auction: Liam Livingstone hit a 15-ball 50 in Abu Dhabi T10 league for Bangla Tigers. He was roped in by RCB for Rs 8.75 crore in the auction. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}