{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-trusts-explained-structure-legacy-boardroom-history-2800839-2025-10-10",
      "headline": "The legacy of Tata Trusts, beyond the boardroomTata Trusts is one of India's oldest, largest, and most influential philanthropic foundations.  A group of public charitable trusts set up by members of the Tata family, the present-day Trusts trace their origin to the working-class-focused JN Endowment Fund, started by Jamsetji Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-start-flat-trade-green-financial-stocks-2800834-2025-10-10",
      "headline": "Sensex, Nifty trade higher after flat start as banks lead gainsThe S&P BSE Sensex gained 232.01 points to 82,404.11, while the NSE Nifty50 added 70.60 points to 25,252.40 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/uk-pm-paytm-praise-superstar-indian-fintech-industry-global-fintech-festival-2800821-2025-10-10",
      "headline": "UK PM Keir Starmer calls Paytm the 'Superstar' of Indian fintech industryUK Prime Minister Keir Starmer said that the rise of Indian fintech companies on the world stage driven by technological innovation, digital inclusion, and entrepreneurial scale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-allotment-out-today-live-check-status-online-record-bid-gmp-rises-listing-date-2800811-2025-10-10",
      "headline": "LG Electronics IPO allotment live: Check status online, GMP surges ahead of listingLG Electronics IPO closed for bidding on Thursday, created a record by attracting bids worth Rs 4.4 lakh crore, making it the most subscribed IPO in India by value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-board-meeting-today-october-10-noel-tata-mehli-mistry-what-to-expect-2800797-2025-10-10",
      "headline": "Tata Trusts board meets today amid internal turmoil: Here's what to expectThe board meeting follows days of internal disagreement and comes just a day after the first death anniversary of Ratan N. Tata, the former chairman who led the Trusts for several decades until his death last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denials-material-change-clause-hidden-in-fine-print-2800524-2025-10-10",
      "headline": "Hidden in fine print: This silent clause can hike your health insurance premiumThe Material Change clause in health policies can let insurers raise premiums or limit coverage after a claim, but policyholders can challenge it to protect their lifelong renewability and benefits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-sanctions-over-50-entities-including-indians-over-links-to-iran-oil-trade-glbs-2800775-2025-10-10",
      "headline": "US sanctions over 50 entities, including Indians, over links to Iran oil tradeAmong those sanctioned are Varun Pula, Soniya Shrestha, and Iyappan Raja, all Indian nationals accused of facilitating shipments of Iranian oil and LPG. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-alternative-ways-to-diversify-your-portfolio-this-diwali-2800429-2025-10-09",
      "headline": "7 alternative ways to diversify your portfolio this DiwaliAs Diwali approaches, many are thinking about not just celebrations but also financial planning. Diversifying your portfolio across multiple assets can help manage risk and make your money work harder in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-seizing-opportunity-and-waging-war-at-sea-in-the-early-years-2800578-2025-10-09",
      "headline": "Tata history: Seizing opportunity and waging war at sea in the early yearsEmerging from the colonial opium and cotton trades and a transformative Abyssinian contract, the Tata family overcame crises to pioneer Indian textile manufacturing and challenge imperial monopolies, shaping a nationalist industrial legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-q2-results-pat-profit-revenue-it-stocks-dividend-rs-11-it-firm-financial-result-2800496-2025-10-09",
      "headline": "TCS Q2 FY26 results: Profit rises 1.4% to Rs 12,075 croreThe company's net profit grew 1.4% year-on-year to Rs 12,075 crore, compared with Rs 11,909 crore in the same quarter last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-kapur-cinderella-stepmother-karisma-kapurs-children-allege-she-shifted-sunjay-kapur-assets-to-her-kids-2800487-2025-10-09",
      "headline": "Priya Kapur a Cinderella stepmother, Karisma's children allege in assets battleKarisma Kapur's children have accused Priya Kapur of giving them \"Cinderella stepmother\" treatment by diverting Sanjay Kapur's assets to her own children, limiting their shares, and intensifying the dispute over the allegedly forged will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-in-green-metal-it-shares-rise-tcs-q2-results-2800467-2025-10-09",
      "headline": "Metal, IT stock help markets end higher ahead of TCS Q2 resultsThe S&P BSE Sensex added 398.44 points to end at 82,172.10, while the NSE Nifty50 gained 135.65 points to close at 25,181.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-international-funding-dispute-rs-1000-crore-rift-noel-tata-trust-members-report-2800405-2025-10-09",
      "headline": "Funding dispute at Tata International behind deepening rift in Tata Trusts: ReportThe Rs 1,000 crore capital infusion plans for the loss-making Tata International, chaired by Noel Tata, has turned into the latest flashpoint in the widening divide within one of India's most powerful charitable trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/radhika-gupta-explains-why-a-5050-gold-silver-split-works-for-investors-2800385-2025-10-09",
      "headline": "Radhika Gupta explains why a 50:50 gold–silver split works for investorsRadhika Gupta explains how a balanced approach to gold and silver investing can help investors navigate volatility with ease."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-russian-oil-payment-chinese-yuan-benefit-explained-2800368-2025-10-09",
      "headline": "Has India started paying for Russian oil in Chinese yuan?Traders supplying Russian crude have reportedly asked Indian state refiners to settle a few recent shipments in yuan instead of the usual dollars or UAE dirhams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forbes-india-100-richest-list-mukesh-ambani-net-worth-centibillionaire-gautam-adani-jindal-2800340-2025-10-09",
      "headline": "Mukesh Ambani only centibillionaire in Forbes India's 100 RichestWith a net worth of $105 billion, Ambani has maintained his lead as the country's wealthiest individual. At the second position is Gautam Adani and family, with a fortune of $92 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-anniversary-ads-irony-internal-feud-tata-group-tata-sons-2800330-2025-10-09",
      "headline": "Irony unfolds: Front-page ads hail Ratan Tata as guiding light amid internal feudThe internal turmoil within Tata Trusts, the majority shareholder in Tata Sons, has coincided with the first death anniversary of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/how-is-jewar-international-airport-shaping-noidas-next-big-real-estate-boom-2800323-2025-10-09",
      "headline": "How is Jewar International Airport shaping Noida's next big real estate boomBeyond serving as a travel gateway, Jewar International Airport is poised to power NCR's economic and real estate growth. The project has already fuelled rising demand in areas like the Yamuna Expressway, Noida Extension, and Greater Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-and-silver-prices-dip-slightly-after-record-highs-should-you-buy-or-sell-2800305-2025-10-09",
      "headline": "Gold and silver prices dip slightly after record highs. Should you buy or sell?After touching record highs earlier this week, gold and silver prices cooled off slightly on Thursday as investors booked profits. With both metals still near lifetime peaks, the big question is—should you buy the dip or wait for further correction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pharma-stocks-india-trump-tariff-on-medicines-generic-drug-exports-aurobindo-pharma-lupin-cipla-2800276-2025-10-09",
      "headline": "Pharma shares rally after report hints tariff relief for genericsThe Nifty Pharma and Healthcare indices opened strong, gaining 1.14% each, as optimism spread across the market. Almost all major pharmaceutical and healthcare companies traded higher."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/game-of-thrones-spinoff-a-knight-of-the-seven-kingdoms-trailer-hbo-max-2026-2800831-2025-10-10",
      "headline": "A Knight of the Seven Kingdoms trailer: Dunk and Egg's epic journey begins HBO Max unveils the trailer of 'A Knight of the Seven Kingdoms' at New York Comic Con. The new Game of Thrones spinoff follows Ser Duncan the Tall and Egg, set a century before the original series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-jake-bongiovi-share-first-photo-adopted-baby-girl-2800816-2025-10-10",
      "headline": "Millie Bobby Brown, Jake Bongiovi gush over baby girl in first glimpse Actor Millie Bobby Brown and husband Jake Bongiovi shared a glimpse of their adopted baby girl. The couple, married in May 2024, confirmed the adoption in August 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-collection-rs-334-crore-nett-2800809-2025-10-10",
      "headline": "Kantara Chapter 1 box office Day 8: Rishab Shetty's film eyes Rs 500 crore globally Rishab Shetty's 'Kantara: Chapter 1' saw a weekday drop but is still maintaining a strong theatre presence. The film is expected to cross Rs 500 crore worldwide by the end of this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-cheers-veer-pahariya-blows-kiss-at-fashion-show-watch-2800807-2025-10-10",
      "headline": "Tara Sutaria cheers as Veer Pahariya blows her a kiss at fashion show. Watch Veer Pahariya turned a showstopper for Abraham & Thakore at a recent fashion show. However, it was his beautiful gesture for Tara Sutaria that caught the attention of all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-rekha-is-the-actors-actor-in-bollywood-diva-birthday-silsila-khubsoorat-2800742-2025-10-10",
      "headline": "Happy Birthday Rekha: What makes her Bollywood's ultimate screen diva Rekha turns 71 on October 10. Decoding her remarkable journey from a criticised newcomer to a versatile actress who emerged as a one-star industry by the eighties. Her legacy is defined not just by glamour but by powerful roles that showcase her true artistic brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-47-day-46-written-updates-malti-chahar-cooking-refusal-tanya-mittal-captaincy-task-2800743-2025-10-09",
      "headline": "Bigg Boss 19 episode 47: Malti Chahar's refusal to cook irks entire house All the 'Bigg Boss 19' contestants turned their backs on wild card contestant Malti Chahar after she refused to do her kitchen duty. The latter was also seen warning Tanya Mittal about her perceived image outside the show during the captaincy task. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-defends-8-hour-work-demand-slams-industry-bias-spirit-kalki-2898-ad-sandeep-reddy-vanga-2800715-2025-10-09",
      "headline": "Deepika Padukone defends 8-hour work demand, slams industry bias Actor Deepika Padukone has addressed the controversy surrounding her departure from 'Spirit' and 'Kalki 2898 AD'. She pointed out that a lot of male actors have been working for 8 hours a day for years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedang-raina-sharvari-wagh-golden-temple-visit-imtiaz-ali-directorial-film-2800649-2025-10-09",
      "headline": "Vedang Raina starts Imtiaz Ali's next, visits Golden Temple with Sharvari Ahead of his new film's shoot, actor Vedang Raina visited the Golden Temple with his next co-star, Sharvari Wagh. The film is directed by Imtiaz Ali and also stars Diljit Dosanjh and Naseeruddin Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/maarigallu-puneeth-rajkumar-in-animated-avatar-as-karnatakas-first-king-2800680-2025-10-09",
      "headline": "Maarigallu: Puneeth Rajkumar in animated avatar as Karnataka's first king Four years on, Puneeth Rajkumar's legacy comes alive in 'Maarigallu', a bold blend of animation, heritage, and heartfelt tribute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-exits-s-s-rajamouli-dadasaheb-phalke-project-here-is-why-2800650-2025-10-09",
      "headline": "Jr NTR exits S S Rajamouli's Dadasaheb Phalke project. Here's why Jr NTR has reportedly stepped away from the Dadasaheb Phalke biopic, citing creative choices and timing as key reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjabi-actor-varinder-ghuman-dies-due-to-heart-attack-in-amritsar-2800656-2025-10-09",
      "headline": "Punjabi actor Varinder Singh Ghuman dies due to heart attack in Amritsar Punjabi actor Varinder Singh Ghuman died due to a heart attack in Amritsar. He featured as the lead actor in the Punjabi film 'Kabaddi Once Again' in 2012 and later appeared in several Bollywood films. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pooja-bhatt-on-not-judging-mahesh-bhatt-as-a-child-when-he-came-home-intoxicated-2800615-2025-10-09",
      "headline": "Pooja Bhatt on not judging Mahesh Bhatt as a child when he came home intoxicated Filmmaker Mahesh Bhatt opened up about a painful childhood moment on his daughter Pooja Bhatt's podcast. Their conversation revealed deep family emotions and complex relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-monster-season-4-production-ella-beatty-lizzie-borden-2800641-2025-10-09",
      "headline": "Netflix's Monster returns: Lizzie Borden takes the spotlight in Season 4 Netflix announced the fourth season of its acclaimed true-crime series 'Monster', this time focusing on the infamous Lizzie Borden case. The new season promises a compelling portrayal of the historic murders featuring a talented ensemble cast led by Ella Beatty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tollywoods-iconic-pair-nagarjuna-and-tabu-to-reunite-for-king-100-report-2800501-2025-10-09",
      "headline": "Tollywood's iconic pair Nagarjuna and Tabu to reunite for King 100: Report Tollywood's beloved pair, Nagarjuna and Tabu, are reportedly set to reunite on the big screen with a meaty collaboration for Nagarjuna's iconic 100th project, sparking excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-vrusshabha-gets-new-release-date-misses-diwali-2025-2800553-2025-10-09",
      "headline": "Mohanlal's Vrusshabha gets new release date, misses Diwali 2025 Mohanlal's much-anticipated period action drama 'Vrusshabha' now moves out of the Diwali race, setting its sights on a November 6 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-ss-rajamoulis-ssmb29-title-locked-varanasi-2800606-2025-10-09",
      "headline": "Mahesh Babu and SS Rajamouli's SSMB29 title locked, work underway: Report The long-speculated SS Rajamouli and Mahesh Babu global adventure film might finally have a title, and it seems deeply rooted in Indian culture and mythology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-kardashian-alls-fair-legal-drama-trailer-jiohotstar-2025-2800607-2025-10-09",
      "headline": "All's Fair trailer: Kim Kardashian and Sarah Paulson lock horns in legal drama Kim Kardashian stars with Sarah Paulson in Ryan Murphy's legal drama 'All's Fair'. The trailer previews a fierce rivalry and sharp dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-film-haal-lands-in-trouble-as-censor-board-cites-religious-concerns-2800609-2025-10-09",
      "headline": "Censor Board flags beef biryani scene in Malayalam film Haal, makers move High Court The Censor Board has ordered cuts in the Malayalam film 'Haal' citing religious sensitivities, following which the makers have approached the Kerala High Court. Starring Shane Nigam and featuring songs by Atif Aslam, the film remains a major release despite the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehnaaz-gill-touching-message-for-brother-shehbaz-badesha-2800540-2025-10-09",
      "headline": "You protect me from evil: Shehnaaz Gill's touching message for brother Shehbaz Shehnaaz Gill shared a heartfelt message for her brother, Shehbaz Badesha, who is currently participating in 'Bigg Boss 19.' The actor-singer expressed her gratitude and explained how much her brother has done for her. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/massive-earthquake-of-76-magnitude-strikes-offshore-in-southern-philippines-tsunami-warning-issued-2800791-2025-10-10",
      "headline": "Massive 7.6-magnitude earthquake strikes Philippines, tsunami warning issuedThe Philippine Institute of Volcanology and Seismology said the offshore quake hit waters off Manay town in Davao Oriental, Mindanao, at a depth of 10 km. The agency warned of possible damage and aftershocks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-new-deliveries-of-air-to-air-amraam-missiles-to-pakistan-us-denies-media-reports-2800814-2025-10-10",
      "headline": "No new missile deliveries to Pak, only sustainment: US denies reportsThe embassy emphasised that such contract announcements are routine in US defense procurement and warned against any misinterpretation of the modification as a capability enhancement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-khawaja-asif-warns-taliban-over-militants-attack-on-pakistan-glbs-2800776-2025-10-10",
      "headline": "Enough is enough: Khawaja Asif warns Taliban over militant attack on PakistanKhawaja Asif revealed that Pakistani officials had raised the issue of cross-border militancy directly with the Afghan Taliban during a visit to Kabul three years ago, but their concerns were met with vague assurances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-1-live-score-commentary-scorecard-shubman-gill-new-delhi-2800792-2025-10-10",
      "headline": "2nd Test, Day 1 Live: Rahul, Jaiswal in watchful start after India opt to batIND vs WI Live score, 2nd Test Day 1: With Shubman Gill having won his first toss as India captain, the hosts will be batting first in this first Test against West Indies in New Delhi. No changes in the India lineup, which means no rest either for Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/shoe-strike-at-constitution-hate-is-in-the-air-cji-br-gavai-advocate-rakesh-kishore-2800610-2025-10-10",
      "headline": "Shoe-strike at Constitution: Hate is in the airThe shoe thrown by Advocate Kishore was not just aimed at Justice Gavai, but it was meant to consciously intimidate and undermine a judicial system that is meant to be rational, just and non-discriminatory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-unlikely-to-get-nobel-peace-prize-reasons-nomination-date-cutoff-2800585-2025-10-10",
      "headline": "Trump unlikely to get Nobel for 2025, but don't rule him out for 2026Trump has credited himself with ending 6–7 conflicts, including one between India and Pakistan. He has mostly attributed the resolutions to his personal diplomacy. However, the biggest reason Trump won't get the award is something else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/mounjaro-vs-ozempic-which-glp-1-drug-works-best-for-weight-loss-2800516-2025-10-10",
      "headline": "Mounjaro v/s Ozempic: Which GLP-1 drug works best for weight loss?Two breakthrough diabetes drugs are reshaping the weight-loss landscape. Mounjaro and Ozempic are often compared, but experts say the real focus should be on individual needs, safety, and accessibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denials-material-change-clause-hidden-in-fine-print-2800524-2025-10-10",
      "headline": "Hidden in fine print: This silent clause can hike your health insurance premiumThe Material Change clause in health policies can let insurers raise premiums or limit coverage after a claim, but policyholders can challenge it to protect their lifelong renewability and benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-trusts-explained-structure-legacy-boardroom-history-2800839-2025-10-10",
      "headline": "The legacy of Tata Trusts, beyond the boardroomTata Trusts is one of India's oldest, largest, and most influential philanthropic foundations.  A group of public charitable trusts set up by members of the Tata family, the present-day Trusts trace their origin to the working-class-focused JN Endowment Fund, started by Jamsetji Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/philippines-76-magnitude-earthquake-what-shook-the-ground-so-violently-2800817-2025-10-10",
      "headline": "Philippines earthquake: What triggered the 7.6 magnitude quake?A tsunami warning was also issued in Indonesia for its northern Sulawesi and Papua regions, warning of waves as high as 50 cm hitting Indonesia's shorelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/mayawati-lucknow-mega-rally-strength-on-display-but-a-self-goal-2800728-2025-10-09",
      "headline": "Mayawati's mega rally: Strength on display, but a slip in messageThe BSP's grand Lucknow rally wasn't just about crowds and slogans — it was a political statement wrapped in spectacle. From Mayawati's accidental praise for Yogi Adityanath government to nephew Akash Anand's official launch, every moment carried layered meaning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-criticises-obama-nobel-peace-prize-gaza-peace-deal-2800818-2025-10-10",
      "headline": "Obama won Nobel Peace Prize for nothing, I ended 8 conflicts: TrumpUS President Donald Trump has slammed Barack Obama for winning the Nobel Peace Prize 'for nothing' while emphasising his own record in resolving conflicts around the world and securing peace in Gaza, hours before this year's award is announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/protein-shake-only-for-breakfast-is-it-a-good-idea-2800590-2025-10-10",
      "headline": "Just a protein shake for breakfast - Smart or shortcut gone wrong?In today's hustle culture, where slow mornings are a luxury and cooking feels like a chore, many turn to protein shakes as a convenient breakfast alternative. But do health experts approve of it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/fir-filed-against-2-haryana-top-cops-over-officers-suicide-after-wife-alleges-years-of-harassment-in-compl-2800721-2025-10-09",
      "headline": "Case against 2 Haryana top cops on complaint of wife of officer who died by suicideOn Tuesday, Y Puran Kumar allegedly shot himself in the head with his service revolver while seated on a chair at his house in Sector 11, Chandigarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/punjabi-actor-varinder-ghuman-dies-due-to-heart-attack-in-amritsar-2800656-2025-10-09",
      "headline": "Punjabi actor Varinder Singh Ghuman dies due to heart attack in AmritsarPunjabi actor Varinder Singh Ghuman died due to a heart attack in Amritsar. He featured as the lead actor in the Punjabi film 'Kabaddi Once Again' in 2012 and later appeared in several Bollywood films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-war-update-is-war-in-palestine-finally-over-will-peace-last-israel-hamas-conflict-trump-netanyahu-agreement-2800654-2025-10-09",
      "headline": "Gaza war ends, finally. But how long will peace last?After more than two years of war, Israel and Hamas have agreed to halt hostilities and release hostages and prisoners under a US-brokered deal. The truce, mediated by Egypt, Qatar, and Turkey, marks the first real sign of peace since the 2023 attacks, but deep mistrust and fragile politics threaten to shatter the calm again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-rekha-is-the-actors-actor-in-bollywood-diva-birthday-silsila-khubsoorat-2800742-2025-10-10",
      "headline": "Happy Birthday Rekha: What makes her Bollywood's ultimate screen divaRekha turns 71 on October 10. Decoding her remarkable journey from a criticised newcomer to a versatile actress who emerged as a one-star industry by the eighties. Her legacy is defined not just by glamour but by powerful roles that showcase her true artistic brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-defends-8-hour-work-demand-slams-industry-bias-spirit-kalki-2898-ad-sandeep-reddy-vanga-2800715-2025-10-09",
      "headline": "Deepika Padukone defends 8-hour work demand, slams industry biasActor Deepika Padukone has addressed the controversy surrounding her departure from 'Spirit' and 'Kalki 2898 AD'. She pointed out that a lot of male actors have been working for 8 hours a day for years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/robert-f-kennedy-jr-trump-warns-tylenol-autism-risk-circumcised-boys-2800794-2025-10-10",
      "headline": "After pregnant women, Trump aide links Tylenol use in circumcised boys to autismHealth Secretary Robert Kennedy Jr. reiterated his argument about a possible connection between Tylenol and autism, while also suggesting that opposition to his theory was politically motivated and based on animosity toward Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-orthopaedic-doctor-dr-amyn-rajani-and-this-is-how-i-care-for-my-knees-and-bones-2799793-2025-10-09",
      "headline": "I am an orthopaedic doctor and this is how I care for my knees and bonesAn orthopaedic surgeon reveals his golden rules for maintaining joint health through balanced exercise and nutrition. Every extra kilo adds more stress to the knees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/india-job-market-shifts-from-degrees-to-skills-for-better-employability-2800506-2025-10-10",
      "headline": "Degrees vs Skills: What India's employers really want in 2025India's employment landscape is shifting focus from traditional degrees to practical skills. This change demands continuous learning and better alignment between education and industry needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/arattai-usage-record-high-here-is-what-zoho-is-saying-about-encryption-monetisation-and-ai-plans-2800611-2025-10-10",
      "headline": "Arattai usage record high, here is what Zoho is saying about encryption, monetisation and AI plansZoho's Arattai app is currently one of the fastest growing messaging apps in India. In an exclusive interview with India Today Tech, Zoho CEO Mani Vembu reveals inside details into future roadmap that includes, among other things, end-to-end encryption, AI-powered features via Zia AI, and a strict no-ads policy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karwa-chauth-2025-moon-visibility-forecast-india-delhi-chennai-mumbai-kolkata-bengaluru-hyderabad-2800790-2025-10-10",
      "headline": "Will moon be easily visible tonight? Check weather predictionMost metro cities like Delhi, Ahmedabad, Lucknow, Chandigarh, and Dehradun will have a clear sky ensuring easy moon visibility for Karwa Chauth 2025, while Mumbai, Kolkata, and Pune may face cloudy or rainy conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-jake-bongiovi-share-first-photo-adopted-baby-girl-2800816-2025-10-10",
      "headline": "Millie Bobby Brown, Jake Bongiovi gush over baby girl in first glimpseActor Millie Bobby Brown and husband Jake Bongiovi shared a glimpse of their adopted baby girl. The couple, married in May 2024, confirmed the adoption in August 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-collection-rs-334-crore-nett-2800809-2025-10-10",
      "headline": "Kantara Chapter 1 box office Day 8: Rishab Shetty's film eyes Rs 500 crore globallyRishab Shetty's 'Kantara: Chapter 1' saw a weekday drop but is still maintaining a strong theatre presence. The film is expected to cross Rs 500 crore worldwide by the end of this week."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-2nd-test-shubman-gill-toss-new-delhi-gautam-gambhir-reaction-2800828-2025-10-10",
      "headline": "Watch: Gautam Gambhir's priceless reaction as Shubman Gill wins first Test toss India vs West Indies, 2nd Test: After losing six tosses in a row as Test captain, Shubman Gill finally broke the duck in New Delhi. Head coach Gautam Gambhir and the Indian bowlers celebrated the win, sharing some playful banter with the skipper on Friday morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-father-bowling-challenge-corporate-cricket-gaurav-kapur-podcast-2800793-2025-10-10",
      "headline": "Weekend cricket hero: Arshdeep Singh's dad sends bowling stats, asks son to top them Arshdeep Singh's light-hearted competition with his father adds a funny twist to his pre-match routine. The India pacer revealed how their weekend bowling \"challenges\" often gave him extra motivation before taking the field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-1-live-score-commentary-scorecard-shubman-gill-new-delhi-2800792-2025-10-10",
      "headline": "IND vs WI, Day 1 Live: Rahul, Jaiswal in watchful start after India opt to bat IND vs WI Live score, 2nd Test Day 1: With Shubman Gill having won his first toss as India captain, the hosts will be batting first in this first Test against West Indies in New Delhi. No changes in the India lineup, which means no rest either for Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-vizag-defeat-top-order-left-arm-spin-2800783-2025-10-10",
      "headline": "India's flaws laid bare in Vizag: Misfiring top-order, left-arm spin bites Women's World Cup 2025: South Africa exposed India's major flaws with a thrilling three-wicket win in the Vizag clash: three consecutive top-order failures, persistent struggles against left-arm spin, and an inability to maintain a brisk scoring rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-predicted-xi-will-bumrah-get-rested-2800760-2025-10-10",
      "headline": "India vs West Indies 2nd Test predicted XI: Will Bumrah get rested in Delhi? India look to complete a 2-0 series victory over West Indies in Delhi. Team management may look to rest Jasprit Bumrah or Mohammed Siraj ahead of the South Africa Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nadine-de-klerk-unbeaten-84-powers-south-africa-win-over-india-womens-world-cup-2025-2800751-2025-10-10",
      "headline": "Nadine lost for words after pulling of incredible heist against India in Vizag Nadine de Klerk's unbeaten 84 helped South Africa chase down 252 against India in a thrilling World Cup match. The win ended their five-match losing streak against India and revived their campaign after an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-reaction-india-vs-south-africa-womens-world-cup-2025-2800754-2025-10-10",
      "headline": "IND vs SA: Harmanpreet Kaur rues India's batting frailty after South Africa loss India captain Harmanpreet Kaur rued the batting woes of her side as they slumped to a 3-wicket loss to South Africa in Vizag on Thursday, October 9. India's top and middle-order issues were exposed again by South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-south-africa-report-richa-ghosh-vizag-2800716-2025-10-09",
      "headline": "Nadine's sensational 84 trumps Richa's 94 as South Africa stun India in Vizag Women's World Cup: Richa Ghosh's stunning 94 went in vain as Nadine de Klerk powered South Africa to a three-wicket win, ending India's imperfect unbeaten run in the group clash at the ACA–VDCA Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-vs-bangladesh-womens-world-cup-amelia-kerr-press-conference-2800724-2025-10-09",
      "headline": "How New Zealand plans to tackle Bangladesh's spin threat? Amelia Kerr explains Amelia Kerr said that New Zealand are wary of the spin threat posed by Bangladesh and explained how they plan to tackle it during their clash on Friday, October 10 in Guwahati. New Zealand are chasing their first win of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-praises-sophie-devine-womens-world-cup-2025-ban-vs-nz-2800719-2025-10-09",
      "headline": "Sophie Devine has been so switched on for World Cup 2025: Amelia Kerr Amelia Kerr heaped praise on Sophie Devine and said that the all-rounder has been so switched on during the tournament. Devine has started the tournament in fine form with a hundred and fifty in the first two games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nadine-de-klerk-unbeaten-84-powers-south-africa-win-over-india-womens-world-cup-2025-2800751-2025-10-10",
      "headline": "Nadine lost for words after pulling of incredible heist against India in Vizag Nadine de Klerk's unbeaten 84 helped South Africa chase down 252 against India in a thrilling World Cup match. The win ended their five-match losing streak against India and revived their campaign after an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-reaction-india-vs-south-africa-womens-world-cup-2025-2800754-2025-10-10",
      "headline": "IND vs SA: Harmanpreet Kaur rues India's batting frailty after South Africa loss India captain Harmanpreet Kaur rued the batting woes of her side as they slumped to a 3-wicket loss to South Africa in Vizag on Thursday, October 9. India's top and middle-order issues were exposed again by South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-south-africa-report-richa-ghosh-vizag-2800716-2025-10-09",
      "headline": "Nadine's sensational 84 trumps Richa's 94 as South Africa stun India in Vizag Women's World Cup: Richa Ghosh's stunning 94 went in vain as Nadine de Klerk powered South Africa to a three-wicket win, ending India's imperfect unbeaten run in the group clash at the ACA–VDCA Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-vs-bangladesh-womens-world-cup-amelia-kerr-press-conference-2800724-2025-10-09",
      "headline": "How New Zealand plans to tackle Bangladesh's spin threat? Amelia Kerr explains Amelia Kerr said that New Zealand are wary of the spin threat posed by Bangladesh and explained how they plan to tackle it during their clash on Friday, October 10 in Guwahati. New Zealand are chasing their first win of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-praises-sophie-devine-womens-world-cup-2025-ban-vs-nz-2800719-2025-10-09",
      "headline": "Sophie Devine has been so switched on for World Cup 2025: Amelia Kerr Amelia Kerr heaped praise on Sophie Devine and said that the all-rounder has been so switched on during the tournament. Devine has started the tournament in fine form with a hundred and fifty in the first two games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-marufa-akter-fit-to-bowl-against-new-zealand-icc-womens-world-cup-2800692-2025-10-09",
      "headline": "Women's World Cup: Nahida Akter gives update on Marufa's injury ahead of NZ clashBangladesh vice-captain Nahida Akter gave a fitness update on pace bowler Marufa Akter ahead of their third clash in the Women's World Cup 2025 against New Zealand in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-jalaj-saxena-join-maharashtra-ranji-trophy-2025-2800677-2025-10-09",
      "headline": "Amidst bust-up investigation, Shaw added to Maharashtra Ranji Trophy squadAmidst the investigation into his bust-up incident with Musheer Khan, Prithvi Shaw has been added to Maharashtra's Ranji Trophy squad for the upcoming season. Jalaj Saxena also finds a spot in the squad for the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-snub-sourav-ganguly-groom-shubman-gill-2800666-2025-10-09",
      "headline": "Rohit Sharma captaincy snub: Happened to me and Dravid as well, says GangulySourav Ganguly commented on Rohit Sharma's ODI captaincy snub and said that it happens with players towards the end of their careers. Ganguly felt it was the right call to groom Shubman Gill as the new captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-richa-ghosh-rescues-india-shatters-records-with-94-2800647-2025-10-09",
      "headline": "IND-W vs SA-W: Richa Ghosh rescues India, shatters record books with explosive 94Richa Ghosh played a stunning innings of 94 to guide India from 102/6 to 251 against South Africa in their third fixture of the Women's World Cup 2025 in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-2025-preview-delhi-pitch-team-news-2800608-2025-10-09",
      "headline": "IND vs WI 2nd Test: Nearing perfection, India aim for 1st clean sweep under Gill eraIND vs WI 2nd Test preview: After a thumping win in Ahmedabad, the Indian team will be looking to complete their first clean sweep under the leadership of captain Shubman Gill. With bigger challenges awaiting, the hosts will look to keep their foot on the gas and secure the win against a West Indies team that has struggled to find answers to their perennial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-singapore-1-1-afc-asian-cup-2027-qualifier-2800640-2025-10-09",
      "headline": "10-man India fight back, escape with 1-1 draw vs Singapore in Asian Cup qualifierRahim Ali was India's hero as they fought back to secure a 1-1 draw against Singapore in their AFC Asian Cup 2027 qualifier on Thursday, October 9. India secured the draw after losing Sandesh Jhingan to a red card early in the second half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-on-shubman-gill-odi-captaincy-rohit-sharma-virat-kohli-india-australia-2025-2800576-2025-10-09",
      "headline": "Shubman Gill getting ODI captaincy might free up Rohit Sharma: Brad HaddinFormer Australia cricketer has backed Rohit Sharma to play more freely after Shubman Gill's appointment as the ODI captain. He also urged fans to come in huge numbers to watch Rohit and Virat Kohli play on their last tour to Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-gautam-gambhir-forced-india-retirement-test-2800542-2025-10-09",
      "headline": "Rohit Sharma and Gautam Gambhir didn't force my retirement: AshwinRavichandran Ashwin clarified that his retirement from international cricket was entirely his personal decision. He dismissed rumours suggesting Rohit Sharma or Gautam Gambhir forced him to step away from the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-2025-preview-delhi-pitch-team-news-2800608-2025-10-09",
      "headline": "IND vs WI 2nd Test: Nearing perfection, India aim for 1st clean sweep under Gill eraIND vs WI 2nd Test preview: After a thumping win in Ahmedabad, the Indian team will be looking to complete their first clean sweep under the leadership of captain Shubman Gill. With bigger challenges awaiting, the hosts will look to keep their foot on the gas and secure the win against a West Indies team that has struggled to find answers to their perennial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-singapore-1-1-afc-asian-cup-2027-qualifier-2800640-2025-10-09",
      "headline": "10-man India fight back, escape with 1-1 draw vs Singapore in Asian Cup qualifierRahim Ali was India's hero as they fought back to secure a 1-1 draw against Singapore in their AFC Asian Cup 2027 qualifier on Thursday, October 9. India secured the draw after losing Sandesh Jhingan to a red card early in the second half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-on-shubman-gill-odi-captaincy-rohit-sharma-virat-kohli-india-australia-2025-2800576-2025-10-09",
      "headline": "Shubman Gill getting ODI captaincy might free up Rohit Sharma: Brad HaddinFormer Australia cricketer has backed Rohit Sharma to play more freely after Shubman Gill's appointment as the ODI captain. He also urged fans to come in huge numbers to watch Rohit and Virat Kohli play on their last tour to Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-rohit-sharma-gautam-gambhir-forced-india-retirement-test-2800542-2025-10-09",
      "headline": "Rohit Sharma and Gautam Gambhir didn't force my retirement: AshwinRavichandran Ashwin clarified that his retirement from international cricket was entirely his personal decision. He dismissed rumours suggesting Rohit Sharma or Gautam Gambhir forced him to step away from the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-smriti-mandhana-breaks-belinda-clarks-world-record-2800535-2025-10-09",
      "headline": "Women's World Cup: Smriti Mandhana breaks Belinda Clark's world record in VizagSmriti Mandhana broke the 28-year-old record held by the legendary Belinda Clark during the Women's World Cup 25 fixture against South Africa. She achieved the milestone with a massive six straight down the ground against Ayabonga Khaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-shubman-gill-praises-ravindra-jadeja-no1-test-allrounder-2025-2800513-2025-10-09",
      "headline": "India lucky to have No.1 Test all-rounder Ravindra Jadeja in team: Shubman GillShubman Gill heaped praise on Ravindra Jadeja and said that the team is lucky to have him in the squad ahead of the second Test against West Indies. Jadeja was the Player Of The Match in the Ahmedabad Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dilip-vengsarkar-to-investigate-prithvi-shaws-on-field-spat-with-musheer-khan-2800472-2025-10-09",
      "headline": "Dilip Vengsarkar to investigate Prithvi Shaw's on-field spat with Musheer KhanDilip Vengsarkar has been appointed to investigate the confrontation involving Prithvi Shaw and Musheer Khan during the Mumbai vs Maharashtra warm-up fixture. Both state associations have initiated a formal inquiry into the on-field dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-sa-w-womens-world-cup-2025-amanjot-kaur-returns-renuka-singh-dropped-vizag-2800481-2025-10-09",
      "headline": "IND-W vs SA-W: Amanjot Kaur returns as India drop Renuka Singh for Vizag clashIndia have decided to bring back Amanjot Kaur for the clash against South Africa in Vizag on Thursday, October 9. Renuka Singh has been dropped from the lineup for the match after playing in the win against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ameesh-manek-indian-origin-director-of-football-brentford-career-2800471-2025-10-09",
      "headline": "Who is Ameesh Manek? Man United's new Indian-origin director of footballAmeesh Manek is set to join Manchester United as director of football operations, bringing Premier League and corporate experience to Old Trafford. He will oversee day-to-day football operations for both men's and women's teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-india-vs-west-indies-press-conference-delhi-test-play-win-all-formats-2800433-2025-10-09",
      "headline": "Shubman Gill sets his challenge as India captain: Want to play and win in all formatsIndia captain Shubman Gill made his intentions clear during the pre-match press conference ahead of the second Test against West Indies in New Delhi, stating that his goal is to play and win titles across all formats. Gill was recently promoted as India's ODI captain, adding to his role as Test skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-ms-dhoni-injury-recovery-womens-world-cup-form-2800413-2025-10-09",
      "headline": "Harleen Deol recalls special MS Dhoni chat during tough injury layoffWomen's World Cup: Harleen Deol fondly recalled her inspiring interaction with MS Dhoni during her six-month injury layoff, calling him her idol both on and off the field. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}