{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-pension-processing-now-similar-to-ops-rules-check-latest-guidelines-2694517-2025-03-17",
      "headline": "NPS pension processing now similar to OPS rules. Check latest guidelinesNew guidelines have been introduced to speed up the pension processing process and to ensure that retired employees receive their pensions on time without any trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-swp-investment-plans-what-is-the-difference-expert-view-money-tips-mutual-funds-2694510-2025-03-17",
      "headline": "SIP and SWP are not the same. Here's how they differSIP (Systematic Investment Plan) is a way to invest money in mutual funds at regular intervals, helping investors build wealth over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-tumbles-7-percent-to-fall-below-rs-50-for-first-time-analysts-future-performance-buy-sell-2694503-2025-03-17",
      "headline": "Ola Electric share price hits record low after insolvency petition. What next?Ola Electric share price: Today's tumble came after the company revealed that an insolvency petition had been filed against its subsidiary, Ola Electric Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forever-21-files-chapter-11-bankrupty-second-time-in-six-years-2694493-2025-03-17",
      "headline": "Fast-fashion retailer Forever 21 files for bankruptcy for 2nd time in 6 yearsForever 21 said it will conduct liquidation sales at its stores while simultaneously conducting a court‑supervised sale and marketing process for some or all of its assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-gains-5-after-rbis-statement-should-you-buy-analyst-views-2694480-2025-03-17",
      "headline": "IndusInd Bank share price gains 5% after RBI's statement. Buy or sell?The RBI's comments came after IndusInd Bank disclosed a 2.4% dent in its net worth due to a derivatives valuation issue. This triggered multiple downgrades, with analysts warning of a possible loss in the March quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irfc-set-to-declare-2nd-interim-dividend-today-check-all-key-details-share-price-and-more-2694469-2025-03-17",
      "headline": "IRFC shares rise as company set to declare 2nd interim dividend todayIRFC has already fixed March 21, 2025, as the record date for the dividend. This means that shareholders who hold IRFC shares as of this date will be eligible for the payout, subject to approval by the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/where-to-invest-rs-1000-stock-market-mutual-fund-sips-etfs-gold-silver-money-tips-2694463-2025-03-17",
      "headline": "Can't save more than Rs 1,000? Here's where to invest it smartlySimply saving your money isn't enough, because its value keeps decreasing. The only way to stay ahead of rising prices is to invest, even if you can start with just Rs 1,000 a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-on-the-rise-after-hsbc-upgrade-3-things-investors-need-to-know-2694462-2025-03-17",
      "headline": "Tata Motors share price rises after HSBC upgrade. 3 key takeaways for investorsTata Motors stock price: HSBC revised its target price to Rs 840, lower than its earlier estimate of Rs 930. Even with the cut, the new target suggests the stock could rise about 29% from current levels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-gains-7-percent-today-rbi-statement-liquidity-financial-condition-2694458-2025-03-17",
      "headline": "Explained: Why IndusInd Bank shares jumped 7% in early trade todayIndusInd Bank shares initially rose around 7% in early trade to reach a day's high of Rs 707.75 on the Bombay Stock Exchange (BSE). At around 9:45 am, shares of the company were up 4.59% to Rs 702.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-500-points-nifty-above-22500-why-is-the-stock-market-rising-today-3-factors-reasons-2694450-2025-03-17",
      "headline": "Sensex jumps 500 points: 3 reasons why the stock market is rising today?Sensex jumped over 500 points while Nifty gained over 150 points to go past the 22,500 mark. As of 9:35 AM, the S&P BSE Sensex was up 544.92 points to 74,373.83, while NSE Nifty50 added 169.65 points to 22,567.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-donald-trump-india-impact-sbi-research-key-things-to-know-2694449-2025-03-17",
      "headline": "Will Trump's reciprocal tariffs hit India hard? Here's all you need to knowIndian exporters are worried about US reciprocal tariffs, but a new report from SBI Research has indicated that the impact will be limited. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-250-points-higher-nifty-near-22500-indusind-bank-gains-4-percent-2694439-2025-03-17",
      "headline": "Sensex, Nifty jumps in early trade; IndusInd Bank gains 4%The S&P BSE Sensex was up 362.75 points to 74,191.66, while the NSE Nifty50 added 121 points to 22,518.20 as of 9:25 AM. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-scenes-cut-from-good-day-following-kim-sae-ron-controversy-2694544-2025-03-17",
      "headline": "Kim Soo-hyun's scenes cut from 'Good Day' following Kim Sae-ron controversyK-drama actor Kim Soo-hyun's scenes from MBC's variety program 'Good Day' were edited after Kim Sae-ron controversy. The production house shared a statement and confirmed the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/erica-fernandes-opens-up-past-physical-abuse-reveals-impact-of-do-patti-movie-2694425-2025-03-17",
      "headline": "TV actor Erica Fernandes says Do Patti triggered memories of abusive relationshipActor Erica Fernandes shared her experience of physical abuse in a past relationship, highlighting how films like Do Patti resurfaced painful memories. Despite the challenges, she opened up about her journey towards healing and the societal pressures that kept her silent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-little-brother-holi-pic-2694313-2025-03-16",
      "headline": "Sidhu Moose Wala's little brother's Holi pic goes viral. Seen yet?A viral photo of Sidhu Moose Wala's little brother, Shubhdeep, dressed in traditional attire with Holi colours on his cheeks, has captured the hearts of fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-of-us-are-dead-actor-lomon-on-india-i-think-of-taj-mahal-and-bengal-tigers-2694255-2025-03-16",
      "headline": "All Of Us Are Dead actor Lomon on India: I think of Taj Mahal and Bengal TigersSouth Korean actor Lomon, known for his role in All of Us Are Dead, discussed his latest project Family Matters and shared insights on his career and inspirations in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-discoloured-nails-not-nailpaint-sideeffect-of-chemotherapy-2694210-2025-03-16",
      "headline": "Hina Khan shares pic of discoloured nails: Most common side effect of chemotherapyTelevision actor Hina Khan opened up about the side effects of chemotherapy on her nails, sharing a glimpse of the discolouration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saira-banu-says-she-shouldnt-be-called-ar-rahmans-ex-wife-were-not-divorced-only-separated-2694208-2025-03-16",
      "headline": "Saira Banu says she shouldn't be called AR Rahman's ex-wife: We're not divorcedSaira Banu, wife of AR Rahman, clarifies that they are separated but not divorced, addressing recent rumours. She cites her health issues as a reason and wishes Rahman well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chahar-choudhary-ankit-gupta-unfollow-each-other-stmp-2694198-2025-03-16",
      "headline": "Priyanka Chahar Choudhary-Ankit Gupta unfollow each other, fans speculate break-upTelevision actors Priyanka Chahar Choudhary and Ankit Gupta, known for their chemistry on Udaariyaan, have unfollowed each other on Instagram, sparking rumours about their relationship status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-health-update-son-ameen-dehydartion-composer-discharged-2694173-2025-03-16",
      "headline": "AR Rahman discharged from hospital, son shares health updateAR Rahman's son Ameen shared an update on the music maestro's health, explaining his hospitalisation was due to dehydration. He assured fans that Rahman is now recovering well. India Today Digital has learnt that the composer has also been discharged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-plays-holi-with-girlfriend-ankita-kukreti-sanjeeda-shaikh-divorce-2693960-2025-03-15",
      "headline": "Watch: Actor Aamir Ali plays Holi with girlfriend Ankita KukretiTelevision actor Aamir Ali was seen celebrating Holi with his girlfriend Ankita Kukreti.  The couple's public appearance comes after Aamir confirmed his relationship status in a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ted-lasso-starring-jason-sudeikis-show-renewed-for-fourth-season-apple-tv-2693905-2025-03-15",
      "headline": "Ted Lasso returns: Jason Sudeikis show renewed for fourth seasonApple TV+ has renewed Ted Lasso for a fourth season with Jason Sudeikis leading the charge once more. The new season will introduce Ted coaching a women's football team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-says-thank-you-india-shares-lollapalooza-performance-glimpse-photo-dump-2693841-2025-03-15",
      "headline": "Singer Shawn Mendes says 'dhanyawad' to India after Lollapalooza performanceSinger Shawn Mendes visited India for Lollapalooza 2025 and is currently in the nation, expressing his gratitude through social media post. He especially appreciated Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-hosts-hasan-minhaj-indore-treat-2693783-2025-03-15",
      "headline": "Stand-up comic Zakir Khan treats Hasan Minhaj with delicious Indore foodZakir Khan hosted Hasan Minhaj in Indore, introducing him to the city's street food culture and hinting at a future collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-potato-lab-review-kang-taeoh-lee-sunbin-lead-netflix-quirky-comedy-2693681-2025-03-14",
      "headline": "The Potato Lab review: Kang Tae-oh, Lee Sun-bin lead this quirky comedyReleased-Sat Mar 01, 2025The Potato Lab is a fun K-drama set in a picturesque mountain valley. While it offers laughs and visual appeal, it sometimes lacks depth and originality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exploring-age-gaps-in-k-dramas-my-dearest-nemesis-moon-gayoung-choi-hyunwook-2686740-2025-03-14",
      "headline": "Exploring age gaps in K-dramas: Why do they cause so much buzz?K-dramas often feature age differences between lead actors, sparking debate among fans. While such gaps are common in real life, they draw more attention on screen. In this K-Fix, we will find out why do they matter so much."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-returns-with-podcast-about-successful-women-days-after-cooking-show-2693652-2025-03-14",
      "headline": "Meghan Markle returns with podcast about successful women days after cooking showMeghan Markle, Duchess of Sussex, has announced her new stint. She will now be launching a podcast, narrating the stories of successful women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-celebrates-holi-apoorva-mukhija-returns-instagram-india-got-latent-2693645-2025-03-14",
      "headline": "Ashish Chanchlani celebrates Holi with director Abhishek KapoorAmid the India's Got Latent controversy, social media influencers Ashish Chanchlani and Apoorva Mukhija seemed to be moving forward in their respective journeys. Chanchlani stepped out to celebrate Holi, while Mukhija made her Instagram comeback, expressing gratitude to her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hema-malini-seen-with-a-script-for-reality-show-on-indian-idol-fans-react-2693602-2025-03-14",
      "headline": "Hema Malini seen with a 'script for reality show' on Indian Idol, fans reactA Reddit post suggested the scripted nature of Indian Idol as actor Hema Malini was seen holding a detailed script during a recent episode. The revelation has sparked reactions online, questioning the authenticity of reality shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/k-drama-star-lomon-on-family-matters-taj-mahal-speaks-in-hindi-india-all-of-us-are-dead-exclusive-2693616-2025-03-14",
      "headline": "K-drama star Lomon on Family Matters, Taj Mahal, India, All of Us are Dead | ExclusiveK-drama star Lomon sits down with India Today's Bhavna Agarwal to talk about his latest release, Family Matters, now streaming on Channel K. He has a special message for Indian fans as well. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-accident-video-cctv-driver-student-gujarat-rakshit-chaurasia-2694399-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Minutes before Vadodara crash: CCTV footage reveals accused, friend's activitiesNew CCTV footage showed the Vadodara crash accused and his friend minutes before the crash, where he allegedly drove intoxicated, killing a woman and injuring four others on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-declares-pardons-issued-by-joe-biden-void-signed-by-autopen-2694519-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump declares pardons issued by Joe Biden void: Done by autopenDonald Trump claimed that Joe Biden did not sign the order issuing the pardons and had no knowledge of the same."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-gold-smuggling-kannada-actor-karnataka-mla-basanagouda-patil-yatnal-hiding-gold-bengaluru-2694448-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "She hid gold wherever…: BJP MLA's vulgar remark against Ranya RaoKarnataka BJP MLA Basangouda Patil Yatnal, who made a vulgar remark against actor Ranya Rao, also said that state ministers are involved in the case and that he will expose them in the Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-immigration-self-deportation-cbp-home-app-united-states-ranjani-srinivasan-2694520-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Indian Columbia student flees, Elon Musk endorses self-deportation appRanjani Srinivasan, an Indian Columbia student, used the CBP Home App, launched by the Donald Trump administration to allow individuals to lawfully 'self-deport', avoiding the risk of arrest and detention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-did-gauri-spratt-fall-in-love-with-aamir-khan-she-answers-2694521-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why did Gauri Spratt fall in love with Aamir Khan? She answersGauri Spratt lists the reasons that made her fall in love with Aamir Khan. The superstar introduced his live-in partner to the media last week ahead of his 60th birthday celebration. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tasmac-liquor-scam-protest-tamil-nadu-cops-detain-bjp-leaders-annamalai-tamilisai-vinoj-p-selvam-2694528-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Annamalai, Tamilisai Soundararajan detained ahead of protest over liquor scamTamil Nadu BJP leaders, including current and previous state chiefs K Annamalai and Tamilisai Soundararajan, were detained ahead of their planned protest against the alleged Rs 1,000 crore TASMAC liquor scam. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-army-officer-son-allege-45-minute-thrashing-by-punjab-cops-with-baseball-bats-2694504-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Army officer, son allege 45-minute thrashing by Punjab cops with baseball batsThree Patiala Police officials allegedly assaulted a senior Army officer and his son in Patiala for 45 minutes, leaving the officer with a fractured arm and his son with head injuries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-tumbles-7-percent-to-fall-below-rs-50-for-first-time-analysts-future-performance-buy-sell-2694503-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ola Electric share price hits record low after insolvency petition. What next?Ola Electric share price: Today's tumble came after the company revealed that an insolvency petition had been filed against its subsidiary, Ola Electric Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-butch-wilmore-thank-musk-trump-for-aiding-return-be-back-before-too-long-2694401-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nasa reveals astronauts' return date, Sunita Williams says 'Be back before long'Nasa has confirmed that astronauts Sunita Williams and Butch Wilmore, stranded on the ISS for over nine months due to Starliner spacecraft issues, will return to Earth on Tuesday. Their ocean splashdown near Florida is set for 3:27 am IST on March 19, rescheduled from Wednesday for better weather conditions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/baloch-rebels-release-first-visuals-of-attack-on-pakistan-military-convoy-2694318-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Baloch insurgents release first visuals of attack on Pakistan military convoyThe Majeed Brigade, along with another BLA's unit, Fateh Squad, targeted a military convoy, comprising eight buses, one of which was completely destroyed in the explosion in Balochistan's Noshki, said the BLA in an official statement earlier in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-jumps-500-points-nifty-above-22500-why-is-the-stock-market-rising-today-3-factors-reasons-2694450-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex jumps 500 points: 3 reasons why the stock market is rising today?Sensex jumped over 500 points while Nifty gained over 150 points to go past the 22,500 mark. As of 9:35 AM, the S&P BSE Sensex was up 544.92 points to 74,373.83, while NSE Nifty50 added 169.65 points to 22,567.15. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-accused-of-grenade-attack-at-amritsar-temple-killed-in-police-encounter-2694465-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man accused of grenade attack at Amritsar temple killed in police encounterThe prime suspect in the Amritsar temple grenade attack, Gursidak Singh, was killed in a police encounter on Monday, while his accomplice, Vishal, managed to escape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-national-award-for-emergency-no-oscar-2694417-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No silly Oscar, we have National Awards: Kangana Ranaut on EmergencyKangana Ranaut's Emergency released on Netflix recently and has been receiving polarising reviews on social media. A fan said that Emergency should be sent for Oscar and Kangana rejected the Academy Award calling it silly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-south-is-resisting-the-delimitation-exercise-2694305-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the South is resisting the Delimitation ExerciseThe South's efforts to preserve its political voice, federal autonomy, and economic contributions at odds with the North's cries of under-representation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mumbai-woman-gets-fake-call-about-misuse-of-her-aadhaar-card-loses-over-rs-20-crore-in-scam-2694478-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai woman loses Rs 20 crore in fake Aadhaar card misuse call scamScammers called the victim and informed her that her Aadhaar was being used in illegal activities. They then threatened her with legal action and asked her to transfer money to settle the case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-chief-minister-devendra-fadnavis-as-cruel-as-aurangzeb-says-congress-bjps-disgrace-retort-2694437-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis as cruel as Aurangzeb, says Congress; BJP's 'disgrace' retortMaharashtra Congress chief Harshwardhan Sapkal stirred controversy by likening Devendra Fadnavis to Aurangzeb, calling both \"cruel rulers\" who used religion for power. The BJP slammed Congress, accusing it of insulting Maharashtra's identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/oxford-historian-research-india-uk-home-office-husband-academic-legal-challenge-2694249-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oxford historian facing deportation from UK after research in India. Here's whyA 37-year-old Indian historian from Oxford University is facing deportation threats from the UK after the Home Office ruled that she exceeded the number of days permitted to live and conduct research in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-police-anti-eve-teasing-squad-sexual-harassment-new-team-hotspots-patrol-2694427-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Police's new anti-harassment squads instructed against 'imposing morality''Shistachar Squads' will be formed in Delhi to prevent 'eve-teasing' by 'enforcing the law without imposing personal or cultural morality' while also protecting victims from public scrutiny and harassment, according to the order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-lex-fridman-podcast-reflects-on-2002-godhra-riots-misinformation-that-they-were-biggest-ever-2694337-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi reflects on 2002 Godhra riots: Misinformation that they were biggest everPrime Minister Narendra Modi said there were concerted efforts that the 2002 riots were the biggest ever in Gujarat. He pointed out that the state had a long history of violence \"long before I was in the picture\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/reddit-user-nobody-wants-to-do-business-with-indians-viral-post-triggers-debate-2694464-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Reddit user's 'nobody wants to do business with Indians' post triggers debateIn the post titled \"Why does nobody want to do business with Indians?\" on the r/AskIndia subreddit, the user who works in B2B (business-to-business) said he has observed that emails sent using a non-Indian name yielded better results than those sent with an Indian name.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/goodnight-friends-blue-ghost-ends-lunar-mission-with-emotional-message-from-the-moon-2694438-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Goodnight friends: Blue Ghost ends lunar mission with emotional message from the MoonBlue Ghost's emotional farewell message reflects on humanity's journey into space, emphasising the enduring legacy of human ingenuity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-reflects-on-growing-up-in-poverty-in-conversation-with-us-podcaster-lex-fridman-2694289-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Collected chalk to clean my white shoes: PM reflects on growing up in povertyPrime Minister Narendra Modi shared memories of his childhood in poverty, recalling how he polished his shoes with chalk. He reflected on Vadnagar's rich history, highlighting its Buddhist heritage and excavation projects that revealed its cultural significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-donald-trump-india-impact-sbi-research-key-things-to-know-2694449-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Trump's reciprocal tariffs hit India hard? Here's all you need to knowIndian exporters are worried about US reciprocal tariffs, but a new report from SBI Research has indicated that the impact will be limited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-crash-accused-rakshit-chaurasiya-rams-car-locals-thrashed-drunk-locality-2694353-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vadodara crash accused was thrashed last month over chaos while being drunkThe 20-year-old Vadodara crash accused, who killed a woman after ramming his car on her scooter on Friday, was once thrashed by locals for creating chaos in a locality in the city last month. However, he was left off with a warning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-influencer-orry-7-others-face-charges-for-alleged-drinking-at-vaishno-devi-camp-katra-fir-lodged-2694545-2025-03-17",
      "headline": "Influencer Orry, 7 others face charges for alleged drinking at Vaishno Devi baseJ&K police on Monday filed an FIR against Bollywood influencer Orry, and seven others, including a Russian national, for allegedly consuming alcohol at a hotel in Katra, near Vaishno Devi shrine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-empuraan-times-square-promo-screening-at-new-york-2694526-2025-03-17",
      "headline": "Mohanlal's Empuraan takes over Times Square, promo screened in New YorkThe promo of Malayalam superstar Mohanlal's upcoming film, Empuraan, was screened at New York's Times Square. Over 300 fans of Mohanlal gathered in Times Square for the celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-did-gauri-spratt-fall-in-love-with-aamir-khan-she-answers-2694521-2025-03-17",
      "headline": "Why did Gauri Spratt fall in love with Aamir Khan? She answersGauri Spratt lists the reasons that made her fall in love with Aamir Khan. The superstar introduced his live-in partner to the media last week ahead of his 60th birthday celebration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/bhumi-pednekar-completes-course-at-harvard-shares-selfie-with-jacinda-ardern-2694527-2025-03-17",
      "headline": "Bhumi Pednekar's Harvard diaries: Leadership lessons, selfie with John Harvard statueActor Bhumi Pednekar completed a leadership course at Harvard. She shared moments from her journey, including a selfie with former New Zealand PM Jacinda Ardern and John Harvard's statue."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-begins-practicing-with-intense-net-session-2694549-2025-03-17",
      "headline": "Watch: Virat Kohli begins practicing for IPL 2025 with intense net sessionRoyal Challengers Bengaluru (RCB) batter Virat Kohli has begun practicing for upcoming Indian Premier League 2025 (IPL 2025) through an intense net session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-umran-malik-story-dale-steyn-yorker-2694522-2025-03-17",
      "headline": "IPL 2025: When Umran Malik proved Dale Steyn 'wrong' with 155 kmph thunderboltDale Steyn recalled how Umran Malik once proved him wrong by bowling a 155 kmph yorker and going against his advice. Umran enjoyed a fruitful time under Steyn's guidance at SRH in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/league-cup-final-liverpool-vs-newcastle-united-arne-slot-reaction-2694490-2025-03-17",
      "headline": "Liverpool boss Arne Slot calm despite League Cup loss: Part of playing footballLiverpool boss Arne Slot is remaining calm despite his side's League Cup final loss to Newcastle United at Wembley on Sunday, March 16. The final loss rounded off a horrible week for Liverpool as they crashed out of the Champions League as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohit-sharma-rates-delhi-capitals-bowling-attack-as-best-ever-2694466-2025-03-17",
      "headline": "Delhi Capitals' bowling attack is the best I've been a part of in IPL: Mohit SharmaSeamer Mohit Sharma rated Delhi Capitals' bowling attack as the best he's ever been a part of in IPL history. Mohit was bought by Delhi for Rs 2.20 Crore in the mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-lucknow-super-giants-squad-2694456-2025-03-17",
      "headline": "LSG optimistic that Mayank Yadav will join squad around April 2nd weekLucknow Super Giants are optimistic that Mayank Yadav will join the squad around the second week of April for the IPL 2025 campaign. Mayank is stepping up his recovery and LSG are waiting for the green signal from the BCCI Centre Of Excellence regarding the pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-wanted-to-retire-after-his-100th-test-and-even-invited-ms-dhoni-2694430-2025-03-17",
      "headline": "Wanted to retire after playing my 100th Test, had even invited MS Dhoni: R AshwinLegendary India all-rounder Ravichandran Ashwin recently revealed that he wanted to retire after playing his 100th Test and had even invited former India captain to present him with the memento."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/meera-andreeva-beats-aryna-sabalenka-to-claim-indian-wells-title-2694421-2025-03-17",
      "headline": "17-year-old Mirra Andreeva shocks World No. 1 Sabalenka to win Indian Wells crownRussia's teenage star Mirra Andreeva edged past world number one Aryna Sabalenka to win the Indian Wells final. The 17-year-old beat the three-time Grand Slam champion 2-6 6-4 6-3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-beat-liverpool-to-win-league-cup-dan-burn-alexander-isak-2694414-2025-03-17",
      "headline": "Dan Burn, Alexander Isak guide Newcastle to League Cup triumph over LiverpoolNewcastle beat Liverpool 2-1 in the League Cup final riding on Dan Burn and Isak Alexander's goal to win their first major domestic trophy in 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-tino-best-heated-face-off-indian-masters-vs-west-indies-masters-2694398-2025-03-17",
      "headline": "Watch: Yuvraj Singh, Tino Best get involved in heated face off during IML finalLegendary India all-rounder Yuvraj Singh and West Indies fast bowler Tino Best got involved in a heated face-off during the final of International Masters League between the India Masters and the West Indies Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-vs-chelsea-report-highlights-2694375-2025-03-16",
      "headline": "Arsenal beat Chelsea 1-0 to keep title hopes alive in Premier LeagueArsenal stayed in the hunt of the Premier League by beating Chelsea 1-0 on Sunday, March 16. Mikel Merino scored the winner in what turned out to be a scrappy game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/international-masters-league-final-india-vs-west-indies-sachin-tendulkar-2694371-2025-03-16",
      "headline": "Sachin Tendulkar unleashes classic upper cut as India beat West Indies in IML finalIndia beat West Indies to win the inaugural edition of the International Masters League on Sunday, March 16. The crowd went gaga as Sachin Tendulkar unleashed his sensational upper-cut shot in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/meera-andreeva-beats-aryna-sabalenka-to-claim-indian-wells-title-2694421-2025-03-17",
      "headline": "17-year-old Mirra Andreeva shocks World No. 1 Sabalenka to win Indian Wells crownRussia's teenage star Mirra Andreeva edged past world number one Aryna Sabalenka to win the Indian Wells final. The 17-year-old beat the three-time Grand Slam champion 2-6 6-4 6-3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/newcastle-united-beat-liverpool-to-win-league-cup-dan-burn-alexander-isak-2694414-2025-03-17",
      "headline": "Dan Burn, Alexander Isak guide Newcastle to League Cup triumph over LiverpoolNewcastle beat Liverpool 2-1 in the League Cup final riding on Dan Burn and Isak Alexander's goal to win their first major domestic trophy in 70 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-tino-best-heated-face-off-indian-masters-vs-west-indies-masters-2694398-2025-03-17",
      "headline": "Watch: Yuvraj Singh, Tino Best get involved in heated face off during IML finalLegendary India all-rounder Yuvraj Singh and West Indies fast bowler Tino Best got involved in a heated face-off during the final of International Masters League between the India Masters and the West Indies Masters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-vs-chelsea-report-highlights-2694375-2025-03-16",
      "headline": "Arsenal beat Chelsea 1-0 to keep title hopes alive in Premier LeagueArsenal stayed in the hunt of the Premier League by beating Chelsea 1-0 on Sunday, March 16. Mikel Merino scored the winner in what turned out to be a scrappy game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/international-masters-league-final-india-vs-west-indies-sachin-tendulkar-2694371-2025-03-16",
      "headline": "Sachin Tendulkar unleashes classic upper cut as India beat West Indies in IML finalIndia beat West Indies to win the inaugural edition of the International Masters League on Sunday, March 16. The crowd went gaga as Sachin Tendulkar unleashed his sensational upper-cut shot in the final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-did-not-want-rcb-captaincy-rajat-patidar-2694369-2025-03-16",
      "headline": "Virat Kohli did not want to captain RCB, Rajat was best option: Jitesh SharmaRCB wicketkeeper-batter Jitesh Sharma feels that Virat Kohli did not want to captain the franchise. Jitesh feels that Rajat Patidar was RCB's best option.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-umran-malik-injury-kkr-replcament-chetan-sakariya-2694362-2025-03-16",
      "headline": "Pacer Umran Malik ruled out of IPL 2025, KKR announce replacementKolkata Knight Riders' tearaway pacer Umran Malik has been ruled out of the Indian Premier League's 2025 season. KKR have replaced Umran with Chetan Sakariya.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-corbin-bosch-served-legal-notice-psl-2694360-2025-03-16",
      "headline": "Cricketer in trouble after opting for IPL over PSL: PCB issues legal noticeThe Pakistan Cricket Board (PCB) has issued a legal notice to Corbin Bosch for breaching his contract after he withdrew from the Pakistan Super League (PSL) to join Mumbai Indians as an IPL replacement. This is the first time the PSL window clashes with the IPL.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bcci-nca-doctor-nitin-patel-resigns-vvs-laxman-2694346-2025-03-16",
      "headline": "BCCI Sports Science head resigns, NCA expected to see major changesBCCI's newly inaugurated Centre of Excellence (COE) is set to undergo staff changes after Nitin Patel resigned as head of the Sports Science and Medical team. Additionally, several coaches, including those from NCA, may move on in the coming months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-abishek-porel-axar-patel-rishabh-pant-2694341-2025-03-16",
      "headline": "Dehli Capitals will miss Rishabh Pant: Abishek Porel nostalgic ahead of new seasonDelhi Capitals wicketkeeper-batter Abishek Porel has said that the team will miss Rishabh Pant. In an interview with Sports Today, Porel drew similarities between the captaincies of Rishabh and Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-preview-2694233-2025-03-16",
      "headline": "DC Preview: Delhi Capitals enter Axar Patel era to end title droughtIPL 2025: Delhi Capitals, captained by Axar Patel, will begin their campaign on March 24 against Lucknow Super Giants with the aim of ending their 17-year-long wait to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-regret-rr-2694324-2025-03-16",
      "headline": "MS Dhoni reveals IPL moment he regrets the most: That was a big mistakeMS Dhoni revealed the IPL moment he regrets the most ahead of the start of the 2025 campaign. Dhoni is all set to play his 18th IPL campaign and will be part of CSK once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-shardul-thakur-lsg-training-photo-2694320-2025-03-16",
      "headline": "Shardul Thakur to LSG? All-rounder sparks rumours after photo goes viralMumbai all-rounder Shardul Thakur's photos wearing the Lucknow Super Giants training kit have gone viral. The photos sparked rumours about whether he was going to join the injury-stricken side for the upcoming edition of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-abishek-porel-axar-patel-rishabh-pant-2694341-2025-03-16",
      "headline": "Dehli Capitals will miss Rishabh Pant: Abishek Porel nostalgic ahead of new seasonDelhi Capitals wicketkeeper-batter Abishek Porel has said that the team will miss Rishabh Pant. In an interview with Sports Today, Porel drew similarities between the captaincies of Rishabh and Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-preview-2694233-2025-03-16",
      "headline": "DC Preview: Delhi Capitals enter Axar Patel era to end title droughtIPL 2025: Delhi Capitals, captained by Axar Patel, will begin their campaign on March 24 against Lucknow Super Giants with the aim of ending their 17-year-long wait to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-regret-rr-2694324-2025-03-16",
      "headline": "MS Dhoni reveals IPL moment he regrets the most: That was a big mistakeMS Dhoni revealed the IPL moment he regrets the most ahead of the start of the 2025 campaign. Dhoni is all set to play his 18th IPL campaign and will be part of CSK once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-shardul-thakur-lsg-training-photo-2694320-2025-03-16",
      "headline": "Shardul Thakur to LSG? All-rounder sparks rumours after photo goes viralMumbai all-rounder Shardul Thakur's photos wearing the Lucknow Super Giants training kit have gone viral. The photos sparked rumours about whether he was going to join the injury-stricken side for the upcoming edition of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-karun-anir-exclusive-delhi-capitals-second-stint-2694306-2025-03-16",
      "headline": "IPL 2025: 'Mature' Karun Nair eager to grab opportunities in second DC stintIn an exclusive interaction with India Today, Karun Nair hopes he can bring in the maturity he has gained in recent times to the IPL during his second stint with the Delhi Capitals. Karun spent 2 seasons with Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-karun-nair-comments-2694293-2025-03-16",
      "headline": "Karun Nair backing on domestic form to conquer IPL 2025Vidarbha batter Karun Nair was roped in by Delhi Capitals ahead of the IPL 2025. Nair hoped to translate his domestic form into the IPL this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-pm-narendra-modi-lex-fridman-podcast-2694290-2025-03-16",
      "headline": "Results reveal who is better: PM Modi on India-Pakistan cricket rivalryPrime Minister Narendra Modi commented on sports and the famous India-Pakistan cricket rivalry on the Lex Fridman podcast. PM Modi also opened up on who he feels is the best footballer of all time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-daughter-playing-holi-illegal-shahabuddin-razvi-2694252-2025-03-16",
      "headline": "Cleric who slammed Shami over roza now criticises his daughter for playing HoliThe cleric who had slammed Mohammed Shami for not keeping fast during Ramzan has criticised the pacer's daughter for playing holi. He said that it was a crime and against Shariat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-real-madrid-carlo-ancelotti-72-hours-rest-villareal-win-2694244-2025-03-16",
      "headline": "Real Madrid won't play again without 72 hours of rest: Boss Carlo AncelottiReal Madrid boss Carlo Ancelotti claimed that his team will never play a game again without a 72-hour rest period. Real Madrid defeated Villareal on Saturday 2-1, but the game happened 66 hours after their shootout win in the Champions League against Atletico Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-schedule-fixtures-dates-2694235-2025-03-16",
      "headline": "Delhi Capitals Complete Schedule: Full DC Fixtures, Venues, Match DatesDelhi Capitals IPL 2025 Full Schedule, DC Squad: Axar Patel's Capitals will be looking to end their title drought when they get their campaign underway on March 24 against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-kuldeep-yadav-india-team-return-2694226-2025-03-16",
      "headline": "Yuzvendra Chahal 'happy' for Kuldeep Yadav, not thinking about India returnYuzvendra Chahal said he is happy to see Kuldeep Yadav excel in the Indian team and hailed him as the best wrist-spinner in the world at the moment. Chahal also said he isn't thinking about the Indian team return at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-lewis-hamilton-ferrari-australian-grand-prix-2694211-2025-03-16",
      "headline": "Lewis Hamilton rues missing big chance at Australian GP in lacklustre Ferrari debutLewis Hamilton reacted to a lacklustre debut for Ferrari and lamented missing out on a big chance during the Australian Grand Prix on Sunday, March 16. Hamilton struggled during the tricky race and finished 10th in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-100th-hundred-international-career-on-this-day-2694199-2025-03-16",
      "headline": "On This Day: Sachin Tendulkar creates history with 100th hundred of his careerOn this day in 2012, Sachin Tendulkar scored his 100th international hundred during an Asia Cup tie against Bangladesh. Tendulkar reached the landmark at the Sher-e-Bangla National Stadium in Mirpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-delhi-capitals-marizanne-kapp-final-video-2694195-2025-03-16",
      "headline": "Watch: Distraught DC all-rounder breaks down after Delhi Capitals lose finalWPL 2025: Mariznne Kapp broke down in tears and was consoled by her teammates Alice Capsey and Jemimah Rodrigues after Delhi Capitals lost to Mumbai Indians in the final on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-lando-norris-australian-gp-win-reaction-2694185-2025-03-16",
      "headline": "F1: Lando Norris happy with winning start despite 'stressful' Australian GPLando Norris said he was happy to start the F1 2025 season with a win but admitted that the Australian GP was stressful for him. Norris was able to hold off Max Verstappen to secure the win on Sunday, March 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-rcb-nat-sciver-brunt-mumbai-indian-stats-2694181-2025-03-16",
      "headline": "RCB's record chase, Nat Sciver-Brunt's dream run and more statsWPL 2025: The 22 matches in the Women's Premier League saw plenty of records being broken. The tournament came to a close with Mumbai Indians (MI) lifting the title for the second time at the Brabourne Stadium in Mumbai on Saturday. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}