{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-slip-as-investors-book-profits-titan-it-stocks-shine-2799831-2025-10-08",
      "headline": "Sensex, Nifty slip as investors book profits; Titan, IT stocks shineThe S&P BSE Sensex fell over 150 points to close below the 82,000 mark, while the Nifty50 slipped more than 60 points to settle just above 25,000. Broader market indices also ended lower, reflecting heightened volatility throughout the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dalal-street-ipo-rush-subscribe-or-skip-stock-market-news-2799811-2025-10-08",
      "headline": "Subscribe or skip: Should you ride the ongoing IPO wave on Dalal Street?The IPO rush is exciting, but are investors chasing glitter or real growth? With many listings already below issue price, will patience and selectivity matter more than speed this year?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-fined-rs-20-lakh-by-aviation-regulator-for-pilot-simulator-training-lapse-2799810-2025-10-08",
      "headline": "IndiGo fined Rs 20 lakh by aviation regulator for pilot simulator training lapseThe penalty, imposed on September 26, pertains to the use of non-qualified simulators for training pilots operating at high-risk airports such as Calicut, Leh, and Kathmandu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-issue-centre-of-action-noel-mehli-mistry-pramit-jhaveri-jehangir-darius-khambata-2799761-2025-10-08",
      "headline": "Tata Group rift: Which trustees are at the heart of the recent tussle for control?With Home Minister Amit Shah and Finance Minister Nirmala Sitharaman stepping in to mediate, all eyes are on the people behind the row. Who are these four trustees challenging Noel Tata's leadership, and how did their differences push one of India's most trusted business families into rare public turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-real-estate-stocks-a-good-bet-right-now-experts-answer-2799788-2025-10-08",
      "headline": "Are real estate stocks a good bet right now? Experts answerGaurang Shah of Geojit Financial Services, the real estate sector has seen a visible turnaround in the last few years, with developers showing financial discipline and faster project execution. However, he added a word of caution for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-rs-80k-grew-to-rs-19-lakh-savings-through-simple-habits-expert-explains-2799742-2025-10-08",
      "headline": "How Rs 80K grew to Rs 1.9 lakh savings through simple habits, expert explainsYou don't always need a higher salary to grow your wealth. According to an expert, small, intentional changes in spending and saving helped a client turn his Rs 80,000 salary into Rs 1.9 lakh savings in half a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-urges-tata-group-to-resolve-dispute-and-restore-stability-report-2799731-2025-10-08",
      "headline": "Government urges Tata Group to resolve dispute and restore stability: ReportThe government has urged the Tata Group to restore stability in Tata Trusts following internal disputes that risk affecting Tata Sons, India's largest conglomerate, according to The Economic Times. The conflict involves four trustees within Tata Trusts, who are said to have acted as a \"super board,\" challenging Chairman Noel Tata's authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capitals-175-billion-ipo-fully-subscribed-after-strong-institutional-backing-2799707-2025-10-08",
      "headline": "Tata Capital's $1.75 billion IPO fully subscribed after strong institutional backingTata Capital has successfully completed its $1.75 billion IPO, fully subscribed thanks to robust demand from qualified institutional buyers, setting the stage for its stock market debut on October 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-groups-trusts-boardroom-battle-infighting-corporate-governance-explained-2799680-2025-10-08",
      "headline": "Another boardroom battle at Tata Group?The current crisis arises from a power tussle within Tata Trusts, the philanthropic arm that holds a controlling stake in Tata Sons, the holding company that runs the operations of the Tata Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-cuts-lending-rates-will-your-emis-drop-2799671-2025-10-08",
      "headline": "HDFC Bank cuts lending rates. Will your EMIs drop?HDFC Bank has announced a reduction in its Marginal Cost of Funds-based Lending Rate (MCLR), raising hopes for borrowers. The cut could translate into lower EMIs for many customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-rs-122-lakh-per-10-grams-what-should-investors-do-now-gold-prices-2799637-2025-10-08",
      "headline": "Gold hits record Rs 1.22 lakh per 10 grams. What should investors do now?Gold prices surged past Rs 1.22 lakh per 10 grams on Wednesday, driven by global uncertainty, a weak dollar, and expectations of US interest rate cuts. Investors are now wondering whether to buy, sell, or stay put."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-calls-for-smarter-ways-to-unlock-indias-3-trillion-gold-treasure-2799599-2025-10-08",
      "headline": "Nithin Kamath calls for smarter ways to unlock India's $3 trillion gold treasureIndia's homes hold an estimated $3 trillion worth of gold, a treasure that mostly lies untouched. Zerodha's Nithin Kamath believes it's time to put this idle wealth to work through smarter financial ideas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-shares-jump-over-4-percent-today-key-factors-behind-the-rally-2799594-2025-10-08",
      "headline": "Titan shares jump over 4% today: What's driving the rally?At around 11:02 am, Titan's stock was trading 4.26% higher at Rs 3,562 on the Bombay Stock Exchange (BSE). The rally came after the company announced that its domestic jewellery segment grew 19% year-on-year during the July–September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-trust-news-government-asks-restore-stability-amit-shah-meeting-noel-tata-report-2799554-2025-10-08",
      "headline": "Trouble in Tata Group? Government asks leadership to restore stability, says reportThe meeting was aimed at maintaining calm within the Tata Trusts, which holds a controlling stake in Tata Sons, the holding company of India's largest conglomerate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-to-invest-10-billion-in-visakhapatnam-data-hub-its-biggest-bet-on-india-yet-2799552-2025-10-08",
      "headline": "Google to invest $10 billion in Visakhapatnam data hub: ReportThe project will include the construction of three high-capacity submarine cables, dedicated cable landing stations, metro fibre networks, and advanced telecommunications infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-gain-for-5th-straight-session-tata-group-shares-in-focus-2799549-2025-10-08",
      "headline": "Sensex, Nifty rally for 5th straight session; Tata Group shares in focusThe S&P BSE Sensex opened firm and was trading 159.69 points higher at 82,086.44 around 9:22 am, while the NSE Nifty50 advanced 39.15 points to 25,147.45. Broader market indices also mirrored the positive sentiment, with most trading in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-closes-today-tata-group-past-listings-profit-multibagger-allotment-2799544-2025-10-08",
      "headline": "Tata Capital IPO: Will it reward investors like other Tata Group listings?While Tata Capital enjoys strong brand credibility and steady growth, early subscription data and grey market trends indicate a modest response so far for the public listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-chandrasekaran-meeting-amit-shah-sitharaman-trust-governance-issue-vijay-singh-2799527-2025-10-08",
      "headline": "Noel Tata, Chandrasekaran meet Amit Shah amid Tata Trust governance row: ReportNoel Tata was joined by Venu Srinivasan, chairman emeritus of TVS Motor Company, and senior lawyer Darius Khambata for the meeting, which took place at Amit Shah's residence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-claim-maze-unlocked-how-solutions-and-reforms-can-restore-faith-2799266-2025-10-07",
      "headline": "PF claim maze unlocked: How solutions and reforms can restore faithMillions of salaried Indians rely on the Employees' Provident Fund for financial security, yet claiming it remains a maze. Experts propose steps and technological fixes to make the process smoother and hassle-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pulse-daal-crisis-msp-low-despite-high-demand-low-production-trouble-farmer-report-2799193-2025-10-07",
      "headline": "Pulse crisis: Why are prices crashing below MSP despite high demand?Despite this rising import bill, instead of expansion, the area under pulses cultivation has shrunk. Over the past four years, the area under pulses has declined by nearly 3.1 million hectares."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dk-shivakumar-urges-chance-for-bigg-boss-kannada-makers-to-rectify-errors-after-set-closure-order-2799771-2025-10-08",
      "headline": "DK Shivakumar on Bigg Boss Kannada 12 set closure order: Give them a chance Deputy Chief Minister of Karnataka DK Shivakumar said the makers of 'Bigg Boss Kannada' should be given a chance to rectify their mistakes and allowed to re-open the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karur-stampede-kills-41-at-vijay-rally-rishab-shetty-calls-it-collective-mistake-2799818-2025-10-08",
      "headline": "Rishab Shetty on Karur stampede that claimed 41 lives: It's a collective mistake Actor Rishab Shetty reacted to the Karur stampede that left 41 dead. He described the tragedy as a \"collective mistake\" and commented on crowd control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-dethrones-original-kantara-in-6-days-storms-box-office-worldwide-with-new-records-2799814-2025-10-08",
      "headline": "Kantara Chapter 1 dethrones original in 6 days, storms box office worldwide Kantara: Chapter 1 has shattered records worldwide, surpassing the original's lifetime collection within six days to earn Rs 427.5 crore globally. The Rishab Shetty-starrer is now the second highest-grossing Kannada film after KGF 2, setting new benchmarks across languages and markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mona-singh-continues-to-captivate-audiences-with-every-comeback-2799694-2025-10-08",
      "headline": "From TV to films, Mona Singh continues to captivate audiences with every comeback Mona Singh has mastered the art of supporting roles, consistently leaving a lasting impression with every character she plays. No matter the screen time, she always comes back with performances that the audience remembers and loves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/war-2-on-ott-when-and-where-to-watch-hrithik-roshan-jr-ntr-action-thriller-2799805-2025-10-08",
      "headline": "War 2 on OTT: When and where to watch Hrithik Roshan, Jr NTR's action-thriller After an Independence Day release earlier this year, Ayan Mukerji's 'War 2' is set for its release on OTT. The high stakes actioner stars Hrithik Roshan and Jr NTR as leads. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/people-we-meet-on-vacation-trailer-tom-blyth-emily-bader-netflix-romance-2799794-2025-10-08",
      "headline": "People We Meet on Vacation trailer: Tom Blyth, Emily Bader star in Netflix romance Netflix will premiere 'People We Meet on Vacation' on January 9, 2026. Tom Blyth and Emily Bader headline the film adaptation of Emily Henry's bestselling novel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/yash-raj-films-to-shoot-three-major-projects-in-uk-from-2026-uk-pm-keir-starmer-2799798-2025-10-08",
      "headline": "Yash Raj Films to shoot 3 major projects in UK from 2026: PM Keir Starmer Prime Minister Keir Starmer announced Yash Raj Films will shoot three major projects in the UK starting 2026. The move is set to create thousands of jobs and deepen UK-India creative industry ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malla-reddy-declines-villain-role-pawan-kalyan-ustaad-bhagat-singh-2799780-2025-10-08",
      "headline": "Politician Malla Reddy declines Rs 3 crore offer to play Pawan Kalyan's villain Politician and businessman Malla Reddy says he turned down Rs 3 crore offer to play a villain in Pawan Kalyan's film. Director Harish Shankar personally approached Reddy for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthis-cop-entertainer-vaa-vaathiyaar-to-release-in-december-new-poster-out-2799740-2025-10-08",
      "headline": "Karthi's cop entertainer Vaa Vaathiyaar to release in December, new poster out Karthi and Krithi Shetty's much anticipated commercial entertainer  'Vaa Vaathiyaar' is set to hit theatres this December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-emotional-kaun-banega-crorepati-17-late-mother-message-2799693-2025-10-08",
      "headline": "KBC 17: Amitabh Bachchan tears up hearing special message on birthday Amitabh Bachchan moved to tears on his 83rd birthday special episode of 'Kaun Banega Crorepati' 17. An audio clip of his late mother Teji Bachchan, expressing her pride was played. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/too-hot-to-handle-stars-emily-miller-and-cam-holmes-are-engaged-2799766-2025-10-08",
      "headline": "Too Hot to Handle stars Emily Miller and Cam Holmes are engaged Emily Miller and Cam Holmes, stars of 'Too Hot to Handle', have announced their engagement in a heartfelt beach proposal, celebrating their love and family with their one-year-old son, Reggie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/keir-starmer-mumbai-visit-yash-raj-studios-rani-mukerji-2799739-2025-10-08",
      "headline": "UK PM Keir Starmer visits YRF Studio, meets Rani Mukerji during Mumbai visit UK Prime Minister Keir Starmer arrived in Mumbai for a two-day visit. He toured Yash Raj Films Studio and met Bollywood star Rani Mukerji, highlighting growing cultural ties between the UK and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/deposit-money-first-court-to-shilpa-shetty-for-foreign-work-trip-2799751-2025-10-08",
      "headline": "Deposit money first: Court to Shilpa Shetty for foreign work trip The Bombay High Court stipulated that if Shilpa Shetty and her husband Raj Kundra intend to travel overseas for work purposes, she must deposit Rs 60 crore as a precondition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-30-bharani-supports-divya-task-called-off-over-foul-play-2799702-2025-10-08",
      "headline": "Bigg boss Telugu 9 day 30: Bharani supports Divya, task called off over foul play Firestorm week in Bigg Boss Telugu 9 brought shifting loyalties, fierce challenges, and the looming threat of wild card entries. What began with playful banter from Sanjana, Thanuja, and Immanuel soon turned intense as Bigg Boss called out housemates for cheating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-addresses-talk-of-rivalry-between-kantara-chapter-1-and-kgf-chapter-2-2799699-2025-10-08",
      "headline": "Rishab Shetty shuts down KGF 2 and Kantara rivalry talk: Both are our films Following the success of 'Kantara: Chapter 1', Rishab Shetty has been busy with post-release promotional activities and addressed comparisons with Yash's 'KGF: Chapter 2' during an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ismail-darbar-says-he-wont-tolerate-gauahar-khan-work-but-his-son-zaid-can-interfere-2799690-2025-10-08",
      "headline": "Ismail Darbar says he won't tolerate Gauahar's work but his son can interfere Music director Ismail Darbar praised his daughter-in-law Gauahar Khan as a wonderful mother but expressed reservations about her decision to continue working after marriage and motherhood. He emphasised traditional family values and stated that only his son Zaid can decide her professional choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-recalls-terrifying-break-in-saw-him-standing-over-jeh-bed-with-knife-2799681-2025-10-08",
      "headline": "Saw him standing over Jeh's bed with knife: Saif Ali Khan on terrifying break-in On 'Two Much with Twinkle and Kajol', Saif Ali Khan opened up about a terrifying break-in at his home, revealing how he confronted a knife-wielding intruder near his son Jeh's bed. The actor also reflected on his early romance with Kareena Kapoor during the filming of 'Tashan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-kantara-chapter-1-choking-under-the-burden-of-pan-india-sequels-kgf-and-pushpa-2799591-2025-10-08",
      "headline": "Is Kantara Chapter 1 choking under the burden of pan-India sequels KGF 2 and Pushpa 2?  'Kantara: Chapter 1' has earned close to 300 crore worldwide in four days, a remarkable feat. Yet, comparisons with 'KGF: Chapter 2' and 'Pushpa: The Rule' spark debate. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ashnoor-kaur-mother-on-bigg-boss-19-fight-hurt-me-thought-of-pulling-her-out-2799668-2025-10-08",
      "headline": "Ashnoor Kaur's mother on Bigg Boss 19 fight: Hurt me, thought of pulling her out In the recent episode of 'Bigg Boss 19', Ashnoor Kaur faced a tough moment when her upbringing was questioned, but her parents, Avneet Kaur and Gurmeet Singh stood firmly in her support. They praised her calm and respectful nature, expressing pride in her composure amidst the house drama."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-phase-1-of-the-navi-mumbai-international-airport-2799777-2025-10-08",
      "headline": "Mumbai gets its second wind as PM inaugurates Navi Mumbai airportPM Modi inaugurated Phase 1 of the Navi Mumbai International Airport on Wednesday. The new airport is expected to ease the heavy traffic burden on Mumbai's existing Chhatrapati Shivaji Maharaj International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-groups-trusts-boardroom-battle-infighting-corporate-governance-explained-2799680-2025-10-08",
      "headline": "Another boardroom battle at Tata Group?The current crisis arises from a power tussle within Tata Trusts, the philanthropic arm that holds a controlling stake in Tata Sons, the holding company that runs the operations of the Tata Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/susumu-kitagawa-richard-robson-and-omar-m-yaghi-win-nobel-prize-in-chemistry-2025-2799782-2025-10-08",
      "headline": "Chemistry Nobel awarded for breakthrough in molecular room designThese nanoscopic frameworks can trap, store, and manipulate gases and molecules, offering vast potential in tackling global sustainability challenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/tory-mp-shadow-justice-secretary-brands-multicultural-soho-road-dominated-by-indian-pakistani-origin-slum-birmingham-uk-2799646-2025-10-08",
      "headline": "Like a slum in UK: MP brands area with Indian, Pakistani residents, sparks rowBritish MP and shadow minister Robert Jenrick labelled Birmingham's multicultural Soho Road, home to Indian and Pakistani communities, a \"slum\" and \"one of the worst integrated places\" in the UK. His remarks triggered a backlash with locals, business leaders, and politicians fiercely defending the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chennai-is-missing-two-lions-bjp-is-desperately-seducing-one-of-them-vijay-rally-karur-stampede-2799714-2025-10-08",
      "headline": "Chennai is missing two lions. BJP is desperately seducing one of themActor Vijay, who used to refer to himself as a lion, disappeared from public view even as the Karur stampede was unfolding. Forty-one fans, including children and women, died that deadly September night. Instead of calling out the lion king for abandoning his fans, the BJP is openly courting him. Should the party with a difference not show some deference to the people of Tamil Nadu?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-womens-cricket-world-cup-live-score-colombo-alyssa-healy-fatima-sana-2799730-2025-10-08",
      "headline": "AUS vs PAK Live Score: Pakistan rattle Australia as Sandhu runs riot in ColomboAUS vs PAK Live Score, Women's World Cup: Pakistan have got themselves in a strong position as Australia have lost wickets in quick succession. Beth Mooney is the only specialist batter remaining, with Kim Garth along with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-switches-zoho-mail-announces-email-id-donald-trump-style-2799826-2025-10-08",
      "headline": "Amit Shah switches to Zoho mail, makes announcement Trump-styleAmit Shah is the latest minister to embrace Zoho-based platforms amid the government's 'swadeshi' push on the backdrop of US tariffs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-cop-sandipan-garg-zubeen-gargs-cousin-arrested-in-connection-with-singers-death-2799617-2025-10-08",
      "headline": "Zubeen Garg's cop cousin arrested, was at Singapore yacht party where singer diedZubeen Garg's cousin Sandipan Garg, who is an Assam Police Services officer, has been arrested in connection with the singer's mysterious death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gandhinagar-vande-bharat-special-gurgaon-reroute-longer-route-high-ohe-pantograph-double-stack-freight-indian-railways-2799634-2025-10-08",
      "headline": "How a blunder created a Vande Bharat recordSemi-high-speed Vande Bharat trains have a tall acclaim, but for once they fell short, not in stature but in height. The Sabarmati–Gurgaon Vande Bharat Special had to be sent on a longer route recently after the Indian Railways found that the train's pantograph couldn't reach the overhead wires. A record was created because of a blunder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/khawaja-asif-operation-sindoor-india-pakistan-war-military-ceasefire-modi-government-2799654-2025-10-08",
      "headline": "India was never united, except under Aurangzeb: Pak Minister's ludicrous claimPakistan's Defence Minister Khawaja Asif admitted the possibility of another war with India, stressing that Islamabad must prepare for any eventuality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/eli-lilly-mounjaro-second-highest-selling-drug-india-diabetes-obesity-treatment-whats-driving-its-rise-2799644-2025-10-08",
      "headline": "Mounjaro becomes India's second-highest selling drug: What's driving its rise?Mounjaro clocked in Rs 80 crore in sales in September, becoming India's second-highest selling drug within six months of launch. Its rise highlights growing demand amid the country's obesity and diabetes challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-fined-rs-20-lakh-by-aviation-regulator-for-pilot-simulator-training-lapse-2799810-2025-10-08",
      "headline": "IndiGo fined Rs 20 lakh by aviation regulator for pilot simulator training lapseThe penalty, imposed on September 26, pertains to the use of non-qualified simulators for training pilots operating at high-risk airports such as Calicut, Leh, and Kathmandu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zoho-sridhar-vembu-government-support-arattai-criticism-india-self-reliance-trump-tariffs-2799657-2025-10-08",
      "headline": "Zoho has government backing. So what's the problem?Zoho is back in the spotlight after several ministers endorsed the desi tech company amid a 'swadeshi' push fuelled by rising US tariff tensions. However, fault-finding against Zoho has already begun. India need not look further than China and see how it built its own internet ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/scotch-johnnie-walker-black-label-glenfiddich-chivas-regal-prices-india-delhi-drop-uk-pm-keir-starmer-whisky-trade-deal-fta-2799758-2025-10-08",
      "headline": "Scotch prices to drop in India? UK-India trade deal to put whisky on the tableAs tariffs on Scotch whisky get slashed from 150% to 75% under the India-UK trade deal, iconic labels like Johnnie Walker and Glenfiddich might see a boom in India, the world's largest whisky market by volume. Reduced prices might see a surge in urban appetites across India and could unlock £1 billion in annual sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-jan-suraaj-bihar-assembly-elections-2025-game-changer-vote-cutter-survey-latest-pk-tejashwi-2799445-2025-10-08",
      "headline": "Will politician PK beat strategist PK in Bihar election?After months of suspense, poll strategist-turned-politician Prashant Kishor (PK) has revealed that he will be contesting the Bihar Assembly election. He said his \"political startup\", Jan Suraaj party, would either come first or last in the polls. Will Jan Suraaj prove to be a game-changer or vote cutter? What do pre-poll surveys say?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sridhar-vembu-says-arattai-has-full-privacy-for-secret-lovers-for-secret-rebels-against-govt-probably-not-2799672-2025-10-08",
      "headline": "Sridhar Vembu says Arattai has privacy for lovers, for rebels probably notThe privacy talk around Arattai continues to intensify. Now, Zoho co-founder Sridhar Vembu has added his words to it. He says Arattai will soon get end-to-end encryption, although the app will still follow government rules when it comes to data security. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hd-kumaraswamy-hails-rishab-shettys-kantara-chapter-1-as-a-masterpiece-2799614-2025-10-08",
      "headline": "HD Kumaraswamy hails Rishab Shetty's Kantara Chapter 1 as a masterpieceFormer Chief Minister of Karnataka and current Union Minister HD Kumaraswamy showered praise on Rishab Shetty's 'Kantara: Chapter 1' after watching the film in Delhi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/was-cough-syrup-linked-to-deaths-exported-who-seeks-clarification-from-india-2799825-2025-10-08",
      "headline": "Was cough syrup linked to child deaths exported? WHO seeks India's clarificationSo far, 20 children have died in India after consuming Coldrif, which tested positive for Diethylene Glycol (DEG), a highly toxic industrial chemical known to cause kidney failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/dhravya-shah-leaves-iit-prep-to-launch-ai-startup-raises-3-million-and-gets-o-1-extraordinary-visa-2799015-2025-10-07",
      "headline": "Dhravya Shah leaves IIT prep to launch AI startup, raises $3 million19-year-old Mumbai-born Dhravya Shah has turned heads in Silicon Valley after his AI startup, Supermemory, secured $3 million in seed funding from Google executives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/erdogan-says-trump-asked-turkey-to-convince-hamas-to-back-gaza-plan-2799803-2025-10-08",
      "headline": "Erdogan says Trump asked Turkey to convince Hamas to back Gaza planTurkey, which has voiced support for the plan and joined the negotiations in Egypt, has been one of the most vocal critics of Israel's offensive, which it calls a genocide. It has halted all trade with Israel, called for international measures against its government, and demanded a two-state solution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/8-unconventional-nobel-prize-winners-who-broke-rules-2799706-2025-10-08",
      "headline": "8 Nobel Prize winners who skipped classes, failed subjects, yet changed the worldMany Nobel laureates defied conventional schooling, overcoming failures, expulsions, and doubts to achieve brilliance. From Einstein to Frances Arnold, unconventional paths often shaped the innovators who changed science forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cough-syrup-deaths-madhya-pradesh-pharmacies-under-radar-tests-in-rajasthan-chhattisgarh-kerala-2799589-2025-10-08",
      "headline": "Cough syrup deaths cross 20, states announce bans. But who is responsible?At least 20 children have died in Madhya Pradesh and Rajasthan after consuming toxic cough syrup, yet only one arrest has been made so far. While investigations are underway and several states have banned the syrup, questions about accountability remain unanswered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-trust-news-government-asks-restore-stability-amit-shah-meeting-noel-tata-report-2799554-2025-10-08",
      "headline": "Trouble in Tata Group? Government asks leadership to restore stability, says reportThe meeting was aimed at maintaining calm within the Tata Trusts, which holds a controlling stake in Tata Sons, the holding company of India's largest conglomerate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2025-in-chemistry-winners-molecular-rooms-chemical-balance-2799795-2025-10-08",
      "headline": "How three chemists constructed rooms inside molecules and won NobelThis year's Nobel Committee Chair, Heiner Linke, highlighted the transformative potential of MOFs to revolutionise chemical processes and environmental solutions. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/steven-gerrard-criticises-england-2000s-team-culture-and-seeks-new-managerial-challenges-2799823-2025-10-08",
      "headline": "We were egotistical losers: Steven Gerrard on why England's golden era failed Steven Gerrard offers a candid assessment of England's 'golden generation,' addressing cultural issues, missed connections, and his ongoing aspirations in football management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-wuhan-open-unbeaten-streak-extends-comeback-win-2799816-2025-10-08",
      "headline": "Returning after US Open, Aryna Sabalenka makes shaky start in Wuhan World No. 1 Aryna Sabalenka made a winning return at the 2025 Wuhan Open, defeating Rebecca Sramkova 4-6, 6-3, 6-1 to extend her unbeaten record at the tournament to 18-0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-darren-sammy-west-indies-test-cancer-decline-2799815-2025-10-08",
      "headline": "It's a cancer in the system: Darren Sammy on causes of West Indies' prolonged decline IND vs WI: Darren Sammy believes that the West Indies' decline in cricket is a result of deep-rooted issues within their system"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-india-tour-2025-26-world-test-championship-new-zealand-lessons-2799789-2025-10-08",
      "headline": "Temba Bavuma's warning: Inspired by New Zealand, South Africa hope to conquer India Temba Bavuma urged South Africa to take inspiration from New Zealand's successful India tour, citing their smart use of spin. The Proteas will tour India in November and December. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jordi-alba-retirement-sergio-ramos-tribute-barcelona-mls-2799768-2025-10-08",
      "headline": "Once bitter rival, Ramos pens heartfelt letter on Alba's retirement Jordi Alba is set to retire from professional football at the end of this season. His longtime rival, Sergio Ramos paid a touching tribute to the former Barcelona player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-career-best-12th-icc-test-bowling-rankings-west-indies-win-2799752-2025-10-08",
      "headline": "Mohammed Siraj rises to career-best spot, Yashasvi Jaiswal slips out of top 5 Mohammed Siraj achieved a career-best 12th rank in ICC Test bowling after a match-winning performance against West Indies in Ahmedabad. Jasprit Bumrah continues to lead the bowling charts while Ravindra Jadeja retains the No. 1 spot in the all-rounder rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-world-cup-2027-2799724-2025-10-08",
      "headline": "DRS: Will Rohit Sharma and Virat Kohli play in 2027 ODI World Cup? With the tour of Australia in October-November, India officially begin the preparation for the 2027 ODI World Cup. As India gear up for the tournament, we try to address the elephant in the room – will Rohit and Virat play the World Cup?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-womens-cricket-world-cup-live-score-colombo-alyssa-healy-fatima-sana-2799730-2025-10-08",
      "headline": "AUS vs PAK Live Score: Pakistan rattle Australia as Sandhu runs riot in Colombo AUS vs PAK Live Score, Women's World Cup: Pakistan have got themselves in a strong position as Australia have lost wickets in quick succession. Beth Mooney is the only specialist batter remaining, with Kim Garth along with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-dominate-australia-u19-youth-test-series-seven-wicket-win-2799709-2025-10-08",
      "headline": "India U19 hammer Australia U19 to sweep Youth Test series India U19 defeated Australia U19 by seven wickets in the second Youth Test at the Great Barrier Reef Arena in Mackay to complete a 2-0 series sweep. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-vizag-stadium-rain-eve-training-2799684-2025-10-08",
      "headline": "Vizag rain dampens India's preparations for crucial South Africa clash Women's World Cup 2025: The pitch and the outfield were covered hours before India's scheduled training session as heavy rain lashed Visakhapatnam on Wednesday. India will take on South Africa in their third game of the tournament on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-ceat-awards-brian-lara-2799661-2025-10-08",
      "headline": "Special Abhishek Sharma wants to play Test cricket for India: Brian Lara After taking T20 cricket by storm, Abhishek Sharma is targetting Test cricket, revealed former SRH head coach Brian Lara. Speaking at the CEAT Awards, Lara spoke about what makes Abhishek special."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-odi-world-cup-2027-2799724-2025-10-08",
      "headline": "DRS: Will Rohit Sharma and Virat Kohli play in 2027 ODI World Cup? With the tour of Australia in October-November, India officially begin the preparation for the 2027 ODI World Cup. As India gear up for the tournament, we try to address the elephant in the room – will Rohit and Virat play the World Cup?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-womens-cricket-world-cup-live-score-colombo-alyssa-healy-fatima-sana-2799730-2025-10-08",
      "headline": "AUS vs PAK Live Score: Pakistan rattle Australia as Sandhu runs riot in Colombo AUS vs PAK Live Score, Women's World Cup: Pakistan have got themselves in a strong position as Australia have lost wickets in quick succession. Beth Mooney is the only specialist batter remaining, with Kim Garth along with her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-dominate-australia-u19-youth-test-series-seven-wicket-win-2799709-2025-10-08",
      "headline": "India U19 hammer Australia U19 to sweep Youth Test series India U19 defeated Australia U19 by seven wickets in the second Youth Test at the Great Barrier Reef Arena in Mackay to complete a 2-0 series sweep. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-vizag-stadium-rain-eve-training-2799684-2025-10-08",
      "headline": "Vizag rain dampens India's preparations for crucial South Africa clash Women's World Cup 2025: The pitch and the outfield were covered hours before India's scheduled training session as heavy rain lashed Visakhapatnam on Wednesday. India will take on South Africa in their third game of the tournament on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-ceat-awards-brian-lara-2799661-2025-10-08",
      "headline": "Special Abhishek Sharma wants to play Test cricket for India: Brian Lara After taking T20 cricket by storm, Abhishek Sharma is targetting Test cricket, revealed former SRH head coach Brian Lara. Speaking at the CEAT Awards, Lara spoke about what makes Abhishek special."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-world-cup-selection-2027-aakash-chopra-2799658-2025-10-08",
      "headline": "Indispensable no more? Rohit and Virat will be judged on ODI form, says ex-openerFormer India opener Aakash Chopra said Rohit Sharma and Virat Kohli will come under scrutiny for their performances, adding that consistency will be key to retaining their places in the ODI squad in the lead-up to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-hikaru-vs-gukesh-checkmate-tournament-controversy-2799624-2025-10-08",
      "headline": "Hikaru throwing Gukesh's king was rehearsed: BTS video goes viralThe chess world was taken by storm after Hikaru Nakamura threw away D Gukesh's king after checkmating him. A BTS video now shows that the move was probably rehearsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-omitted-india-odi-squad-champions-trophy-success-2799603-2025-10-08",
      "headline": "Varun Chakravarthy addresses ODI selection snub: I expect to be in every teamDespite his standout performances in the Champions Trophy and Asia Cup, Varun Chakravarthy was not included in India's ODI squad for the Australia tour. The spinner discussed his omission and conversations with head coach Gautam Gambhir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-pat-cummins-back-injury-miss-test-australia-vs-england-2799564-2025-10-08",
      "headline": "Pat Cummins could miss entire Ashes Test series due to injury: ReportPat Cummins is set to miss the start of the Ashes and could be sidelined for the full series against England due to a back injury, with Steve Smith likely to step in as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-lean-look-ceat-cricket-awards-fitness-comeback-2799558-2025-10-08",
      "headline": "Fitman: Rohit Sharma stuns fans with sleek look at award show ahead of ODI comebackRohit Sharma wowed fans with his slim and fit look at the CEAT Cricket Rating Awards in Mumbai, having reportedly shed 10 kg while training with former India assistant coach Abhishek Nayar ahead of his ODI comeback in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-premier-league-michael-owen-exclusive-2799489-2025-10-08",
      "headline": "Manchester United will win Premier League: Michael Owen's hope coded with warningMichael Owen told India Today that Manchester United's struggles go beyond Ruben Amorim. Structural flaws, inconsistency, and lack of cohesion persist, but with patience the Red Devils will return to glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ceat-awards-champions-trophy-win-dravid-gambhir-2799530-2025-10-08",
      "headline": "Dravid's philosophies helped India win Champions Trophy 2025: Rohit SharmaIndia captain Rohit Sharma credited former coach Rahul Dravid's vision for their 2025 Champions Trophy success. Sharma said that the processes set by Dravid helped the team even after the coach left."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-delhi-pitch-report-2799524-2025-10-08",
      "headline": "IND vs WI: Batting pitch likely in Delhi after woeful Windies show in AhmedabadThe second Test match in Delhi is likely to have a batting-friendly pitch that slowly turns into a spinning track. This comes in stark difference to the track that was dished out in the 2023 Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-lean-look-ceat-cricket-awards-fitness-comeback-2799558-2025-10-08",
      "headline": "Fitman: Rohit Sharma stuns fans with sleek look at award show ahead of ODI comebackRohit Sharma wowed fans with his slim and fit look at the CEAT Cricket Rating Awards in Mumbai, having reportedly shed 10 kg while training with former India assistant coach Abhishek Nayar ahead of his ODI comeback in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-ruben-amorim-premier-league-michael-owen-exclusive-2799489-2025-10-08",
      "headline": "Manchester United will win Premier League: Michael Owen's hope coded with warningMichael Owen told India Today that Manchester United's struggles go beyond Ruben Amorim. Structural flaws, inconsistency, and lack of cohesion persist, but with patience the Red Devils will return to glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ceat-awards-champions-trophy-win-dravid-gambhir-2799530-2025-10-08",
      "headline": "Dravid's philosophies helped India win Champions Trophy 2025: Rohit SharmaIndia captain Rohit Sharma credited former coach Rahul Dravid's vision for their 2025 Champions Trophy success. Sharma said that the processes set by Dravid helped the team even after the coach left."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-delhi-pitch-report-2799524-2025-10-08",
      "headline": "IND vs WI: Batting pitch likely in Delhi after woeful Windies show in AhmedabadThe second Test match in Delhi is likely to have a batting-friendly pitch that slowly turns into a spinning track. This comes in stark difference to the track that was dished out in the 2023 Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-celebration-varun-arshdeep-singh-ceat-awards-2799504-2025-10-08",
      "headline": "India's Asia Cup celebration without trophy was Arshdeep's idea: VarunIndia mimicked their celebrations at the Asia Cup after being denied the trophy or the medals. Varun Chakravarthy reveals that the mock celebrations were the idea of Arshdeep Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-new-odi-captain-replaces-rohit-sharma-2027-world-cup-2799458-2025-10-08",
      "headline": "Is Shubman Gill being hurried into all-format captaincy?Star Indian batter Shubman Gill has been appointed as India's new ODI captain, replacing Rohit Sharma. So far, Gill has captained in only 11 international matches and has never led in ODIs. His rapid rise to multi-format captaincy could come with its own set of challenges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-suspends-aman-sehrawat-for-weight-failure-wrestling-2799446-2025-10-07",
      "headline": "WFI suspends Aman Sehrawat for missing weight for World ChampionshipsThe Wrestling Federation of India has suspended Aman Sehrawat for one year after he failed to make weight at the Senior World Championships. This suspension highlights concerns over discipline and professionalism within Indian wrestling's top ranks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brian-lara-urges-west-indies-players-to-reignite-passion-for-test-cricket-revival-2799443-2025-10-07",
      "headline": "Brian Lara urges West Indies to revive the spirit to play Test cricket: Find a wayBrian Lara has urged West Indies cricketers to bring back passion and pride for Test cricket. He stressed that attitude and dedication are more crucial than facilities for the game's revival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-aus-w-vs-pak-w-ellyse-perry-full-pre-match-press-conference-2799432-2025-10-07",
      "headline": "Really enjoy Fatima Sana's passion and energy on the field: Ellyse PerryStar Australia all-rounder Ellyse Perry showered praise on Pakistan captain Fatima Sana ahead of their third fixture of the Women's World Cup 2025 in Colombo. She also praised her leadership skills, calling her a perfect team person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-leadership-team-first-approach-praised-kane-williamson-india-cricket-2799429-2025-10-07",
      "headline": "Relentless commitment, contagious attitude: Williamson on what makes Siraj specialKane Williamson has praised Mohammed Siraj for his leadership and team-first approach. His rise from IPL talent to a key India bowler highlights his growing influence in cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-wins-ceat-t20i-batter-award-three-centuries-opener-2799428-2025-10-07",
      "headline": "Sanju Samson named CEAT T20I batter of the year, dedicates award to wife CharuSanju Samson won the CEAT men's T20I batter of the year award after a remarkable run as an opener in the past 12 months. He slammed three centuries in 12 innings after being promoted to open the innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-players-refuse-iran-travel-acl2-fan-confrontation-2799413-2025-10-07",
      "headline": "Watch: Mohun Bagan players confronted by fans for refusing to travel to Iran for ACL2Mohun Bagan players refused to travel to Iran for the AFC Champions League 2 fixture against Sepahan FC. This decision sparked fan confrontations and highlighted safety concerns due to international travel advisories."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}