{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-overtakes-japan-become-worlds-4th-largest-economy-in-world-niti-aayog-2730164-2025-05-25",
      "headline": "India overtakes Japan to become fourth-largest economy: Niti AayogIndia has overtaken Japan to become the world's 4th largest economy, with a GDP of $4 trillion. NITI Aayog projects India will become the 3rd largest economy in the next 2-3 years, surpassing Germany. Factors contributing to this growth include infrastructure development, Make in India initiative, GST implementation, and fiscal discipline during the COVID-19 pandemic. The country has reduced extreme poverty to less than 5% and is poised for rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-fourth-largest-economy-ahead-of-japan-niti-aayog-ceo-2730153-2025-05-25",
      "headline": "India now fourth-largest economy, ahead of Japan: Niti Aayog CEOIndia's GDP has reached $4 trillion, placing it behind only the US, China, and Germany, according to IMF data cited by NITI Aayog CEO BVR Subrahmanyam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/og-release-date-out-pawan-kalyan-film-to-hit-screens-in-september-2730364-2025-05-25",
      "headline": "OG release date out: Pawan Kalyan's film to hit screens in SeptemberPawan Kalyan's much-awaited Telugu action film 'OG' is set to release in September25, 2025. Directed by Sujeeth and featuring music by S Thaman, the film will be a gripping mafia drama alongside a star-studded cast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-companion-blamed-for-divorce-takes-legal-action-after-rape-threats-2730351-2025-05-25",
      "headline": "Actor Ravi's 'companion', blamed for divorce, takes legal action after rape threatsActor Ravi Mohan's 'companion' Keneeshaa Francis has taken legal action against online abuse, rape and death threats. Her move comes after Ravi called her his partner amid his divorce battle with Aarti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-on-day-2-at-cannes-2025-courtesy-designer-gaurav-gupta-2730339-2025-05-25",
      "headline": "BTS with Aishwarya Rai on Day 2 at Cannes, courtesy designer Gaurav GuptaDesigner Gaurav Gupta shared behind-the-scenes glimpses of Aishwarya Rai and her daughter Aaradhya on day 2 of Cannes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/k3g-actor-malvika-raaj-and-husband-pranav-bagga-announce-pregnancy-2730315-2025-05-25",
      "headline": "K3G actor Malvika Raaj and husband Pranav Bagga announce pregnancy'Kabhie Khushi Kabhie Gham' actor Malvika Raaj and her husband Pranav Bagga are expecting their first child. She sharing the happy news with adorable photos on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crunchyroll-anime-awards-2025-full-winners-list-solo-leveling-bags-anime-of-the-year-2730314-2025-05-25",
      "headline": "Crunchyroll Anime Awards 2025 Full Winners List: Solo Leveling bags Anime of the yearThe 2025 Crunchyroll Anime Awards held in Tokyo celebrated the best in anime with Solo Leveling emerging as the biggest winner. The star-studded event also honoured Attack on Titan for its cultural impact and featured performances by popular artists, making it a grand celebration of anime's global influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-donates-rs-110-crore-to-help-army-widows-children-after-operation-sindoor-2730310-2025-05-25",
      "headline": "Preity Zinta donates Rs 1.10 crore to help Army widows, children after Op SindoorActor Preity Zinta donated Rs 1.10 crore to the Army Wives Welfare Association after India's Operation Sindoor. The actor made the generous donation at an event held in Jaipur on May 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-teaser-dhanush-nagarjuna-rashmika-mandanna-jim-sarbh-power-and-wealth-2730289-2025-05-25",
      "headline": "Kuberaa teaser: Dhanush, Nagarjuna's film explores power and wealthThe teaser of 'Kuberaa' starring Dhanush and Rashmika Mandanna is finally out. Sekhar Kammula's pan-Indian directorial will release in theatres on June 20.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhen-dharmendra-mala-sinha-sankari-sky-saved-india-2730296-2025-05-25",
      "headline": "Ankhen: The sanskari spy who shunned martinis and saved India'Ankhen' remains a landmark spy thriller of 1968 Bollywood, blending patriotism, action, and strong female roles. The film's unique gadgets and nostalgic style made it a classic Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-waves-at-fans-as-he-steps-out-for-weekend-outing-2730287-2025-05-25",
      "headline": "Allu Arjun waves at fans as he steps out for weekend outing. WatchActor Allu Arjun stepped out for a weekend outing on May 24. In a viral video, he is seen waving to fans as he exits a showroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-triptii-dimri-will-be-next-big-thing-in-bollywood-after-spirit-prabhas-sandeep-reddy-vanga-2730281-2025-05-25",
      "headline": "Ram Gopal Varma says Triptii Dimri will be next big thing in Bollywood after SpiritFilmmaker Ram Gopal Varma shared a post on X and praised Sandeep Reddy Vanga for casting Triptii Dimri in 'Spirit.' The actor will be seen opposite Prabhas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshals-tribute-to-armed-forces-with-maa-tujhe-salaam-rendition-at-mumbai-concert-2730255-2025-05-25",
      "headline": "Shreya Ghoshal's tribute to armed forces with 'Maa Tujhe Salaam' rendition. WatchShreya Ghoshal concluded her 'All Hearts Tour' in Mumbai with a tribute to the Indian armed forces, performing 'Maa Tujhe Salaam' as a mark of respect. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-alia-bhatt-stun-in-viral-cannes-selfie-2730257-2025-05-25",
      "headline": "Bold meets beauty: Urvashi Rautela, Alia Bhatt stun in viral Cannes selfieUrvashi Rautela shared a picture with Alia Bhatt from their Cannes appearance. Fans were thrilled to see two beautiful actors in one frame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-friends-wedding-with-y-cover-after-security-breach-at-home-2730231-2025-05-25",
      "headline": "Salman Khan attends friend's wedding with Y+ cover after security breach at homeSalman Khan attended his friend Ayaz Khan's wedding in Mumbai under Y+ cover following a recent security breach at his Galaxy Apartments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-bows-back-to-fan-at-pune-concert-in-heart-winning-gesture-2730219-2025-05-25",
      "headline": "Singer Papon bows back to fan at concert in heart-winning gesture. WatchSinger Papon impressed the Pune crowd with his beautiful singing and a sweet gesture to a fan during his concert.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-first-look-anurag-basu-film-introduces-modern-love-relationships-2730210-2025-05-25",
      "headline": "Metro In Dino 1st look: Anurag Basu's film introduces modern love, relationships'Metro In Dino' first look was unveiled by the makers on social media. The film introduces the entire star cast, including Anupam Kher, Sara Ali Khan, Aditya Roy Kapur and Pankaj Tripathi, among others. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-reacts-to-akshay-kumar-lawsuit-hera-pheri-3-2730194-2025-05-25",
      "headline": "Paresh Rawal reacts to Akshay's lawsuit: My lawyer has sent an appropriate responseParesh Rawal has responded to Akshay Kumar's legal notice over his sudden exit from 'Hera Pheri 3', stating that his lawyer has sent a proper reply. The actor has also returned the signing amount with interest, but the legal dispute may delay the film's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-visit-ayodhya-ram-mandir-and-hanuman-garhi-2730182-2025-05-25",
      "headline": "Anushka Sharma, Virat Kohli visit Ayodhya's Ram Mandir and Hanuman GarhiAnushka Sharma and Virat Kohli offered prayers at Ayodhya's Ram Mandir and Hanuman Garhi after RCB vs SRH match in Lucknow on May 23. Pictures and videos of the couple's visit have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/khushi-tdt-lashcurry-on-success-of-victory-anthem-politics-in-music-industry-exclusive-2729620-2025-05-25",
      "headline": "Khushi TDT-Lashcurry on success of Victory Anthem, politics in music industryVictory Anthem by Khushi TDT and Lashcurry is a powerful hip-hop track that has struck a chord with millions globally, inspiring listeners to overcome life's challenges. The hip-hop artists, in an exclusive interview, opens up about the process of making the song and its widespread success."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/what-the-hell-trump-loses-cool-after-putin-launches-largest-airstrike-of-war-glbs-2730438-2025-05-26",
      "headline": "What the hell...: Trump loses cool after Putin launches war's biggest air attackDonald Trump, who had been patient with Vladimir Putin, slammed him after Russia's largest airstrike on Ukraine killed 12. Calling out the violence, Trump said, \"What the hell happened to him?\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shehbaz-sharif-thanks-dear-brother-erdogan-for-backing-pak-against-india-glbs-2730441-2025-05-26",
      "headline": "Shehbaz Sharif thanks 'dear brother' Erdogan for backing Pak against IndiaTurkish President Erdogan met Pakistan PM Shehbaz Sharif in Istanbul weeks after the India-Pakistan conflict. They pledged to boost ties in defence, trade, and counter-terrorism. Erdogan reaffirmed support for Pakistan and called their bond \"unbreakable.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-canada-foreign-minister-anita-anand-hold-first-talks-in-bid-to-reset-ties-2730445-2025-05-26",
      "headline": "S Jaishankar, Canada's Foreign Minister hold first talks in bid to reset tiesThe conversation centred on strengthening economic cooperation and advancing shared priorities. It comes amid cautious optimism in New Delhi over a potential diplomatic reset ties with Ottawa following the exit of Justin Trudeau."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-expelled-lalu-yadav-rjd-bihar-assembly-elections-tejashwi-yadav-2730278-2025-05-25",
      "headline": "Lalu Yadav removes son Tej Pratap from party, family after row over viral postOn Saturday, Tej Pratap Yadav declared his long-standing relationship with Anushka Yadav, saying that they have been in love and in a relationship for the past 12 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-rafael-nadal-federer-djokovic-emotional-tribute-roland-garros-2730399-2025-05-25",
      "headline": "Nadal emotional as Roger Federer and Novak Djokovic join French Open tributeFrench Open 2025: Rafael Nadal was honored at Roland Garros on Sunday in a powerful farewell ceremony that paid tribute to his unparalleled dominance on the Paris clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-gujarat-today-big-events-planned-2730443-2025-05-26",
      "headline": "PM Modi to visit Gujarat today, will inaugurate projects worth Rs 82,000 crorePrime Minister Narendra Modi will launch development projects worth Rs 82,000 crore during his two-day visit to Gujarat on May 26-27."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-constable-shot-dead-mob-attacks-cops-during-arrest-ghaziabad-2730446-2025-05-26",
      "headline": "Noida constable shot dead as mob attacks cops during arrest in GhaziabadA Noida constable, who was part of the team attempting to arrest a wanted accused in Ghaziabad, was shot and later succumbed to his injuries in hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-nda-leaders-meeting-chief-ministers-delhi-operation-sindoor-controversy-2730312-2025-05-25",
      "headline": "No loose talk: PM to NDA leaders at Delhi meet after recent controversiesPM Modi, in a Delhi meeting with NDA leaders, urged leaders to avoid unnecessary statements. He also clarified that the Operation Sindoor ceasefire was initiated at Pakistan's request without third-party involvement.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-pune-solapur-highway-turns-into-river-cars-swept-away-viral-videos-monsoon-mumbai-maharashtra-2730434-2025-05-26",
      "headline": "Videos: Heavy rain turns Maharashtra highway into river, cars swept awayPre-monsoon showers across Maharashtra turned the Pune-Solapur highway into a torrential river, with several vehicles being swept away in several videos which have gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/akali-dal-councillor-harjinder-singh-bahman-shot-dead-bike-borne-men-in-amritsar-sad-2730358-2025-05-25",
      "headline": "Akali Dal councillor shot dead by unknown bike-borne men in AmritsarThe miscreants fired five-six rounds of bullets at the councillor while he was on his way to a hotel after attending a function at Chheharta Sahib Gurudwara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-entered-quarantine-launch-international-space-station-2730378-2025-05-25",
      "headline": "Confident of success: Shubhanshu Shukla enters quarantine ahead of Ax-4 launchIndian astronaut Shubhanshu Shukla and the Ax-4 crew have entered quarantine ahead of their June 8, 2025 launch to the International Space Station, marking a key step in commercial spaceflight and India's space ambitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-future-csk-vs-gt-ahmedabad-2730357-2025-05-25",
      "headline": "Dhoni on IPL 2026 plans: Will enjoy a few bike rides in Ranchi and then decideMS Dhoni has said that he has time on his side and will make a decision on his IPL future in the coming few months. Dhoni said he will enjoy a 'few bike rides' in Ranchi and take the next couple of months to make the call. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-assam-bangladesh-chicken-necks-siliguri-corridor-row-muhammad-yunus-2730428-2025-05-26",
      "headline": "Bangladesh's '2 chicken necks' far more vulnerable, says Himanta SarmaIntensifying his attack on Bangladesh's interim chief Muhammad Yunus, Assam Chief Minister Himanta Biswa Sarma asserted that the neighbouring country has \"two chicken necks\", which are far more vulnerable than India's Chicken Neck, also known as Siliguri Corridor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-german-man-arrested-for-planning-to-bomb-american-embassy-in-tel-aviv-glbs-2730433-2025-05-26",
      "headline": "US-German man arrested for planning to bomb American embassy in Tel AvivA dual US-German citizen, Joseph Neumayer, was arrested after attempting to firebomb the US Embassy branch in Tel Aviv. FBI Director Kash Patel confirmed the arrest, vowing justice as Neumayer faces charges including threats against President Donald Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/girl-raped-dance-teacher-summer-camp-maharashtra-ulhasnagar-accused-police-custody-2730442-2025-05-26",
      "headline": "2.5-year-old girl raped by teacher at summer camp in MaharashtraA 2.5-year-old girl was allegedly raped by her 45-year-old dance teacher at a summer camp in Maharashtra's Ulhasnagar. The accused was sent to three days of police custody by a local court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2024-25-points-table-liverpool-arsenal-city-newcastle-ucl-europa-2730416-2025-05-26",
      "headline": "Premier League final day: Who qualified for Champions, Europa and Conference leagueManchester City, Chelsea, and Newcastle United clinched their places in next season's Champions League. Meanwhile, Aston Villa's defeat at Manchester United consigned them to the Europa League, while Nottingham Forest's loss to Chelsea saw them slip into the Europa Conference League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-pat-cummins-comments-2730421-2025-05-26",
      "headline": "SRH cannot play worse than they did in IPL 2025: CumminsSunRisers Hyderabad captain Pat Cummins believes his team should have reached the final of the IPL this season. He reflected on the team's inconsistent middle phase and expressed optimism for next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gonda-up-bjp-district-chief-amar-kishore-kashyap-video-viral-woman-show-cause-notice-2730430-2025-05-26",
      "headline": "UP BJP leader's 'obscene' clip of him with woman goes viral, party issues noticeAmar Kishore Kashyap, the district president of BJP's Gonda unit in Uttar Pradesh, was issued a show-cause notice following a viral video showing him indulging in an \"obscene act\" with a woman at the party office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-in-guccis-first-ever-saree-iconic-look-in-cannes-2730107-2025-05-25",
      "headline": "Gucci touches down in tradition and Alia Bhatt is the museAlia's final look on the Cannes carpet was an amalgamation of heritage and haute couture. Styled by Rhea Kapoor, the look is allegedly Gucci's first-ever interpretation of the Indian saree."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minor-raped-months-captivity-abortion-prostitution-accused-dombivli-police-accused-arrested-2730440-2025-05-26",
      "headline": "Teen raped for 2 months in captivity, underwent abortion, forced into prostitutionA 15-year-old girl was kidnapped and locked in a room for two months in Maharashtra's Dombivli and she was allegedly repeatedly raped by the accused, who is on the run. She then underwent an abortion and was forced into prostitution before being rescued by police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yunus-selling-off-bangladesh-to-america-sheikh-hasinas-big-charge-amid-protests-2730183-2025-05-25",
      "headline": "'Militant leader' Yunus selling off Bangladesh to US: Sheikh Hasina's big chargeSheikh Hasina alleged that Yunus is running the government with the help of militants and slammed him for imposing a ban on her party, the Awami League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/zuppa-drones-operation-sindoor-surveillance-indian-army-2730397-2025-05-25",
      "headline": "Hawk-eyed, hackproof: Made-in-India drones by Army during Op SindoorZuppa's indigenously built drones played a crucial role in surveillance during Operation Sindoor, countering enemy jamming tactics and enhancing battlefield intelligence.\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-pat-cummins-comments-2730421-2025-05-26",
      "headline": "SRH cannot play worse than they did in IPL 2025: CumminsSunRisers Hyderabad captain Pat Cummins believes his team should have reached the final of the IPL this season. He reflected on the team's inconsistent middle phase and expressed optimism for next season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-monaco-grand-prix-result-lando-norris-2730424-2025-05-26",
      "headline": "Lando Norris relishes dream Monaco win as driver's championship intensifiesLando Norris clinched a dream victory at the Monaco Grand Prix, boosting McLaren's title hopes. The win tightens the championship race and highlights Mercedes' ongoing struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-jasmine-paolini-beat-yuan-yue-win-streak-clay-2730423-2025-05-26",
      "headline": "Jasmine Paolini battles past Yuan Yue to reach second roundFrench Open: Last year's runner-up, Jasmine Paolini, was made to work hard in her opening match at the French Open, eventually securing a 6-1, 4-6, 6-3 win over China's Yuan Yue in a tense first-round encounter on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2024-25-points-table-liverpool-arsenal-city-newcastle-ucl-europa-2730416-2025-05-26",
      "headline": "Premier League final day: Who qualified for Champions, Europa and Conference leagueManchester City, Chelsea, and Newcastle United clinched their places in next season's Champions League. Meanwhile, Aston Villa's defeat at Manchester United consigned them to the Europa League, while Nottingham Forest's loss to Chelsea saw them slip into the Europa Conference League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-report-heinrich-klaasen-harsh-dubey-delhi-2730405-2025-05-25",
      "headline": "Klaasen record 105, SRH's 278 too good for clueless KKR in season-ending clashHeinrich Klaasen's record hundred and a disciplined performance from the bowlers handed SRH a xx-run win over KKR in Delhi on Sunday, May 25. The win helped SRH finish above KKR, who are all set to finish in the bottom three. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-musetti-zheng-qinwen-win-second-round-roland-garros-2730402-2025-05-25",
      "headline": "Musetti and Zheng Qinwen book second round spots at Roland GarrosFrench Open 2025: Lorenzo Musetti and Zheng Qinwen secured straight-sets wins to reach the second round. Qinwen beat Anastasia Pavlyuchenkova 6-4, 6-3 while Frances Tiafoe also defeated Roman Safiullin 6-4, 7-5, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-rafael-nadal-federer-djokovic-emotional-tribute-roland-garros-2730399-2025-05-25",
      "headline": "Nadal emotional as Roger Federer and Novak Djokovic join French Open tributeFrench Open 2025: Rafael Nadal was honored at Roland Garros on Sunday in a powerful farewell ceremony that paid tribute to his unparalleled dominance on the Paris clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-highest-totals-srh-vs-kkr-heinrich-klaasen-2730390-2025-05-25",
      "headline": "278/3: SRH maul KKR to hit 3rd highest total in IPL historyIPL 2025: SunRisers Hyderabad scored 278 runs against Kolkata Knight Riders in their final IPL game. Klaasen's rapid century helped SRH record the 3rd highest total in the history of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-heinrich-klaasen-fastest-hundred-srh-batter-vs-kkr-2730389-2025-05-25",
      "headline": "SRH's Heinrich Klaasen hits joint-third-fastest IPL hundred to decimate KKRSunrisers Hyderabad batter Heinrich Klaasen hit the joint third-fastest hundred in the Indian Premier League against Kolkata Knight Riders at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/southampton-appoint-will-still-manager-premier-league-2730370-2025-05-25",
      "headline": "Southampton appoint Will Still as manager to lead Premier League returnSouthampton have appointed 32-year-old Will Still as their new manager on a three-year deal. He is tasked with guiding the club back to the Premier League after their earliest-ever relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-points-table-ms-dhoni-retiremement-news-2730367-2025-05-25",
      "headline": "CSK finish last place for first time in history of IPLChennai Super Kings ended IPL 2025 in last place for the first time despite a strong win in the final match. MS Dhoni said after the match that he was undecided about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-rafael-nadal-federer-djokovic-emotional-tribute-roland-garros-2730399-2025-05-25",
      "headline": "Nadal emotional as Roger Federer and Novak Djokovic join French Open tributeFrench Open 2025: Rafael Nadal was honored at Roland Garros on Sunday in a powerful farewell ceremony that paid tribute to his unparalleled dominance on the Paris clay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-highest-totals-srh-vs-kkr-heinrich-klaasen-2730390-2025-05-25",
      "headline": "278/3: SRH maul KKR to hit 3rd highest total in IPL historyIPL 2025: SunRisers Hyderabad scored 278 runs against Kolkata Knight Riders in their final IPL game. Klaasen's rapid century helped SRH record the 3rd highest total in the history of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-heinrich-klaasen-fastest-hundred-srh-batter-vs-kkr-2730389-2025-05-25",
      "headline": "SRH's Heinrich Klaasen hits joint-third-fastest IPL hundred to decimate KKRSunrisers Hyderabad batter Heinrich Klaasen hit the joint third-fastest hundred in the Indian Premier League against Kolkata Knight Riders at the Arun Jaitley Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/southampton-appoint-will-still-manager-premier-league-2730370-2025-05-25",
      "headline": "Southampton appoint Will Still as manager to lead Premier League returnSouthampton have appointed 32-year-old Will Still as their new manager on a three-year deal. He is tasked with guiding the club back to the Premier League after their earliest-ever relegation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-ipl-points-table-ms-dhoni-retiremement-news-2730367-2025-05-25",
      "headline": "CSK finish last place for first time in history of IPLChennai Super Kings ended IPL 2025 in last place for the first time despite a strong win in the final match. MS Dhoni said after the match that he was undecided about his future."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}