{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-gold-real-estate-which-investment-can-make-you-richer-where-to-invest-money-expert-view-2685862-2025-02-26",
      "headline": "Gold, stocks, or property: Which investment can make you richer?More people are turning to stocks, gold, and real estate to grow their wealth, but choosing the right one can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capgemini-ceo-ashwin-yardi-on-ideal-workweek-not-90-70-not-even-50-hours-2685788-2025-02-26",
      "headline": "Capgemini CEO on ideal workweek: Not 90, not 70, not even 50 hoursCapgemini India's CEO, Ashwin Yardi, has introduced a different perspective, one that supports a more balanced approach in the debate about work-life balance and working hours in a week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-like-bel-hal-are-in-a-slump-3-reasons-why-analysts-are-bullish-2685763-2025-02-26",
      "headline": "Defence stocks like BEL, HAL are in a slump. Is it an opportunity to buy? Even after the drop, analysts remain bullish about defence stocks. In the case of BEL, 24 out of 27 analysts have a 'buy' rating on the stock. Most analysts also remain positive about HAL's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-tumble-nearly-9-percent-market-value-dips-below-1-trillion-dollar-key-reasons-2685741-2025-02-26",
      "headline": "Tesla shares tumble nearly 9%, market value dips below $1 trillion. Here's whyTesla share price: The decline followed data from the European Automobile Manufacturers Association, which reported Tesla's sales in Europe fell 45% in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-44-percent-from-52-week-high-should-you-buy-the-dip-2685727-2025-02-26",
      "headline": "Tata Motors shares down 44% from 52-week high. Should you buy the dip?Tata Motors shares: In the previous trading session, the stock closed lower 1.2% lower at Rs 660.30. So far this year, it's lost over 11%. In six months, it's down 40%. Over a year, it's fallen 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-lending-rules-ease-in-borrowing-for-small-borrowers-and-nbfcs-what-it-means-2685720-2025-02-26",
      "headline": "RBI eases lending rules for small borrowers and NBFCs. Here's what it meansThe RBI has also put on hold its earlier proposals to increase the capital that banks must set aside for new project loans and the liquidity they need to maintain for digital deposits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/new-india-co-op-bank-vault-had-12-times-its-capacity-on-paper-rs-122-crore-report-2685718-2025-02-26",
      "headline": "New India Co-op Bank vault had 12 times its capacity on paper: Report The Mumbai Police's Economic Offences Wing (EOW) is probing an alleged Rs 122-crore embezzlement at the bank and has arrested three people so far, including two former senior executives of the lender."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-employees-get-5-to-8-percent-salary-hikes-lower-than-before-report-2685688-2025-02-26",
      "headline": "Infosys employees get 5-8% salary hikes, lower than before: ReportThe IT firm sent salary revision letters to employees, offering hikes between 5% and 8% for most, depending on their performance rating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/failed-to-deposit-tds-tcs-officials-may-be-knocking-soon-income-tax-department-notice-2685678-2025-02-26",
      "headline": "Failed to deposit TDS? Tax officials may be knocking soonAround 40,000 taxpayers are under scrutiny for potential defaults in tax deductions for the financial years 2022-23 and 2023-24."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/personal-loan-5-hidden-charges-by-banks-you-must-check-2685448-2025-02-25",
      "headline": "Applying for personal loan? 5 hidden charges you must check While banks may not disclose the hidden charges when applying for personal loans, borrowers must understand them when applying for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fd-rates-dip-check-indusind-dcb-bank-city-union-and-other-top-banks-2685370-2025-02-25",
      "headline": "FD rates dip: Check IndusInd, DCB, City Union and other top banksWith a drop in FD interest rates, depositors might witness a marginal decline in their earnings on fixed deposits.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jubilant-foodworks-issues-clarification-on-fir-against-chairman-2685338-2025-02-25",
      "headline": "Chairman says allegations are false: Jubilant FoodWorks after reports of FIRIn a stock exchange filing, Jubilant FoodWorks said its Chairman Shyam Sundar Bhartia has denied all allegations against him, calling them \"baseless, false and disparaging, and made with clear malafide intent\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-stock-markets-stay-range-bound-as-cautious-sentiment-prevails-sensex-gains-nifty-loses-2685279-2025-02-25",
      "headline": "Sensex gains, Nifty loses: Markets stay range-bound as cautious sentiment prevailsThe S&P BSE Sensex gained 147.71 points to close at 74,602.12, while the NSE Nifty50 lost 5.80 points to end at 22,547.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-withdrawal-relief-for-new-india-cooperative-bank-depositors-check-details-here-2685236-2025-02-25",
      "headline": "RBI withdrawal relief for New India Co-op Bank depositors. Check details hereThis announcement comes just over a week after the central bank prohibited the bank from issuing new loans, dissolved its board and took control owing to 'supervisory concerns.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sell-india-buy-china-why-foreign-investors-are-shifting-bets-2685237-2025-02-25",
      "headline": "Sell India, Buy China: Why FIIs are falling out of love with Dalal StreetDalal Street has witnessed correction over the past six months, with the Nifty50 plummeting from 25,200 levels to around 22,500 levels by the end of February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-bets-big-on-assam-to-invest-rs-50000-crore-in-next-5-years-summit-pm-modi-2685213-2025-02-25",
      "headline": "Reliance bets big on Assam, to invest Rs 50,000 crore in next 5 yearsManaging Director Mukesh Ambani announced an investment of Rs 50,000 crore in Assam. A major part of Reliance's investment will be directed towards making Assam a leader in technology and artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hungary-announces-tax-exemption-for-mothers-with-2-or-more-children-2685199-2025-02-25",
      "headline": "Hungary announces tax exemption for mothers with 2 or more children The said announcement comes ahead of the 2026 elections and is a part of Orban's efforts to boost the country's birth rate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dbs-set-to-cut-4000-jobs-over-3-years-due-to-ai-says-ceo-2685206-2025-02-25",
      "headline": "DBS set to cut 4,000 jobs over 3 years due to AI, says CEODBS CEO Piyush Gupta said the bank will shrink its workforce by 10% in the next three years due to artificial intelligence replacing human roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/hein-schumacher-to-step-down-as-unilever-ceo-in-march-2685192-2025-02-25",
      "headline": "Hein Schumacher to step down as Unilever CEO in MarchThe departure comes just weeks after Unilever announced underwhelming full-year earnings and chose Amsterdam over London and New York as the primary listing for its ice cream business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-investment-share-price-jumps-10-percent-today-ipo-news-group-company-details-2685184-2025-02-25",
      "headline": "Explained: Why Tata Investment share price jumped 10% todayAt around 12:56 pm, shares of the non-banking financial company were up 7.65% to Rs 6,195.85 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-universal-pension-scheme-here-all-you-need-to-know-2685156-2025-02-25",
      "headline": "What is Universal Pension Scheme? Here's all you need to know With India's senior citizen population aged 60 years and above expected to touch 227 million by 2036, a comprehensive social security or pension scheme is necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-commits-to-invest-rs-50000-crore-in-assam-details-here-2685154-2025-02-25",
      "headline": "Adani Group commits to invest Rs 50,000 crore in Assam. Details hereThe investment will focus on infrastructure projects aimed at transforming Assam into a major economic hub. Funds will be allocated to sectors such as airports, aero cities, city gas distribution, transmission networks, cement production, and road projects, with the goal of enhancing connectivity and industrial capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-tax-regime-save-more-itr-nps-benefit-key-details-explained-2685103-2025-02-25",
      "headline": "New Tax Regime: Income up to Rs 13.7 lakh can be tax-free. Here's howFollowing the Union Budget 2025, annual income up to Rs 12 lakh became tax-free. But there's a way to push it even further to Rs 13.7 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-proposes-tighter-rules-for-index-derivatives-heres-what-it-means-2685106-2025-02-25",
      "headline": "Sebi proposes tighter rules for index derivatives. Here's what it meansIn a consultation paper released late Monday, Sebi said it wants to link stock derivative position limits to the cash market. The idea is to cap the market-wide position limit at the lower of 15% of a stock's free-float market cap or 60 times its average daily delivery value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-open-or-close-on-maha-shivratri-2025-dalal-street-trading-sensex-nifty-nse-bse-2685083-2025-02-25",
      "headline": "Dalal Street holiday: Is the stock market open or close on Maha Shivratri 2025?Stock markets usually operate from Monday to Friday, except on declared holidays. They remain closed on Saturdays and Sundays."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-capital-clears-ipo-plan-to-issue-230-million-new-shares-2685061-2025-02-25",
      "headline": "Tata Capital IPO to soon make Dalal Street debut as board clears listing plansTata Capital will be the first company from the Tata Group to launch an IPO since Tata Technologies went public in November 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-higher-snap-losing-streak-but-fii-selling-remains-a-concern-2685058-2025-02-25",
      "headline": "Sensex, Nifty snap losing streak to open higher, but FII selling remains concernThe S&P BSE Sensex was up 81.16 points to 74,535.57, while the NSE Nifty50 gained 11.40 points to 22,564.75 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-stock-market-tech-stocks-fall-donald-trump-latest-order-triggers-sharp-sell-off-ali-baba-2685049-2025-02-25",
      "headline": "Donald Trump's latest order triggers sharp sell-off in China tech stocksThe Hang Seng Tech Index dropped by as much as 4.4% on Tuesday, marking its biggest fall since November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-play-airtel-digital-tv-near-merger-as-dth-fights-streaming-ott-wave-report-2685034-2025-02-25",
      "headline": "Tata Play, Airtel Digital TV near merger as DTH fights streaming wave: Report The merger is expected to be done through a share swap, allowing Airtel to increase its non-mobile revenue by offering a combination of telecom, broadband, and DTH services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-india-co-operative-bank-depositors-relief-rbi-allows-rs-25000-withdrawal-2684967-2025-02-24",
      "headline": "New India Co-op Bank depositors get relief as RBI allows Rs 25,000 withdrawal Withdrawals can be made through branches or ATMs, but the total amount a depositor can withdraw will be capped at Rs 25,000 or the balance available in their account, whichever is lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-eliminate-loan-foreclosure-charges-and-prepayment-penalties-2684812-2025-02-24",
      "headline": "RBI plans to eliminate loan foreclosure charges and prepayment penalties The central bank has invited feedback from the public and stakeholders on a draft circular directing banks not to levy foreclosure charges and pre-payment penalties on loans by March 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-3-banks-slash-loan-interest-rates-after-rbi-repo-rate-cut-bom-sbi-pnb-2684760-2025-02-24",
      "headline": "These 3 banks slash loan interest rates after RBI's repo rate cut The RBI, after a gap of five years, announced a reduction in the repo rate by 25 bps to 6.25%. A dip in the repo rate can lead to lower interest rates on loans, thereby making loans cheaper, and vice versa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-reciprocal-tariffs-india-impact-explained-2684743-2025-02-24",
      "headline": "Will Donald Trump's tariffs hurt India? Here's what S&P saysIn its latest report, titled 'Asia-Pacific Economies Likely To Be Hit By US Trade Tariffs', S&P pointed out that countries like Vietnam, Taiwan, Thailand, and South Korea have stronger trade ties with the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-dalal-street-ends-in-red-sensex-loses-over-850-points-it-stocks-crash-wipro-infosys-2684708-2025-02-24",
      "headline": "Dalal Street ends in red: Sensex loses over 850 points, IT stocks crashThe S&P BSE Sensex lost 856.55 points to close at 74,454.41, while the NSE Nifty50 shed 242.55 points to end at 22,553.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tax-planning-2025-3-easy-ways-to-maximise-tax-savings-before-march-31-2684662-2025-02-24",
      "headline": "Tax planning 2025: 3 easy ways to maximise tax savings before March 31One can invest in Equity Linked Saving Schemes (ELSS), Public Provident Fund (PPF), life insurance premiums, National Savings Certificate (NSC) and tax-saving fixed deposits, to claim deductions of up to Rs 1,50,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-set-for-its-longest-losing-streak-in-28-years-should-you-be-worried-2684694-2025-02-24",
      "headline": "Nifty set for longest losing run in 28 years. Should you be worried?The Nifty losing for five months straight is a rare sight. Last time this happened was in 1996, and before that in 1994-95, when it fell 31.4% over eight months. Right now, the index has fallen over 11% since October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-icici-bank-chief-chanda-kochhar-launches-podcast-journey-unscripted-youtube-2684681-2025-02-24",
      "headline": "Former ICICI Bank chief Chanda Kochhar launches podcast Chanda Kochhar, 63, joined ICICI Bank in 1984 and worked her way up to become its Managing Director (MD) and Chief Executive Officer (CEO) in 2009. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-rate-cut-expectations-reduce-lending-rates-again-in-april-policy-meeting-governor-sanjay-malhotra-2684655-2025-02-24",
      "headline": "Will RBI reduce lending rates again in April policy meeting?The recent MPC meeting, held from February 5-7, saw all members agreeing that a rate cut was needed to support slowing economic growth, as inflation was no longer a major concern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sip-investment-options-nps-ppf-or-mutual-funds-which-is-best-for-you-2684617-2025-02-24",
      "headline": "NPS, PPF, or mutual funds: Which SIP investment should you opt for? Are you looking to invest in SIP but unsure where to put your money? Read to know whether you should opt for PPF, NPS, or mutual funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-bill-what-is-clubbing-of-income-under-family-taxation-2684606-2025-02-24",
      "headline": "Income Tax Bill: What is clubbing of income under family taxation In certain cases, income earned by an individual can be included in another taxpayer's income. In such cases, the latter is eligible to pay taxes not only on his income but also on the income of the other person as well. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-abhishek-bachchan-inayat-verma-prime-video-series-release-date-2685817-2025-02-26",
      "headline": "Be Happy: Abhishek Bachchan, Inayat Verma series to stream in MarchThe streaming date of Abhishek Bachchan and Inayat Verma-starrer Be Happy is out. It promises to be a touching film about a single father's journey to support his daughter's dream of performing on a dance reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-man-on-the-inside-review-ted-danson-netflix-charming-comedy-2685801-2025-02-26",
      "headline": "A Man on the Inside: Ted Danson's charming comedy deserves more loveA Man on the Inside is a warm and witty series which tackles multiple subjects, including loss, new beginnings and, well, crime. The Ted Danson-starrer is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-chikni-chameli-embarrassed-when-5-year-old-girls-sing-it-2685777-2025-02-26",
      "headline": "Shreya Ghoshal on Chikni Chameli: Embarrassed when 5-year-old girls sing itShreya Ghoshal says she feels embarrassed when young girls sing Chikni Chameli, stressing that lyrics should be written more thoughtfully, as music and films have a deep impact on society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-updates-fans-about-cancer-treatment-my-chemo-and-surgery-are-over-2685753-2025-02-26",
      "headline": "Hina Khan updates fans about cancer treatment: My chemo and surgery are overHina Khan recently gave an update about her cancer treatment. The actor mentioned that her chemotherapy and surgery are over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-jokes-about-ranveer-allahbadia-ignoring-his-texts-2685715-2025-02-26",
      "headline": "Tanmay Bhat jokes about Ranveer Allahbadia ignoring his textsTanmay Bhat hilariously addressed the India's Got Latent controversy, joking about Ranveer Allahbadia ignoring his texts. The reaction video left fellow comedians laughing and also \"triggered\" them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-udit-narayan-visits-maha-kumbh-mela-with-wife-expresses-gratitude-2685597-2025-02-25",
      "headline": "Singer Udit Narayan visits Maha Kumbh Mela with wife, expresses gratitude Singer Udit Narayan was among the latest celebrities to visit the holy city of Prayagraj for Maha Kumbh 2025. In an interview with ANI, he expressed his gratitude and congratulated Chief Minister Yogi Adityanath for the well-organised and efficient arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-dearest-nemesis-review-moon-ga-young-choi-hyun-wook-2685507-2025-02-25",
      "headline": "My Dearest Nemesis review: Chaotic chemistry makes even familiar trope workMy Dearest Nemesis features K-drama stars Moon Ga young and Choi Hyun-wook in the lead. It is available to stream on Viki. Here's our take on the romantic drama. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-calls-farah-khan-insensitive-for-mocking-gaurav-khannas-colour-blindness-celebrity-masterchef-2685266-2025-02-25",
      "headline": "Internet calls Farah Khan 'insensitive' for mocking Gaurav Khanna's colour blindnessCelebrity MasterChef judge Farah Khan mocked TV actor Gaurav Khanna's colour blindness on the show. Following the same, the internet is outraged by her comments, criticising the filmmaker and calling her 'insensitive'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-gears-up-for-her-first-netflix-yet-to-be-titled-thriller-series-2685151-2025-02-25",
      "headline": "Parineeti Chopra gears up for her first Netflix yet-to-be-titled thriller seriesActor Parineeti Chopra is set to make her series OTT debut with a Netflix project. The actor shared a post and informed about sharing screen space with Nimrit Kaur, Soni Razdan, and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tanmay-bhat-x-account-hacked-comedian-warns-followers-2685118-2025-02-25",
      "headline": "Tanmay Bhat's X account hacked, comedian warns followersTanmay Bhat's X account recently got hacked, leading to fraudulent messages being posted online. The comedian shared a post on his Instagram and warned his followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-vrishank-khanal-haldi-pics-pre-wedding-festivties-wedding-karjat-2685070-2025-02-25",
      "headline": "Prajakta Koli-Vrishank Khanal can't take their eyes off each other in haldi picsActor Prajakta Koli is set to marry longtime boyfriend Vrishank Khanan on February 25. Ahead of the grand day, the actor shared pictures from her haldi function. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupam-mittal-on-india-got-latent-backlash-not-lost-episode-of-satyamev-jayate-2685071-2025-02-25",
      "headline": "Anupam Mittal on India's Got Latent backlash: Not a lost episode of Satyamev JayateAnupam Mittal weighs in on the India's Got Latent row, arguing that YouTube should also be held accountable. He calls Big Tech the real culprit, criticising digital platforms for fueling outrage-driven content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-says-aashram-helped-him-break-industry-image-explore-new-roles-2685062-2025-02-25",
      "headline": "Bobby Deol says Aashram helped him break industry image, explore new rolesActor Bobby Deol is all set to return as Baba Nirala in Prakash Jha's series, Aashram 3 part 2. The actor confessed that he wanted to step out of his comfort zone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-waking-of-a-nation-trailer-taaruk-raina-fights-to-prove-jallianwala-act-was-planned-2684901-2025-02-24",
      "headline": "Waking of Nation trailer: Taaruk Raina fights to prove Jallianwala Bagh was plannedA new show that explores the events surrounding the Jallianwala Bagh massacre is set to premiere on Sony LIV on March 8. Starring Taaruk Raina in the lead role, the series is titled The Waking of a Nation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-responds-to-rumours-of-drug-use-2684862-2025-02-24",
      "headline": "Singer Justin Bieber responds to rumours of drug useJustin Bieber's representative has reacted to the reports of the singer's drug use and called them false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/ranveer-allahbadia-runs-to-car-after-recording-statement-in-latent-probe-2684803-2025-02-24",
      "headline": "Ranveer Allahbadia runs to car after recording statement in Latent probeRanveer Allahbadia was clicked in a hurried state, running towards his car as the paparazzi tried to capture his pictures on Monday. The YouTuber visited the Maharashtra Cyber office in Mahape after recording his statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaushaljis-vs-kaushal-review-a-simple-yet-complex-tale-of-second-chance-in-love-2684706-2025-02-24",
      "headline": "Kaushaljis vs Kaushal review: A simple yet complex tale of second chance in loveReleased-Fri Feb 21, 2025Kaushaljis vs Kaushal movie review: This film is a heartfelt exploration of second chances in love, focusing on a middle-aged couple navigating the complexities of separation and familial expectations. Set in the relatable backdrop of Kannauj, the film captivates with its simplicity and stellar performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dupahiya-trailer-a-wedding-a-missing-bike-and-a-lot-of-chaos-in-offing-2684642-2025-02-24",
      "headline": "Dupahiya trailer: A wedding, a missing bike and a lot of chaos in offingThe first full trailer of Prime Video's upcoming comedy series, Dupahiya, is here. The show will feature actors such as Sparsh Shrivastava and Gajraj Rao in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-dances-to-zingaat-with-fiance-at-mehndi-ceremony-watch-2684622-2025-02-24",
      "headline": "Bride-to-Be Prajakta Koli dances to Zingaat with fiance at mehndi ceremony. WatchPrajakta Koli shared glimpses of her mehndi ceremony as she danced joyfully with fiance Vrishank Khanal. The couple is set to marry on February 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-netflix-review-robert-de-niro-angela-bassett-jesse-plemons-political-drama-2684414-2025-02-24",
      "headline": "Zero Day review: Star power can't save this weakly executed political dramaReleased-Thu Feb 20, 2025Zero Day, directed by Lesli Linka Glatter, is a political drama featuring a stellar cast including Robert De Niro and Angela Bassett. While the performances are strong, the series struggles with plot depth and resolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-jennie-and-doechii-bring-the-heat-with-extral-ahead-of-ruby-2684489-2025-02-24",
      "headline": "Watch: Jennie and Doechii bring the heat with ExtraL ahead of RubyJennie and Doechii are making waves with their latest collaboration, ExtraL. As Jennie gears up for her solo debut with the album Ruby, fans can expect a bold new chapter in her musical journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-insulting-religion-jiohotstar-show-hafta-vasooli-complaint-2684460-2025-02-24",
      "headline": "Complaint against Munawar Faruqui for 'insulting religion' on Hafta Vasooli showComedian Munawar Faruqui landed in legal trouble after a complaint was filed against him for hurting religious sentiments through his show, Hafta Vasooli. The advocate shared a copy of the complaint on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mismatched-actor-prajakta-koli-shares-dreamy-pics-from-her-mehndi-ceremony-2684350-2025-02-23",
      "headline": "'Mismatched' actor Prajakta Koli shares dreamy pics from her mehndiContent creator and actor Prajakta Koli has started her pre-wedding celebrations with a vibrant mehndi ceremony. She shared joyful moments with her fiance Vrishank Khanal and family on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singhs-millionaire-concert-in-mumbai-comeback-stage-aajtak-2684255-2025-02-23",
      "headline": "Honey Singh's Millionaire concert in Mumbai showed what grand comebacks look likeYo Yo Honey Singh made a powerful return to the stage in Mumbai, captivating fans with his energy and heartfelt messages. His performance was a testament to his resilience and dedication to the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-indias-got-latent-controversy-tanmay-bhat-joke-unfiltered-tour-2684268-2025-02-23",
      "headline": "Samay Raina recalls what he asked Tanmay Bhat after India's Got Latent controversyComedian Samay Raina addresses the controversy surrounding YouTuber Ranveer Allahbadia's inappropriate remark on his show, India's Got Latent, during his tour in Canada. He recalled what he had asked Tanmay Bhat after the controversy erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-dig-badshah-raftaar-millionaire-india-tour-stage-aajtak-video-2684165-2025-02-23",
      "headline": "Honey Singh's jibe at Raftaar, Badshah: People say they'll write my destinyHoney Singh took a direct dig at fellow artists Badshah and Raftaar at the first Millionaire India Tour stop in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-take-on-diljit-dosanjh-punjabi-aa-gaya-oye-millionaire-tour-mumbai-stage-aajtak-2684161-2025-02-23",
      "headline": "Watch: Honey Singh's take on Diljit Dosanjh's 'Punjabi Aa Gaya Oye'Honey Singh launched his Millionaire India Tour in Mumbai, delivering a captivating performance that engaged a sold-out audience. He shared his take on Diljit Dosanjh's 'Punjabi aa gays oye', emphasising unity among diverse Indian communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/watch-honey-singh-kicks-off-millionaire-tour-with-a-grand-mumbai-show-2684048-2025-02-22",
      "headline": "Watch: Honey Singh kicks off Millionaire tour with a grand Mumbai showRapper Honey Singh launched his Millionaire Tour with a spectacular concert in Mumbai. The show featured dramatic entrances and a lineup of energetic performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/undercover-high-school-x-review-fans-give-thumbs-up-to-seo-kang-joons-k-drama-2683974-2025-02-22",
      "headline": "Undercover High School X review: Fans give thumbs up to Seo Kang-joon's K-dramaUndercover High School, featuring Seo Kang-joon and Jin Ki-joo, has premiered on MBC TV. The series, praised for its engaging storyline, follows an undercover NIS agent as a high school student."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-sean-diddy-combs-attorney-withdraws-from-case-says-under-no-circumstances-can-i-continue-2683745-2025-02-22",
      "headline": "Rapper Diddy's attorney withdraws from case: Under no circumstances can I continueAnthony Ricco, representing Sean 'Diddy' Combs, has filed to withdraw from the federal case citing reasons protected by attorney-client privilege. Ricco had once defended Osama bin Laden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/buried-hearts-review-park-hyung-sik-huh-joon-ho-jiohotstar-2683665-2025-02-21",
      "headline": "Buried Hearts review: Park Hyung-sik commands attention in his darkest roleReleased-Sat Feb 22, 2025The Korean drama Buried Hearts will captivate viewers with its blend of intense emotions and high-stakes drama. The series, featuring Park Hyung-sik, explores the complex dynamics of corporate intrigue and personal survival. Read the full review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-reacts-to-summons-i-am-poor-not-criminal-focus-on-rape-cases-indias-got-latent-row-2683583-2025-02-21",
      "headline": "Rakhi Sawant reacts to summons: I'm poor, not criminal - focus on rape casesRakhi Sawant was summoned by the Maharashtra cyber cell to record her statement regarding YouTuber Ranveer Allahbadia's controversial remarks on Samay Raina's show, 'India's Got Latent'. She urged the police to focus on solving pending rape cases instead of treating her like a criminal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zero-day-critics-praise-robert-de-niro-criticise-show-incoherent-politics-netflix-2683507-2025-02-21",
      "headline": "Zero Day: Critics praise Robert De Niro, criticise show's 'incoherent politics'Critics have mixed reactions to Robert De Niro's latest Netflix series, Zero Day. While many have praised De Niro, a section of them are unhappy with the narrative of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/onerepublic-grammy-nominated-band-collaborates-with-karan-aujla-for-new-song-tell-me-2683449-2025-02-21",
      "headline": "Grammy-nominated band OneRepublic unites with Karan Aujla for new song Tell MeGlobal pop-rock sensation OneRepublic is collaborating with Punjabi artist Karan Aujla for a new track titled Tell Me. It will release on February 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prajakta-koli-marry-boyfriend-fiance-vrishank-khanal-february-25-karjat-2683433-2025-02-21",
      "headline": "Mismatched actor Prajakta Koli to marry boyfriend on February 25: ReportActor Prajakta Koli is set to marry her boyfriend Vrishank Khanal on February 25. Their wedding festivities will begin on February 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crime-beat-review-saqib-saleem-rahul-bhat-sai-tamhankar-fail-to-impress-2683407-2025-02-21",
      "headline": "Crime Beat review: Rahul Bhat, Saqib Saleem's crime drama gets lost in its own chaosReleased-Fri Feb 21, 2025'Crime Beat', a political thriller, premiered on Zee5 on February 21. Based on the book titled 'The Price You Pay', the show falls short due to outdated tropes and exaggerated clichés. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yo-yo-honey-singh-a-great-cook-reveals-his-favourite-dish-aaj-tak-millionaire-tour-2683425-2025-02-21",
      "headline": "Honey Singh says he's a great cook, reveals his favourite dishRapper and music producer Yo Yo Honey Singh opens up about his favourite cuisine, his cooking skills and more in an exclusive interaction with us. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/park-bo-young-versatility-melo-movie-strong-girl-bong-soon-k-drama-2683400-2025-02-21",
      "headline": "From heartfelt to hilarious, in praise of Park Bo-young's versatilityKorean star Park Bo-young has been acting for almost two decades now. Her ability to completely inhabit the skin of her characters makes her truly stand out. She is currently seen in Melo Movie, which is streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-his-mumbai-concert-doing-something-ive-never-done-before-2683388-2025-02-21",
      "headline": "Honey Singh on his Mumbai concert: Doing something I've never done beforeRapper Honey Singh is starting his countrywide tour from Mumbai on Saturday. In an exclusive interview with us, the singer talked about the gig and what he's doing differently this time at 'Millionaire India Tour at Stage Aajtak'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kangana-ranaut-announces-emergency-ott-release-when-and-where-to-watch-2683366-2025-02-21",
      "headline": "Kangana Ranaut's Emergency to premiere on Netflix. Check release dateKangana Ranaut's film, Emergency, is going to hit the screens next month. The actor shared a quick announcement in her Instagram stories on Friday. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/amit-shah-rejects-mk-stalin-tamil-nadu-delimitation-claim-south-states-wont-lose-a-single-seat-language-war-2685805-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil Nadu won't lose a single seat: Amit Shah rejects Stalin's delimitation chargeHome Minister Amit Shah dismissed Tamil Nadu Chief Minister MK Stalin's claim that the state would lose eight Lok Sabha seats due to delimitation, asserting that no southern state would see a reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-rajya-sabha-buzz-aap-fields-sanjeev-arora-ludhiana-west-assembly-bypoll-2685758-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal in Rajya Sabha buzz after AAP's bypoll move, party deniesThe AAP has fielded MP Sanjeev Arora in the Ludhiana West assembly bypoll, stirring up buzz about Arvind Kejriwal's Rajya Sabha entry. However, the party dismissed the speculations in a formal statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/united-states-gold-card-visa-trump-eligibility-impact-on-indians-2685855-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's 'gold card' visa for uber-rich migrants. How it impacts IndiansUS gold visa: Donald Trump announced a 'gold card' visa scheme for US citizenship for a hefty fee of USD 5 million. The program will compound the woes of skilled Indian professionals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-politics-future-kerala-state-assembly-election-rahul-gandhi-bjp-2685303-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If not Congress, the options that Shashi Tharoor hasWith his future in the Congress unclear, four-time MP Shashi Tharoor finds himself at a crossroads. He's welcomed by the Left, courted by the BJP, and experts speculate he could even launch his own political outfit. Will he carve a new path or join the BJP or remain adrift in the Congress? This is what Tharoor and political experts have to say. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-donald-trump-bizarre-video-vision-for-gaza-cocktails-beach-gold-statue-benjamin-netanyahu-elon-musk-2685819-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cocktails with Netanyahu, gold statue: Bizarre AI video of Trump's Gaza Earlier this month, Donald Trump made a shock announcement, saying that the US would \"take over and own\" the Gaza Strip and develop the besieged Palestinian enclave as \"Riviera of the Middle East\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tvk-vijay-on-hindi-row-dmk-bjp-pretend-to-fight-and-expect-us-to-believe-it-2685807-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Vijay mocks DMK-BJP clash over Hindi: Sounds like LKG, UKG kids fightingActor-politician Vijay slammed DMK and BJP over the Hindi row, calling it to be \"LKG, UKG children fighting\". He also accused the two parties of misleading Tamil Nadu while pretending to oppose each other on social media.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/southwest-flexjet-near-miss-collision-chicago-midway-airport-landing-runway-air-traffic-control-audio-2685797-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Tower, how'd that happen?': Chilling ATC audio of near-miss at US airportA Southwest Airlines passenger plane nearly collided with a business jet during a landing attempt at Chicago's Midway airport. Air traffic control audio of the incident has raised troubling questions about the role of the private jet pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/contaminated-wheat-atta-resulting-in-hair-loss-what-is-wheat-selenium-thats-to-blame-explained-maharashtra-2685809-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hair loss linked to contaminated atta. What is wheat selenium that's to blame?Over 300 people in Maharashtra's Buldhana district reported sudden hair loss and balding. A study by Padma Shri awardee physician Himmatrao Bawaskar found high levels of selenium in the wheat being distributed and consumed there as the reason for the surge in alopecia. Here's all about selenium, how it contaminates wheat, and the health risks from it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-lawyer-breaks-silence-on-divorce-rumours-clarifies-sunita-had-filed-for-divorce-but-they-are-back-together-exclusive-2685812-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita had filed for divorce, but they are back together: Govinda's lawyerRumours have been rife about Govinda-Sunita's divorce. However, his lawyer has now clarified to India Today that Sunita had indeed filed for divorce six months earlier, but they are now \"going strong\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/terrorists-terror-attack-firing-army-vehicle-jammu-rajouri-sunderbani-2685841-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Terrorists fire at Army vehicle in Jammu and Kashmir's Rajouri, no casualtiesAn Army vehicle was attacked by terrorists in Jammu and Kashmir's Rajouri on Wednesday. The incident took place around 1 pm.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yograj-singh-pakistan-cricket-downfall-shoaib-akhtar-wasim-akram-commentary-2685785-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yograj Singh to Wasim, Shoaib: Don't just talk, I can fix Pakistan cricket in a yearFormer India cricketer Yograj Singh lashed out at the likes of Shoaib Akhtar and Wasim Akram, urging them to get out of the commentary boxes and help Pakistan players on the field. Yograj claimed he could fix Pakistan cricket team and improve their players in just a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/prashant-kishor-aadhav-arjuna-vijay-tvk-anniversary-event-2685834-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prashant Kishor takes swipe at DMK in Vijay's party event in Tamil NaduPolitical strategist Prashant Kishor and TVK leader Aadhav Arjuna launched sharp attacks on Tamil Nadu's ruling party, criticising dynasty politics and corruption. The two, speaking at the party's anniversary event, endorsed Vijay as a transformative leader, and promised significant political shifts in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-family-to-move-out-of-mannat-rents-duplexes-in-pali-hill-2685813-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shah Rukh Khan, family to move out of Mannat, rents duplexes in Pali Hill: ReportShah Rukh Khan is temporarily moving out of Mannat as the bungalow will undergo a renovation. He has rented high-end duplexes in Pali Hills from producer Jackky Bhagnani and his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-icc-rankings-cricket-virat-kohli-shubman-gill-babar-azam-odi-2685842-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli back in top 5, Shubman Gill extends lead over Babar AzamICC ODI Rankings: Following his hundred against Pakistan in Dubai, Virat Kohli has returned to the top five of men's ODI batting rankings. Shubman Gill has extended his lead over second-placed Babar Azam to 47 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/bihar/story/bihar-cabinet-expansion-budget-session-nitish-kumar-jdu-bjp-2685695-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar Cabinet expansion today at 4 pm, 7 new ministers to be inductedThe current strength of the Bihar Cabinet is 30, with 15 BJP ministers, 13 JD(U), one from the Hindustani Awam Morcha (HAM) and an Independent. Six seats remain vacant."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/in-visuals-what-makes-telangana-tunnel-rescue-challenging-2685767-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In visuals: What makes Telangana tunnel rescue challenging?India Today decodes the challenges hindering the rescue operations at Srisailam Left Bank Canal (SLBC). Authorities blame accumulated sludge and continuous inflow of water into the tunnel for the slow rescue operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mumbai-sweating-in-a-heatwave-the-science-behind-the-unusual-february-heat-2685802-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's driving the unusual February heatwave in Mumbai?February, being part of the winter season, usually sees much cooler temperatures compared to the peak summer months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mahashivratri-triveni-sangam-final-snan-prayagraj-devotees-last-day-2685633-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh's grand culmination today, lakhs flock for final Amrit SnanThe Maha Kumbh Mela in Prayagraj, which attracted 65 crore devotees from across the country, is set to conclude on Wednesday, coinciding with Mahashivratri."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-jaiveer-shergill-air-india-poor-services-broken-seat-oscar-shivraj-chouhan-2685774-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP leader's 'Oscar' remark for Air India. But it is not for what you thinkBJP's Jaiveer Shergill, in a hard-hitting post on X, shared his recent flight experience with the airline, listing a host of complaints - from broken seats to customer service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rift-with-congress-bjp-buzz-second-marriage-shashi-tharoor-spills-the-beans-2685784-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rift with Congress, BJP buzz, second marriage? Shashi Tharoor spills the beansShashi Tharoor finds himself at the centre of speculation - his words and actions dissected for clues. Is he leaving Congress? Warming up to the BJP? Considering remarriage? The Thiruvananthapuram MP, known for defying the party line, has set the record straight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/thailands-koh-samui-is-gaining-popularity-among-indians-after-the-white-lotus-season-3-2685443-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Thailand's Koh Samui is gaining popularity among IndiansKoh Samui is known for its beautiful beaches, temples like Wat Phra Yai (Big Buddha Temple), and natural attractions such as Hin Ta and Hin Yai Rocks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/not-elon-musk-but-amy-gleason-is-heading-trumps-doge-who-is-she-2685729-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not Elon Musk, but Amy Gleason is heading Trump's DOGE. Who is she?After weeks of speculation, the White House on Tuesday named Amy Gleason as acting administrator of the Department of Government Efficiency (DOGE). Court filings revealed that, despite Trump's claims, Elon Musk has no direct authority over the cost-cutting program."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telugu-learning-mandatory-in-telangana-cbse-icse-schools-from-2025-2685799-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana mandates Telugu for Classes 1-10 in all schools operating in stateTelangana has made Telugu compulsory for Classes 1 to 10 in CBSE, ICSE, IB, and other board-affiliated schools from 2025-26. The law was enacted in 2018 but not fully implemented by the previous BRS government. The Congress government has now enforced it, introducing a 'Simple Telugu' textbook for easier learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-petition-revoke-elon-musk-citizenship-passport-280000-signatures-threats-attack-sovereignty-2685764-2025-02-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada launches petition to strip Elon Musk's citizenship? Here's whyElon Musk currently holds citizenships of South Africa, where he was born, the US and Canada. After the SpaceX CEO immigrated to Canada in 1989, he acquired citizenship via his mother, Maye Musk, who is from Saskatchewan's capital, Regina. He became an American citizen in 2002."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/superboys-of-malegaon-review-a-fitting-tribute-to-the-love-of-cinema-2685859-2025-02-26",
      "headline": "Superboys of Malegaon review: A fitting tribute to the love of cinema Released-Fri Feb 28, 2025Superboys of Malegaon movie review: This is a heartfelt film capturing the dreams and struggles of a group of boys in Malegaon who are passionate about making movies, reflecting the magic of cinema and the changing face of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-on-bollywood-habit-of-copying-hollywood-films-2685860-2025-02-26",
      "headline": "We were good thieves: Paresh Rawal on Bollywood's habit of copying Hollywood filmsParesh Rawal reveals Bollywood directors in the '80s-'90s copied Hollywood films, handing actors cassettes to recreate scenes. He says Hollywood's entry in India forced filmmakers to create original stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baalveer-actor-dev-joshi-marries-girlfriend-aarti-first-pics-out-2685838-2025-02-26",
      "headline": "Baalveer actor Dev Joshi marries girlfriend Aarti, first pics outBaalveer actor Dev Joshi married his girlfriend Aarti in a beautiful ceremony. The wedding festivities, including haldi and mehndi, were spectacular and captured in stunning photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/a-complete-unknown-review-timothee-chalamet-bob-dylan-2685823-2025-02-26",
      "headline": "A Complete Unknown review: Timothee's Dylan lingers long after final notes fadeReleased-Fri Feb 28, 2025Timothee Chalamet has once again proved that he is one of the greats in the making with his latest performance in the Bob Dylan biopic, A Complete Unknown. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-india-vs-pakistan-big-match-player-century-lalchand-rajput-2685826-2025-02-26",
      "headline": "Virat Kohli proved why he is a big match player: Lalchand RajputLalchand Rajput hailed Virat Kohli's century against Pakistan as a reminder of his \"big match\" prowess. The knock not only secured India's semi-final spot but also silenced critics questioning his recent form in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-icc-rankings-cricket-virat-kohli-shubman-gill-babar-azam-odi-2685842-2025-02-26",
      "headline": "Virat Kohli back in top 5, Shubman Gill extends lead over Babar AzamICC ODI Rankings: Following his hundred against Pakistan in Dubai, Virat Kohli has returned to the top five of men's ODI batting rankings. Shubman Gill has extended his lead over second-placed Babar Azam to 47 points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yograj-singh-pakistan-cricket-downfall-shoaib-akhtar-wasim-akram-commentary-2685785-2025-02-26",
      "headline": "Yograj Singh to Wasim, Shoaib: Don't just talk, I can fix Pakistan cricket in a yearFormer India cricketer Yograj Singh lashed out at the likes of Shoaib Akhtar and Wasim Akram, urging them to get out of the commentary boxes and help Pakistan players on the field. Yograj claimed he could fix Pakistan cricket team and improve their players in just a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sachin-tendulkar-india-masters-vs-england-masters-tim-bresnan-2685760-2025-02-26",
      "headline": "Watch: Sachin Tendulkar takes fans down memory lane with IML blitzSachin Tendulkar rolled back the years with a nostalgic knock, smashing a quickfire 34 off 21 balls for India Masters in the International Masters League, leading his side to a dominant nine-wicket win over England Masters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-imran-khan-india-vs-pakistan-watch-jail-upset-pcb-blame-game-2685739-2025-02-26",
      "headline": "Imran Khan warns of Pakistan cricket's death as blame game over flop show beginsImran Khan expressed disappointment over Pakistan's Champions Trophy exit, blaming poor leadership in cricket administration, while former PCB chief Najam Sethi held Imran responsible for the sport's decline due to his overhaul of the domestic structure. The turmoil in Pakistan cricket continues, with head coach Aaqib Javed reportedly set to be sacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-crciekt-wpl-2025-attention-rcb-dc-mumbai-indians-2685596-2025-02-26",
      "headline": "Is the WPL getting enough love amid Champions Trophy festival? The Champions Trophy and the Women's Premier League are happening simultaneously. But with stars like Virat Kohli and Rohit Sharma in action in Dubai, is the WPL getting enough attention?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jos-buttler-boycott-taliban-women-law-2685710-2025-02-26",
      "headline": "Amid boycott call shadow, Jos Buttler speaks on women's plight under TalibanEngland captain Jos Buttler backed the ECB's decision to play Afghanistan in the Champions Trophy despite boycott calls, expressing concern for Afghan women but hoping sport can unite. Afghanistan captain Hashmatullah Shahidi distanced cricket from politics, while the Taliban's restrictions on women's sport remain under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/video/security-breach-during-champions-trophy-in-pakistan-ytvd-2685687-2025-02-26",
      "headline": "Security breach disrupts Champions Trophy in PakistanA security breach at Pakistan's Champions Trophy involved an intruder approaching cricketer Rachin Ravindra. The intruder, linked to an Islamist political group, has been banned by the Cricket Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-welsh-fire-rashid-khan-oval-invincibles-ben-stokes-2685702-2025-02-26",
      "headline": "Steve Smith, Rashid Khan to star in The Hundred, Ben Stokes pulls outSteve Smith and Rashid Khan secured The Hundred deals, while England's Ben Stokes opted out to manage his workload. The tournament also saw major signings, including Trent Boult, Marcus Stoinis, Meg Lanning, and Laura Wolvaardt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-police-dismissed-refusing-duties-india-vs-pakistan-2685694-2025-02-26",
      "headline": "Over 100 Pakistani policemen dismissed for refusing Champions Trophy dutyIn an unprecedented move, over 100 Punjab Police officers were dismissed for refusing security duties during the ICC Champions Trophy 2025, as authorities emphasised zero tolerance for negligence in safeguarding international sporting events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-crciekt-wpl-2025-attention-rcb-dc-mumbai-indians-2685596-2025-02-26",
      "headline": "Is the WPL getting enough love amid Champions Trophy festival? The Champions Trophy and the Women's Premier League are happening simultaneously. But with stars like Virat Kohli and Rohit Sharma in action in Dubai, is the WPL getting enough attention?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-vs-afghanistan-jos-buttler-boycott-taliban-women-law-2685710-2025-02-26",
      "headline": "Amid boycott call shadow, Jos Buttler speaks on women's plight under TalibanEngland captain Jos Buttler backed the ECB's decision to play Afghanistan in the Champions Trophy despite boycott calls, expressing concern for Afghan women but hoping sport can unite. Afghanistan captain Hashmatullah Shahidi distanced cricket from politics, while the Taliban's restrictions on women's sport remain under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/champions-trophy/video/security-breach-during-champions-trophy-in-pakistan-ytvd-2685687-2025-02-26",
      "headline": "Security breach disrupts Champions Trophy in PakistanA security breach at Pakistan's Champions Trophy involved an intruder approaching cricketer Rachin Ravindra. The intruder, linked to an Islamist political group, has been banned by the Cricket Board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-welsh-fire-rashid-khan-oval-invincibles-ben-stokes-2685702-2025-02-26",
      "headline": "Steve Smith, Rashid Khan to star in The Hundred, Ben Stokes pulls outSteve Smith and Rashid Khan secured The Hundred deals, while England's Ben Stokes opted out to manage his workload. The tournament also saw major signings, including Trent Boult, Marcus Stoinis, Meg Lanning, and Laura Wolvaardt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-police-dismissed-refusing-duties-india-vs-pakistan-2685694-2025-02-26",
      "headline": "Over 100 Pakistani policemen dismissed for refusing Champions Trophy dutyIn an unprecedented move, over 100 Punjab Police officers were dismissed for refusing security duties during the ICC Champions Trophy 2025, as authorities emphasised zero tolerance for negligence in safeguarding international sporting events."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}