{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-india-needs-indian-cibil-credit-score-framework-cibil-credit-bureau-rbi-data-sovereignty-financial-inclusion-thin-file-borrowers-2875815-2026-02-28",
      "headline": "India built UPI and Aadhaar, is it time for an Aatmanirbhar credit score too?A three-digit number may look small on paper. But for millions of Indians, it quietly decides how far they can go. India built digital infrastructure for identity (AADHAAR) and payment (UPI). The next question is whether credit deserves the same clarity and control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-brothers-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall-2875705-2026-02-28",
      "headline": "Warner Bros Discovery signs $110 billion deal with Paramount SkydanceWarner Bros Discovery agreed to a $110 billion acquisition by Paramount Skydance after Netflix declined to match the offer, creating a media powerhouse set to reshape Hollywood and streaming competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-fds-to-mutual-funds-how-indians-are-changing-their-investment-behaviour-zerodha-nithin-kamath-2875570-2026-02-27",
      "headline": "From FDs to mutual funds: How Indians are changing their investment behaviourFor years, FDs and real estate were the first choice for Indian savers seeking safety and certainty. Now, mutual funds are steadily gaining popularity, especially among first-time investors looking for higher returns. Is this the beginning of a long-term shift in how Indians invest?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-q3-gdp-growth-comes-in-at-78-after-base-year-revision-2875439-2026-02-27",
      "headline": "India's Q3 GDP grows 7.8% as government rolls out new base year seriesThe Ministry of Statistics and Programme Implementation introduced a new series of GDP estimates with 2022-23 as the base year, replacing the earlier 2011-12 base."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-down-961-points-nifty-below-25200-maruti-hul-ril-auto-down-2875418-2026-02-27",
      "headline": "Sensex, Nifty fall over 1% as global worries mount; auto, financial shares tankThe S&P BSE Sensex tanked 961.42 points to close at 81,287.19, while the NSE Nifty50 lost 317.90 points to end at 25,178.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-wheat-crisis-usda-report-flour-shortage-afghanistan-conflict-2026-2875416-2026-02-27",
      "headline": "Pakistan to run short of flour? Wheat output likely to fall amid Afghanistan warAccording to a report by the United States Department of Agriculture (USDA), Pakistan's wheat production is expected to decline by 2 to 2.2 million tonnes compared to last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/including-property-in-your-will-heres-how-to-avoid-family-and-legal-conflicts-2875396-2026-02-27",
      "headline": "Including property in your will? Here's how to avoid family and legal conflictsA house is often the most valuable thing people leave behind. Yet, without proper details in a Will, like ownership clarity, liabilities, and documentation, it can become the very reason families face delays and disagreements instead of closure. Is your Will detailed enough to prevent that?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-indias-growing-wealth-is-driving-investment-into-luxury-real-estate-2875325-2026-02-27",
      "headline": "Why India's growing wealth is driving investment into luxury real estateAs capital increases, investors become more careful. The focus shifts from chasing returns to protecting value. This is why luxury real estate is gaining importance in serious portfolios."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-jumps-over-rs-8000-time-to-invest-hold-or-sell-2875304-2026-02-27",
      "headline": "Silver jumps over Rs 8,000: Time to invest, hold or sell?Silver shot up by over Rs 8,000, marking a fresh high in recent trading. With momentum high but volatility looming, the big question is: is it time to invest or sell?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-life-cycle-funds-and-how-can-they-make-your-retirement-planning-easier-edelweiss-radhika-gupta-2875271-2026-02-27",
      "headline": "What are Life Cycle Funds and how can they make your retirement planning easier?Life cycle funds are designed to adjust their asset allocation automatically as an investor moves closer to a specific goal, usually retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-sensex-nifty-down-global-cues-uncertain-us-tariff-iran-nasdaq-selloff-nvidia-2875224-2026-02-27",
      "headline": "Sensex closes 961 points lower: Why stock market fell todayThe S&P BSE Sensex tanked 961.42 points to close at 81,287.19, while the NSE Nifty50 lost 317.90 points to end at 25,178.65.  Both indices lost over 1%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/jobs/story/block-4000-job-cuts-why-layoffs-are-no-longer-a-sign-of-crisis-jack-dorsey-ai-artificial-intelligence-2875191-2026-02-27",
      "headline": "Block's 4,000 job cuts: Why layoffs are no longer a sign of crisisBlock said it would cut more than 4,000 jobs, nearly half its workforce, reducing staff from over 10,000 to just under 6,000. This was not a company in distress. It was a company growing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bll-sensex-opens-277-points-lower-nifty-below-25400-infosys-it-stocks-up-2875187-2026-02-27",
      "headline": "Sensex opens 277 points lower, Nifty below 25,400; Infosys up 2%The S&P BSE Sensex was down by 389.29 points to 81,866.32, while the NSE Nifty50 lost 154.55 points to 25,342.00 as of 9:50 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-bank-rs-590-crore-fraud-opportunity-in-crisis-refund-rebuilding-trust-explained-2874230-2026-02-27",
      "headline": "Rs 583 crore returned, full-page ads out – is IDFC First Bank's trust push enough?IDFC First Bank's response offers a rare test of corporate accountability. But will a quick refund and bold messaging be enough to turn a damaging crisis into a chance to rebuild trust? We spoke to experts to understand what real recovery will demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/netflix-calls-warner-deal-not-attractive-clears-path-for-paramount-2875136-2026-02-27",
      "headline": "Netflix calls Warner deal not attractive, clears path for ParamountNetflix declined to raise its bid for Warner Bros. Discovery, clearing the way for Paramount's $31-per-share takeover offer that could reshape Hollywood and trigger major antitrust scrutiny.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/earning-rs-30-lakh-a-year-but-little-wealth-why-many-dual-income-no-kids-dink-couples-fall-behind-2874972-2026-02-26",
      "headline": "Earning Rs 30 lakh a year but little wealth? Why many DINK couples fall behindWith two salaries and no childcare costs, DINK couples are often seen as having a clear financial advantage. Yet many high-earning couples find their wealth growing slower than expected. Is lifestyle inflation quietly eroding their investment potential?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-sign-mous-to-link-upi-systems-boost-digital-payment-ties-2874935-2026-02-26",
      "headline": "India, Israel sign MoU to link UPI systems, boost digital payment tiesThe integration is expected to help Indian and Israeli businesses and individuals carry out financial transactions more easily. It could also reduce transaction costs and processing time, making payments faster and more convenient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/borge-brende-steps-down-as-president-and-ceo-of-world-economic-forum-after-epstein-revelations-2874873-2026-02-26",
      "headline": "World Economic Forum chief Borge Brende quits amid probe into Epstein tiesBorge Brende, President and CEO of the World Economic Forum, has stepped down amid scrutiny over his past interactions with Jeffrey Epstein. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-lower-us-iran-conflict-it-stocks-rise-2874819-2026-02-26",
      "headline": "Sensex and Nifty erase early gains to end flat over global uncertaintyThe S&P BSE Sensex lost 27.46 points to close at 82,248.61, while the NSE Nifty50 gained 14.05 points to end at 25,496.55."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-sonal-chauhan-appeals-to-pm-modi-after-being-stranded-in-dubai-2876036-2026-03-01",
      "headline": "Actor Sonal Chauhan appeals to PM Modi after being stranded in Dubai Indian citizens, including actor Sonal Chauhan and athlete PV Sindhu, are left stranded at Dubai airport following flight cancellations due to escalating tensions in the Middle East. Chauhan urged Prime Minister Narendra Modi for help. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/police-file-closure-report-in-vashu-bhagnani-fir-against-ali-abbas-zafar-others-2876033-2026-03-01",
      "headline": "Police file closure report in Vashu Bhagnani's FIR against Ali Abbas Zafar, others Mumbai police have filed a closure report in producer Vashu Bhagnani's FIR against director Ali Abbas Zafar, pertaining to their 2024 film, Bade Miyan Chote Miyan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-mithai-distribution-annadanam-2876019-2026-02-28",
      "headline": "Rashmika-Vijay's pan-India wedding celebration plan: Annadanam, sweet distribution Actors Rashmika Mandanna and Vijay Deverakonda are set to mark their wedding by distributing sweets across major Indian cities and organising Annadanam at temples. Amidst their personal celebration, they wish to thank their supporters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-new-tabaahi-song-poster-hints-at-yash-kiaras-quiet-romance-2876000-2026-02-28",
      "headline": "Toxic: New Tabaahi song poster hints at Yash-Kiara's quiet romance A fresh poster for the song Tabaahi, featuring Yash and Kiara Advani, has been unveiled. The song is set for release on March 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-2-screenings-halted-in-parts-of-kerala-amid-protests-2875984-2026-02-28",
      "headline": "Protests disrupt The Kerala Story 2 screenings in parts of Kerala The release of The Kerala Story 2 ran into fresh trouble in Kerala as protests over its depiction of forced religious conversions led to disrupted shows and cancellations across several districts. The film hit theatres on February 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/virosh-new-wedding-pics-rashmika-mandanna-arrives-in-doli-vija-deverakonda-wields-dagger-2875979-2026-02-28",
      "headline": "New viral pics: Rashmika's doli entry, Vijay's royal dagger steal spotlight Fresh pictures emerging from the wedding of actors Rashmika Mandanna and Vijay Deverakonda have gone viral on social media in no time. Check them out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-vignesh-raja-kara-release-date-out-check-here-2875967-2026-02-28",
      "headline": "Dhanush, Vignesh Raja's Kara release date out. Check here Director Vignesh Raja's Kara, featuring Dhanush and Mamitha Baiju, will arrive in cinemas in April. Producer Ishari K Ganesh made the announcement during an event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pm-narendra-modi-wrote-sweetest-letter-vijay-deverakonda-rashmika-mandanna-parents-2875952-2026-02-28",
      "headline": "PM Modi wrote sweetest, thoughtful letters to Rashmika-Vijay's parents Actors Vijay Deverakonda and Rashmika Mandanna looked back on their recent meetings with Prime Minister Narendra Modi and Home Minister Amit Shah, which took place just days before their private wedding ceremony in Udaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-kerala-story-2-movie-review-one-community-one-villain-one-agenda-2875921-2026-02-28",
      "headline": "The Kerala Story 2 review: One community, one villain, one agendaRelease Date:Fri Feb 27, 2026 The Kerala Story 2 expands the anxieties of its predecessor into something more fearsome and far more pointed. Is this a story about victims, or a narrative designed to shape how we see an entire community?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-post-becomes-indias-most-liked-photo-on-instagram-2875900-2026-02-28",
      "headline": "Rashmika-Vijay's wedding pics beat Virat Kohli's World Cup win post on Instagram Rashmika Mandanna and Vijay Deverakonda have made Instagram history as their wedding pictures became the most-liked post by an Indian account. It surpassed the 24 million likes garnered by Virat Kohli's 2024 T20 World Cup winning post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-to-sister-anubhuti-after-accused-release-2875886-2026-02-28",
      "headline": "Keep fighting slowly: Anurag Kashyap to sister Anubhuti after Accused release Anurag Kashyap wrote a heartfelt note for sister Anubhuti Kashyap after the release of her directorial, Accused, urging her to \"keep fighting slowly\" despite mixed reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-builds-buzz-as-makers-announce-trailer-release-date-see-here-2875860-2026-02-28",
      "headline": "Yash's Toxic builds buzz as makers announce trailer release date. See here The much-awaited trailer of Yash's upcoming film Toxic will be unveiled on March 8 in Bengaluru. Directed by National Award winner Geetu Mohandas, the stylish action drama will release on March 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-launches-youtube-channel-after-release-on-bail-seeks-fans-support-2875833-2026-02-28",
      "headline": "Rajpal Yadav launches YouTube channel after release on bail, seeks fans' support Rajpal Yadav has launched his official YouTube channel shortly after being released on interim bail in a cheque-bounce case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hello-bachchon-trailer-viineet-kumar-singh-leads-in-series-on-alakh-pandey-journey-2875824-2026-02-28",
      "headline": "Hello Bachchon trailer: Viineet Kumar toplines series on Alakh Pandey's journey The trailer for Hello Bachchon was unveiled on February 28, introducing a series inspired by educator Alakh Pandey. The Netflix show follows students from different backgrounds and premieres on March 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ranabaali-rashmika-mandanna-vijay-deverakonda-shine-in-song-endhayya-saami-2875799-2026-02-28",
      "headline": "Ranabaali: Rashmika Mandanna, Vijay Deverakonda shine in song Endhayya Saami The song Endhayya Saami from Ranabaali was unveiled as a special surprise by newly-wed couple Rashmika Mandanna and Vijay Deverakonda. The film, directed by Rahul Sankrityan, is set to release worldwide on September 11, 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-2-sees-low-opening-occupancy-kerala-some-screenings-cancelled-2875788-2026-02-28",
      "headline": "The Kerala Story 2 sees low opening occupancy Kerala, some screenings cancelled The Kerala Story 2: Goes Beyond opened to low occupancy in parts of Kerala, with some screenings reportedly cancelled due to lack of audience. Advance booking on the second day is limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-addresses-bafta-red-carpet-backlash-clarifies-gone-girl-moment-is-it-because-of-my-expression-2875754-2026-02-28",
      "headline": "Alia Bhatt addresses BAFTA red carpet backlash: Is it because of my expression? Alia Bhatt has addressed the online criticism over her BAFTA red carpet interview, and has clarified her reaction to a particular question that might have started it all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blanco-reacts-to-viral-dirty-feet-backlash-shows-off-clean-bare-foot-2875761-2026-02-28",
      "headline": "Benny Blanco reacts to viral dirty feet backlash, shows off clean bare foot Benny Blanco addressed the viral \"dirty feet\" controversy from his podcast during a recent interview. He clarified that the floors were to blame, not his hygiene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/indias-finest-stories-are-waiting-why-wont-bollywood-read-2875555-2026-02-28",
      "headline": "India's finest stories are waiting. Why won't Bollywood book new scripts? Why is Bollywood not adapting more from India's rich literary canon? This week's Cinematic Saturday explores the gap that continues to exist between books and cinema in Hindi, and how the film industry may be ignoring some of India's greatest tales."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/many-signs-iran-supreme-leader-is-no-more-says-israeli-pm-netanyahu-news-agency-reuters-2876040-2026-03-01",
      "headline": "Israel says Ayatollah Khamenei killed in strikes; Iran calls it mental warfareA statement from Israeli PM Benjamin Netanyahu about Iranian Supreme Leader Ayatollah Ali Khamenei's possible fate came hours after Israel and the US jointly struck targets in Iran early Saturday. The military action prompted Tehran to launch a retaliatory strike that has since plunged the Middle East into a rapidly escalating crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-israel-strikes-trump-on-iran-supreme-leader-ayatollah-ali-khamenei-death-speculations-2876047-2026-03-01",
      "headline": "We feel that's a correct story: Trump supports claims Iran's Khamenei is deadPresident Donald Trump said he believes reports that Iran's Supreme Leader Ayatollah Ali Khamenei is dead are correct, signalling confidence in Israeli claims and warning of further military options against Iran.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-attack-state-of-emergency-explosions-tehran-us-warnings-2875811-2026-02-28",
      "headline": "Live: UN chief says not in position to confirm Iran's Supreme Leader Ali Khamenei's deathUS-Israel's Iran Strikes Live Updates: The US and Israel launched strikes on Iran on Saturday, igniting military tensions in the Middle East, which has been on the brink of a conflict for several weeks. Israel said the US-led operation, called Epic Fury, had launched pre-emptive strikes. US President Donald Trump confirmed a \"major combat operation\" as explosions were heard in several parts of Iran. Tehran, which promised a \"crushing\" response to the US-led strikes, attacked US bases across the Middle East, including those in the UAE, Bahrain, Qatar and Jordan. Countries in the Middle East have shut their airspace while several countries have issued advisories to its citizens, asking them to take shelter and avoid unnecessary movement. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-sri-lanka-t20-world-cup-knocked-out-net-run-rate-super-8-2876016-2026-02-28",
      "headline": "NRR-error 404: Pak knocked out despite beating Sri Lanka, New Zealand in semisPAK vs SL, T20 World Cup Super 8: Sahibzada Farhan's record-breaking century was not enough to save Pakistan, as their narrow win over Sri Lanka left them short of the required run rate to leapfrog New Zealand into the semi-finals. Pakistan needed a victory margin of at least 65 runs, but managed only a five-run win despite posting 212 on the board on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dubai-landmark-palm-jumeirah-area-iran-shahed-drone-debris-strikes-viral-video-us-israel-middle-east-crisis-tension-2876004-2026-02-28",
      "headline": "Video: Huge explosion at Dubai's iconic Palm Jumeirah after Iranian strikeA viral video showed, in what appeared to be a drone, plummeting into the landmark Palm Jumeirah area in Dubai, as Iran continued to hit American bases across Gulf nations in retaliation for US – Israel's coordinated strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-stranded-dubai-airport-all-england-open-iran-strikes-2875999-2026-02-28",
      "headline": "PV Sindhu stranded at Dubai airport ahead of All England OpenStar Indian shuttler PV Sindhu is stranded at Dubai airport after US-Israel strikes on Iran suspended all flights, putting her All England Open campaign in doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-attack-us-israel-live-updates-trump-khamenei-what-we-know-2875818-2026-02-28",
      "headline": "US, Israel hit Iran, Tehran's retaliation plunges Mideast into crisis. What we know Live updatesMissiles criss-crossed the Middle East on Saturday as the US and Israel attacked Iran and struck its political leadership. Iran and its proxies retaliated by launching a barrage of drones and missiles towards Israel and US bases across the Middle East, plunging the region into a new conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/khameneis-son-in-law-daughter-in-law-killed-in-us-israel-strikes-says-tehran-council-member-report-2876024-2026-02-28",
      "headline": "Khamenei's son-in-law, daughter-in-law killed in strikes: Tehran Council memberKhamenei's son-in-law, daughter-in-law killed in US-Israel strikes, says Tehran council member: Report"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-israel-strike-iran-uss-gerald-r-is-shield-placed-close-israel-haifa-guarding-jerusalem-epic-fury-iron-dome-2875848-2026-02-28",
      "headline": "The USS Gerald R Ford is the shield. And it might boost Israel's Iron DomeAs Tehran's retaliation escalates with strikes on American bases in Bahrain, Kuwait, and the UAE following the US-Israeli strikes on Iran, the USS Gerald R Ford, is positioned near the Jewish nation. The USS Gerald R Ford, the world's largest aircraft carrier, is reportedly positioned as a defensive shield near Israel. Here's what that means."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-cancels-london-new-york-paris-flights-as-middle-east-tension-throws-air-travel-into-chaos-2876014-2026-02-28",
      "headline": "Air India cancels London, New York, Paris flights amid Middle East tensionsAir India cancelled flights to London, New York and Paris after Middle East airspace closures, triggered by a joint US–Israel operation against Iran, disrupted international routes crossing the conflict-affected region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chaos-at-abu-dhabi-airport-passengers-stranded-as-airspace-shut-after-iran-attack-2875995-2026-02-28",
      "headline": "Chaos at Abu Dhabi airport, passengers stranded as airspace shut after Iran attackIn response to multiple regional airspace closures, authorities in the UAE suspended flights, leaving thousands of travellers uncertain about when they will be able to leave."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-pledges-support-to-saudi-arabia-gulf-nations-amid-iran-escalation-2875983-2026-02-28",
      "headline": "Pakistan pledges support to Saudi Arabia, Gulf nations amid Iran escalationPakistan has pledged full solidarity with Saudi Arabia and Gulf nations amid escalating West Asia tensions following Israeli strikes on Iran. The statement comes against the backdrop of a Defence Agreement between Islamabad and Riyadh that treats any attack on one as an attack on both.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-releases-1st-official-video-of-hitting-targets-in-iran-as-part-of-operation-roaring-lion-2875919-2026-02-28",
      "headline": "Israel releases first official video of Iran strikes under Operation Roaring LionIsrael released its first official video of strikes in western Iran under Operation Roaring Lion, as coordinated US-Israeli attacks targeting Iran's leadership sharply escalated tensions across the Middle East.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-strikes-dubai-airspace-closed-flight-disruptions-uae-us-base-2876010-2026-02-28",
      "headline": "Dubai, a key global trade and aviation hub, targeted by Iran despite no US baseIran launched missile and drone strikes on Dubai, prompting the UAE to intercept the attacks and shut down its airspace, causing widespread flight disruptions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-iran-israel-strikes-attacks-middle-east-conflict-donald-trump-briefing-high-reward-risks-all-we-need-to-know-2875996-2026-02-28",
      "headline": "High-reward scenario but risk of...: What Trump was told on Iran strikes beforehandUS President Donald Trump was briefed in detail about the pros and cons of striking Iran beforehand. His team touted the prospect of a generational shift in the Mideast in inclination towards America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/march-india-weather-tomorrow-march-heat-wave-temperature-forecast-imd-india-meteorological-department-heat-wave-2875976-2026-02-28",
      "headline": "March to begin with unusual heat, temperatures to soar in Western IndiaIndia is set for an early summer as temperatures rise five degrees Celsius above normal. In Western and Southern India, the heat will be even more aggressive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/jobs/story/ai-is-killing-the-single-job-era-moonlighting-goes-mainstream-tech-jobs-ai-disruption-educ-2875574-2026-02-28",
      "headline": "AI is killing the single-job era: Moonlighting goes mainstreamSide hustles, reels, freelancing and podcasts: professionals are no longer relying on just one career stream. Why must you read this article? Because parallel careers are fast becoming the new workplace reality"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/india-today-quiz-news-current-affairs-upsc-entertainment-technology-movies-pop-culture-sports-576-28-02-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-ship-allowed-through-strait-of-hormuz-iran-guards-tell-vessels-eu-naval-mission-2875990-2026-02-28",
      "headline": "Iran Guards warn ships passage through Strait of Hormuz not allowed: EU officialCargo vessels in the Strait of Hormuz reported warnings from Iran's Revolutionary Guards claiming the waterway was closed, though Tehran did not officially confirm the same. The alerts followed US-Israeli strikes in Iran and Tehran's retaliatory attacks in the Middle East. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-tension-war-conflict-fighter-jet-crash-downed-taliban-forces-jalalabad-captured-alive-parachute-reports-2875887-2026-02-28",
      "headline": "Afghan Taliban officials claim Pak fighter jet downed, pilot captured aliveAfghanistan's Taliban military and police spokespersons told news agency AFP that the Pakistani fighter jet was downed by their forces in the eastern city of Jalalabad and the pilot was captured alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/indias-finest-stories-are-waiting-why-wont-bollywood-read-2875555-2026-02-28",
      "headline": "India's finest stories are waiting. Why won't Bollywood book new scripts?Why is Bollywood not adapting more from India's rich literary canon? This week's Cinematic Saturday explores the gap that continues to exist between books and cinema in Hindi, and how the film industry may be ignoring some of India's greatest tales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bahrain-indian-national-iran-missile-strikes-us-israel-attack-tehran-2875958-2026-02-28",
      "headline": "Siren and then 6-7 blasts: Indian recounts fear in Bahrain amid Iran strikesAs the US and Israel struck Iran, Tehran retaliated by targeting US military bases across the Middle East. In a video interaction with India Today, an Indian national shared firsthand details of the unfolding security situation in Bahrain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/abbas-araghchi-iran-ready-for-war-or-peace-geneva-nuclear-talks-us-military-buildup-glbs-2874328-2026-02-25",
      "headline": "Ready for both war and peace: What Iranian Minister said days ahead of US strikesIn an exclusive interview with India Today TV earlier this week, Iran's Foreign Minister Abbas Araghchi had warned that any confrontation could quickly spill beyond Iran and the United States, turning into a \"devastating\" regional war in the Middle East. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-lobby-behind-trumps-anti-tehran-stance-iran-foreign-minister-abbas-araghchi-1979-islamic-revolution-2874355-2026-02-25",
      "headline": "Israeli lobby behind Trump's anti-Tehran stance? What Iran Foreign Minister saidIran's Foreign Minister Abbas Araghchi said in an exclusive interview with India Today that decades of US hostility stem from the 1979 Islamic Revolution and alleged misinformation driven by Israeli lobbies."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-ind-vs-wi-darren-sammy-calls-west-indies-down-india-eden-gardens-kolkata-2876031-2026-03-01",
      "headline": "Darren 'David' Sammy calls upon West Indies to down 'Goliath' India at Eden Gardens IND vs WI, T20 World Cup 2026: West Indies play India in a battle of David vs Goliath on Sunday, March 1. Ahead of the virtual quarter-final, Sammy spoke openly about how he has tried to inspire his side with the stories of 2016."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistans-sahibzada-farhan-unhappy-after-century-t20-world-cup-heartbreak-2876021-2026-02-28",
      "headline": "Record hundred, but no joy: Sahibzada Farhan on T20 World Cup heartbreak Sahibzada Farhan scored a record-breaking hundred against Sri Lanka in the T20 World Cup 2026. Despite his efforts, Pakistan were eliminated from the tournament after failing to improve their net run rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-sri-lanka-t20-world-cup-knocked-out-net-run-rate-super-8-2876016-2026-02-28",
      "headline": "NRR-error 404: Pak knocked out despite beating Sri Lanka, New Zealand in semis PAK vs SL, T20 World Cup Super 8: Sahibzada Farhan's record-breaking century was not enough to save Pakistan, as their narrow win over Sri Lanka left them short of the required run rate to leapfrog New Zealand into the semi-finals. Pakistan needed a victory margin of at least 65 runs, but managed only a five-run win despite posting 212 on the board on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-ms-dhoni-chennai-t-shirt-message-ruturaj-gaikwad-2876002-2026-02-28",
      "headline": "MS Dhoni arrives in Chennai, no morse code message on T-shirt this time: Video IPL 2026: MS Dhoni arrived in Chennai on Saturday to join Chennai Super Kings' pre-season camp. Unlike last year, there was no message on the former captain's T-shirt upon his arrival. Captain Ruturaj Gaikwad also landed in the city later in the evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-stranded-dubai-airport-all-england-open-iran-strikes-2875999-2026-02-28",
      "headline": "PV Sindhu stranded at Dubai airport ahead of All England Open Star Indian shuttler PV Sindhu is stranded at Dubai airport after US-Israel strikes on Iran suspended all flights, putting her All England Open campaign in doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usa-israel-attacks-iran-bangladesh-mushfiqur-rahim-stuck-jeddah-2875998-2026-02-28",
      "headline": "Ongoing US-Israel attacks on Iran leaves Mushfiqur Rahim stuck in Jeddah Bangladesh's Mushfiqur Rahim is stranded in Jeddah after US-Israel strikes on Iran shut down Middle East airspace, grounding thousands of flights worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-and-kashmir-abdul-samad-redemption-story-2875994-2026-02-28",
      "headline": "When J&K's Abdul Samad found redemption against familiar foes Karnataka Haunted by a painful quarter-final exit at 18, Abdul Samad returned wiser and resolute, playing a pivotal role in Jammu and Kashmir's maiden Ranji Trophy triumph and personal redemption against Karnataka. He finished the season with 748 runs in 10 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pak-vs-sl-sahibzada-farhan-virat-kohli-record-2875978-2026-02-28",
      "headline": "Pakistan's Sahibzada Farhan breaks Virat Kohli's all-time T20 World Cup record T20 World Cup 2026: Pakistan opener Sahibzada Farhan broke Virat Kohli's all-time record for most runs in a single edition of the T20 World Cup. The right-hander brought up his fourth fifty, leading Pakistan's push for a big total against Sri Lanka in their Super 8 match in Pallekele on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-contingency-plans-t20-world-cup-middle-east-conflict-travel-disruption-2875973-2026-02-28",
      "headline": "ICC working on alternate flight plans after US-Israel's Iran strikes The ICC has activated contingency plans to protect all involved in the T20 World Cup 2026 after Middle East conflict disrupted key Gulf travel routes. This move ensures the tournament proceeds smoothly while prioritising safety amid geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mccullum-sehwag-message-rehan-ahmed-eng-vs-nz-2875954-2026-02-28",
      "headline": "Bat like Sehwag: McCullum's message to Rehan Ahmed during NZ vs ENG Rehan Ahmed revealed that Brendan McCullum told him via his walkie-talkie to bat like Virender Sehwag during the Super 8 clash against New Zealand. Rehan's cameo helped England secure the win against the Blackcaps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ryan-ten-doeschate-on-tilak-varma-batting-position-india-vs-west-indies-t20-world-cup-2875965-2026-02-28",
      "headline": "Will Tilak Varma continue to bat at No 6 vs West Indies? Ryan Ten Doeschate answersIndia's assistant coach Ryan ten Doeschate updates on Tilak Varma's batting role ahead of crucial West Indies clash. India need a win to progress in the T20 World Cup amid fierce competition and past challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-ryan-ten-doeschate-pressure-kolkata-virat-rohit-2875964-2026-02-28",
      "headline": "First high-pressure clash without Virat and Rohit. Is new-look India ready?T20 World Cup 2026, IND vs WI: Speaking to the press on the eve of their must-win Super 8 match against the West Indies, assistant coach Ryan ten Doeschate said the Indian players are looking to embrace the pressure of the big contest rather than trying to brush it under the carpet. India will play a high-pressure match in an ICC event for the first time since Rohit Sharma and Virat Kohli retired from T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-vs-sri-lanka-babar-azam-dropped-pallekele-2875963-2026-02-28",
      "headline": "T20 World Cup: Pakistan drop Babar Azam for must-win clash vs Sri LankaT20 World Cup: With a spot in the semi-final on the line, Pakistan have decided to drop Babar Azam for the clash against Sri Lanka in Pallekele on Saturday, February 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-jammu-and-kashmir-ranji-trophy-maiden-title-reaction-2875910-2026-02-28",
      "headline": "From enablers to champions: Tendulkar leads tributes to J&K after Ranji Trophy winSachin Tendulkar led the way with praises as Jammu and Kashmir won their maiden Ranji Trophy title on Saturday, February 28. J&K secured their title win after drawing the final after securing a first innings lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sl-t20-world-cup-2026-super-8s-pakistan-pallekele-semifinal-qualification-babar-azam-2875888-2026-02-28",
      "headline": "PAK vs SL Highlights: Pakistan register 5-run victory but get knocked outPAK vs SL Highlights, T20 World Cup Super 8s: Pakistan have registered a thrilling five-run victory against Sri Lanka, despite Dasun Shanaka's herculean effort in the final over. However, Pakistan have been knocked out of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-and-kashmir-omar-abdullah-prize-money-government-jobs-2875879-2026-02-28",
      "headline": "Ranji Trophy: J&K CM announces Rs 2 crore reward, government jobs for winnersChief Minister Omar Abdullah has announced a Rs 2 crore cash reward and government job guarantees for the Jammu & Kashmir squad after they secured a historic maiden Ranji Trophy title. Abduallah was in Hubli to celebrate the team's success after they outclassed Karnataka in the final on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-president-mithun-manhas-hoisted-by-players-jammu-kashmir-ranji-trophy-win-2875874-2026-02-28",
      "headline": "Why BCCI president Manhas was hoisted by players after J&K's Ranji Trophy winJammu & Kashmir secured their first-ever Ranji Trophy title with a historic win over Karnataka. Mithun Manhas' vision and introduction of red-soil wickets played a crucial role in this transformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/auqib-nabi-ranji-trophy-jammu-kashmir-historic-win-2875857-2026-02-28",
      "headline": "Ranji Trophy final: Auqib Nabi turns title dream into history for Jammu and KashmirAuqib Nabi started his cricketing journey with the dream of winning the Ranji Trophy one day. On Saturday, February 28, Nabi became the big game player that propelled J&K to their first-ever title with an impressive five-wicket haul. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-return-india-karun-chandhok-buddh-circuit-2875838-2026-02-28",
      "headline": "The lights went out too soon: Can India finally get Formula 1 right?India had Formula 1 for three years, then lost it to taxes, red tape, and short-termism. More than a decade on, the fight to bring it back is finally getting serious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-beat-karnataka-maiden-title-auqib-nabi-qamran-iqbal-2875839-2026-02-28",
      "headline": "Jammu and Kashmir dominate Karnataka to end 67-year wait for maiden Ranji titleJammu and Kashmir finally broke their 67-year wait to lift a maiden Ranji Trophy title. A commanding first-innings lead and complete control over five days ensured Karnataka were left with no path back in the 2026 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-pakistan-semi-final-qualification-scenario-mohammad-amir-2875823-2026-02-28",
      "headline": "Doesn't matter if Pakistan qualify to semis, India will not: Amir's big statementPakistan pacer Mohammad Amir has made the bold claim that India will not make it to the semi-finals of the T20 World Cup 2026. India and Pakistan retain a chance of making it to the final four. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/craig-fulton-india-hockey-rebuild-fih-pro-league-analysis-hardik-singh-2875820-2026-02-28",
      "headline": "Indian hockey in trouble: Can Craig Fulton's lost team make its way back?After a collapse in the FIH Pro League, India coach Craig Fulton's biggest test yet comes in the form of a resurrection of the team. With the World Cup and Asian Games on the horizon, the Indian coach needs to quickly get his side to forget the slump in Rourkela and Hobart and get ready for bigger challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-pakistan-t20-world-cup-preview-super-8-semi-final-chance-net-run-rate-2875819-2026-02-28",
      "headline": "Pakistan's last roll of the dice as Sri Lanka stand between them and semisT20 World Cup: Sri Lanka stand between Pakistan and a miracle semi-final push. One commanding win keeps the dream alive, while anything less could end Pakistan's campaign despite England handing them a late lifeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kabaddi-upkl-replicating-domestic-t20-cricket-model-kabaddi-talent-pathway-2875796-2026-02-28",
      "headline": "UP Kabaddi League takes cricket route to produce next-gen India starsA cricket-style revolution is underway in Kabaddi as the UP Kabbadi League sets itself up to be the breeding ground to be the platform for the rise of new talent. With competition and fan following on the rise, the league promises to produce India's next big names in Kabaddi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-pitch-invader-tackled-fans-inter-miami-puerto-rico-friendly-2875789-2026-02-28",
      "headline": "Messi tackled by pitch invaders in Inter Miami's chaotic Puerto Rico friendlyA pitch invasion turned messy as Lionel Messi was knocked over during Inter Miami's Puerto Rico friendly. The Argentine star quickly got back up, shrugged it off, and still guided Miami to a 2-1 win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/delhi-high-court-orders-fresh-elections-equestrian-federation-india-2875781-2026-02-28",
      "headline": "Delhi HC orders fresh EFI polls, IOA to form Ad-Hoc PanelThe Delhi High Court has called for a revamp of the Equestrian Federation of India, calling for fresh elections. It has also asked the Indian Olympic Association to form an ad-hoc panel to oversee the functions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-wait-over-parvez-rasool-vs-kartnataka-hubli-2875756-2026-02-28",
      "headline": "Jammu and Kashmir's wait is finally over: Parvez Rasool ahead of Ranji Trophy gloryJammu and Kashmir have moved within one day of winning their maiden Ranji Trophy title, and Parvez Rasool hailed the moment as a dream turned reality for the side. A dominant performance has put them on the brink of scripting history in Indian domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-eng-vs-nz-will-jacks-not-obsessed-perfection-press-conference-2875755-2026-02-28",
      "headline": "England not obsessed with perfection in T20 World Cup: Will Jacks after NZ heroicsT20 World Cup: England all-rounder Will Jacks emphasised that the side is more focused on winning than any fixation of being perfect in their campaign as they head into the semi-finals. While England's margin of victories have been tight, the side is more focused on the positives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-eng-vs-nz-mitchell-santner-nervous-pakistan-vs-sri-lanka-semi-final-hopes-2875742-2026-02-28",
      "headline": "Nervous New Zealand will have eyes on PAK vs SL: Mitchell Santner on semi-final hopesT20 World Cup: New Zealand's semi-final hopes now hinge on Pakistan's final Super 8 result against Sri Lanka. After missing their own chance against England, the Kiwis can only wait nervously as qualification slipped out of their control."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}