{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ministry-of-corporate-affairs-probes-gensol-over-loan-fraud-filings-accounts-under-scanner-sources-2711754-2025-04-20",
      "headline": "Gensol faces government inquiry after Rs 975 crore EV loan misuse: SourcesAccording to sources, the MCA's move is an independent action aimed at investigating potential corporate governance lapses and financial irregularities. There is no fixed timeline for the inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-from-april-23-tariffs-and-customs-negotiations-on-agenda-2711580-2025-04-19",
      "headline": "India-US trade talks from April 23, tariffs, customs negotiations on agenda: ReportThe Indian official team is visiting the US to give further impetus to the negotiations in the 90-day tariff pause window and discuss these terms of reference to iron out differences on certain issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-friday-2025-stock-market-holiday-sensex-nifty-closed-no-trading-today-april-18-nse-bse-2710808-2025-04-18",
      "headline": "Good Friday 2025: Are Sensex and Nifty closed for trading today?This week has been a short one for stock market participants. The markets opened only for three days, from April 15 to April 17. They were shut on Monday, April 14, in observance of Dr. Baba Saheb Ambedkar Jayanti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opting-for-new-tax-regime-check-out-these-5-benefits-2710601-2025-04-17",
      "headline": "Opting for new tax regime? Check out these 5 benefitsThe revisions introduced under the new tax regime aim to make the new regime easier, cut down on paperwork, and minimise the confusion many individuals experience in filing their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-net-profit-revenue-final-dividend-rs-22-all-key-details-2710503-2025-04-17",
      "headline": "Infosys Q4 results: Profit drops 12%, final dividend set at Rs 22The IT major clocked revenue of Rs 40,925 crore for the March quarter, up 8% from Rs 37,923 crore a year ago. In constant currency terms, revenue grew 4.8% YoY but declined 3.5% sequentially."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-missing-disappeared-2025-no-public-listing-last-2-months-stock-market-investor-sentiment-2710498-2025-04-17",
      "headline": "No public listing in 2 months: Where have IPOs disappeared?Just nine companies have listed on the mainboard till April this year, compared to 25 in the same period last year, and most didn't even leave a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunscreen-faceoff-honasa-vs-hul-in-court-over-ad-claims-2710432-2025-04-17",
      "headline": "Sunscreen faceoff: Honasa vs HUL in court over ad claimsThe core of the argument is SPF, the sun protection factor which measures how well a sunscreen protects against harmful UV rays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vijay-kedia-10-red-flags-spot-potential-scam-companies-gensol-fraud-blusmart-shuts-down-2710438-2025-04-17",
      "headline": "Vijay Kedia warns of 10 red flags to spot a potential scam amid Gensol fraudInvestor and market expert Vijay Kedia has warned that Gensol is not the only company with problems amid the findings by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-techie-compares-life-with-rs-25-lakh-in-india-vs-100k-dollars-in-us-2710353-2025-04-17",
      "headline": "Rs 25 lakh in India or $100K in US? Bengaluru techie weighs in on what's betterChoosing to stay in India means staying close to family, celebrating festivals, and living within a culture you know well, said the tech professional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phonepe-rolls-out-upi-circle-simplifies-payments-for-family-and-friends-2710392-2025-04-17",
      "headline": "PhonePe rolls out UPI Circle, simplifies payments for family and friendsUPI Circle is a feature by NPCI (National Payments Corporation of India) where a primary user gives permission to a secondary user to make payments from their UPI account, within set limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-tuhin-kanta-pandey-gensol-fraud-job-is-to-find-and-punish-them-2710390-2025-04-17",
      "headline": "Sebi's job is to find and punish them: Tuhin Kanta Pandey on Gensol fraudThe Securities and Exchange Board of India (Sebi) released an interim order on April 15, stating that Gensol Engineering's promoters, brothers Anmol and Puneet Singh Jaggi, had diverted company funds for personal use. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-700-points-nifty-gains-4-things-to-know-2710369-2025-04-17",
      "headline": "Surprise rally lights up Dalal Street, Sensex jumps 1,500 points. Here's whyShare market today: Despite a slight uptick in volatility, sentiment turned decisively positive as fears around global trade tensions began to fade. Broader market indices joined the rally, reflecting widespread optimism among investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-shuts-operations-sebi-expose-gensol-fraud-anmol-puneet-singh-jaggi-2710342-2025-04-17",
      "headline": "End of the road for BluSmart as Sebi exposes Gensol fraudMany users across Delhi-NCR, Bengaluru, and Mumbai reported that they could no longer book rides through the BluSmart app. The company also sent a notification to users stating that bookings were being temporarily closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-expectations-fy26-outlook-dividend-net-profit-revenue-2710323-2025-04-17",
      "headline": "Infosys Q4 results today: All eyes on FY26 outlook, dividend detailsInfosys Q4FY25 results: As the second-largest software services exporter gears up to release its earnings, investors will be watching closely for guidance on FY26 revenue growth, margins, and management's take on business sentiment in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-shares-hit-5-percent-lower-circuit-for-2nd-straight-day-2710312-2025-04-17",
      "headline": "Gensol Engineering shares hit 5% lower circuit for 2nd straight dayGensol Engineering share price: The stock plunged 5% to Rs 117.50 on the Bombay Stock Exchange (BSE), hitting yet another all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-market-value-stock-crash-148-billion-dollars-gone-trump-china-curbs-explained-2710298-2025-04-17",
      "headline": "Explained: Why Nvidia's market value dropped $148 billion overnightNvidia shares were hit hard in the overnight trading session on Wall Street, falling nearly 7% and losing $148 billion in market value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-falls-5-percent-q4-results-weak-revenue-guidance-fy26-2710277-2025-04-17",
      "headline": "Wipro shares tank 6% in early trade despite strong Q4 earnings. Buy or sell?Wipro share price: At 9:20 am, Wipro shares were trading 5.33% lower at Rs 234.30 on the Bombay Stock Exchange. The decline came after the company reported its earnings post-market hours on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-180-points-lower-nifty-below-23400-wipro-down-5-percent-2710274-2025-04-17",
      "headline": "Sensex loses over 300 points in early trade, Nifty below 23,400; Wipro down 5%The S&P BSE Sensex was down by 344.50 points to 76,700.24, while the NSE Nifty50 lost 119.70 points to 23,317.50 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rio-tinto-partners-with-indian-firm-to-explore-low-carbon-aluminium-project-2710270-2025-04-17",
      "headline": "Rio Tinto partners with Indian firm to explore low-carbon aluminium projectThe potential development could see up to 1 million tonnes per annum (mtpa) of primary aluminium smelting and 2 mtpa of alumina production, both energized by renewable wind and solar power, supported by pumped hydro storage, the global miner said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-today-april-17-sensex-nifty-to-open-lower-why-it-stocks-q4-results-2710261-2025-04-17",
      "headline": "Stock market opening today: Sensex, Nifty likely to open lower. Here's whyDespite the weak outlook for Thursday's session, Sensex and Nifty have seen a strong upward trend in the last few days. In the past three sessions, Nifty50 has gone up by 4.6% while Sensex has gained 4.3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-april-17-wipro-gensol-tata-steel-bel-paytm-hero-motocorp-nse-bse-trading-2710251-2025-04-17",
      "headline": "Stocks to watch on April 17: Wipro, Gensol, Tata Steel, BEL, Paytm, Hero MotoCorpSeveral companies will announce their results for Q4 FY25 on Thursday. These include Infosys, HDFC Life Insurance Company, Jio Financial Services, HDFC Asset Management Company, Tata Elxsi, National Standard (India), and E2E Networks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-get-land-99-paise-andhra-pradesh-visakhapatnam-nara-lokesh-it-hub-growth-promotion-2710238-2025-04-17",
      "headline": "21 acres for just 99 paise: Big land allotment to TCS as Andhra bets big on techThe cabinet of Andhra Pradesh cleared the proposal on Tuesday, stating that the project is expected to bring in an investment of around Rs 1,370 crore and create nearly 12,000 jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-or-new-tax-regime-here-how-to-pick-the-right-one-before-filing-itr-2710023-2025-04-16",
      "headline": "Old or New Tax Regime: Here's how to pick the right one before filing ITRUnder the old tax regime, taxpayers can claim various deductions and exemptions, while the new tax regime does not offer much deductions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-how-is-tax-refund-calculated-and-when-will-you-get-it-2709945-2025-04-16",
      "headline": "ITR filing: How is tax refund calculated, and when will you get it?When you file your return, you declare your income, claim deductions, and report taxes already paid. The tax system compares your actual tax due with what you've already paid. If you've paid more, the extra amount is returned to you as a refund."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/simran-criticises-co-actor-for-insensitive-remark-on-doing-aunty-roles-2711849-2025-04-20",
      "headline": "Simran criticises co-actor for insensitive remark on doing 'aunty roles'Tamil actor Simran publicly called out a fellow actor for making an insensitive remark about 'aunty roles'. Expressing her shock, Simran stated that she'd rather portray such roles with dignity than take on a meaningless or 'dabba' role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-posts-video-of-rescuing-abandoned-girl-behind-house-2711802-2025-04-20",
      "headline": "Disha Patani's sister Khushboo posts video of rescuing abandoned girl behind houseActor Disha Patani's sister, Khushboo Patani, a former army officer, shared a video in which she was seen rescuing a girl child lying in the dirt behind her house. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-exposes-south-industry-navel-obsession-shares-her-experience-2711796-2025-04-20",
      "headline": "Malavika Mohanan exposes South industry's 'navel obsession', shares her experienceActor Malavika Mohanan recalled being body-shamed in both the South Indian and the Hindi film industry. She also talked about the South Indian industry's 'naval' obsession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-too-profound-for-words-moment-a-signed-jersey-by-lionel-messi-watch-viral-video-2711792-2025-04-20",
      "headline": "In Mohanlal's 'too profound for words' moment, a signed jersey by Lionel MessiMalayalam superstar Mohanlal couldn't contain his joy when his friends brought him one of the biggest gifts of his life - a signed jersey by football legend Lionel Messi. Here's what he had to say about that 'unforgettable moment'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-brother-defends-him-in-drugs-case-with-sarcasm-2711752-2025-04-20",
      "headline": "Malayalam actor Shine Tom Chacko's brother defends him in drugs case with sarcasmMalayalam actor Shine Tom Chacko was arrested and later released on bail in a drug-related case. His brother, Joe John Chako, now spoke to the media, and defended the actor by asking if none of them had ever visited a de-addiction centre before. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-10-detailed-report-sunny-deol-film-faces-kesari-2-with-grace-and-strength-2711745-2025-04-20",
      "headline": "Jaat box office Day 10: Sunny Deol's film faces Kesari 2 with grace and strengthSunny Deol's 'Jaat' has slowed down at the box office with the release of Akshay Kumar's 'Kesari Chapter 2' this weekend. A slight dip was expected, but it will be interesting to see how far the film can go now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-muntashir-calls-anurag-kashyap-sick-you-cant-pollute-brahmin-legacy-watch-viral-video-2711734-2025-04-20",
      "headline": "Manoj Muntashir calls Anurag Kashyap 'sick': You can't pollute Brahmin legacyLyricist Manoj Muntashir shared a video on social media, slamming Anurag Kashyap for his alleged casteist remark against Brahmins. He also issued an open challenge to him in the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-thanks-fans-for-jaat-enjoys-nature-walk-before-border-2-shoot-2711732-2025-04-20",
      "headline": "Sunny Deol enjoys nature walk before Border 2 shoot, thanks fans for JaatAmid the massive success of his film 'Jaat', Sunny Deol is unwinding in the valleys. Sharing a serene video on Sunday, the actor thanked fans for their overwhelming love and promised that the sequel would be even more entertaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bombai-ka-babu-incest-identity-inner-conflict-in-dev-anand-suchitras-bold-film-2711699-2025-04-20",
      "headline": "Bombai Ka Babu: Incest, identity, inner conflict in Dev Anand-Suchitra's bold filmIn 'Retro Review' this weekend, we explore 'Bombai Ka Babu', a film starring Dev Anand and Suchitra Sen. It is a hauntingly beautiful setup with the themes of incest and identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-joins-chris-martin-in-surprise-jig-his-1st-after-military-discharge-watch-viral-videos-2711692-2025-04-20",
      "headline": "BTS Jin joins Chris Martin in surprise jig, his 1st after military discharge. VideosBTS Jin surprised his fans when he joined Coldlay's Chris Martin at a concert in Seoul on Saturday. The two performed 'The Astronaut' and 'My Universe' for the crowd, and their videos are now going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-2-detailed-report-akshay-kumar-film-poised-for-a-fantastic-rs-30-crore-weekend-2711669-2025-04-20",
      "headline": "Kesari 2 box office Day 2: Akshay's film poised for a fantastic Rs 30 crore weekendAkshay Kumar's 'Kesari Chapter 2' saw fabulous growth in its collection on the second day, which raised the expectations for its overall run. The film has largely received positive reviews on social media, which will help boost its collection further. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-says-films-cant-be-blamed-for-drug-abuse-amid-shine-tom-chacko-row-2711548-2025-04-19",
      "headline": "Unni Mukundan says films can't be blamed for drug abuse amid Shine Tom Chacko rowAmid the arrest of Malayalam actor Shine Tom Chacko in a drugs case, fellow actor Unni Mukundan has come forward to defend the film industry. He argued that cinema alone should not be blamed for such incidents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/resident-playbook-review-a-spin-off-that-honours-the-legacy-of-hospital-playlist-2711544-2025-04-19",
      "headline": "Resident Playbook review: A spin-off that honours the legacy of Hospital PlaylistReleased-Sat Apr 12, 2025'Resident Playbook' offers a gritty take on the medical drama genre, focusing on the challenges faced by young residents. With emotional depth and realistic portrayals, it stands as a compelling addition to the 'Hospital Playlist' universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-x-twitter-account-gets-hacked-alerts-fans-about-suspicious-activity-2711515-2025-04-19",
      "headline": "Khushboo Sundar alerts fans about suspicious activity after X account gets hackedActor and politician Khushboo Sundar's X account has been hacked. She shared an Instagram post to alert fans about any suspicious activity on her account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-nicola-coughlan-slams-jk-rowling-for-celebratory-post-over-trans-ruling-harry-potter-series-2711510-2025-04-19",
      "headline": "Bridgerton's Nicola Coughlan slams JK Rowling for celebratory post over trans rulingActor Nicola Coughlan on Friday shared a note in her Instagram stories, asking 'Harry Potter' writer JK Rowling to keep her 'Harry Potter lads', after the latter made a celebratory post following the Supreme Court's trans-woman ruling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-visits-tirupati-temple-with-director-raj-nidimoru-2711481-2025-04-19",
      "headline": "Samantha visits Tirupati temple with director Raj NidimoruSamantha visited the Tirupati Balaji Temple along with filmmaker Raj Nidimoru on Saturday. Videos from their divine visit have surfaced on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-mahesh-babu-latest-update-from-ss-rajamouli-ssmb29-has-boat-connection-2711477-2025-04-19",
      "headline": "Priyanka Chopra-Mahesh Babu's latest update from SSMB29 has 'boat' connectionPriyanka Chopra Jonas, Mahesh Babu and Prithviraj Sukumaran are all set to begin the next shoot schedule for SS Rajamouli's next mythology-based film. Here's the latest update from their shoot schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-recalls-being-judged-for-marrying-twice-as-brahmin-devotee-of-lord-ram-2711460-2025-04-19",
      "headline": "Kamal Haasan recalls being judged for marrying twice as Brahmin devotee of Lord RamDuring the promotions of Mani Ratnam's film 'Thug Life', actors Kamal Haasan, Trisha Krishnan, and Simbu shared their personal views on marriage. Kamal Haasan reflected on his past relationships and his stance on the institution of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/phule-director-defends-film-amid-row-caste-discrimination-plagues-our-society-2711470-2025-04-19",
      "headline": "Caste discrimination plagues our society: Phule director defends film amid rowDirector Ananth Mahadevan spoke about objections raised against the portrayal of caste-discrimination in his film, 'Phule'. The filmmaker said India's fight against discrimination is far from over. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-political-alliance-maharashtra-raj-uddhav-thackeray-talks-only-emotional-sanjay-raut-2711743-2025-04-20",
      "headline": "No alliance yet, only emotional talk: Sanjay Raut on Thackerays' patch-up buzzWhile talking about the reunion, Sanjay Raut did not completely shoot down the possibility of Raj Thackeray and Uddhav Thackeray joining hands on the political pitch and placed the onus on the two cousins for future alliance talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-dgp-former-found-dead-bengaluru-house-murder-wife-detained-cops-2711852-2025-04-20",
      "headline": "Former Karnataka top cop found dead in Bengaluru home, wife detainedFormer Karnataka DGP Om Prakash was found dead under mysterious circumstances at his residence in Bengaluru. Police have detained his wife in connection with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hindu-minister-kheal-das-kohistani-attacked-protest-sindh-pakistan-pm-shehbaz-sharif-probe-2711803-2025-04-20",
      "headline": "Hindu minister attacked during protest in Pakistan, Shehbaz Sharif assures probeKheal Das Kohistani, a Pakistani Hindu minister, was attacked in Sindh by protesters opposing the government's irrigation canal projects in the province. Prime Minister Shehbaz Sharif condemned the attack and assured of a thorough probe into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-president-mallikarjun-kharge-bjp-jdu-opportunistic-nitish-kumar-bihar-elections-2711811-2025-04-20",
      "headline": "Nitish Kumar changes party for kursi: Congress targets BJP-JDU allianceAddressing a Congress rally in Buxur, the party president urged voters to oust BJP and JD(U) from power and elect the Mahagathbandhan in the elections scheduled later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-got-protein-fetish-protein-fortified-coffee-pasta-bread-milk-yogurt-calorie-activity-level-what-to-do-2711538-2025-04-20",
      "headline": "India's protein paradox: A marketing flood amid deficit dietThe current list of protein-fortified foods being marketed in India is long. Protein jumbo yogurt, protein mueseli, protein coffee, protein cereals, protein pasta and protein water are just a few. Given that Indian diet is protein-deficient, is such consumption of protein-fortified foods good for health? This is what experts say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-nishikant-dubey-supreme-court-lawyer-seeks-contempt-proceedings-2711842-2025-04-20",
      "headline": "Lawyer seeks contempt action against BJP MP for remarks against Supreme CourtAdvocate Anas Tanveer has written to Attorney General R Venkatramani seeking consent to initiate contempt proceedings against BJP MP Nishikant Dubey for his remarks against the Chief Justice of India and Supreme Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ministry-of-corporate-affairs-probes-gensol-over-loan-fraud-filings-accounts-under-scanner-sources-2711754-2025-04-20",
      "headline": "Gensol faces government inquiry after Rs 975 crore EV loan misuse: SourcesAccording to sources, the MCA's move is an independent action aimed at investigating potential corporate governance lapses and financial irregularities. There is no fixed timeline for the inquiry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-flash-floods-3-dead-dozens-rescued-as-flash-floods-ravage-ramban-2711725-2025-04-20",
      "headline": "3 dead, hundreds rescued in J&K flash floods and landslides; major roads cut offTen houses were completely destroyed, while 25 to 30 others suffered partial damage. Despite the destruction, a swift response by the Dharamkund police and district administration ensured the safe evacuation of nearly 90 to 100 people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bengaluru-shifts-gears-but-can-it-get-out-of-the-traffic-jam-2711816-2025-04-20",
      "headline": "Bengaluru shifts gears, but can it get out of the traffic jam?The city's image of perennial traffic turmoil needs a desperate overhaul, but whether the Rs 73,600 crore mobility infrastructure plan is the answer is debatable\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-today-pbks-vs-rcb-mullanpur-updates-2711776-2025-04-20",
      "headline": "PBKS vs RCB Highlights: RCB win 5th away match after Kohli, Padikkal fiftiesIPL 2025, Punjab Kings vs Royal Challengers Bengaluru Highlights: RCB beat PBKS by seven wickets and won their fifth away match out of five. Virat Kohli's unbeaten 73 and Devdutt Padikkal's 61 helped them chase down 158 with seven balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-chhatarpur-doctor-drags-slaps-77-year-old-elderly-patient-video-2711795-2025-04-20",
      "headline": "Madhya Pradesh doctor slaps, drags elderly man for demanding quicker treatmentA video, which went viral on social media, shows a doctor and a Red Cross worker dragging and slapping a 77-year-old man at the district hospital in Madhya Pradesh's Chhatarpur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/banned-meitei-outfit-wanted-militant-manipur-arrested-hotel-raid-guwahati-2711844-2025-04-20",
      "headline": "Wanted militant of banned Meitei outfit arrested in Guwahati hotel raidA wanted member of the People's Liberation Army (PLA), a banned Meitei militant outfit, was arrested in a hotel raid operation led by the Guwahati Police. The accused was sent to police custody and was being questioned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/paneer-iodine-test-viral-social-media-food-scientists-2711674-2025-04-20",
      "headline": "The problem with 'iodine' paneer policingIodine paneer tests are going viral on social media, but they may not be revealing the real truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-comments-glenn-maxwell-holiday-2711846-2025-04-20",
      "headline": "Maxwell, Livingstone come to India to spend holiday, not win IPL: SehwagVirender Sehwag has hit out against IPL's overseas stars Glenn Maxwell and Liam Livingstone. Sehwag has claimed that overseas players come to holiday in India and do not care about winning trophies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-azharuddin-legal-action-order-hyderabad-stadium-2711818-2025-04-20",
      "headline": "Azharuddin to take legal action against order to remove name from Hyderabad venueMohammad Azharuddin said that he will take legal action over the order to remove his name from the North Stand at the Rajiv Gandhi International Cricket Stadium in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-man-suicide-wife-torture-2711757-2025-04-20",
      "headline": "Immerse my ashes in drain: UP techie hangs himself, accuses wife in videoA field engineer in Noida died by suicide after alleging mental harassment by his wife and in-laws. In a video, he alleged threats of false dowry cases and pressure to transfer property to his wife and her family.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/gujarat-tamil-nadu-launch-space-tech-policy-how-will-it-help-the-sector-2711824-2025-04-20",
      "headline": "Gujarat, Tamil Nadu launch space tech policy; how will it help the sector?The policies are focused on manufacturing and large-scale employment in the space sector: some 10,000 jobs in Tamil Nadu and another 25,000 in Gujarat\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-474-18-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-man-mistakenly-deported-el-salvador-trump-administration-documents-2711801-2025-04-20",
      "headline": "Murder suspect, wife abuser: US on man mistakenly deported to El SalvadorThe US government has released previously unshared documents citing instances of Abrego Garcia, the man wrongly deported to El Salvador as an MS-13 gang member, being involved in face-offs with the law enforcement and the court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-celebration-nehal-wadhera-run-out-2711817-2025-04-20",
      "headline": "Watch: Virat Kohli's cold celebration after Nehal Wadhera run-out goes viralIPL 2025: Virat Kohli came up with an aggressive celebratory gesture after he ran out Nehal Wadhera in Mullanpur on Sunday. PBKS were restricted to 157 in 20 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-unveils-its-first-global-electric-sedan-the-ev4-2711741-2025-04-20",
      "headline": "Kia unveils its first global electric sedan, the EV4Kia has unveiled the EV4 at the ongoing New York International Auto Show. The EV4 comes with two battery choices: a 58.3kWh unit offering up to 378km range and an 81.4kWh option delivering up to 531km on Wind and GT-Line trims."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pubg-lure-of-rs-50000-delivery-fee-used-to-run-rs-10-crore-drug-empire-2711750-2025-04-20",
      "headline": "PUBG, lure of Rs 50,000 delivery fee used to run Rs 10 crore drug empireCode-named 'Operation Clean Sweep', the crackdown has led to the arrest of ten individuals so far, including one accused who shockingly revealed he used the online game PUBG to connect with his heroin supplier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sundar-pichai-google-ceo-vaibhav-suryavanshi-debut-rr-vs-lsg-2711730-2025-04-20",
      "headline": "Woke up to watch 8th grader: Google CEO Pichai praises Vaibhav SuryavanshiSundar Pichai revealed that he woke up early just to watch Vaibhav Suryavanshi's IPL debut live. The Google CEO heaped the 14-year-old's performance in his debut during Rajasthan Royals' clash against Lucknow Super Ginats with a special post. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-student-partha-rao-remove-sacred-threat-janivara-cet-exam-shivamogga-2711794-2025-04-20",
      "headline": "Another Karnataka student asked to remove sacred thread before entering exam hallAfter the incident came to light, members of the Brahmin community in Shivamogga filed a police complaint against the accused guard. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-record-david-warner-rcb-vs-pbks-match-today-2711857-2025-04-20",
      "headline": "Virat Kohli shatters David Warner's all-time IPL recordVirat Kohli shattered David Warner's all-time IPL record of most 50+ scores in the tournament with yet another half century. Kohli anchored RCB's innings to help them to their 5th straight away win of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-ayush-mhatre-debut-ms-dhoni-wankhede-2711856-2025-04-20",
      "headline": "CSK hand 17-year-old Ayush Mhatre IPL debut at homeground Wankhede vs MIChennai Super Kings have made the bold call to hand young Ayush Mhatre his IPL debut in the El Clasico clash against Mumbai Indians at his homeground, the Wankhede stadium. Mhatre has been a rising star for Mumbai in the domestic circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-mohammad-rizwan-jason-gillespie-pakistan-team-2711854-2025-04-20",
      "headline": "Babar Azam, Mohammad Rizwan have no selfishness, very team-oriiented: GillespieFormer Pakistan coach Jason Gillespie has defended Babar Azam and Mohammad Rizwan, saying that the duo aren't selfish and are very team-oriented players. Gillespie worked with the duo during his short time with the Pakistan team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-score-virat-kohli-devdutt-padikkal-mullanpur-win-2711853-2025-04-20",
      "headline": "Virat Kohli masterminds revenge vs PBKS as RCB win 5th successive away gameIPL 2025, PBKS vs RCB: Virat Kohli and Devdutt Padikkal fired with the bat after a collective bowling performance as Royal Challengers Bengaluru hammered Punjab Kings in Mullanpur on Sunday. RCB have won all their matches away from home so far this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-vaibhav-suryavanshi-14-year-old-rise-dad-packed-tiffin-2711847-2025-04-20",
      "headline": "Vaibhav Suryavanshi's rise: Dad packed food for net bowlers, son hit 600 balls dailyIPL 2025: Vaibhav Suryavanshi's coach, Manish Ojha, recalls how the teenager's parents went above and beyond to support his career. At just 14, Vaibhav made a mark on his IPL debut, smashing big sixes in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-mumbai-indians-vs-chennai-super-kings-updates-today-match-2711830-2025-04-20",
      "headline": "MI vs CSK Live: Rasheed, Rachin steady after Mumbai opt to bowlIPL 2025, MI vs CSK Live Score: Mumbai Indians win the toss in Wankhede and opt to bowl first. The team is unchanged as they hunt for revenge in IPL's El Clasico. Ayush Mhatre makes his debut for Chennai Super Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-comments-glenn-maxwell-holiday-2711846-2025-04-20",
      "headline": "Maxwell, Livingstone come to India to spend holiday, not win IPL: SehwagVirender Sehwag has hit out against IPL's overseas stars Glenn Maxwell and Liam Livingstone. Sehwag has claimed that overseas players come to holiday in India and do not care about winning trophies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-gt-abhishek-nayar-return-carl-crowe-2711845-2025-04-20",
      "headline": "KKR players delighted to have Abhishek Nayar back in setup: Spin bowling coachKKR players are delighted to have Abhishek Nayar back in the team setup, according to spin bowling coach Carl Crowe. Nayar returned to KKR after his Indian team stint came to a premature end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-azharuddin-legal-action-order-hyderabad-stadium-2711818-2025-04-20",
      "headline": "Azharuddin to take legal action against order to remove name from Hyderabad venueMohammad Azharuddin said that he will take legal action over the order to remove his name from the North Stand at the Rajiv Gandhi International Cricket Stadium in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-celebration-nehal-wadhera-run-out-2711817-2025-04-20",
      "headline": "Watch: Virat Kohli's cold celebration after Nehal Wadhera run-out goes viralIPL 2025: Virat Kohli came up with an aggressive celebratory gesture after he ran out Nehal Wadhera in Mullanpur on Sunday. PBKS were restricted to 157 in 20 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-mother-nicholas-pooran-2711815-2025-04-20",
      "headline": "Pooran consoles Avesh's mother in hindi after RR win: Beta bhaloNicholas Pooran stepped in to console Avesh Khan's mother in Hindi after the LSG pacer's stunning performance against RR in the win in Jaipur on Saturday, April 20. Avesh defended 9 runs in the final over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virender-sehwag-comments-glenn-maxwell-holiday-2711846-2025-04-20",
      "headline": "Maxwell, Livingstone come to India to spend holiday, not win IPL: SehwagVirender Sehwag has hit out against IPL's overseas stars Glenn Maxwell and Liam Livingstone. Sehwag has claimed that overseas players come to holiday in India and do not care about winning trophies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-gt-abhishek-nayar-return-carl-crowe-2711845-2025-04-20",
      "headline": "KKR players delighted to have Abhishek Nayar back in setup: Spin bowling coachKKR players are delighted to have Abhishek Nayar back in the team setup, according to spin bowling coach Carl Crowe. Nayar returned to KKR after his Indian team stint came to a premature end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-azharuddin-legal-action-order-hyderabad-stadium-2711818-2025-04-20",
      "headline": "Azharuddin to take legal action against order to remove name from Hyderabad venueMohammad Azharuddin said that he will take legal action over the order to remove his name from the North Stand at the Rajiv Gandhi International Cricket Stadium in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-virat-kohli-celebration-nehal-wadhera-run-out-2711817-2025-04-20",
      "headline": "Watch: Virat Kohli's cold celebration after Nehal Wadhera run-out goes viralIPL 2025: Virat Kohli came up with an aggressive celebratory gesture after he ran out Nehal Wadhera in Mullanpur on Sunday. PBKS were restricted to 157 in 20 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-mother-nicholas-pooran-2711815-2025-04-20",
      "headline": "Pooran consoles Avesh's mother in hindi after RR win: Beta bhaloNicholas Pooran stepped in to console Avesh Khan's mother in Hindi after the LSG pacer's stunning performance against RR in the win in Jaipur on Saturday, April 20. Avesh defended 9 runs in the final over. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}