{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-share-price-reliance-industries-stock-fall-4-percent-stock-market-crash-mukesh-ambani-net-worth-2703996-2025-04-04",
      "headline": "RIL share price falls 4% ahead of Q4 results. Should you sell?Reliance Industries stock: RIL shares opened at Rs 1,240 and fell to an intraday low of Rs 1,192.85 in the afternoon session. The stock was close to its 52-week low of Rs 1,156, which it touched on March 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-india-26-percent-clarity-while-house-new-document-trade-2703962-2025-04-04",
      "headline": "US tariffs stay at 26% as White House unveils new trade documentInitially, India's tariff rate was mentioned as 27% in the earlier version of the White House annex. However, the latest revision has adjusted it to 26%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/withdrawing-epf-know-rules-for-marriage-education-home-and-medical-needs-2703935-2025-04-04",
      "headline": "Withdrawing EPF? Know rules for marriage, education, home and medical needsIf you require money out of your EPF for the purposes of marriage or further studies, there are set regulations one needs to adhere to. You must have been an EPF member for at least seven years and must have at least Rs 1,000 in your EPF account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-says-politicians-need-reality-check-after-piyush-goyal-startup-focused-on-food-delivery-remark-2703916-2025-04-04",
      "headline": "Politicians need reality check, says Ashneer Grover on Piyush Goyal's startup remarkAshneer Grover has said that Indian politicians need a reality check after Piyush Goyal criticised startups for being too focused on food delivery apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pension-rules-updates-8-rbi-guidelines-every-pensioner-must-know-2703884-2025-04-04",
      "headline": "Pension rules updates: 8 RBI guidelines every pensioner must knowIf a bank accidentally credits more pension than it should to a pensioner, then the bank must consult the Pension Sanctioning Authority before recovering the extra money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-fall-5-percent-today-why-reasons-explained-clsa-trump-tariff-2703862-2025-04-04",
      "headline": "Explained: Why Tata Motors share price has fallen 5% todayTata Motors share price: Tata Motors has gone down 8.68% in the last 5 days, 33.43% in the past month and 38.75% in the last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-slams-indian-startups-urges-to-shift-focus-from-food-delivery-apps-2703842-2025-04-04",
      "headline": "Piyush Goyal slams Indian startups, urges to shift focus from food delivery appsUnion Commerce Minister Piyush Goyal criticised India's startup ecosystem, saying it's too focused on food delivery, betting, and fantasy sports apps. In contrast, he praised Chinese startups for prioritising advanced tech like EVs, batteries, semiconductors, and AI, urging Indian innovators to shift toward deeper, tech-driven innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-crash-today-sensex-nifty-under-pressure-trump-reciprocal-tariffs-global-recession-it-sector-2703831-2025-04-04",
      "headline": "Sensex crashes 1,000 points: 3 reasons behind today's stock market bloodbathStock market crash: The S&P BSE Sensex was down 965.90 points to 75,329.46, while the NSE Nifty50 fell 361.10 points to 22,889.00 as of 2:08 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startup-news-zepto-founder-aadit-palicha-mohandas-pai-defend-2703830-2025-04-04",
      "headline": "Storm of protest from startups after Minister Piyush Goyal's 'dukaandari' jibeStartup ecosystem leaders' response came after Piyush Goyal took a firm stance and said that while Indian startups were busy building food delivery platforms and fantasy gaming apps, those in countries like China were working on EVs, semiconductors, batteries, and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-over-350-points-nifty-slides-below-23200-it-and-auto-stocks-drag-markets-2703803-2025-04-04",
      "headline": "Sensex tanks over 700 points as Wall Street bloodbath sinks Indian IT stocksStock market crash: The S&P BSE Sensex was down 698.89 points to 75,596.47 at around 10:06 am, while the NSE Nifty50 was trading 269.50 points lower at 22,980.60."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-expectations-april-4-sensex-nifty-today-wall-street-crash-trump-tariff-2703776-2025-04-04",
      "headline": "Trump's tariff jitters hit US stocks: Will Sensex, Nifty feel the heat today?The extensive tariff announcements by the US government have raised concerns about a global recession, leading to sharp losses in stock markets worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-4-shares-in-focus-hdfc-bank-zomato-dmart-nestle-india-sensex-nifty-2703770-2025-04-04",
      "headline": "Stocks to watch on April 4: Shares in news; HDFC Bank, Zomato, DMartStocks in news today: In Friday's session, shares of Zomato, Nestle India, HDFC Bank, DMart, Mazagon Dock, Bajaj Finance, and others will be in focus due to key corporate developments and financial updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startups-grocery-delivery-comparison-china-ai-zepto-ceo-mohandas-pai-2703750-2025-04-04",
      "headline": "Dukaandari hi karni hai? Piyush Goyal slams startups stuck on food deliveryCommerce Minister Piyush Goyal asked Indian startups to shift their focus from food delivery apps to high-tech sectors like semiconductors and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-drops-1600-as-us-stocks-lead-sell-off-after-trumps-tariffs-cause-covid-like-shock-glbs-2703733-2025-04-04",
      "headline": "Trump tariff blitz wrecks Wall Street, markets suffer biggest fall since CovidTrump's sweeping tariffs sent shockwaves through financial markets, with Wall Street suffering its worst decline since 2020. Analysts warn of economic slowdowns, surging inflation, and a potential recession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tech-retail-stocks-lead-rout-after-trumps-tariff-blow-glbs-2703723-2025-04-04",
      "headline": "US tech, retail stocks lead rout after Trump's tariff blowTrump's broad tariffs send US markets into a tailspin, with tech, retail, and banking stocks plunging. Apple, Walmart, and Nike face rising costs, while energy prices drop amid economic concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-sharply-lower-amid-trade-war-fears-after-trump-tariffs-2703618-2025-04-03",
      "headline": "Wall Street opens sharply lower amid trade war fears after Trump tariffsWall Street's major indexes fell sharply after President Trump's new tariffs raised trade war fears. The Dow dropped 2.66%, the S&P 500 declined 3.32%, and the Nasdaq plunged 4.50%, reflecting market uncertainty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-donald-trump-reciprocal-tariffs-recession-fears-2703617-2025-04-03",
      "headline": "Wall Street bleeds as Trump's tariffs stoke recession fears: 3 things to knowThe Dow Jones Industrial Index fell sharply by over 1,100 points, while the Nasdaq was down over 800 points moments after the US markets opened for trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-nomination-updation-now-free-says-finance-minister-nirmala-sitharaman-2703506-2025-04-03",
      "headline": "PPF nomination updation now free, says Nirmala SitharamanIt is important to add a nominee to the PPFaccount so that the money is transferred in a smooth manner in the event of the death of the PPF account holder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-liberation-day-reciprocal-tariff-announcement-india-at-27-percent-pakistan-29-percent-tariff-2703432-2025-04-03",
      "headline": "Trump's 'Liberation Day' tariff: India at 27%, but where does Pakistan stand?Asian nations have been the hardest hit by Trump's latest tariff move. The new duties aim to cut the US trade deficit and change global supply chains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-loses-300-points-as-trump-tariffs-weigh-but-nifty-holds-23200-amid-limited-impact-2703450-2025-04-03",
      "headline": "Sensex, Nifty snap 2-day winning streak as D-Street sees limited tariff impactThe S&P BSE Sensex fell 322.08 points to close at 76,295.36, while the NSE Nifty50 shed 82.25 points to end at 23,250.10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-us-calculate-reciprocal-tariff-for-different-countries-explanation-factors-reasons-2703440-2025-04-03",
      "headline": "Explained: How Trump's administration calculated reciprocal tariffsIn a statement released on Wednesday night, the United States Trade Representative (USTR) explained how the tariffs were determined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-shares-video-on-x-alleges-fraud-conspiracy-legal-battle-2703395-2025-04-03",
      "headline": "Byju Raveendran alleges conspiracy caught on video amid legal woesThe video he shared is one minute and 44 seconds long and appears to be a screen recording of a virtual meeting involving Byju's shareholders and their lawyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-asia-countries-hardest-hit-china-vietnam-thailand-south-korea-india-2703307-2025-04-03",
      "headline": "Trump's tariff list: Here's why Asian countries took the biggest hitTrump tariff: Besides China, which now faces a total tariff of 54%, Vietnam has been hit with 46%, Thailand with 37%, South Korea with 25%, and India with 27%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-order-india-gets-key-exemptions-on-several-critical-minerals-ytvd-2703245-2025-04-03",
      "headline": "Trump's tariff order: India gets key exemptions on several critical mineralsTrump's new tariff order exempts India on copper, lumber, and critical minerals. The order imposes a 26% lower tariff on India compared to China, but experts question the calculation methods. Former diplomat Ashok Sajjanar criticises the non-transparent system and highlights the impact on strategic partnerships in the Indo-Pacific region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-analyzes-impact-of-us-tariff-mixed-bag-not-a-setback-commerce-ministry-ytvd-2703226-2025-04-03",
      "headline": "Mixed bag, not a setback: India's first response to Trump's tariffThe Commerce Ministry of India is analysing the impact of the 27% tariff imposed by the US. The ministry states it's a mixed bag and not a setback. Exemptions are expected in sectors like pharmaceuticals, semiconductors, and critical minerals. The tariff ranges from 10% to 27% across various sectors. India aims to sign a Bilateral Trade Agreement with the US by fall this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pharmaceutical-stocks-rising-today-donald-trump-reciprocal-tariff-exempt-glanf-pharma-cipla-dr-reddys-2703255-2025-04-03",
      "headline": "Sun Pharma, Gland, Cipla, Dr Reddy's: Why pharma stocks are rising todayShares of Sun Pharma, Dr Reddy's Laboratories, Gland Pharma, and Cipla rose sharply during early trade, defying the weak trend visible on the broader markets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-tanks-500-points-nifty-below-23200-it-stocks-worst-hit-hcltech-infosys-2703240-2025-04-03",
      "headline": "Trump tariffs roil Dalal Street: Sensex, Nifty fall as IT stocks worst hitThe S&P BSE Sensex fell 344.27 points to 76,273.17, while the NSE Nifty50 lost 80.60 points to 23,251.75 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-canada-north-korea-and-mexico-among-countries-missing-from-donald-trump-reciprocal-tariff-list-2703234-2025-04-03",
      "headline": "Why Russia, Canada and these countries were not part of Trump's tariff hit listThe exclusion has raised eyebrows, especially as major trade partners like India (27%), the European Union (20%), and Vietnam (46%) have been slapped with hefty duties. So, why were these countries spared?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-commerce-ministry-official-mixed-bag-not-setback-response-donald-trump-reciprocal-tariffs-announcement-analysing-impact-2703214-2025-04-03",
      "headline": "Mixed bag, not setback: Government official on Trump's tariffs on IndiaThe new tariffs announced by US President Donald Trump include a universal 10% duty on all imports into the US starting from April 5, with an additional 16% to be applied from April 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-3-dalal-street-donald-trump-reciprocal-tariff-2703207-2025-04-03",
      "headline": "Stock market opening on April 3: Will Sensex, Nifty fall after Trump tariff?The stock market extended its gains for the second consecutive session in its last session. The Sensex surged 592.93 points to close at 76,617.44, while the NSE Nifty50 rose 166.65 points to end at 23,332.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-april-3-maruti-suzuki-airtel-hdfc-bank-spicejet-trump-tariff-26-percent-2703202-2025-04-03",
      "headline": "Stocks to watch on April 3: Shares in focus; Maruti Suzuki, Airtel, HDFC BankThe stock market will closely track developments today as several companies such as Maruti Suzuki, HDFC Bank, SpiceJet, and more remain in focus due to key announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-26-percent-reciprocal-tariff-impact-decoded-sectors-at-risk-trade-deal-2703199-2025-04-03",
      "headline": "What Donald Trump's 27% reciprocal tariff means for IndiaThe 27% reciprocal tariff imposed by US President Donald Trump is a big blow to India's exports, affecting multiple industries. Here's what it means for the Indian economy and also a look at the key sectors at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-swings-in-final-hours-of-trading-before-trumps-tariff-announcement-glbs-2703078-2025-04-02",
      "headline": "Wall Street swings in final hours of trading before Trump's tariff announcementUS stocks remained volatile on Wednesday morning in anticipation of President Donald Trump's tariff announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-mundra-port-sets-record-with-200-mmt-annual-cargo-handling-business-update-2703051-2025-04-02",
      "headline": "Adani's Mundra Port sets record with 200-MMT annual cargo handlingMundra Port's growing cargo volume further cements its role as India's largest trade gateway. The steady rise in throughput reflects APSEZ's investment in supply chain and logistics infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poonam-gupta-is-rbi-new-deputy-governor-all-you-need-to-know-2702977-2025-04-02",
      "headline": "Poonam Gupta is RBI's new Deputy Governor: All you need to knowPoonam Gupta is a well-known economist with nearly 20 years of experience at the World Bank and the International Monetary Fund (IMF). She has also been a government adviser in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rally-despite-us-donald-trump-liberation-day-reciprocal-tariffs-2702917-2025-04-02",
      "headline": "Sensex, Nifty rally as stock market ignores US tariff threat: 3 key takeawaysThe Sensex and Nifty witnessed a strong rally despite uncertainty around Trump's 'Liberation Day' tariff announcement. Broader market indices also mirrored the uptrend, and to everyone's surprise, volatility took a backseat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/received-a-wrong-tax-demand-notice-here-is-how-to-rectify-it-online-2702895-2025-04-02",
      "headline": "Received a wrong tax demand notice? Here's how to rectify it onlineThis feature was introduced in January 2025 and allows taxpayers to request corrections through the e-filing Income Tax Return (ITR) portal."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-olivia-munn-slams-all-female-blue-origin-space-trip-calls-it-gluttonous-2704090-2025-04-04",
      "headline": "Actor Olivia Munn slams all-female Blue Origin space trip, calls it 'gluttonous'Actor Olivia Munn slammed the all-female Blue Origin space trip.The 44-year0old actor admitted how the upcoming trip seems 'gluttonous' when so many people 'can't even afford eggs.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-smashes-another-box-office-record-with-rs-100-crore-worldwide-share-2704072-2025-04-04",
      "headline": "Empuraan smashes another box office record with Rs 100 crore worldwide shareL2: Empuraan has recorded a Rs 100 crore share worldwide, reported Mohanlal himself. The actor shared a celebratory post on X, highlighting the film's achievement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-games-o-yeong-su-sentenced-to-one-year-prison-for-sexual-assault-2704052-2025-04-04",
      "headline": "Squid Game actor O Yeong-su sentenced to one year in prison for sexual assaultSquid Game actor O Yeong-su has been sentenced to prison for one year after he was accused of forcibly molesting a woman twice. The actor has pleaded not guilty in his appeal trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-atlee-film-pushpa-actor-sun-pictures-2704054-2025-04-04",
      "headline": "Allu Arjun-Atlee film announcement expected soon as Pushpa actor arrives in ChennaiDirector Atlee and actor Allu Arjun are joining hands for the first time. The Pushpa actor arrived in Chennai to hold a meeting with Atlee and Sun Pictures, the production house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shakiras-2025-tour-is-here-find-out-where-shes-performing-in-the-us-glbs-2704043-2025-04-04",
      "headline": "Shakira's 2025 Tour is here – Find out where she's performing in the USShakira expands her Las Mujeres Ya No Lloran World Tour, adding US dates. Fans can buy tickets from April 7. The tour celebrates Latin culture, unity, and record-breaking performances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/khloe-kardashian-and-tristan-thompson-reunite-for-his-brother-amaris-birthday-glbs-2704035-2025-04-04",
      "headline": "Khloé Kardashian and Tristan Thompson reunite for his brother Amari's birthdayKhloé Kardashian reunited with Tristan Thompson for his brother Amari's 18th birthday, emphasizing her close bond with his family. Despite their breakup, she continues to support Amari, whom Tristan now has legal custody of.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/l2-empuraan-mohanlal-controversy-voluntary-censorship-not-required-2704031-2025-04-04",
      "headline": "Empuraan: Voluntary or not, the cuts that shouldn't have beenEmpuraan's re-edited version trims two minutes to appease offended parties - an unnecessary sacrifice. This paradise of wounded people showcases our remarkable talent for manufacturing outrage from triviality.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamar-boss-teaser-raakhee-gulzar-comeback-film-after-22-years-shiboprosad-mukherjee-nandita-ray-2704025-2025-04-04",
      "headline": "Aamar Boss teaser: Raakhee Gulzar's comeback film promises heartfelt momentsThe teaser of Aamar Boss, which marks Raakhee Gulzar's return after 22 years and features Shiboprosad Mukherjee, is out. The film, directed by Nandita Roy and Shiboprosad Mukherjee, is set for a May 9 release, before Mother's Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mtv-video-music-awards-to-hit-cbs-screens-for-the-first-time-glbs-2704021-2025-04-04",
      "headline": "MTV Video Music Awards to hit CBS screens for the first timeThe MTV Video Music Awards will air on CBS for the first time on Sept. 7, live from UBS Arena."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-visits-chandramouleshwara-temple-in-karnataka-2704014-2025-04-04",
      "headline": "Sara Ali Khan visits Chandramouleshwara temple in KarnatakaActor Sara Ali Khan recently visited Chandramouleshwar Temple in Unkal. She shared pictures from the trip on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-idly-kadai-release-date-october-1-special-poster-2703973-2025-04-04",
      "headline": "Dhanush announces Idly Kadai release date with a special posterDhanush, who acted and helmed Idly Kadai, announced the film's release date with a poster. The film was earlier scheduled to release on April 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-to-celebrate-29th-birthday-in-oman-with-friends-2703947-2025-04-04",
      "headline": "Rashmika Mandanna to celebrate 29th birthday in Oman with friendsPushpa star Rashmika Mandanna is all set to celebrate her 29th birthday in Oman. The actor was recently seen sharing screen space with Salman Khan in Sikandar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-ron-leaked-texts-to-kim-soo-hyun-hint-at-unhappy-relationship-it-bothers-me-2703932-2025-04-04",
      "headline": "It bothers me: Kim Sae-ron's leaked texts to Kim Soo-hyun hint at unhappy relationKorean actor Kim Soo-hyun continues to battle allegations about dating the late actor Kim Sae-ron when she was a minor. A set of new alleged text-exchanges alleges that she was not happy in their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-backs-salman-rashmika-pairing-in-sikandar-dismisses-age-gap-debate-2703930-2025-04-04",
      "headline": "Ameesha Patel backs Salman-Rashmika pairing in Sikandar, dismisses age gap debateActor Ameesha Patel recently shared her views on the ongoing discussion about the age difference between Salman Khan and Rashmika Mandanna in Sikandar.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/test-review-madhavan-nayanthara-and-siddharth-hit-sixes-but-dont-win-the-match-2703901-2025-04-04",
      "headline": "Test review: Madhavan, Nayanthara and Siddharth hit sixes, but don't win the matchReleased-Fri Apr 04, 2025Test movie review: Producer-turned-director Sashikanth's 'Test', starring Madhavan, Siddharth and Nayanthara, is a sports drama about a winner and a loser. The trio's star power failed to deliver an enjoyable innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-defamation-case-shah-rukh-khan-om-shanti-om-spoof-rs-100-crore-2703914-2025-04-04",
      "headline": "When Manoj Kumar filed defamation case against SRK: He has injured my soulVeteran actor Manoj Kumar was upset with a scene in the 2007 film Om Shanti Om, leading to legal action against Shah Rukh Khan and director Farah Khan. Despite an apology and promises to remove the scene, the issue resurfaced in 2013 when the film was re-released in Japan with the scene intact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-mahesh-babu-priyanka-chopra-next-not-released-in-two-parts-2703874-2025-04-04",
      "headline": "SS Rajamouli-Mahesh Babu's next will not be released in two parts: ReportDirector SS Rajamouli will reportedly not be releasing his next film, starring Mahesh Babu and Priyanka Chopra, in two installments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-collection-day-8-detailed-report-rs-100-crore-confirmed-by-2nd-weekend-for-mohanlal-prithviraj-sukumaran-film-2703867-2025-04-04",
      "headline": "Empuraan box office Day 8: Rs 100 crore confirmed by 2nd weekend for Mohanlal's filmMohanlal's 'L2: Empuraan' has entered its second weekend at the box office. The film is inching closer to the Rs 100 crore benchmark at the domestic box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ghost-writing-to-becoming-indias-bharat-kumar-iconic-legacy-of-manoj-kumar-2703829-2025-04-04",
      "headline": "Ghost-writing to becoming India's Bharat Kumar: Iconic legacy of Manoj KumarLegendary actor Manoj Kumar died on Friday at around 3.30 am in Mumbai. He was 87. We trace his journey in this tribute piece, highlighting what he really stood for. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/annamalai-rules-himself-out-of-tamil-nadu-bjp-chief-race-2704041-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Wish party good future': Annamalai bows out of Tamil Nadu BJP chief raceK Annamalai on Friday ruled himself out of the BJP's Tamil Nadu presidency race. This could be because the party reportedly plans a leadership change, amid reunion talks with the AIADMK and broader caste-based political strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-bangladesh-muhammad-yunus-rhetoric-row-northeast-thailand-meeting-2703983-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Avoid rhetoric that vitiates environment, ensure safety of Hindus: PM to YunusPM Modi's remarks come against the backdrop of Muhammad Yunus inviting China to expand its influence in India's Northeast. The comments were strongly denounced by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-slaps-34-additional-tariff-on-us-goods-from-april-10-2704059-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China slaps 34% additional tariff on US goods after Trump's sweeping trade moveThe move comes a day after Beijing urged Washington to withdraw its latest tariffs and warned of countermeasures to protect its own interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/what-is-waqf-amendment-bill-key-provisions-controversy-history-explained-2703908-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Waqf amendment bill owned the headlines, what's behind and beyond?After two days of hectic debates in both Houses, stretching well past midnight, the Waqf Amendment Bill passed the Parliament hurdle on Friday. In this article, we dive deep into the history of waqf, the provisions of the bill, and what the controversy is all about."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-turkey-hagia-sophia-once-cathedral-mosque-museum-waqf-property-amendment-bill-india-what-happened-2703902-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Turkey's Hagia Sophia, once a cathedral, became Waqf propertyThe Hagia Sophia is at the centre of Turkey's Byzantine, Ottoman and secular history. How did the sixth-century cathedral become a Waqf property, get converted to a museum, and again a mosque? Tracing the history of the Hagia Sophia amid the Waqf Bill debate in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ghost-writing-to-becoming-indias-bharat-kumar-iconic-legacy-of-manoj-kumar-2703829-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ghost-writing to becoming India's Bharat Kumar: Iconic legacy of Manoj KumarLegendary actor Manoj Kumar died on Friday at around 3.30 am in Mumbai. He was 87. We trace his journey in this tribute piece, highlighting what he really stood for. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-neet-row-tn-cm-stalin-calls-all-party-mla-meeting-against-centres-exemption-rejection-2703906-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin calls meeting with MLAs after Centre denies state's NEET exemption pleaTamil Nadu Chief Minister MK Stalin has called for a meeting of all MLAs in the state on April 9 after the Centre rejected the state's plea for NEET exemption. \"NEET disproportionately benefits urban students who can afford expensive coaching centres,\" said Stalin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/test-review-madhavan-nayanthara-and-siddharth-hit-sixes-but-dont-win-the-match-2703901-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Test review: Madhavan, Nayanthara and Siddharth hit sixes, but don't win the matchReleased-Fri Apr 04, 2025Test movie review: Producer-turned-director Sashikanth's 'Test', starring Madhavan, Siddharth and Nayanthara, is a sports drama about a winner and a loser. The trio's star power failed to deliver an enjoyable innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-man-who-entered-andamans-restricted-island-with-cola-previously-met-taliban-2703942-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Daredevil' US man who entered Andaman's restricted island met Taliban previouslyAmerican YouTuber Mykhailo Viktorovych Polyakov, was arrested for attempting to make contact with one of the world's most isolated tribes on North Sentinel Island, had previously visited Taliban-controlled Afghanistan and shared videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-madikeri-kodagu-bjp-worker-dies-by-suicide-in-bengaluru-after-fir-blames-congress-leaders-police-harassment-in-suicide-note-2704046-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka BJP worker dies by suicide, blames Congress leaders, police in death noteA 35-year-old BJP worker from Karnataka's Madikeri, Vinay Somayya, allegedly died by suicide in Bengaluru after an FIR was filed against him. In his note, he blamed Congress leaders and accused the police of harassment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/satellite-images-show-deforestation-in-hyderabad-kancha-gachibowli-forest-area-2703984-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Satellite images confirm deforestation in Hyderabad's Kancha Gachibowli areaSatellite images show the deforestation near Hyderabad Central University for an IT park in Telangana. The felling of trees sparked outrage, leading to student protests and Supreme Court intervention amid questions over environmental clearance and the ecological sensitivity of Kancha Gachibowli region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startups-grocery-delivery-comparison-china-ai-zepto-ceo-mohandas-pai-2703750-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dukaandari hi karni hai? Piyush Goyal slams startups stuck on food deliveryCommerce Minister Piyush Goyal asked Indian startups to shift their focus from food delivery apps to high-tech sectors like semiconductors and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/india-is-our-fastest-growing-chatgpt-market-says-openai-coo-2703953-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India is our fastest growing ChatGPT market, says OpenAI COOJust a day after OpenAI CEO Sam Altman called the AI adoption in India \"amazing\", the company's COO has shared a post on X saying India is their fastest growing ChatGPT market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-defamation-case-shah-rukh-khan-om-shanti-om-spoof-rs-100-crore-2703914-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When Manoj Kumar filed defamation case against SRK: He has injured my soulVeteran actor Manoj Kumar was upset with a scene in the 2007 film Om Shanti Om, leading to legal action against Shah Rukh Khan and director Farah Khan. Despite an apology and promises to remove the scene, the issue resurfaced in 2013 when the film was re-released in Japan with the scene intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsoft-co-founder-bill-gates-shares-the-coolest-code-he-has-ever-written-free-to-download-for-all-2703891-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Microsoft co-founder Bill Gates shares the coolest code he has ever writtenOn the 50th anniversary of Microsoft, co-founder Bill Gates shares the code that started it all. He has made it available to download for all on his blog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-india-startup-news-zepto-founder-aadit-palicha-mohandas-pai-defend-2703830-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Storm of protest from startups after Minister Piyush Goyal's 'dukaandari' jibeStartup ecosystem leaders' response came after Piyush Goyal took a firm stance and said that while Indian startups were busy building food delivery platforms and fantasy gaming apps, those in countries like China were working on EVs, semiconductors, batteries, and AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-mohammad-jawed-moves-supreme-court-after-waqf-bill-clears-parliament-2704075-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress MP moves Supreme Court after Waqf bill clears ParliamentCongress MP Mohammad Jawed has filed the first legal challenge to the Waqf Amendment Act in the Supreme Court, arguing it violates constitutional rights including equality, religious freedom, minority protection, and property rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/martin-luther-king-jr-civil-rights-movement-mission-legacy-assassination-aftermath-2703614-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Martin Luther King Jr.: The man, his mission, and the aftermath of his assassinationOn April 4, 1968, Nobel Peace Prize awardee Martin Luther King Jr. was assassinated in Memphis, triggering riots across the US. His death shook the civil rights movement but also cemented his legacy in the fight for justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/a-fiery-wind-struck-jupiter-in-2017-it-was-so-powerful-it-cracked-the-planet-2704026-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fiery wind from the Sun made Jupiter crack in 2017This phenomenon, reported for the first time, resulted in temperatures exceeding 500°C, significantly higher than the typical background temperature of 350°C."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharmas-bizarre-chat-with-zaheer-khan-goes-viral-2703807-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma's bizarre chat with Zaheer goes viral: 'Jab karna tha, maine kiya'Mumbai Indians' batter Rohit Sharma's chat with Lucknow Super Giants (LSG) mentor Zaheer Khan has been going viral on social media as his conversation is being seen as a comment on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/internet-explodes-with-memes-as-trump-slaps-tariffs-on-islands-inhabited-by-penguins-2703889-2025-04-04#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Internet explodes with memes as Trump slaps tariffs on islands inhabited by penguinsHeard Island and McDonald Islands, an external Australian territory, are among the most isolated places on Earth. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-curry-shares-postgame-moment-with-david-beckham-after-warriors-defeat-lakers-glbs-2704089-2025-04-04",
      "headline": "NBA: Stephen Curry shares postgame moment with David Beckham after Warriors defeat LakersThe Golden State Warriors secured a crucial 123–116 victory over the Los Angeles Lakers on Thursday night, tightening the race for playoff seeding in the Western Conference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-shah-rukh-khan-message-venkatesh-iyer-2704083-2025-04-04",
      "headline": "SRK texts KKR after SRH win, sends special message to Venkatesh IyerShah Rukh Khan sent a personal message to KKR players, including a motivating note to Venkatesh Iyer as vice-captain, silenced his price-tag critics with a crucial knock to beat SRH in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-shakes-off-injury-scare-in-lakers-showdown-against-warriors-glbs-2704073-2025-04-04",
      "headline": "NBA: LeBron James shakes off injury scare in Lakers' showdown against WarriorsLeBron James went down in the first quarter during the NBA regular game between the Los Angeles Lakers and the Golden State Warriors at Crypto.com Arena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-when-ms-dhoni-turned-astrologer-for-axar-patel-2704069-2025-04-04",
      "headline": "When MS Dhoni turned astrologer for Axar Patel: DC captain recalls old storyDelhi Capitals (DC) captain Axar Patel recently recalled an incident when legendary Chennai Super Kings (CSK) wicketkeeper batter MS Dhoni turned his astrologer during an IPL game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-like-my-father-matheesha-pathirana-csk-vs-dc-2704050-2025-04-04",
      "headline": "MS Dhoni is like my father: Pathirana pays big tribute to CSK iconMatheesha Pathirana credited MS Dhoni as a father figure in his cricketing journey with Chennai Super Kings in the IPL, with heartfelt praise echoed by his parents. The young Sri Lankan pacer has been a key bowling option for CSK since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ai-predicts-winner-of-lsg-vs-mi-match-2703991-2025-04-04",
      "headline": "IPL 2025: AI predicts winner of LSG vs MI clashAs Lucknow Super Giants (LSG) take on Mumbai Indians (MI) in Match 16 of the Indian Premier League 2025 (IPL 2025), we asked AI to predict the winner of the mouth-watering clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-secretary-devajit-saikia-defends-delhi-test-in-november-2703977-2025-04-04",
      "headline": "BCCI defends Delhi Test in November: Pollution issue doesn't happen every yearBoard of Control for Cricket in India (BCCI) secretary Devajit Saikia has come out in defence of their decision to host a Test match in Delhi in the month of November. India are set to play the first Test against South Africa on 18th November at Arun Jaitely Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-javelin-competition-dates-all-you-need-to-know-2703975-2025-04-04",
      "headline": "Neeraj Chopra Classic javelin competition in May 2025: All you need to knowThe Neeraj Chopra Classic javelin throw competition is all set to make its debut on May 24, bringing the Olympic star back to Indian soil after more than a year. With global athletes in attendance, the competition has already received the World Athletics category 'A' recognition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-luka-doncic-gifts-bts-j-hope-unreleased-sneakers-at-lakers-game-glbs-2703949-2025-04-04",
      "headline": "NBA: Luka Doncic gifts BTS' J-Hope unreleased sneakers at Lakers gameDuring the Los Angeles Lakers vs Golden State Warriors NBA regular game on Thursday, April 3, Lakers Guard Luka Doncic had a brief interaction with the BTS member J-Hope, who was on the courtside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kolkata-knight-riders-20-wins-vs-sunrisers-hyderabad-kkr-vs-srh-2703929-2025-04-04",
      "headline": "IPL 2025: Kolkata Knight Riders achieve unprecedented feat after beating SRHKolkata Knight Riders (KKR) achieved an unprecedented feat after beating Sunrisers Hyderabad (SRH) in Match 15 of the Indian Premier League 2025 (IPL 2025). The Ajinkya Rahane-led side won the match by 80 runs at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-hardik-pandya-pep-talk-ashwani-kumar-watch-2703895-2025-04-04",
      "headline": "Watch: Pandya's 'be prepared' pep talk to MI's new star Ashwani KumarMumbai Indians skipper Hardik Pandya gave a pep talk to Ashwani Kumar, urging the debutant to carry forward his fiery form against LSG. With both sides desperate for momentum, the stage is set for the youngster to shine again under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-secretary-devajit-saikia-defends-delhi-test-in-november-2703977-2025-04-04",
      "headline": "BCCI defends Delhi Test in November: Pollution issue doesn't happen every yearBoard of Control for Cricket in India (BCCI) secretary Devajit Saikia has come out in defence of their decision to host a Test match in Delhi in the month of November. India are set to play the first Test against South Africa on 18th November at Arun Jaitely Stadium in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-classic-javelin-competition-dates-all-you-need-to-know-2703975-2025-04-04",
      "headline": "Neeraj Chopra Classic javelin competition in May 2025: All you need to knowThe Neeraj Chopra Classic javelin throw competition is all set to make its debut on May 24, bringing the Olympic star back to Indian soil after more than a year. With global athletes in attendance, the competition has already received the World Athletics category 'A' recognition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-luka-doncic-gifts-bts-j-hope-unreleased-sneakers-at-lakers-game-glbs-2703949-2025-04-04",
      "headline": "NBA: Luka Doncic gifts BTS' J-Hope unreleased sneakers at Lakers gameDuring the Los Angeles Lakers vs Golden State Warriors NBA regular game on Thursday, April 3, Lakers Guard Luka Doncic had a brief interaction with the BTS member J-Hope, who was on the courtside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kolkata-knight-riders-20-wins-vs-sunrisers-hyderabad-kkr-vs-srh-2703929-2025-04-04",
      "headline": "IPL 2025: Kolkata Knight Riders achieve unprecedented feat after beating SRHKolkata Knight Riders (KKR) achieved an unprecedented feat after beating Sunrisers Hyderabad (SRH) in Match 15 of the Indian Premier League 2025 (IPL 2025). The Ajinkya Rahane-led side won the match by 80 runs at Eden Gardens, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-hardik-pandya-pep-talk-ashwani-kumar-watch-2703895-2025-04-04",
      "headline": "Watch: Pandya's 'be prepared' pep talk to MI's new star Ashwani KumarMumbai Indians skipper Hardik Pandya gave a pep talk to Ashwani Kumar, urging the debutant to carry forward his fiery form against LSG. With both sides desperate for momentum, the stage is set for the youngster to shine again under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-pak-mark-chapman-ruled-out-of-third-odi-due-to-hamstring-injury-2703878-2025-04-04",
      "headline": "Mark Chapman ruled out of third ODI vs Pakistan due to hamstring injuryNew Zealand batter Mark Chapman has been ruled out of the third ODI vs Pakistan due to a hamstring injury. Chapman scored a magnificent hundred in the series opener in Napier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-nicholas-pooran-2024-clash-special-2703857-2025-04-04",
      "headline": "LSG vs MI, IPL 2025: When Nicholas Pooran thrashed Mumbai in 2024 showdownLucknow Super Giants will look to repeat last year's dominant win over Mumbai Indians. Nicholas Pooran's heroics from last year and the Ekana advantage give them a perfect chance to turn their IPL 2025 campaign around against the struggling five-time champions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/target-was-gettable-just-didnt-get-the-start-we-wanted-srh-bowling-coach-franklin-2703852-2025-04-04",
      "headline": "Target was gettable, we didn't get the start we wanted: James FranklinSunrisers Hyderabad (SRH) bowling coach James Franklin feels that their team would've chased down the target of 201 against Kolkata Knight Riders (KKR), but they didn't get the start they wanted. SRH got all out for just 120 in 16.4 overs at the Eden Gardens in Kolkata and lost their third consecutive game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-james-franklin-on-srhs-poor-death-bowling-srh-vs-kkr-2703825-2025-04-04",
      "headline": "Didn't get it quite right: Franklin rues poor death bowling against KKRIPL 2025, KKR vs SRH: Sunrisers Hyderabad bowling coach James Franklin said that the Orange Army faltered in the death overs against Kolkata Knight Riders where they leaked 66 runs in their last four overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-venkatesh-iyer-press-conference-kkr-vs-srh-2703835-2025-04-04",
      "headline": "Don't want to be a team which scores 250 and get out for 70 next day: Venkatesh IyerKolkata Knight Riders all-rounder Venkatesh Iyer has said that their team focuses more on showing positive and correct intent after his match-winning innings vs Sunrisers Hyderabad (SRH). He stressed that aggression doesn't mean tonking every ball for six but understanding and using the conditions in one's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-lsg-vs-mi-live-updates-buildup-lucknow-2703810-2025-04-04",
      "headline": "LSG vs MI Live: Can Lucknow continue dominance over Mumbai?IPL 2025 Live Score, Lucknow Super Giants (LSG) vs Mumbai Indians (MI): Rishabh Pant's Lucknow Super Giants will host Hardik Pandya-led Mumbai Indians at the Ekana Stadium in the Indian Premier League 2025 on Friday. LSG will look to bounce back after their humbling at the hands of Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-hyper-aggression-under-review-kkr-vs-srh-2703816-2025-04-04",
      "headline": "Hyper-aggression under review as SRH crash and burn for 3rd straight timeSunRisers Hyderabad lost their third straight game in the Indian Premier League 2025 season. After the match, Pat Cummins said that it was perhaps time to review their hyper-aggressive batting template."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharmas-bizarre-chat-with-zaheer-khan-goes-viral-2703807-2025-04-04",
      "headline": "Rohit Sharma's bizarre chat with Zaheer goes viral: 'Jab karna tha, maine kiya'Mumbai Indians' batter Rohit Sharma's chat with Lucknow Super Giants (LSG) mentor Zaheer Khan has been going viral on social media as his conversation is being seen as a comment on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-venkatesh-iyer-press-conference-kkr-vs-srh-2703835-2025-04-04",
      "headline": "Don't want to be a team which scores 250 and get out for 70 next day: Venkatesh IyerKolkata Knight Riders all-rounder Venkatesh Iyer has said that their team focuses more on showing positive and correct intent after his match-winning innings vs Sunrisers Hyderabad (SRH). He stressed that aggression doesn't mean tonking every ball for six but understanding and using the conditions in one's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-today-match-lsg-vs-mi-live-updates-buildup-lucknow-2703810-2025-04-04",
      "headline": "LSG vs MI Live: Can Lucknow continue dominance over Mumbai?IPL 2025 Live Score, Lucknow Super Giants (LSG) vs Mumbai Indians (MI): Rishabh Pant's Lucknow Super Giants will host Hardik Pandya-led Mumbai Indians at the Ekana Stadium in the Indian Premier League 2025 on Friday. LSG will look to bounce back after their humbling at the hands of Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-hyderabad-hyper-aggression-under-review-kkr-vs-srh-2703816-2025-04-04",
      "headline": "Hyper-aggression under review as SRH crash and burn for 3rd straight timeSunRisers Hyderabad lost their third straight game in the Indian Premier League 2025 season. After the match, Pat Cummins said that it was perhaps time to review their hyper-aggressive batting template."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharmas-bizarre-chat-with-zaheer-khan-goes-viral-2703807-2025-04-04",
      "headline": "Rohit Sharma's bizarre chat with Zaheer goes viral: 'Jab karna tha, maine kiya'Mumbai Indians' batter Rohit Sharma's chat with Lucknow Super Giants (LSG) mentor Zaheer Khan has been going viral on social media as his conversation is being seen as a comment on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-match-preview-lucknow-super-giants-vs-mumbai-indians-2703790-2025-04-04",
      "headline": "Pant under pressure as struggling Lucknow host rejuvenated MumbaiRishabh Pant's Lucknow Super Giants will host Mumbai Indians in Match 16 of the Indian Premier League 2025 (IPL 2025) with an aim to bring their campaign back on track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-match-pitch-report-weather-forecast-ekana-stadium-lucknow-2703579-2025-04-04",
      "headline": "LSG vs MI, pitch, weather report IPL 2025: Will Lucknow give a high-scoring thriller?Lucknow Super Giants will welcome the Mumbai Indians to the Ekana stadium on Friday, April 4. With the Lucknow pitch in focus, will we get a high-scoring encounter as both teams eye two points?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-mi-playing-11-team-prediction-2703622-2025-04-04",
      "headline": "IPL 2025, LSG vs MI, predicted XI, fantasy picks: Will Lucknow find the perfect mix?Lucknow Super Giants aim to turn around their IPL 2025 campaign but face a stern challenge against the Mumbai Indians at home. While LSG struggles to find the right team balance, MI's recent dominant win boosts their confidence for the clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-in-an-ipl-of-hard-hitting-knight-riders-find-identity-with-smart-skills-2703780-2025-04-04",
      "headline": "KKR vs SRH: In an IPL of hard-hitting, Knight Riders find identity with smart skills IPL 2025, KKR vs SRH: Kolkata Knight Riders (KKR) hammered the Sunrisers Hyderabad (SRH) and made amends from their heavy defeat at the hands of the Mumbai Indians (MI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkrs-venkatesh-iyer-answers-price-tag-critics-kkr-vs-srh-2703767-2025-04-04",
      "headline": "20 crore doesn't matter once IPL starts: KKR's Venkatesh on price tag criticsVenkatesh Iyer clapped back at his price tag critics, saying that the money paid on him in the auction doesn't matter once the season starts. Venkatesh played a starring role in KKR's win over SRH. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kane-williamson-on-srh-batting-failure-kkr-vs-srh-2703753-2025-04-04",
      "headline": "SRH's aggression fails again: Kane Williamson feels Hyderabad could make changesKane Williamson feels that SRH could be tempted into making a few changes as their aggressive approach failed again in IPL 2025. KKR thrashed SRH to hand them their 3rd straight loss on Thursday, April 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-kkr-vs-srh-highlights-orange-purple-cap-2703726-2025-04-04",
      "headline": "Points Table, April 3: KKR jump to third after crushing win vs SRHIPL Points Table Update, April 3: Kolkata Knight Riders jumped to fifth in the points table after beating Sunrisers Hyderabad by 80 runs at the Eden Gardens in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-lsg-vs-mi-kieron-pollard-press-conference-lucknow-2703725-2025-04-04",
      "headline": "MI always aim to bring forward new talent each season: Kieron PollardMumbai Indians batting coach Kieron Pollard has said that the aim of the side is to bring forward new talents each season with the aim of making them long-term assets for the side moving forward. MI has already seen Ashwani Kumar and Vignesh Puthur step up for them this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-srh-ajinkya-rahane-batting-eden-gardens-kolkata-2703711-2025-04-03",
      "headline": "Mumbai collapse, Kolkata ecstacy: KKR's smart batting thrills captain Ajinkya RahaneKKR captain Ajinkya Rahane was thrilled to see the smart batting displayed by his side in their 80-run win over SRH in Kolkata on Thursday, April 3. The KKR batters applied smart batting on a tricky Kolkata pitch to post a challenging total of 201. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-zaheer-khan-akash-deep-press-conference-lsg-vs-mi-2703710-2025-04-03",
      "headline": "Zaheer Khan will be able to figure out what improvements I need: Akash DeepIPL 2025, LSG vs MI: Fast bowler Akash Deep said that working with Lucknow Super Giants mentor Zaheer Khan is a massive honour for him. After recovering from a back injury, the pacer declared himself fit before the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/viswanathan-anand-amitabh-bachchan-dance-moves-video-2703706-2025-04-03",
      "headline": "Watch: Viswanathan Anand dances to iconic 'Main Hoon Don' songThe legendary Viswanathan Anand danced to the tunes of Amitabh Bachchan's iconic song \"Main Hoon Don\" from the blockbuster film Don. Anand was the first world champion from India before D Gukesh joined him in the elite list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-srh-match-report-highlights-venkatesh-iyer-rinku-singh-eden-pitch-2703696-2025-04-03",
      "headline": "Iyer, pacers hand KKR dominating win as SRH implode once againKolkata to full advantage of their home ground on Thursday against the SunRisers Hyderabad, Ajinkya Rahane's team destroyed SRH to make it 4 wins in the last 4 games. Venkatesh Iyer and the bowlers starred in KKR's win."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}