{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-expectation-next-week-sensex-nifty-trading-setup-monday-rbi-rate-cut-2737598-2025-06-08",
      "headline": "RBI rate cut lights up Dalal Street, but will the rally continue?The RBI reduced the repo rate to 5.5% and also changed its policy stance from 'accommodative' to 'neutral', suggesting that it will now wait and watch before making further moves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-poverty-rate-sees-sharp-decline-falls-to-53-in-2022-23-2737349-2025-06-07",
      "headline": "India's poverty rate sees sharp decline, falls to 5.3% in 2022-23India's updated consumption data helped offset the World Bank's revised International Poverty Line, reducing the global increase in extreme poverty by 125 million people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/elon-musks-starlink-gets-licence-from-telecom-ministry-2736847-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence from telecom ministryElon Musk's Starlink has received a crucial licence from India's telecom ministry, paving the way for its satellite internet services in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-cancer-shoaib-ibrahim-eid-in-hospital-2737584-2025-06-08",
      "headline": "Dipika Kakar celebrates Eid in hospital with Shoaib Ibrahim amid Cancer recoveryTV actor Dipika Kakar celebrated Eid al-Adha with husband Shoaib Ibrahim in the hospital. The latter shared a photo on his Instagram Story featuring the couple holding Eidi envelopes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-goes-incognito-to-get-housefull-5-reviews-fans-react-2737575-2025-06-08",
      "headline": "Akshay Kumar goes incognito to get Housefull 5 reviews, fans reactIn a hilarious turn of events, a masked Akshay Kumar was seen outside a theatre, seeking honest reactions from the audience about his latest film, 'Housefull 5'. The comedy entertainer hit theatres on June 6.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-at-delhi-airport-sitaare-zameen-par-2737570-2025-06-08",
      "headline": "Aamir Khan, girlfriend Gauri Spratt leave Delhi airport hand-in-hand. WatchAamir Khan was clicked with girlfriend Gauri Spratt at the Delhi airport on Saturday. The couple were seen holding hands while exiting the airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-photos-teaser-coming-soon-2737550-2025-06-08",
      "headline": "Diljit Dosanjh shares BTS pics from Sardaar Ji 3 sets, says teaser coming soonDiljit Dosanjh shared behind-the-scenes photos from the sets of 'Sardaar Ji 3', shot at scenic locations abroad. The horror-comedy film, co-starring Neeru Bajwa, is set to release worldwide on June 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-claps-back-at-netflix-ceo-ted-sarandos-for-his-sacred-games-remark-2737547-2025-06-08",
      "headline": "Anurag Kashyap claps back at Netflix CEO Ted Sarandos for his Sacred Games remarkNetflix CEO Ted Sarandos reflected on 'Sacred Games' as Netflix India's first original, suggesting a more populist start could have been better, sparking backlash from co-creator Anurag Kashyap. The filmmaker shared his reaction on Instagram. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wraps-og-shoot-makers-announce-with-new-poster-2737523-2025-06-08",
      "headline": "Pawan Kalyan wraps OG shoot, makers announce with new posterPawan Kalyan has completed shooting for his much-awaited action film 'OG', directed by Sujeeth. The makers have announced that the film will release in theatres on September 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-urges-voluntary-language-learning-opposes-hindi-imposition-in-south-2737516-2025-06-08",
      "headline": "Kamal Haasan urges voluntary language learning, opposes Hindi imposition in SouthKamal Haasan has spoken out against the imposition of Hindi in southern India. He stressed that education should be free from language imposition and focus on the most efficient learning paths. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-day-3-kamal-haasan-mani-ratnam-film-crawls-past-rs-30-crore-2737499-2025-06-08",
      "headline": "Thug Life box office Day 3: Kamal Haasan, Silambarasan's film crawls past Rs 30 croreKamal Haasan and Mani Ratnam's much-anticipated collaboration 'Thug Life' is struggling at the box office. Following a sharp drop in collections on Day 2, the film barely managed to cross the Rs 30-crore mark by the end of Day 3.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-day-2-akshay-kumar-film-off-to-a-flyer-crosses-rs-50-crore-2737491-2025-06-08",
      "headline": "Housefull 5 box office Day 2: Akshay's film off to a flyer, crosses Rs 50 crore'Housefull 5', featuring a star-studded ensemble, has outpaced its previous installments and crossed the Rs 50-crore mark at the domestic box office within just two days of its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hamraaz-sunil-dutt-br-chopra-raaj-kumar-mumtaz-a-prophecy-of-vimis-real-life-tragedy-2737385-2025-06-08",
      "headline": "Hamraaz: A prophecy of Vimi's real-life tragedy'Hamraaz' is a classic Bollywood film that blends romance, mystery, and tragedy against the backdrop of 1960s India. The movie also eerily reflects the real-life heartbreak of its lead actor Vimi, whose brief stardom was shadowed by personal turmoil and loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sweet-reaction-to-daughter-suhana-adidas-ad-wins-hearts-2737469-2025-06-08",
      "headline": "Shah Rukh Khan's sweet reaction to daughter Suhana's new Instagram post wins heartsShah Rukh Khan has publicly appreciated his daughter Suhana Khan's recent pictures for Adidas India on Instagram. Suhana, who made her acting debut in 'The Archies', is set to star with her father in the upcoming film 'King'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kapil-sharma-shankar-mahadevan-light-up-aamir-khans-sitaare-zameen-par-bash-2737370-2025-06-07",
      "headline": "Kapil Sharma, Shankar Mahadevan light up Aamir Khan's Sitaare Zameen Par bashKapil Sharma shared a joyous glimpse of a private musical evening at Aamir Khan's residence, celebrating the upcoming release of 'Sitaare Zameen Par' with friends and celebrities. The event featured soulful performances and star-studded guests, including Sachin Tendulkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/eid-al-adha-2025-salman-khan-allu-arjun-and-celebs-wish-fans-eid-mubarak-2737365-2025-06-07",
      "headline": "Eid-al-Adha 2025: Salman Khan, Allu Arjun and celebs wish fans Eid MubarakOn the occasion of Eid-al-Adha 2025, Bollywood celebrities including Salman Khan, Kamal Haasan and Allu Arjun, among others, extended wishes to their fans. Take a look at the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/miley-cyrus-still-into-ex-nick-jonas-admits-being-distraught-after-breakup-2737329-2025-06-07",
      "headline": "Miley Cyrus still into ex Nick Jonas, admits being distraught after breakupMiley Cyrus opened up about her past relationship with Nick Jonas, revealing that she was deeply distraught after their breakup and struggled to move on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jamie-lever-recalls-being-sexually-harassed-during-school-college-2737298-2025-06-07",
      "headline": "Actor Jamie Lever recalls being sexually harassed during school and collegeActor Jamie Lever has shared her personal experiences of sexual harassment during her school and college years. She revealed how these incidents traumatised her and stayed with her for a long time before she found the courage to speak out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rana-daggubati-discusses-work-life-balance-amid-deepika-padukone-sandeep-reddy-vanga-row-2737290-2025-06-07",
      "headline": "Rana Daggubati discusses work-life balance amid Deepika Padukone-Sandeep Reddy rowDeepika Padukone walked out of Sandeep Vanga's 'Spirit' citing long working hours and contract issues, igniting a wider discussion on labour practices in Indian cinema. Now, actor Rana Daggubati offered insights on balancing work culture in the industries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-wants-to-make-babies-with-dua-lipa-sparks-online-outrage-2737280-2025-06-07",
      "headline": "Badshah says he wants to make babies with Dua Lipa, sparks online outrageRapper Badshah is facing backlash online following his comment about Albanian singer Dua Lipa. In a recent post on X, the rapper expressed his desire to \"have babies with her,\" sparking widespread criticism and trolling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ye-maaya-chesave-tattoo-linked-to-naga-chaitanya-2737261-2025-06-07",
      "headline": "Did Samantha remove her Ye Maaya Chesave tattoo linked to ex Naga Chaitanya?Fans were convinced that Samantha had removed all tattoos linked to her ex, Naga Chaitanya. However, her latest Instagram story - after a video showed the absence of her 'Ye Maaya Chesave' tattoo - suggested otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ekta-kapoor-balaji-telefilms-netflix-collaboration-2737252-2025-06-07",
      "headline": "Ekta Kapoor collaborates with Netflix, fans say dhoom tana meets TudumNetflix and Ekta Kapoor's Balaji Telefilms have announced a long-term partnership to create fresh, culturally rooted content for streaming audiences. The collaboration was announced on Saturday, June 7th. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-tension-meitei-outfit-arambai-tenggol-leader-internet-suspended-curfew-imphal-bishnupur-2737474-2025-06-08",
      "headline": "Manipur on edge: Protesters threaten to set themselves on fire, curfew clampedFollowing the arrest of a leader of the Meitei outfit Arambai Tenggol on Saturday night, tensions and protests erupted in several areas across five valley districts. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-election-devendra-fadnavis-rahul-gandhi-poll-rigging-election-commission-2737595-2025-06-08",
      "headline": "Rejected by people, now rejecting mandate: Fadnavis fires back at Rahul GandhiMaharashtra Chief Minister Devendra Fadnavis alleged that Congress leader Rahul Gandhi is undermining the democratic process by repeatedly making baseless allegations of poll rigging."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-stampede-police-warned-staff-crunch-crowd-surge-risk-before-rcb-felicitation-vidhana-soudha-letter-2737479-2025-06-08",
      "headline": "Karnataka cops warned of staff crunch, crowd surge risk before RCB eventA police letter issued hours before the RCB event in Bengaluru warned of inadequate security, manpower shortage, and lack of surveillance — concerns that materialised in a deadly stampede."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-journalist-khalistani-attack-mocha-bezirgan-vancouver-assault-video-2737559-2025-06-08",
      "headline": "I was surrounded, threatened: Canadian journalist alleges assault by KhalistanisIndependent Canadian journalist Mocha Bezirgan was allegedly assaulted and threatened by a group of pro-Khalistan activists in Vancouver while covering their rally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/brahmaputra-river-india-china-yarlung-tsangpo-dams-control-myth-assam-floods-hydrology-indus-waters-treaty-pakistan-2736646-2025-06-08",
      "headline": "Can China turn off India's tap, hit land formation?The life-sustaining Brahmaputra runs from China's Tibet as the Yarlung Tsangpo. Can China block or divert the flow of Tsangpo and hit India's water supply and soil formation? Pakistan was into scare-mongering after India suspended the Indus Waters Treaty. This is what experts and data say about China and the Brahmaputra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-engineer-scuba-diving-session-dubai-body-retrieved-hospital-2737593-2025-06-08",
      "headline": "Indian engineer, 29, dies during scuba diving session in DubaiA 29-year-old engineer from Kerala has died during a scuba diving session in Dubai. The victim suffered a cardiac arrest after experiencing difficulty breathing underwater, his family said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahua-moitra-wedding-dance-video-viral-pinaki-misra-berlin-2737555-2025-06-08",
      "headline": "Viral video: Newlyweds Mahua Moitra, Pinaki Misra dance to 'Raat Ke Humsafar'Trinamool Congress MP Mahua Moitra and Biju Janata Dal (BJP) leader Pinaki Misra quietly married in Berlin on May 3."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-donald-trump-physical-fight-white-house-treasury-secretary-scott-bessent-steve-bannon-us-united-states-2737448-2025-06-08",
      "headline": "Like a rugby player: Elon Musk's White House brawl was 'too much' for TrumpElon Musk and US Treasury Secretary Scott Bessent were involved in a physical fight at the White House, which played a role in the dramatic fallout between Musk and Donald Trump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-cricketer-rinku-singh-gets-engaged-to-mp-priya-saroj-in-lucknow-2737571-2025-06-08",
      "headline": "India cricketer Rinku Singh gets engaged to MP Priya Saroj in LucknowIndian cricketer Rinku Singh and Samajwadi Party MP Priya Saroj got engaged on June 8 in a grand ceremony held at The Centrum, a five-star hotel in Lucknow.  In addition to the couple's family members, several high-profile guests from the worlds of cricket and politics attended the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kota-icici-bank-relationship-manager-arrested-money-transfer-fraud-stock-market-loss-credit-card-2737538-2025-06-08",
      "headline": "Rajasthan bank manager steals Rs 4.5 crore from 110 accounts, blows it on stocksA relationship manager at an ICICI Bank branch in Kota, Sakshi Gupta, was arrested for allegedly stealing Rs 4.58 crore from over 100 accounts and investing the money in stocks, where she incurred total losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-girl-murder-body-suitcase-sexual-assault-nehru-vihar-police-case-2737464-2025-06-08",
      "headline": "Man finds body of daughter, 9, stuffed inside suitcase in locked Delhi flatThe body of a 9-year-old girl was found stuffed in a suitcase in New Delhi's Nehru Vihar, prompting a police investigation for suspected sexual assault. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-vs-carlos-alcaraz-all-you-need-to-know-about-french-open-final-2737449-2025-06-08",
      "headline": "Jannik Sinner vs Carlos Alcaraz: All you need to know about French Open final French Open: Jannik Sinner and Carlos Alcaraz will face off in the grand finale of the men's singles on Sunday, June 8. While Sinner has is looking to win his maiden title at Roland Garros, Alcaraz is aiming to successfully defend his title. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-stampede-want-to-stay-here-too-father-cries-over-grave-of-son-killed-2737435-2025-06-08",
      "headline": "Want to stay here too: Father cries over grave of son killed in Bengaluru stampedeThe video shows BT Lakshman, father of Bhumik Lakshman - one of the 11 victims who died in the stampede outside Bengaluru's M Chinnaswamy Stadium -  crying inconsolably and refusing to leave his son's grave."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-illegal-immigrants-law-tribunal-himanta-sarma-bangladeshi-citizens-2737500-2025-06-08",
      "headline": "Assam to skip tribunals, use 1950 law to deport illegal immigrants: Himanta SarmaAssam will bypass Foreigners Tribunals to deport illegal immigrants, Chief Minister Himanta Biswa Sarma said, citing a 1950 law and recent Supreme Court remarks affirming direct expulsion powers for district officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-techie-in-sweden-says-work-life-balance-is-better-there-viral-video-2737585-2025-06-08",
      "headline": "Indian techie in Sweden says work-life balance isn't a myth but the norm. Watch videoAn Indian software developer shared how Swedish workplaces prioritise flexibility, equality, and a real work-life balance in a now-viral video on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sachin-pilot-ashok-gehlot-meeting-rajesh-pilot-death-anniversary-congress-rajasthan-2737457-2025-06-08",
      "headline": "Sachin Pilot breaks ice with Ashok Gehlot after 5 years. Courtesy Rajesh PilotIn a rare gesture hinting at reconciliation, Sachin Pilot met Ashok Gehlot in Jaipur after years of acrimony, personally inviting him to a memorial for his late father Rajesh Pilot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hamraaz-sunil-dutt-br-chopra-raaj-kumar-mumtaz-a-prophecy-of-vimis-real-life-tragedy-2737385-2025-06-08",
      "headline": "Hamraaz: A prophecy of Vimi's real-life tragedy'Hamraaz' is a classic Bollywood film that blends romance, mystery, and tragedy against the backdrop of 1960s India. The movie also eerily reflects the real-life heartbreak of its lead actor Vimi, whose brief stardom was shadowed by personal turmoil and loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-494-06-06-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-claps-back-at-netflix-ceo-ted-sarandos-for-his-sacred-games-remark-2737547-2025-06-08",
      "headline": "Anurag Kashyap claps back at Netflix CEO Ted Sarandos for his Sacred Games remarkNetflix CEO Ted Sarandos reflected on 'Sacred Games' as Netflix India's first original, suggesting a more populist start could have been better, sparking backlash from co-creator Anurag Kashyap. The filmmaker shared his reaction on Instagram. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-picks-his-best-norway-chess-moment-carlsen-smile-2737466-2025-06-08",
      "headline": "Watch: Gukesh picks his best Norway Chess moment. Carlsen can't stop laughingFive-time World Champion Magnus Carlsen couldn't help but smile at Norway Chess 2025 when Indian Grandmaster D. Gukesh named his favourite moment of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/photo-gallery-how-eid-al-adha-bakrid-was-celebrated-cross-borders-saudi-arabia-india-pakistan-bangladesh-2737398-2025-06-08",
      "headline": "How Eid al-Adha was celebrated across countriesFrom prayers to the sacrifice of animals, a collection of photos shows how Eid al-Adha was celebrated in different tones across West Asia and in the Indian subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/g7-summit-india-central-to-key-supply-chains-canadas-mark-carney-on-g7-invite-to-pm-2737364-2025-06-07",
      "headline": "India must be at the table: Canadian PM amid backlash over G7 invite to ModiMark Carney's comments came after some of his political opponents in Canada criticised him for inviting Prime Minister Narendra Modi to the G7 summit in view of a probe into allegations of Indian links to the killing of a Khalistani separatist in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elder-man-suicide-slit-throat-bakrid-sacrifice-to-allah-deoria-uttar-pradesh-2737508-2025-06-08",
      "headline": "Sacrificing myself for Allah: UP man slits own throat on Bakrid, note foundA 60-year-old man in Deoria died by suicide on Bakrid, leaving a note calling himself a \"sacrifice to Allah.\"\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-update-fresh-cases-coronavirus-deaths-delhi-maharashtra-tamil-nadu-2737526-2025-06-08",
      "headline": "Covid-19 claims 4 lives in last 24 hours, active cases surge to 5,755Since January 2025, Maharashtra has recorded the highest Covid-19 death toll at 18, followed by Kerala with 12, as total active cases in India climbed to 5,755 on Sunday."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-lions-vs-india-a-day-3-live-updates-shardul-thakur-kl-rahul-karun-nair-2737597-2025-06-08",
      "headline": "England Lions vs India A Live: Shardul, Nitish in focus as India aim for comebackEngland Lions vs India A Day 3 Live: India A will aim to make a comeback with the ball on Day 3 as England Lions are sitting comfortably on 192/3 in 46 overs. The focus will be on Shardul Thakur, Tushar Deshpande, Khaleel Ahmed and others as Jordan Cox and James Rew resume the innings for England Lions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adrian-le-roux-india-strength-coach-england-test-series-2025-2737592-2025-06-08",
      "headline": "Adrian le Roux joins Team India as strength and conditioning coach in EnglandAdrian le Roux has joined the Indian men's cricket team as their new strength and conditioning coach ahead of the five-match Test series in England. Le Roux appeared in a training video shared by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-manifested-india-test-call-up-with-dukes-ball-practice-alec-stewart-2737591-2025-06-08",
      "headline": "Sai Sudharsan manifested India Test call-up with Dukes ball practice: Alec StewartFormer England cricketer Alec Stewart has revealed how Sai Sudharsan manifested his India Test call-up with Dukes ball practice at home during his County stint with Surrey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-priya-saroj-sheds-tears-of-joy-after-engagement-to-rinku-singh-2737582-2025-06-08",
      "headline": "Watch: Priya Saroj sheds tears of joy after engagement to Rinku SinghSamajwadi Party MP Priya Saroj was seen shedding tears of joy on stage after exchanging rings with Indian cricketer Rinku Singh in Lucknow on Sunday, June 8. The couple got engaged at the luxurious Centrum Hotel, with guests from both the cricketing and political circles in attendance to bless the newly engaged pair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-cricketer-rinku-singh-gets-engaged-to-mp-priya-saroj-in-lucknow-2737571-2025-06-08",
      "headline": "India cricketer Rinku Singh gets engaged to MP Priya Saroj in LucknowIndian cricketer Rinku Singh and Samajwadi Party MP Priya Saroj got engaged on June 8 in a grand ceremony held at The Centrum, a five-star hotel in Lucknow.  In addition to the couple's family members, several high-profile guests from the worlds of cricket and politics attended the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/captain-shubman-gill-rallies-team-india-in-first-practice-session-in-england-2737567-2025-06-08",
      "headline": "Watch: Captain Gill rallies team India in first practice session in EnglandTeam India engaged in an intense practice session ahead of their five-match Test series against England, set to begin from June 20. Captain Shubman Gill and his men were seen fired up during their preparations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-wife-puja-book-test-specialist-2737551-2025-06-08",
      "headline": "Cheteshwar Pujara interview: Test specialist tag was limiting, not right for meSpeaking to IndiaToday.in, Cheteshwar Pujara and his wife shared their thoughts on the highs and lows of his career, the 'Test specialist' tag, and the inspiration behind the book The Diary of a Cricketer's Wife: A Very Unusual Memoir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mauricio-pochettino-denies-tottenham-return-rumours-spurs-search-new-manager-2737530-2025-06-08",
      "headline": "Pochettino denies Tottenham return rumours as Spurs seek new bossUSA head coach Mauricio Pochettino has downplayed rumours linking him with the vacant managerial position at his former club, Tottenham Hotspur, following the sacking of Ange Postecoglou on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-racers-yuven-shriya-jehan-arjun-global-motorsport-success-2737511-2025-06-08",
      "headline": "Top 5 rising Indian stars redefining the world of international motor racingA new wave of Indian talent is redefining what global motorsport success looks like. Drivers like Yuven Sundaramoorthy, Shriya Lohia, and Jehan Daruvala are breaking barriers and challenging conventions on international circuits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-on-virat-kohli-and-rohit-sharmas-absence-in-england-2737509-2025-06-08",
      "headline": "It's a shame that Virat and Rohit won't be playing Test series: Chris WoakesEngland all-rounder Chris Woakes recalled his battles with Virat Kohli and Rohit Sharma in England and said that it's a shame that the duo won't be a part of the upcoming series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-fitness-form-australia-south-africa-wtc-final-lords-2737505-2025-06-08",
      "headline": "Can we play tomorrow? Steve Smith ready for WTC Final vs South AfricaSteve Smith has taken a rare break from cricket to prepare for the WTC final against South Africa. His improved fitness and form make him a crucial player for Australia's title defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-interview-wife-puja-book-test-specialist-2737551-2025-06-08",
      "headline": "Cheteshwar Pujara interview: Test specialist tag was limiting, not right for meSpeaking to IndiaToday.in, Cheteshwar Pujara and his wife shared their thoughts on the highs and lows of his career, the 'Test specialist' tag, and the inspiration behind the book The Diary of a Cricketer's Wife: A Very Unusual Memoir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mauricio-pochettino-denies-tottenham-return-rumours-spurs-search-new-manager-2737530-2025-06-08",
      "headline": "Pochettino denies Tottenham return rumours as Spurs seek new bossUSA head coach Mauricio Pochettino has downplayed rumours linking him with the vacant managerial position at his former club, Tottenham Hotspur, following the sacking of Ange Postecoglou on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-racers-yuven-shriya-jehan-arjun-global-motorsport-success-2737511-2025-06-08",
      "headline": "Top 5 rising Indian stars redefining the world of international motor racingA new wave of Indian talent is redefining what global motorsport success looks like. Drivers like Yuven Sundaramoorthy, Shriya Lohia, and Jehan Daruvala are breaking barriers and challenging conventions on international circuits. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-on-virat-kohli-and-rohit-sharmas-absence-in-england-2737509-2025-06-08",
      "headline": "It's a shame that Virat and Rohit won't be playing Test series: Chris WoakesEngland all-rounder Chris Woakes recalled his battles with Virat Kohli and Rohit Sharma in England and said that it's a shame that the duo won't be a part of the upcoming series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-fitness-form-australia-south-africa-wtc-final-lords-2737505-2025-06-08",
      "headline": "Can we play tomorrow? Steve Smith ready for WTC Final vs South AfricaSteve Smith has taken a rare break from cricket to prepare for the WTC final against South Africa. His improved fitness and form make him a crucial player for Australia's title defence."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}