{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chennai-mysore-darbhanga-bagmati-express-collision-accident-tamil-nadu-derailment-fire-2615690-2024-10-12",
      "headline": "Tamil Nadu train accident: 19 injured, probe on, restoration to take 16 hoursThe stranded passengers of the Mysuru-Darbhanga Bagmati Express were transferred to another special train on Saturday morning, after the train's collision on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-global-statesman-fareed-zakaria-ukraine-war-mediation-2615642-2024-10-11",
      "headline": "Two who can broker Ukraine-Russia peace, Modi more than Erdogan: Fareed ZakariaIn a conversation with India Today TV's Consulting Editor Rajdeep Sardesai, geopolitical expert Fareed Zakaria suggested that mediating the Russia-Ukraine war is PM Modi's \"great opportunity to be a global statesman\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-rebuts-justin-trudeau-brief-exchange-pm-modi-summit-canadians-safety-khalistani-no-substantive-discussion-2615730-2024-10-12",
      "headline": "India says 'no substantive discussion' between PM Modi and Trudeau in LaosIndia said there was no substantive discussion between PM Modi and Justin Trudeau on the sidelines of the ASEAN summit after the Canadian Prime Minister claimed he raised concerns over the \"safety of Canadians\" in a brief exchange with PM Modi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/decoding-haryana-poll-conundrum-how-congress-lost-despite-similar-vote-share-bjp-2615699-2024-10-12",
      "headline": "Decoding Haryana poll conundrum: How Congress lost despite similar vote share to BJPHaryana was a close election with BJP marginally ahead of Congress by less than one per cent vote share. However, the saffron party romped home comfortably. How did Congress end up on the losing side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/how-instagram-made-charms-a-bigger-flex-than-your-fancy-luxury-bag-2615360-2024-10-12",
      "headline": "How Instagram made charms a bigger flex than your fancy luxury bagExperts suggest that bag charms provide an accessible entry into the world of luxury, as many choose these accessories to add a touch of high-end style to their bags without the hefty price tag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohan-bhagwat-rss-headquarters-vijayadashami-bangladesh-rg-kar-medical-college-kashmir-israel-hamas-2615731-2024-10-12",
      "headline": "Dharm, not religion is life and inspiration of India: RSS chief Mohan BhagwatRSS chief Mohan Bhagwat said that the 'Hindu Dharm' is not something newly discovered or created, but something recognised as belonging to all humanity, making it a religion for the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tmk-comments-on-ms-subbulakshmi-award-2024-chennai-music-academy-sangitha-kalanidhi-2615239-2024-10-11",
      "headline": "MS Subbulakshmi troll TM Krishna accepts award named after her. Hypocrisy?This year's Sangitha Kalanidhi awardee TM Krishna has made several unsavoury remarks over the years on Carnatic music legend MS Subbulakshmi. Her grandson moved court against him automatically getting the MS Subbulakshmi Award, because of the Music Academy's accolade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-jigra-the-unstoppable-force-of-bollywood-2615121-2024-10-12",
      "headline": "Alia Bhatt: The Unstoppable Force of BollywoodWhat makes Alia Bhatt one of the finest performers in India? What kind of legacy is she creating in the film industry? India Today Digital spoke to the filmmakers and actors who have worked with her to understand the phenomenon that she is. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mp-rahul-gandhi-slams-centre-over-mysuru-darbhanga-train-accident-balasore-accident-no-lessons-learned-2615732-2024-10-12",
      "headline": "No lessons learned: Rahul Gandhi slams Centre over Mysuru-Darbhanga train accidentDrawing parallels to the tragic Balasore accident, which claimed the lives of nearly 300 passengers, the Congress MP said that the government has failed to learn from past incidents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-prisonbreak-inmates-climb-wall-using-lungis-blankets-bedsheets-morigaon-district-jail-2615734-2024-10-12",
      "headline": "In Assam prisonbreak, 5 inmates climb 20-foot wall using lungis, blanketsFive prisoners jailed under the Pocso Act escaped from Assam's Morigaon District Jail on Friday night by scaling a 20-foot wall using lungis, bedsheets and blankets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/whats-behind-bengals-devotion-to-maa-durga-a-festival-of-devotion-and-celebration-2615020-2024-10-10",
      "headline": "What's behind Bengal's devotion to Maa Durga: A festival of devotion and celebrationDurga Puja is more than just a religious festival, it's a vibrant celebration of art, culture, and feminine power. Join Manish Adhikary in this episode of The Culture Project as we explore the history, mythology, and modern-day spectacle of Durga Puja in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-auction-twitter-post-delhi-capitals-retentions-2615694-2024-10-12",
      "headline": "Rishabh Pant's midnight 'IPL auction' post has DC fans sweatingDelhi Capitals captain Rishabh Pant's latest social media post might have the franchise sweating. In a late-night tweet on Friday, Pant wondered for how much money he would be sold if he were to put his name in the IPL 2025 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/parsis-india-sugar-in-milk-story-persia-gujarat-sanjan-hindu-king-ratan-tata-2615043-2024-10-11",
      "headline": "A tale of sugar and milk: How Parsis found a home in IndiaIn the 8th century, a group of Zoroastrians, fleeing persecution in Persia (modern-day Iran), arrived at the coast of Gujarat, seeking refuge. The Indian King of Sanjan allowed the strangers to stay on his land. The migrants promised to blend in, like sugar in milk, which has been the hallmark of their relationship with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-new-zealand-ind-vs-nz-tests-2615616-2024-10-11",
      "headline": "Jasprit Bumrah named vice-captain in India's 15-man squad for New Zealand seriesBCCI (Board of Control for Cricket in India) announced a 15-member squad for the three-match Test series against New Zealand set to begin from October 17. Jasprit Bumrah has been named the vice-captain of the Test team."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/gurugram-firing-incident-man-couple-thieves-opens-fire-parking-dispute-2615679-2024-10-12",
      "headline": "Man calls couple 'thieves', opens fire over parking dispute in GurugramA dispute over parking space turned into a physical altercation when a man in Gurugram opened fire at a young couple after calling them \"thieves\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/alia-bhatt-to-rhea-chakraborty-celebs-grace-durga-puja-pandal-in-mumbai-2615561-2024-10-11",
      "headline": "Alia Bhatt to Rhea Chakraborty, celebs grace Durga Puja Pandal in Mumbai To celebrate Mahashtami and Navami (the eighth and ninth days of Durga Puja celebrations) on October 11, Bollywood celebrities including Alia Bhatt, Jaya Bachchan, Rhea Chakraborty, and Sharvari Wagh, among others, graced the puja pandal with their presence.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-entertainment-sports-425-11-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-charan-adopted-wild-elephant-raha-kapoor-name-alia-bhatt-2615710-2024-10-12",
      "headline": "Ram Charan adopted a wild elephant in Raha Kapoor's name, says Alia BhattAlia Bhatt disclosed that Ram Charan adopted an elephant in her daughter Raha's name. He also gifted her a wooden elephant toy. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/geopolitical-expert-fareed-zakaria-west-asia-war-israel-iran-hezbollah-lebanon-houthis-2615555-2024-10-11",
      "headline": "Fareed Zakaria explains why West Asia is facing 'real moment of danger'Speaking to India Today TV's Consulting Editor Rajdeep Sardesai, Zakaria said the focus has shifted from Israel's war in Gaza after the Jewish nation decided to go after the Iran-backed militant outfits in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/the-price-of-expertise-are-expert-committees-a-burden-on-the-taxpayer-2615719-2024-10-12",
      "headline": "The price of expertise: Are 'expert committees' a burden on the taxpayer?A frequent criticism of expert committees is the significant time and cost involved. Neither the Commission of Inquiry Act nor the rules framed under it specify the expenses for the functioning of such committees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jigra-box-office-collection-day-1-detailed-report-alia-bhatt-film-opens-at-rs-4-crore-can-dussehra-help-2615733-2024-10-12",
      "headline": "Jigra box office Day 1: Alia Bhatt's film opens at Rs 4 crore, can Dussehra help?Alia Bhatt and Vedang Rana's Jigra opened in the range of Rs 4 crore nett in India. The film is a prison-break thriller and Dussehra is now expected to help grow the business on Saturday and Sunday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-death-penalty-migrants-who-kill-americans-2615688-2024-10-12",
      "headline": "Trump calls for death penalty for migrants who kill Americans Donald Trump said he would launch a national \"Operation Aurora\" to target members of the Venezuelan gang Tren de Aragu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/raat-jawaan-hai-review-a-heartwarming-and-relatable-take-on-parenting-chaos-2615680-2024-10-12",
      "headline": "Raat Jawaan Hai review: Series brings joy and chaos of parenting to lifeReleased-Fri Oct 11, 2024Raat Jawaan Hai Review: Starring Barun Sobti, Anjali Anand and Priya Bapat, this comedy series captures the chaos and humour of modern parenting. With authentic characters and relatable moments. It explores the challenges and joys of raising children, all while keeping friendship at its core. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-vidya-ka-woh-wala-video-box-office-collection-day-1-detailed-report-decent-opening-for-rajkummar-rao-film-ahead-of-dussehra-2615744-2024-10-12",
      "headline": "Vicky Vidya Ka Woh Wala Video box office day 1: Decent opening ahead of DussehraVicky Vidya Ka Woh Wala Video is a family-friendly film, which could just emerge as the biggest success during the Dussehra weekend. The film has already opened beyond expectations at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-vivian-dsena-slam-chaahat-pandey-throwing-food-shehzada-dhami-2615739-2024-10-12",
      "headline": "Bigg Boss 18: Vivian Dsena schools Chaahat Pandey for throwing food In the latest episode of Bigg Boss 18, Chaahat Pandey was slammed by Vivian Dsena after she purposely threw fruits at Rajat Dalal and Shehzada Dhami. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/tejasswi-prakash-karan-kundrra-celebrate-his-birthday-with-long-drive-cake-crazy-dance-2615735-2024-10-12",
      "headline": "Tejasswi-Karan celebrate his birthday with long drive, cake, crazy dance  Karan Kundrra celebrated his birthday with his girlfriend Tejasswi Prakash in the most special way. Tejasswi shared a heartwarming video from their intimate birthday celebration. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/raat-jawaan-hai-review-a-heartwarming-and-relatable-take-on-parenting-chaos-2615680-2024-10-12",
      "headline": "Raat Jawaan Hai review: Series brings joy and chaos of parenting to lifeReleased-Fri Oct 11, 2024Raat Jawaan Hai Review: Starring Barun Sobti, Anjali Anand and Priya Bapat, this comedy series captures the chaos and humour of modern parenting. With authentic characters and relatable moments. It explores the challenges and joys of raising children, all while keeping friendship at its core. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-tesla-humanoid-optimus-says-hardest-part-of-being-a-robot-is-trying-to-be-human-2615330-2024-10-11",
      "headline": "Elon Musk's Tesla humanoid Optimus reveals hardest part of being a robotElon Musk unveiled the latest generation of Tesla's humanoid Optimus at the We, Robot event. While according to Musk, the robots can now do anything, Optimus reveals that the hardest part of being a robot is learning how to be human. Read on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/star-health-insurance-hack-led-to-personal-data-of-31-million-customers-being-compromised-story-in-5-points-2615354-2024-10-11",
      "headline": "Star Health hack led to data leak of 31 million customers: Story in 5 pointsIndia's popular health insurers, Star Health insurance, faced a massive data leak this week, which may have led to the data of 31 million customers being compromised. Here is everything that has happened in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/video/how-to-get-new-siri-with-apple-intelligence-in-india-first-look-at-ios-181-more-features-2615301-2024-10-11",
      "headline": "How to get new Siri with Apple Intelligence in India? First look at iOS 18.1 & more featuresApple has released the latest developer Beta for iOS 18.1, showcasing some new features like the new Siri, Writing Tools and more. Watch the video to know more. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-t20-world-cup-final-knee-injury-acting-reveals-physio-hilarious-event-2615749-2024-10-12",
      "headline": "Told physio I was acting: Pant opens up on T20 World Cup injury anticsRishabh Pant revealed he faked an injury during India's 2024 T20 World Cup final, a cheeky act that slowed South Africa's momentum, showcasing not just his cricketing skills but his quick thinking and quirky personality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-india-head-coach-gautam-gambhir-criticised-for-promoting-betting-app-2615745-2024-10-12",
      "headline": "India head coach Gautam Gambhir criticised for promoting betting appGautam Gambhir was criticised for advertising an online fantasy cricket app. Many called out Gambhir for promoting a 'betting app' despite being the head coach of the Indian cricket team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-ashleigh-gardner-australia-vs-india-personal-challenge-2615742-2024-10-12",
      "headline": "Australia's Ashleigh Gardner ready for 'personal challenge' against IndiaAustralia's Ashleigh Gardner anticipates a tough challenge against India in their Women's T20 World Cup clash, highlighting the competitive edge India brings, especially after her experience playing alongside Indian stars in the Women's Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-ipl-auction-retentions-2615729-2024-10-12",
      "headline": "Never pulled out after action, but Test cricket still No.1 priority: CumminsAustralia Test and ODI captain Pat Cummins reacted to the new IPL rules by stating that he had never pulled out after an auction. According to the new rules if an overseas player pulls out after getting sold in the auction they incur a ban of 2 years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hong-kong-sixes-robin-uthappa-captain-kedar-jadhav-team-india-full-squad-announcement-2615727-2024-10-12",
      "headline": "India squad for Hong Kong Sixes announced, Uthappa named captainRobin Uthappa will captain India in the Hong Kong Sixes 2024, leading a team of experienced cricketers, including Kedar Jadhav and Manoj Tiwary. India is set to face Pakistan in a highly anticipated Pool C clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-pakistan-embarrassing-batting-muneeba-ali-vs-australia-criticism-2615725-2024-10-12",
      "headline": "Our batting was embarrassing: Pakistan's Muneeba Ali after Australia lossPakistan's acting skipper Muneeba Ali called her team's batting performance \"embarrassing\" after their crushing 9-wicket loss to Australia in the Women's T20 World Cup. Ali stressed the need for improvement to compete at the highest level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-series-bgt-pat-cummins-2615720-2024-10-12",
      "headline": "Pat Cummins expecting another closely-fought Test series vs IndiaAUS vs IND: Australia Test captain Pat Cummins is expecting another closely fought Test series against India. The last time India visited Australia, the series was decided in the final session of the last Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikhat-zareen-paris-olympics-2615713-2024-10-12",
      "headline": "Nikhat Zareen opens up on Olympics heartbreak: Boxers I had defeated won medalsBoxer Nikhat Zareen revealed that she was gutted to not win a medal at the Paris Olympics 2024. Nikhat said that it really hurt her when she watched other boxers, who she had defeated in the past, win a medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-preview-prediction-playing-xi-hyderabad-weather-update-pitch-report-2615708-2024-10-12",
      "headline": "3rd T20I: Sanju Samson, Harshit Rana in focus as India eye clean sweepIndia vs Bangladesh: India go into the 3rd T20I with an aim to clean sweep Bangladesh. Harshit Rana is expected to make his debut for India in this game. Focus will be on Sanju Samson as well who is still looking to cement his place in the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-hyderabad-weather-update-rain-prediction-2615703-2024-10-12",
      "headline": "Will rain play spoilsport as India eye clean sweep in Hyderabad?India vs Bangladesh: India are eyeing a clean sweep against Bangladesh in the 3rd and final match of the T20I series. However, the play could be heavily marred by rainfall in Hyderabad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-auction-twitter-post-delhi-capitals-retentions-2615694-2024-10-12",
      "headline": "Rishabh Pant's midnight 'IPL auction' post has DC fans sweatingDelhi Capitals captain Rishabh Pant's latest social media post might have the franchise sweating. In a late-night tweet on Friday, Pant wondered for how much money he would be sold if he were to put his name in the IPL 2025 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-series-bgt-pat-cummins-2615720-2024-10-12",
      "headline": "Pat Cummins expecting another closely-fought Test series vs IndiaAUS vs IND: Australia Test captain Pat Cummins is expecting another closely fought Test series against India. The last time India visited Australia, the series was decided in the final session of the last Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikhat-zareen-paris-olympics-2615713-2024-10-12",
      "headline": "Nikhat Zareen opens up on Olympics heartbreak: Boxers I had defeated won medalsBoxer Nikhat Zareen revealed that she was gutted to not win a medal at the Paris Olympics 2024. Nikhat said that it really hurt her when she watched other boxers, who she had defeated in the past, win a medal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-preview-prediction-playing-xi-hyderabad-weather-update-pitch-report-2615708-2024-10-12",
      "headline": "3rd T20I: Sanju Samson, Harshit Rana in focus as India eye clean sweepIndia vs Bangladesh: India go into the 3rd T20I with an aim to clean sweep Bangladesh. Harshit Rana is expected to make his debut for India in this game. Focus will be on Sanju Samson as well who is still looking to cement his place in the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-3rd-t20i-hyderabad-weather-update-rain-prediction-2615703-2024-10-12",
      "headline": "Will rain play spoilsport as India eye clean sweep in Hyderabad?India vs Bangladesh: India are eyeing a clean sweep against Bangladesh in the 3rd and final match of the T20I series. However, the play could be heavily marred by rainfall in Hyderabad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-ipl-auction-twitter-post-delhi-capitals-retentions-2615694-2024-10-12",
      "headline": "Rishabh Pant's midnight 'IPL auction' post has DC fans sweatingDelhi Capitals captain Rishabh Pant's latest social media post might have the franchise sweating. In a late-night tweet on Friday, Pant wondered for how much money he would be sold if he were to put his name in the IPL 2025 auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-engages-in-fun-gully-cricket-match-batting-leke-chala-jata-hoo-2615660-2024-10-11",
      "headline": "Rishabh Pant engages in fun gully cricket match: Batting leke chala jata hooIndia wicketkeeper batter Rishabh Pant was seen playing a fun gully cricket game with a few fans where he was seen as his usual chirpy self and played some outrageous shots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-tayla-vlaeminck-injury-australia-vs-pakistan-2615661-2024-10-11",
      "headline": "Healy walks off retired hurt as Australia suffer double injury scareWomen's T20 World Cup 2024: Alyssa Healy and Tayla Vlaeminck sustained injuries in the match against Pakistan, making them uncertain for the clash against India on Sunday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-not-named-for-new-zealand-tests-raises-concerns-for-australia-tour-2615645-2024-10-11",
      "headline": "Mohammed Shami not named for New Zealand Tests, raises concerns for Australia tourIndia fast bowler Mohammed Shami failed to make it to the 15-member squad for the upcoming three-match Test series against New Zealand raising further concerns on his fitness ahead of Australia Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mayank-yadav-test-series-2615644-2024-10-11",
      "headline": "Mayank, Nitish named among four reserves for New Zealand Test seriesIND vs NZ: After their impressive performances in the T20I series against Bangladesh, Mayank Yadav and Nitish Reddy were picked as travelling reserves for the Tests against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tests-jasprit-bumrah-pat-cummins-2615624-2024-10-11",
      "headline": "Bumrah vs Cummins: Fans speculate fiery battle after pacer named vice-captain IND vs NZ: Jasprit Bumrah has been named as the vice-captain for the Test series against New Zealand. Fans speculated that Bumrah might lead India in the Perth Test against Australia if Rohit Sharma pulls out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-new-zealand-ind-vs-nz-tests-2615616-2024-10-11",
      "headline": "Jasprit Bumrah named vice-captain in India's 15-man squad for New Zealand seriesBCCI (Board of Control for Cricket in India) announced a 15-member squad for the three-match Test series against New Zealand set to begin from October 17. Jasprit Bumrah has been named the vice-captain of the Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-chris-woakes-expecting-pakistan-to-prepare-result-wickets-for-remaining-tests-2615597-2024-10-11",
      "headline": "Chris Woakes expecting Pakistan to prepare 'result wickets' for remaining TestsEngland all-rounder Chris Woakes has said that Pakistan could prepare result-oriented wickets after losing the first Test by a massive margin of an innings and 47 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-alyssa-healy-muneeba-ali-report-dubai-2615587-2024-10-11",
      "headline": "Australia all but through to semis with crushing win vs PakistanWomen's T20 World Cup 2024: Alyssa Healy's Australia put in another strong showing, beating Muneeba Ali's Pakistan by nine wickets on Friday at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tests-jasprit-bumrah-pat-cummins-2615624-2024-10-11",
      "headline": "Bumrah vs Cummins: Fans speculate fiery battle after pacer named vice-captain IND vs NZ: Jasprit Bumrah has been named as the vice-captain for the Test series against New Zealand. Fans speculated that Bumrah might lead India in the Perth Test against Australia if Rohit Sharma pulls out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-india-vs-new-zealand-ind-vs-nz-tests-2615616-2024-10-11",
      "headline": "Jasprit Bumrah named vice-captain in India's 15-man squad for New Zealand seriesBCCI (Board of Control for Cricket in India) announced a 15-member squad for the three-match Test series against New Zealand set to begin from October 17. Jasprit Bumrah has been named the vice-captain of the Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-eng-chris-woakes-expecting-pakistan-to-prepare-result-wickets-for-remaining-tests-2615597-2024-10-11",
      "headline": "Chris Woakes expecting Pakistan to prepare 'result wickets' for remaining TestsEngland all-rounder Chris Woakes has said that Pakistan could prepare result-oriented wickets after losing the first Test by a massive margin of an innings and 47 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-alyssa-healy-muneeba-ali-report-dubai-2615587-2024-10-11",
      "headline": "Australia all but through to semis with crushing win vs PakistanWomen's T20 World Cup 2024: Alyssa Healy's Australia put in another strong showing, beating Muneeba Ali's Pakistan by nine wickets on Friday at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laura-wolvaardt-south-africa-virat-kohli-picture-video-2615547-2024-10-11",
      "headline": "Watch: Wolvaardt signs memorable picture with 'favourite player' Kohli Women's T20 World Cup 2024: Laura Wolvaardt signed an old picture of her with India's Virat Kohli. Wolvaardt is currently the top run-scorer in the multi-nation tournament in the UAE with a top score of 59 not out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/basit-ali-accuses-pakistan-cricket-board-of-fooling-fans-after-first-test-loss-vs-england-2615541-2024-10-11",
      "headline": "Basit Ali accuses Pakistan Board of fooling fans after first Test loss vs EnglandFormer Pakistan cricketer Basit Ali has ripped apart the Pakistan Cricket Board and the team management for making a fool of their fans after massive defeat in the first Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/hardik-pandya-delhi-india-ryan-ten-doeschate-press-conference-2615537-2024-10-11",
      "headline": "Hardik Pandya not bowling in Delhi a testament to India's depth: Ryan ten DoeschateIND vs BAN, 3rd T20I: In the pre-match press conference, assistant coach Ryan ten Doeschate said that Hardik Pandya not bowling in the second T20I in Delhi showed the depth that the Indian team has in their bowling department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/novak-djokovic-on-rafael-nadals-retirement-andy-murray-roger-federer-2615536-2024-10-11",
      "headline": "A big part of me left with Federer, Murray, & Nadal's retirement: Novak DjokovicTennis Legend Novak Djokovic revealed that a big part of him left following the retirements of his long time rivals namely Roger Federer, Andy Murray and Rafael Nadal."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}