{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-itr-refund-here-is-how-to-track-it-2789924-2025-09-19",
      "headline": "Waiting for your ITR refund? Here is how to track itAfter filing your ITR, the next big question is, when will the refund come? Instead of guessing, you can quickly check the progress on the official portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-down-why-is-the-stock-market-down-today-2789941-2025-09-19",
      "headline": "Sensex tumbles 500 points: Is the stock market rally over?Around midday, the S&P BSE Sensex was down 471.67 points, settling at 82,542.29, while the NSE Nifty50 declined 130.20 points to 25,293.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/does-the-income-tax-department-delay-refunds-above-rs-50000-2789891-2025-09-19",
      "headline": "Does the Income Tax Department delay refunds above Rs 50,000?With the ITR deadline now behind us, many taxpayers are anxiously waiting for their refunds. A common doubt is whether larger refunds, such as those above Rs 50,000, take longer to arrive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-from-september-22-why-you-should-double-check-product-mrps-2789858-2025-09-19",
      "headline": "New GST rates from September 22: Why you should double-check product MRPsConsumers must remain alert as new GST rates take effect September 22; checking MRPs carefully ensures savings are realised, avoiding overpayment due to old pricing or retailer confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/adani-power-in-focus-as-sebi-clean-chit-sparks-fresh-rally-in-adani-group-stocks-2789834-2025-09-19",
      "headline": "Adani Power in focus as Sebi clean chit sparks fresh rally in Adani Group stocksAdani Power's move stood out, as analysts see strong momentum beyond the short-term sentiment boost. Global brokerage Morgan Stanley has initiated coverage with an 'Overweight' rating and a target price of Rs 818 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-stocks-jump-after-sebi-clean-chit-in-hindenburg-case-check-details-2789807-2025-09-19",
      "headline": "Adani stocks jump up to 10 % after Sebi clean chit in Hindenburg caseThe gains were broad-based across the group's listed entities. Adani Total Gas led the rally, soaring 10% on the BSE. Adani Power climbed 7%, while flagship Adani Enterprises advanced nearly 5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-150-points-nifty-below-25400-adani-group-stocks-jump-2789793-2025-09-19",
      "headline": "Sensex down over 150 points, Nifty below 25,400; Adani Group stocks jumpThe S&P BSE Sensex was down by 260.39 points to 82,753.5, while the NSE Nifty50 lost 56.95 points to 25,366.65 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-new-features-launched-pf-transfers-made-easier-passbook-lite-key-details-2789790-2025-09-19",
      "headline": "PF transfers to become easier: Here's what's changing for employeesThe Employees' Provident Fund Organisation (EPFO) has now introduced two reforms aimed at tackling these bottlenecks. First, it has launched a Passbook Lite feature within the Member Sewa portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-launches-passbook-lite-big-changes-in-pf-portal-check-features-how-it-helps-members-2789787-2025-09-19",
      "headline": "EPFO launches Passbook Lite: Check features, how it helps membersUntil now, employees had to log in to a separate Passbook Portal to see details of contributions and withdrawals. With the launch of Passbook Lite, members can now access this information directly on the EPFO Member Portal, using just one login."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-dismisses-hindenburgs-allegations-against-adani-group-chairman-gautam-adani-news-agency-pti-2789559-2025-09-18",
      "headline": "Adani Group gets clean chit from Sebi over Hindenburg claimsHindenburg Research had alleged that four Adani group companies lent Rs 6.2 billion ($87.4 million) in 2020, without properly disclosing it in financial statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-own-a-credit-card-without-a-bank-account-find-out-2789413-2025-09-18",
      "headline": "Can you own a credit card without a bank account? Find outYou don't always need a savings account to apply for a credit card; new digital options are changing the rules. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-fed-rate-cut-and-tariff-relief-setting-up-a-market-rally-2789488-2025-09-18",
      "headline": "Are Fed rate cut and tariff relief setting up a market rally?A softer stance from the US Federal Reserve and the possibility of reduced reciprocal tariffs have lifted investor mood. The big question now: are these triggers enough to set off a sustained rally in Indian markets?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-confirmed-for-season-3-filming-to-begin-in-2026-2789938-2025-09-19",
      "headline": "Daredevil Born Again confirmed for Season 3, filming to begin in 2026Marvel fans in India can rejoice as 'Daredevil: Born Again' is confirmed for a third season on Disney+. The filming starts in early 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-confirms-relationship-with-rahul-mody-shares-adorable-video-2789926-2025-09-19",
      "headline": "Shraddha Kapoor confirms relationship with Rahul Mody, shares adorable videoShraddha Kapoor confirmed her relationship with writer Rahul Mody through a playful Instagram video, finally ending months of speculation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-yash-wraps-45-day-mumbai-schedule-heads-to-bengaluru-for-final-leg-2789911-2025-09-19",
      "headline": "Toxic: Yash wraps 45-day Mumbai schedule, heads to Bengaluru for final legYash's much-anticipated film 'Toxic: A Fairytale for Grown-ups' has completed its challenging Mumbai schedule, marking a significant phase in its six-month shoot. The production now moves to Bengaluru for the final leg. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/robo-shankar-death-cause-multiple-organ-failure-gastrointestinal-bleed-2789907-2025-09-19",
      "headline": "What is the cause of Tamil actor Robo Shankar's death at 46?Tamil comedy actor Robo Shankar died at the age of 46 on Thursday. He is survived by his wife, daughter, son-in-law and grandson. The actor collapsed on a set on September 16 and was rushed to a private hospital in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-javed-akhtar-dance-to-pretty-little-baby-2789890-2025-09-19",
      "headline": "Shabana Azmi-Javed Akhtar's dance to Pretty Little Baby wins internet, now viralShabana Azmi celebrated her 75th birthday with a heartwarming dance with her husband Javed Akhtar, leaving guests and fans delighted. The star-studded evening saw Bollywood celebrities cheering as the legendary couple stole the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pawan-singh-exit-rise-and-fall-reality-show-speculation-controversy-2789864-2025-09-19",
      "headline": "Pawan Singh makes sudden exit from Rise & Fall: ReportBhojpuri actor and singer Pawan Singh has left the show 'Rise & Fall', marking the programme's second major exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nishaanchi-review-anurag-kashyap-undoes-gangs-of-wasseypur-only-to-overdo-new-film-2789862-2025-09-19",
      "headline": "Nishaanchi review: A punchy potboiler weighed down by Anurag Kashyap's indulgenceRelease Date:Fri Sep 19, 2025Anurag Kashyap's 'Nishaanchi' offers a colourful mix of drama, humour and strong performances. The film's overindulgence and familiar tropes may divide audiences, but a sequel promises more twists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-claps-back-at-tan-jokes-after-bads-of-bollywood-event-2789857-2025-09-19",
      "headline": "I'm a fan of the tan: Ananya Panday reacts to her viral look from Ba***ds screeningAnanya Panday's return from the Maldives grabbed attention not just for her holiday pictures but for her striking tan that sparked lively conversations on social media. Embracing the banter with humour, she confidently shone at the Netflix premiere of 'The Bads of Bollywood' in Mumbai, winning hearts with her charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rapper-arivu-responds-backlash-vedan-collaboration-sexual-abuse-allegations-2789831-2025-09-19",
      "headline": "Rapper Arivu reacts to backlash over Vedan collab amid sexual abuse allegationsRapper Arivu responded to criticism after collaborating with Vedan, who is facing multiple sexual abuse accusations. Social media users criticise Arivu and director Mari Selvaraj for platforming Vedan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jolly-llb-3-movie-review-akshay-kumar-arshad-warsi-bring-charm-but-saurabh-shukla-owns-the-courtroom-2789835-2025-09-19",
      "headline": "Jolly LLB 3 review: Akshay-Arshad bring charm but Saurabh Shukla owns the courtroomRelease Date:Fri Sep 19, 2025Jolly LLB 3 review: Akshay Kumar and Arshad Warsi deliver entertaining performances in Subhash Kapoor's courtroom drama, but it's Saurabh Shukla as Judge Tripathi who steals the show. A witty mix of satire, comedy, and social commentary, the film balances laughs with a hard-hitting story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jimmy-fallon-reacts-jimmy-kimmel-live-suspended-abc-fcc-pressure-charlie-kirk-controversy-2789817-2025-09-19",
      "headline": "Jimmy Fallon reacts indefinite suspension of Jimmy Kimmel's late-night showJimmy Fallon has responded after ABC suspended Jimmy Kimmel's show indefinitely following FCC pressure. Fallon's reaction highlights concerns about censorship and uncertainty in late-night television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-finale-streams-movie-sequel-delayed-2789795-2025-09-19",
      "headline": "Summer I Turned Pretty creator addresses finale, Paris scenes and movie plans'The Summer I Turned Pretty' series creator Jenny Han opened up about the timeline and development of the upcoming film. Han clarified speculation about hidden clues and episode counts in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-wraps-battle-of-galwan-filming-ladakh-45-day-schedule-2789805-2025-09-19",
      "headline": "Salman Khan wraps Battle of Galwan shoot in 45 days, returns to Mumbai clean-shavenSalman Khan has completed the intense 45-day shoot of 'Battle of Galwan' in Leh, Ladakh, shedding his moustache post-filming to reveal a fresh look. The film, directed by Apoorva Lakhia, portrays the 2020 Galwan Valley clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/robo-shankar-dies-at-46-udhayanidhi-vijay-sethupathi-and-celebs-remember-actor-2789794-2025-09-19",
      "headline": "Robo Shankar dies at 46: Udhayanidhi, Vijay Sethupathi and celebs remember actorTamil comedy actor Robo Shankar died at the age of 46, a day after collapsing on the film set. Udhayanidhi Stalin, Vijay Sethupathi, Karthi and many actors offered condolences to his family. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-recalls-early-acting-days-says-wore-film-costumes-to-promotions-rwdy-apparel-2789779-2025-09-19",
      "headline": "Vijay Deverakonda recalls early acting days, says wore film costumes to promotionsVijay Deverakonda reflected on his humble beginnings at the 'Little Hearts' success meet, sharing how he once struggled to afford basic clothes. The actor expressed pride in the film's success at the bash on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-75th-birthday-bollywood-dance-party-2789780-2025-09-19",
      "headline": "Rekha, Madhuri, Vidya groove to Kaisi Paheli with Shabana Azmi on her birthdayActors Rekha, Madhuri Dixit and Vidya Balan set the dance floor on fire at Shabana Azmi's 75th birthday celebration. Videos of the event, including stars congratulating Azmi, have gone viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-padukone-kalki-2-dropped-role-reduced-to-a-cameo-2789764-2025-09-19",
      "headline": "Deepika Padukone quit Kalki 2 after her role was reduced to a cameo: SourceDeepika Padukone exited 'Kalki 2898 AD's sequel after her role was reduced significantly. On September 18, the makers, in an X post, wrote that a project like 'Kalki' requires a certain level of commitment and announced that they had parted ways with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-reasons-why-they-call-him-og-became-pawan-kalyans-most-anticipated-film-2789301-2025-09-19",
      "headline": "OG fever: How Pawan Kalyan's film created real buzz in era of fake hypeFrom a viral teaser to stylish stunts and Thaman's music, 'They Call Him OG' has created genuine excitement that goes beyond fan hype, positioning Pawan Kalyan for a big-screen comeback this September 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-review-kajol-courtroom-drama-legal-cases-political-conflict-2789636-2025-09-19",
      "headline": "The Trial Season 2 review: Kajol's legal drama settles out of courtroomRelease Date:Fri Sep 19, 2025The Trial Season 2 series review: The Trial Season 2, starring Kajol, attempts to continue the courtroom drama but largely avoids intense legal battles, focusing more on emotional and political conflicts. The series is currently streaming on JioHotstar. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-blocks-pak-china-bid-to-sanction-baloch-liberation-army-at-un-weeks-after-tagging-it-as-terror-group-2789832-2025-09-19",
      "headline": "US blocks Pak, China bid to sanction Balochistan Liberation Army at UNIn blocking the joint bid to sanction the Balochistan Liberation Army (BLA) and its suicide wing, the Majeed Brigade, under the UN 1267 regime, the US and allies noted that there was insufficient evidence linking the groups to Al Qaeda or ISIL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/iphone-17-frenzy-hits-india-buyers-queue-overnight-scuffles-break-out-at-apple-stores-2789893-2025-09-19",
      "headline": "iPhone 17 frenzy hits India: Long queues, scuffles break out at Apple StoresThe iPhone 17 launch in India turned into chaos on Friday after large crowds gathered outside various Apple Stores. Clearly, craze for latest iPhones has hit an all-time high. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-vote-chori-allegation-modus-operandi-voter-deletions-2789921-2025-09-19",
      "headline": "Wake up at 4 am, delete voters, go to sleep: Rahul Gandhi on art of 'vote chori'Rahul Gandhi kept up his attack on the Election Commission over alleged illegal deletion of voters in another post on Friday. In a tongue-in-cheek post, he revealed how the alleged vote theft was carried out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-thanked-yasin-malik-for-meeting-hafiz-saeed-bjp-shares-affidavit-2789942-2025-09-19",
      "headline": "Manmohan Singh thanked Yasin Malik for meeting Hafiz Saeed: BJP's big chargeUpon his return from Pakistan, he was instructed to debrief then-Prime Minister Manmohan Singh, who thanked Malik for his role in the back-channel peace talks, according to Yasin Malik's affidavit, which was tweeted by BJP's IT head Amit Malaviya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-china-battle-nathu-la-cho-la-1967-clashes-sikkim-1962-war-pla-army-paltan-film-jp-dutta-explained-history-2788854-2025-09-19",
      "headline": "When India gave China a bloody nose in forgotten battles of 1967After its humiliating defeat to China in the 1962 war, India turned the tables just a few years later. In two little-known battles in 1967 at Nathu La and Cho La, fought weeks apart, Indian forces pushed back the Chinese and restored a measure of pride. Eighty-eight Indian bravehearts laid down their lives, but the toll on the Chinese side was over 300. This victory cemented India's hold over Sikkim, and shattered China's aura of invincibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-from-september-22-why-you-should-double-check-product-mrps-2789858-2025-09-19",
      "headline": "New GST rates from September 22: Why you should double-check product MRPsConsumers must remain alert as new GST rates take effect September 22; checking MRPs carefully ensures savings are realised, avoiding overpayment due to old pricing or retailer confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jolly-llb-3-movie-review-akshay-kumar-arshad-warsi-bring-charm-but-saurabh-shukla-owns-the-courtroom-2789835-2025-09-19",
      "headline": "Jolly LLB 3 review: Akshay-Arshad bring charm but Saurabh Shukla owns the courtroomRelease Date:Fri Sep 19, 2025Jolly LLB 3 review: Akshay Kumar and Arshad Warsi deliver entertaining performances in Subhash Kapoor's courtroom drama, but it's Saurabh Shukla as Judge Tripathi who steals the show. A witty mix of satire, comedy, and social commentary, the film balances laughs with a hard-hitting story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/missing-head-lord-vishnu-idol-khajuraho-javari-temple-debate-2789763-2025-09-19",
      "headline": "CJI comment row sparks question: Was Vishnu idol's head destroyed or unfinished?Following Chief Justice of India BR Gavai's remark, the missing head of Lord Vishnu at the Javari temple in Khajuraho, Madhya Pradesh, has raised a new question: was it destroyed by foreign invaders or left unfinished?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/samay-raina-slogan-tshirt-aryan-khan-rhea-chakraborty-karan-johar-power-of-slogan-tees-2789557-2025-09-19",
      "headline": "Slogan tees are fashion's strongest controversial tool. Just ask Samay, RheaSlogan T-shirts have never been just pieces of clothing - they've always been fashion's strongest tool. Can slogan T-shirts stir controversy? Absolutely. Can they silence trolls? That too. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/telangana-techie-shgot-dead-by-us-police-family-seeks-government-help-glbs-2789746-2025-09-19",
      "headline": "Telangana techie shot dead by US cops, family seeks help to bring back bodyTelangana techie Mohammed Nizamuddin was shot dead by US police after allegedly stabbing his roommate. His family, however, has disputed the police's version and has sought the government's help to bring back his body home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-review-price-mileage-features-driving-game-changing-mid-size-suv-2789892-2025-09-19",
      "headline": "Maruti Suzuki Victoris review: Is this the mid-size SUV game-changer?Maruti Suzuki's Victoris takes direct aim at the Korean duo with bold design, multiple powertrains including hybrid, CNG and AWD, and a feature-rich, safety-first package. Priced aggressively under Rs 20 lakh, it blends mass-market accessibility with premium polish, signalling Maruti's most decisive push yet into the hotly contested C-segment SUV space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/nishaanchi-review-anurag-kashyap-undoes-gangs-of-wasseypur-only-to-overdo-new-film-2789862-2025-09-19",
      "headline": "Nishaanchi review: A punchy potboiler weighed down by Anurag Kashyap's indulgenceRelease Date:Fri Sep 19, 2025Anurag Kashyap's 'Nishaanchi' offers a colourful mix of drama, humour and strong performances. The film's overindulgence and familiar tropes may divide audiences, but a sequel promises more twists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dusu-election-results-2025-delhi-university-students-union-abvp-nsui-president-2789869-2025-09-19",
      "headline": "Delhi University elections: BJP-backed ABVP set to sweep key postsDelhi University elections: The BJP-backed ABVP is also ahead in the race for the posts of secretary and joint secretary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-supreme-court-clears-new-constitution-no-re-election-kalyan-chaubey-2789922-2025-09-19",
      "headline": "Supreme Court approves AIFF draft constitution, Kalyan Chaubey to complete tenureThe Supreme Court has approved AIFF's new draft constitution, setting the stage for governance reforms and clearer operations in Indian football. The court also ruled no fresh elections are needed, allowing Kalyan Chaubey to complete his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/where-does-the-solar-system-end-the-invisible-boundary-nasa-wants-to-map-2789859-2025-09-19",
      "headline": "Where does the Solar System end? Nasa wants to map its boundaryThis invisible boundary is known as the heliosphere. It's the endpoint beyond which our Sun does not have any reach or power. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-reasons-why-they-call-him-og-became-pawan-kalyans-most-anticipated-film-2789301-2025-09-19",
      "headline": "OG fever: How Pawan Kalyan's film created real buzz in era of fake hypeFrom a viral teaser to stylish stunts and Thaman's music, 'They Call Him OG' has created genuine excitement that goes beyond fan hype, positioning Pawan Kalyan for a big-screen comeback this September 25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/not-every-fever-is-viral-doctor-warns-against-self-medication-2789861-2025-09-19",
      "headline": "Not every fever is viral, doctor warns against self medicationDoctors caution against ignoring fever and self-medicating with antibiotics. Untreated fever may lead to severe complications like sepsis, especially in vulnerable groups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-gen-z-nepal-protests-vote-theft-allegation-bjp-nishikant-dubey-2789820-2025-09-19",
      "headline": "Rahul Gandhi's Gen Z shoutout amid vote chori row gets BJP's stinging comebackThe timing of the post, with Rahul Gandhi invoking the Gen Z, is crucial. Just days ago, a violent protest by Nepal's Gen Z unseated the KP Sharma Oli government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-season-2-review-kajol-courtroom-drama-legal-cases-political-conflict-2789636-2025-09-19",
      "headline": "The Trial Season 2 review: Kajol's legal drama settles out of courtroomRelease Date:Fri Sep 19, 2025The Trial Season 2 series review: The Trial Season 2, starring Kajol, attempts to continue the courtroom drama but largely avoids intense legal battles, focusing more on emotional and political conflicts. The series is currently streaming on JioHotstar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-man-flaunts-cosmic-orange-iphone-17-says-i-am-a-muslim-but-love-this-colour-2789918-2025-09-19",
      "headline": "Delhi man flaunts Cosmic Orange iPhone 17, says 'I'm Muslim but love this colour'The man, who hails from Delhi's Sangam Vihar, said he had been waiting in line since morning just to purchase the all-new Cosmic Orange iPhone 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/i-am-very-close-to-india-and-modi-weve-very-good-friendship-trump-after-repeated-rant-over-russia-oil-trade-2789626-2025-09-18",
      "headline": "I am very close to India and Modi: Trump after repeated rant over Russia oil tradeUS President Donald Trump, while addressing reporters during his UK visit, said that he is very close to India and Prime Minister Narendra Modi. His remarks come after his repeated rants over India's Russian oil trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/man-enters-tvk-vijays-residence-police-say-intruder-mentally-unstable-2789881-2025-09-19",
      "headline": "Man enters TVK chief Vijay's residence, police say intruder mentally unstableA man entered TVK Vijay's Neelankarai residence on Wednesday. Police apprehended him and said he is mentally unstable. He was taken to a government shelter, and an investigation into the breach is underway."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-inglis-injury-australia-t20i-series-new-zealand-alex-carey-replacement-2789946-2025-09-19",
      "headline": "Josh Inglis ruled out of T20I series with calf strain in big blow for AustraliaJosh Inglis has been ruled out of the upcoming T20I series against New Zealand due to a right calf strain. His absence adds to Australia's injury concerns ahead of the 2026 T20 World Cup preparations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/daren-sammy-west-indies-pacers-test-series-india-2025-2789949-2025-09-19",
      "headline": "West Indies hoping to do a New Zealand on India with strong pace attack: Daren SammyWest Indies coach Daren Sammy believes his strong pace attack led by Shamar Joseph, Alzarri Joseph, and Jayden Searles can take 20 wickets and upset India in the upcoming two-Test series starting October 2 in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-supreme-court-clears-new-constitution-no-re-election-kalyan-chaubey-2789922-2025-09-19",
      "headline": "Supreme Court approves AIFF draft constitution, Kalyan Chaubey to complete tenureThe Supreme Court has approved AIFF's new draft constitution, setting the stage for governance reforms and clearer operations in Indian football. The court also ruled no fresh elections are needed, allowing Kalyan Chaubey to complete his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-rankings-september-2025-spain-top-india-134-germany-drop-2789916-2025-09-19",
      "headline": "FIFA Rankings: India drops down to 134, Spain reclaims top spotIndia dropped to 134 despite a strong CAFA Nations Cup, as the latest rankings were unveiled on Thursday, September 18. Spain went back to the top of the rankings, ending Argentina's two-year reign as No.1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-exit-errors-sri-lanka-rashid-khan-injury-press-conference-2789899-2025-09-19",
      "headline": "Jonathan Trott rues basic errors after Afghanistan's exit: Hard one to swallowAfghanistan crashed out of the Asia Cup after a six-wicket defeat to Sri Lanka, with head coach Jonathan Trott blaming \"basic errors\" in bowling and fielding. Despite Mohammad Nabi's blistering 22-ball 60, Trott said a poor powerplay and lapses in execution sealed their elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-loses-an-se-young-china-masters-2024-quarterfinals-2789870-2025-09-19",
      "headline": "PV Sindhu crashes out with quarterfinal defeat to An Se YoungPV Sindhu's China Masters campaign ended in the quarterfinals after a straight-games loss to World No.1 An Se Young on Friday, extending her winless record against the Korean to 0-8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-first-indian-world-champion-inline-speed-skating-2789849-2025-09-19",
      "headline": "Skating by day, coding by night: Engineering student Anandkumar's road to gloryFrom the streets of Chennai to the world stage, Anandkumar Velkumar rewrote Indian skating history. The 22-year-old engineering student turned years of practice into gold to become the country's first inline speed skating world champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-2025-day-7-schedule-noah-lyles-annu-rani-2789829-2025-09-19",
      "headline": "World Athletics Champs Day 7 schedule: Annu eyes javelin final, Lyles 200m goldNoah Lyles headlines an action-packed Day 7 at the World Athletics Championships as he aims to win gold in the men's 200m final. India's Annu Rani and Gulveer Singh will also be in action during the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-keshorn-walcott-triumph-overshadows-neeraj-chopra-setback-2789825-2025-09-19",
      "headline": "Javelin world shaken: Walcott's triumph overshadows Chopra's setbackKeshorn Walcott ended a 13-year wait by claiming gold at the 2025 World Championships in Tokyo, stunning the javelin world with an 88.16m throw. Neeraj Chopra, hampered by a back injury, finished eighth, signaling a historic shift in global javelin dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-rest-vs-oman-pakistan-sunil-gavaskar-test-bench-strength-2789813-2025-09-19",
      "headline": "Rest Jasprit Bumrah vs Oman and Pakistan: Sunil Gavaskar wants India to plan aheadSunil Gavaskar suggests India rest Jasprit Bumrah against Oman and Pakistan in Asia Cup to keep him fresh for the Super 4s, while giving key batters like Sanju Samson and Tilak Verma valuable practice time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-marcus-rashford-redemption-fc-barcleona-vs-newcastle-united-erling-haaland-fifty-goals-2789781-2025-09-19",
      "headline": "Marcus Rashford redemption in Barcelona win as Erling Haaland nets 50th UCL goalMarcus Rashford scored twice on his Barcelona Champions League debut to stun Newcastle, while Erling Haaland became the fastest to 50 goals as Manchester City cruised past Napoli. Frankfurt and Sporting impressed, Leverkusen survived a scare in Denmark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-first-indian-world-champion-inline-speed-skating-2789849-2025-09-19",
      "headline": "Skating by day, coding by night: Engineering student Anandkumar's road to gloryFrom the streets of Chennai to the world stage, Anandkumar Velkumar rewrote Indian skating history. The 22-year-old engineering student turned years of practice into gold to become the country's first inline speed skating world champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-2025-day-7-schedule-noah-lyles-annu-rani-2789829-2025-09-19",
      "headline": "World Athletics Champs Day 7 schedule: Annu eyes javelin final, Lyles 200m goldNoah Lyles headlines an action-packed Day 7 at the World Athletics Championships as he aims to win gold in the men's 200m final. India's Annu Rani and Gulveer Singh will also be in action during the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-keshorn-walcott-triumph-overshadows-neeraj-chopra-setback-2789825-2025-09-19",
      "headline": "Javelin world shaken: Walcott's triumph overshadows Chopra's setbackKeshorn Walcott ended a 13-year wait by claiming gold at the 2025 World Championships in Tokyo, stunning the javelin world with an 88.16m throw. Neeraj Chopra, hampered by a back injury, finished eighth, signaling a historic shift in global javelin dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jasprit-bumrah-rest-vs-oman-pakistan-sunil-gavaskar-test-bench-strength-2789813-2025-09-19",
      "headline": "Rest Jasprit Bumrah vs Oman and Pakistan: Sunil Gavaskar wants India to plan aheadSunil Gavaskar suggests India rest Jasprit Bumrah against Oman and Pakistan in Asia Cup to keep him fresh for the Super 4s, while giving key batters like Sanju Samson and Tilak Verma valuable practice time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-marcus-rashford-redemption-fc-barcleona-vs-newcastle-united-erling-haaland-fifty-goals-2789781-2025-09-19",
      "headline": "Marcus Rashford redemption in Barcelona win as Erling Haaland nets 50th UCL goalMarcus Rashford scored twice on his Barcelona Champions League debut to stun Newcastle, while Erling Haaland became the fastest to 50 goals as Manchester City cruised past Napoli. Frankfurt and Sporting impressed, Leverkusen survived a scare in Denmark."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}