{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-tax-rules-coming-soon-how-the-income-tax-bill-2025-could-impact-you-2764621-2025-08-01",
      "headline": "New tax rules coming soon. How the Income Tax Bill 2025 could impact youThe new law aims to make income tax rules easier to understand, reduce legal disputes, and help people comply with tax rules more easily. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sebi-upcoming-ipo-proposal-equity-dilution-25-percent-rule-report-2764605-2025-08-01",
      "headline": "Sebi may relax IPO float norms for big firms to just 2.5% equity: ReportAt present, Sebi rules say that any company with a post-issue capital of more than Rs 1 lakh crore must offer 5% equity and raise at least Rs 5,000 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/ed-investigates-anil-ambani-in-loan-fraud-case-summoned-on-august-5-2764523-2025-08-01",
      "headline": "ED investigates Anil Ambani in loan fraud case, summoned on August 5The Enforcement Directorate (ED) has summoned Anil Ambani for questioning on August 5 in the national capital. This is in connection with an investigation into an alleged loan fraud of Rs 12,500 crore. The development follows multiple searches the ED carried out at 35 locations in Mumbai, targeting business entities linked to the Anil Ambani group under the Prevention of Money Laundering Act (PMLA). The probe agency's action is also based on findings from a separate investigation by the Securities and Exchange Board of India (SEBI). A key point in the investigation is an alleged diversion of funds, with the transcript stating, \"The development actually came after the SEBI shared with the enforcement directorate the findings of a separate probe that launched into the alleged diversion of 10,000 crore by the Reliant infrastructure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summon-loan-fraud-news-august-5-questioning-enforcement-directorate-sebi-report-findings-2764568-2025-08-01",
      "headline": "Why has ED summoned Anil Ambani on August 5Anil Ambani, chairman and managing director of Reliance Group, has been summoned by the Enforcement Directorate (ED) for questioning on August 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-168-points-lower-nifty-below-24800-hul-gains-4-percent-2764538-2025-08-01",
      "headline": "Sensex opens 168 points lower, Nifty below 24,800; HUL gains 4%The S&P BSE Sensex was down by 150.77 points to 81,034.81, while the NSE Nifty50 lost 62.50 points to 24,705.85 as of 9:47 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-new-tariff-rate-69-countries-august-7-us-news-trade-deal-india-syria-eu-china-canada-2764532-2025-08-01",
      "headline": "Trump's new tariffs hit 69 nations: See who pays most and least from August 7The new order on tariffs will take effect from August 7 and will range from 10% to 41%, depending on the country, while others not mentioned in the list will face a default import duty of 10%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/womens-workforce-participation-is-very-low-kalpana-viswanath-ceo-safetipin-2764307-2025-07-31",
      "headline": "Women's workforce participation is very low; Kalpana Viswanath, CEO SafetipinIn a powerful discussion on women's rights and safety, a call was made for systemic change over waiting for patriarchal mindsets to shift. 'We just need the right to walk safely without looking over our shoulders,' one speaker emphasised, highlighting that safety is a right, not a form of protection. The conversation revealed that women hold less than 2% of jobs in the burgeoning gig economy, a stark contrast to their participation in the traditional economy. The panel also explored how urban infrastructure and product design often have a male-as-norm bias, from the height of bus handrails to the lack of pockets in women's clothing. The dialogue touched upon the 'pink tax' in transportation, where trip-chaining results in higher travel costs for women. The need for an enabling environment, including better public transport and services, was stressed as crucial for women's economic and social participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fenesta-cmo-susmita-nag-discusses-gender-bias-in-hiring-within-professional-workspaces-2764268-2025-07-31",
      "headline": "Fenesta CMO Susmita Nag discusses gender bias in hiring within professional workspacesA discussion highlights the stark reality for women in India's corporate sector, where they make up only 18% of the workforce in top NSE-listed companies. A woman leader recounted her early career in the late 90s, where she was told the company 'don't hire girls' and faced a lack of basic facilities like restrooms and proper safety gear in a factory setting. Another speaker addressed the issue of tokenism on corporate boards, suggesting that having three or more women in a group forms a cohort, whereas one is mere tokenism. The conversation delved into unconscious biases in hiring, noting that women's resumes are scrutinised for marital status more often than men's. The speakers emphasised that while policies like flexi-working exist, they can lead to subtle penalties and that a fundamental mindset shift, beyond just policy changes, is crucial for true gender equity in the workplace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-delayed-check-your-status-in-these-2-easy-ways-2764267-2025-07-31",
      "headline": "ITR refund delayed? Check your status in these 2 easy waysUsually, if your return is e-verified, the refund is credited within four to five weeks. But if you're still waiting, you can easily check your refund status online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lead-from-the-front-pallavi-shroff-on-breaking-barriers-building-legacies-2764235-2025-07-31",
      "headline": "Lead from the front: Pallavi Shroff on breaking barriers, building legaciesSpeaking at the India Today Woman Summit 2025, Pallavi S Shroff, Managing Partner, Shardul Amarchand Mangaldas said that when she began her practice in 1981, there were barely four or five women arguing cases in court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India set to be 3rd largest economy: Minister after Trump's 'dead economy' jabThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-296-points-lower-nifty-below-24800-hul-up-4-2764181-2025-07-31",
      "headline": "Sensex ends 296 points lower, Nifty below 24,800; HUL up 4%The S&P BSE Sensex was down by 296.28 points to end at 81,185.58, while the NSE Nifty50 lost 86.70 points to close at 24,768.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-how-avoiding-a-rs-5000-splurge-every-month-can-make-you-a-crorepati-2764129-2025-07-31",
      "headline": "CA explains how avoiding a Rs 5,000 splurge every month can make you a crorepatiYoung professionals often burn out chasing income, yet let their money idle. A Chartered Accountant suggests ditching one Rs 5,000 splurge a month and letting compounding turn it into crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indian-farm-market-is-coming-in-between-india-and-us-tariff-negotiations-2764038-2025-07-31",
      "headline": "Behind the delayed US-India trade deal: A standoff over farmsAt the centre of the friction is a long-standing issue that has repeatedly stalled negotiations between the two countries: agriculture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/donald-trump-us-25-percent-tariff-on-india-impact-stock-market-sectors-explained-2764076-2025-07-31",
      "headline": "Trump's 25% tariffs: These stocks and sectors are in the firing lineBoth the main indices on Dalal Street fell sharply in early trade, and despite recovering by noon, the mood remains tense after Washington's move threatened to upend trade flows across key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/6-indian-firms-sanctioned-by-us-all-you-need-to-know-2764015-2025-07-31",
      "headline": "Who are the 6 Indian firms sanctioned by the US and what's at stake?Six Indian firms have been sanctioned by the US for allegedly importing Iranian petrochemicals. Here's all you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-now-open-update-your-past-itr-mistakes-for-ay-2021-22-and-2022-23-2764013-2025-07-31",
      "headline": "ITR-U now open: Update your past ITR mistakes for AY 2021-22 and 2022-23The Income Tax Department has now made it possible to file updated returns (ITR-U) for Assessment Years (AY) 2021-22 and 2022-23 using the ITR-1 and ITR-2 forms. This move aims to help people fix any errors or income details they may have missed earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-25-percent-tariff-which-sectors-most-impacted-gems-jewellery-2764005-2025-07-31",
      "headline": "Trump's 25% tariffs: Which sectors should brace for impact?US President Donald Trump announced a 25% tariff on Indian exports starting August 1.  An additional penalty was also announced for India's continued oil purchases from Russia, which has added more uncertainty for businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-down-today-stock-market-fall-why-reasons-us-tariff-it-shares-ril-adani-port-decline-2763979-2025-07-31",
      "headline": "Sensex falls 500 points: Why is stock market down todayHeavyweight stocks fell in early trade. The S&P BSE Sensex fell over 575 points in early trade to 80,907.34, while the NSE Nifty50 dropped 185 points to 24,670.15 by 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-590-points-lower-nifty-below-24700-ril-shares-fall-2-percent-2763938-2025-07-31",
      "headline": "Sensex opens 590 points lower, Nifty below 24,700; RIL shares fall 2%The S&P BSE Sensex lost 536.92 points to 80,944.94, while the NSE Nifty50 lost 156.35 points to 24,698.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-25-percent-tariff-india-us-trade-deal-not-confirmed-why-reason-dairy-agriculture-sector-import-duty-2763923-2025-07-31",
      "headline": "Trump announces 25% tariff: Why India and US still don't have a trade dealDespite several rounds of talks, the two nations have not managed to bridge key differences. Speaking at a press conference at the White House, Trump said that India remains one of the highest tariff-imposing countries in the world, but discussions are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bse-nse-trading-setup-us-tariff-fed-rate-cut-sensex-nifty-today-2763912-2025-07-31",
      "headline": "US imposes 25% tariff on India. Will Sensex, Nifty crash today?The GIFT Nifty futures, which reflect early cues for the market, were trading 179 points lower at 24,675, down 0.73%, signalling a weak start for Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors, like auto components, steel, aluminum, smartphones, gems and jewellery. Pharmaceuticals, semiconductors, and critical minerals, however, have been excluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-the-subscription-lifestyle-is-fuelling-a-new-wave-of-debt-emi-bpnl-schemes-2763577-2025-07-30",
      "headline": "How the subscription lifestyle is fuelling a new wave of debtFrom entertainment and food to wellness and shopping, subscription models are everywhere. While they promise convenience, they're also leading many into silent debt traps, especially the younger, digital-savvy crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-highe-lt-shares-rise-4-percent-india-us-trade-deal-2763608-2025-07-30",
      "headline": "Sensex closes 144 points higher, Nifty above 24,800; L&T up 4%The S&P BSE Sensex gained 143.91 points to close at 81,481.86, while the NSE Nifty50 added 33.95 points to end at 24,855.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/mb-engineering-ipo-subscription-gmp-details-review-apply-or-not-listing-gains-2763566-2025-07-30",
      "headline": "M&B Engineering IPO: Should you subscribe? Check GMP, subscription on Day 1The IPO consists of a fresh equity issue worth Rs 275 crore and an offer-for-sale (OFS) worth Rs 375 crore by the company's promoters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-government-staff-opt-for-unified-pension-scheme-low-adoption-explained-2763603-2025-07-30",
      "headline": "Only 1.35% central government staff opt for Unified Pension Scheme. Here's whyAs of July 20, 2025, only 30,989 employees have chosen UPS out of approximately 23 lakh (2.3 million) employees enrolled in NPS, marking a participation rate of just 1.35%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sumit-kumar-health-insurance-rejection-star-health-manipal-hospital-2762528-2025-07-30",
      "headline": "How Pune man's insurance claim was denied thrice, then cleared after viral postWhile his wife was hospitalised, Sumit Kumar, a Pune-based business consultant, was battling paperwork, policy fine print, and silence from his insurer. This is his story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-review-price-band-good-bad-listing-latest-gmp-listing-gains-day-1-subscription-2763504-2025-07-30",
      "headline": "NSDL IPO fully booked: Should you subscribe or skip Rs 4,000 crore listing?National Securities Depository Ltd (NSDL) aims to raise Rs 4,011.60 crore through a complete offer for sale (OFS) of 5.01 crore equity shares by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-day-1-check-latest-subscription-status-gmp-and-more-2763484-2025-07-30",
      "headline": "NSDL IPO Day 1: Check latest subscription status, GMP and moreIn the grey market, NSDL's shares are commanding a premium of Rs 126, implying an estimated listing price of Rs 926—around 15.75 percent higher than the issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-ceos-salary-in-focus-amid-mass-layoff-plan-here-is-how-much-he-earns-2763478-2025-07-30",
      "headline": "TCS CEO's salary in focus amid mass layoff plan. Here's how much he earnsTCS recently confirmed it will let go of about 2% of its workforce in FY26, which translates to roughly 12,000 employees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-hiring-new-20000-jobs-freshers-it-sector-vacancy-ceo-salil-parekh-report-ai-tcs-layoff-2763457-2025-07-30",
      "headline": "Infosys to hire 20,000 freshers in 2025, focus on AI: ReportInfosys CEO said that the IT firm has made early investments in AI and training its staff. So far, the company has trained about 2.75 lakh employees at different levels in AI and related areas."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rajiv-thakur-removed-great-indian-kapil-show-netflix-comedian-clarifies-2764575-2025-08-01",
      "headline": "Rajiv Thakur removed from Great Indian Kapil Show? Comedian clarifiesComedian Rajiv Thakur recently reacted to reports of him being removed from 'the new season of The Great Indian Kapil Show'. He clarified that nobody takes a break from such huge shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-movie-review-ajay-devgn-lands-india-pakistan-jokes-not-the-film-2764562-2025-08-01",
      "headline": "Son of Sardaar 2 review: Ajay Devgn lands India-Pakistan jokes, not the filmRelease Date:Fri Aug 01, 2025Son of Sardaar 2 movie review: Ajay Devgn returns as Jassi, a Sardaar lost in Scotland and even more lost in the plot. With forced humour, awkward chemistry, and India-Pakistan punchlines doing the heavy lifting, 'Son of Sardaar 2' struggles to match the charm or chaos of the first film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ishita-dutta-hospitalised-son-vaayu-weeks-after-birth-of-second-child-vatsal-sheth-2764549-2025-08-01",
      "headline": "Ishita Dutta, son hospitalised weeks after actor delivered second childActor Ishita Dutta posted a photo on her Instagram story showing her and her two-year-old son Vaayu with IV drips in the hospital. This came after she gave birth to her second child.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-arjun-kapoor-bromance-shines-step-out-for-outing-viral-videos-2764548-2025-08-01",
      "headline": "Ranbir and Arjun Kapoor's bromance shines as they step out for outing. WatchRanbir Kapoor and Arjun Kapoor stepped out for an outing together on July 31. Videos of the two posing for the paparazzi with their friends have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vaibhav-raj-gupta-on-breaking-the-gullak-annu-bhaiya-mould-in-vikram-singh-mandala-murders-exclusive-2764243-2025-08-01",
      "headline": "Actor Vaibhav Raj Gupta on breaking the Gullak mould in Mandala MurdersVaibhav Raj Gupta, best known as the lovable Annu Bhaiya from TVF's 'Gullak', took a bold leap into darker territory with Netflix's 'Mandala Murders'. In an exclusive interview, the actor opened up about breaking out of typecasting, navigating life as an outsider in Mumbai, and the process behind bringing his latest role to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarRelease Date:Fri Aug 01, 2025Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bakaiti-review-rajesh-tailang-sheeba-chaddha-middle-class-family-drama-2764469-2025-08-01",
      "headline": "Bakaiti review: Bickering never stops in this familiar yet heartwarming seriesRelease Date:Fri Aug 01, 2025Bakaiti series review: 'Bakaiti', starring Sheeba Chaddha and Rajesh Tailang, follows the Kataria family's everyday struggles in old Ghaziabad. The series highlights sibling rivalry and financial challenges with warmth and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-2764375-2025-07-31",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup is loaded with variety. From romance to drama and documentary, here's what you can add to your binge-watch list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-recalls-working-with-sanjay-leela-bhansali-in-ram-leela-2764355-2025-07-31",
      "headline": "Priyanka Chopra recalls working with Bhansali in Ram Leela, says was inspired by himPriyanka Chopra shared how working on a song with filmmaker Sanjay Leela Bhansali was a tough but inspiring choice. She recalled memories from the shoot in an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-raghav-chadha-bring-laughter-and-love-the-great-indian-kapil-sharma-show-2764115-2025-07-31",
      "headline": "Parineeti Chopra-Raghav Chadha bring laughter and love to Kapil Sharma's showActor Parineeti Chopra and her politician-husband Raghav Chadha will feature in the upcoming episode of 'The Great Indian Kapil Show' season 3. The newly released promo shows Raghav and Parineeti playfully roasting each other. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-premiere-august-24-longer-season-salman-khan-hosting-2764323-2025-07-31",
      "headline": "Bigg Boss 19: What to expect from Salman Khan's new seasonBigg Boss 19 is set to premiere on August 24 with an extended season and new streaming format. Salman Khan returns as host, but an alternate host may join due to his busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-on-ahaan-panday-aneet-padda-overnight-stardom-feels-like-a-career-reset-for-me-2764305-2025-07-31",
      "headline": "Mohit Suri on Ahaan Panday-Aneet Padda's stardom: Feels like a career reset for meIn an exclusive conversation with India Today, Mohit Suri opened up about the overnight stardom of 'Saiyaara' stars Ahaan Panday and Aneet Padda. He expressed his joy in witnessing their journey and the fresh energy their success has brought to his own career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-supports-sitaare-zameen-par-pay-per-view-model-2764327-2025-07-31",
      "headline": "Hansal Mehta supports Sitaare Zameen Par's pay-per-view model, calls it smart moveFilmmaker Hansal Mehta praised Aamir Khan's decision to release 'Sitaare Zameen Par' on YouTube as a pay-per-view title. He called it a smart and progressive move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-bigg-boss-19-teaser-gharwalon-ki-sarkaar-twist-jiohotstar-colorstv-2764320-2025-07-31",
      "headline": "Bigg Boss 19 teaser: Salman Khan returns with a new twist, premiere date outActor Salman Khan launched the teaser for Bigg Boss 19 introducing the 'Gharwalon ki Sarkaar' twist. This new format promises a house run by collective decisions, adding fresh dynamics to the popular reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-mushy-birthday-wish-for-his-love-kiara-advani-is-all-heart-2764294-2025-07-31",
      "headline": "My favourite face, in any place: Sidharth Malhotra's birthday wish for Kiara AdvaniKiara Advani celebrated her 34th birthday on July 31. To mark the joyous occasion, her actor-husband Sidharth Malhotra showered love on her, with the most heartwarming post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-open-old-age-home-for-500-on-his-birthday-2764113-2025-07-31",
      "headline": "Sonu Sood announces old age home for 500 seniors on his birthdayOn his 52nd birthday, Sonu Sood announced the launch of an old age home to provide shelter and care for 500 senior citizens without family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-gets-bail-in-8-year-old-case-after-he-surrenders-before-court-2764292-2025-07-31",
      "headline": "Rajkummar Rao granted bail in 8-year-old case after surrendering in courtActor Rajkummar Rao was recently granted bail in an eight-year-old case after he surrendered before the Jalandhar court. His lawyers cited wrong address of delivery "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/conversations-with-a-killer-the-son-of-sam-tapes-delves-into-a-serial-killer-sinister-mindset-2764143-2025-07-31",
      "headline": "The Son of Sam Tapes delves into a serial killer's sinister mindsetNetflix's new offering, 'Conversations with a Killer: The Son of Sam Tapes', takes a deep dive into the disturbing psyche of an infamous serial killer. With rare tapes and firsthand accounts, the docu-series reflects on what turned a seemingly normal man, David Berkowitz, into a monster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shefali-shah-bhumi-pednekar-on-pay-parity-ott-fairer-to-women-2764257-2025-07-31",
      "headline": "Shefali Shah, Bhumi Pednekar on pay parity: OTT fairer to womenActors Shefali Shah and Bhumi Pednekar shared their views on pay gaps and praised OTT platforms for bringing more fairness and better roles for women. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/malegaon-blast-probe-officer-ordered-arrest-of-rss-chief-mohan-bhagwat-retired-ats-inspector-2764593-2025-08-01",
      "headline": "Malegaon blast probe officer ordered RSS chief's arrest: Retired cop's bombshellA retired Maharashtra ATS officer has alleged that he was directed to arrest RSS chief Mohan Bhagwat to build a 'saffron terror' narrative in the 2008 Malegaon blast case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russian-oil-point-of-irritation-for-the-us-but-not-the-only-point-as-with-india-firmly-resisting-opening-up-its-agriculture-and-dairy-sectors-for-us-goods-2764444-2025-07-31",
      "headline": "India buying Russian oil not the only point of irritation, says Marco RubioOne of the biggest points of contradiction that has stopped India and the US from signing a trade deal is India's firm resistance to opening up its agriculture and dairy sectors for US goods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-terrorists-killed-pahalgam-attack-counter-terror-operations-2764588-2025-08-01",
      "headline": "After Mahadev, India launched Op Shiv Shakti. 12 terrorists killed in 100 daysAmong the 12 eliminated, six were Pakistani terrorists, while the rest were locals involved in major terror attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarSiddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-nehru-fixation-what-explains-it-by-rajdeep-sardesai-2764370-2025-08-01",
      "headline": "Why Modi feels the need to demolish NehruAt the Lok Sabha, while Modi punched hard at his critics on the government's handling of Operation Sindoor, there was a familiar name from the past that kept recurring throughout his speech. On 14 occasions, the prime minister referred to the 'sins' of one of his predecessors, Jawaharlal Nehru. Which leads one to ask: what explains Modi's Nehru fixation? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-lok-sabha-rajya-sabha-bihar-voters-list-congress-bjp-india-bloc-protest-2764581-2025-08-01",
      "headline": "Live: Gandhi siblings meet Lok Sabha Speaker, Opposition seeks debate on Bihar surveyParliament Monsoon Session 2015 Live: Today marks the 10th day of the Monsoon Session of Parliament, with both Houses expected to deliberate on key legislations and issues. However, proceedings in the Lok Sabha and Rajya Sabha are likely to remain disrupted amid continued protests by the Opposition over the revision of the voters' list in Bihar. The protests are expected to intensify as the Election Commission prepares to release the draft electoral rolls for the state. Stay tuned to IndiaToday.in for the latest updates from Parliament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-sold-on-pakistan-oil-deal-where-is-reserves-petrol-imran-khan-cryptocurrency-tariff-india-2764337-2025-07-31",
      "headline": "Trump is all gas and Pakistan has no oilA day after declaring a 25% import duty and penalty on Indian exports, President Donald Trump said the US would be working with Islamabad to develop Pakistan's \"massive oil reserves\". But where's Pakistan's oil that Trump got sold on? And why do Pakistanis pay 272 rupees a litre for petrol and smuggle oil from Iran?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-look-up-each-time-a-plane-takes-off-inside-ground-zero-of-air-india-crash-2764211-2025-07-31",
      "headline": "'We look up each time a plane takes off': Inside Ground Zero of Air India crashHow students and faculty at Ahmedabad's Byramjee Jeejeebhoy Medical College are coping with the trauma"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-movie-review-ajay-devgn-lands-india-pakistan-jokes-not-the-film-2764562-2025-08-01",
      "headline": "Son of Sardaar 2 review: Ajay Devgn lands India-Pakistan jokes, not the filmRelease Date:Fri Aug 01, 2025Son of Sardaar 2 movie review: Ajay Devgn returns as Jassi, a Sardaar lost in Scotland and even more lost in the plot. With forced humour, awkward chemistry, and India-Pakistan punchlines doing the heavy lifting, 'Son of Sardaar 2' struggles to match the charm or chaos of the first film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-minister-bc-janardhan-reddys-cousin-arrested-for-allegedly-slapping-constable-during-temple-inauguration-in-nandyal-2764606-2025-08-01",
      "headline": "Caught on camera: Andhra Minister's cousin slaps cop at temple, arrestedDuring a temple inauguration in Andhra Pradesh, TDP Minister BC Janardhan Reddy's cousin brother slapped an on-duty constable. A case was filed, and he was arrested. The minister condemned the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/kamchatka-earthquake-ring-of-fire-explained-volcano-tsunami-pacific-ocean-279-01-08-2025",
      "headline": "Inside Earth's fury: Decoding the deadly Ring of FireEarth's hidden engines are churning deep beneath the oceans and mountains, and the Ring of Fire is at the heart of this churning - a constant reminder that our world is alive and breathing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-raj-shamani-suicidal-thoughts-2764583-2025-08-01",
      "headline": "I had suicidal thoughts: Chahal breaks silence on divorce sagaYuzvendra Chahal has finally opened up on his divorce with Dhanashree Verma. The spinner spoke about the saga in details on a podcast, explaining his side of the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-lokayukta-seizes-rs-30-crore-assets-from-kridl-ex-clerk-earning-rs-15000-salary-2764578-2025-08-01",
      "headline": "Raids on ex-Karnataka clerk unearth Rs 30 crore in assets, including 24 housesA former clerk at Karnataka Rural Infrastructure Development Limited is under investigation after a Lokayukta raid revealed massive wealth, including houses, land and jewellery, worth over Rs 30 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/from-first-call-5g-30-years-india-mobile-data-cellphone-journey-airtel-nokia-motorola-jio-phone-connection-2764322-2025-08-01",
      "headline": "Rs 16 to receive calls to ultra-cheap data: 30 years of India's mobile journeyIndia's first mobile call, 30 years ago, marked the start of a journey that turned a luxury product into an everyday gadget. From paying to even receive calls, to super-cheap data, India has seen a telecom revolution. With over 1.2 billion connections, mobile phones have become India's bank, classroom, television and lifeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/world-lung-cancer-day-one-puff-many-scars-a-journey-inside-smoker-lungs-280-01-08-2025",
      "headline": "One puff, many scars: A journey inside smoker's lungsYou can't rewind lung damage, but you can stop fast-forwarding it. Start with awareness, and let knowledge be your breath of fresh air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-new-tariff-rate-69-countries-august-7-us-news-trade-deal-india-syria-eu-china-canada-2764532-2025-08-01",
      "headline": "Trump's new tariffs hit 69 nations: See who pays most and least from August 7The new order on tariffs will take effect from August 7 and will range from 10% to 41%, depending on the country, while others not mentioned in the list will face a default import duty of 10%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minister-manikrao-kokate-caught-playing-rummy-assembly-removed-agriculture-minister-sports-2764506-2025-08-01",
      "headline": "Maharashtra Agriculture Minister removed after rummy row, gets sports portfolioMaharashtra's Manikrao Kokate has been removed as Agriculture Minister after a video showed him playing rummy during an assembly session. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-visits-gujarat-pm-modi-hails-it-as-message-of-unity-2764475-2025-08-01",
      "headline": "I firmly believe that...: Omar Abdullah after PM praises Statue of Unity visitJammu & Kashmir Chief Minister Omar Abdullah visited Gujarat for a tourism event and shared his experience on social media. His post caught the attention of Prime Minister Narendra Modi, who praised his visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-heavy-workload-jasprit-bumrah-2764509-2025-08-01",
      "headline": "India shield Bumrah, but is Siraj carrying the real burden?ENG vs IND: Jasprit Bumrah is being managed for his workload, but what about Mohammed Siraj, who has been a key part of India's fast bowling setup in the purest format?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mussoorie-uttarakhand-tourists-registration-process-aadhaar-card-details-2764543-2025-08-01",
      "headline": "Planning a trip to Mussoorie? Tourist registration kicks off todayThe move comes amid ever-surging tourist arrivals at the popular hill station, with footfall having almost doubled between 2022 and 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/boy-13-brutally-killed-after-being-kidnapped-in-bengaluru-2764480-2025-08-01",
      "headline": "Bengaluru teen kidnapped, body found next day. 2 accused arrested after encounterNischith, 13, was kidnapped on Wednesday while returning home from tuition and was found dead on Thursday in a deserted area in Bengaluru. Two accused have been arrested following a police encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-movie-review-ajay-devgn-lands-india-pakistan-jokes-not-the-film-2764562-2025-08-01",
      "headline": "Son of Sardaar 2 review: Ajay Devgn lands India-Pakistan jokes, not the filmRelease Date:Fri Aug 01, 2025Son of Sardaar 2 movie review: Ajay Devgn returns as Jassi, a Sardaar lost in Scotland and even more lost in the plot. With forced humour, awkward chemistry, and India-Pakistan punchlines doing the heavy lifting, 'Son of Sardaar 2' struggles to match the charm or chaos of the first film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-arjun-kapoor-bromance-shines-step-out-for-outing-viral-videos-2764548-2025-08-01",
      "headline": "Ranbir and Arjun Kapoor's bromance shines as they step out for outing. WatchRanbir Kapoor and Arjun Kapoor stepped out for an outing together on July 31. Videos of the two posing for the paparazzi with their friends have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarRelease Date:Fri Aug 01, 2025Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-2764375-2025-07-31",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup is loaded with variety. From romance to drama and documentary, here's what you can add to your binge-watch list."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/galatasaray-break-turkish-transfer-record-to-sign-victor-osimhen-from-napoli-2764604-2025-08-01",
      "headline": "Galatasaray break Turkish transfer record to sign Victor Osimhen from NapoliGalatasaray have pulled off a stunning coup by signing Nigerian striker Victor Osimhen from Napoli in a record-breaking deal, the club confirmed on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-raj-shamani-suicidal-thoughts-2764583-2025-08-01",
      "headline": "I had suicidal thoughts: Chahal breaks silence on divorce sagaYuzvendra Chahal has finally opened up on his divorce with Dhanashree Verma. The spinner spoke about the saga in details on a podcast, explaining his side of the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-west-indies-1st-t20i-report-saim-ayub-nawaz-2764570-2025-08-01",
      "headline": "Saim Ayub, Nawaz star for Pakistan as West Indies' horror run continuesWest Indies' poor run in T20 Internationals continued as they slipped to their sixth consecutive defeat, going down by 14 runs against Pakistan in the opening match at Lauderhill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-salman-agha-controversy-pakistan-cricket-board-refute-rift-2764555-2025-08-01",
      "headline": "Shaheen Afridi-Salman Agha controversy: Pakistan refute rift between top starsThe Pakistan Cricket Board (PCB) on Thursday dismissed rumours of a rift involving pacer Shaheen Shah Afridi, captain Salman Ali Agha, and head coach Mike Hesson, labelling the allegations as fabricated and defamatory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mca-honours-sunil-gavaskar-sharad-pawar-statues-wankhede-cricket-museum-2764546-2025-08-01",
      "headline": "Sunil Gavaskar, Sharad Pawar to be honoured with life-size statues at MCA museumLegendary India batter Sunil Gavaskar and veteran cricket administrator Sharad Pawar will be immortalised with life-size statues at the entrance of the upcoming Mumbai Cricket Association (MCA) museum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-seamer-chris-woakes-injured-shoulder-oval-injury-replacement-debate-2764525-2025-08-01",
      "headline": "England seamer Woakes injured; Stokes unlikely to get replacementIndia vs England 5th Test: England will be sweating over Chris Woakes' injury going into the Day 2 of the final Test match at The Oval. Will Woakes be allowed a replacement?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-shoulder-injury-final-test-oval-gus-atkinson-key-wickets-2764514-2025-08-01",
      "headline": "Not looking good: England sweat on Chris Woakes' injury in Oval TestENG vs IND, 5th Test: Gus Atkinson shared an update on Chris Woakes, who walked off the park in the Oval Test after injuring his shoulder while trying to stop the ball from going to the boundary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-heavy-workload-jasprit-bumrah-2764509-2025-08-01",
      "headline": "India shield Bumrah, but is Siraj carrying the real burden?ENG vs IND: Jasprit Bumrah is being managed for his workload, but what about Mohammed Siraj, who has been a key part of India's fast bowling setup in the purest format?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-jasprit-bumrahs-workload-oval-2764477-2025-08-01",
      "headline": "Bumrah isn't picking and choosing games, team's managing his body: Ten DoeschateEngland vs India: India's assistant coach Ryan Ten Doeschate revealed that fast bowler Jasprit Bumrah isn't picking and choosing games, and the team management is managing his workload to respect his body condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-ends-8-year-wait-for-half-century-2764465-2025-08-01",
      "headline": "ENG vs IND: Karun Nair ends 8-Year wait for fifty, breathes life into career revivalIndia batter Karun Nair ended his eight-year wait for a half-century on Day 1 of the fifth Test against England at the Oval. He scored an unbeaten 52* to help India survive a challenging day under overcast conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-shoulder-injury-final-test-oval-gus-atkinson-key-wickets-2764514-2025-08-01",
      "headline": "Not looking good: England sweat on Chris Woakes' injury in Oval TestENG vs IND, 5th Test: Gus Atkinson shared an update on Chris Woakes, who walked off the park in the Oval Test after injuring his shoulder while trying to stop the ball from going to the boundary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-heavy-workload-jasprit-bumrah-2764509-2025-08-01",
      "headline": "India shield Bumrah, but is Siraj carrying the real burden?ENG vs IND: Jasprit Bumrah is being managed for his workload, but what about Mohammed Siraj, who has been a key part of India's fast bowling setup in the purest format?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-jasprit-bumrahs-workload-oval-2764477-2025-08-01",
      "headline": "Bumrah isn't picking and choosing games, team's managing his body: Ten DoeschateEngland vs India: India's assistant coach Ryan Ten Doeschate revealed that fast bowler Jasprit Bumrah isn't picking and choosing games, and the team management is managing his workload to respect his body condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-ends-8-year-wait-for-half-century-2764465-2025-08-01",
      "headline": "ENG vs IND: Karun Nair ends 8-Year wait for fifty, breathes life into career revivalIndia batter Karun Nair ended his eight-year wait for a half-century on Day 1 of the fifth Test against England at the Oval. He scored an unbeaten 52* to help India survive a challenging day under overcast conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-karun-nair-shubman-gill-sai-sudharsan-josh-tongue-2764431-2025-08-01",
      "headline": "Oval Test: Karun Nair's fighting fifty helps India survive challenging Day 1Being asked to bat first under overcast conditions on a green top at the Oval, India managed to survive through the day as Sai Sudharsan and Karun Nair played gritty knocks. Gus Atkinson and Josh Tongue picked two wickets each for England as the hosts managed to scalp six wickets in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-day-2-devon-conway-daryl-mitchell-bulawayo-report-2764447-2025-07-31",
      "headline": "Zimbabwe fight on but Conway, Mitchell fifties keep New Zealand in frontNew Zealand maintained their advantage on Day 2 of the second Test against Zimbabwe, with fifties from Devon Conway and Daryl Mitchell securing a valuable first-innings lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-andre-agassi-training-toronto-open-2764405-2025-07-31",
      "headline": "He makes things simple on the court: Rune delighted to work with AgassiWorld No. 9 Holger Rune described his three-day training camp with Andre Agassi as \"insane\" and eye-opening, praising the legend for simplifying the game and offering a fresh perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lucas-paqueta-west-ham-united-gambling-betting-charges-2764401-2025-07-31",
      "headline": "Lucas Paqueta cleared of alleged gambling charges, West Ham confirmsWest Ham's Lucas Paqueta has been cleared of four serious betting rule breaches after an independent FA panel found the charges \"not proven.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/conor-mcgregor-sexual-assault-case-appeal-2764384-2025-07-31",
      "headline": "Conor McGregor loses appeal against civil jury's finding in sexual assault caseConor McGregor has lost his appeal against a civil court ruling that found him liable for sexually assaulting Nikita Hand at a Dublin hotel in 2018. A jury had earlier ruled in Hand's favour, stating McGregor brutally raped and assaulted her in a penthouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-red-bull-stay-2026-season-2764381-2025-07-31",
      "headline": "Max Verstappen confirms Red Bull stay for 2026 seasonMax Verstappen has ended all speculations of a switch to Mercedes as he confirmed that he will be staying at Red Bull for the 2026 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-abhimanyu-easwarans-father-questions-indias-selection-calls-karun-nair-2764371-2025-07-31",
      "headline": "Easwaran's father questions selection calls: Karun wasn't there when my son scoredAbhimanyu Easwaran's father Ranganathan Easwaran, has questioned India's selection decisions after his son was once again overlooked for the fifth Test against England at the Oval. Abhimanyu is waiting for his debut after earning his maiden call-up back in December 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-womens-t20-world-cup-qualfiiers-2764359-2025-07-31",
      "headline": "Nepal to host Women's T20 World Cup 2026 QualifiersThe Women's T20 World Cup 2026 Qualifier will take place in Nepal from January 12 to February 2 at the Lower Mulpani and Upper Mulpani Stadiums in Kathmandu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/conor-mcgregor-sexual-assault-case-appeal-2764384-2025-07-31",
      "headline": "Conor McGregor loses appeal against civil jury's finding in sexual assault caseConor McGregor has lost his appeal against a civil court ruling that found him liable for sexually assaulting Nikita Hand at a Dublin hotel in 2018. A jury had earlier ruled in Hand's favour, stating McGregor brutally raped and assaulted her in a penthouse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/max-verstappen-red-bull-stay-2026-season-2764381-2025-07-31",
      "headline": "Max Verstappen confirms Red Bull stay for 2026 seasonMax Verstappen has ended all speculations of a switch to Mercedes as he confirmed that he will be staying at Red Bull for the 2026 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-abhimanyu-easwarans-father-questions-indias-selection-calls-karun-nair-2764371-2025-07-31",
      "headline": "Easwaran's father questions selection calls: Karun wasn't there when my son scoredAbhimanyu Easwaran's father Ranganathan Easwaran, has questioned India's selection decisions after his son was once again overlooked for the fifth Test against England at the Oval. Abhimanyu is waiting for his debut after earning his maiden call-up back in December 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-womens-t20-world-cup-qualfiiers-2764359-2025-07-31",
      "headline": "Nepal to host Women's T20 World Cup 2026 QualifiersThe Women's T20 World Cup 2026 Qualifier will take place in Nepal from January 12 to February 2 at the Lower Mulpani and Upper Mulpani Stadiums in Kathmandu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-highlights-yashasvi-jaiswals-major-technical-concern-2764347-2025-07-31",
      "headline": "Sunil Gavaskar highlights Yashasvi Jaiswal's major technical concernLegendary India batter Sunil Gavaskar has highlighted a major concern in Yashasvi Jaiswal's technique following his failure in the first innings of the 5th Test against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jack-leach-nathan-lyon-england-best-spinner-2764343-2025-07-31",
      "headline": "Jack Leach is still England's best spinner in my eyes: Nathan LyonENG vs IND: Nathan Lyon said that Jack Leach remains the best spinner for England. Having last played back in October 2024, the left-armer Leach wasn't picked for the home series against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/ferrari-fred-vasseur-contract-extension-team-principal-formula-one-2764336-2025-07-31",
      "headline": "Ferrari confirm Vasseur's multi-year contract extension as team principalFerrari extended team principal Fred Vasseur's contract, signalling firm backing for his leadership despite a 268-point gap to McLaren in the standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-viktor-gyokeres-thierry-henry-comparisons-2764321-2025-07-31",
      "headline": "Arsenal's new signing Viktor Gyokeres plays down Thierry Henry comparisonsArsenal's Viktor Gyokeres played down the comparisons with Thierry Henry after donning the iconic No.14 shirt since his move from Sporting CP. He now hopes to ensure that he can contribute to the club's season, which will have massive expectations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-womens-odi-world-cup-india-home-2764317-2025-07-31",
      "headline": "India will be tough to beat in Women's ODI World Cup: Alyssa HealyAlyssa Healy said that India will be tough to beat in the Women's ODI World Cup later this year, given how Harmanpreet Kaur's team has played in home conditions in the last few months. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-michael-atherton-on-gautam-gambhir-2764303-2025-07-31",
      "headline": "3 successive Test series defeats would be a problem for Gambhir: Michael AthertonFormer England captain Michael Atherton has said that losing the ongoing series against England would mount problems for India head coach Gautam Gambhir, as the team has already lost the last two series under his tenure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anshul-kamboj-sourav-ganguly-england-vs-india-2764273-2025-07-31",
      "headline": "Don't judge Anshul Kamboj based on one Test match: Sourav GangulyENG vs IND: Former India captain Sourav Ganguly said Anshul Kamboj should not be judged based on just one Test and deserves a longer run of at least five matches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/breaking-barriers-bihars-new-sporting-heroes-show-the-way-forward-2764270-2025-07-31",
      "headline": "Breaking barriers: Bihar's new sporting heroes show the way forwardSpeaking at India Today's Woman Summit 2025, javelin thrower Nishi Kumari, archer Anshika Kumari, and rugby player Alpana Kumari shared their journeys toward sporting glory. The three athletes spoke about the unwavering support of their parents and highlighted their battles against the odds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-arshdeep-singh-kuldeep-yadav-2764212-2025-07-31",
      "headline": "Oval Test: Gautam Gambhir faces heat for Arshdeep, Kuldeep omissionGautam Gambhir was slammed on social media for his selection calls in the final Test against England at the Oval where the likes of Kuldeep Yadav and Arshdeep Singh were ignored. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-playing-xi-karun-nair-returns-jasprit-bumrah-rested-2764178-2025-07-31",
      "headline": "No Bumrah, Karun Nair gets 2nd chance as India make 4 changes for Oval TestJasprit Bumrah has been rested for the Oval Test while Karun Nair has got a second chance in England as India make four changes for the match. There was no debut for Arshdeep Singh and Kuldeep Yadav had to sit out of the game yet again. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}