{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-and-hdfc-kotak-mahindra-bank-sbi-union-bank-of-india-here-is-what-5-major-banks-are-charging-on-personal-loans-2829535-2025-12-02",
      "headline": "From ICICI and HDFC to SBI: Here's what 5 major banks are charging on personal loansBefore applying for a personal loan, it's worth knowing how much the leading banks are charging at the moment. Whether you prefer a private lender or a public-sector bank, understanding the latest interest rates can guide you towards a smarter borrowing decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rent-cars-credit-ca-explains-why-old-financial-wisdom-no-longer-works-2829466-2025-12-02",
      "headline": "Rent, cars, credit: CA explains why old financial wisdom no longer worksThe financial world young earners face today looks nothing like what their parents experienced. From renting to car ownership, an expert says that traditional advice no longer fits today's numbers, and sticking to it may do more harm than good."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-500-points-lower-nifty-below-26100-ril-down-1-percent-2829400-2025-12-02",
      "headline": "Sensex closes 500 points lower, Nifty below 26,100; RIL down 1%The S&P BSE Sensex lost 503.63 points to close at 85,138.27, while the NSE Nifty50 was down by 143.55 points to end at 26,032.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-open-for-bidding-tomorrow-subscribe-skip-rs-900-crore-issue-listing-gains-latest-gmp-2829397-2025-12-02",
      "headline": "Aequs IPO to open for bidding soon: Subscribe or skip the Rs 900 crore issue?Aequs IPO is sized at Rs 921.81 crore. This includes a fresh issue of 5.40 crore shares worth Rs 670 crore and an offer for sale (OFS) of 2.03 crore shares worth Rs 251.81 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/new-renting-rules-home-deposit-bengaluru-pune-delhi-rent-increase-repair-landlord-tennant-2829361-2025-12-02",
      "headline": "Planning to rent in 2025? Here's what changes with the new renting rulesOne of the biggest changes in the New Rent Rules 2025 is that all rental agreements must now be digitally stamped and registered online within 60 days"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10000-monthly-sip-vs-rs-12-lakh-yearly-lump-sum-which-is-better-for-wealth-creation-2829358-2025-12-02",
      "headline": "Rs 10,000 SIP vs Rs 1.2 lakh lump sum: Which creates more wealth?Is a Rs 10,000 monthly SIP smarter for long-term wealth, or does investing Rs 1.2 lakh at once create a bigger corpus? As markets turn unpredictable, this question is becoming more important for everyday investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-softens-silver-drops-why-are-they-losing-momentum-after-monday-rally-2829320-2025-12-02",
      "headline": "Gold softens, silver drops: Why are they losing momentum after Monday's rally?Gold and silver paused their strong rally from Monday, opening lower on Tuesday amid profit booking and weaker global sentiment. The dip raises a key question: why have the metals lost momentum so quickly?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nifty-29000-in-2026-global-brokerage-nomura-explained-2829295-2025-12-02",
      "headline": "Will Nifty cross 29,000 by 2026? Here's what this global brokerage expectsDomestic flows remain steady, earnings have held up better than expected, and the broader macro backdrop has turned more predictable. Together, these have opened the door for fresh medium-term forecasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-government-clarifies-on-da-basic-pay-merger-plans-details-here-2829259-2025-12-02",
      "headline": "8th Pay Commission: Government clarifies on DA-basic pay merger plans. Details hereResponding to a written question in the Lok Sabha, Minister of State for Finance Pankaj Chaudhary stated that there is no proposal at present to combine any part of the existing DA with basic pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-gmp-opening-soon-review-subscribe-skip-multibagger-market-jackpot-latest-gmp-2829221-2025-12-02",
      "headline": "Meesho IPO to open soon: Will it turn into next stock market jackpot? Check GMPMeesho IPO is a book-built issue worth Rs 5,421.20 crore. This includes a fresh issue of 38.29 crore shares worth Rs 4,250 crore and an offer for sale (OFS) of 10.55 crore shares worth Rs 1,171.20 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/the-dark-side-of-lending-loan-recovery-harassment-and-its-mental-health-impact-2829178-2025-12-02",
      "headline": "The dark side of lending: Loan recovery harassment and its mental health impactLoan recovery harassment is real, widespread, and it is silently pushing many into anxiety, depression, and even suicide."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/bajaj-housing-finance-share-price-down-why-9-percent-today-block-deal-stake-sale-2829166-2025-12-02",
      "headline": "Explained: Why Bajaj Housing Finance shares fell 9% todayBajaj Housing Finance stock has now slipped almost 10% in the past 5 days, 13% in the past month, 22.83% in the last 6 months, 28.85% over the past year and 41.46% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-300-points-lower-nifty-below-26200-hdfc-bank-down-2-percent-2829153-2025-12-02",
      "headline": "Sensex opens 300 points lower, Nifty below 26,200; HDFC Bank down 2%The S&P BSE Sensex was down by 132.28 points to 85,509.62, while the NSE Nifty50 lost 31.90 points to 26,143.85 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-ramakrishnan-chander-lic-new-md-experience-q2-results-share-price-2829142-2025-12-02",
      "headline": "Who is Ramakrishnan Chander, LIC's new Managing Director He joined LIC in 1990 as an Assistant Administrative Officer and has steadily moved up the ranks over the decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-december-16-mainboard-sme-meesho-wakefit-aequs-vidya-wires-2829138-2025-12-02",
      "headline": "Big December IPO lineup: Key details of Meesho, Aequs, Vidya Wires and 13 othersFour mainboard IPOs — Meesho, Wakefit Innovations, Aequs and Vidya Wires are scheduled to hit the market, while a long list of SME issues will follow through the month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-foreign-direct-investment-up-18-in-april-september-us-inflows-double-2828998-2025-12-01",
      "headline": "India's Foreign Direct Investment up 18% in April-September, US inflows doubleThe inflow from the US more than doubled to USD 6.62 billion during the period, according to the latest government data released on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-most-early-retirement-plans-fail-expert-breaks-down-the-real-problem-2828911-2025-12-01",
      "headline": "Why most early retirement plans fail: Expert breaks down the real problemMost people chasing early retirement don't fail because they earn too little, they fail because they rely on assumptions that don't hold up in real life. An expert explains where FIRE plans usually go wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/airbus-hit-by-fresh-a320-production-flaw-as-global-fleet-undergoes-urgent-software-fixes-report-2828925-2025-12-01",
      "headline": "Airbus hit by fresh A320 production flaw as global fleet undergoes fixes: ReportThe latest snag comes just as airlines worldwide, including Indian carriers, rush through emergency software upgrades ordered after regulators flagged a flight-control vulnerability linked to solar radiation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-moves-to-retain-high-taxes-on-tobacco-pan-masala-with-new-excise-cess-bills-2828880-2025-12-01",
      "headline": "Govt moves to retain high taxes on tobacco, pan masala with new excise, cess billsThe Central Excise (Amendment) Bill, 2025, proposes fresh excise duties on all tobacco products, while the Health Security se National Security Cess Bill, 2025, seeks a new cess on pan masala and other notified sin goods."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/legacy-tamil-series-gulshan-devaiah-madhavan-crime-family-drama-2829455-2025-12-02",
      "headline": "Gulshan Devaiah on Tamil debut with Madhavan in Legacy: A Satisfying Experience Actor Gulshan Devaiah discussed his role and working alongside Madhavan in the yet-to-be-released Tamil crime drama series Legacy, marking his Tamil debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaya-bachchan-calls-marriage-outdated-shares-views-on-love-and-family-2829492-2025-12-02",
      "headline": "Amitabh Bachchan may call marriage his biggest mistake, jokes Jaya Bachchan Actor-politician Jaya Bachchan offers frank opinions on marriage, her relationship with Amitabh Bachchan, and advice for her granddaughter during a rare interview, reflecting changing societal attitudes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-inside-the-big-will-byers-twist-that-changes-the-game-for-vecna-2829537-2025-12-02",
      "headline": "Stranger Things 5: Inside the big Will Byers twist that changes the game for Vecna Stranger Things Season 5 Volume I ends with a stunning twist as Will Byers unleashes powers stronger than anyone expected. The reveal reshapes the final battle against Vecna and shifts the focus away from Eleven for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bandhu-mitrula-abhinandanalatho-film-trivikram-venkatesh-telugu-culture-2829416-2025-12-02",
      "headline": "Trivikram's film with Venkatesh titled Bandhu Mitrula Abhinandanalatho: Reports Director Trivikram Srinivas and actor Venkatesh's first directorial collaboration begins with a reported title registration, stirring interest among Telugu film fans ahead of the film's shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-was-pushed-around-on-bollywood-set-until-i-faked-being-a-star-2829494-2025-12-02",
      "headline": "Dulquer Salmaan: Was pushed around on Bollywood set until I faked being a star Dulquer Salmaan shared his experience of creating the illusion of being a star in the Hindi film industry. He highlighted cultural differences and perception challenges between the film industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tate-mcrae-jack-hughes-dining-manhattan-relationship-rumours-2829446-2025-12-02",
      "headline": "Tate McRae seemingly shuts down romance rumours with NHL star Jack Hughes Singer Tate McRae has appeared to respond to recent rumours regarding her relationship with NHL player Jack Hughes following their dinner outing in New York City, prompting widespread speculation among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sean-diddy-combs-calls-netflix-docuseries-the-reckoning-shameful-hit-piece-50-cent-reacts-2829420-2025-12-02",
      "headline": "Sean Diddy Combs calls Netflix docuseries a shameful hit piece, 50 Cent reacts Sean Combs has criticised Netflix's upcoming docuseries, calling it unauthorised and \"shameful\". The 50 Cent-backed series claims to examine Combs's controversies but is already facing legal pushback over what his team says is stolen and improperly used footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-vaa-vaathiyaar-release-date-december-12-new-single-mu-dha-la-li-2829418-2025-12-02",
      "headline": "Karthi's Vaa Vaathiyaar set for grand release on December 12, 3rd single on Friday The much-anticipated film Vaa Vaathiyaar starring Karthi has locked December 12 as its new theatrical release date, following a brief postponement and fresh promotional activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-paparazzi-controversy-debate-kapoor-family-publicity-approach-2829407-2025-12-02",
      "headline": "Ranbir's team snubs paps after calling them, they claim to have invites. Video A recent encounter outside Sanjay Leela Bhansali's Mumbai office sparked conversation about Ranbir Kapoor's relationship with paparazzi, following contrasting statements from Kapoor family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-19-amaal-mallik-calls-himself-kabir-singh-of-music-talks-about-family-ties-2829392-2025-12-02",
      "headline": "Bigg Boss 19: Amaal Mallik says he is Kabir Singh of music, talks of family ties Singer Amaal Mallik defended his actions on 'Bigg Boss Season 19', while mentioning that his real-life persona is equally confrontational. He revealed he told his family to \"cut off ties\" if his conduct damaged them, adding that he follows his heart, regardless of audience approval."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sienna-miller-confirms-third-pregnancy-with-partner-oli-green-debuts-baby-bump-2829386-2025-12-02",
      "headline": "Sienna Miller confirms third pregnancy with partner Oli Green, debuts baby bump Sienna Miller surprised everyone at the 2025 Fashion Awards by debuting her baby bump, announcing she is expecting her third child with boyfriend Oli Green. The actor is already mother to a 13-year-old daughter and a two-year-old baby girl."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billie-eilish-fitted-equestrian-outfit-criticises-billionaires-public-dispute-elon-musk-2829395-2025-12-02",
      "headline": "Billie Eilish looks unrecognisable in tight gym-wear instead of baggy fits Singer Billie Eilish made headlines in Los Angeles after changing her usual style during a solo horseback ride, amid a public dispute with Elon Musk over wealth and philanthropy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-khanna-says-raat-gayi-baat-gayi-comment-was-from-a-game-not-moral-stand-2829396-2025-12-02",
      "headline": "Twinkle Khanna says Raat Gayi Baat Gayi comment was from a game, not moral stand Twinkle Khanna clarified that her viral \"raat gayi baat gayi\" remark from Too Much was simply part of a fun game segment and not a comment on infidelity or monogamy. She also opened up about her easy rapport with Kajol and how the show pushed her creatively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyan-advises-fans-on-self-discipline-and-social-media-use-at-fanly-entertainment-launch-2829389-2025-12-02",
      "headline": "Sivakarthikeyan's thoughtful message to fans: Worship parents and God, not me At an app launch event in Chennai, actor Sivakarthikeyan advised fans to focus on family and personal growth instead of fan worship, highlighting the importance of constructive use of time and responsible social media engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/neeraj-ghaywan-praises-bison-kaalamadan-sports-biopic-netflix-2829387-2025-12-02",
      "headline": "Director Neeraj Ghaywan praises Mari Selvaraj's Bison: Sports biopic done right Director Neeraj Ghaywan praised Mari Selvaraj's Bison Kaalamadan as a sports biopic done right. The film's emotional depth and powerful performances have won acclaim following its Netflix release."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-visits-batu-caves-murugan-temple-ahead-of-racing-events-and-upcoming-film-2829365-2025-12-02",
      "headline": "Actor Ajith Kumar prays at Batu Caves before Malaysia race. Watch video Ajith Kumar visited Malaysia's Batu Caves Murugan temple recently. The actor's appearance surprised fans, who expressed their excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-rock-disses-superhero-films-at-gotham-awards-not-everyone-needs-a-cape-2829367-2025-12-02",
      "headline": "Chris Rock disses superhero films at Gotham Awards: Not everyone needs a cape At the 35th Gotham Awards in Manhattan, Chris Rock delivered a witty critique of Hollywood's superhero obsession. He also emphasised the value of independent storytelling beyond franchises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/censor-board-re-examines-dhurandhar-says-film-not-linked-to-major-mohit-sharma-2829364-2025-12-02",
      "headline": "Censor board re-examines Dhurandhar, says film not linked to Major Mohit Sharma The CBFC rejected the objections of Major Mohit Sharma's family, concluding Ranveer Singh's 'Dhurandhar' is \"purely fictional\" and bears no resemblance to the officer's life. This decision follows a Delhi High Court directive to re-examine the film."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-refused-to-cut-holocaust-plot-from-her-film-financier-withdrew-2829327-2025-12-02",
      "headline": "Scarlett Johansson refused to cut Holocaust plot from her film, financier withdrew Scarlett Johansson revealed about facing funding threats over Holocaust content in her directorial debut 'Eleanor the Great'. Sony Pictures Classics stepped in after a financier dropped out, allowing filming to continue."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/imran-khan-sister-allowed-meeting-adiala-jail-rawalpindi-pakistan-protests-2829497-2025-12-02",
      "headline": "What Imran Khan's sister said after meeting him in jail amid death rumoursImran Khan's sister was allowed to meet the jailed ex-PM even as his supporters and party workers threatened to organise mass protests across Rawalpindi on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-opposition-reach-sir-compromise-parliament-discussion-on-electoral-reforms-next-week-2829423-2025-12-02",
      "headline": "Centre, Opposition reach SIR truce, electoral reforms discussion next weekUnion Minister Kiren Rijiju announced that a discussion on the 150th anniversary of the national song Vande Mataram will be held in the Lok Sabha on Monday, followed by a discussion on election reforms from 12 noon on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-under-fire-for-sending-expired-flood-relief-to-sri-lanka-photos-go-viral-2829349-2025-12-02",
      "headline": "Pakistan under fire for sending expired flood relief to Sri Lanka, photos go viralPakistan's attempt to aid Sri Lanka backfired due to expired relief supplies, drawing social media backlash. Meanwhile, India intensified its support with extensive rescue and relief operations under its Neighbourhood First policy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/sanchar-loses-a-saathi-as-jyotiraditya-scindia-fails-to-do-a-nitin-gadkari-smartphone-makers-pre-installed-app-controversy-2829524-2025-12-02",
      "headline": "Sanchar loses a Saathi as Scindia fails to do a GadkariThe government and its Sanchar Saathi app were meant to work 24x7 for phone users. Snooping fears made people protest, and communications minister Jyotiraditya Scindia made the app optional. People fail to realise the benefits of moves until they are shoved down their throats, like Nitin Gadkari did with ethanol-mixed petrol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/viral-video-rishab-shetty-signals-no-to-ranveer-singh-kantara-mimicry-2829335-2025-12-02",
      "headline": "Viral video: Rishab Shetty signals 'no' to Ranveer Singh's Kantara mimicryA viral IFFI 2025 video shows Rishab Shetty expressing his disapproval as Ranveer Singh mimics his Kantara Daiva performance, sparking backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/telangana-cm-revanth-reddy-hindu-deities-hanuman-controversy-2829472-2025-12-02",
      "headline": "One God for drinkers, one for...: Revanth Reddy's Hindu deities remark stirs rowTelangana Chief Minister Revanth Reddy allegedly mocked the existence of multiple Hindu deities and even went on to say that Hanuman was the god of the unmarried."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bangladesh-ties-beyond-sheikh-hasina-pm-modi-khaleda-zia-post-bnp-jamaat-elections-2829376-2025-12-02",
      "headline": "Ties moving beyond Sheikh Hasina? PM's message for Khaleda Zia sparks chatterIndia-Bangladesh ties: Amid strained ties, recent gestures from India and Bangladesh hint at a careful thaw. The breakthrough began with the Bangladesh NSA's quiet trip to New Delhi, followed by PM Modi's post for the ailing Khaleda Zia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-cricket-humour-justice-sundaresh-mukul-rohatgi-viral-social-media-2829514-2025-12-02",
      "headline": "Losing Tests: Gambhir, Team India spark courtroom laughter in judge-lawyer banterDuring the proceedings, Justice Sundresh, referring to the India-SA Test series, said, \"See now the performance of the Indian team. When you concentrate more on T20 and one-day formats, you will lose Test matches.\" In response, advocate Mukul Rohatgi jokingly said that he had asked his \"client,\" Gautam Gambhir, to stop if India was losing at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/tamil-nadu-election-2026-Tamilakams-travels-and-travails-civilisational-flames-to-political-fire-storms-part-1-318-02-12-2025",
      "headline": "Tamilakam's travels and travails: Civilisational flames to political fire-stormsTamil Nadu is the graveyard of national political parties. It buried the Congress at its peak then in 1967. The BJP, also at its peak now, has been pregnant with possibilities but has failed to deliver. Never a serious player in the state before the dawn of the Modi-era, the BJP has been humbled in every election since his arrival in 2014 (2019, 2021 and 2024)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazons-siddharth-bhagat-breaks-down-indias-new-beauty-economy-from-global-trends-to-tech-led-discovery-2825952-2025-11-26",
      "headline": "Amazon's Siddharth Bhagat Breaks Down India's New Beauty Economy—From Global Trends to Tech-Led DiscoveryTracing India's changing beauty codes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sringeri-blessed-devavrat-rekhe-felicitated-historic-vedic-feat-in-200-years-2829226-2025-12-02",
      "headline": "19-year-old Mahesh Rekhe achieves historic Vedic feat after 200 years, PM reactsScholars noted that Dandakrama, revered as the crown of Vedic recitation for its complex svara-patterns and phonetic precision, has been performed only three times in recorded history, with Devavrat's recitation being flawless and completed in the shortest span."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sanchar-saathi-not-mandatory-users-can-delete-if-they-want-to-ministers-big-clarification-after-backlash-2829279-2025-12-02",
      "headline": "Government backtracks on Sanchar Saathi after backlash, says app not mandatorySanchar Saathi app: Jyotiraditya Scindia's clarification comes amid a massive uproar over Centre's directions to phone manufacturers to pre-install the Sanchar Saathi app on all phones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-apologises-kantara-mimicry-iffi-cultural-sensitivity-debate-2829224-2025-12-02",
      "headline": "My only intention was…: Ranveer Singh apologises after row over Kantara mimicryRanveer Singh issued an apology after facing criticism for mimicking a scene from Rishab Shetty's Kantara: Chapter 1 at IFFI, emphasising his respect for the film and clarifying that his act was intended as a tribute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-a320-flights-without-valid-airworthiness-review-certificate-november-2025-2829412-2025-12-02",
      "headline": "Air India Airbus flew without safety certificate for whole month, staff suspendedAn internal investigation has been launched after an Air India A320 operated multiple flights in November without the required Airworthiness Review Certificate. Air India reported the incident to the Directorate General of Civil Aviation and suspended all personnel linked to the compliance lapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ram-janmabhoomi-mathura-gyanvapi-dispute-kk-muhammed-urges-restraint-resolution-2828953-2025-12-01",
      "headline": "Muslims should give up Gyanvapi, Hindus must stop new demands: KK MuhammedFormer Archaeological Survey of India (ASI) regional director KK Muhammed pointed out that Mathura and Gyanvapi are two other places, apart from Ram Janmabhoomi, that are \"as important for the Hindu community as Mecca and Medina are for Muslims.\" He warned that pursuing additional claims would not resolve the issue and could lead to further conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-panchayat-local-body-elections-munnar-bjp-candidate-sonia-gandhi-vs-congress-2829481-2025-12-02",
      "headline": "BJP fields Sonia Gandhi in panchayat poll in Kerala's MunnarThe BJP has fielded a candidate named Sonia Gandhi in the upcoming local body and panchayat polls in Kerala's Munnar. The BJP's Sonia Gandhi was named after former Congress chief Sonia Gandhi, and one of her parents had been with the Grand Old Party before she married a BJP leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/siddhi-jain-drops-iit-makes-history-as-ndas-first-woman-presidents-medalist-2829571-2025-12-02",
      "headline": "Siddhi Jain drops IIT, makes history as NDA's first woman President's MedalistCadet Siddhi Jain, who once prepared for IIT-JEE, has created history by becoming the first woman to win the President's Medal at the NDA's 149th Passing Out Parade. After clearing the exam on her second attempt, she now heads to the Air Force Academy, inspiring girls across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-allowed-how-rahul-gandhi-reacted-to-renuka-chowdhury-bringing-pet-to-parliament-2829461-2025-12-02",
      "headline": "Not allowed? How Rahul Gandhi reacted to Renuka Chowdhury bringing pet to ParliamentA day ago, Congress MP Renuka Chowdhury stirred a controversy by bringing a stray dog inside Parliament. Many MPs objected to her action; however, Chowdhury stood firm in her position. Today, Gandhi backed her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sanchar-saathi-app-cant-be-disabled-or-restricted-jyotiraditya-scindia-telecom-minister-ministry-directive-2829366-2025-12-02",
      "headline": "Sanchar Saathi app can't be disabled or restricted: Central directive vs MinisterUnion Telecom Minister Jyotiraditya Scindia said the Sanchaar Saathi app is optional and users can delete it, but the government directive says the app's functions cannot be disabled or restricted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-nidimorus-ex-wife-shhyamali-de-makes-first-post-after-his-wedding-to-samantha-2829317-2025-12-02",
      "headline": "Raj Nidimoru's ex-wife Shhyamali De shares first post after his wedding to SamanthaSamantha Ruth Prabhu and Raj Nidimoru's yogic wedding at the Isha Foundation drew attention online after Raj's ex-wife Shhyamali De shared a series of cryptic social media posts. Her messages, posted before and after the ceremony, sparked curiosity amid the couple's new beginning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/what-jude-law-in-the-holiday-did-not-tell-you-about-dating-as-a-single-parent-india-2829348-2025-12-02",
      "headline": "What Jude Law in The Holiday did not tell you about dating as a single parentIt's 2025, and if you think dating life for single parents is any better, think again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-khaleda-zia-life-support-son-bnp-tarique-rahman-absent-london-dhaka-election-lead-jamaat-threat-yunus-2829359-2025-12-02",
      "headline": "Khaleda Zia on life support, why son, heir Tarique Rahman isn't with her?While his mother and BNP chief Khaleda Zia is battling for life in a Dhaka hospital, her son and heir-apparent Tarique Rahman remains in London in exile. Both Rahman and the BNP are eager for the return and even the Muhammed Yunus-led interim administration has offered help. What are the \"uncontrollable factors\" that Rahman says are holding him back?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bride-asks-groom-to-get-bulb-on-wedding-night-he-vanishes-found-after-5-days-2829363-2025-12-02",
      "headline": "Bride asks for bulb on wedding night, nervous groom vanishes; found after 5 daysA groom from Meerut vanished on his wedding night, sparking panic and sorrow in his family. After five days, he was found safe in Haridwar, revealing mental stress as the cause of his disappearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/lionel-messi-india-tour-football-match-revanth-reddy-political-messaging-2829437-2025-12-02",
      "headline": "When Messi meets Revanth, football becomes a political branding free-kickTelangana Chief Minister Revanth Reddy is expected to feature in an exhibition match against football legend Lionel Messi during his India tour. The headline is no longer 'Lionel Messi in Hyderabad'. It is now 'Lionel Messi vs Revanth Reddy' in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/legacy-tamil-series-gulshan-devaiah-madhavan-crime-family-drama-2829455-2025-12-02",
      "headline": "Gulshan Devaiah on Tamil debut with Madhavan in Legacy: A Satisfying ExperienceActor Gulshan Devaiah discussed his role and working alongside Madhavan in the yet-to-be-released Tamil crime drama series Legacy, marking his Tamil debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaya-bachchan-calls-marriage-outdated-shares-views-on-love-and-family-2829492-2025-12-02",
      "headline": "Amitabh Bachchan may call marriage his biggest mistake, jokes Jaya BachchanActor-politician Jaya Bachchan offers frank opinions on marriage, her relationship with Amitabh Bachchan, and advice for her granddaughter during a rare interview, reflecting changing societal attitudes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/telangana-cm-revanth-reddy-football-match-lionel-messi-hyderabad-2829572-2025-12-02",
      "headline": "Revanth Reddy vs Lionel Messi: Telangana CM trains hard for Hyderabad face-off Telangana Chief Minister Revanth Reddy hit the field at the MCHRD grounds as he continued preparations for his much-anticipated friendly football match against Argentina legend Lionel Messi on December 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-gautam-gambhir-supreme-court-judge-2829567-2025-12-02",
      "headline": "Sorry state of Gautam Gambhir's Indian Test team reaches Supreme Court Supreme Court judge MM Sundaresh candidly referred to India's sorry state of affairs in Test cricket. The judge said that India's focus on white-ball cricket had ruined the Test team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-odis-harshit-rana-breaks-silence-social-media-trolling-2829556-2025-12-02",
      "headline": "After Ranchi heroics, Harshit Rana opens up on dealing with online trolling Amid accusations that head coach Gautam Gambhir favours him, Harshit Rana has often been the target of online criticism. But the young pacer says he blocks out the noise, knowing that paying attention to it would only take away the freedom he needs to bowl at his best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-syed-mushtaq-ali-trophy-mumbai-vs-assam-ipl-auction-2829540-2025-12-02",
      "headline": "Sarfaraz Khan back in IPL? Mumbai star smashes 47-ball century in SMAT Syed Mushtaq Ali Trophy 2025: Sarfaraz Khan struck his first T20 hundred to help Mumbai thrash Assam by 98 runs on Tuesday. His performance could boost IPL auction prospects amid strong demand for middle-order batters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-2025-hardik-pandya-clicks-selfie-pitch-invader-video-2829451-2025-12-02",
      "headline": "Hardik Pandya clicks selfie with pitch invader during SMAT 2025 clash: Watch India all-rounder Hardik Pandya's return to competitive cricket for Baroda in the Syed Mushtaq Ali Trophy has been carefully observed by selectors and team management, with his fitness under scrutiny following his recent injury and the upcoming Asia Cup final against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-playing-with-rohit-sharma-virat-kohli-brings-different-confidence-tilak-varma-2829450-2025-12-02",
      "headline": "Playing with Rohit Sharma and Virat Kohli brings a different confidence: Tilak Varma India batter Tilak Varma enjoys the longer formats and has been seeking input from Virat Kohli on fitness and running between the wickets as he looks to make the most of the opportunities coming his way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-smith-dies-aged-62-england-cricketer-hampshire-captain-2829447-2025-12-02",
      "headline": "Robin Smith, former England batsman, dies aged 62 Former England cricketer Robin Smith died at the age of 62 at his residence in Perth on Monday. His passing has brought widespread tributes, highlighting his courage against fast bowling and openness about mental health struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-odi-rohit-sharma-2007-t20-world-cup-temba-bavuma-nostalgia-trip-2829406-2025-12-02",
      "headline": "Bavuma goes on a nostalgia trip, recalls watching Rohit Sharma in 2007 T20 World Cup Temba Bavuma draws on memories of Rohit Sharma's early days as he assesses the influence of experienced Indian stars ahead of the ongoing series, emphasising the value of seasoned players and the demand for more top-level cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-baroda-vs-punjab-smat-2829411-2025-12-02",
      "headline": "Hardik Pandya returns to cricket, trumps Punjab with whirlwind 77-run knock SMAT 2025: Indian superstar Hardik Pandya made a tremendous return from injury. The all-rounder's heroics helped Baroda trump Punjab's total of 222 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-new-zealand-1st-test-day-1-score-christchurch-2829380-2025-12-02",
      "headline": "West Indies paces fire, leave New Zealand on ropes on Day 1 NZ vs WI, 1st Test: West Indies delivered a disciplined fast bowling performance to restrict New Zealand to 231 for nine on day one. The early wickets put the Black Caps under pressure as bad light stopped play prematurely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-smith-dies-aged-62-england-cricketer-hampshire-captain-2829447-2025-12-02",
      "headline": "Robin Smith, former England batsman, dies aged 62 Former England cricketer Robin Smith died at the age of 62 at his residence in Perth on Monday. His passing has brought widespread tributes, highlighting his courage against fast bowling and openness about mental health struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-odi-rohit-sharma-2007-t20-world-cup-temba-bavuma-nostalgia-trip-2829406-2025-12-02",
      "headline": "Bavuma goes on a nostalgia trip, recalls watching Rohit Sharma in 2007 T20 World Cup Temba Bavuma draws on memories of Rohit Sharma's early days as he assesses the influence of experienced Indian stars ahead of the ongoing series, emphasising the value of seasoned players and the demand for more top-level cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-baroda-vs-punjab-smat-2829411-2025-12-02",
      "headline": "Hardik Pandya returns to cricket, trumps Punjab with whirlwind 77-run knock SMAT 2025: Indian superstar Hardik Pandya made a tremendous return from injury. The all-rounder's heroics helped Baroda trump Punjab's total of 222 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-new-zealand-1st-test-day-1-score-christchurch-2829380-2025-12-02",
      "headline": "West Indies paces fire, leave New Zealand on ropes on Day 1 NZ vs WI, 1st Test: West Indies delivered a disciplined fast bowling performance to restrict New Zealand to 231 for nine on day one. The early wickets put the Black Caps under pressure as bad light stopped play prematurely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/barcelona-ronald-araujo-indefinite-leave-ucl-red-card-chelsea-struggles-2829357-2025-12-02",
      "headline": "Barcelona captain Ronald Araujo sent on indefinite leave after Chelsea debacleBarcelona have sent their captain and defender Ronald Araujo on an indefinite leave as the Uruguayan continues to struggle to recover from his horror performance against Chelsea in the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ravi-shastri-gautam-gambhir-podcast-guwahati-2829324-2025-12-02",
      "headline": "Ravi Shastri accused of shielding Gautam Gambhir after comments on Test declineIndia vs South Africa: Ravi Shastri backed Gautam Gambhir's view on India's batters failing during their 0–2 Test series defeat in November. However, the former head coach added he would have taken responsibility for the losses instead of criticising players publicly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-eng-ashes-usman-khawaja-injury-2829312-2025-12-02",
      "headline": "Usman Khawaja ruled out of 2nd Ashes Test as questions on his future lingerAshes: Australia opener Usman Khawaja has been ruled out of the 2nd Test match of the series. The left-hander was unable to recover from back spasms he suffered in the opening Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mushtaq-ali-trophy-vaibhav-suryavanshi-century-bihar-vs-maharashtra-2829282-2025-12-02",
      "headline": "Unstoppable. Vaibhav Suryavanshi hits 3rd T20 century before turning 15Syed Mushtaq Ali Trophy: 14-year-old Vaibhav Suryavanshi smashed 108 off 61 balls for Bihar against Maharashtra at Eden Gardens on Tuesday. Hitting seven sixes and as many boundaries, the opening batter notched up his maiden hundred in the domestic T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-playing-xi-will-jacks-replaces-mark-wood-brisbane-test-australia-2829278-2025-12-02",
      "headline": "Pink-ball Ashes Test: England beef up batting, replace Mark Wood with Will JacksEngland have decided to beef up their batting lineup for the pink-ball Test in Brisbane by bringing in Will Jacks to replace Mark Wood. The match begins on December 4 with Australia leading the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahmanullah-gurbaz-defends-gautam-gambhir-india-coach-criticism-south-africa-series-2829258-2025-12-02",
      "headline": "Gambhir backlash makes no sense, he is the best coach and human: Ex-KKR starFormer KKR star Rahmanullah Gurbaz jumped to the defence of Gautam Gambhir after the Indian coach was heavily criticised for the loss to South Africa in the recent Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arjun-tendulkar-syed-mushtaq-ali-trophy-goa-vs-madhya-pradesh-bowling-2829239-2025-12-02",
      "headline": "Arjun Tendulkar continues red-hot form with ball after big IPL tradeArjun Tendulkar continued his impressive bowling for Goa in the Syed Mushtaq Ali Trophy. He took three wickets and smashed a quickfire 16 in their 7-wicket win against Madhya Pradesh on Tuesday in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mushtaq-ali-trophy-vaibhav-suryavanshi-century-bihar-vs-maharashtra-2829282-2025-12-02",
      "headline": "Unstoppable. Vaibhav Suryavanshi hits 3rd T20 century before turning 15Syed Mushtaq Ali Trophy: 14-year-old Vaibhav Suryavanshi smashed 108 off 61 balls for Bihar against Maharashtra at Eden Gardens on Tuesday. Hitting seven sixes and as many boundaries, the opening batter notched up his maiden hundred in the domestic T20 tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-playing-xi-will-jacks-replaces-mark-wood-brisbane-test-australia-2829278-2025-12-02",
      "headline": "Pink-ball Ashes Test: England beef up batting, replace Mark Wood with Will JacksEngland have decided to beef up their batting lineup for the pink-ball Test in Brisbane by bringing in Will Jacks to replace Mark Wood. The match begins on December 4 with Australia leading the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahmanullah-gurbaz-defends-gautam-gambhir-india-coach-criticism-south-africa-series-2829258-2025-12-02",
      "headline": "Gambhir backlash makes no sense, he is the best coach and human: Ex-KKR starFormer KKR star Rahmanullah Gurbaz jumped to the defence of Gautam Gambhir after the Indian coach was heavily criticised for the loss to South Africa in the recent Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arjun-tendulkar-syed-mushtaq-ali-trophy-goa-vs-madhya-pradesh-bowling-2829239-2025-12-02",
      "headline": "Arjun Tendulkar continues red-hot form with ball after big IPL tradeArjun Tendulkar continued his impressive bowling for Goa in the Syed Mushtaq Ali Trophy. He took three wickets and smashed a quickfire 16 in their 7-wicket win against Madhya Pradesh on Tuesday in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-sjoerd-marijne-return-womens-team-coach-harendra-singh-resignation-2829229-2025-12-02",
      "headline": "Hockey India eyeing Marijne return to women's team as Harendra Singh resignsHockey India have reportedly approached Sjoerd Marijne to become the new women's team head coach after Harendra Singh's exit from the role. Marijne could be set for a second stint with the team after initially joining them in 2017. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-glenn-maxwell-pulls-out-statement-2829214-2025-12-02",
      "headline": "Australia's Glenn Maxwell pulls out of 2026 mini auction, hints at ending IPL careerAustralia all-rounder Glenn Maxwell has confirmed that he will not enter the IPL 2026 mini-auction. The 37-year-old becomes the latest player to withdraw from next season, following Andre Russell and Faf du Plessis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-injury-santos-heroics-world-cup-2026-ancelotti-decision-2829199-2025-12-02",
      "headline": "Neymar's last push for FIFA World Cup 2026: The prince goes all-out to save his legacyNeymar's fight for a place at the 2026 World Cup has become a race against time. Playing through injury, the 33-year-old is pushing his limits to keep both Santos and his Brazil dreams alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-arrival-raipur-children-roses-india-south-africa-second-odi-2829184-2025-12-02",
      "headline": "Watch: Virat Kohli touched as kids with roses welcome batting star in RaipurIndia vs South Africa, 2nd ODI: Virat Kohli was greeted by a group of young fans holding roses outside the Indian team hotel in Raipur, a day after his match-winning hundred in Ranchi. Kohli's arrival generated excitement as the team prepared for the second ODI against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-52nd-odi-century-rohit-sharma-viral-dressing-room-reaction-ranchi-2829133-2025-12-02",
      "headline": "What did Rohit Sharma say after Virat Kohli's Ranchi hundred? Arshdeep revealsArshdeep Singh revealed what Rohit Sharma said after Virat Kohli's hundred in Ranchi against South Africa. Rohit's reaction from the dressing room had gone viral after the star batter got to the landmark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashwin-slams-india-selection-nitish-kumar-reddy-snub-south-africa-series-2025-2829141-2025-12-02",
      "headline": "Why was Nitish Reddy picked? R Ashwin slams India squad selection for SA seriesR Ashwin has slammed the Indian squad selection for the South Africa series, as he questioned why Nitish Kumar Reddy is unable to find a spot in the playing XI. Nitish wasn't part of the side that defeated South Africa in the Ranchi ODI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-steve-smith-lead-overseas-stars-ipl-2026-mini-auction-inr-2-crore-base-price-2829113-2025-12-02",
      "headline": "Green headlines 1355-player IPL 2026 auction list, Maxwell opts out: ReportsCameron Green and Steve Smith headline a group of major international and Indian names registered for the IPL 2026 mini-auction, scheduled for December 16 in Abu Dhabi. However, Glenn Maxwell has decided to opt out of the upcoming auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-crisis-fowler-david-james-arne-slot-2829110-2025-12-02",
      "headline": "Not the first tough spell, nor the last: Fowler and James trust Liverpool's revivalLiverpool legends Robbie Fowler and David James have urged calm despite the champions' difficult run. Both believe the club has enough resilience and quality to recover once key players return and stability returns to the squad."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}