{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-war-us-eyes-duty-free-car-exports-to-india-as-teslas-entry-nears-report-2689671-2025-03-06",
      "headline": "US eyes duty-free car exports to India as Tesla's entry nears: Report Tesla CEO Elon Musk has previously criticised the tariffs put by India on the import of cars from the US, calling them among the highest in the world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-founder-nithin-kamath-wins-ey-entrepreneur-of-the-year-award-2024-2689670-2025-03-06",
      "headline": "Zerodha's Nithin Kamath wins EY Entrepreneur of the Year Award 2024A self-made entrepreneur, Kamath has not only bootstrapped Zerodha to a billion-dollar valuation but also actively supports start-ups in fintech and climate space, and advocates for social initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-rise-for-second-consecutive-day-led-by-auto-stocks-ril-gains-2-percent-2689639-2025-03-06",
      "headline": "Sensex, Nifty rise for second consecutive day led by auto stocks; RIL gains 2%The S&P BSE Sensex jumped 325.45 points to 74,055.68, while the NSE Nifty50 added 99.05 points to 22,436.35 as of 9:20 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epf-withdrawal-via-upi-and-atms-coming-soon-all-you-need-to-know-2689399-2025-03-05",
      "headline": "EPF withdrawal via UPI and ATMs coming soon. All you need to knowThis new facility will allow EPF members to withdraw their savings instantly using UPI platforms like GPay, PhonePe, and Paytm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr1-sahaj-vs-itr4-sugam-check-key-differences-and-eligibility-2689364-2025-03-05",
      "headline": "ITR-1 (Sahaj) vs ITR-4 (Sugam): Check key differences and eligibility Commonly known as the Sahaj form, ITR-1 is a simple form for individuals with simple income sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-track-old-mutual-funds-investments-here-is-what-you-need-to-do-2689316-2025-03-05",
      "headline": "Want to track old mutual funds investments? Here's what you need to doWith millions of unclaimed folios, the Mitra platform aims to simplify the process of finding and reclaiming lost mutual fund investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-700-points-higher-nifty-snaps-10-day-losing-streak-2689296-2025-03-05",
      "headline": "Sensex ends 740 points higher, Nifty snaps 10-day losing streakThe S&P BSE Sensex ended 740.30 points higher to 73,730.23 at the closing bell, while the NSE Nifty50 settled 254.65 points lower at 22,337.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-better-returns-than-fixed-deposits-check-these-3-investment-options-nsc-ppf-government-bonds-gold-etfs-2689243-2025-03-05",
      "headline": "Looking for better returns than fixed deposits? Check these 3 investment optionsWith the RBI announcing a repo rate cut, banks have lowered fixed deposit rates, prompting investors to look for better alternatives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-dalal-street-relief-rally-losing-streak-finally-over-2689183-2025-03-05",
      "headline": "Sensex surges 900 points: Is Dalal Street's losing streak finally over?Today's relief rally in domestic equities is offering some much-needed respite to traders. But with trade tensions heating up, the volatility isn't going away anytime soon. Is this the beginning of a rebound or just a temporary surge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-could-hamper-taxpayers-digital-privacy-details-here-2689162-2025-03-05",
      "headline": "New income tax bill proposes allowing officers access to your email, social mediaThe new bill gives tax officers the authority to access computers, emails, and social media accounts, raising privacy concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-jumps-over-4-percent-after-ubs-target-price-upgrade-2689139-2025-03-05",
      "headline": "M&M shares rise over 4% after UBS upgrade. 3 things investors should know M&M stock price: The brokerage said the recent 19% correction in M&M's share price, compared to Nifty Auto's 13% decline, was an overreaction to EV-related concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/services-sector-growth-accelerates-in-february-backed-by-strong-demand-2689130-2025-03-05",
      "headline": "Services sector growth accelerates in February backed by strong demandHSBC's final India services Purchasing Managers' Index, compiled by S&P Global, rose to 59.0 in February from January's 26-month low of 56.5 but was lower than a preliminary estimate of 61.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-reciprocal-tariffs-us-president-donald-trump-congress-address-2689116-2025-03-05",
      "headline": "What are reciprocal tariffs that Donald Trump mentioned in Congress address?US President Donald Trump announced the implementation of reciprocal tariffs starting next month while addressing a joint session of the US Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-600-points-why-is-the-stock-market-rising-today-2689112-2025-03-05",
      "headline": "Sensex surges 800 points. Why is the stock market rising today?Today's rebound has brought much-needed relief to traders on Dalal Street, reviving hopes of a broader recovery in the days ahead. Here's what's driving the rally and whether the downturn has bottomed out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-coforge-shares-jumped-nearly-10-today-2689103-2025-03-05",
      "headline": "Explained: Why Coforge shares jumped nearly 10% todayCoforge share price: The stock reached an intraday high of Rs 7,924.50 in early trade and was up 8.65% to Rs 7,827.25 on the Bombay Stock Exchange (BSE) at 10:20 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-bounce-back-as-it-stocks-rally-investors-remain-wary-2689095-2025-03-05",
      "headline": "Sensex, Nifty bounce back as IT stocks rally; investors remain waryThe Nifty IT index jumped nearly 2%, buoyed by a 10 % surge in Coforge after it signed a 13-year, $1.56 billion deal with Sabre Corp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/struggling-to-find-your-old-mutual-fund-investments-sebis-mitra-help-track-unclaimed-mfs-2688839-2025-03-04",
      "headline": "Struggling to find your old mutual fund investments? Let Sebi's Mitra help With over 7.5 million inactive folios across different asset management companies (AMCs), Mitra is designed to help investors recover their forgotten investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/does-marriage-impact-your-credit-score-all-you-need-to-know-2688797-2025-03-04",
      "headline": "Does marriage impact your credit score? All you need to know While regular payments can improve both scores, any late or default on payments can considerably impact both the scores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-exports-under-pressure-as-us-and-eu-tighten-trade-policies-2688761-2025-03-04",
      "headline": "India's exports under pressure as US and EU tighten trade policiesUS President Donald Trump's plan to impose reciprocal tariffs from April is a major concern for Indian exporters, particularly in sectors like automobiles, agriculture, and manufacturing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nifty-falls-for-10th-straight-session-longest-daily-losing-streak-since-1996-2688757-2025-03-04",
      "headline": "Nifty falls for 10th straight day, longest daily losing streak since 1996 launchNifty has registered a 10-day losing streak amid multiple triggers, including relentless selling by foreign investors and fears of an escalating trade war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-as-trade-war-fears-keep-investors-on-edge-2688744-2025-03-04",
      "headline": "Sensex, Nifty end lower as trade war fears keep investors on edgeThe S&P BSE Sensex ended 96.01 points lower at 72,989.93 at the closing bell, while the NSE Nifty50 fell 36.65 points to 22,082.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-sensex-nifty-how-to-pick-quality-stocks-mutual-fund-investment-2688732-2025-03-04",
      "headline": "Stock market correction: Here's how to pick quality stocksDuring a market downturn, investors must be careful about stock selection. Choosing the right stocks can help minimise losses and create long-term gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-ceo-bhavish-aggarwal-wants-weekly-updates-from-staff-kya-chal-raha-hai-report-2688701-2025-03-04",
      "headline": "Ola CEO Bhavish Aggarwal wants weekly updates from staff: ReportUnder the new policy, employees must send a short email every week highlighting 3-5 key tasks they have completed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-cryptos-like-bitcoin-ethereum-xrp-cardano-solana-are-crashing-suddenly-2688685-2025-03-04",
      "headline": "Explained: Why popular cryptocurrencies are crashing suddenlyOver the last 24 hours, Bitcoin, the world's largest cryptocurrency, has lost 8.83%, currently trading at $83,461.02."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-in-hibernation-mode-why-have-public-listings-dried-off-dalal-street-slump-2688676-2025-03-04",
      "headline": "IPOs in hibernation mode: Why have public listings dried up?The last mainboard IPO to open for subscription was Quality Power on February 14, 2025. Since then, there has been no fresh activity in the public listing space."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/microchip-to-cut-2000-jobs-impacting-9-of-global-workforce-2688618-2025-03-04",
      "headline": "Microchip to cut 2,000 jobs, impacting 9% of global workforceMicrochip has reported five straight quarters of declining sales, with fourth-quarter revenue and profits falling below expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mixue-chinas-bubble-tea-giant-ipo-listing-share-jumps-over-47-percent-2688653-2025-03-04",
      "headline": "Mixue, China's bubble tea giant, makes a strong IPO debut with 47% stock jumpMixue, popular for its low-cost drinks and Snow King mascot, generated $444 million by offering 17 million shares at HK$202.5 each. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nifty-has-never-fallen-for-6-straight-months-will-march-offer-relief-2688652-2025-03-04",
      "headline": "Nifty stares at worst monthly losing streak. Can March turn the tide?If the situation does not improve in March, Nifty could fall for the sixth straight month, something that has never happened before. This could have a drastic impact on investor sentiments and make the situation worse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oyo-races-to-launch-ipo-as-debt-repayment-deadline-approaches-report-2688607-2025-03-04",
      "headline": "Oyo races to launch IPO as debt repayment deadline approaches: ReportOyo has been flirting with an IPO for years, but Covid-19 wrecked its earlier ambitions. Now, the hotel chain is talking to bankers again, targeting a valuation of up to $5 billion, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/citigroups-copy-paste-error-nearly-led-to-6-billion-transfer-2688592-2025-03-04",
      "headline": "Citigroup employee's error almost cost the bank $6 billion. Here's what happenedThe said error occurred during an attempted transfer of funds between the bank's internal accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-tariffs-spark-trade-war-what-it-means-for-global-stock-markets-economy-2688579-2025-03-04",
      "headline": "Trump's tariffs spark trade war: Will global economy pay a heavy price?Financial experts have warned that Donald Trump's tariffs could ignite a global trade war, disrupting supply chains and jeopardizing international trade flows built over decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trade-war-heats-up-china-strikes-back-at-us-after-donald-trump-tariffs-2688576-2025-03-04",
      "headline": "Trade war heats up: China strikes back at US after Trump's tariffs China's tariffs on the US come after President Donald Trump announced an additional 10% tariff on Chinese goods, bringing the total tariff level to 20%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-stock-market-still-overvalued-warren-buffett-key-indicator-signals-caution-2688569-2025-03-04",
      "headline": "Is stock market still overvalued? Warren Buffett's key indicator signals cautionSensex and Nifty have corrected nearly 15% from their all-time high and, despite these corrections, there are concerns that the stock markets remain expensive, and further downside could be possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-slams-donald-trumps-tariff-plans-act-of-war-2688551-2025-03-04",
      "headline": "Warren Buffett slams Trump's tariffs: They're an act of warWarren Buffett's comments come as Donald Trump has pushed ahead with new tariffs. Starting Tuesday, his administration will slap a 25% tariff on goods from Canada and Mexico. The US President is also hiking tariffs on Chinese imports, raising the rate from 10% to 20%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-says-oil-ministry-raised-281-billion-demand-in-gas-dispute-case-2688540-2025-03-04",
      "headline": "Reliance Industries says oil ministry raised $2.81 billion demand in gas dispute caseOn February 14, a division bench at Delhi High Court ruled against Reliance and its partners in a dispute regarding extraction of gas in a deepwater field in India's KG D6 block in the Krishna Godavari basin in the country's eastern coast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-fall-as-dalal-street-bloodbath-continues-3-reasons-why-2688536-2025-03-04",
      "headline": "Sensex, Nifty in red as Dalal Street bloodbath continues: 3 reasons whyThe S&P BSE Sensex was down 265.30 points to 72,820.64, while the NSE Nifty50 lost 104.85 points to 22,014.45 as of 9.40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-open-lower-as-donald-trumps-new-tariffs-spooks-dalal-street-2688520-2025-03-04",
      "headline": "Sensex, Nifty open in red as Trump's tariffs trigger global markets meltdownThe S&P BSE Sensex fell 368.03 points to 72,717.91, while the NSE Nifty50 lost 136.30 points to 21,982.70 as of 9:16 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/honda-to-build-next-civic-in-us-skips-mexico-over-tariff-concerns-donald-trump-report-2688509-2025-03-04",
      "headline": "Honda to build next Civic in US, skips Mexico over tariff concerns: ReportHonda has chosen Mexico because of rising costs that were making it tough to produce the car in Indiana, the US and Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-markets-jittery-dow-jones-us-market-falls-ahead-of-trump-tariffs-how-will-it-impact-dalal-street-2688501-2025-03-04",
      "headline": "Global markets jittery ahead of Trump tariffs: How will it impact Dalal Street?A decline in US stocks was witnessed, triggered by the latest tariff announcement from US President Donald Trump spooking Wall Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-capital-eyes-india-biggest-ipo-seeks-11-billion-valuation-report-2688305-2025-03-03",
      "headline": "Tata Capital eyes India's biggest IPO, seeks $11 billion valuation: ReportLast week, Tata Capital's board approved the listing of up to 230 million shares, including an offer for sale by existing shareholders. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'One Direction singer Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she talked about her struggles and healing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-parambrata-jokes-about-playing-a-cop-ahead-of-khakee-the-bengal-chapter-neeraj-pandey-2689496-2025-03-05",
      "headline": "Actor Parambrata jokes about playing a cop ahead of Khakee: The Bengal ChapterActor Parambrata Chattopadhyay recently joked about playing a police officer ahead of his Netflix series, Khakee: The Bengal Chapter. The actor even shared reasons behind nodding to feature in the political drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-trailer-out-neeraj-pandey-netflix-show-2689461-2025-03-05",
      "headline": "Khakee The Bengal Chapter trailer: Neeraj Pandey show dives into politics, crimeThe trailer for Khakee The Bengal Chapter was unveiled on March 5. The show promises a riveting series filled with action, drama, and political intrigue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-member-wonwoo-to-enlist-in-military-in-april-3-2689393-2025-03-05",
      "headline": "K-pop group SEVENTEEN member Wonwoo to enlist in military in AprilSEVENTEEN's Wonwoo is set to begin his mandatory military service in April, as confirmed by Pledis Entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-2025-shawn-mendes-louis-tomlinson-to-make-india-debut-2689363-2025-03-05",
      "headline": "Lollapalooza 2025: Shawn Mendes, Louis Tomlinson to make India debutLollapalooza India is making a grand return in 2025 at Mumbai's Mahalaxmi Racecourse. With an eclectic lineup featuring Green Day, Shawn Mendes, and more, this festival promises an unforgettable musical experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sumbul-touqeer-blasts-trolls-for-body-shaming-rupali-ganguly-reacts-2689259-2025-03-05",
      "headline": "Actor Sumbul Touqeer blasts trolls for body-shaming: Never been more madTelevision actor Sumbul Touqeer Khan has addressed the body-shaming and trolling she faced in a recent social media post. She clarified that her weight gain was due to medication and urged trolls to stop their unwarranted comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-first-reviews-from-foreign-media-meghan-markle-show-called-queasy-unlovable-2689245-2025-03-05",
      "headline": "With Love, Meghan first reviews: Meghan Markle's show called queasy, unlovableIn 'With Love, Meghan', Meghan Markle arranges flowers, cooks delectable exquisite food with her celebrity friends, and gives stunning glimpses of her gorgeous Montecito house with a sprawling ocean view. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/severance-creator-ben-stiller-requested-barack-obama-for-cameo-in-apple-tv-show-2689232-2025-03-05",
      "headline": "Severance creator Ben Stiller requested Obama for cameo in show. Here's how it wentSeverance creator and actor Ben Stiller wanted former US President Barack Obama to appear in his acclaimed Apple TV show, Severance. However, his request was politely turned down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-doves-netflix-new-thriller-show-keira-knightley-ben-whishaw-2689184-2025-03-05",
      "headline": "Black Doves: Keira Knightley show is essential viewing for thriller enthusiastsBritish stars Keira Knightley and Ben Whishaw's thriller series Black Doves is both relentless and rewarding. The underrated gem is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sana-khan-faces-backlash-after-asking-sambhavna-seth-to-wear-burqa-for-her-podcast-2689168-2025-03-05",
      "headline": "Sana Khan faces backlash after asking Sambhavna Seth to wear burqa for her podcastSana Khan found herself in the spotlight after a video of her asking Sambhavna Seth to wear a burqa went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-aaditi-pohankar-pammi-outshines-bobby-deol-baba-nirala-prakash-jha-2688708-2025-03-05",
      "headline": "Aashram 3 Part 2: Aaditi Pohankar's Pammi outshines Bobby Deol's Baba NiralaAaditi Pohankar's character as Pammi has garnered her immense love and appreciation from fans. Her fierce portrayal and her quest to take revenge against Bobby Deol's Baba Nirala truly makes her the hero of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-had-a-vertigo-attack-while-promoting-aashram-2689147-2025-03-05",
      "headline": "Bobby Deol had a vertigo attack while promoting Aashram: Was very nervousActor Bobby Deol recently revealed that he suffered from a vertigo attack while promoting his popular show Aashram. The actor is currently seen in the latest season of the show, which is streaming on MX Player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jennie-new-song-plagiarism-controversy-explained-beats-similar-to-karan-johar-rocky-aur-rani-theme-song-alia-bhatt-2689121-2025-03-05",
      "headline": "Explained: The plagiarism controversy around BLACKPINK's Jennie's new song BLACKPINK member Jennie Kim released the teaser of her new single, 'Like Jennie', on social media, and several social media users, especially Indians, found it quite similar to Alia Bhatt's theme song from 'Rocky Aur Rani Kii Prem Kahaani'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-nude-again-controversial-grammy-outing-2689048-2025-03-05",
      "headline": "Kanye West's wife Bianca goes nude again after controversial Grammy outingKanye West's wife Bianca Censori went nude for a photoshoot. This comes a month after her controversial 'nude' outfit at the Grammys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-separate-7-years-of-marriage-couple-reacts-2688743-2025-03-04",
      "headline": "Actor Shoaib Ibrahim reacts to divorce rumours: Dipika ne diya mujhe dhokhaTelevision couple, Dipika Kakar and Shoaib Ibrahim have found themselves at the center of the separation rumours. The two addressed the same in their new vlog on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shonali-bose-on-delhi-university-miranda-house-objection-to-ziddi-girls-heartbreaking-2688656-2025-03-04",
      "headline": "Shonali Bose on DU, Miranda House's objection to Ziddi Girls: It was heartbreakingPrime Video's Ziddi Girls faced backlash from sections of Delhi University and Miranda House students over perceived negative portrayal, but director Shonali Bose clarifies the trailer was misunderstood and most students ultimately enjoyed the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anora-ott-release-when-and-where-to-watch-the-oscar-winning-best-film-2688627-2025-03-04",
      "headline": "Anora OTT release: When and where to watch the Oscar-winning Best FilmThe Oscar-winning film 'Anora' is set to stream on JioHotstar from March 17. Directed by Sean Baker and starring Mikey Madison, who won Best Actress, the movie offers a thought-provoking narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-dolly-partons-husband-carl-dean-dies-at-82-2688521-2025-03-04",
      "headline": "Singer Dolly Parton's husband Carl Dean dies at 82Carl Dean, husband of Dolly Parton and inspiration for her hit song, Jolene, has died at the age of 82. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpinks-lisa-on-her-new-album-alter-ego-want-people-to-feel-empowered-2688361-2025-03-03",
      "headline": "Blackpink's Lisa on her new album Alter Ego: Want people to feel empoweredLisa of Blackpink recently spoke about her new solo album, Alter Ego. In a virtual panel discussion, the singer shared her desire to make listeners feel empowered with her new album. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-turns-showstopper-milan-fashion-week-2688348-2025-03-03",
      "headline": "Taarak Mehta actor Deepti Sadhwani turns showstopper at Milan Fashion WeekTaarak Mehta Ka Ooltah Chashmah actor Deepti Sadhwani turned showstopper at Milan Fashion Week. The actor shared stunning photos from her rampwalk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-emotional-1st-video-india-got-latent-row-ranveer-allahbadia-samay-raina-2688255-2025-03-03",
      "headline": "Kaam Idhar Udhar Hogaya: YouTuber Ashish Chanchlani on India's Got Latent rowYouTuber Ashish Chanchlani got emotional in his first video after his appearance on comedian Samay Raina's India's Got Latent show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maharani-4-teaser-huma-qureshi-returns-rani-bharti-safeguard-bihar-2688207-2025-03-03",
      "headline": "Maharani 4 teaser: Huma Qureshi returns as Rani Bharti to safeguard BiharActor Huma Qureshi is set to return as Rani Bharti in Maharani Season 4. The makers announced the news with the teaser of the upcoming gripping series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tenali-rama-fire-disrupts-shoot-no-casualties-reported-2688145-2025-03-03",
      "headline": "TV show Tenali Rama set catches fire, shoot haltedA fire broke out on the set of TV show Tenali Rama due to a generator malfunction, halting production. There were no casualties, but the set suffered damage and repairs are underway.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/be-happy-trailer-abhishek-bachchan-reunites-with-ludo-co-actor-inayat-verma-in-feel-good-film-2688128-2025-03-03",
      "headline": "Be Happy: Abhishek Bachchan reunites with Ludo co-actor Inayat in feel-good filmThe trailer of Abhishek Bachchan and Inayat Verma's upcoming dance-drama Be Happy was released today. Directed by Remo D'Souza, the heartfelt film will premiere on Prime Video on March 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-seoul-concert-new-song-fan-proposal-and-special-appearance-by-jin-2688072-2025-03-03",
      "headline": "BTS' J-hope's Seoul concert: New song, fan proposal and special appearance by JinBTS member and rapper J-hope recently held a concert in Seoul which was attended by his close friend and singer Kim Seokjin (Jin). The concert was one big event for the fans as it consisted of many other surprises besides the central performance by the artiste. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-release-date-announced-2688039-2025-03-03",
      "headline": "Khakee The Bengal Chapter: Jeet and Prosenjit announce release date with fun clipThe next installment of Netflix's critically acclaimed thriller series Khakee, Khakee: The Bengal Chapter will premiere on Netflix in March. The makers of the show announced its release date with a fun video. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/anupamaa-actor-sudhanshu-pandey-breaks-silence-on-rumoured-feud-with-rupali-ganguly-2687828-2025-03-02",
      "headline": "Anupamaa actor Sudhanshu Pandey breaks silence on rumoured feud with Rupali GangulyActor Sudhanshu Pandey has addressed the ongoing rumours about a feud with his Anupamaa co-star Rupali Ganguly. In an interview, he clarified the situation and dismissed the speculations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/brit-awards-2025-charli-xcx-wins-album-of-the-year-full-winners-list-here-2687772-2025-03-02",
      "headline": "BRIT Awards 2025: Charli XCX wins album of the year, full winners list hereCharli XCX emerged as a major winner at the Brit Awards 2025, securing multiple accolades. Artists including Sabrina Carpenter and Billie Eilish also took home some of the biggest awards of the night.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-delhi-millionaire-concert-a-night-of-nostalgia-surprises-iconic-hits-2687778-2025-03-02",
      "headline": "Honey Singh's Millionaire Delhi concert: A night of nostalgia, iconic hitsHoney Singh's Delhi concert was packed with nostalgic hits, emotional tributes, surprise guests, and exclusive remixes. The rapper promised bigger things ahead as his Millionaire Tour continues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-celebrates-31st-birthday-with-family-shares-rare-pics-of-son-jack-blues-bieber-2687734-2025-03-02",
      "headline": "Justin Bieber celebrates 31st birthday with family, shares rare pics of son JackPop sensation Justin Bieber marked his 31st birthday with a heartwarming family gathering. He shared rare photos with wife Hailey and their son Jack, capturing the joyous occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/billy-joel-stumbles-and-falls-mid-performance-2687699-2025-03-02",
      "headline": "Singer Billy Joel stumbles and falls mid-performance, fans say 'that's painful'During a recent performance, legendary musician Billy Joel stumbled and fell onstage, causing fans to worry about his health. The incident has sparked widespread concern and discussions about the artist's well-being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-vows-to-bring-grammy-to-india-at-sold-out-delhi-concert-watch-2687670-2025-03-02",
      "headline": "At sold-out Delhi concert, Honey Singh vows to bring Grammys to India. WatchAt his Delhi concert, Honey Singh wowed fans with his hits and vowed to bring a Grammy to India, inspired by AR Rahman's Oscars win. He also expressed his deep love for Delhi and its people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-set-to-perform-in-delhi-excited-fans-rush-into-venue-2687561-2025-03-01",
      "headline": "Honey Singh set to perform in Delhi, excited fans rush to the venueSinger and rapper Honey Singh is set to perform in Delhi today as part of his ongoing Millionaire India tour. Ahead of the concert, excited fans were seen rushing to the venue as soon as the gates opened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-on-online-negativity-against-him-ive-been-here-before-youtube-existed-2687499-2025-03-01",
      "headline": "Honey Singh on online negativity against him: I've been here before YouTube existedSinger and rapper Honey Singh took a dig at those spreading negativity about him through YouTube podcasts. During his Lucknow concert last night, he also spoke about his lifestyle changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-twitter-x-account-hacked-warns-fans-2687489-2025-03-01",
      "headline": "Shreya Ghoshal's X account hacked: Tried every thing in my capacityRenowned singer Shreya Ghoshal has disclosed that her X account has been compromised since February 13. Despite efforts, she remains unable to access or delete the account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rushali-yadav-harsh-arora-splitsvilla-15-contestants-are-engaged-2687457-2025-03-01",
      "headline": "Splitsvilla 15's Rushali Yadav-Harsh Arora engaged: Just perfectly usSplitsvilla 15 contestants Rushali Yadav and Harsh Arora are now engaged. The couple fell in love on the show. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-trailer-ibrahim-ali-khan-khushi-kapoor-romance-netflix-2687443-2025-03-01",
      "headline": "Nadaaniyan trailer: Ibrahim, Khushi's romance comes with a priceIbrahim Ali Khan is all set to making his acting debut in Nadaaniyan, a love story with a secret deal. Also starring Khushi Kapoor, the film explores romance, ambition, and chaos. It will start streaming on Netflix from March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-returns-to-delhi-for-sold-out-millionaire-concert-2687376-2025-03-01",
      "headline": "Honey Singh returns to Delhi for sold-out Millionaire concert: What to expectYo Yo Honey Singh's Millionaire India Tour hits Delhi with a sold-out show, 20,000 fans, top celebs, and a surprise setlist. His parents will attend the concert, making this emotional homecoming extra special. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-wishes-to-team-up-with-diljit-dosanjh-urges-fans-to-make-it-happen-2687276-2025-02-28",
      "headline": "Honey Singh wishes to team up with Diljit Dosanjh, urges fans to make it happenSinger Honey Singh, currently touring India for his Millionaire India Tour, expressed his desire to collaborate with Diljit Dosanjh again during his recent concert in Lucknow. He urged fans to tag the Peaches singer, hoping to reunite for a new project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shabana-azmi-reacts-to-comparisons-between-dabba-cartel-and-saas-bahu-aur-flamingo-2687163-2025-02-28",
      "headline": "Shabana Azmi reacts to comparisons between Dabba Cartel and Saas, Bahu Aur FlamingoShabana Azmi addressed concerns over comparisons between her Netflix show Dabba Cartel and Dimple Kapadia's Saas, Bahu Aur Flamingo, emphasising the unique elements of each series. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donld-trump-united-states-secret-talks-hamas-citizens-hostages-israle-gaza-palestine-2689548-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Release hostages now or you're dead: Trump after US holds talks with HamasAs the US held unprecedented talks with Hamas on Gaza hostages, President Donald Trump gave a stern \"last warning\" to the Palestinian terror group to release the remaining captives or \"there will be hell to pay later\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-in-uk-extremists-try-to-attack-external-affairs-minister-car-in-london-tear-indian-flag-2689594-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Khalistani extremists try to attack S Jaishankar in London, tear Indian flagKhalistani extremists attempted to disrupt EAM S Jaishankar's visit to London, escalating a protest into a security breach. As he left Chatham House, a man ran towards his car and tore the Indian flag in front of police officers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/telangana-man-shot-dead-us-part-time-job-store-higher-studies-family-members-2689557-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "27-year-old Telangana student shot dead by robbers in US, father recalls last callA 27-year-old man from Telangana was shot dead at a store in the US where he used to work part-time after robbers opened fire. The victim's father said he received the news of his death from his friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/top-karnataka-cop-ramachandra-rao-reacts-stepdaughter-ranya-arrest-smuggling-gold-case-2689439-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wasn't aware of any of it: Karnataka top cop on actor daughter's arrestKarnataka DGP Ramachandra Rao, the father of actor Ranya Rao, distanced himself from his daughter's gold smuggling case, saying he was unaware of it. The Kannada actor was caught with over 14 kg gold worth Rs 12 crore from Bengaluru airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ct-dubai-icc-tournament-history-2689528-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, New Zealand to battle in Champions Trophy final after 25 years Champions Trophy 2025: New Zealand produced an all-round effort to outclass South Africa in the second semi-final in Lahore. New Zealand and India will meet in the final of an ICC white-ball tournament for the first time since 2000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/khalistani-babar-khalsa-international-terrorist-lazar-masih-joint-operation-punjab-uttar-pradesh-police-arrested-links-pakistan-isi-2689620-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Khalistani terrorist with links to Pak's ISI arrested in joint op by Punjab, UPLazar Masih, a resident of Punjab's Amritsar, is reportedly close to Swarn Singh alias Jeevan Fauji, who runs Babbar Khalsa International's Germany module."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-khatara-gaadi-nitish-kumar-spat-bihar-assembly-elections-2689355-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Made you Chief Minister twice: Tejashwi Yadav on Nitish Kumar's 'I made Lalu' jabTejashwi Yadav, speaking at an RJD event a day after the Assembly saw a bitter spat between him and Nitish Kumar, said it was high time the 'inefficient government' was sent packing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-rise-for-second-consecutive-day-led-by-auto-stocks-ril-gains-2-percent-2689639-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty rise for second consecutive day led by auto stocks; RIL gains 2%The S&P BSE Sensex jumped 325.45 points to 74,055.68, while the NSE Nifty50 added 99.05 points to 22,436.35 as of 9:20 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/us-donald-trump-ukraine-russia-military-aid-war-eu-2689424-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ukraine's aid lifeline: Without US support, who will fill the gap?The suspension of US military aid to Ukraine has raised concerns among European nations. France criticised the decision, stating it could delay peace efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-mk-stalin-defends-dmks-patriotism-calls-renaming-of-laws-unfair-2689646-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MK Stalin hits out at Hindi zealots, calls Hindi renaming of laws 'chauvinism'Tamil Nadu Chief Minister MK Stalin slammed critics calling the DMK chauvinists, asserting that demanding linguistic equality is a right, not an offence. He criticised the renaming of criminal laws in Hindi and called NEP \"poison\" imposed on non-Hindi states. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-says-kashmir-issue-will-be-solved-once-stolen-land-i-s-returned-2689590-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar shuts down Pak journalist's 'nervous' question on Kashmir issueExternal Affairs Minister S Jaishankar on Wednesday was asked if Prime Minister Narendra Modi could leverage US President Donald Trump's peace efforts to resolve the Kashmir issue with "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pope-francis-health-update-vatican-work-resume-stable-condition-2689627-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pope Francis stable, has resumed some duties: VaticanIn a relatively upbeat health bulletin, the Vatican said Pope Francis, who has been battling double pneumonia for the past three weeks, had carried out some duties and spent much of the day in an armchair."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-daughter-raha-new-girlfriend-in-family-jay-shetty-podcast-2689634-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alia Bhatt calls daughter Raha 'new girlfriend in family', reflects on acting at 17Alia Bhatt appeared on Jay Shetty's podcast where she discussed fame, friendships, and motherhood. She also reflected on her journey from teen star to parenthood, calling an actor's life 'random and haphazard'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-dmk-ed-raids-senthil-balaji-linked-properties-in-money-laundering-case-2689664-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED raids multiple places linked to Tamil Nadu Minister in money laundering caseThe Enforcement Directorate raided over ten locations linked to Tamil Nadu Minister Senthil Balaji and his supporters in a money laundering case. Visuals from Karur showed raids taking place on properties belonging to Balaji's supporters too. The raids, which began at 8 am, were conducted under CRPF security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-us-president-tariff-canada-mexico-ukraine-military-assistance-transactional-foreign-policy-fareed-zakaria-2689565-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump is transactional: Fareed Zakaria as US reshapes its foreign policiesGeopolitical expert Fareed Zakaria described US President Donald Trump's foreign policy as purely transactional, emphasising that he relentlessly shapes the agenda to his advantage and pressures opponents into win-lose situations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/telanagana-ap-mlc-elections-nda-bjp-wins-seats-narendra-modi-thanks-voters-party-workers-for-support-2689640-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM hails BJP's win in Telangana civic body polls: Very pround of karyakartasPrime Minister Narendra Modi thanked Telangana voters for supporting the BJP in the MLC elections, where the party won two out of three seats. In Andhra Pradesh, Modi celebrated the NDA's success in the graduate MLC elections, promising continued development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasas-second-private-moon-mission-athena-to-land-close-to-chandrayaan-3-today-2689468-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nasa's private lander Athena to touchdown close to Chandrayaan-3 todayFollowing a precise lunar orbit insertion on March 3, Athena is currently in excellent health, awaiting optimal sunlight conditions at her designated landing site, Mons Mouton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-justin-trudeau-phone-call-tariffs-trade-war-drug-smuggling-canada-mexico-tariffs-2689586-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Governor Trudeau' trying to use trade war to stay in power, says TrumpUS President Donald Trump claimed that Canadian Prime Minister Justin Trudeau wanted to use the escalating trade war to stay in power, a day after Washington imposed 25 per cent tariffs on Canadian imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-icc-lieft-saliva-ban-reverse-swing-india-vs-new-zealand-2689637-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bring back reverse swing: Shami urges ICC to reconsider saliva ruleMohammed Shami called for ICC to lift the saliva ban, stressing its role in enabling reverse swing and adding excitement for bowlers, especially in ODIs, where rules have significantly reduced pacers' impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-dances-to-sasural-genda-phool-friend-wedding-vicky-kaushal-2689593-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Katrina Kaif grooves to 'Sasural Genda Phool' at friend's wedding. WatchKatrina Kaif performed at her friend's wedding and grooved to 'Sasural Genda Phool' song with her girl gang. As the video went viral, fans filled the comment section with heart emojis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-abu-azmi-aurangzeb-maharashtra-mla-samajwadi-party-akhilesh-yadav-bjp-protest-2689388-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Send Abu Azmi to UP, we'll take care of rest: Yogi Adityanath to Samajwadi PartyYogi Adityanath asked the Samajwadi Party to expel Abu Azmi and send him to Uttar Pradesh. \"We know well how to deal with such people,\" he said after row over Azmi's Aurangzeb comment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/stanley-zhong-father-nan-zhong-lawsuit-university-of-california-rejected-16-united-states-universities-google-job-offer-2689599-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rejected by 16 US colleges despite Google job offer, teen sues universityStanley Zhong, now 19, was offered a job at PhD level as a software engineer by Google when he was 13. He was rejected by multiple top US universities in 2023, and in the lawsuit that his father has filed, they have alleged racial discrimination against Asian-Americans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-man-accused-rape-sexual-assault-woman-16-years-live-in-relationship-false-marriage-pretext-qualified-educated-2689661-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman can't claim rape after being in live-in for 16 years: Supreme CourtThe Supreme Court, while cancelling the rape case against the man, ruled that a mere breach of marriage promise doesn't amount to rape unless it's proven that the accused never intended to marry at the onset of the relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleep-divorce-indian-couples-sleep-separate-rooms-beds-relationship-work-life-balance-resmed-2689346-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sleeping single, staying married: The rise of sleep divorce in IndiaOver 70% of Indian couples opt for sleep divorce to improve rest, citing snoring, stress, and mismatched schedules - highlighting a global sleep crisis impacting health and relationships, according to a study."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maharashtra-leaders-praise-chhaava-at-special-screening-a-beautiful-movie-2689668-2025-03-06",
      "headline": "Devendra Fadnavis and BJP members watch Chhaava in Mumbai: A beautiful movieVicky Kaushal's Chhaava storms the box office with Rs 478 crore. Maharashtra politicians, including Chief Minister Devendra Fadnavis, appreciated the film at a special screening. PM Narendra Modi also appreciated its impact. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-on-her-adhd-anxiety-diagnosis-my-body-starts-heating-up-in-social-gatherings-2689653-2025-03-06",
      "headline": "Alia Bhatt on ADHD diagnosis: My body starts heating up in social gatheringsActor Alia Bhatt has opened up about her ADHD and anxiety diagnosis. In a recent interview with Jay Shetty, she spoke about how her body reacts in social gatherings and clarified that she is not on medication.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-prithviraj-sukumaran-ss-rajamouli-ssmb-29-odisha-2689644-2025-03-06",
      "headline": "Pics: Mahesh Babu, Prithviraj 'ready to roar' for SS Rajamouli's film in OdishaMahesh Babu and Prithviraj Sukumaran are currently in Odisha for the shooting of SSMB 29. Their photos clicked at the airport are now going viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-daughter-raha-new-girlfriend-in-family-jay-shetty-podcast-2689634-2025-03-06",
      "headline": "Alia Bhatt calls daughter Raha 'new girlfriend in family', reflects on acting at 17Alia Bhatt appeared on Jay Shetty's podcast where she discussed fame, friendships, and motherhood. She also reflected on her journey from teen star to parenthood, calling an actor's life 'random and haphazard'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mushfiqur-rahim-odi-retirement-career-stats-2689662-2025-03-06",
      "headline": "Mushfiqur Rahim, Bangladesh's Mr. Dependable retires: ODI career in numbersChampions Trophy 2025: Veteran wicketkeeper-batter Mushfiqur Rahim retired from ODI cricket as Bangladesh's most-capped player and second-highest run-scorer in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-south-africa-vs-new-zealand-proud-of-effort-rob-walter-2689658-2025-03-06",
      "headline": "South Africa head coach proud of team's effort despite loss to New ZealandSouth Africa head coach Rob Walter commended his team's Champions Trophy campaign, emphasising that their semi-final loss to New Zealand does not overshadow their strong performances throughout the tournament. He urged fans to recognise their consistency despite one off-day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-new-zealand-vs-south-africa-rachin-ravindra-team-first-kane-williamson-2689650-2025-03-06",
      "headline": "Rachin Ravindra plays for the team first: Williamson on 'gifted' teammateKane Williamson praised Rachin Ravindra's match-winning century against South Africa in the Champions Trophy semi-final, highlighting the youngster's ability to play with both freedom and responsibility, which proved crucial in securing New Zealand's spot in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mushfiqur-rahim-bangladesh-odi-retirement-2689641-2025-03-06",
      "headline": "Mushfiqur Rahim retires from ODIs after forgettable Champions TrophyChampions Trophy: Veteran wicketkeeper Mushfiqur Rahim drew the curtains down on his ODI career after Bangladesh failed to qualify for the semi-final of the mega event in Pakistan and Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-mohammed-shami-icc-lieft-saliva-ban-reverse-swing-india-vs-new-zealand-2689637-2025-03-06",
      "headline": "Bring back reverse swing: Shami urges ICC to reconsider saliva ruleMohammed Shami called for ICC to lift the saliva ban, stressing its role in enabling reverse swing and adding excitement for bowlers, especially in ODIs, where rules have significantly reduced pacers' impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-last-ten-overs-semi-final-rob-walter-2689622-2025-03-06",
      "headline": "South Africa head coach rues 'last 10 overs' mishaps for New Zealand lossSouth Africa's ICC heartbreak continues as Rob Walter reflects on their semi-final defeat to New Zealand, citing poor death-over bowling, lack of key partnerships, and a slow start in the chase as decisive factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kane-williamson-dubai-advantage-final-2689602-2025-03-06",
      "headline": "New Zealand not looking closely at India's Dubai advantage: Kane WilliamsonKane Williamson remains unfazed by India's familiarity with Dubai conditions ahead of the Champions Trophy final, emphasising that New Zealand must focus on their own game rather than external factors beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06",
      "headline": "Toss already in New Zealand captain's mind ahead of Dubai finalNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rajeev-shukla-interacts-with-pakistani-press-in-lahore-2689558-2025-03-05",
      "headline": "Watch: Rajeev Shukla interacts with Pakistani press in LahoreBCCI vice president Rajeev Shukla interacted with the Pakistani press during his visit to Lahore to watch the second semi final of the ICC Champions Trophy 2025 between New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sunil-gavaskar-on-rohit-sharma-intent-gautam-gambhir-presser-2689553-2025-03-05",
      "headline": "Sunil Gavaskar disagrees with Gautam Gambhir over Rohit Sharma's batting approachChampions Trophy 2025: A day after head coach Gautam Gambhir defended Rohit Sharma's risk-laden batting approach, Sunil Gavaskar urged the India captain to reconsider it and spend more time at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kane-williamson-dubai-advantage-final-2689602-2025-03-06",
      "headline": "New Zealand not looking closely at India's Dubai advantage: Kane WilliamsonKane Williamson remains unfazed by India's familiarity with Dubai conditions ahead of the Champions Trophy final, emphasising that New Zealand must focus on their own game rather than external factors beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06",
      "headline": "Toss already in New Zealand captain's mind ahead of Dubai finalNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rajeev-shukla-interacts-with-pakistani-press-in-lahore-2689558-2025-03-05",
      "headline": "Watch: Rajeev Shukla interacts with Pakistani press in LahoreBCCI vice president Rajeev Shukla interacted with the Pakistani press during his visit to Lahore to watch the second semi final of the ICC Champions Trophy 2025 between New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sunil-gavaskar-on-rohit-sharma-intent-gautam-gambhir-presser-2689553-2025-03-05",
      "headline": "Sunil Gavaskar disagrees with Gautam Gambhir over Rohit Sharma's batting approachChampions Trophy 2025: A day after head coach Gautam Gambhir defended Rohit Sharma's risk-laden batting approach, Sunil Gavaskar urged the India captain to reconsider it and spend more time at the crease."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}