{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-mark-zuckerberg-internal-memo-reveals-job-cuts-lowest-performers-starting-next-week-layoffs-2676644-2025-02-08",
      "headline": "Meta plans to lay off 'lowest performance' staff next week, internal memo revealsNotices will go out to employees losing their jobs starting at 5 am local time on Monday in most countries, including in the US, according to one of the posts, authored by Meta's Head of People Janelle Gale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-income-tax-bill-approved-cabinet-likely-tabled-lok-sabha-monday-sources-2676509-2025-02-07",
      "headline": "Cabinet clears new income tax bill, likely to be tabled in Lok Sabha Monday: SourcesThe new legislation, which is often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-things-about-mohini-mohan-dutta-the-man-named-in-ratan-tata-will-2676438-2025-02-07",
      "headline": "5 things about Mohini Mohan Dutta: The man named in Ratan Tata's willWhile most anticipated that Ratan Tata's wealth would go towards philanthropy, family members, and other charitable causes, Mohini Mohan Dutta's mention in his will has surprised many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-clarifies-forceful-layoffs-freshers-get-3-attempts-to-clear-assessment-2676443-2025-02-07",
      "headline": "Infosys clarifies 'forceful' layoffs: Freshers get 3 attempts to clear assessmentInfosys said freshers undergo foundational training at its Mysuru campus and must pass an internal assessment to continue working."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-forcefully-lays-off-700-trainees-in-mysuru-report-2676257-2025-02-07",
      "headline": "Infosys 'forcefully' lays off 700 trainees in Mysuru: ReportMost of the affected recruits were from the engineering batch of 2022, who were onboarded after a wait of about 2.25 years, said sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-after-volatile-session-fmcg-energy-drag-rbi-mpc-2676251-2025-02-07",
      "headline": "Sensex, Nifty end lower after volatile session; FMCG, energy drag marketThe S&P BSE Sensex fell by 197.97 points to end at 77,860.19, while the NSE Nifty50 declined by 43.40 points to close at 23,559.95. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-after-rbi-mpc-announcement-625-percent-why-is-stock-market-falling-today-2676229-2025-02-07",
      "headline": "Sensex tanks 500 points after RBI MPC: Why is stock market falling todayThe S&P BSE Sensex was down by 539.72 points to 77,516.79, while the NSE Nifty50 declined by 147.50 points to 23,455.60 as of 2:43 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/activate-uan-to-avail-epfo-eli-scheme-benefits-before-february-15-check-details-2676213-2025-02-07",
      "headline": "Activate UAN to avail EPFO's ELI scheme benefits before February 15. Check detailsEPFO ELI: UAN or Universal Account Number is a unique 12-digit number allotted by EPFO which is necessary for managing provident fund accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mohini-mohan-dutta-rs-500-crore-surprise-in-ratan-tata-will-2676202-2025-02-07",
      "headline": "Who is Mohini Mohan Dutta? Rs 500 crore surprise in Ratan Tata's willRatan Tata also left behind a share for his siblings, his butler Subbiah and German Shepherd Tito have also been provided for in his will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/after-5-years-rbi-cut-key-lending-rate-by-25-basis-points-to-625-2676083-2025-02-07",
      "headline": "After 5 years, RBI cut key lending rate by 25 basis points to 6.25%This marks the first rate cut since 2020 and the first policy decision under Governor Malhotra's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-home-loans-to-get-cheaper-as-rbi-cuts-rates-25-basis-points-625-percent-check-details-2676080-2025-02-07",
      "headline": "Home loans to get cheaper as RBI cuts rates. Check detailsThe RBI MPC reduced key lending rates by 25 basis points to 6.25%, the first rate cut in nearly five years under the leadership of newly appointed RBI Governor Sanjay Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-rate-interest-repo-cut-25-basis-points-625-per-cent-first-time-since-2020-2676071-2025-02-07",
      "headline": "RBI reduces key lending rate by 25 basis points to 6.25%The rate cut announced by the committee is the first since 2020. This was also the first policy meeting of Sanjay Malhotra as RBI Governor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-markets-opening-sensex-nifty-flat-as-investors-await-rbi-policy-decision-itc-down-2-percent-2676061-2025-02-07",
      "headline": "Stock markets open flat as investors await RBI policy decision; ITC down 2%The S&P BSE Sensex was down by 23.98 points to 78,034.18, while the NSE Nifty50 lost 7 points to 23,596.35 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato to be Eternal? Deepinder Goyal says company name change cleared by boardThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-6-ott-releases-this-week-the-mehta-boys-mrs-daaku-mahaaraj-game-changer-2676487-2025-02-07",
      "headline": "The Mehta Boys to Mrs: Top 6 OTT releases this weekThis weekend, a variety of highly anticipated South films and original titles are set to release on OTT platforms, offering viewers a diverse selection for binge-watching. Check out the list of the OTT releases of the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-kendrick-lamar-promises-storytelling-in-super-bowl-act-sza-drake-2676354-2025-02-07",
      "headline": "Grammy winner Kendrick Lamar promises storytelling in Super Bowl act, SZA to joinRapper and Grammy winner Kendrick Lamar will be headlining the Super Bowl halftime show for the first time in his career. Lamar has recently been in the news for winning five Grammys for his diss track Not Like Us, directed at rapper Drake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maryade-prashne-when-and-where-watch-the-malayalam-revenge-drama-prime-video-stmp-2676264-2025-02-07",
      "headline": "Maryade Prashne OTT release: When and where to watch the revenge dramaThe revenge family drama Maryade Prashne, which released in November last year, is now available to stream on a major OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-prosenjit-chatterjee-jeet-saswata-chatterjee-parambrata-chattopadhyay-2676206-2025-02-07",
      "headline": "How Netflix pulled most unexpected casting coup with Khakee The Bengal ChapterNetflix has orchestrated a major casting coup by bringing together top stars of Bengali cinema for its upcoming crime thriller, Khakee: The Bengal Chapter. The show promises to showcase the industry's talent and diversity in a groundbreaking way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-shreds-elvish-yadav-for-trolling-bigg-boss-18-finalist-chum-darang-2676258-2025-02-07",
      "headline": "Internet shreds Elvish Yadav for trolling Bigg Boss 18 finalist Chum DarangSocial media users have slammed YouTuber contestant Elvish Yadav for making inappropriate remarks about Bigg Boss 18 finalist and actor Chum Darang's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bada-naam-karenge-review-sooraj-barjatya-ott-debut-palash-vaswani-sony-liv-2676217-2025-02-07",
      "headline": "Bada Naam Karenge review: Sweet, familiar and full of sanskaarsReleased-Fri Feb 07, 2025Bada Naam Karenge is a classic Rajshri Productions love story with sweet romance, catchy music, and family drama. While it evokes nostalgia, its simple plot and dated gender roles may not resonate with all. Strong performances and a heartfelt message make it a warm, fulfilling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/from-romance-to-revenge-k-drama-star-park-hyung-sik-buried-hearts-2676222-2025-02-07",
      "headline": "From romance to revenge, K-drama star Park Hyung-sik can do it allThere are not many South Korean stars who can boast of having a diverse filmography like Park Hyung-sik. In today's installment of our Weekly K-Fix, we take a quick look at the artiste's short but illustrious career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-greatest-rivalry-india-vs-pakistan-review-reliving-cricket-golden-era-and-its-heroes-2676210-2025-02-07",
      "headline": "The Greatest Rivalry India vs Pakistan: Reliving cricket's golden era and its heroes  Released-Fri Feb 07, 2025The Greatest Rivalry India vs Pakistan review: A new Netflix docu-series revives the legendary India vs Pakistan cricket rivalry, exploring its intense history and iconic players with insights from cricket legends and journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-netflixs-the-trauma-code-a-breakout-hit-surpassing-squid-game-2-2676127-2025-02-07",
      "headline": "What makes Netflix's The Trauma Code a breakout hit surpassing Squid Game 2The Trauma Code: Heroes on Call has taken Netflix by storm, surpassing Squid Game Season 2 on the global chart. This medical drama captivates with its blend of intense medical scenarios, hospital politics, and humour, offering a fresh take on the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shiv-sena-mp-milind-deoras-woke-dig-at-grammys-for-not-honouring-zakir-hussain-2675559-2025-02-06",
      "headline": "Milind Deora's 'woke' dig at Grammys for not honouring tabla icon Zakir HussainShiv Sena leader and Member of Parliament Milind Deora took a dig at the Grammys for omitting Tabla maestro Zakir Hussain's name from their In Memoriam segment. Zakir Hussain, who died in December 2024, was a four-time Grammy winner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-kendrick-lamar-biggest-fight-rap-history-grammys-2025-2675551-2025-02-06",
      "headline": "Kendrick Lamar vs Drake: Did the Grammys settle the 'battle rap'?Rappers Kendrick Lamar and Drake's feud spans over a decade, with diss tracks, accusations, and a lawsuit. From collaborations to lyrical attacks, here's a full breakdown of their ongoing rap battle."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/milkipur-by-election-uttar-pradesh-bjp-avenge-ayodhya-faizabad-defeat-prestige-battle-samajwadi-party-2674682-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "To avenge Ayodhya defeat, BJP turns Milkipur by-poll into prestige battle Live UpdatesMilkipur ByPoll 2025: Results for the bypoll in Milkipur in Uttar Pradesh will be declared today. BJP leaders, including Chief Minister Yogi Adityanath, turned the Milkipur Assembly by-election into a prestige battle. Months after losing the Faizabad Lok Sabha seat that houses the Ayodhya Ram Mandir, the BJP has called on voters in Milkipur to \"avenge the defeat\". This is why Milkipur, one of the five Assembly segments of Faizabad, is a prestige battle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-donald-trump-joe-biden-security-clearance-classified-files-2676596-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump revokes Biden's security clearances: Joe, you're fired Donald Trump announced he is revoking Joe Biden's security clearance, ending his access to classified information and intelligence briefings. Trump declared the decision on Truth Social, stating, \"Joe, you're fired.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/alaska-plane-missing-sea-ice-found-dead-rescue-search-operations-2676597-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Missing plane carrying 10 found on sea ice in Alaska, 3 deadThree bodies were found in an aircraft that went missing in Alaska on Thursday. The plane was carrying 10 people and its wreckage was found on sea ice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/justin-trudeau-donald-trump-canada-us-ties-sanctions-tariffs-2676592-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's plan to absorb Canada 'a real thing,' warns Justin Trudeau: ReportCanadian Prime Minister Justin Trudeau said US President Donald Trump's idea of absorbing Canada is \"a real thing\" linked to the country's natural resources. He made the remarks while discussing US tariff threats with business and labour leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-2025-exit-polls-five-factors-undone-aap-arvind-kejriwal-manish-sisodia-atishi-bjp-congress-2675385-2025-02-05?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 things that might have undone AAP if exit polls come trueThe BJP is making massive gains in Delhi and could edge out the Aam Aadmi Party (AAP), if exit polls are to be believed. Here are the five main factors that might have worked for the BJP and worked against the AAP if the election results, set to be out today, turn out to be what is being predicted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/erode-bypoll-results-live-updates-tamil-nadu-assembly-seat-mk-stalin-dmk-ntk-seeman-2676401-2025-02-07?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Erode bypoll results LIVE updates: DMK eyes easy win in Tamil Nadu seatThe by-election, necessitated by the death of Congress legislator EVKS Elangovan on December 14, 2024, was boycotted by major political parties such as the AIADMK and the BJP. Although 46 candidates contested for the election, the real face-off is between DMK's VC Chandrikumar and NTK's MK Seethalakshmi. The voting on Wednesday, February 5, in the by-election witnessed over 70 per cent turnout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-mark-zuckerberg-internal-memo-reveals-job-cuts-lowest-performers-starting-next-week-layoffs-2676644-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meta plans to lay off 'lowest performance' staff next week, internal memo revealsNotices will go out to employees losing their jobs starting at 5 am local time on Monday in most countries, including in the US, according to one of the posts, authored by Meta's Head of People Janelle Gale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-axar-patel-keep-rishabh-pant-on-bench-sanjay-manjrekar-reacts-2676635-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Could Axar Patel keep Rishabh Pant on bench in Champions Trophy? Manjrekar reactsSanjay Manjrekar feels that Axar Patel's versatility could force Rishabh Pant to spend time on the bench. Axar scored a fine fifty during India's 1st ODI win against England in Nagpur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-congressman-ro-khanna-us-vice-president-jd-vance-war-of-words-doge-staffer-racist-posts-reinstated-2676620-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congressman, JD Vance's X war as DOGE staffer who quit over racist posts reinstatedMarko Elez resigned from DOGE after the Wall Street Journal published a report linking him to a now-deleted account on X, where he made some racist posts. In one post last September, Elez reportedly said, \"You could not pay me to marry outside of my ethnicity,\"  and in another one, he wrote, \"Just for the record, I was racist before it was cool.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/not-bjp-congress-might-hurt-aap-most-in-12-delhi-seats-in-delhi-assembly-election-2025-heres-why-explained-2673915-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not BJP, Congress might hurt AAP the most in these 12 Delhi seats. Here's whyWith results due today, the 2025 Delhi Assembly election has narrowed to a two-way contest between AAP and Congress in 12 of the 70 seats. This is why the 12 seats will see an AAP-Congress direct contest, and are among the 30 that the Congress is focusing on to stay relevant in Delhi's politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/federal-judge-temporarily-blocks-trump-doge-plan-usaid-employees-paid-leave-2676637-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judge blocks Trump's plan to put thousands of US aid agency employees on leaveThe Trump administration and Elon Musk, who is heading a budget-cutting Department of Government Efficiency, have made USAID their biggest target so far in an unprecedented challenge of the federal government and many of its programs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-summons-bangladesh-envoy-after-dhaka-protests-sheikh-hasina-remarks-2676486-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India summons Bangladesh envoy after Dhaka protests Sheikh Hasina's remarksIndia summoned Bangladesh's Acting High Commissioner over Dhaka's recent statements blaming New Delhi for internal issues. The Centre reiterated its commitment to positive ties but criticised Bangladesh's negative portrayal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/maaya-rajeshwaran-tennis-prodigy-wta-125-semi-final-rafael-nadal-academy-2676660-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Maaya Rajeshwaran? 15-year-old tennis prodigy into WTA 125 semi-finalAt just 15, Maaya Rajeshwaran's stunning run at the L&T Mumbai Open has made her the youngest Indian to earn a WTA point, cementing her place as one of the country's brightest tennis prospects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-lieutenant-governor-orders-probe-aam-aadmi-party-operation-lotus-charge-bjp-assembly-elections-results-arvind-kejriwal-2676189-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal gets anti-graft body's notice: Submit proof of 'Op Lotus' chargeThe development, which comes a day before counting of votes in Delhi, took place as the Lt Governor directed the ACB to probe AAP's 'Operation Lotus' charge against the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-maharashtra-election-discrepancies-numbers-blow-a-hole-poll-fraud-allegations-2676484-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How UPA-era numbers blow a hole in Rahul Gandhi's poll-fraud allegationsA closer look at Maharashtra's voter data since 2009 shows that the recent spike in registered voters is not unusual. The trends over the past 15 years challenge Congress leader Rahul Gandhi's claim that the voter list was manipulated ahead of the 2024 Maharashtra Assembly poll, and the election stolen from the Maha Vikas Aghadi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-israel-hostages-prisoners-swap-gaza-ceasefire-deal-2676554-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas to release 3 more hostages today, Israel likely to free 183 PalestiniansEarlier, the Palestinian militant group accused Israel of breaching their ceasefire accord and held off announcing the names of the three Israelis until a 4 pm (1400 GMT) deadline had passed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indian-travellers-are-craving-offbeat-escapes-but-heres-the-irony-2676448-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Offbeat vacations are trending, but are they truly offbeat? With overcrowding becoming a global issue, travellers—including Indians—are seeking offbeat destinations. But social media has turned the search into a paradox."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/did-indians-deported-us-violate-indians-laws-too-donald-trump-immigration-act-passport-act-bns-2676208-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Indians deported by US violate Indian laws too?Every country prohibits illegal entry of foreigners, and that is why the US has deported 104 Indians. But did these Indians, and the lakhs of others from India who are illegally residing in the US violate Indian laws too? Do these violations attract prison terms?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/kalkaji-election-results-2025-live-updates-vote-counting-aap-bjp-congress-atishi-ramesh-bidhuri-alka-lamba-2676602-2025-02-08?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Kalkaji Live: BJP's Ramesh Bidhuri ahead of AAP's Atishi in very early leads Kalkaji Assembly Election Result 2025 Live: Delhi Assembly election results will be announced today as counting of votes will begin shortly. The Kalkaji assembly constituency is among the most closely contested seats in the 2025 Delhi polls. This high profile constituency is witnessing a triangular contest between Aam Aadmi Party (AAP) candidate and Delhi chief minister Atishi, BJP's Ramesh Bidhuri and Congress's Alka Lamba. In the 2020 Delhi Assembly elections, Atishi won the seat with 55,897 votes, defeating BJP's Dharmveer and Congress's Shivani Chopra. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/greater-kailash-election-results-2025-live-updates-vote-counting-aap-bjp-congress-saurabh-bhardwaj-shikha-rai-garvit-singhvi-2676599-2025-02-08?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Greater Kailash Live: AAP's Saurabh Bhardwaj ahead of BJP in very early leadsGreater Kailash Assembly Election Result 2025 Live: Delhi Assembly election results will be announced today as counting of votes will begin shortly. The Greater Kailash Assembly Constituency is one of the 70 assembly constituencies in Delhi. The assembly constituency is expected to be a key battleground for the Delhi polls. Aam Aadmi Party (AAP) candidate and Delhi Minister Saurabh Bhardwaj is contesting for the seat against BJP's Shikha Rai and Congress's Garvit Singhvi. He won the seat in 2020 and 2015. Follow indiatoday.in for more updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jeet-adani-wedding-diva-shah-picture-gautam-adani-group-ahmedabad-2676483-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gautam Adani's son Jeet marries Diva Shah in intimate ceremonyGautam Adani took to social media site X and shared the information along with some pictures from the wedding which took place in Gujarat's Ahmedabad earlier in the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/patparganj-election-results-2025-live-updates-vote-counting-aap-bjp-congress-avadh-ojha-ravinder-singh-negi-anil-kumar-2676627-2025-02-08?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Patparganj Live: BJP takes early lead in Patparganj as AAP's Avadh Ojha trailsPatparganj Assembly Election Result 2025 Live: Counting of votes in the Patparganj Assembly seat began with UPSC educator Avadh Ojha, who has been fielded by AAP, up against BJP's Ravinder Singh Negi and Anil Kumar of the Congress. AAP leader and former Delhi Deputy Chief Minister Manish Sisodia held the seat for a brief period in 2013, and again since 2015, and is now contesting from Jangpura. The seat is crucial for AAP as it has considerable presence of Poorvanchalis - those belonging from eastern Uttar Pradesh and Bihar. A win for Ojha will consolidate the AAP's position in Patparganj, while a defeat will end the 10-year-long dominance of the party in this seat. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jangpura-election-results-2025-live-updates-vote-counting-aap-bjp-congress-manish-sisodia-tarvinder-marwah-farhad-suri-2676611-2025-02-08?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Jangpura Live: Manish Sisodia trails as BJP takes early lead in JangpuraJangpura Assembly Election Result 2025 Live: All eyes will be on the Jangpura Assembly seat in southeast Delhi, where Manish Sisodia, currently an MLA from Patparganj, is facing BJP's Tarvinder Singh Marwah and Farhad Suri of the Congress. Counting of votes began at 8 am. Sisodia, who has represented Patparganj since 2015, shifted to Jangpura as UPSC educator Avadh Ojha was fielded from there. The stakes are high for Sisodia, who spent in jail for 17 months, in connection with the Delhi liquor policy case. Will Sisodia emerge victorious from Jangpura or can the BJP or Congress play spoilsport? Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/new-delhi-assembly-seat-election-results-2025-live-updates-vote-counting-aap-bjp-congress-arvind-kejriwal-parvesh-verma-sandeep-dikshit-2676606-2025-02-08?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Live Updates: AAP chief Arvind Kejriwal trails in New Delhi, BJP ahead in very early leadsNew Delhi Assembly Election Result 2025 Live: Counting of votes for the high-stakes Delhi Assembly elections has commenced, with all eyes on the all-important New Delhi seat. Aam Aadmi Party (AAP) chief Arvind Kejriwal is pitted against BJP's Parvesh Verma and Congress's Sandeep Dikshit. In 2013, when he made his political debut, Kejriwal won the seat by a margin of 44,269 votes against then Chief Minister Sheila Dixit. In 2015, he won by 57,213 votes and 46,758 in the 2020 Assembly polls. The New Delhi Assembly seat, located at the heart of the capital, covers some of the most prominent neighbourhoods of Lutyens' Delhi, including Connaught Place, Central Secretariat, Lodhi Colony, Jor Bagh, Sarojini Nagar, Janpath, and Gole Market. Stay tuned to India Today as we bring you the latest counting updates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/pm-modi-discusses-making-india-global-entertainment-hub-with-srk-amitabh-mohanlal-2676669-2025-02-08",
      "headline": "PM Modi discusses making India global entertainment hub with SRK, AmitabhPM Modi met Bollywood and South Indian stars, business leaders, and creatives at the WAVES Summit to discuss making India a global entertainment hub. Shah Rukh Khan, Amitabh Bachchan, Chiranjeevi, Diljit Dosanjh, and others were a part of the Summit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-reacts-to-arrest-warrant-report-celebs-become-soft-targets-2676529-2025-02-07",
      "headline": "Sonu Sood reacts to arrest warrant report: Celebs become soft targetsActor and producer Sonu Sood reacted to the reports doing the rounds that an arrest warrant had been issued against him in a fraud case. Sood called the reports 'highly sensationalised.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-walks-her-brother-down-the-aisle-nick-jonas-participates-in-wedding-video-pics-2676518-2025-02-07",
      "headline": "Priyanka walks her brother down the aisle, Nick participates in wedding. WatchGlobal icon Priyanka Chopra partook in the wedding festivities of her brother, Siddharth Chopra, along with her husband-singer, Nick Jonas in Mumbai on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-ilaiyaraaja-biopic-not-shelved-pre-production-stage-report-2676510-2025-02-07",
      "headline": "Dhanush's Ilaiyaraaja biopic not shelved, film in pre-production: ReportThe official biopic of legendary music composer Ilaiyaraaja, featuring Dhanush, is not shelved and is progressing with a finalised script, as per the latest report."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-freestyle-chess-grand-slam-subtle-start-magnus-carlsen-2676667-2025-02-08",
      "headline": "Gukesh's subtle start in Freestyle Chess Grand Slam amid format controversyWorld champion D Gukesh made a steady start at the Freestyle Chess Grand Slam, adapting to the unique format amid rising tensions between FIDE and organisers, while Magnus Carlsen and other top players experience mixed fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/maaya-rajeshwaran-tennis-prodigy-wta-125-semi-final-rafael-nadal-academy-2676660-2025-02-08",
      "headline": "Who is Maaya Rajeshwaran? 15-year-old tennis prodigy into WTA 125 semi-finalAt just 15, Maaya Rajeshwaran's stunning run at the L&T Mumbai Open has made her the youngest Indian to earn a WTA point, cementing her place as one of the country's brightest tennis prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jacob-bethell-ind-vs-eng-rcb-ipl-2025-royal-challengers-bengaluru-2676571-2025-02-08",
      "headline": "They always chant RCB! RCB!: Jacob Bethell overwhelmed by support in IndiaEngland all-rounder Jacob Bethell opened up on receiving massive support in India after bagging a Rs 2.60 crore deal with RCB for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-axar-patel-keep-rishabh-pant-on-bench-sanjay-manjrekar-reacts-2676635-2025-02-08",
      "headline": "Could Axar Patel keep Rishabh Pant on bench in Champions Trophy? Manjrekar reactsSanjay Manjrekar feels that Axar Patel's versatility could force Rishabh Pant to spend time on the bench. Axar scored a fine fifty during India's 1st ODI win against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-sam-konstas-travis-head-sri-lanka-vs-australia-2676580-2025-02-08",
      "headline": "I understand why Travis Head opened the batting in Sri Lanka: Sam KonstasYoung Australia opener Sam Konstas recently shared his thoughts on not getting an opportunity to play in the ongoing series against Sri Lanka. Konstas warmed the bench in the series as Travis Head opened the innings for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-new-zealand-tri-series-babar-azam-opening-mohammad-rizwan-2676575-2025-02-07",
      "headline": "King will do it: Rizwan on who will open for Pakistan in tri-series openerPakistan captain Mohammad Rizwan hinted that Babar Azam could be the one opening the batting for his side in the tri-series opener against New Zealand on February 8. Babar is expected to play the role during the ICC Champions Trophy later this month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-2nd-odi-indian-team-england-arrival-bhubaneswar-cuttack-2676555-2025-02-07",
      "headline": "IND vs ENG: Team India, England get grand welcome in Odisha ahead of 2nd ODIThe Indian team and England received a grand welcome from the fans as they reached Bhubaneswar Airport on Friday, February 7 ahead of the second ODI in Cuttack. Fans arrived to get a glimpse of the stars as both teams made their way to the team hotels. India hold a 1-0 lead and will be aiming to wrap it up with a win in the match on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-launch-new-jersey-for-icc-champions-trophy-2025-babar-azam-mohammad-rizwan-2676540-2025-02-07",
      "headline": "Watch: Babar Azam, Rizwan flaunt Pakistan's new jersey for Champions Trophy 2025 Star Pakistan cricketers Babar Azam and Mohammad Rizwan flaunted their new jersey for the ICC Champions Trophy 2025 in a special video released by the Pakistan Cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-new-zealand-vs-south-africa-odi-tri-series-squads-schedule-livestreaming-details-2676523-2025-02-07",
      "headline": "Pakistan vs New Zealand vs South Africa ODI tri-series: All you need to knowThe ODI tri-series format is all set to make a comeback as Pakistan welcome New Zealand and South Africa to their shores in what is seen as a dress rehersal before the upcoming ICC Champions Trophy. The matches will be played in the revamped stadiums in Karachi and Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-makes-kevin-pietersen-laugh-ind-vs-eng-nagpur-kohli-injury-2676499-2025-02-07",
      "headline": "Watch: Virat Kohli makes Kevin Pietersen laugh with hilarious antics in NagpurStar India batter Virat Kohli was seen getting involved in a hilarious chat with former England cricketer Kevin Pietersen after India's win over England in Nagpur in first ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-quarterfinal-mumbai-vs-haryana-suryakumar-yadav-ajinkya-rahane-eden-gardens-2676497-2025-02-07",
      "headline": "Suryakumar Yadav expects good Eden Gardens track for Ranji Trophy quarterfinalSuryakumar Yadav is expecting a good Eden Gardens track for batters during the Mumbai vs Haryana quarterfinal in the Ranji Trophy. The match will start on Saturday, February 8, at the iconic venue as Mumbai hope to continue their title defence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-2nd-odi-indian-team-england-arrival-bhubaneswar-cuttack-2676555-2025-02-07",
      "headline": "IND vs ENG: Team India, England get grand welcome in Odisha ahead of 2nd ODIThe Indian team and England received a grand welcome from the fans as they reached Bhubaneswar Airport on Friday, February 7 ahead of the second ODI in Cuttack. Fans arrived to get a glimpse of the stars as both teams made their way to the team hotels. India hold a 1-0 lead and will be aiming to wrap it up with a win in the match on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-launch-new-jersey-for-icc-champions-trophy-2025-babar-azam-mohammad-rizwan-2676540-2025-02-07",
      "headline": "Watch: Babar Azam, Rizwan flaunt Pakistan's new jersey for Champions Trophy 2025 Star Pakistan cricketers Babar Azam and Mohammad Rizwan flaunted their new jersey for the ICC Champions Trophy 2025 in a special video released by the Pakistan Cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-new-zealand-vs-south-africa-odi-tri-series-squads-schedule-livestreaming-details-2676523-2025-02-07",
      "headline": "Pakistan vs New Zealand vs South Africa ODI tri-series: All you need to knowThe ODI tri-series format is all set to make a comeback as Pakistan welcome New Zealand and South Africa to their shores in what is seen as a dress rehersal before the upcoming ICC Champions Trophy. The matches will be played in the revamped stadiums in Karachi and Lahore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-makes-kevin-pietersen-laugh-ind-vs-eng-nagpur-kohli-injury-2676499-2025-02-07",
      "headline": "Watch: Virat Kohli makes Kevin Pietersen laugh with hilarious antics in NagpurStar India batter Virat Kohli was seen getting involved in a hilarious chat with former England cricketer Kevin Pietersen after India's win over England in Nagpur in first ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-quarterfinal-mumbai-vs-haryana-suryakumar-yadav-ajinkya-rahane-eden-gardens-2676497-2025-02-07",
      "headline": "Suryakumar Yadav expects good Eden Gardens track for Ranji Trophy quarterfinalSuryakumar Yadav is expecting a good Eden Gardens track for batters during the Mumbai vs Haryana quarterfinal in the Ranji Trophy. The match will start on Saturday, February 8, at the iconic venue as Mumbai hope to continue their title defence. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravichandran-ashwin-on-rohit-sharmas-poor-form-ind-vs-eng-india-vs-england-2676478-2025-02-07",
      "headline": "Ashwin's advice to struggling Rohit: Can't stop questions without performanceFormer India spinner Ravichandran Ashwin recently commented on Rohit Sharma's poor form, saying that India captain needs to score to stop scrunity on his dimsal run in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-bans-pakistan-from-international-events-after-constitution-revision-failure-2676477-2025-02-07",
      "headline": "FIFA bans Pakistan from international events after constitution revision failureFIFA has banned Pakistan Football Federation (PFF) from taking part in international competitions due to its failure to adopt a revision of its constitution. The FIFA also banned Congo Republic's football association (FECOFOOT) due to intereference from third parties in its internal affairs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-india-t20-world-cup-winners-champions-ring-nba-nfl-naman-awards-2676455-2025-02-07",
      "headline": "BCCI goes NBA, NFL way with 'Champions' ring for India's T20 WC 2024 winnersThe BCCI decided to take inspiration from the NBA and the NFL as they presented India's T20 World Cup 2024 winning squad with 'Champions' rings during the Naman awards. Each player got the special ring during the event on February 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-2nd-test-day-2-australia-take-lead-vs-sri-lanka-steve-smith-alex-carey-centuries-2676447-2025-02-07",
      "headline": "SL vs AUS: Smith and Carey's hundreds rescue Australia on Day 2 after early troubleAustralia finished Day 2 of the second Test against Sri Lanka in a commanding position as they finished the day on 330/3 leading Sri Lanka by 73 runs in the first innings. Steve Smith and Alex Carey scored magnificent hundreds to bring Australia into ascendancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcbs-sports-forward-nation-report-a-key-milestone-in-indias-sports-development-2676349-2025-02-07",
      "headline": "RCB's Sports Forward Nation report: A key milestone in India's sports developmentRoyal Challengers Bengaluru's Sports Forward Nation report is a key policy that has been prepared to highlight the sporting development and how the 2036 Olympics bid by India will enhance the growth of Indian sports using certain parameters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shreyas-iyers-return-perfect-example-for-seniors-to-play-domestic-cricket-sanjay-manjrekar-2676338-2025-02-07",
      "headline": "Iyer's return perfect example for seniors to play domestic cricket: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar praised Shreyas Iyer for his marvellous half-century on ODI comeback after six months mentioning the impact of domestic cricket on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-second-test-day-two-alex-carey-hundred-galle-2676311-2025-02-07",
      "headline": "Alex Carey becomes 2nd Australian wicketkeeper to hit Test hundred in AsiaAlex Carey became the second Australian wicketkeeper after Adam Gilchrist to hit a Test hundred in Asia on Day 2 of the ongoing match in Galle. Carey got to his hundred with a boundary as Australia stamped their authority on the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-2nd-test-day-2-australia-take-lead-vs-sri-lanka-steve-smith-alex-carey-centuries-2676447-2025-02-07",
      "headline": "SL vs AUS: Smith and Carey's hundreds rescue Australia on Day 2 after early troubleAustralia finished Day 2 of the second Test against Sri Lanka in a commanding position as they finished the day on 330/3 leading Sri Lanka by 73 runs in the first innings. Steve Smith and Alex Carey scored magnificent hundreds to bring Australia into ascendancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rcbs-sports-forward-nation-report-a-key-milestone-in-indias-sports-development-2676349-2025-02-07",
      "headline": "RCB's Sports Forward Nation report: A key milestone in India's sports developmentRoyal Challengers Bengaluru's Sports Forward Nation report is a key policy that has been prepared to highlight the sporting development and how the 2036 Olympics bid by India will enhance the growth of Indian sports using certain parameters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-shreyas-iyers-return-perfect-example-for-seniors-to-play-domestic-cricket-sanjay-manjrekar-2676338-2025-02-07",
      "headline": "Iyer's return perfect example for seniors to play domestic cricket: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar praised Shreyas Iyer for his marvellous half-century on ODI comeback after six months mentioning the impact of domestic cricket on his form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-second-test-day-two-alex-carey-hundred-galle-2676311-2025-02-07",
      "headline": "Alex Carey becomes 2nd Australian wicketkeeper to hit Test hundred in AsiaAlex Carey became the second Australian wicketkeeper after Adam Gilchrist to hit a Test hundred in Asia on Day 2 of the ongoing match in Galle. Carey got to his hundred with a boundary as Australia stamped their authority on the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-1st-odi-yashasvi-jaiswal-teased-by-teammates-after-sensational-catch-to-dismiss-duckett-2676276-2025-02-07",
      "headline": "Watch: Yashasvi Jaiswal gets teased by teammates after sensational catch in 1st ODIYoung India opener Yashasvi Jaiswal was teased by his teammates following his sensational catch in the first ODI against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-shafali-verma-indian-odi-team-omission-training-2676268-2025-02-07",
      "headline": "My father suffered a heart attack days before my ODI team omission: Shafali VermaShafali Verma opened up on the difficult period she had to endure over the past few months as her father suffered a heart attack days before she was dropped from the India ODI team. Shafali is aiming to make a comeback to the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa20-expansion-indian-cricketers-allan-donald-2676259-2025-02-07",
      "headline": "SA20 will grow if more Indian cricketers play: Allan Donald hints at league expansionSouth African great Allan Donald believes more participation from Indian cricketers will boost the SA20 league. MI Cape Town will take on defending champions Sunrisers Eastern Cape in Saturday's final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-steve-smith-36th-test-century-galle-gets-level-with-joe-root-and-rahul-dravid-2676242-2025-02-07",
      "headline": "Steve Smith slams 36th Test hundred, levels with Joe Root and India legendStar Australia batter Steve Smith scored his 36th Test century on Day 2 of the second Test against Sri Lanka in Galle. He became the joint fifth-highest century maker in Tests."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}