{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claim-rejection-india-policyholders-agony-18-percent-gst-premium-rising-health-term-life-hospitals-2742586-2025-06-19",
      "headline": "Insured, but at what cost?Hospitals are turning into battlegrounds over pending claims, with policyholders watching their premiums shoot up faster than their salaries. Insurance is no longer the comforting shield it once was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-70-lakh-salary-no-longer-guarantees-financial-comfort-in-indian-metros-2742911-2025-06-19",
      "headline": "Rs 70 lakh salary no longer guarantees comfort in Indian metrosAre urban professionals struggling even with Rs 70 lakh income per year? A Gurugram-based investment banker breaks down where the money really goes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-below-24800-tech-mahindra-shares-down-1-2742909-2025-06-19",
      "headline": "Sensex opens flat, Nifty below 24,800; Tech Mahindra shares down 1%The S&P BSE Sensex was down by 225.26 points to 81,219.40, while the NSE Nifty50 lost 56.75 points to 24,755.30 as of 9:21 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-june-19-crash-us-fed-rate-cut-stable-iran-israel-conflict-2742895-2025-06-19",
      "headline": "Stock market opening: Will Sensex, Nifty crash today over US Fed rate cut news?Gift Nifty futures were trading at 24,782 as of 8:23 am, which suggests that Nifty50 might open below Tuesday's closing level of 24,812.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-layoffs-tech-giant-cut-thousands-jobs-sales-ai-workforce-reduction-report-2742884-2025-06-19",
      "headline": "Microsoft to cut thousands of jobs in sales: ReportThe latest round of layoffs follows Microsoft's earlier job cuts in May, which impacted around 6,000 workers across various departments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-19-trading-tips-nse-bse-market-hdfc-bank-jio-financial-hero-abott-tata-elxsi-2742876-2025-06-19",
      "headline": "Stocks to watch June 19: HDFC Bank, Jio Financial, Hero, Abott, Tata ElxsiWith the US Federal Reserve deciding to keep its key lending rate unchanged, traders and investors in India may react cautiously in today's session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-cuts-15-of-international-flights-till-mid-july-amid-safety-checks-middle-east-tensions-2742812-2025-06-18",
      "headline": "Air India cuts 15% of international ops till mid-July citing checks, global unrestAir India has temporarily cut 15% of its international widebody flights until mid-July due to Middle East tensions, airspace curfews in Europe and East Asia, and increased safety measures following recent disruptions. This comes after the June 12 Ahmedabad plane crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dassault-reliance-infrastructure-to-make-falcon-2000-business-jets-in-india-2742607-2025-06-18",
      "headline": "Dassault, Reliance Infrastructure to make Falcon 2000 business jets in IndiaDassault said it aims to deliver the first made-in-India jets by 2028 for corporate and military use, and will cater to rising demand in both Indian and international markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-138-points-lower-nifty-below-24900-titan-down-2-2742604-2025-06-18",
      "headline": "Sensex ends 138 points lower, Nifty below 24,900; Titan down 2%The S&P BSE Sensex was down by 138.64 points to close at 81,444.66, while the NSE Nifty50 lost 41.35 points to end at 24,812.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-market-resurgence-june-july-rs-26000-crore-fundraising-hdb-financial-services-2742517-2025-06-18",
      "headline": "IPO market heats up with Rs 26,000 crore fundraising in JuneA resurgence in initial public offerings is evident as several major companies plan to launch IPOs in June and July, raising substantial funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bse-shares-fall-expiry-day-shift-thursday-market-share-impact-2742491-2025-06-18",
      "headline": "Explained: Why BSE shares are falling today The drop comes as the company announced a shift in the expiry day of its equity derivative contracts from Tuesdays to Thursdays, effective from September 1, after regulatory approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dlf-privana-north-luxury-homes-sell-out-seven-days-gurugram-2742472-2025-06-18",
      "headline": "DLF's Rs 11,000 crore Privana North luxury project sells out in a weekSituated in the expansive 116-acre township in Gurugram, this project notched up sales beyond Rs 11,000 crore, highlighting the robust market appetite for premium homes in India's big cities."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-films-are-school-of-perfectionism-one-lesson-at-a-time-sitaare-zameen-par-release-2742006-2025-06-19",
      "headline": "Why Aamir Khan's films are school of perfectionism, one lesson at a timeWith the release of 'Sitaare Zameen Par' on June 20, Aamir Khan returns as Bollywood's beloved moral science teacher. His films are known for blending entertainment with meaningful life lessons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jasmine-bhasin-reflects-on-life-after-shooting-for-the-traitors-2742938-2025-06-19",
      "headline": "Feeling lost and stuck: Jasmine Bhasin reflects on life after shooting for TraitorsActor Jasmine Bhasin opened up about the psychological challenges she faced during the intense 12-day shoot of the reality show 'The Traitors'. She revealed how it left her emotionally stirred and introspective. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-nidimoru-wife-shhyamali-de-cryptic-note-about-trust-dating-rumours-with-samantha-2742917-2025-06-19",
      "headline": "Raj Nidimoru's wife's cryptic note on trust amid his dating rumours with SamanthaDirector Raj Nidimoru's wife, Shhyamali De, shared a cryptic note about trust on her Instagram Stories. This came amid rumours of Raj dating actor Samantha Ruth Prabhu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-advice-to-daughter-nysa-on-online-trolling-concentrate-on-the-good-2742912-2025-06-19",
      "headline": "Concentrate on the good: Kajol's advice to daughter Nysa on online trollingKajol opened up about the lessons she imparts to her daughter, Nysa Devgan, on dealing with online trolling. She shared that her advice often involves reminding Nysa that she doesn't even know if the people behind the comments are real.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapurs-funeral-in-delhi-today-karisma-kapoors-kids-family-to-hold-prayer-meeting-2742874-2025-06-19",
      "headline": "Sunjay Kapur's funeral in Delhi today, Karisma and kids to pay tributeIndustrialist Sunjay Kapur died at the age of 53 during a polo match on June 13. His family has announced a prayer meeting in New Delhi on June 22."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-yuvan-shankar-raja-meet-during-outing-with-shalini-ajith-kumar-2742890-2025-06-19",
      "headline": "Ajith Kumar meets composer Yuvan Shankar Raja during outing with Shalini. PicsAjith Kumar recently met composer Yuvan Shankar Raja at a plush restaurant. Earlier, his wife and former actor Shalini posted a romantic photo with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/springsteen-deliver-me-from-nowhere-trailer-jeremy-allen-white-shines-as-music-legend-2742732-2025-06-18",
      "headline": "Springsteen Deliver Me From Nowhere trailer: Jeremy Allen White shines as music legendActor Jeremy Allen White is all set to portray American rock legend Bruce Springsteen in upcoming biopic. The trailer for the film, titled 'Springsteen: Deliver Me From Nowhere' was released on June 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-nagarjuna-kuberaa-gets-19-scenes-cut-by-censor-board-before-release-2742678-2025-06-18",
      "headline": "Censor board cuts 19 Scenes from Dhanush, Nagarjuna's Kuberaa ahead of releaseSekhar Kammula's 'Kuberaa', starring Dhanush, Nagarjuna, Rashmika Mandanna, and Jim Sarbh, has received a UA certificate from the CBFC after 19 scenes were trimmed from the original cut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/genelia-deshmukh-on-accidental-marriage-rumours-with-john-abraham-2742740-2025-06-18",
      "headline": "Genelia Deshmukh on accidental marriage rumours with John Abraham: No truth to itGenelia Deshmukh has shut down rumours that she accidentally married John Abraham during the shoot of 'Force'. She called the rumours baseless and PR-driven. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-the-rebel-kid-plans-to-move-abroad-says-mumbai-feels-too-accessible-2742730-2025-06-18",
      "headline": "Apoorva Mukhija plans to move abroad, says Mumbai feels too accessibleContent creator Apoorva Mukhija plans to leave Mumbai to pursue a master's degree abroad. She said the city feels too accessible and has limited growth. She also shared that achieving fame feels underwhelming, even after major milestones like appearing on billboards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/f1-movie-review-brad-pitt-delivers-the-most-enjoyable-film-of-the-year-2742724-2025-06-18",
      "headline": "F1 movie review: Brad Pitt delivers the most enjoyable film of the yearReleased-Fri Jun 27, 2025F1 movie review: Brad Pitt stars as an ageing racer in the adrenaline-fuelled F1 movie. The film delivers high-octane action and strong performances, promising a thrilling theatre experience, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/srk-hearty-bond-over-baazigar-70-minute-line-with-sitaares-aamir-film-watch-2742714-2025-06-18",
      "headline": "SRK's hearty bond over Baazigar, 70-minute line with Sitaares of Aamir's film. WatchShah Rukh Khan surprised Aamir Khan and 'Sitaare Zameen Par' cast on the film's set. In a BTS video, the superstar is seen hugging everyone while striking his signature pose. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dheeme-dheeme-in-croatia-kartik-aaryan-ananya-recreate-steps-in-now-deleted-video-2742733-2025-06-18",
      "headline": "Dheeme Dheeme in Croatia: Kartik Aaryan, Ananya recreate steps in now-deleted videoKartik Aaryan and Ananya Panday recreated 'Dheeme Dheeme' steps in the now-deleted video. This comes as Panday wrapped the Croatian shooting schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-hunt-trailer-nagesh-kukunoor-series-explores-rajiv-gandhi-assassination-case-2742720-2025-06-18",
      "headline": "The Hunt trailer: Nagesh Kukunoor's series explores Rajiv Gandhi assassination caseThe trailer of 'The Hunt: The Rajiv Gandhi Assassination Case' is out. The series, directed by Nagesh Kukunoor, is based on the bestselling book Ninety Days by investigative journalist Anirudhya Mitra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zayed-khan-calls-hrithik-roshan-sussanne-khan-soulmates-credits-evolved-family-equation-2742683-2025-06-18",
      "headline": "Zayed Khan: Sussanne and Hrithik are still soulmates even after divorceZayed Khan has spoken about the relationship between actor Hrithik Roshan and his ex-wife Sussanne Khan. He said the couple, who separated in 2014, are still soulmates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ador-wins-third-appeal-against-newjeans-seoul-court-upholds-management-rights-2742702-2025-06-18",
      "headline": "ADOR wins third legal battle against NewJeans over management rightsSeoul High Court rules in favour of ADOR for the third time in a dispute with NewJeans. The verdict reinforces ADOR's exclusive management rights amid growing fan anticipation for the group's third anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-shares-cryptic-post-gave-everything-for-my-loved-ones-2742660-2025-06-18",
      "headline": "I gave everything for my loved ones...: Abhishek Bachchan shares cryptic postActor Abhishek Bachchan recently shared an emotional post on social media reflecting on life philosophy, solitude, self-identity and inner-peace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-tahira-kashyap-broke-after-marriage-breast-cancer-battle-2742639-2025-06-18",
      "headline": "Tahira Kashyap recalls going broke after marriage: Ayushmann didn't understand…Ayushmann Khurrana's wife-filmmaker, Tahira Kashyap, recently shared an emotional anecdote about the time when the actor didn't realise who was handling their home expenses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hollywood-superheroes-inspired-by-indian-mythology-akshay-kumar-2742650-2025-06-18",
      "headline": "Hollywood superheroes inspired by Indian mythology: Akshay KumarActor Akshay Kumar, who will be seen in the upcoming mythological film 'Kannappa', said Hollywood superheroes and their superpowers are inspired by Indian mythology. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Iranian missile hits major hospital in Israel, thick plume of smoke emergesIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other for the seventh consecutive day. In a live address, Iran's Supreme Leader Ayatollah Khamenei declared that the nation remains united and will not bow to external pressure. Responding to US President Donald Trump's call for Iran to surrender, Khamenei issued a stern warning that any American military strike would lead to \"serious irreparable consequences\". Trump, on whether the US will attack Iran, said, \"I may do it, I may not do it. I mean, nobody knows what I'm going to do.\" Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-credits-india-pakistan-for-truce-after-mediation-claims-big-nuclear-powers-and-they-decided-2742915-2025-06-19",
      "headline": "Big nuclear powers, they decided: In a first, Trump credits India-Pak for truceIn remarks hours after meeting Field Marshal Asim Munir, US President Donald Trump did not take credit for stopping the military conflict between India and Pakistan, a first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/asim-munir-trump-lunch-pakistan-zia-ul-had-musharraf-us-dictators-2742855-2025-06-19",
      "headline": "Zia-Musharraf-Munir: Why the US needs Pakistan's dictatorsA 1947 British war memo shows why Pakistan, not India, suited post-imperial interests — creating a pliant state on Soviet, Iranian, and Arabian frontiers. In 2025, that logic still holds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-privately-approved-attack-plans-for-iran-but-withheld-final-order-report-glbs-2742835-2025-06-19",
      "headline": "Trump privately approved attack plans for Iran but withheld final order: ReportUS President Trump approved plans to strike Iran but delayed the final order, awaiting Iran's move on its nuclear program. A military build-up is underway as tensions rise, with over 450 dead in Iran and 24 in Israel, according to reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trump-feeds-general-munir-as-wars-feed-trumps-hunger-for-nobel-prize-2742905-2025-06-19",
      "headline": "Trump feeds General Munir as wars feed Trump's hunger for Nobel prizeThese are Trumpian times. Countries around the world are fighting among themselves to help him land the next Nobel Peace Prize. It's Trump's last term, he has all the money, he just needs a legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assembly-bypolls-in-4-states-today-key-test-for-nda-india-bloc-2742851-2025-06-19",
      "headline": "Kerala's Nilambur leads with 13.15% turnout till 9 am, lowest in Ludhiana West Live UpdatesAssembly bypolls for five seats across Punjab, West Bengal, Gujarat, and Kerala begin today. High-stakes contests and alliance dynamics are at play ahead of major state elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indians-in-iran-students-return-jammu-kashmir-poor-bus-condition-omar-abdullah-2742944-2025-06-19",
      "headline": "J&K students evacuated from Iran get shabby buses, Omar Abdullah takes noteDisappointed by the condition of the buses provided, the students said they expected better facilities after enduring days of tension abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/bunker-busters-bombers-and-battleships-how-us-is-preparing-for-iran-glbs-2742848-2025-06-19",
      "headline": "Bunker busters, bombers, and battleships: How US is preparing for IranThe US has deployed fighter jets, warships, and troops across the Middle East to protect Israel and deter Iran, as Trump warns Tehran and considers options including strikes on nuclear sites.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claim-rejection-india-policyholders-agony-18-percent-gst-premium-rising-health-term-life-hospitals-2742586-2025-06-19",
      "headline": "Insured, but at what cost?Hospitals are turning into battlegrounds over pending claims, with policyholders watching their premiums shoot up faster than their salaries. Insurance is no longer the comforting shield it once was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/news-menu-june-19-pm-wraps-up-historic-croatia-visit-keeladi-hots-up-tamil-nadu-2742881-2025-06-19",
      "headline": "News Menu, June 19: PM wraps up historic Croatia visit; Keeladi hots up Tamil NaduIn today's News Menu: Iran-Israel war deepens, India evacuates students from Iran, PM Modi concludes Croatia visit, and Delhi reels under rain woes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-understands-it-better-trump-discusses-iran-israel-conflict-with-asim-munir-glbs-2742831-2025-06-19",
      "headline": "What Donald Trump said on Iran-Israel conflict after meeting Pak's Asim MunirUS President Trump met Pakistan Army Chief Asim Munir, discussing the Iran-Israel conflict and South Asian stability. The meeting, held in the Cabinet Room, was followed by a formal luncheon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-cuts-15-of-international-flights-till-mid-july-amid-safety-checks-middle-east-tensions-2742812-2025-06-18",
      "headline": "Air India cuts 15% of international ops till mid-July citing checks, global unrestAir India has temporarily cut 15% of its international widebody flights until mid-July due to Middle East tensions, airspace curfews in Europe and East Asia, and increased safety measures following recent disruptions. This comes after the June 12 Ahmedabad plane crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-films-are-school-of-perfectionism-one-lesson-at-a-time-sitaare-zameen-par-release-2742006-2025-06-19",
      "headline": "Why Aamir Khan's films are school of perfectionism, one lesson at a timeWith the release of 'Sitaare Zameen Par' on June 20, Aamir Khan returns as Bollywood's beloved moral science teacher. His films are known for blending entertainment with meaningful life lessons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/big-explosion-rocks-elon-musks-spacex-base-during-starship-testing-2742945-2025-06-19",
      "headline": "Watch: Big explosion rocks Elon Musk's SpaceX base during Starship testingThe incident occurred just before Ship 36 was scheduled for a critical static fire test—a procedure in which the rocket's engines are ignited while the vehicle remains anchored to the ground, serving as a final systems check before launch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/microsoft-to-fire-thousands-of-employees-in-sales-next-month-amid-ai-expansion-report-2742894-2025-06-19",
      "headline": "Microsoft to fire thousands of employees in sales next month amid AI expansionMicrosoft is yet again planning to layoff several employees. According to a Bloomberg report, the tech giant will fire thousands of workers in the sales department. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fake-identity-112-calls-sonam-raj-kushwaha-megahalaya-honeymoon-raja-raghuvanshi-murder-2742868-2025-06-19",
      "headline": "Fake identity, 112 calls: Sonam's damning phone records before honeymoon murderAccording to police sources, Sonam contacted the number registered under the name Sanjay Verma 112 times between March 1 and March 25. She used to have long conversations with the person on the other end, who turned out to be Raj Kushwaha, her boyfriend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-captaincy-lesson-graeme-smith-2742631-2025-06-19",
      "headline": "Gill's big Test: Leadership lessons from Graeme Smith's historic England tourShubman Gill will be having his toughest test as a cricketer as he officially takes over the leadership duties of the Indian Test team beginning from June 20. The Prince of Indian cricket can take a leaf out of Graeme Smith's book, who faced a similar challenge in the early days of his Test captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-resumes-student-visas-with-mandatory-social-media-screening-for-applicants-glbs-2742832-2025-06-19",
      "headline": "US resumes student visas with mandatory social media screening for applicantsThe US has resumed student visa processing, now requiring applicants to share public social media accounts for vetting, aiming to detect anti-US content in a sweeping new security screening measure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/f1-movie-review-brad-pitt-delivers-the-most-enjoyable-film-of-the-year-2742724-2025-06-18",
      "headline": "F1 movie review: Brad Pitt delivers the most enjoyable film of the yearReleased-Fri Jun 27, 2025F1 movie review: Brad Pitt stars as an ageing racer in the adrenaline-fuelled F1 movie. The film delivers high-octane action and strong performances, promising a thrilling theatre experience, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modis-historic-visit-to-croatia-why-croatia-matters-for-india-2742850-2025-06-19",
      "headline": "PM Modi's historic visit to Croatia: Why Croatia matters for IndiaPrime Minister Narendra Modi's visit to Croatia on June 18, 2025, marked a watershed moment in India-Croatia relations, becoming the first Indian Prime Minister to visit the country since diplomatic ties were established in 1992. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tata-group-chairman-apologises-air-india-crash-says-feel-very-sorry-2742839-2025-06-19",
      "headline": "Got to do better: Tata chief on Air India delays after crash, passenger complaintsTata Group Chairman N Chandrasekaran expressed deep regret over the tragic Air India crash in Ahmedabad that killed over 270 people. He urged patience until the investigation is complete, affirming support for the victims' families and defending the aircraft's and crew's record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-aviation-rules-demolish-obstructions-near-airports-after-air-india-crash-2742829-2025-06-19",
      "headline": "New aviation rules to demolish obstructions near airports after Air India crashThe Aviation Ministry has issued new draft rules to demolish or reduce the height of structures near airports to ensure flight safety after the Air India crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kamal-haasan-film-thug-life-ban-restriction-in-karnataka-government-in-supreme-court-2742857-2025-06-19",
      "headline": "No restriction on Kamal Haasan's Thug Life: Karnataka government in top courtThe Karnataka government informed the court that the film's producer had voluntarily given an undertaking to the Karnataka High Court, agreeing not to release the film until the matter is resolved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/photo/dhanush-kriti-sanon-shine-at-raanjhanaa-12-year-bash-sonam-kapoor-skips-2742899-2025-06-19",
      "headline": "Dhanush, Kriti Sanon shine at Raanjhanaa's 12-year bash, Sonam Kapoor skipsOn its 12th anniversary, a special screening of Anand L Rai's 'Raanjhanaa' was hosted by its makers on June 18. It was attended by the film's cast, including Dhanush and Mohammed Zeeshan Ayyub. Notably, Sonam Kapoor gave it a miss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-films-are-school-of-perfectionism-one-lesson-at-a-time-sitaare-zameen-par-release-2742006-2025-06-19",
      "headline": "Why Aamir Khan's films are school of perfectionism, one lesson at a timeWith the release of 'Sitaare Zameen Par' on June 20, Aamir Khan returns as Bollywood's beloved moral science teacher. His films are known for blending entertainment with meaningful life lessons. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/raj-nidimoru-wife-shhyamali-de-cryptic-note-about-trust-dating-rumours-with-samantha-2742917-2025-06-19",
      "headline": "Raj Nidimoru's wife's cryptic note on trust amid his dating rumours with SamanthaDirector Raj Nidimoru's wife, Shhyamali De, shared a cryptic note about trust on her Instagram Stories. This came amid rumours of Raj dating actor Samantha Ruth Prabhu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-advice-to-daughter-nysa-on-online-trolling-concentrate-on-the-good-2742912-2025-06-19",
      "headline": "Concentrate on the good: Kajol's advice to daughter Nysa on online trollingKajol opened up about the lessons she imparts to her daughter, Nysa Devgan, on dealing with online trolling. She shared that her advice often involves reminding Nysa that she doesn't even know if the people behind the comments are real.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapurs-funeral-in-delhi-today-karisma-kapoors-kids-family-to-hold-prayer-meeting-2742874-2025-06-19",
      "headline": "Sunjay Kapur's funeral in Delhi today, Karisma and kids to pay tributeIndustrialist Sunjay Kapur died at the age of 53 during a polo match on June 12. His family has announced a prayer meeting in New Delhi on June 22."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fifa-club-world-cup-real-madrid-al-hilal-draw-manchester-city-juventus-wins-2742913-2025-06-19",
      "headline": "Al-Hilal hold Real Madrid to 1-1 draw, Man City, Juve notch winsSimone Inzaghi's Al-Hilal managed to scrape a point with a draw against Xabi Alonso's Real Madrid in the biggest upset in the Club World Cup so far. Meanwhile, both Manchester City and Juventus start off their campaign with impressive wins as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-ben-stokes-vs-jasprit-bumrah-2742921-2025-06-19",
      "headline": "Ben Stokes' warning for India: England do not fear Jasprit BumrahEngland Test captain Ben Stokes has said his team does not fear India's Jasprit Bumrah. He emphasised that winning a Test series depends on the entire team, not just one bowler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-ollie-pope-jasprit-bumrah-2742896-2025-06-19",
      "headline": "Can this Ollie Pope plan help England neutralise Jasprit Bumrah?England vice-captain Ollie Pope has outlined his strategy to tackle Jasprit Bumrah in the first Test at Headingley. His plan focusses on rotating the strike to reduce Bumrah's impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-test-series-mukesh-kumar-instagram-story-harshit-rana-2742877-2025-06-19",
      "headline": "Mukesh Kumar's cryptic Instagram story goes viral: Karma is unforgivableIndia fast bowler Mukesh Kumar shared a cryptic Instagram post just before the start of India's 1st Test against England. His message has raised questions about his omission and team dynamics ahead of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-batting-test-virat-kohli-2742863-2025-06-19",
      "headline": "Can KL Rahul step up in absence of Virat Kohli to lead India's charge vs England?India tour of England: With Virat Kohli and Rohit Sharma absent, KL Rahul—now the senior-most batter in the side—finds himself as the pillar around which India's five-Test campaign in England must be built. This is his moment to step up, and with it comes the weight of expectation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-captaincy-lesson-graeme-smith-2742631-2025-06-19",
      "headline": "Gill's big Test: Leadership lessons from Graeme Smith's historic England tourShubman Gill will be having his toughest test as a cricketer as he officially takes over the leadership duties of the Indian Test team beginning from June 20. The Prince of Indian cricket can take a leaf out of Graeme Smith's book, who faced a similar challenge in the early days of his Test captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mykhailo-mudryk-anti-doping-violation-ban-four-years-chelsea-2742815-2025-06-18",
      "headline": "Chelsea's Mudryk faces potential four-year ban after FA doping chargeMykhailo Mudryk's career hangs in the balance as the Chelsea winger faces a possible four-year suspension following FA doping charges, marking a dramatic fall from grace for the €89 million signing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ayush-mhatre-signed-bat-india-u-19-england-tour-2742774-2025-06-18",
      "headline": "Rohit Sharma gifts Ayush Mhatre signed bat ahead of India U-19's England tourIn a heartwarming post on social media, Ayush Mhatre revealed that he got a signed bat from Rohit Sharma as a gift on Wednesday, June 18. Mhatre will be leading the Indian U-19 team for their tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/real-madrid-vs-al-hilal-fifa-club-world-cup-xabi-alonso-era-livestreaming-india-2742771-2025-06-18",
      "headline": "Real Madrid vs Al Hilal, FIFA Club World Cup: Stage set for Xabi era's unveilingXabi Alonso begins his Real Madrid managerial journey with high expectations as the club kicks off their FIFA Club World Cup campaign against Al Hilal—his first real test after a trophyless season for Los Blancos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-and-i-have-a-really-good-camaraderie-off-the-field-rishabh-pant-2742762-2025-06-18",
      "headline": "Shubman Gill and I have a really good camaraderie off the field: Rishabh PantRishabh Pant opened up on his relationship with new India Test captain Shubman Gill and said that he gels really well with the 25-year-old on and off the field. Pant will act as Gill's deputy as he begins his time as the new skipper of the Indian team in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-risabh-pant-relieved-not-face-james-anderson-stuart-broad-2742760-2025-06-18",
      "headline": "Rishabh Pant relieved he won't face Anderson-Broad duo in England TestsRishabh Pant admitted he's relieved not to face James Anderson and Stuart Broad in the upcoming England Test series, with both legendary pacers having retired and not part of India's challenging tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mykhailo-mudryk-anti-doping-violation-ban-four-years-chelsea-2742815-2025-06-18",
      "headline": "Chelsea's Mudryk faces potential four-year ban after FA doping chargeMykhailo Mudryk's career hangs in the balance as the Chelsea winger faces a possible four-year suspension following FA doping charges, marking a dramatic fall from grace for the €89 million signing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-ayush-mhatre-signed-bat-india-u-19-england-tour-2742774-2025-06-18",
      "headline": "Rohit Sharma gifts Ayush Mhatre signed bat ahead of India U-19's England tourIn a heartwarming post on social media, Ayush Mhatre revealed that he got a signed bat from Rohit Sharma as a gift on Wednesday, June 18. Mhatre will be leading the Indian U-19 team for their tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/real-madrid-vs-al-hilal-fifa-club-world-cup-xabi-alonso-era-livestreaming-india-2742771-2025-06-18",
      "headline": "Real Madrid vs Al Hilal, FIFA Club World Cup: Stage set for Xabi era's unveilingXabi Alonso begins his Real Madrid managerial journey with high expectations as the club kicks off their FIFA Club World Cup campaign against Al Hilal—his first real test after a trophyless season for Los Blancos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-and-i-have-a-really-good-camaraderie-off-the-field-rishabh-pant-2742762-2025-06-18",
      "headline": "Shubman Gill and I have a really good camaraderie off the field: Rishabh PantRishabh Pant opened up on his relationship with new India Test captain Shubman Gill and said that he gels really well with the 25-year-old on and off the field. Pant will act as Gill's deputy as he begins his time as the new skipper of the Indian team in the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-risabh-pant-relieved-not-face-james-anderson-stuart-broad-2742760-2025-06-18",
      "headline": "Rishabh Pant relieved he won't face Anderson-Broad duo in England TestsRishabh Pant admitted he's relieved not to face James Anderson and Stuart Broad in the upcoming England Test series, with both legendary pacers having retired and not part of India's challenging tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-virat-kohli-rohit-sharma-retirement-brydon-carse-2742756-2025-06-18",
      "headline": "Virat Kohli, Rohit Sharma big losses, but India has enough depth: Brydon CarseBrydon Carse admitted that Virat Kohli and Rohit Sharma will be big misses for India during their tour of England, but said that the visitors have enough depth in their lineup to put up a challenge. Kohli and Rohit retired from Test cricket ahead of the tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-vs-bangladesh-galle-test-day-2-report-mushfiqur-rahim-najmul-shanto-2742749-2025-06-18",
      "headline": "Mushfiqur, Shanto lead BAN charge before SL fight back late on Day 2Bangladesh dominated early on Day 2 through stellar knocks from Mushfiqur Rahim, Najmul Hossain Shanto, and Litton Das, but Sri Lanka hit back late with a sharp bowling display to leave the Galle Test intriguingly balanced heading into Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-barcelona-sign-joan-garcia-espanyol-hansi-flick-2742735-2025-06-18",
      "headline": "Barcelona sign highly-rated Joan Garcia from Catalan rivals EspanyolBarcelona have announced the signing of highly-rated goalkeeper Joan Garcia from Catalan rivals Espanyol on Wednesday, June 18. Garcia joins Barca's stacked goalkeeper department that already has Marc-Andre Ter Stegen and Wojciech Szczesny. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rishabh-pant-ahmedabad-air-india-crash-make-india-happy-against-ind-vs-eng-test-2742727-2025-06-18",
      "headline": "Ahmedabad crash left India saddened, will try to make nation happy: PantIndia vice-captain Rishabh Pant expressed hope that India's Test series against England can offer the nation a reason to smile following the tragic Ahmedabad plane crash, which claimed 275 lives just days before the Headingley Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-playing-xi-jacob-bethell-ollie-pope-headingley-2742715-2025-06-18",
      "headline": "ENG vs IND: No Bethell, Pope at No.3 as England name playing XI for 1st TestOllie Pope has won the race to be No.3 for England in the first Test against India as the hosts announced their playing XI for the match at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-first-test-shubman-gill-number-four-rishabh-pant-2742698-2025-06-18",
      "headline": "Shubman Gill will bat at No.4: Rishabh Pant confirms batting spot for India captainRishabh Pant has confirmed that India's new Test captain Shubman Gill will be batting at No.4 during the first Test against England, starting from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-world-test-champions-return-home-heroes-welcome-temba-bavuma-2742666-2025-06-18",
      "headline": "WTC winners South Africa get heroes' welcome as Bavuma leads homecomingSouth Africa's Test team returned home to a rousing heroes' welcome after their historic WTC Final win over Australia, with captain Temba Bavuma proudly leading the squad and holding the championship mace aloft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-jacob-bethell-ollie-pope-number-three-spot-rob-key-2742665-2025-06-18",
      "headline": "Bethell vs Pope for No.3: Rob Key feels Headingley call won't define careersRob Key feels that the battle between Ollie Pope and Jacob Bethell for the No.3 spot for the Headingley Test won't end up defining their careers. Both men have staked a claim for the spot with their strong performances in recent times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-playing-xi-jacob-bethell-ollie-pope-headingley-2742715-2025-06-18",
      "headline": "ENG vs IND: No Bethell, Pope at No.3 as England name playing XI for 1st TestOllie Pope has won the race to be No.3 for England in the first Test against India as the hosts announced their playing XI for the match at Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-first-test-shubman-gill-number-four-rishabh-pant-2742698-2025-06-18",
      "headline": "Shubman Gill will bat at No.4: Rishabh Pant confirms batting spot for India captainRishabh Pant has confirmed that India's new Test captain Shubman Gill will be batting at No.4 during the first Test against England, starting from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-world-test-champions-return-home-heroes-welcome-temba-bavuma-2742666-2025-06-18",
      "headline": "WTC winners South Africa get heroes' welcome as Bavuma leads homecomingSouth Africa's Test team returned home to a rousing heroes' welcome after their historic WTC Final win over Australia, with captain Temba Bavuma proudly leading the squad and holding the championship mace aloft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-jacob-bethell-ollie-pope-number-three-spot-rob-key-2742665-2025-06-18",
      "headline": "Bethell vs Pope for No.3: Rob Key feels Headingley call won't define careersRob Key feels that the battle between Ollie Pope and Jacob Bethell for the No.3 spot for the Headingley Test won't end up defining their careers. Both men have staked a claim for the spot with their strong performances in recent times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-rohit-sharma-virat-kohli-retirement-geoffrey-boycott-2742647-2025-06-18",
      "headline": "Rohit won't be missed as much as Kohli by Indian team: Geoffrey BoycottFormer England opener Geoffrey Boycott feels Rohit Sharma won't be missed as much as Virat Kohli in Test cricket. Boycott also explained why Kohli may have decided to retire from Test cricket ahead of the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/suryakumar-yadav-sports-hernia-fly-to-london-possible-surgery-2742626-2025-06-18",
      "headline": "Suryakumar Yadav travels to London for possible sports hernia surgeryIndia T20I captain Suryakumar Yadav has flown to London for a medical consultation regarding a sports hernia. The injury may require surgery, which could impact his availability for India's upcoming T20I series in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-new-captain-bernardo-silva-pep-guardiola-2742609-2025-06-18",
      "headline": "Premier League: Manchester City name Bernardo Silva as new captainBernardo Silva has been named Manchester City captain ahead of the new season. Pep Guardiola decided to ditch the usual method and personally named Silva as the skipper and Rodri, Ruben Dias and Erling Haaland as the vice-captains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-gautam-gambhir-joins-squad-hedingley-test-leeds-2742608-2025-06-18",
      "headline": "Coach Gautam Gambhir joins India squad in Leeds ahead of first TestIndia's head coach Gautam Gambhir returned to the national squad in Leeds just in time for the first Test against England, bringing experience and direction back into the camp after briefly stepping away due to a family emergency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/women-t20-world-cup-2026-fixtures-full-list-schedule-ind-vs-pak-lords-final-2742599-2025-06-18",
      "headline": "Women's T20 World Cup 2026 schedule: IND vs PAK on June 14, final at Lord'sThe full schedule for the ICC Women's T20 World Cup 2026 has been unveiled, with the tournament set to take place across England and Wales. The competition will get underway on June 12 and will run for 24 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-club-world-cup-opener-kylian-mbappe-doubtful-illness-2742582-2025-06-18",
      "headline": "Club World Cup: Kylian Mbappe doubtful for Real Madrid's opening fixture vs Al HilalReal Madrid are hoping Kylian Mbappe makes a full recovery after the forward fell ill ahead of their opening FIFA Club World Cup match against Al-Hilal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fast-bowler-umesh-yadav-desperate-for-india-comeback-2742581-2025-06-18",
      "headline": "Emotional Umesh Yadav yearns for India comeback: I can't select myselfIndia fast bowler Umesh Yadav is yearning to make a comeback to the Indian team, having not played for the country for over two years. Umesh last played for India in the World Test Championship final against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-2025-26-fixtures-manchester-united-arsenal-liverpool-sunderland-leeds-2742559-2025-06-18",
      "headline": "Premier League 2025-26 fixtures: Manchester United face Arsenal in opening weekManchester United will host Arsenal in the first Super Sunday clash of the 2025/26 Premier League season, with Liverpool, Manchester City, Chelsea, and FA Cup winners Crystal Palace also playing on a bumper opening weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/joe-root-bazball-england-cricket-team-india-tour-2742538-2025-06-18",
      "headline": "Root on how Bazball works: More method to it than probably perceivedJoe Root opened up about what it means to play the Bazball way, highlighting how the past few years have been among the most enjoyable of his career—especially as he was one of the highest run-scorers in the previous World Test Championship campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-england-plotting-all-out-attack-on-india-on-leeds-pitch-2742530-2025-06-18",
      "headline": "England plotting 'all-out attack' on India with tailor-made Leeds pitchEngland are planning an all-out attack against India in the first Test at Headingley, Leeds, beginning from June 20, with a tailor-made pitch to support their aggressive batting approach."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-joe-root-dissects-virat-kohlis-outside-off-stump-woes-2742483-2025-06-18",
      "headline": "Joe Root dissects Virat Kohli's off-stump woes: Technical changes can backfireStar England batter Joe Root has shared his views on Virat Kohli's outside off-stump woes, saying that it gets difficult for a batter to make changes midway through the series with little turnaround time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/daniel-levy-on-ange-postecoglou-exit-tottenham-hotspur-2742452-2025-06-18",
      "headline": "Spurs chairman explains Ange Postecoglou exit: We need to win Premier LeagueTottenham Hotspur chairman Daniel Levy felt that removing Ange Postecoglou as manager was necessary, believing the club needed to compete strongly on all fronts. Despite winning the Europa League, the team had a disappointing domestic season, finishing 17th in the Premier League."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}