{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-guardian-in-talks-to-sell-observer-newspaper-to-tortoise-media-2601546-2024-09-17",
      "headline": "UK's Guardian in talks to sell Observer newspaper to Tortoise Media: ReportTortoise said negotiations include a commitment from it to invest more than 25 million pounds ($33 million) over the next five years in the editorial and commercial renewal of the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/smriti-irani-discusses-gender-parity-with-world-bank-leaders-highlights-indias-progress-2601374-2024-09-17",
      "headline": "Smriti Irani discusses gender parity with World Bank leaders, highlights India's progressDuring her meeting in Washington, Smriti Irani highlighted the need for effective implementation of gender equity policies to ensure that women, especially in developing regions, can contribute to both government and industry while realising their full potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-stock-market-closing-us-federal-reserve-rate-decision-2601322-2024-09-17",
      "headline": "Sensex, Nifty rise ahead of US Fed rate decision; Ola Electric shares surgeThe S&P BSE Sensex was up 90.88 points at 83,079.66 at the closing bell, while the NSE Nifty50 gained 34.80 points to settle at 25,418.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-launches-alert-trigger-orders-on-kite-mobile-what-you-need-to-know-2601286-2024-09-17",
      "headline": "Zerodha to bring 'Alert Trigger Orders' on Kite mobile: What you need to knowUnlike standard alerts that only notify traders when certain market conditions are met, ATOs take it a step further by automatically executing a basket of orders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-rally-160-percent-post-ipo-book-profits-or-hold-explained-2601219-2024-09-17",
      "headline": "Bajaj Housing Finance shares rally 160% post-IPO: Book profits or hold?Bajaj Housing Finance share price: On Tuesday, the stock hit its 10% upper circuit at Rs 181.50 on the National Stock Exchange (NSE), continuing its upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-25-or-50-bps-how-will-it-impact-global-market-explained-2601209-2024-09-17",
      "headline": "Will US Fed cut rates by 25 bps or 50 bps? Here's all you need to knowA 25 bps rate cut could calm markets, but a deeper one may raise economic alarm.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-rate-cut-25-or-50-bps-this-week-why-is-it-important-explained-2601192-2024-09-17",
      "headline": "US Fed likely to cut key rates this week. Why is it a big deal?The US central bank is likely to cut interest rates for the first time in more than four years, with experts predicting a 0.25 percentage point reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-50-percent-upside-goldman-sachs-price-target-rs-160-2601154-2024-09-17",
      "headline": "Ola Electric set for 50% upside? Here's why Goldman Sachs is bullishGoldman Sachs has projected a 50% upside for the Ola Electric stock, setting a target price of Rs 160. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-on-a-roll-after-bumper-ipo-listing-is-there-more-upside-2601135-2024-09-17",
      "headline": "Bajaj Housing Finance shares continue post-IPO rally. More upside left?Bajaj Housing Finance share price: The sharp rise in the company's share price comes a day after the company's stellar IPO debut and indicates continued bullish momentum in the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-jumped-over-6-percent-today-explained-2601100-2024-09-17",
      "headline": "Explained: Why Ola Electric shares jumped over 6% todayOla Electric shares rebound sharply after a month-long slump. Read on to know what fuelled today's surge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-makes-bumper-debut-book-profit-now-or-stay-invested-2601087-2024-09-17",
      "headline": "PN Gadgil Jewellers makes bumper debut: Book profit now or stay invested?PN Gadgil Jewellers share price: Market experts see the sharp premium at listing as a signal of investor confidence in PN Gadgil's strong growth trajectory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-shares-make-bumper-debut-with-73-premium-over-ipo-price-2601082-2024-09-17",
      "headline": "PN Gadgil Jewellers shares make bumper debut with 73% premium over IPO pricePN Gadgil Jewellers listing: The Maharashtra-based jewellery retail chain saw a strong listing on the Bombay Stock Exchange (BSE), where its shares opened at Rs 834, marking a 73.75% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-flat-us-federal-reserve-interest-rate-cut-decision-2601070-2024-09-17",
      "headline": "Sensex, Nifty open flat near all-time highs ahead of US Fed's rate decisionThe S&P BSE Sensex was down 23.7 points at 82,965.08, while the NSE Nifty50 fell 3.25% to 25,380.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oberoi-family-dispute-prs-will-legacy-what-has-happened-so-far-in-court-legal-proceeding-2600786-2024-09-17",
      "headline": "Inheritance war: How fight for PRS Oberoi's legacy is unfolding in courtThe dispute revolves around late PRS Oberoi's estate, with conflicting wills and claims on shares, properties, and assets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-competition-laws-cci-favour-2600861-2024-09-16",
      "headline": "Amazon, Flipkart violated competition laws by favouring certain sellers: ReportThe investigation was triggered by a complaint from the Delhi Vyapar Mahasangh, which is an affiliate of the country's biggest trade body, Confederation of All India Traders (CAIT), that represents 80 million retailers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-cut-can-it-steer-economy-toward-soft-landing-report-2600804-2024-09-16",
      "headline": "US Fed poised to cut rates: Can it steer economy toward soft landing?After months of elevated interest rates, the Fed is likely to lower its benchmark rate, potentially giving a much-needed break to the economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-close-slightly-higher-bajaj-housing-finance-shines-on-debut-2600658-2024-09-16",
      "headline": "Sensex, Nifty close slightly higher; Bajaj Housing Finance shines on debutThe S&P BSE Sensex ended the trading session 97.84 points higher at 82,988.78, while the NSE Nifty50 rose 27.25 points to settle at 25,383.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-withdraws-external-influence-claims-after-talks-with-employees-madhabi-puri-buch-2600643-2024-09-16",
      "headline": "Sebi withdraws statement blaming external elements for staff protestsJust under two weeks ago, Sebi had issued a statement suggesting that external forces were behind the unrest among its staff, which was seen as an attempt to discredit the organisation and its leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-listing-bonanza-missed-alternate-options-experts-explained-2600641-2024-09-16",
      "headline": "Missed Bajaj Housing Finance listing day rally? Check these alternate optionsBajaj Housing Finance bumper listing: By the end of the trading session, the company's stock price stood at Rs 164.99, marking a significant increase over its IPO issue price. But for those who missed out on the listing day windfall, what are the next steps?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oberoi-inheritance-war-siblings-clash-over-late-prs-oberois-will-vikramjit-natasha-arjun-anastasia-2600606-2024-09-16",
      "headline": "Oberoi inheritance war: Siblings clash over late PRS Oberoi's willOn one side are Vikramjit Oberoi, Natasha Oberoi, and Arjun Oberoi. On the other side is Anastasia Oberoi, PRS Oberoi's daughter from his second marriage to Mirjana Jojic Oberoi."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-fighters-injured-lebanon-pagers-explode-in-biggest-security-breach-2601482-2024-09-17",
      "headline": "8 killed, nearly 3,000 injured in Lebanon pager blasts, Hezbollah blames IsraelAccording to Reuters, a Hezbollah official said the detonation of the pagers was the \"biggest security breach\" the group had been subjected to in nearly a year of war with Israel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/atishi-delhi-chief-minister-aap-arvind-kejriwal-2601112-2024-09-17",
      "headline": "Arvind Kejriwal quits as Chief Minister, Atishi stakes claim to form governmentAtishi's name was proposed by Kejriwal at the meeting of the legislature party, and it was unanimously accepted by the AAP MLAs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-visit-september-21-23-quad-summit-un-general-assembly-joe-biden-2601471-2024-09-17",
      "headline": "PM in US from September 21-23 for Quad, will address UN General AssemblyAccording to a release by the Ministry of External Affairs, PM Modi will attend the Quad meeting in Wilmington, Delaware, which will be hosted by US President Joe Biden."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/sean-diddy-combs-indicted-on-sex-trafficking-and-racketeering-charges-2601487-2024-09-17",
      "headline": "Rapper Sean 'Diddy' indicted on sex trafficking and racketeering chargesAmerican rapper Sean 'Diddy' Combs has been charged with sex trafficking. Combs had been arrested late Monday in Manhattan, US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/video-moment-hezbollah-members-pagers-exploded-grocery-store-in-lebanon-2601544-2024-09-17",
      "headline": "Moment Hezbollah members' pagers exploded at grocery store in LebanonIn a grocery store in Lebanon, Hezbollah members were injured when the pagers they used to communicate exploded.  Over 1,000 individuals, including Hezbollah fighters and medics, were injured across Lebanon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-final-china-vs-india-report-jugraj-singh-craig-fulton-2601384-2024-09-17",
      "headline": "India win 5th Asian Champions Trophy hockey title after beating resolute ChinaJugarj Singh's 51st minute goal proved to be the difference as India defeated China 1-0 in the final to win their 5th Asian Champions Trophy on September 17, Tuesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/lebanon-pagers-detonation-explosions-injured-beirut-israel-gaza-war-tensions-2601550-2024-09-17",
      "headline": "Wave of pager detonations in Lebanon lasted an hour: What we know so farThe wave of pager explosions that injured over 2,750 people, including Hezbollah fighters and the group's medical personnel, lasted for about an hour after the initial blasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-mumbai-expressway-road-portion-in-rajasthan-dausa-caves-in-2601503-2024-09-17",
      "headline": "Video: Portion of Delhi-Mumbai Expressway in Rajasthan's Dausa caves inA video recorded by commuters shows a deep crater in the middle of the road on the Delhi-Mumbai Expressway. Another video shows a bulldozer removing the debris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-aam-aadmi-party-delhi-cm-atishi-singh-aap-now-in-new-pack-2601273-2024-09-17",
      "headline": "How Kejriwal is using Atishi to repackage AAP before pollsAAP convenor Arvind Kejriwal stepped down as the chief minister of Delhi and named Atishi as his successor. The move, months ahead of the Assembly polls, is to repackage the AAP by getting a taint-free person as its face even as the hands pulling the strings remain the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-government-manipur-violence-roadmap-fencing-work-india-myanmar-border-meiteis-kukis-2601377-2024-09-17",
      "headline": "Government making roadmap for peace in Manipur, border fencing work on: Amit ShahUnion Home Minister Amit Shah said the government was preparing a roadmap for restoring peace in violence-hit Manipur and talking to the Meitei and Kuki communities. He said 30 km of fencing work was completed on the India-Myanmar border."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-ncr-rain-traffic-jams-imd-weather-forecast-2601505-2024-09-17",
      "headline": "Heavy rain in Delhi during rush hour, crippling traffic jamsThe India Meteorological Department (IMD) had predicted rainfall on Tuesday and Wednesday in Delhi due to the influence of a depression caused as an aftermath of Cyclone Yagi, which is moving northwestwards from Jharkhand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-congressman-ro-khanna-supports-rohit-sharma-journalist-after-rahul-gandhi-team-assault-snatch-phone-freedom-of-speech-2601401-2024-09-17",
      "headline": "Congressman Ro Khanna slams assault on India Today reporter by Rahul Gandhi's teamIndian-American Congressman Ro Khanna has come out in support of journalist Rohit Sharma who was assaulted by Rahul Gandhi's team in Dallas, Texas. Sharma reported being physically assaulted and having his phone seized by Gandhi's team in the run-up to the Congress leader's visit to Dallas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-aditi-rao-hydari-and-siddharth-wedding-photographer-clicked-their-sunrise-pic-2601485-2024-09-17",
      "headline": "How Aditi Rao Hydari, Siddharth's wedding photographer clicked their sunrise picAditi Rao Hydari and Siddharth got married in a traditional ceremony and shared pictures from the event on social media. Now, their wedding photographer Joseph Radhik has revealed the tricks he used to capture the stunning moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-listening-leader-piyush-goyal-nda-third-term-u-turns-first-100-days-2601376-2024-09-17",
      "headline": "PM Modi a listening leader: Piyush Goyal on NDA 3.0's 'U-turns' in first 100 daysSpeaking exclusively to India Today TV on the first 100 days of the NDA government's third term, Union Minister Piyush Goyal said rejected the Opposition's charge of the NDA government making 'U-turns' in its first 100 days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/swati-maliwal-attacks-atishi-appointment-as-delhi-chief-minister-her-family-fought-to-stop-afzal-guru-hanging-2601199-2024-09-17",
      "headline": "Swati Maliwal attacks Atishi, says her family fought to stop Afzal Guru's hangingRajya Sabha MP Swati Maliwal, who's had a bitter falling out with the Aam Aadmi Party, criticised the decision to appoint Atishi as Delhi's Chief Minister. Maliwal said that her parents had fought to prevent terrorist Afzal Guru's execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-30-100-days-vs-modi-20-celebration-contrast-ayushman-bharat-waqf-lateral-entry-broadcasting-bill-indexation-property-2601208-2024-09-17",
      "headline": "100 days of Modi 3.0 vs Modi 2.0: Why C is for contrastAs Modi 3.0 marks its first 100 days with a blend of bold moves and strategic retreats, the contrast with the sweeping reforms of Modi 2.0 is clearly visible. Short of a majority, the BJP's shift from big-bang actions to a more cautious approach shows that in the dance of democracy, compromise is as crucial as ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/maharashtra-teacher-rushes-to-resolve-fight-among-students-only-to-get-a-surprise-watch-the-video-2601461-2024-09-17",
      "headline": "Maharashtra teacher rushes to resolve fight among students only to get a surprise. VideoA teacher got a surprise when she rushed to stop a fight among students in the classroom. A video of the episode went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/supreme-court-pauses-unauthorised-bulldozer-action-2601278-2024-09-17",
      "headline": "Supreme Court pauses unauthorised bulldozer action till October 1The court stated that its directives are not applicable to any unauthorised construction on public roads, footpaths, among others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/florida-boy-carlo-kingston-dorelli-11-arrested-shooting-threat-kill-list-2601362-2024-09-17",
      "headline": "Florida boy, 11, arrested after mass shooting threat, bragging about 'kill list'An 11-year-old boy from Florida, Carlo 'Kingston' Dorelli, was arrested after making violent threats and showing classmates a video of his weapons collection. The boy faced felony charges for making a written threat of a mass shooting.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-celebrates-r-ashwins-birthday-smears-him-with-cake-in-chepauk-2601484-2024-09-17",
      "headline": "Indian team celebrates R Ashwin's birthday, smears him with cake in ChepaukThe Indian team celebrated Ravichandran Ashwin's 38th birthday in the team's dressing room at Chepauk. Rishabh Pant smeared Ashwin with chocolate cake all over his face. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/11-countries-that-worship-ganesha-in-different-forms-2601429-2024-09-17",
      "headline": "11 countries that worship Ganesha in different formsGanesha, the remover of obstacles, is worshipped globally in different forms, with each culture adding its own unique twist to his symbolism and reverence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/kolkata-doctor-rape-murder-rg-kar-hospital-supreme-court-hearing-2601023-2024-09-17",
      "headline": "Supreme Court on Bengal's 'no night shift' order: Provide security to womenKolkata rape-murder: The Central Bureau of Investigation (CBI) submitted a fresh status report to the Supreme Court regarding the ongoing investigation into the RG Kar rape and murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/paedophilia-stalking-abuse-what-kidfluencers-pay-to-make-money-online-2600747-2024-09-17",
      "headline": "Paedophilia, stalking, abuse: What kidfluencers pay to make money onlineSocial media is helping kidfluencers - kid influencers - make a lot of money, but the real cost of fame lies in the trolling and abuse on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manoj-verma-vineet-goyal-kolkata-police-commissioner-mamata-banerjee-doctors-protest-2601300-2024-09-17",
      "headline": "Manoj Verma appointed new Kolkata Police chief day after Vineet Goyal was removedManoj Kumar Verma has replaced Vineet Goyal as the new Kolkata Police Commissioner after West Bengal Chief Minister Mamata Banerjee announced the removal of Goyal, a key demand of the doctors protesting against the trainee doctor's rape and murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-secret-behind-namaste-pose-at-miss-world-2000-2601591-2024-09-17",
      "headline": "Priyanka Chopra shares secret behind 'namaste' pose at Miss World 2000Priyanka Chopra shared the story behind her 'namaste' pose from Miss World 2000, revealing it was an attempt to keep her dress up. Now, 24 years later, she attended husband Nick Jonas' concert at the same venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditi-rao-hydari-morning-habit-annoys-husband-siddharth-i-wake-up-in-tears-2601551-2024-09-17",
      "headline": "Aditi Rao Hydari's morning habit annoys husband Siddharth: I wake up in tearsAditi Rao Hydari and Siddharth shared fun details about their relationship in a latest interview. They discussed their morning routines, who apologises more, and Siddharth's romantic gestures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jasmin-bhasin-punjabi-actors-dont-follow-trends-trust-originality-exclusive-2601521-2024-09-17",
      "headline": "Jasmin Bhasin: Punjabi actors don't follow trends, trust originality | ExclusiveIn an exclusive interview with us, actor Jasmin Bhasin opened up on working in the Punjabi film industry. She appreciated the way actors work in Punjabi cinema, without relying on what is trending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-brar-on-slap-scene-with-kareena-kapoor-in-the-buckingham-murders-15-takes-2601512-2024-09-17",
      "headline": "Ranveer Brar on slap scene with Kareena in The Buckingham Murders: Took 15 takesIn an exclusive chat with India Today Digital, chef-turned-actor Ranveer Brar discussed the memorable 'slap' scene in the climax of The Buckingham Murders. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sumit-nagal-refused-to-play-for-country-in-davis-cup-aita-slams-india-star-2601592-2024-09-17",
      "headline": "Sumit Nagal refused to play for country in Davis Cup: AITA Davis Cup: AITA said that Sumit Nagal might have intentionally pulled out of the tournament. India lost to Sweden 4-0 in the World Group 1 tie earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/hope-it-does-not-rain-in-the-1st-test-between-india-and-bangladesh-raina-2601545-2024-09-17",
      "headline": "Hope it does not rain in the 1st Test between India and Bangladesh: RainaFormer India cricketer Suresh Raina has hoped that it does not rain in the first Test match between India and Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-nz-tim-southee-banking-on-rangana-hearths-inputs-for-galle-test-2601540-2024-09-17",
      "headline": "SL vs NZ: Tim Southee banking on Rangana Hearth's inputs for Galle TestNew Zealand Test captain Tim Southee said that they are backing on Rangana Hearth's inputs for their Test series against Sri Lanka. Herath, NZ's spin bowling coach is Sri Lanka's second-best spinner behind Muttiah Muralitharan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/craig-fulton-credits-china-good-fight-india-win-asian-champions-trophy-2601524-2024-09-17",
      "headline": "Craig Fulton credits China for 'good fight' after India win title Asian Champions Trophy: Coach Craig Fulton was happy after India won the title, but also admitted that China made it tough for them in the final on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wfi-president-urges-commonwealth-games-to-not-drop-wrestling-in-2026-2601511-2024-09-17",
      "headline": "WFI president urges Commonwealth Games to not drop wrestling in 2026The WFI president Sanjay Singh has urged the Commonwealth Games to not drop wrestling as a sport from the next edition of the competition. Scotland is set to host the next CWG after Australia backed out as hosts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/memorable-ind-vs-ban-moments-irfan-pathans-11-wicket-haul-in-dhaka-test-in-2004-2599244-2024-09-17",
      "headline": "Memorable IND vs BAN moments: Irfan Pathan's 11-wicket haul in Dhaka Test in 2004At just 20, Irfan Pathan made history in the 2004 Dhaka Test, becoming the youngest to take 10 wickets in a match. His brilliant swing bowling, highlighted by figures of 11/96, led India to a dominant innings win against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-celebrates-r-ashwins-birthday-smears-him-with-cake-in-chepauk-2601484-2024-09-17",
      "headline": "Indian team celebrates R Ashwin's birthday, smears him with cake in ChepaukThe Indian team celebrated Ravichandran Ashwin's 38th birthday in the team's dressing room at Chepauk. Rishabh Pant smeared Ashwin with chocolate cake all over his face. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-odi-series-live-streaming-schedule-squads-head-to-head-2601481-2024-09-17",
      "headline": "AFG vs SA ODI series Live Streaming: All you need to knowAFG vs SA: Afghanistan and South Africa will face each other in a three-match ODI series to be held from September 18 at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-harmanpreet-singh-named-player-of-the-tournament-2601469-2024-09-17",
      "headline": "Asian Champions Trophy: Harmanpreet Singh named Player of the TournamentAsian Champions Trophy: India captain Harmanpreet Singh was named the Player of the Tournament for his stellar goalscoring form. Harmanpreet scored 7 goals and provided the crucial assist in the final vs China.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-playing-against-india-in-india-best-challenge-says-bangladesh-coach-2601441-2024-09-17",
      "headline": "Playing against India in India best challenge, says Bangladesh coachIND vs BAN: Bangladesh coach Chandika Hathurusingha said that Bangladesh can test their skills and will get to know about where they stand as a team when they face India in the two-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-1st-test-live-streaming-when-and-where-to-watch-live-2601431-2024-09-17",
      "headline": "Sri Lanka vs New Zealand 1st Test live streaming: When and where to watch liveSri Lanka and New Zealand will face each other in the Test opener at Galle on September 18, Wednesday. Find out all the details of the live streaming of the match here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-celebrates-r-ashwins-birthday-smears-him-with-cake-in-chepauk-2601484-2024-09-17",
      "headline": "Indian team celebrates R Ashwin's birthday, smears him with cake in ChepaukThe Indian team celebrated Ravichandran Ashwin's 38th birthday in the team's dressing room at Chepauk. Rishabh Pant smeared Ashwin with chocolate cake all over his face. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-odi-series-live-streaming-schedule-squads-head-to-head-2601481-2024-09-17",
      "headline": "AFG vs SA ODI series Live Streaming: All you need to knowAFG vs SA: Afghanistan and South Africa will face each other in a three-match ODI series to be held from September 18 at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-harmanpreet-singh-named-player-of-the-tournament-2601469-2024-09-17",
      "headline": "Asian Champions Trophy: Harmanpreet Singh named Player of the TournamentAsian Champions Trophy: India captain Harmanpreet Singh was named the Player of the Tournament for his stellar goalscoring form. Harmanpreet scored 7 goals and provided the crucial assist in the final vs China.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-playing-against-india-in-india-best-challenge-says-bangladesh-coach-2601441-2024-09-17",
      "headline": "Playing against India in India best challenge, says Bangladesh coachIND vs BAN: Bangladesh coach Chandika Hathurusingha said that Bangladesh can test their skills and will get to know about where they stand as a team when they face India in the two-match Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-1st-test-live-streaming-when-and-where-to-watch-live-2601431-2024-09-17",
      "headline": "Sri Lanka vs New Zealand 1st Test live streaming: When and where to watch liveSri Lanka and New Zealand will face each other in the Test opener at Galle on September 18, Wednesday. Find out all the details of the live streaming of the match here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-pakistan-trolled-china-flag-india-final-2601422-2024-09-17",
      "headline": "Asian Champions Trophy: Pakistan trolled for supporting China in final vs IndiaThe Pakistan hockey team were trolled for supporting China in the final of the Asian Champions Trophy. The hosts China squared off against India in the final and lost 0-1.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-ekta-bisht-hat-trick-sri-lanka-record-2601419-2024-09-17",
      "headline": "Do You Know? Ekta Bisht took first ever hat-trick in Women's T20 World CupWomen's T20 World Cup: Ekta Bisht made history when India and Sri Lanka locked horns 12 years ago at the Nondescripts Cricket Club Ground in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-clicks-pic-with-indias-net-bowlers-gives-autograph-to-fan-in-chepauk-2601402-2024-09-17",
      "headline": "Virat Kohli clicks pic with India's net bowlers, gives autograph to fan in ChepaukVirat Kohli gave his autograph to a fan at India's team hotel in Chennai. He also clicked pictures with Team India's net bowlers in Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-believe-beat-india-test-series-shoriful-islam-2601389-2024-09-17",
      "headline": "Bangladesh believe that they can beat India: Shoriful IslamIND vs BAN: Shoriful Islam said that Bangladesh are confident of doing well in India after beating Pakistan 2-0 in the overseas Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-final-china-vs-india-report-jugraj-singh-craig-fulton-2601384-2024-09-17",
      "headline": "India win 5th Asian Champions Trophy hockey title after beating resolute ChinaJugarj Singh's 51st minute goal proved to be the difference as India defeated China 1-0 in the final to win their 5th Asian Champions Trophy on September 17, Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-hits-gym-with-shreyas-iyer-and-others-ahead-of-duleep-trophy-round-3-2601357-2024-09-17",
      "headline": "Tilak Varma hits gym with Shreyas Iyer and others ahead of Duleep Trophy Round 3Tilak Varma shared a special Instagram post with India A and India D players from Duleep Trophy 2024. The batter smashed a century during round 2 of the tournament in Anantapur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-rested-2nd-test-2601354-2024-09-17",
      "headline": "India to rest Jasprit Bumrah in 2nd Test? Rohit Sharma drops major hintIndia captain Rohit Sharma has said that the team will rotate its fast bowlers in this long Test season. Sharma said that India will follow the process followed in the England Test series earlier where they gave breaks to Jasprit Bumrah and Mohammed Siraj."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-rohit-sharma-presser-wtc-gambhir-coaching-bumrah-2601350-2024-09-17",
      "headline": "With World Test Championship at stake, Rohit Sharma wants to win every seriesSpeaking to reporters ahead of the Bangladesh encounter, India captain Rohit Sharma said that there were no easy games under the World Test Championship (WTC) cycle and no series was more important than the other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-2024-final-china-vs-india-report-jugraj-singh-craig-fulton-2601384-2024-09-17",
      "headline": "India win 5th Asian Champions Trophy hockey title after beating resolute ChinaJugarj Singh's 51st minute goal proved to be the difference as India defeated China 1-0 in the final to win their 5th Asian Champions Trophy on September 17, Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-hits-gym-with-shreyas-iyer-and-others-ahead-of-duleep-trophy-round-3-2601357-2024-09-17",
      "headline": "Tilak Varma hits gym with Shreyas Iyer and others ahead of Duleep Trophy Round 3Tilak Varma shared a special Instagram post with India A and India D players from Duleep Trophy 2024. The batter smashed a century during round 2 of the tournament in Anantapur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-jasprit-bumrah-rested-2nd-test-2601354-2024-09-17",
      "headline": "India to rest Jasprit Bumrah in 2nd Test? Rohit Sharma drops major hintIndia captain Rohit Sharma has said that the team will rotate its fast bowlers in this long Test season. Sharma said that India will follow the process followed in the England Test series earlier where they gave breaks to Jasprit Bumrah and Mohammed Siraj."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-rohit-sharma-presser-wtc-gambhir-coaching-bumrah-2601350-2024-09-17",
      "headline": "With World Test Championship at stake, Rohit Sharma wants to win every seriesSpeaking to reporters ahead of the Bangladesh encounter, India captain Rohit Sharma said that there were no easy games under the World Test Championship (WTC) cycle and no series was more important than the other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-have-changed-mindset-become-better-with-experience-wasim-jaffer-2601348-2024-09-17",
      "headline": "Bangladesh have changed their mindset, become better: Wasim JafferIND vs BAN: Former cricketer Wasim Jaffer said that Bangladesh have improved as a team and have moved on from their mindset of playing only on spin-friendly conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/saim-ayub-fails-to-emulate-suryakumar-yadav-champions-cup-2601336-2024-09-17",
      "headline": "Watch: Saim Ayub fails to emulate Suryakumar Yadav, pushes ball over the fencePakistan's Saim Ayub failed to emulate Suryakumar Yadav's heroics on the boundary during Match 3 of the Champions One Day Cup between Dolphins and Panthers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asian-champions-trophy-hockey-pakistan-beat-korea-clinch-bronze-2601329-2024-09-17",
      "headline": "Pakistan beat Korea 5-2 to clinch bronze medal  Pakistan defeated Korea 5-2 to end their campaign at the Hero Asian Champions Trophy with a bronze medal at the Moqi Hockey Training Base in the China Daur Ethnic Park on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-mehidy-hasan-shakib-al-hasan-chandika-hathurusingha-2601332-2024-09-17",
      "headline": "Improved Mehidy Hasan ready to take over Shakib's place: HathurusinghaBangladesh head coach Chandika Hathurusingha lauded Medhidy Hasan as the most improved player in the side. The coach said that the spin-bowling all-rounder is ready to take over Shakib Al Hasan's place when the legend retires.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}