{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-details-10-things-to-know-before-subscribing-review-price-gmp-2633922-2024-11-15",
      "headline": "NTPC Green Energy IPO: 10 things to know before subscribingNTPC Green Energy is a wholly-owned subsidiary of NTPC Ltd, focusing on renewable energy projects through both organic growth and acquisitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-i-dont-believe-in-work-life-balance-6-day-workweek-debate-2633876-2024-11-15",
      "headline": "I don't believe in work-life balance: Narayana MurthyNarayana Murthy said that hard work is key to national progress, citing Prime Minister Narendra Modi's reputedly long work hours as an example. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atv-projects-india-lic-multibagger-stock-rs-1-lakh-investment-now-worth-rs-8-lakh-2633835-2024-11-15",
      "headline": "Rs 1 lakh investment now worth Rs 8 lakh: Check this LIC-backed penny stockATV Projects India has shown remarkable growth over recent years, making it one of the standout multibagger stocks in the Indian market. Since the start of 2024, the stock has risen by over 110%, moving from Rs 15.25 to Rs 32.50 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-free-fall-good-time-to-invest-mutual-funds-2633831-2024-11-15",
      "headline": "Stock markets in free fall: Is it a good time to invest in mutual funds?With the Sensex and Nifty tumbling nearly 10% from their peaks, investors are wondering: Could this market correction be a blessing in disguise for mutual fund investors?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-crisis-dalal-street-sensex-nifty-outlook-brokerage-expert-views-2633803-2024-11-15",
      "headline": "Stock markets in correction phase: More turbulence ahead on Dalal Street?The Sensex and Nifty have tumbled nearly 10% from their recent peaks, leaving investors wondering: Is this just a healthy pause, or should they brace for more turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-hikes-home-loan-interest-rates-by-5-basis-points-check-details-november-15-2633789-2024-11-15",
      "headline": "SBI hikes home loan interest rates by 5 basis points. Check details  The change in interest rates is effective from November 15, and will make borrowing costs slightly higher for customers seeking loans from the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-share-price-target-rs-2000-brokerages-bullish-icici-motilal-oswal-2633769-2024-11-15",
      "headline": "Signature Global shares at over Rs 2,000? These 2 brokerages are bullishShares of Signature Global rose nearly 3.5% in the previous trading session after multiple brokerages raised their target price. Its total market capitalisation stands at 18,238.99 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-wants-rbi-to-cut-interest-rates-shaktikanta-das-responds-mpc-meeting-december-2633674-2024-11-15",
      "headline": "Piyush Goyal wants RBI to cut interest rates. Shaktikanta Das respondsUnion Minister Piyush Goyal described the link between food inflation and interest rates as an 'absolutely flawed theory.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-infosys-founder-stands-firm-on-6-day-workweek-pm-modi-2633642-2024-11-15",
      "headline": "I'll take this with me to grave: Narayana Murthy defends 6-day workweek viewNarayana Murthy, who has been vocal about his views on work ethics and productivity, expressed disappointment over India's move from a six-day workweek to a five-day one in 1986. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wolf-in-sheeps-clothing-kutniti-report-flags-elon-musk-starlink-us-military-intelligence-ties-india-entry-plans-2633628-2024-11-15",
      "headline": "'Wolf in sheep's clothing': Report flags Starlink's US military tiesStarlink operates through a constellation of satellites to provide internet access worldwide, a model distinct from traditional telecom services that rely on ground-based towers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-nse-bse-closed-today-holiday-guru-nanak-jayanti-no-trading-sensex-nifty-2633616-2024-11-15",
      "headline": "Stock markets closed today for Guru Nanak Jayanti holiday?Sensex and Nifty, have faced a six-session losing streak, marked by selling pressure from foreign institutional investors (FIIs) and worries over rising retail inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-icici-sbi-itc-titan-stocks-sector-safe-bet-market-fall-infrastructure-housing-finance-investing-tips-2633338-2024-11-14",
      "headline": "Markets in free fall: These sectors and stocks can be safe betsBoth the Sensex and Nifty indices have fallen around 10% from their 52-week peaks, marking a notable slump in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cypto-bull-run-memecoin-dogecoin-donald-trump-push-tokens-soaring-2633317-2024-11-14",
      "headline": "Donald Trump's crypto push: Not just Bitcoin, even these tokens are soaringThe bull run is not only crucial in terms of Bitcoin's valuation but also in its wider impact on the altcoin market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-phase-sensex-nifty-fall-sixth-stright-session-trump-factor-fii-selling-2633278-2024-11-14",
      "headline": "Trump factor, FII selling: Why Sensex, Nifty fell for 6th straight sessionThe benchmark Sensex dropped over 250 points, while the Nifty fell over 100 points during intraday trade, marking a significant 10% decline from their September peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-changes-budget-2025-simpler-filing-lower-brackers-all-key-details-2633226-2024-11-14",
      "headline": "Can you expect major income tax changes in Budget 2025? Check detailsThe Finance Ministry has established 22 specialised sub-committees to examine various aspects of the Income Tax Act, with an aim to simplify tax structures, expand tax base, and balance revenue generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-financial-services-share-price-jump-6-percent-today-nse-futures-and-options-inclusion-2633213-2024-11-14",
      "headline": "Explained: Why Jio Financial Services share price surged over 6% todayJio Financial Services share price: At midday, JFS shares were trading at Rs 318.70, marking a 6.45% increase. The development came as a relief for the stock, which has seen declines in recent months but has gained attention for its potential in the derivatives market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cancel-champions-trophy-tour-in-pakistan-occupied-kashmir-2633921-2024-11-15",
      "headline": "ICC cancels Champions Trophy tour in POK day after Pak board's announcementThe ICC has canceled the Champions Trophy trophy tour in Skardu, Murree, and Muzaffarabad, areas located in Pakistan-occupied Kashmir (PoK). This decision follows a swift response to an announcement made by the Pakistan Cricket Board (PCB) the previous day. The Board of Control for Cricket in India (BCCI) raised concerns about the tour, prompting the ICC to take immediate action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-election-row-over-delay-in-rahul-gandhi-chopper-take-off-in-poll-bound-jharkhand-2633907-2024-11-15",
      "headline": "Row over delay in Rahul Gandhi's chopper take-off, Congress blames BJPRahul Gandhi's helicopter was delayed for nearly two hours in Godda, Jharkhand, due to a lack of ATC clearance, which Congress claimed was politically motivated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-aircraft-technical-snag-jharkhand-deoghar-airport-2633910-2024-11-15",
      "headline": "PM Modi's aircraft suffers technical snag at Jharkhand's Deoghar airportThe incident took place after Prime Minister Narendra Modi concluded his events in the poll-bound Jharkhad and arrived at the Deoghar airport to return to Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-jharkhand-assembly-elections-slogan-war-yogi-adityanath-batoge-to-katoge-pm-narendra-modi-ek-hai-to-safe-hai-mallikarjun-kharge-daroge-toh-maroge-2632843-2024-11-15",
      "headline": "How war of slogans in Maharashtra, Jharkhand has gone beyond bijli, paniFrom 'bijli, pani, sadak' to 'India Shining' and 'Ab ki Bar Modi Sarkar', slogans defined elections and described the politics of the day. What does the war of slogans ahead of the Maharashtra and Jharkhand Assembly reveal?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/middle-east-crisis-siege-mecca-grand-mosque-1979-blood-violence-split-muslim-world-saudi-arabia-radical-sunni-islam-2633693-2024-11-15",
      "headline": "How bloody siege of Mecca Grand Mosque 45 years ago split Muslim worldExactly 45 years ago, Mecca Grand Mosque, Islam's holiest place, was taken over by 200 armed men led by preacher Juhayman al-Utaybi. Blood would flow before the weeks-long siege ended. The events of 1979 turned Saudi Arabia into a radical Sunni country, and split the Muslim world, the impact of which is felt to this day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dehradun-accident-college-students-partied-alcohol-raced-bmw-decapitated-speeding-drunk-driving-2633708-2024-11-15",
      "headline": "Dehradun accident: Students partied, raced BMW, decapitated in high-speed crashA newly surfaced video has raised questions about the circumstances leading to a deadly car crash in Dehradun earlier this week that claimed the lives of six college students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-election-devendra-fadnavis-batenge-to-katenge-ajit-pawar-ashok-chavan-pankaja-munde-opposition-2633909-2024-11-15",
      "headline": "Exclusive: Fadnavis reacts as Ajit Pawar, Ashok Chavan reject 'batenge to katenge'Asked about the opposition to these slogans from some quarters of the BJP and alliance partners like Ajit Pawar's NCP, Devendra Fadnavis said they come from a different ideology and such statements reflect their \"pseudo-secular\" background. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-helicopter-searched-by-election-commission-officials-in-maharashtra-hingoli-2633914-2024-11-15",
      "headline": "Amit Shah's helicopter searched by poll officials in MaharashtraPosting a video of the Election Commission officials inspecting the bags inside his helicopter, Union Home Minister Amit Shah said the BJP believes in fair elections and follows all rules made by the poll body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanju-samson-father-allegations-story-virat-kohli-ms-dhoni-rahul-dravid-2633750-2024-11-15",
      "headline": "Sanju Samson's lost years: Did Dhoni, Kohli, Rohit and Dravid play a part?Sanju Samson's father, Vishwanath, made a bombshell allegation when he blamed MS Dhoni, Virat Kohli, Rohit Sharma, and Rahul Dravid for his son's inconsistent opportunities at the highest level. While Samson seems to be cementing his place in the T20I side in 2024, he had been in and out of the team for years. Who was responsible for the lost years of Samson's career?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-khalistani-supporters-go-back-to-europe-protest-viral-video-2633682-2024-11-15",
      "headline": "'Canadians go back to Europe', Khalistani supporter shouts in procession video A new video shows a Khalistani supporter in Canada calling Canadians to 'go back to Europe', and claiming 'we are the owners of Canada'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-2024-ajit-pawar-distances-himself-from-batenge-to-katenge-slogan-devendra-fadnavis-yogi-adityanath-2633822-2024-11-15",
      "headline": "Ajit Pawar distances himself from 'batenge to katenge' slogan: Don't support itMaharashtra Deputy Chief Minister Ajit Pawar distanced himself from the controversial 'batenge to katenge' slogan, stating he could not support such divisive rhetoric. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/vikrant-massey-the-sabarmati-report-released-all-about-2002-gujarat-godhra-train-accident-2633929-2024-11-15",
      "headline": "Vikrant Massey's The Sabarmati Report released: All about 2002 Godhra tragedyAs The Sabarmati Report released in theatres today, revisiting the real story of the 2002 Godhra train fire in Gujarat. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-i-dont-believe-in-work-life-balance-6-day-workweek-debate-2633876-2024-11-15",
      "headline": "I don't believe in work-life balance: Narayana MurthyNarayana Murthy said that hard work is key to national progress, citing Prime Minister Narendra Modi's reputedly long work hours as an example. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-peel-police-officer-clean-chit-hindu-sabba-temple-attack-brampton-khalistani-2633757-2024-11-15",
      "headline": "Canadian cop, part of Khalistani mob that attacked temple, gets clean chitCanadian police officer Harinder Sohi, who was part of the pro-Khalistani rally, has been given a clean chit by Peel Police. People from the mob attacked devotees at the Hindu Sabha Temple in Brampton. In several videos, Sohi is seen in plain clothes and with a Khalistani flag, but Peel Police said he was trying to disarm protesters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shraddha-walkar-murder-aftab-poonawala-lawrence-bishnoi-gang-hit-list-mumbai-police-2633837-2024-11-15",
      "headline": "Shraddha Walker murder accused on Lawrence Bishnoi gang's hit list: SourcesAftab Poonawala, accused of killing Shraddha Walkar, is reportedly targeted by the Lawrence Bishnoi gang, as per Mumbai Police sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hana-rawhiti-maipi-clarke-maori-haka-protest-dance-new-zealand-parliament-lawmakers-video-viral-2633635-2024-11-15",
      "headline": "Video: New Zealand MP breaks into traditional dance, rips up bill in parliamentMaori MP Hana-Rawhiti Maipi-Clarke stood and began a ringing haka – a rhythmic Maori chant of challenge – which swelled to a roar as first opposition lawmakers, and then spectators in the public gallery, joined in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/railways-gets-pet-friendlier-book-your-dogs-ac-first-class-travel-online-now-2632704-2024-11-14",
      "headline": "Railways gets pet friendlier: Book your dog's AC First class travel online nowThe 700-plus bookings since May show pet-owners are lapping it up. On the minister's table now: a demand to have 'dog boxes' in all trains\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-marital-rape-minor-wife-age-of-consent-maharashtra-2633620-2024-11-15",
      "headline": "Consensual sex with minor wife is rape: High Court upholds 10-year jail for manThe Bombay High Court upheld a 10-year sentence for a man accused of raping his minor wife, ruling that consensual sex with a minor, even in marriage, constitutes rape under the law. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/freedom-at-midnight-review-powerful-portrayal-of-india-partition-stellar-acting-rating-2633621-2024-11-15",
      "headline": "Freedom at Midnight review: Powerful portrayal of partitionReleased-Fri Nov 15, 2024Freedom at Midnight review: The Nikkhil Advani show has a light, easygoing way of telling the story, weaving together different threads that build up quietly. The dialogues and performances strike emotional chords effectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/donald-trump-joe-biden-best-buddies-enjoy-ice-cream-sing-dance-viral-ai-video-2633871-2024-11-15",
      "headline": "'Best buddies' Trump and Biden enjoy ice cream, sing and dance in viral AI videoDonald Trump and Joe Biden's AI video has gone viral on social media with close to 12 million views so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-mike-tyson-jake-paul-slap-evan-holyfield-ear-bite-controversial-moments-2633703-2024-11-15",
      "headline": "Jake Paul is lucky. A slap is nothing, Mike Tyson has done far worseFrom biting off Evan Holyfield's ear to punching a fellow passenger inside a flight, it's safe to say Jake Paul escaped with just a slap from Mike Tyson ahead of their big fight on November 15, Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-savage-reply-to-people-objecting-to-her-wearing-shorts-2633779-2024-11-15",
      "headline": "Neena Gupta's savage reply to people objecting to her wearing shortsIn a candid conversation on Kareena Kapoor Khan's chat show, Neena Gupta addressed criticism about her fashion choices with a witty retort. The seasoned actor also discussed the changing dynamics of the entertainment industry and entourage culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/winters-deadly-blanket-how-thermal-inversion-traps-india-pakistan-in-toxic-air-2633696-2024-11-15",
      "headline": "Breathless winters: How thermal inversion suffocates India, PakistanThis annual environmental disaster is not only a public health emergency but also a constant reminder of the region's ongoing struggle with air pollution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/freedom-at-midnight-director-nikkhil-advani-high-time-we-redo-our-history-books-exclusive-2633937-2024-11-15",
      "headline": "Freedom at Midnight director Nikkhil Advani: High time we redo our history booksIn an exclusive interview, director Nikkhil Advani discussed his latest series Freedom at Midnight, exploring India's independence, Partition, and the need for a more honest portrayal of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-sabarmati-report-review-vikrant-massey-ridhi-dogra-raashi-khanna-2633911-2024-11-15",
      "headline": "The Sabarmati Report review: Even Vikrant Massey can't save this confused filmReleased-Fri Nov 15, 2024The Sabarmati Report, featuring Vikrant Massey, Ridhi Dogra and Raashii Khanna, delves into the Godhra incident while exploring the divide between English and vernacular journalists, ultimately highlighting the power of local journalism. Read the review before you decide whether to watch the film or not."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohit-shetty-meme-with-ajay-devgn-varun-dhawan-ranveer-singh-react-2633915-2024-11-15",
      "headline": "Rohit Shetty's viral meme with Ajay Devgn has Varun, Ranveer's funniest reaction A hilarious meme featuring Rohit Shetty and Ajay Devgn is currently trending on social media. The filmmaker shared the amusing video on Instagram, celebrating his long-standing friendship with the Singham Again actor.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/former-world-no1-pair-rohan-bopanna-and-matthew-ebden-to-split-after-atp-finals-2633944-2024-11-15",
      "headline": "Former World No.1 pair Rohan Bopanna, Matthew Ebden to split after ATP FinalsFormer World No.1 pair Rohan Bopanna and Matthew Ebden are all set to end their association after the ATP Tour finals in Turin. The duo will play their final group game on November 15, Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cancel-champions-trophy-tour-in-pakistan-occupied-kashmir-2633921-2024-11-15",
      "headline": "ICC cancels Champions Trophy tour in POK day after Pak board's announcementThe ICC has canceled the Champions Trophy trophy tour in Skardu, Murree, and Muzaffarabad, areas located in Pakistan-occupied Kashmir (PoK). This decision follows a swift response to an announcement made by the Pakistan Cricket Board (PCB) the previous day. The Board of Control for Cricket in India (BCCI) raised concerns about the tour, prompting the ICC to take immediate action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-vvs-laxman-south-africa-vs-india-suryakumar-yadav-tilak-varma-sanju-samson-varun-chakravarthy-2633916-2024-11-15",
      "headline": "SA vs IND: VVS Laxman hails India's fearless approach in ongoing T20I seriesIndia's head coach for the South Africa tour, VVS Laxman, hailed his team India for their fearless approach in the ongoing T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-mike-tyson-vs-jake-paul-fight-full-rules-explained-dallas-texas-2633913-2024-11-15",
      "headline": "How is Mike Tyson vs. Jake Paul different from usual boxing bout? Rules explainedMike Tyson vs Jake Paul is all set to happen on November 15, Friday, as the fighters both made weight for the bout. The match has set of rules which aren't the ones that you would usually see in a usual boxing bout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-childhood-coach-mohammed-badruddin-border-gavaskar-trophy-2633881-2024-11-15",
      "headline": "Mohammed Shami will travel to Australia after 2nd Test, reveals childhood coachStar India fast bowler Mohammed Shami's childhood coach Mohammed Badruddin has said that the fast bowler is likely to join the squad in Australia after the second Test in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-kl-rahul-mantra-team-first-perth-test-2633826-2024-11-15",
      "headline": "KL Rahul reveals his mantra: Team first, my playing style doesn't matterKL Rahul, amid criticism, emphasises his team-first approach and reveals his ambition to return to the T20I squad. The Indian batter is set to play against Australia in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-bengal-vs-madhya-pradesh-anustup-majumdar-laxmi-ratan-shukla-2633797-2024-11-15",
      "headline": "Hungry Mohammed Shami was desperate to return to field: Bengal captain AnustupBengal captain Anustup Majumdar hailed India fast bowler Mohammed Shami for his remarkable comeback to professional cricket through the Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-test-series-tim-southee-retirement-comments-hamilton-2633801-2024-11-15",
      "headline": "Retirement a tough decision but it's the right one: New Zealand's Tim SoutheeTim Southee has said that the decision to retire from international cricket was the right one ahead of the New Zealand vs England Test series. Southee made his debut back in 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-rishabh-pant-hilarious-bet-morne-morkel-australia-vs-india-2633761-2024-11-15",
      "headline": "Watch: Rishabh Pant, Jasprit Bumrah's hilarious USD 100 bet over pacer's dismissalStar India cricketers Rishabh Pant and Jasprit Bumrah got involved in a hilarious USD 100 bet during a practice session in Perth ahead of  the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-predictions-chennai-super-kings-top-buys-rishabh-pant-remaining-purse-2633763-2024-11-15",
      "headline": "IPL auction prediction: Will CSK target Rishabh Pant with Rs 55 crore-purse?Chennai Super Kings enter a new phase with the upcoming IPL 2025 auction in Jeddah. All eyes will certainly be on the 5-time champions who could be in the market to get the highly sought after Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanju-samson-father-allegations-story-virat-kohli-ms-dhoni-rahul-dravid-2633750-2024-11-15",
      "headline": "Sanju Samson's lost years: Did Dhoni, Kohli, Rohit and Dravid play a part?Sanju Samson's father, Vishwanath, made a bombshell allegation when he blamed MS Dhoni, Virat Kohli, Rohit Sharma, and Rahul Dravid for his son's inconsistent opportunities at the highest level. While Samson seems to be cementing his place in the T20I side in 2024, he had been in and out of the team for years. Who was responsible for the lost years of Samson's career?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-bengal-vs-madhya-pradesh-anustup-majumdar-laxmi-ratan-shukla-2633797-2024-11-15",
      "headline": "Hungry Mohammed Shami was desperate to return to field: Bengal captain AnustupBengal captain Anustup Majumdar hailed India fast bowler Mohammed Shami for his remarkable comeback to professional cricket through the Ranji Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-test-series-tim-southee-retirement-comments-hamilton-2633801-2024-11-15",
      "headline": "Retirement a tough decision but it's the right one: New Zealand's Tim SoutheeTim Southee has said that the decision to retire from international cricket was the right one ahead of the New Zealand vs England Test series. Southee made his debut back in 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-rishabh-pant-hilarious-bet-morne-morkel-australia-vs-india-2633761-2024-11-15",
      "headline": "Watch: Rishabh Pant, Jasprit Bumrah's hilarious USD 100 bet over pacer's dismissalStar India cricketers Rishabh Pant and Jasprit Bumrah got involved in a hilarious USD 100 bet during a practice session in Perth ahead of  the Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-predictions-chennai-super-kings-top-buys-rishabh-pant-remaining-purse-2633763-2024-11-15",
      "headline": "IPL auction prediction: Will CSK target Rishabh Pant with Rs 55 crore-purse?Chennai Super Kings enter a new phase with the upcoming IPL 2025 auction in Jeddah. All eyes will certainly be on the 5-time champions who could be in the market to get the highly sought after Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sanju-samson-father-allegations-story-virat-kohli-ms-dhoni-rahul-dravid-2633750-2024-11-15",
      "headline": "Sanju Samson's lost years: Did Dhoni, Kohli, Rohit and Dravid play a part?Sanju Samson's father, Vishwanath, made a bombshell allegation when he blamed MS Dhoni, Virat Kohli, Rohit Sharma, and Rahul Dravid for his son's inconsistent opportunities at the highest level. While Samson seems to be cementing his place in the T20I side in 2024, he had been in and out of the team for years. Who was responsible for the lost years of Samson's career?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-haryanas-anhsul-kamboj-becomes-3rd-player-to-take-all-10-wickets-in-ranji-trophy-history-2633739-2024-11-15",
      "headline": "Anshul Kamboj becomes 3rd Ranji Trophy bowler to take all 10 wickets of inningsHaryana seamer Anshul Kamboj became the third player in the history of Ranji Trophy to take all ten wickets to fall in an innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-50th-hundred-shami-7-wickets-india-reach-2023-world-cup-final-2633705-2024-11-15",
      "headline": "Virat Kohli's 50th ODI hundred helps India reach 2023 World Cup finalWorld Cup 2023: Virat Kohli's 50th ODI century and Mohammed Shami's 7/57 helped India beat New Zealand by 70 runs in the semi-final to reach the title clash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-mike-tyson-jake-paul-slap-evan-holyfield-ear-bite-controversial-moments-2633703-2024-11-15",
      "headline": "Jake Paul is lucky. A slap is nothing, Mike Tyson has done far worseFrom biting off Evan Holyfield's ear to punching a fellow passenger inside a flight, it's safe to say Jake Paul escaped with just a slap from Mike Tyson ahead of their big fight on November 15, Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-virat-kohli-adelaide-test-hundreds-mitchell-johnson-bouncer-2633701-2024-11-15",
      "headline": "BGT Recap: When Virat Kohli's inspired run was triggered by a Johnson bouncerVirat Kohli was treated with a vicious bouncer from Mitchell Johnson to start his Border-Gavaskar Trophy 2014-15. Kohli was woken up by the delivery and went on to score twin hundreds in Adelaide and almost got India the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-women-to-play-t20-match-against-cricket-without-borders-xi-in-january-2633690-2024-11-15",
      "headline": "Afghanistan Women's XI to play in Melbourne ahead of Ashes TestAustralian Cricket has come together to help fulfil the ambition of the members of the Afghanistan Women's cricket team now resident in Australia to play together. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-debut-1989-vs-pakistan-in-karachi-2633675-2024-11-15",
      "headline": "OTD 1989: 15-year-old Sachin Tendulkar makes his international debut vs PakistanOn 15th November 1989, legendary India cricketer Sachin Tendulkar made his debut in international cricket against Pakistan in Karachi and showed glimpses of his greatness to the entire world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-world-cup-qualifiers-argentina-suffer-shock-defeat-vs-paraguay-brazil-draw-2633655-2024-11-15",
      "headline": "Argentina suffer shock defeat vs Paraguay, Brazil draw Argentina and Brazil faced tough nights in World Cup qualifiers, with Argentina losing 2-1 to Paraguay and Brazil drawing 1-1 with Venezuela. Messi and Vinicius Júnior had challenging performances, affecting their teams' standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2633652-2024-11-15",
      "headline": "BGT: Virat Kohli passed fit after injury scare ahead of Perth practice matchStar India batter Virat Kohli underwent scans in Perth ahead of the team's match-simulation practice in Perth. However, the former skipper was declared fit and took part in the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-women-to-play-t20-match-against-cricket-without-borders-xi-in-january-2633690-2024-11-15",
      "headline": "Afghanistan Women's XI to play in Melbourne ahead of Ashes TestAustralian Cricket has come together to help fulfil the ambition of the members of the Afghanistan Women's cricket team now resident in Australia to play together. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-debut-1989-vs-pakistan-in-karachi-2633675-2024-11-15",
      "headline": "OTD 1989: 15-year-old Sachin Tendulkar makes his international debut vs PakistanOn 15th November 1989, legendary India cricketer Sachin Tendulkar made his debut in international cricket against Pakistan in Karachi and showed glimpses of his greatness to the entire world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-world-cup-qualifiers-argentina-suffer-shock-defeat-vs-paraguay-brazil-draw-2633655-2024-11-15",
      "headline": "Argentina suffer shock defeat vs Paraguay, Brazil draw Argentina and Brazil faced tough nights in World Cup qualifiers, with Argentina losing 2-1 to Paraguay and Brazil drawing 1-1 with Venezuela. Messi and Vinicius Júnior had challenging performances, affecting their teams' standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2633652-2024-11-15",
      "headline": "BGT: Virat Kohli passed fit after injury scare ahead of Perth practice matchStar India batter Virat Kohli underwent scans in Perth ahead of the team's match-simulation practice in Perth. However, the former skipper was declared fit and took part in the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-atp-finals-sinner-beats-medvedev-taylor-fritz-semifinal-2633649-2024-11-15",
      "headline": "Jannik Sinner beats Daniil Medvedev, Taylor Fritz also reaches semifinal Jannik Sinner showcases dominance at the ATP Finals, defeating Daniil Medvedev to top his group and secure a semi-final berth in Turin. Meanwhile, Taylor Fritz advances to the semis with a comeback win over Alex de Minaur, eliminating Medvedev from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-rohit-sharma-wants-to-play-perth-test-vs-australia-mohammed-kaif-2633636-2024-11-15",
      "headline": "Rohit wants to play Perth Test, he is not a captain who runs away: KaifAs Rohit Sharma awaits personal developments at home, former India cricketer Mohammad Kaif believes India's skipper will be ready to join his side in time for the first Test against Australia as soon as the situation deems fit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-injury-scare-simulation-australia-vs-india-perth-test-bgt-2633629-2024-11-15",
      "headline": "Rahul overcomes injury scare while opening for India in Perth match simulationBorder-Gavaskar Trophy: India batter KL Rahul overcame an injury scare during a match simulation session on Friday morning ahead of the first Test against Australia at the WACA in Perth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kane-williamson-returns-new-zealand-test-squad-series-vs-england-2633627-2024-11-15",
      "headline": "Williamson returns as New Zealand name Test squad for home series vs England Star batter Kane Williamson is set to make his comeback for New Zealand in the upcoming home Test series against England. The England series is likely to be the international swansong for veteran bowler Tim Southee."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}