{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-layoffs-hundreds-of-roles-to-streamline-operations-report-2757225-2025-07-17",
      "headline": "Walmart cuts hundreds of roles to streamline operations: ReportEarlier this year, Walmart announced about 1,500 job cuts, which hit teams in its global tech division, online order fulfilment in US stores and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-375-points-lower-nifty-below-25200-infosys-tech-mahindra-down-2-percent-2757205-2025-07-17",
      "headline": "Sensex ends 375 points lower, Nifty below 25,200; Infosys down 2%The S&P BSE Sensex was down by 375.24 points to close at 82,259.24, while the NSE Nifty50 lost 100.60 points to end at 25,111.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-rank-number-4-asia-pacific-region-bofa-survey-dalal-street-insights-2757200-2025-07-17",
      "headline": "Dalal Street not Asia's darling anymore, says BofA surveyThe latest survey by Bank of America (BofA), shows that investor interest in Indian stock market has dropped in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-safe-are-indias-instant-loan-apps-2757170-2025-07-17",
      "headline": "How safe are India's instant loan appsFrom students low on fees to families with sudden hospital bills, many use instant loan apps for fast cash, some promise money in 10–30 minutes using just a phone and a few documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-looks-to-extend-tenure-of-derivatives-contracts-says-official-2757179-2025-07-17",
      "headline": "Sebi looks to extend tenure of derivatives contracts, says officialSebi is signalling a shift toward deeper, more stable markets by discouraging speculative short-term trades and pushing for longer-tenure contracts, amid growing retail losses and extreme derivatives dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-thane-outshining-mumbai-real-estate-with-cheaper-housing-2757131-2025-07-17",
      "headline": "Is Thane outshining Mumbai real estate with cheaper housing?Most new homes coming up in Thane are either 1BHK or 2BHK units. About 45% of new supply from 2020 to 2025 was 2BHKs, while 42% was 1BHKs. Larger homes like 3BHKs and 4BHKs together make up only around 13% of the new supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-rates-2025-how-much-are-sbi-icici-and-others-charging-2757089-2025-07-17",
      "headline": "Personal loan rates 2025: How much are SBI, ICICI and others charging?Many banks in India have updated their personal loan interest rates for 2025. Most banks are offering rates starting from about 9.50% per year and going up to 10.50% for some customers, depending on their credit score and repayment ability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-benching-policy-fear-among-employees-after-first-cycle-outrage-reddit-it-sector-news-report-2757088-2025-07-17",
      "headline": "TCS benching policy sparks fear among employees after first cycle: ReportThe policy, introduced on June 12, limits the time employees can remain without project work to just 35 days. After this, they face the risk of losing out on promotions or even losing their jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-upi-rules-from-july-15-npci-what-happens-if-payments-fail-now-2757044-2025-07-17",
      "headline": "New UPI rules: What happens if payments fail now?Earlier, if someone raised a chargeback, say, when money was deducted, but they did not get what they paid for, and it got declined, the bank had to go through an extra step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/parliament-panel-proposes-revival-of-key-tax-relief-for-companies-report-2757016-2025-07-17",
      "headline": "Parliament panel proposes revival of key tax relief for companies: ReportThe government is set to restore Section 80M in the new Income Tax Bill, easing dividend tax burdens for companies. The bill is likely to pass in the Monsoon Session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ecommerce-negative-review-not-published-consumer-rights-online-shopping-2757011-2025-07-17",
      "headline": "Are e-commerce firms hiding your rating? New survey reveals the truthThe survey asked consumers about their experience when posting negative reviews on e-commerce and quick commerce apps. Out of 16,519 responses, only 11% said their negative reviews were \"published as is.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25200-sbi-shares-up-1-percent-2756990-2025-07-17",
      "headline": "Sensex opens flat, Nifty above 25,200; SBI shares up 1%The S&P BSE Sensex was down 41.02 points to 82,593.46, while the NSE Nifty50 lost 13.30 points to 25,198.75 as of 9:30 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/janaki-v-vs-state-of-kerala-review-well-crafted-story-but-an-execution-fail-suresh-gopi-2757222-2025-07-17",
      "headline": "Janaki V vs State of Kerala review: Noble intentions marred by flawed executionRelease Date:Thu Jul 17, 2025Janaki V vs State of Kerala movie review: Written and directed by Pravin Narayanan, the Malayalam suspense drama film stars Suresh Gopi and Anupama Parameshwaran in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-shuts-down-wedding-rumours-with-tejasswi-prakash-2757161-2025-07-17",
      "headline": "Karan Kundrra shuts down wedding rumours with Tejasswi Prakash, says not married yetActor Karan Kundrra clarified that he and Tejasswi Prakash are not married yet, dismissing ongoing rumours. He expressed his love for rituals and shared how Tejasswi has influenced his spiritual side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-poetic-tribute-mohit-suri-heartfelt-post-musical-vision-2757135-2025-07-17",
      "headline": "Saiyaara actor Aneet Padda pays poetic tribute to Mohit Suri's musical vision'Saiyaara' actor Aneet Padda shared a heartfelt note dedicated to director Mohit Suri. She highlighted his unique vision and emotional depth in music and storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-rana-daggubati-cheeky-banter-on-why-kattappa-killed-baahubali-wins-the-internet-2757213-2025-07-17",
      "headline": "Prabhas, Rana's cheeky banter on 'Why Kattappa killed Baahubali' wins the internet'Baahubali' is all set for a grand re-release this October, rekindling the iconic question about Katappa's betrayal with hilarious replies from stars Prabhas and Rana Daggubati. The friendly banter received fans' appreciation on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/special-ops-2-premieres-july-18-cyber-warfare-kay-kay-menon-2757166-2025-07-17",
      "headline": "Special Ops 2 OTT release: Kay Kay Menon returns to battle cyber terrorismThe much-anticipated 'Special Ops 2', featuring Kay Kay Menon, highlights cyber warfare dangers. Premiering on July 18, it introduces Tahir Raj Bhasin as a new antagonist, focusing on digital terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-and-tara-sutaria-release-thodi-si-daaru-shreya-ghoshals-vocals-steal-the-show-2757047-2025-07-17",
      "headline": "AP Dhillon and Tara Sutaria's chemistry is star of Thodi Si Daaru songThe much-awaited Punjabi song 'Thodi Si Daaru' featuring singer AP Dhillon and actor Tara Sutaria has been released. The song also marks Dhillon's first collaboration with Shreya Ghoshal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pride-prejudice-by-joe-wright-to-re-release-in-indian-theatres-all-you-need-to-know-2757140-2025-07-17",
      "headline": "Joe Wright's Pride & Prejudice to re-release in theatres - all you need to knowJoe Wright's 'Pride & Prejudice' (2005), starring Keira Knightley and Matthew MacFadyen, returns to Indian theatres on July 25. Re-released by PVR INOX and UIP, the beloved adaptation offers fans a chance to relive Jane Austen's timeless romance on the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-map-that-leads-to-you-trailer-madelyn-cline-kj-apa-chase-magic-in-europe-2757139-2025-07-17",
      "headline": "The Map That Leads To You trailer: Madelyn Cline, KJ Apa chase magic in EuropePrime Video is all set to release the romantic drama 'The Map That Leads To You' on August 20, featuring a heartfelt love story against the enchanting backdrop of Europe. Directed by Lasse Hallstrom, the film beautifully captures a journey of self-discovery and unexpected connections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-stunt-safety-akshay-kumar-insurance-protects-professionals-2757036-2025-07-17",
      "headline": "The ABC of stunts in Bollywood, Akshay Kumar's insurance and how it still is riskyBollywood has significantly improved stunt safety standards, highlighted by Akshay Kumar's initiative to provide health and accident insurance for hundreds of stunt professionals. Despite the inherent risks in stunt work, these measures offer vital protection and financial support to artistes in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disney-pixar-hoppers-trailer-jungle-adventure-avatar-inspired-sci-fi-comedy-2757027-2025-07-17",
      "headline": "Hoppers trailer: A young scientist turns beaver in Avatar-inspired jungle adventureThe trailer of 'Hoppers' teases an 'Avatar'-esque jungle sci-fi, adventure-comedy. In the upcoming animation film, a young scientist hops into the body of a lifelike robotic beaver. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-saare-jahan-se-accha-pratik-gandhi-espionage-drama-1970s-india-premiere-august-13-2757046-2025-07-17",
      "headline": "Saare Jahan Se Accha: Pratik Gandhi leads India's secret mission in espionage-dramaPratik Gandhi's upcoming series 'Saare Jahan Se Accha' is an espionage drama set in the 1970s. The show highlights the challenges faced by intelligence officers while protecting the nation from hidden threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-advance-booking-day-1-update-and-box-office-prediction-ahaan-pandey-could-just-be-new-overnight-sensation-2757116-2025-07-17",
      "headline": "Saiyaara advance booking: Ahaan Pandey could just be the new overnight sensationYRF's 'Saiyaara' is on its way to emerging as the biggest launchpad for any Bollywood debutant in a long time. Ahaan Pandey and Aneet Padda could just find their big claim to fame if the numbers are to be believed at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ronit-roy-breaks-silence-on-rumours-of-replacing-sudhanshu-pandey-in-anupamaa-2757083-2025-07-17",
      "headline": "Ronit Roy breaks silence on rumours of replacing Sudhanshu Pandey in AnupamaaActor Ronit Roy refuted claims of joining 'Anupamaa' as Vanraj Shah. Roy said the rumours are not true. The role was earlier played by actor Sudhanshu Pandey, who quit the show in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ishaan-khatter-janhvi-kapoor-homebound-set-for-toronto-film-festival-screening-2757110-2025-07-17",
      "headline": "Ishaan Khatter, Janhvi Kapoor's Homebound to screen at Toronto Film FestivalNeeraj Ghaywan's film 'Homebound', featuring Ishaan Khatter, Janhvi Kapoor, and Vishal Jethwa, has been selected for the prestigious Gala Presentations' category at the Toronto International Film Festival 2025. The film has already won hearts with a standing ovation at Cannes and boasts Martin Scorsese as an executive producer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aasif-khan-shares-photo-from-hospital-bed-reads-rahat-indoris-main-zinda-hoon-2757101-2025-07-17",
      "headline": "Aasif Khan shares photo from hospital bed, reads Rahat Indori's Main Zinda Hoon'Panchayat' actor Aasif Khan, who recently suffered a heart attack, is now recovering in hospital. He shared a photo reading Rahat Indori's book 'Main Zinda Hoon'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-roots-for-devi-sonakshi-sinha-ahead-of-nikita-roy-urges-fans-to-watch-2757081-2025-07-17",
      "headline": "Salman Khan roots for devi Sonakshi Sinha ahead of Nikita Roy, urges fans to watchSonakshi Sinha is making a grand return to the big screen with her supernatural thriller 'Nikita Roy', releasing on July 18. Salman Khan has expressed his excitement for the film, which promises a gripping story of an investigator challenging supernatural myths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-barkha-bisht-joins-smriti-irani-amar-upadhyay-2757051-2025-07-17",
      "headline": "Barkha Bisht confirms joining Smriti Irani in Kyunki reboot, here's what she playsThe popular TV show 'Kyunki Saas Bhi Kabhi Bahu Thi' is set to return, with Smriti Irani and Amar Upadhyay reprising their roles. Actor Barkha Bisht has also confirmed her inclusion in the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-on-losing-child-with-kirron-kher-pregnancy-complications-life-with-sikandar-2757063-2025-07-17",
      "headline": "Anupam Kher opens up on losing child with Kirron Kher, and life with SikandarAnupam Kher opens up about not having biological children with wife Kirron Kher, his bond with stepson Sikander, and how his career shaped personal choices. The veteran actor also opened up on Kirron's pregnancy, which didn't work due to complications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-wife-sneha-son-ayaan-daughter-arhan-universal-studios-us-pics-2757071-2025-07-17",
      "headline": "Allu Arjun and family enjoy visit to Universal Studios in US, actor shares picsAllu Arjun, along with his wife, Sneha, and children, Ayaan and Arha, visited Universal Studios in the US. The actor and his wife shared pictures from their visit."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sensitive-matter-in-touch-with-friendly-governments-centre-on-nimisha-priya-case-2757252-2025-07-17",
      "headline": "Sensitive matter, in touch with friendly governments: India on Nimisha Priya caseIn a weekly press briefing, Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal said the government provided legal assistance to Nimisha Priya's family and arranged regular consular visits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-cabinet-approves-filing-of-criminal-cases-against-rcb-state-cricket-body-in-bengaluru-stampede-case-2757264-2025-07-17",
      "headline": "Karnataka Cabinet approves filing of criminal cases against RCB, state cricket body in Bengaluru stampede caseKarnataka Cabinet approves filing of criminal cases against RCB, state cricket body in Bengaluru stampede case"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-nationals-in-voter-list-inside-bihars-suspicious-enumeration-drive-2757226-2025-07-17",
      "headline": "Foreign nationals in voter list? Inside Bihar's suspicious revision driveThey came with Aadhaar, ration cards, and years of life in India. But in Bihar's border districts, silence now greets their names on voter forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-karnataka-whistleblower-mass-burials-rape-murder-sit-probe-demand-2757114-2025-07-17",
      "headline": "What is the Dharmasthala mass-burial case and the horror stories of skeletonsAllegations of the bodies of hundreds of women who were raped and murdered over years being buried in the popular pilgrimage town of Dharmasthala in Karnataka have shocked people. A former sanitation worker on the payroll of the temple administration from 1995 to 2014 claims he buried and burned the bodies of victims under coercion from immensely influential people. He has now dug up some of the skeletons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/janaki-v-vs-state-of-kerala-review-well-crafted-story-but-an-execution-fail-suresh-gopi-2757222-2025-07-17",
      "headline": "Janaki V vs State of Kerala review: Noble intentions marred by flawed executionRelease Date:Thu Jul 17, 2025Janaki V vs State of Kerala movie review: Written and directed by Pravin Narayanan, the Malayalam suspense drama film stars Suresh Gopi and Anupama Parameshwaran in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/rss-signal-on-modis-retirement-is-bjps-golden-chance-to-name-dalit-pm-siddaramaiah-2757251-2025-07-17",
      "headline": "RSS hint on Modi's retirement BJP's golden chance to name Dalit PM: SiddaramaiahCiting RSS chief Mohan Bhagwat's comment hinting at Prime Minister Narendra Modi's political exit, Karnataka Chief Minister Siddaramaiah challenged BJP to name a Dalit as its next Prime Ministerial candidate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/eps-says-aiadmk-will-lead-he-will-be-cm-welcomes-mk-stalin-allies-to-switch-sides-2757233-2025-07-17",
      "headline": "Palaniswamy says AIADMK will lead alliance, dares Stalin allies to switch sidesEdappadi K Palaniswami rules out coalition confusion, affirms AIADMK will lead the alliance and form the government in Tamil Nadu. He invites 'disillusioned' DMK allies to switch sides before polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-india-went-the-extra-mile-in-lords-test-defeat-2756578-2025-07-16",
      "headline": "How India went the 'extra' mile in Lord's Test defeatThe margin of loss against England wasn't really 22 runs, but the 63 extras that Team India conceded in the match\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pretty-little-baby-singer-connie-francis-dies-at-87-2757256-2025-07-17",
      "headline": "Pretty Little Baby singer Connie Francis dies at 87Legendary 1960s pop singer Connie Francis, known for hits like the viral 'Pretty Little Baby', died at the age of 87. She was the first solo female artiste to top the Billboard Hot 100."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/patna/story/patna-hospital-firing-criminal-out-on-parole-shot-by-rival-gang-in-broad-daylight-2757150-2025-07-17",
      "headline": "Video: 5 men walk into Patna hospital room, shoot dead rival gang memberA prisoner accused of murder was shot multiple times by five attackers inside Patna's Paras Hospital, triggering a political uproar over Bihar's worsening law and order situation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-slams-pm-modi-you-find-foreigners-in-bihar-poll-list-but-not-killers-in-pahalgam-2757259-2025-07-17",
      "headline": "You find foreigners in Bihar poll list but not killers in Pahalgam: Owaisi to PMAsaduddin Owaisi said that Operation Sindoor should not be stopped until the terrorists involved in the Pahalgam attack are found. He further warned that he would continue to ask tough questions of the government until all four terrorists are located."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-stunt-safety-akshay-kumar-insurance-protects-professionals-2757036-2025-07-17",
      "headline": "The ABC of stunts in Bollywood, Akshay Kumar's insurance and how it still is riskyBollywood has significantly improved stunt safety standards, highlighted by Akshay Kumar's initiative to provide health and accident insurance for hundreds of stunt professionals. Despite the inherent risks in stunt work, these measures offer vital protection and financial support to artistes in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-crash-captain-role-fuel-switch-us-report-pilots-body-2756996-2025-07-17",
      "headline": "Pilots' body objects amid new US report on 'role' of Captain in Air India crashA report in The Wall Street Journal, citing cockpit recordings, claimed the captain of the Air India jet cut the fuel flow to the engines. The government has urged the public to refrain from jumping to conclusions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/stringent-anti-terror-law-uapa-constitutionally-valid-has-presidents-assent-high-court-dismisses-plea-2757215-2025-07-17",
      "headline": "Anti-terror law UAPA constitutionally valid, has President's assent: High CourtThe Bombay High Court on Thursday dismissed a plea challenging the constitutional validity of several provisions of the stringent anti-terror law, the Unlawful Activities (Prevention) Act (UAPA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/it-was-touch-and-go-for-a-while-obamas-break-silence-on-divorce-rumours-glbs-2756912-2025-07-17",
      "headline": "It was touch and go, Obama quips as Michelle and he shut down divorce rumoursBarack and Michelle Obama, joined by Michelle's brother Craig Robinson, addressed divorce rumours for the first time with humour and sincerity, reaffirming their strong relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-fastest-indian-sprinter-exclusive-athletics-championships-qualification-2756963-2025-07-17",
      "headline": "Meet Animesh Kujur: India's fastest man, breaking one barrier at a timeAt just 22, Animesh Kujur is now India's fastest man yet. Hailing from a remote village in Chhattisgarh, he is rewriting the history of Indian track and field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-not-convinced-questions-karnataka-high-court-bail-order-to-actor-darshan-in-renukaswamy-murder-case-2757217-2025-07-17",
      "headline": "Supreme Court raps Karnataka High Court for bail to actor Darshan in murder caseThe Supreme Court has cast doubt on the Karnataka High Court's decision to grant bail to actor Darshan in the Renukaswamy murder case, citing questionable use of judicial discretion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-rare-order-restores-custody-mother-child-develops-anxiety-2757127-2025-07-17",
      "headline": "In rare move, Supreme Court reverses own order, grants boy's custody to motherIn its previous order, the Supreme Court had upheld the Kerala High Court judgment granting permanent custody of the child to his father. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistani-taliban-recruiting-actively-in-bangladesh-arrests-ttp-yunus-hasina-jihadi-2756783-2025-07-17",
      "headline": "Pakistani Taliban recruiting actively in Bangladesh, but intel agencies cluelessThe Tehrik-e-Taliban Pakistan (TTP) is actively recruiting in Bangladesh even as the security establishment remains oblivious to the threat. Two of the Bangladeshi recruits even travelled to Afghanistan with one being killed by the Pakistan Army. Recent arrests of TTP terrorists in Bangladesh have finally blown the lid off the operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/from-cockpit-to-space-control-inside-the-new-careers-for-indian-pilots-2757230-2025-07-17",
      "headline": "The Shubhanshu Shukla Effect: What pilot jobs look like in 2025 and beyondOnce seen only as flyers, today's pilots are stepping into roles in space tech, drone robotics, aviation law, and more. Inspired by IAF pilot Shubhanshu Shukla, experts explain how Gen Z can build diverse aviation careers -- on the ground and in the skies -- with the right skills, training, and vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/officers-acted-as-servants-of-rcb-karnataka-argues-against-revoking-bengaluru-cops-suspension-over-stampede-2757109-2025-07-17",
      "headline": "Servants of RCB: Karnataka argues against revoking cop's suspension over stampedeThe Karnataka government defended in court its suspension of IPS officer Vikash Kumar over the June 4 Bengaluru stadium stampede, arguing senior cops acted like \"servants of the RCB\" and failed crowd control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-man-livestreams-suicide-hangs-self-blames-wife-affair-debt-video-viral-2757196-2025-07-17",
      "headline": "Debt-ridden man livestreams suicide in Delhi, accuses wife of affairBefore taking his life, Vikas recorded a video where he accused a man named Shakib of having an affair with his wife, the mother of their 4-year-old son."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-kalashnikov-ak-203-rifles-delivery-amethi-plant-insas-rifles-2757148-2025-07-17",
      "headline": "Army to get 7,000 more 'Made in Amethi' AK-203 rifles in 2-3 weeksThe Indian Army is phasing out the decades-old INSAS rifle in favour of the AK-203, a Russian-origin assault rifle, amid twin threats along its borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/janaki-v-vs-state-of-kerala-review-well-crafted-story-but-an-execution-fail-suresh-gopi-2757222-2025-07-17",
      "headline": "Janaki V vs State of Kerala review: Noble intentions marred by flawed executionRelease Date:Thu Jul 17, 2025Janaki V vs State of Kerala movie review: Written and directed by Pravin Narayanan, the Malayalam suspense drama film stars Suresh Gopi and Anupama Parameshwaran in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-poetic-tribute-mohit-suri-heartfelt-post-musical-vision-2757135-2025-07-17",
      "headline": "Saiyaara actor Aneet Padda pays poetic tribute to Mohit Suri's musical vision'Saiyaara' actor Aneet Padda shared a heartfelt note dedicated to director Mohit Suri. She highlighted his unique vision and emotional depth in music and storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-rana-daggubati-cheeky-banter-on-why-kattappa-killed-baahubali-wins-the-internet-2757213-2025-07-17",
      "headline": "Prabhas, Rana's cheeky banter on 'Why Kattappa killed Baahubali' wins the internet'Baahubali' is all set for a grand re-release this October, rekindling the iconic question about Katappa's betrayal with hilarious replies from stars Prabhas and Rana Daggubati. The friendly banter received fans' appreciation on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pride-prejudice-by-joe-wright-to-re-release-in-indian-theatres-all-you-need-to-know-2757140-2025-07-17",
      "headline": "Joe Wright's Pride & Prejudice to re-release in theatres - all you need to knowJoe Wright's 'Pride & Prejudice' (2005), starring Keira Knightley and Matthew MacFadyen, returns to Indian theatres on July 25. Re-released by PVR INOX and UIP, the beloved adaptation offers fans a chance to relive Jane Austen's timeless romance on the big screen."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravi-shastri-on-englands-wtc-points-deduction-2757241-2025-07-17",
      "headline": "Ravi Shastri warns England after Lord's Test win: It may hurt like AustraliaFormer India cricketer and head coach Ravi Shastri has warned England of facing Australia's fate after the WTC points deduction following their 22-run win at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-deep-dasgupta-karun-nair-vs-sai-sudharsan-2757234-2025-07-17",
      "headline": "Deep Dasgupta wants Sai Sudarshan over Karun Nair after Lord's failureIndia vs England: Former India wicketkeeper Deep Dasgupta believes it's time to look beyond Karun Nair after his failure in 3 Tests against England. Dasgupta wants to back promising youngster Sai Sudharsan, who was discarded after the opening Test match at Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-pratika-rawal-england-vs-india-womens-odi-record-2757224-2025-07-17",
      "headline": "Mandhana, Pratika set partnership world record in 1st Women's ODIENG-W vs IND-W: Smriti Mandhana and Pratika Rawal reached a partnership landmark of 1000 runs at an average of 84.66 in the first Women's ODIs on Thursday in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-marcus-rashford-transfer-barcelona-teddy-sheringham-2757216-2025-07-17",
      "headline": "Rashford doesn't deserve move to Barcelona: Sheringham slams United starFormer Manchester United striker, Teddy Sheringham hopes that Marcus Rashford does get the move to FC Barcelona. The club legend believes that the striker has not deserved such a move after reflecting on his time with Manchester United.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-indian-badminton-japan-open-2757210-2025-07-17",
      "headline": "Lakshya Sen focusing on achieving peak fitness after Japan Open exitLakshya Sen suffered an early exit at the Japan Open. The ace shuttler now aims to get back to full fitness before the world championships in Paris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-deepti-sharma-credits-rishabh-pant-for-new-shot-2757182-2025-07-17",
      "headline": "Deepti Sharma credits Rishabh Pant for new one-handed shot in her armouryIndia all-rounder Deepti Sharma has credited Rishabh Pant for the new one-handed shot in her armoury, which she played during her match-winning innings in the first ODI against England in Southampton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/engw-vs-indw-deepti-sharma-preparations-odi-world-cup-southampton-2757141-2025-07-17",
      "headline": "Deepti not looking too far ahead of World Cup: Going one match at a timeDeepti Sharma is just taking it one game at a time. She does not want to get too ahead of herself and overwhelm her with the pressure of playing in the ODI World Cup. Instead she intends to take it a game at a time and focus on contributing each time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alastair-cook-bowlers-blaming-dukes-ball-india-vs-england-test-series-2757115-2025-07-17",
      "headline": "Alastair Cook taunts bowlers over persistent ball change requestsFormer England captain Alastair Cook has added his voice—and a dose of humour—to the growing debate around the Dukes ball in the ongoing five-match Test series between England and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-open-2025-lakshya-sen-satwikairaj-rankireddy-chirag-shetty-eliminated-in-round-of-16-clash-2757078-2025-07-17",
      "headline": "Japan Open 2025: Lakshya Sen, Satwik-Chirag eliminated in Round of 16 clashIndia's charge in the Japan Open is all but over as top stars like Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy-Chirag Shetty were eliminated from the tournament after losing their respective Round of 16 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-have-to-alter-indias-jasprit-bumrah-plan-david-lloyd-2757072-2025-07-17",
      "headline": "Gautam Gambhir will have to alter India's Jasprit Bumrah plan: David LloydFormer England cricketer David Lloyd feels India head coach Gautam Gambhir will have to alter their plans regarding Jasprit Bumrah to make a comeback in the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-r-ashwin-father-bold-prediction-mohammed-siraj-lords-test-2757070-2025-07-17",
      "headline": "Ashwin recalls his father's bold prediction about Siraj in thrilling Lord's TestEngland vs India: Former Indian cricketer Ravichandran Ashwin shared an amusing anecdote, revealing that his father was confident Mohammed Siraj would finish the match by hitting three sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/engw-vs-indw-deepti-sharma-preparations-odi-world-cup-southampton-2757141-2025-07-17",
      "headline": "Deepti not looking too far ahead of World Cup: Going one match at a timeDeepti Sharma is just taking it one game at a time. She does not want to get too ahead of herself and overwhelm her with the pressure of playing in the ODI World Cup. Instead she intends to take it a game at a time and focus on contributing each time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alastair-cook-bowlers-blaming-dukes-ball-india-vs-england-test-series-2757115-2025-07-17",
      "headline": "Alastair Cook taunts bowlers over persistent ball change requestsFormer England captain Alastair Cook has added his voice—and a dose of humour—to the growing debate around the Dukes ball in the ongoing five-match Test series between England and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-open-2025-lakshya-sen-satwikairaj-rankireddy-chirag-shetty-eliminated-in-round-of-16-clash-2757078-2025-07-17",
      "headline": "Japan Open 2025: Lakshya Sen, Satwik-Chirag eliminated in Round of 16 clashIndia's charge in the Japan Open is all but over as top stars like Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy-Chirag Shetty were eliminated from the tournament after losing their respective Round of 16 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-have-to-alter-indias-jasprit-bumrah-plan-david-lloyd-2757072-2025-07-17",
      "headline": "Gautam Gambhir will have to alter India's Jasprit Bumrah plan: David LloydFormer England cricketer David Lloyd feels India head coach Gautam Gambhir will have to alter their plans regarding Jasprit Bumrah to make a comeback in the ongoing series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-r-ashwin-father-bold-prediction-mohammed-siraj-lords-test-2757070-2025-07-17",
      "headline": "Ashwin recalls his father's bold prediction about Siraj in thrilling Lord's TestEngland vs India: Former Indian cricketer Ravichandran Ashwin shared an amusing anecdote, revealing that his father was confident Mohammed Siraj would finish the match by hitting three sixes."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}