{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-formula-1-racing-dream-taxation-roadblock-motorsport-entertainment-tax-2761667-2025-07-26",
      "headline": "How taxes drove Formula 1 out of IndiaFormula 1 didn't leave India because of a lack of fans or infrastructure. It left because of unclear policies, tax confusion, and a system that didn't treat it like a sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-hires-chatgpt-co-creator-as-chief-scientist-to-lead-new-ai-lab-glbs-2761556-2025-07-26",
      "headline": "Meta hires ChatGPT co-creator as chief scientist to lead new AI labMeta has appointed ChatGPT co-creator Shengjia Zhao as chief scientist of its new Superintelligence Lab, aiming to advance AGI and regain AI leadership after Llama 4's weak performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/explained-why-india-uk-free-trade-agreement-is-a-big-deal-for-both-nations-2761520-2025-07-25",
      "headline": "Explained: Why India-UK free trade agreement is a big deal for both nationsIndia and the United Kingdom have formally sealed a Comprehensive Economic and Trade Agreement, a deal described as the \"biggest, most economically significant trade deal that the UK has made since leaving the EU.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-comstar-denies-coercion-claims-by-sunjay-kapurs-mother-defends-agm-2761391-2025-07-25",
      "headline": "Not a shareholder, no coercion: Sunjay Kapur's firm counters mother's chargesThe clarification comes after it was reported that Rani Kapur had written a letter to delay the AGM and alleged that she was made to sign documents shortly after her son's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-hailed-as-key-post-brexit-success-by-the-british-media-2761344-2025-07-25",
      "headline": "Remainers will choke on their cornflakes: British media hails India trade dealThe India-UK Free Trade Agreement (FTA) or the Comprehensive Economic and Trade Agreement (CETA) seeks to enhance bilateral trade by around USD 34 billion annually, besides ensuring better market access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ftas-with-eu-us-in-talks-says-commerce-secretary-after-india-uk-trade-deal-2761327-2025-07-25",
      "headline": "FTAs with EU, US in talks, says Commerce Secretary after India-UK trade dealThe agreement now needs to pass through both houses of the British Parliament. A special committee will study it before giving final approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-721-points-lower-nifty-below-24900-bajaj-finance-falls-5-2761243-2025-07-25",
      "headline": "Sensex ends 721 points lower, Nifty below 24,900; Bajaj Finance falls 5%The S&P BSE Sensex was down 721.08 points to 81,463.09 at the closing bell, while the NSE Nifty50 declined 225.10 points to trade at 24,837. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother alleges business coercion, attempt to 'usurp family legacy'Rani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "This key agreement in UK trade deal will hugely benefit Indian firms, workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-slams-trolls-age-shaming-marriage-2761795-2025-07-26",
      "headline": "Zareen Khan slams trolls for age-shaming: Will marriage make me young again?Actor Zareen Khan gave a sharp and witty response to an ageist troll who told her to get married because she's getting old. She questioned the mindset of people behind their words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-ektaa-kapoor-to-visit-nathdwara-temple-ahead-of-kyunki-saas-bhi-kabhi-bahu-thi-2-2761766-2025-07-26",
      "headline": "Smriti Irani, Ektaa Kapoor to visit Nathdwara temple ahead of Kyunki rebootSmriti Irani and Ektaa Kapoor will visit Nathdwara Temple in Rajasthan on July 27 to seek blessings ahead of the premiere of 'Kyunki Saas Bhi Kabhi Bahu Thi' Season 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-box-office-vijay-sethupathi-nithya-menen-earns-rs-4-crore-2761771-2025-07-26",
      "headline": "Thalaivan Thalaivii box office Day 1: Vijay Sethupathi's film earns Rs 4.15 crorePandiraj's Thalaivan Thalaivii, featuring Vijay Sethupathi and Nithya Menen, opened to an encouraging start at the box office, earning Rs 4.15 crore on day one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-shares-miss-india-connection-gauri-pradhan-kyunki-saas-bhi-bahu-thi-reboot-2761735-2025-07-26",
      "headline": "Smriti Irani shares Miss India connection with Gauri Pradhan ahead of Kyunki 2Actor-politician Smriti Irani shared that she and Gauri Pradhan were Miss India finalists in 1998, long before becoming the iconic saas-bahu duo in 'Kyunki Saas Bhi Kabhi Bahu Thi'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-producer-sandra-thomas-files-nomination-burqa-legal-battle-film-chamber-kfpa-2761754-2025-07-26",
      "headline": "Malayalam producer files nomination in burqa after legal battle with film chamberMalayalam producer Sandra Thomas filed her nomination papers in a burqa amid a legal battle with the Kerala Film Producers Association (KFPA). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-returns-ramp-12-years-india-couture-week-2025-showstopper-falguni-shane-peacock-2761693-2025-07-26",
      "headline": "Akshay Kumar returns to ramp as showstopper after 12 years. WatchAkshay Kumar made a grand return to the ramp after 12 years as the showstopper for Falguni Shane Peacock at India Couture Week 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/seventeens-joshua-breathes-new-life-into-slanders-love-is-gone-2761710-2025-07-26",
      "headline": "SEVENTEEN's Joshua breathes new life into Slander's Love Is GoneSEVENTEEN's Joshua brings a heartfelt new twist to Love Is Gone with American DJs SLANDER, showcasing his unique vocal tone. This collaboration marks another step in his growing global music journey as SEVENTEEN gears up for their world tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-distributes-sweets-wraps-border-2-varun-dhawan-ahaan-shetty-2761705-2025-07-26",
      "headline": "Diljit distributes sweets as he wraps Border 2, Varun Dhawan, Ahan Shetty reactDiljit Dosanjh has wrapped the shooting of his upcoming film 'Border 2'. In a video shared by the singer-turned-actor, he distributed sweets on the sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-against-8-hour-shifts-deepika-padukone-spirit-2761649-2025-07-26",
      "headline": "Is Farah Khan against 8-hour shifts? Director reacts to ongoing buzzFilmmaker Farah Khan has hinted that she doesn't support the idea of an eight-hour workday in the film industry. Her remark comes amid the ongoing debate sparked by Deepika Padukone's reported exit from Spirit over work-hour demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-confirms-hera-pheri-3-announcement-soon-paresh-rawal-suniel-shetty-2761665-2025-07-26",
      "headline": "Akshay Kumar confirms return of Hera Pheri trio, says announcement coming soonAkshay Kumar has confirmed that all issues around 'Hera Pheri 3' have been resolved and the original team is reuniting. He assured fans that an official announcement would be made soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-praises-ahaan-panday-aneet-padda-saiyaara-success-welcomes-them-industry-mohit-suri-2761658-2025-07-26",
      "headline": "Akshay Kumar praises Ahaan-Aneet after Saiyaara success, welcomes them to industryAkshay Kumar shared his appreciation for 'Saiyaara'. The actor congratulated the entire team and praised newcomers Ahaan Panday and Aneet Padda. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mallika-sherawat-reacts-bhajan-mandali-singing-bheege-honth-in-mumbai-local-murder-emraan-hashmi-2761633-2025-07-26",
      "headline": "Mallika Sherawat reacts to mandali singing Bheege Honth in Mumbai local. WatchActor Mallika Sherawat shared a viral video of a bhajan mandali singing her iconic song 'Bheege Honth Tere' from 'Murder' inside a Mumbai local.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/curious-case-of-missing-dance-from-dance-numbers-no-choreography-only-clickbait-2760698-2025-07-26",
      "headline": "Curious case of missing dance from dance numbers - no choreography, only clickbaitOnce driven by choreography, dance numbers now rely on their potential to go viral. Industry insiders, including actors, directors, trade analysts, and choreographers, weigh in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ektaa-kapoor-denies-association-with-altt-amid-ban-for-vulgar-content-2761620-2025-07-26",
      "headline": "Ektaa Kapoor denies association with ALTT amid ban for vulgar contentTV Czarina Ektaa Kapoor denied her association with ALTT after the government banned the app for vulgar content. Kapoor stated that she had stepped down from her association with the app in June 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fantastic-four-first-steps-box-office-marvel-film-earns-rs-5-crore-saiyaara-craze-pedro-pascal-2761603-2025-07-26",
      "headline": "Fantastic Four box office Day 1: Marvel film earns Rs 5 crore amid Saiyaara crazeMarvel Studios' 'The Fantastic Four: First Steps' opened modestly in India, earning Rs 5.10 crore on its first day, facing stiff competition from the Bollywood hit 'Saiyaara'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-pawan-kalyan-film-sees-a-huge-dip-2761599-2025-07-26",
      "headline": "Hari Hara Veera Mallu box office Day 2: Pawan Kalyan's film sees a huge dipPawan Kalyan's 'Hari Hara Veera Mallu' saw a sharp decline at the box office on its second day, earning Rs 8 crore after an impressive Rs 47.50 crore opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-mohit-suri-ahaan-panday-aneet-padda-continues-strong-run-earns-190-crore-2761586-2025-07-26",
      "headline": "Saiyaara box office Day 8: Mohit Suri film continues strong run, earns Rs 190 croreMohit Suri's 'Saiyaara' has been earning tremendous love from all quarters. The movie, starring debutant Ahaan Panday alongside Aneet Padda, earned Rs 190 crore in just eight days. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actress-ruchi-gujjar-files-complaint-producer-karan-singh-chauhan-tv-serial-so-long-valley-2761552-2025-07-26",
      "headline": "Actor Ruchi Gujjar files complaint against film producer over financial fraudActress Ruchi Gujjar has filed an FIR against producer Karan Singh Chauhan over a Rs 24 lakh fraud linked to a TV serial deal. She alleges misuse of funds and intimidation after demanding her money back.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-life-threat-harassment-claims-leading-quiet-spiritual-life-2761419-2025-07-25",
      "headline": "After harassment claims, Tanushree Dutta says she is leading quiet, spiritual lifeActor Tanushree Dutta stated that she was overwhelmed with constant media requests for interviews. She had recently claimed about facing life threat at her home in Mumbai."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/sad-to-support-a-regime-chirag-paswans-big-attack-on-nitish-kumar-2761702-2025-07-26",
      "headline": "Feel sad to support a regime...: Chirag Paswan's big attack on ally Nitish KumarChirag Paswan said the law and order situation in the state is out of control and added that he feels sad to be supporting a government where crime continues unchecked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-raped-ambulance-driver-technician-home-guard-recruitment-bodh-gaya-bihar-2761590-2025-07-26",
      "headline": "Bihar woman gang-raped in moving ambulance after fainting in Home Guard examThe incident occurred on July 24, after the woman fainted during a race and was rushed to a hospital in an ambulance stationed at the site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rudra-bhairav-all-arms-brigades-to-boost-armys-on-ground-capabilities-in-border-areas-2761813-2025-07-26",
      "headline": "Rudra brigades, Bhairav battalions to boost Army's capabilities in border areasWhile fighting components like the infantry, mechanised infantry, armoured units, artillery, special forces, and unmanned aerial systems have been integrated under Rudra, Bhairav Light Commando Battalions have been established to shock the enemy on the border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-4-weather-updates-manchester-bumrah-stokes-2761690-2025-07-26",
      "headline": "4th Test Day 4 Live: Onus on Gill, Rahul to bail team out of troubleIndia (IND) vs England (ENG), 4th Test, Day 4 Live Score and Updates: India have got off to a disastrous start to their 1st innings in Manchester as they've lost the wickets of Sai Sudharsan and Yashasvi Jaiswal for ducks in the first over itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/delhi-pollution-politics-power-hypocrisy-of-india-vip-cavalcade",
      "headline": "Power, pollution, politics: The great hypocrisy of India's VIP cavalcadeIndia's political and administrative leaders routinely travel in massive, fuel-hungry cavalcades — fleets whose carbon footprints are far larger than they appear in passing. The cavalcades in Indian are seen as a symbol of power, reach and position. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nitish-reddy-delhi-high-court-trouble-squaretheone-srh-2761810-2025-07-26",
      "headline": "Player agency sues Nitish Reddy over unpaid dues of Rs 5 croreIndia all-rounder Nitish Reddy is facing legal action from his former player agency. The case has been filed over alleged unpaid dues from the player to his former agency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-jabs-bjp-jagdeep-dhankhar-resignation-he-showed-independence-mistake-impeachment-2761779-2025-07-26",
      "headline": "Congress jabs BJP over Dhankhar exit: He showed independence, that was a mistakeAlluding to what may have transpired behind the scenes, Congress MP Abhishek Manu Singhvi accused the Centre of panicking and \"removing the Rajya Sabha Chairperson\" to regain control over the impeachment process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/revamp-tensions-in-bjp-rss-why-the-sangh-stamp-is-all-over-2760614-2025-07-24",
      "headline": "Revamp tensions in BJP-RSS: Why the Sangh stamp is all overThe RSS is no longer content playing second fiddle. It is not just shaping state appointments in the BJP but also the central leadership transition"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/curious-case-of-missing-dance-from-dance-numbers-no-choreography-only-clickbait-2760698-2025-07-26",
      "headline": "Curious case of missing dance from dance numbers - no choreography, only clickbaitOnce driven by choreography, dance numbers now rely on their potential to go viral. Industry insiders, including actors, directors, trade analysts, and choreographers, weigh in. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-drives-audi-into-belapur-ditch-while-following-google-maps-in-navi-mumbai-2761772-2025-07-26",
      "headline": "Google Maps error leads Audi into ditch in Navi Mumbai, driver rescuedAccording to police, the woman was driving alone in an Audi and was headed towards Ulwe when the mishap took place. Instead of taking a bridge, her car took a wrong turn guided by Google Maps and fell into a ditch."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/4-children-injured-after-school-ceiling-plaster-collapses-in-uttar-pradeshs-hapur-2761791-2025-07-26",
      "headline": "4 children injured after school ceiling plaster collapses in UPThe incident occurred during school hours while children were attending classes inside the building, causing panic among students. Locals rushed to the school to help in rescue efforts, while administrative officials soon arrived at the scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/special-module-being-prepared-by-ncert-on-op-sindoor-in-final-stages-say-sources-2761802-2025-07-26",
      "headline": "NCERT to add special module on Operation Sindoor in curriculum for higher classesNCERT is creating a special classroom module for higher classes on Operation Sindoor, India's May 7 counter-strike after the Pahalgam terror attack. This is currently in the last stages of development and is expected to be released soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/labubu-doll-viral-karl-marx-london-pop-mart-photo-capitalism-irony-highgate-cemetery-lafufu-india-online-2761439-2025-07-26",
      "headline": "Labubus of the world unite, but not at Karl Marx's graveIn a capitalism-dominated world, where superficiality sells and sincerity scrolls by unnoticed, it took a designer Labubu doll to make a handwritten letter left at German philosopher Karl Marx's grave go viral. The irony is even Marx's grave hasn't gone untouched by consumerism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-dates-venue-september-9-to-28-uae-2761788-2025-07-26",
      "headline": "Asia Cup 2025 from September 9 to 28, to be held in the UAEThe 2025 edition of the Asia Cup will be held in the United Arab Emirates from September 9 to 28, the Asian Cricket Council (ACC) announced on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/trump-no-hiring-from-india-microsoft-google-tech-jobs-impact-2761463-2025-07-26",
      "headline": "No hiring in India: Could Trump's new push disrupt tech jobs?US President Donald Trump's recent call for tech giants like Google and Apple to stop hiring from India has stirred unease across India's white-collar job sector. With thousands of Indians employed in top roles at these companies and many more aspiring to join them, the remark has raised serious questions about future opportunities, especially for graduates from IITs and IIMs who see these firms as dream employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-issues-guidelines-to-curb-student-suicides-in-educational-institutions-2761629-2025-07-26",
      "headline": "Deeply distressing: Supreme Court issues guidelines to curb student suicidesThe guidelines call for measures such as mandatory mental health counseling, functional grievance redressal systems and regulatory oversight in all educational settings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-nuke-scare-cia-nanda-devi-nuclear-device-itbp-himalayas-1965-mission-uttarakhand-china-test-guru-rinpoche-2761183-2025-07-25",
      "headline": "How an India-US spy mission lost a nuclear device in the HimalayasAfter China's first atomic test, the US and India, as part of a covert operation, tried to place a nuclear-powered listening device at 25,000 feet in the Himalayas near the Nanda Devi peak. A blizzard forced the CIA-IB team to leave the device on the route. A recovery mission, and several search operations, failed to locate the device."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-508-25-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mbbs-student-suicide-udaipur-college-on-boil-after-student-dies-by-suicide-alleging-torture-by-staff-2761575-2025-07-26",
      "headline": "Udaipur college on boil after student dies by suicide alleging torture by staffA handwritten note found at the location accuses staff members of the college of harassment, citing irregularities in exam schedules, arbitrary failure of students, and repeated monetary demands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-retire-test-cricket-mohammad-kaif-bold-claim-2761685-2025-07-26",
      "headline": "Jasprit Bumrah is struggling physically, may retire from Tests: KaifFormer Indian cricketer Mohammad Kaif fears the worst. He reckons that Jasprit Bumrah could retire from Test cricket after not being able to meet the physical demands that come with the longest format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sam-altman-warns-chatgpt-is-not-your-therapist-and-your-secrets-arent-legally-private-2761631-2025-07-26",
      "headline": "Sam Altman warns ChatGPT isn't a therapist, your secrets aren't legally privateOpenAI CEO Sam Altman cautions users that conversations with ChatGPT lack legal confidentiality and could be disclosed in court until clear privacy laws are established. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-slams-trolls-age-shaming-marriage-2761795-2025-07-26",
      "headline": "Zareen Khan slams trolls for age-shaming: Will marriage make me young again?Actor Zareen Khan gave a sharp and witty response to an ageist troll who told her to get married because she's getting old. She questioned the mindset of people behind their words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/avoid-travel-to-borders-india-issues-advisory-on-cambodia-as-armed-conflict-with-thailand-escalates-2761626-2025-07-26",
      "headline": "Avoid travel to border: India issues advisory on Cambodia amid clash with ThailandThe Indian Embassy in Cambodia issued travel advisories urging nationals to avoid border areas amid the most intense fighting in 13 years between Thailand and Cambodia over disputed territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-maldives-relations-credit-line-visit-prime-minister-narendra-modi-muizzu-2761534-2025-07-26",
      "headline": "From 'India Out' to most trusted friend: PM, Maldives' Muizzu recalibrate tiesDuring his visit to the Maldives, Prime Minister Narendra Modi reaffirmed the deep historical and strategic ties between the two nations, announced a Rs 4,850 crore credit line, and held wide-ranging talks with President Mohamed Muizzu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/samantha-ruth-prabhu-charms-in-yellow-as-she-arrives-in-mumbai-airport-2761809-2025-07-26",
      "headline": "Samantha Ruth Prabhu charms in yellow as she arrives in Mumbai. VideoSamantha Ruth Prabhu was seen at Mumbai airport on Saturday afternoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-slams-trolls-age-shaming-marriage-2761795-2025-07-26",
      "headline": "Zareen Khan slams trolls for age-shaming: Will marriage make me young again?Actor Zareen Khan gave a sharp and witty response to an ageist troll who told her to get married because she's getting old. She questioned the mindset of people behind their words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-box-office-vijay-sethupathi-nithya-menen-earns-rs-4-crore-2761771-2025-07-26",
      "headline": "Thalaivan Thalaivii box office Day 1: Vijay Sethupathi's film earns Rs 4.15 crorePandiraj's Thalaivan Thalaivii, featuring Vijay Sethupathi and Nithya Menen, opened to an encouraging start at the box office, earning Rs 4.15 crore on day one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-producer-sandra-thomas-files-nomination-burqa-legal-battle-film-chamber-kfpa-2761754-2025-07-26",
      "headline": "Malayalam producer files nomination in burqa after legal battle with film chamberMalayalam producer Sandra Thomas filed her nomination papers in a burqa amid a legal battle with the Kerala Film Producers Association (KFPA). \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-nitish-reddy-delhi-high-court-trouble-squaretheone-srh-2761810-2025-07-26",
      "headline": "Player agency sues Nitish Reddy over unpaid dues of Rs 5 croreIndia all-rounder Nitish Reddy is facing legal action from his former player agency. The case has been filed over alleged unpaid dues from the player to his former agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-joins-jacques-kallis-and-garfield-sobers-in-elite-list-2761804-2025-07-26",
      "headline": "Ben Stokes achieves rare Test double, joins Kallis and Sobers in elite listEngland captain Ben Stokes etched his name in the history books as he joined Jacques Kallis and Garfield Sobers in an elite list after his sensational performance in the fourth Test against India at Old Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-transfer-news-ruben-amorim-2761782-2025-07-26",
      "headline": "No takers for Man United rejects: Amorim ready to reintegrate exiled starsManchester United manager Ruben Amorim is open to reintegrating sidelined players if transfer offers do not meet club valuations. Several top players have fallen out of favour with Amorim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-dates-venue-september-9-to-28-uae-2761788-2025-07-26",
      "headline": "Asia Cup 2025 from September 9 to 28, to be held in the UAEThe 2025 edition of the Asia Cup will be held in the United Arab Emirates from September 9 to 28, the Asian Cricket Council (ACC) announced on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/xavi-hernandez-india-head-coach-job-aiff-bizarre-statement-2761786-2025-07-26",
      "headline": "Did Xavi apply for India coach job? AIFF makes bizarre statementFans were sent into a frenzy after reports emerged that Xavi Hernandez had applied to be India's Head Coach but amidst the rising scepticism, the AIFF's latest statement has only added to the confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-test-hundred-manchester-test-2761768-2025-07-26",
      "headline": "Ben Stokes ends 2-year-long century drought with superb Test hundredBen Stokes answered his critics in emphatic style, bringing up a hard-fought century on Day 4 of the 4th Test against India — his first in Test cricket in over two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodrigo-de-paul-joins-inter-miami-reunites-lionel-messi-mls-2761756-2025-07-26",
      "headline": "Rodrigo de Paul officially joins Inter Miami, reunites with Lionel MessiRodrigo de Paul has officially made the move to Inter Miami. After his four-year spell at Atletico Madrid, he leaves the Spanish giants to go on and reunite with Lionel Messi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-4th-test-day-4-ball-by-ball-commentary-2761749-2025-07-26",
      "headline": "England vs India 4th Test Day 4 live ball-by-ball commentaryEngland vs India: Here's the ball-by-ball commentary of Day 4 of the fourth Test between England and India from Old Trafford in Manchester. India are on the backfoot and will be looking to make a comeback with England taking a lead of 186 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kevin-pietersen-joe-root-manchester-test-2761741-2025-07-26",
      "headline": "Batting these days is way easier: Pietersen after Root's 38th Test hundredENG vs IND, 4th Test: Kevin Pietersen said that batting has become easier than how it was 20–25 years ago. His comments came after Joe Root scored his 38th Test century. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-captaincy-jasprit-bumrah-nasser-hussain-critical-2761717-2025-07-26",
      "headline": "Ignored Sundar, used Bumrah poorly: Hussain slams Gill's tacticsNasser Hussain was heavily critical regarding Shubman Gill's captaincy in the Manchester Test. He the way he ineffectively used his bowlers as India now face a series-defeat against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodrigo-de-paul-joins-inter-miami-reunites-lionel-messi-mls-2761756-2025-07-26",
      "headline": "Rodrigo de Paul officially joins Inter Miami, reunites with Lionel MessiRodrigo de Paul has officially made the move to Inter Miami. After his four-year spell at Atletico Madrid, he leaves the Spanish giants to go on and reunite with Lionel Messi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-4th-test-day-4-ball-by-ball-commentary-2761749-2025-07-26",
      "headline": "England vs India 4th Test Day 4 live ball-by-ball commentaryEngland vs India: Here's the ball-by-ball commentary of Day 4 of the fourth Test between England and India from Old Trafford in Manchester. India are on the backfoot and will be looking to make a comeback with England taking a lead of 186 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kevin-pietersen-joe-root-manchester-test-2761741-2025-07-26",
      "headline": "Batting these days is way easier: Pietersen after Root's 38th Test hundredENG vs IND, 4th Test: Kevin Pietersen said that batting has become easier than how it was 20–25 years ago. His comments came after Joe Root scored his 38th Test century. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-captaincy-jasprit-bumrah-nasser-hussain-critical-2761717-2025-07-26",
      "headline": "Ignored Sundar, used Bumrah poorly: Hussain slams Gill's tacticsNasser Hussain was heavily critical regarding Shubman Gill's captaincy in the Manchester Test. He the way he ineffectively used his bowlers as India now face a series-defeat against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-live-score-4th-test-day-4-weather-updates-manchester-bumrah-stokes-2761690-2025-07-26",
      "headline": "4th Test Day 4 Live: Woakes runs through India's top orderIndia (IND) vs England (ENG), 4th Test, Day 4 Live Score and Updates: India have got off to a disastrous start to their 1st innings in Manchester as they've lost the wickets of Sai Sudharsan and Yashasvi Jaiswal for ducks in the first over itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-retire-test-cricket-mohammad-kaif-bold-claim-2761685-2025-07-26",
      "headline": "Jasprit Bumrah is struggling physically, may retire from Tests: KaifFormer Indian cricketer Mohammad Kaif fears the worst. He reckons that Jasprit Bumrah could retire from Test cricket after not being able to meet the physical demands that come with the longest format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/washington-open-anna-kalinskaya-bella-dog-clara-tauson-video-2761666-2025-07-26",
      "headline": "Watch: Anna Kalinskaya's dog adorably runs on court to celebrate owner's victoryWashington Open 2025: Anna Kalinskaya's dog Bella raced towards her owner after the 6-3, 7-5 win over Clara Tauson in the quarterfinals of the WTA 500 tournament. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bumrah-akash-deep-nitish-injuries-ipl-mornel-morkel-2761654-2025-07-26",
      "headline": "India's injury crisis: Is IPL the main reason behind constant niggles in Tests?India's bowling unit struggled on Day 3 of the Manchester Test amid injuries and fatigue. Morne Morkel said that it has been difficult to manage workloads given the bowlers came into the Test series straight after the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-ricky-ponting-england-vs-india-4th-test-2761644-2025-07-26",
      "headline": "Joe Root has made it clear that he doesn't play for stats: Ricky PontingENG vs IND, 4th Test: Joe Root scored 150 off 248 balls as England took a substantial 186-run lead at Stumps on Day 3 of the ongoing Test at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-andre-russell-tim-david-fastest-t20i-century-2761623-2025-07-26",
      "headline": "Tim David reveals using Russell's bat to hit fastest T20I century for AustraliaWI vs AUS, 3rd T20I: Tim David hit the fastest hundred in T20Is by an Australian, helping Australia beat the West Indies by six wickets to seal the five-match series 3-0.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-joe-root-sachin-tendulkar-most-runs-test-cricket-2761605-2025-07-26",
      "headline": "Ollie Pope backs Joe Root to chase down Sachin Tendulkar's Test recordIndia vs England: Senior England batter Joe Root has become the second highest run-scorer in Test cricket after a magnificent 150-run innings in the 4th Test. Will he be able to break Sachin Tendulkar's feat of most runs in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-west-indies-vs-australia-3rd-t20i-series-win-2761591-2025-07-26",
      "headline": "Tim David's historic century powers Australia to T20I series win vs West IndiesWI vs AUS, 3rd T20I: Tim David hit Australia's fastest hundred in T20Is off 37 balls as the visitors sealed the five-match series with a dominating six-wicket win at the Warner Park in Basseterre, St Kitts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-ricky-ponting-england-vs-india-4th-test-2761644-2025-07-26",
      "headline": "Joe Root has made it clear that he doesn't play for stats: Ricky PontingENG vs IND, 4th Test: Joe Root scored 150 off 248 balls as England took a substantial 186-run lead at Stumps on Day 3 of the ongoing Test at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-andre-russell-tim-david-fastest-t20i-century-2761623-2025-07-26",
      "headline": "Tim David reveals using Russell's bat to hit fastest T20I century for AustraliaWI vs AUS, 3rd T20I: Tim David hit the fastest hundred in T20Is by an Australian, helping Australia beat the West Indies by six wickets to seal the five-match series 3-0.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-joe-root-sachin-tendulkar-most-runs-test-cricket-2761605-2025-07-26",
      "headline": "Ollie Pope backs Joe Root to chase down Sachin Tendulkar's Test recordIndia vs England: Senior England batter Joe Root has become the second highest run-scorer in Test cricket after a magnificent 150-run innings in the 4th Test. Will he be able to break Sachin Tendulkar's feat of most runs in Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-west-indies-vs-australia-3rd-t20i-series-win-2761591-2025-07-26",
      "headline": "Tim David's historic century powers Australia to T20I series win vs West IndiesWI vs AUS, 3rd T20I: Tim David hit Australia's fastest hundred in T20Is off 37 balls as the visitors sealed the five-match series with a dominating six-wicket win at the Warner Park in Basseterre, St Kitts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/koneru-humpy-vs-divya-deshmukh-chess-world-cup-final-2761583-2025-07-26",
      "headline": "Humpy vs Deshmukh: All you need to know about Chess World Cup finalKoneru Humpy and Divya Deshmukh are set to face each other in the all-India final at the Chess World Cup final, starting Saturday, July 26. While Humpy beat Tingjie Lei in the semis, Deshmukh got the better of Zhongyi Tan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-morne-morkel-eng-vs-ind-manchester-test-2761568-2025-07-26",
      "headline": "Jasprit Bumrah not injured, need more energy on flat decks: Morne MorkelIndia bowling coach Morne Morkel said that Jasprit Bumrah wasn't injured after the Indian pacer was seen favouring his left ankle during the second session of Day 3. Morkel also admitted that the Indian pacers were lacking a bit of energy that was needed on the flat Manchester pitch. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-manchester-poor-performance-2761538-2025-07-26",
      "headline": "What's ailing Jasprit Bumrah? Manchester misfire raises red flagsENG vs IND, 4th Test: While some of the biggest batters were allowed to fail for long periods, the scrutiny on Bumrah's wicket column has been immense. Day 3 in Manchester was again a stark reminder of the fact that he isn't the magic wand that can make up for the tactical blunders of the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-manchester-joe-root-indian-bowlers-2761516-2025-07-25",
      "headline": "4th Test: Wheels come off for India in Manchester as Joe Root rewrites recordsEngland vs India, 4th Test: India conceded 319 runs as England seized control on Day 3 in Manchester. Joe Root scored a commanding 150, climbing to second place on the all-time list of Test run-scorers and leading what could be a series-defining batting charge for the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-jasprit-bumrah-shubman-gill-2761508-2025-07-25",
      "headline": "Manchester Test: India concede 500 overseas for the first time in 10 yearsThe Indian bowlers were made to toil on Day 3 of the Manchester Test as they conceded 500 runs. This was the first time in 10 years that India conceded 500-plus in an innings in an overseas Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/m-chinnaswamy-stadium-unsafe-large-events-judicial-report-ipl-womens-odi-world-cup-2761494-2025-07-25",
      "headline": "Bengaluru stadium, set to host Women's World Cup matches, deemed unsafe: ReportThe M Chinnaswamy Stadium in Bengaluru has been declared unsafe for large-scale events following a judicial commission report. The iconic venue is slated to host crucial matches in the upcoming Women's World Cup, scheduled for September-October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-satwik-chirag-into-semifinals-unnati-hooda-out-2761490-2025-07-25",
      "headline": "China Open: Satwik-Chirag storm into semis, Unnati Hooda's dream run endsSatwiksairaj Rankireddy and Chirag Shetty advanced to the China Open semifinals with a win over Malaysia. Young Indian player Unnati Hooda's impressive run ended after losing to world number four Akane Yamaguchi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anahat-singh-bronze-world-squash-junior-championships-indian-girl-semifinalist-2010-2761474-2025-07-25",
      "headline": "Squash: Teenager Anahat Singh clinches bronze at World Junior ChampionshipsTeen squash sensation Anahat Singh secured a bronze medal at the World Squash Junior Championships. She became the first Indian girl since 2010 to reach the last-four stage in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-manchester-joe-root-ricky-ponting-sachin-tendulkar-2761438-2025-07-25",
      "headline": "Joe Root goes past Ponting, only behind Tendulkar in all-time Test listJoe Root moved to second place in the all-time Test run-scorers list during the Manchester Test. His achievement highlights his consistency and raises expectations of surpassing Sachin Tendulkar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-captaincy-washingon-sundar-manchester-2761425-2025-07-25",
      "headline": "Is captain Shubman Gill to blame for India's bowling flop show? Experts dividedEngland dominated India on Day 3 of the fourth Test at Old Trafford, exposing weaknesses in India's bowling attack. Questions arise over Shubman Gill's captaincy and the team's reluctance to use key spinners early in the innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-team-coach-khalid-jamil-frontrunner-aiff-kalyan-chaubey-2761415-2025-07-25",
      "headline": "Khalid Jamil emerges as frontrunner for Indian football team coach roleKhalid Jamil is the frontrunner for the vacant Indian men's football coach role. AIFF will announce the decision after an executive committee meeting within 10 days."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}