{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/applying-for-a-personal-loan-do-not-fall-for-these-5-common-scam-tactics-2818292-2025-11-12",
      "headline": "Applying for a personal loan? Don't fall for these 5 common scam tacticsThe race to get fast loans has made many borrowers easy targets for fraudsters. Scammers use fake apps, urgent messages and sweet deals to trap people. Spotting the red flags can save you from serious financial trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-continue-to-rise-why-are-they-climbing-2818211-2025-11-12",
      "headline": "Gold prices continue to rise. Why are they climbing?After months of ups and downs, gold is once again on the rise. With fresh global triggers and growing demand, the metal is gaining strength. Here's a closer look at the factors fuelling the latest surge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-record-low-of-025-percent-in-october-as-food-prices-fall-2818191-2025-11-12",
      "headline": "Retail inflation eases to record low of 0.25% in October as food prices fallThe latest consumer price index (CPI) print was well below expectations and marks the lowest reading since the current CPI series began in 2015, which uses 2012 as the base year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-income-tax-refund-delayed-here-is-how-interest-is-calculated-on-it-2818150-2025-11-12",
      "headline": "Is your income tax refund delayed? Here's how interest is calculated on itWaiting endlessly for your tax refund can test anyone's patience. The silver lining? The government compensates you with interest for delays — at a fixed rate, calculated monthly. But there are rules, limits and exceptions. Let's decode them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-rally-end-higher-it-stocks-gain-tcs-tech-mahindra-up-2818136-2025-11-12",
      "headline": "Sensex, Nifty end higher as US optimism sparks IT rallyThe S&P BSE Sensex gained 595.19 points to close at 84,466.51, while the NSE Nifty50 added 180.85 points to end at 25,875.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-gold-etf-buying-bond-india-leads-us-china-shift-physical-precious-metals-why-reason-2818123-2025-11-12",
      "headline": "Gold without the glitter: Why investors are moving away from physical goldIn October 2025, India recorded the third-highest gold ETF inflows globally, behind only the United States and China, a clear sign that the country's love for gold is being redefined in the digital era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/buying-a-house-just-because-you-can-afford-the-emi-think-again-2818050-2025-11-12",
      "headline": "Buying a house just because you can afford the EMI? Think againThe calculator may say you can afford it, but life may say otherwise. A home loan is not just a financial decision — it impacts savings, career choices, and long-term stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-enterprises-share-price-rally-over-6-percent-today-rights-issue-2818043-2025-11-12",
      "headline": "Explained: Why Adani Enterprises shares have gained over 6% todayAdani Enterprises share price: The rise came after the company announced plans for a Rs 24,930-crore rights issue, its biggest fundraising move since the cancelled follow-on public offering (FPO) in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-jump-5-percent-today-why-stock-is-gaining-today-2818041-2025-11-12",
      "headline": "IndusInd Bank shares jump 5% today. What's behind the rally?At around 1:20 pm, IndusInd Bank shares were up 4.38% at Rs 862.05 on the Bombay Stock Exchange (BSE), with trading volumes remaining strong through the afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indias-direct-tax-collection-up-7-percent-but-refunds-down-177-percent-what-does-it-mean-2817988-2025-11-12",
      "headline": "India's direct tax collection up 7%, but refunds down 17.7%. What does it mean?India's direct tax collection climbed 7% this year, but refunds dropped 17.7%. It leaves taxpayers asking what's really driving the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-jump-why-is-stock-market-rising-today-reason-us-india-deal-it-stocks-rally-asian-markets-2817983-2025-11-12",
      "headline": "Sensex jumps 600 points: 3 reasons why stock market is rising todayThe S&P BSE Sensex rose 663.63 points to 84,534.95, while the NSE Nifty50 jumped 196.25 points to 25,891.20 as of 11:38 am. The rally comes after days of sluggish trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-why-so-many-retail-investors-end-up-losing-money-2817758-2025-11-12",
      "headline": "The great IPO gamble: Why so many retail investors end up losing moneyThis is Part 1 of a three-part series examining how India's IPO boom is entering risky territory for retail investors amid sky-high valuations and growing market hype.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/when-income-rises-but-wealth-doesnt-inside-indias-lifestyle-inflation-problem-2817957-2025-11-12",
      "headline": "When income rises but wealth doesn't: Inside India's lifestyle inflation problemThe globalisation, liberalisation, and privatisation of the post 1991 – propelled GDP growth but fostered dynamics that entrench lifestyle creep at a seed level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-list-12-percent-higher-on-debut-hold-or-book-profit-now-2817921-2025-11-12",
      "headline": "Groww shares list 12% higher on debut: Hold or book profit now?Groww's market debut at Rs 112 marks a strong start for the fintech, but analysts say investors should book partial profits and hold the rest for long-term growth amid valuation risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-opening-bse-nse-14-percent-premium-above-expectations-rs-114-hold-sell-2817915-2025-11-12",
      "headline": "Groww shares list at 14% premium, exceeds expectation on market debutThe stock opened at Rs 114 on the BSE and Rs 112 on the NSE, compared to its IPO price of Rs 100 per share, exceeding market expectations for a modest gain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-demerger-tmcv-shares-lists-with-30-premium-at-rs-340-2817909-2025-11-12",
      "headline": "Tata Motors CV shares list at 28% premium after demerger at Rs 335Tata Motors' commercial vehicle arm listed with a strong premium, reflecting investor confidence in India's transport and infrastructure growth, and marking a major milestone in the company's value-unlocking journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-allotment-status-check-latest-gmp-share-price-expectation-2817908-2025-11-12",
      "headline": "Pine Labs IPO allotment out: Check status, listing date and expected gainsInvestors who have applied for the IPO can check their allotment status through the BSE website or via the registrar, Kfin Technologies Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-today-us-fed-rate-cut-forecast-precious-metals-outlook-2817906-2025-11-12",
      "headline": "Gold price at Rs 1.24 lakh, silver nears Rs 1.56 lakh: What's next?The rally in precious metals comes amid expectations of a US Federal Reserve rate cut next month, easing concerns around the prolonged US government shutdown and continued weakness in the dollar index."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tenneco-clean-air-ipo-open-bidding-review-price-band-gmp-trend-details-share-analysis-2817884-2025-11-12",
      "headline": "Tenneco Clean Air IPO opens for bidding: Check price band, GMP before subscribingTenneco Clean Air IPO is a book-built issue worth Rs 3,600 crore, entirely an offer for sale (OFS) of 9.07 crore shares. This means all proceeds will go to the selling shareholders, and the company will not receive any fresh capital from the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-400-points-higher-nifty-above-25800-titan-up-1-percent-2817880-2025-11-12",
      "headline": "Sensex, Nifty open higher on optimism over Bihar exit polls, US trade dealOptimism over a likely NDA victory in Bihar and hopes of an imminent India-US trade deal lifted investor sentiment, driving Sensex and Nifty higher even as caution lingered over FII activity."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-19-episode-80-mridul-evicted-amaal-tanya-accuse-gaurav-of-using-him-as-pawn-2818478-2025-11-12",
      "headline": "BB 19 Episode 80: Mridul evicted; Amaal-Tanya accuse Gaurav of using him as pawn 'Bigg Boss 19' saw a wave of emotional eviction as Mridul exited after the Top 10 vote pitch. The episode ended with a harsh new accusation: Amaal asserted that winner Gaurav had used Mridul as a pawn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kisses-rashmika-mandanna-hand-at-the-girlfriend-success-event-2818447-2025-11-12",
      "headline": "Vijay Deverakonda kisses Rashmika Mandanna's hand at The Girlfriend success event Vijay Deverakonda publicly kissed Rashmika Mandanna's hand at 'The Girlfriend' success event. The affectionate moment delighted fans and highlighted their strong bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mukesh-bhatt-slams-vikram-bhatt-over-his-remarks-about-exploiting-mahesh-bhatt-2818424-2025-11-12",
      "headline": "Bhatts in a row: Mukesh slams Vikram over his remarks on exploiting Mahesh Bhatt Producer Mukesh Bhatt opens up about his separation from elder brother Mahesh Bhatt. He also addresses allegations made by director Vikram Bhatt, highlighting family tensions and misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajnath-singh-farhan-akhtar-launch-my-stamp-before-rezang-la-war-63rd-anniversary-2818359-2025-11-12",
      "headline": "Rajnath Singh, Farhan Akhtar launch My Stamp before Rezang La Battle anniversary The makers of '120 Bahadur' launched a customised 'My Stamp' based on the Rezang La War Memorial. Defence Minister Rajnath Singh unveiled the stamp in New Delhi in the presence of Farhan Akhtar, Razneesh 'Razy' Ghai and Ritesh Sidhwani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-on-her-fears-after-backlash-over-men-should-experience-period-comment-2818327-2025-11-12",
      "headline": "Rashmika on her fears after backlash over men should experience period comment Actor Rashmika Mandanna faced criticism for her period pain remarks on Jagapathi Babu's talk show – 'Jayammu Nischayammu Raa'. While responding to a fan on social media, she also revealed her fear of attending shows due to constant misinterpretation of her comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devi-sri-prasad-hails-rashmikas-the-girlfriend-says-she-deserves-national-award-2818322-2025-11-12",
      "headline": "Devi Sri Prasad hails Rashmika's The Girlfriend, says she deserves National Award Music composer Devi Sri Prasad, who gave Rashmika Mandanna chart-topping hits like 'Srivalli' and 'Peelings', has heaped praise on the actor for her latest performance in 'The Girlfriend'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/globe-trotter-priyanka-chopra-says-malti-marie-bonded-with-mahesh-babu-daughter-sitara-a-calf-2818326-2025-11-12",
      "headline": "Globe Trotter: Priyanka says Malti bonded with Mahesh Babu's daughter, a calf Priyanka Chopra revealed that her daughter Malti Marie had the best time with Mahesh Babu's daughter Sitara during the shoot of 'SSMB29'. The film is tentatively titled 'Globe Trotter'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-goes-guns-blazing-in-saree-1st-look-from-rajamouli-globe-trotter-2818341-2025-11-12",
      "headline": "Priyanka Chopra goes guns blazing in saree: 1st look from Rajamouli's Globe Trotter SS Rajamouli shared Priyanka Chopra's first look as Mandakini from 'Globe Trotter'. The actor is seen in a fierce appearance, aiming a pistol while wearing a yellow saree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-varun-dhawans-march-into-legacy-could-be-his-battle-for-reinvention-2818291-2025-11-12",
      "headline": "Border 2: Varun Dhawan's march into legacy could be his battle for reinvention Varun Dhawan aims to take a strong leap with 'Border 2', playing Param Vir Chakra awardee Colonel Hoshiar Singh Dahiya. The film could mark his most defining shift as an actor yet – from mass entertainer to an intense performer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pati-patni-aur-panga-finale-when-where-to-watch-who-is-in-the-race-sonali-bendre-munawar-faruqui-2818286-2025-11-12",
      "headline": "Pati Patni Aur Panga finale: When, where to watch and who's in the race The countdown for the finale of 'Pati Patni Aur Panga' has begun. Here's everything you need to know about the date, timing, top celebrity contestants, special guest appearances and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-chiranjeevi-part-of-prabhas-spirit-sandeep-reddy-vanga-clarifies-on-rumours-2818290-2025-11-12",
      "headline": "Is Chiranjeevi part of Prabhas' Spirit? Sandeep Reddy Vanga clarifies on rumours Director Sandeep Reddy Vanga, who has often expressed his admiration for megastar Chiranjeevi, has finally addressed the ongoing rumours linking the veteran actor to his upcoming film 'Spirit' starring Prabhas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-harsh-gujral-emotional-full-circle-moment-amitabh-bachchan-2818267-2025-11-12",
      "headline": "Comedian Harsh Gujral calls his KBC appearance a full-circle moment with Big B Comedian Harsh Gujral reminisces about his experience on 'Kaun Banega Crorepati', highlighting his emotional connection to the show and Amitabh Bachchan. Accompanied by his parents, Gujral describes meeting Bachchan as a significant milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gal-gadot-honoured-with-israel-genesis-prize-for-her-wartime-activism-2818227-2025-11-12",
      "headline": "Gal Gadot honoured with Israel's Genesis Prize for her wartime activism Gal Gadot was honoured with Israel's Genesis Prize for her wartime support towards her home country. She has been a vocal advocate demanding the release of hostages, ever since the Israel-Hamas conflict escalated.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-is-very-grounded-the-bads-of-bollywood-actor-armaan-khera-2818161-2025-11-12",
      "headline": "Aryan Khan is very grounded: The Ba***ds of Bollywood actor Armaan Khera Actor Armaan Khera has shared memorable experiences from his audition for 'The Ba***ds of Bollywood'. In the exclusive interview, he also opened up about his meeting with Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-birthday-celebration-bollywood-directorial-debut-industry-support-2818166-2025-11-12",
      "headline": "Suhana Khan's adorable birthday wish for Aryan is all sibling love, Ananya joins Aryan Khan, son of Shah Rukh and Gauri Khan, marked his 28th birthday on November 12, receiving widespread wishes from sister Suhana Khan and others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-marriage-expiry-date-renewal-option-twinkle-khanna-cheating-remark-vicky-kaushal-kriti-sanon-2818141-2025-11-12",
      "headline": "After Twinkle's viral cheating remark, Kajol says marriage should have expiry date In the finale of 'Two Much With Kajol and Twinkle', Kajol sparked a debate by suggesting marriages should have an expiry date and renewal option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-birthday-wish-for-wife-sheetal-about-more-love-life-and-babies-2818144-2025-11-12",
      "headline": "Vikrant Massey's birthday wish for wife Sheetal is about more love, life and babies Actor Vikrant Massey shared a loving birthday message for his wife Sheetal Thakur with a sunset photo. The actor was last seen in 'Aankhon Ki Gustakhiyan' (2025) opposite Shanaya Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-marks-32-years-of-baazigar-shares-old-school-montage-with-shah-rukh-khan-kajol-2818159-2025-11-12",
      "headline": "Shilpa Shetty marks 32 years of Baazigar, shares old-school montage with SRK, Kajol Shilpa Shetty Kundra marked 32 years of 'Baazigar' with a nostalgic montage and a heartfelt post celebrating the film that launched her career. The 1993 thriller, co-starring Shah Rukh Khan and Kajol, remains a timeless Bollywood classic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/oh-young-soo-acquitted-south-korean-court-overturns-indecent-assault-conviction-2818140-2025-11-12",
      "headline": "Squid Game actor Oh Young-soo acquitted in assault case due to lack of evidence A South Korean court has overturned the indecent assault conviction of 'Squid Game' actor Oh Young-soo. The court cited insufficient evidence in the sexual assault lawsuit against him."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/red-fort-blast-dr-umar-nabis-big-strike-babri-masjid-demolition-anniversary-delhi-white-collar-module-2818374-2025-11-12",
      "headline": "Delhi blast suspect planned big strike on Babri Masjid demolition anniversary Live UpdatesDr Umar Nabi, the prime suspect of Monday's Red Fort blast, intended to carry out a major explosion around the Babri Masjid demolition anniversary on December 6, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-blast-a-terror-attack-will-bring-perpetrators-collaborators-to-justice-government-after-pms-meet-2818357-2025-11-12",
      "headline": "Delhi blast a terror attack: Govt vows to bring culprits, collaborators to justiceThe Union Cabinet condemned the November 10 Red Fort car blast as a \"heinous terror attack,\" vowing to bring all terror perpetrators and its collaborators to justice. Chaired by PM Modi, the Cabinet reaffirmed India's zero-tolerance policy towards terrorism and directed a swift, high-level probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-elections-2025-axis-my-india-exit-polls-nda-mahagathbandhan-nitish-tejashwi-2818284-2025-11-12",
      "headline": "Narrow edge for NDA, Bihar staring at photo finish, predicts Axis My India exit pollBihar exit polls: The Axis My India exit poll has predicted a narrow win for the Nitish Kumar-led NDA in the Bihar elections, despite 20 years of anti-incumbency. The Tejashwi Yadav-led Mahagathbandhan is likely to secure 98-118 seats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-bomb-blast-red-fort-pakistan-islamabad-court-explosion-expose-bias-trump-america-us-india-condolence-tweets-2818325-2025-11-12",
      "headline": "Do US remarks on Delhi, Islamabad blasts reveal Trump's bias?The explosion in Delhi and the suicide blast in Islamabad triggered global reactions. But the US' responses to both the incidents have sparked a debate if America, under President Donald Trump, has a bias towards Pakistan. While Washington DC condemned the Islamabad attack as terrorism, it delayed its response to the Delhi blast, which had a neutral tone. The US' response didn't go unnoticed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/new-video-captures-moment-car-exploded-in-slow-moving-traffic-near-red-fort-2818446-2025-11-12",
      "headline": "Loud noise, then street lights go out: New video shows impact of Delhi explosionA new video of the Delhi terror attack has emerged, showing a Hyundai i20 car blowing up and going up in flames moments after a bomb was detonated by Dr Umar Un Nabi, who was an employee at Faridabad's Al-Falah University. At least 12 people were killed and several others were injured in the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/democrats-release-bombshell-email-by-epstein-alleging-trump-spent-hours-with-his-sex-trafficking-victim-2818353-2025-11-12",
      "headline": "Trump spent hours with sex abuse victim: Democrats release bombshell Epstein emailThe new batch of emails, part of 23,000 documents shared by the Epstein estate, were posted by the House Oversight Committee and include exchanges with Ghislaine Maxwell and author Michael Wolff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/from-jamia-to-jail-terror-tainted-al-falah-chancellor-jawad-siddiqui-shady-past-2818411-2025-11-12",
      "headline": "From Jamia to jail: Chancellor of terror-tainted Al-Falah had a shady pastAccording to a former colleague who spoke to India Today Fact Check on the condition of anonymity, Jawad became a Mechanical Engineering lecturer at Jamia Millia Islamia in 1993. But his ambitions far exceeded the humble podium of a college."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-welcomes-syrian-president-ahmed-al-sharaa-white-house-diplomatic-ties-2818425-2025-11-12",
      "headline": "How many wives? Trump jokes with Syrian President at historic White House meetUS President Donald Trump hosted Ahmed al-Sharaa to the White House, marking the first official visit by a Syrian leader since 1946. The meeting included a notable moment where Trump presented al-Sharaa with a bottle of perfume and engaged in a personal, light-hearted exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-says-marriage-expiry-date-renewal-option-twinkle-khanna-cheating-remark-vicky-kaushal-kriti-sanon-2818141-2025-11-12",
      "headline": "After Twinkle's viral cheating remark, Kajol says marriage should have expiry dateIn the finale of 'Two Much With Kajol and Twinkle', Kajol sparked a debate by suggesting marriages should have an expiry date and renewal option."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-blast-suspect-dr-umar-nabi-visited-old-delhi-mosque-red-fort-attack-sources-2818331-2025-11-12",
      "headline": "Delhi blast suspect visited Tablighi Jamaat mosque, then went to Red Fort: SourcesDr Umar Nabi, the prime suspect of the car blast near Delhi's Red Fort, spent around 15 minutes at a Tablighi Jammat-run mosque in Old Delhi before heading towards the site of the blast, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-new-luxury-how-republic-of-nature-redefines-meaningful-living-on-ecr-2814472-2025-11-06",
      "headline": "The New Luxury: How Republic of Nature Redefines Meaningful Living on ECRDiscover how Republic of Nature by GTB Developers is reshaping Chennai's East Coast Road with design-forward homes that blend luxury, nature, and mindfulness in one of India's most refined new communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-to-abandon-ongoing-pakistan-tour-after-islamabad-bomb-blast-2818445-2025-11-12",
      "headline": "SLC to take action against players considering leaving Pak after Islamabad blastThe Sri Lankan cricket board has warned its players of action who are thinking of pulling out of the ongoing Pakistan tour after a bomb blast in Islamabad. Several members of the Sri Lankan squad have informed their cricket board that they are unwilling to continue with the tour, citing security fears"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sania-mirze-single-mother-panic-attacks-shoaib-malik-divore-farah-khan-support-2818449-2025-11-12",
      "headline": "Sania Mirza opens up on panic attacks after Shoaib Malik divorce: I was shiveringSania Mirza has revealed she suffered panic attacks after her divorce from Shoaib Malik. The tennis star credited her close friend, Bollywood director Farah Khan, for helping her through one of her lowest emotional moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kash-patel-girlfriend-alexis-wilkins-files-multiple-lawsuits-against-maga-influencers-mossad-spy-schaffer-israel-seraphin-paker-2818172-2025-11-12",
      "headline": "Kash Patel's girlfriend sues MAGA influencers over Mossad spy claimsFBI director Kash Patel's girlfriend, Alexis Wilkins, has filed three defamation lawsuits against MAGA influencers Elijah Schaffer, Kyle Seraphin, and Sam Parker. She has accused them of spreading conspiracy theories portraying her as an Israeli \"Mossad honeypot agent\" to manipulate the FBI chief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tej-pratap-yadav-confident-winning-mahua-seat-skeptical-exit-polls-bihar-election-results-2818311-2025-11-12",
      "headline": "I'm winning Mahua, result day unpredictable: Tej Pratap dismisses exit pollsTej Pratap Yadav dismissed the exit poll predictions, expressed confidence in his victory for the Mahua seat, and said that instead of focusing on celebrations, his priority would be serving the people of his constituency."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-cops-launch-massive-hunt-for-ecosport-car-no-dl10ck0458-2818135-2025-11-12",
      "headline": "Delhi bomber's 2nd car, red EcoSport, found near Haryana village after massive huntRed EcoSport car owned by Delhi blast suspect was found parked in Haryana after cops launched massive hunt this afternoon. The car with DL10CK0458 plate was registered in the name of Umar Un Nabi at Rajouri Garden RTO on 22 November 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-goes-guns-blazing-in-saree-1st-look-from-rajamouli-globe-trotter-2818341-2025-11-12",
      "headline": "Priyanka Chopra goes guns blazing in saree: 1st look from Rajamouli's Globe TrotterSS Rajamouli shared Priyanka Chopra's first look as Mandakini from 'Globe Trotter'. The actor is seen in a fierce appearance, aiming a pistol while wearing a yellow saree."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-talks-taliban-snub-islamabad-amir-akhundzada-isnt-mullah-after-pak-ttp-fatwa-2818303-2025-11-12",
      "headline": "Taliban Amir isn't a mufti: Afghanistan snubbed Pak's demand for fatwaDuring the Pakistan-Afghanistan peace talks, Islamabad demanded that the Amir of the Taliban regime in Kabul to declare a fatwa against the TTP. But, Kabul has pushed back, saying Hibatullah Akhundzada is an Amir, not a Mufti. The refusal to issue a fatwa was one of the key reasons the peace talks collapsed without a solution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-netanyahu-with-benjamin-netanyahu-nyc-visit-can-mamdani-get-him-arrested-fulfil-promise-un-headquarters-icc-2818022-2025-11-12",
      "headline": "Can Mayor Mamdani arrest Netanyahu in New York on January 1?Israeli Prime Minister Benjamin Netanyahu is set to arrive in in New York on Zohran Mamdani's first day as mayor. The mayor-elect had promised to arrest Netanyahu for \"war crimes\" in Gaza, but can he really get him arrested? The city is bracing for a clash of global politics and local governance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/al-falah-universitys-dr-hassan-fired-by-jk-govt-for-anti-national-activities-missing-after-delhi-blast-2818162-2025-11-12",
      "headline": "Al-Falah University's Dr Hassan, fired by J&K government, missing after Delhi blastDr Nisar-ul-Hassan, a former assistant professor at Srinagar's SMHS Hospital who was dismissed by the Jammu and Kashmir government in 2023 for alleged anti-national activities, has gone missing after Monday's car blast near Delhi's Red Fort that claimed 12 lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/drone-footage-amravati-wedding-stabbing-attacker-escape-tracked-2818023-2025-11-12",
      "headline": "Video: Groom stabbed at wedding, cameraman's drone chases attackers for 2 kmA groom was stabbed during his wedding ceremony in Amravati, with the attack caught on drone footage. The drone followed the fleeing attacker for two kilometres, aiding police in their investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-asim-munir-army-chief-military-coup-fitna-al-khwarij-al-hindustan-afghanistan-india-jihadi-2817215-2025-11-12",
      "headline": "How Asim Munir is taking Pakistan Army to 7th-century ArabiaPakistani Army Chief Asim Munir is staging a silent coup by getting the Constitution amended. Amid consolidation of power, Munir, a Quran-e-Hafiz, is taking the Pakistani military to 7th-century Arabia by using terms like fitna and khawarij from early Islamic history. The indoctrination is such that the Pakistani military is making its battles a jihad for Islam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghan-cricketer-rashid-khan-confirms-second-marriage-10-months-after-first-kabul-rumours-cricket-sports-2818271-2025-11-12",
      "headline": "Afghan cricketer Rashid Khan confirms second marriage, 10 months after firstAfghanistan cricket star Rashid Khan, who represents Gujarat Titans in the Indian Premier League (IPL), confirmed that he had married for a second time on August 2, 2025, just 10 months after his first marriage. His confirmation came after rumours sparked by charity event photos. Khan requested his privacy be respected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/obcs-backed-nda-rjd-congress-retained-muslim-yadav-loyalty-axis-my-india-exit-poll-2818252-2025-11-12",
      "headline": "OBCs back NDA, RJD-Congress retain Muslim-Yadav loyalty: Axis My India exit pollThe Axis My India exit poll survey estimates the NDA's overall vote share at 43%, slightly ahead of the MGB's 41%, while Prashant Kishor's Jan Suraaj Party is projected to secure 4% and other parties together around 12%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb-19-episode-80-mridul-evicted-amaal-tanya-accuse-gaurav-of-using-him-as-pawn-2818478-2025-11-12",
      "headline": "BB 19 Episode 80: Mridul evicted; Amaal-Tanya accuse Gaurav of using him as pawn'Bigg Boss 19' saw a wave of emotional eviction as Mridul exited after the Top 10 vote pitch. The episode ended with a harsh new accusation: Amaal asserted that winner Gaurav had used Mridul as a pawn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kisses-rashmika-mandanna-hand-at-the-girlfriend-success-event-2818447-2025-11-12",
      "headline": "Vijay Deverakonda kisses Rashmika Mandanna's hand at The Girlfriend success eventVijay Deverakonda publicly kissed Rashmika Mandanna's hand at 'The Girlfriend' success event. The affectionate moment delighted fans and highlighted their strong bond."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-yashasvi-jaiswal-rajasthan-royals-captain-ravindra-jadeja-trade-aakash-chopra-2818458-2025-11-12",
      "headline": "Not Ravindra Jadeja, Yashasvi Jaiswal should be RR captain: Aakash Chopra Aakash Chopra believes Rajasthan Royals should hand the captaincy to Yashasvi Jaiswal instead of Ravindra Jadeja. His comments come amid reports of a blockbuster trade between CSK and RR involving Jadeja, Curran, and Sanju Samson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sania-mirze-single-mother-panic-attacks-shoaib-malik-divore-farah-khan-support-2818449-2025-11-12",
      "headline": "Sania Mirza opens up on panic attacks after Shoaib Malik divorce: I was shivering Sania Mirza has revealed she suffered panic attacks after her divorce from Shoaib Malik. The tennis star credited her close friend, Bollywood director Farah Khan, for helping her through one of her lowest emotional moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-to-abandon-ongoing-pakistan-tour-after-islamabad-bomb-blast-2818445-2025-11-12",
      "headline": "SLC to take action against players considering leaving Pak after Islamabad blast The Sri Lankan cricket board has warned its players of action who are thinking of pulling out of the ongoing Pakistan tour after a bomb blast in Islamabad. Several members of the Sri Lankan squad have informed their cricket board that they are unwilling to continue with the tour, citing security fears"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haryana-cm-felicitates-shafali-verma-with-rs-15-crore-prize-for-world-cup-win-2818408-2025-11-12",
      "headline": "Haryana CM felicitates Shafali Verma with Rs 1.5 Crore prize for World Cup win Haryana Chief Minister Nayab Singh Saini felicitated India's Women's World Cup-winning star Shafali Verma at his official residence in Chandigarh. Shafali played a pivotal role in India's World Cup triumph, being adjudged Player of the Match in the final for scoring 87 runs and taking two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-jasprit-bumrah-kagiso-rabada-key-role-pacers-eden-gardens-2818426-2025-11-12",
      "headline": "Jasprit Bumrah and Kagiso Rabada will play big role in IND vs SA Tests: Greame Smith Graeme Smith feels Jasprit Bumrah and Kagiso Rabada could define the India-South Africa Test series. The former Proteas captain said both sides must handle pace early before spinners take charge in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-vijay-hazare-trophy-participation-mca-official-2818358-2025-11-12",
      "headline": "No word from Rohit Sharma on availability for Vijay Hazare Trophy: MCA Official Mumbai Cricket Association officials state Rohit Sharma has not yet communicated his availability for the Vijay Hazare Trophy. The BCCI has reportedly urged senior players to participate in domestic cricket to remain in ODI contention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-shardul-thakur-arjun-tendulkartraded-mumbai-indians-ipl-2026-retention-2818340-2025-11-12",
      "headline": "Shardul Thakur to MI? R Ashwin accidentally reveals big trade move for IPL 2026 Ravichandran Ashwin accidentally revealed Shardul Thakur's trade to Mumbai Indians ahead of the IPL 2026 retention deadline. Thakur played for Lucknow Super Giants (LSG) in IPL and scalped 13 wickets from ten games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-new-zealand-defeat-lessons-spin-heavy-proteas-ryan-ten-doeschate-2818318-2025-11-12",
      "headline": "Hope India use New Zealand lessons vs spin-heavy South Africa: Ryan ten Doeschate India assistant coach Ryan ten Doeschate expects India's batters to apply lessons from last year's New Zealand defeat as they face defending World Test champions South Africa. The two-match series begins Friday at the Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghan-cricketer-rashid-khan-confirms-second-marriage-10-months-after-first-kabul-rumours-cricket-sports-2818271-2025-11-12",
      "headline": "Afghan cricketer Rashid Khan confirms second marriage, 10 months after first Afghanistan cricket star Rashid Khan, who represents Gujarat Titans in the Indian Premier League (IPL), confirmed that he had married for a second time on August 2, 2025, just 10 months after his first marriage. His confirmation came after rumours sparked by charity event photos. Khan requested his privacy be respected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-responds-ian-botham-criticism-england-ashes-preparation-australia-tour-2818264-2025-11-12",
      "headline": "Stokes responds to Botham's criticism over Ashes preps: Not sure what more we can do Ben Stokes has dismissed Ian Botham's criticism over England's Ashes preparations, insisting the team has done everything possible despite a packed schedule. He sounded confident that England will be ready when the series begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-beckham-gary-neville-india-visit-november-salford-city-promotion-2818265-2025-11-12",
      "headline": "David Beckham and Gary Neville set to land in India promoting Salford City Manchester United legends David Beckham and Gary Neville will visit India this November to promote their club Salford City. Their trip adds to a star-studded year for Indian football, with Lionel Messi also set to arrive soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-shardul-thakur-arjun-tendulkartraded-mumbai-indians-ipl-2026-retention-2818340-2025-11-12",
      "headline": "Shardul Thakur to MI? R Ashwin accidentally reveals big trade move for IPL 2026 Ravichandran Ashwin accidentally revealed Shardul Thakur's trade to Mumbai Indians ahead of the IPL 2026 retention deadline. Thakur played for Lucknow Super Giants (LSG) in IPL and scalped 13 wickets from ten games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-new-zealand-defeat-lessons-spin-heavy-proteas-ryan-ten-doeschate-2818318-2025-11-12",
      "headline": "Hope India use New Zealand lessons vs spin-heavy South Africa: Ryan ten Doeschate India assistant coach Ryan ten Doeschate expects India's batters to apply lessons from last year's New Zealand defeat as they face defending World Test champions South Africa. The two-match series begins Friday at the Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/afghan-cricketer-rashid-khan-confirms-second-marriage-10-months-after-first-kabul-rumours-cricket-sports-2818271-2025-11-12",
      "headline": "Afghan cricketer Rashid Khan confirms second marriage, 10 months after first Afghanistan cricket star Rashid Khan, who represents Gujarat Titans in the Indian Premier League (IPL), confirmed that he had married for a second time on August 2, 2025, just 10 months after his first marriage. His confirmation came after rumours sparked by charity event photos. Khan requested his privacy be respected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-responds-ian-botham-criticism-england-ashes-preparation-australia-tour-2818264-2025-11-12",
      "headline": "Stokes responds to Botham's criticism over Ashes preps: Not sure what more we can do Ben Stokes has dismissed Ian Botham's criticism over England's Ashes preparations, insisting the team has done everything possible despite a packed schedule. He sounded confident that England will be ready when the series begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/david-beckham-gary-neville-india-visit-november-salford-city-promotion-2818265-2025-11-12",
      "headline": "David Beckham and Gary Neville set to land in India promoting Salford City Manchester United legends David Beckham and Gary Neville will visit India this November to promote their club Salford City. Their trip adds to a star-studded year for Indian football, with Lionel Messi also set to arrive soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-on-jasprit-bumrah-toughest-bowler-to-face-sa20-2818145-2025-11-12",
      "headline": "Bumrah is the toughest to face, hope we don't see him in SA20: Faf du PlessisFaf du Plessis has hailed Jasprit Bumrah as the toughest bowler to face in the world. He also jokingly hoped that he would never get to face him in South Africa's premier T20 competition SA20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahmudul-hasan-joy-century-leads-bangladesh-dominance-ireland-first-test-2818216-2025-11-12",
      "headline": "Bangladesh dominate Ireland in Sylhet Test after Mahmudul Hasan Joy 169BAN vs IRE, 1st Test: Mahmudul Hasan Joy's unbeaten 169 and a record fourth-highest opening stand with Shadman Islam powered Bangladesh to 338 for 1, giving them a 52-run lead over Ireland in the Sylhet Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-test-nitish-kumar-reddy-released-join-india-a-squad-2818217-2025-11-12",
      "headline": "Nitish Kumar Reddy released from India Test squad for South Africa seriesIndia all-rounder Nitish Kumar Reddy has been released from the Test squad ahead of the South Africa series. He will join India A in Rajkot to gain match time after recent injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-tops-odi-rankings-kohli-finds-form-against-australia-2818199-2025-11-12",
      "headline": "Rohit Sharma retains spot as No.1 ranked ODI batter, Virat Kohli jumps to fifthRohit Sharma retained the top spot in the ICC ODI batting rankings with 781 points after a stellar series against Australia, while Virat Kohli bounced back with a gritty 74. Shubman Gill ranked fourth, keeping India's batting dominance intact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-drops-out-icc-odi-top-five-kohli-asalanka-rise-2818184-2025-11-12",
      "headline": "Babar Azam slumps to new low, drops out of ODI rankings top 5 for the first time in 6 yearsPAK vs SL: Babar Azam has fallen out of the top five of the ODI rankings for the first time in six years after he managed only 74 runs in his last four innings. On Tuesday, Babar scored only 29 runs before Wanindu Hasaranga accounted for his wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laura-wolvaardt-senuran-muthuswamy-named-icc-players-of-the-month-for-october-2818171-2025-11-12",
      "headline": "Laura Wolvaardt named ICC Player of the Month for October after World Cup heroicsSouth Africa's Laura Wolvaardt and Senuran Muthuswamy have been named ICC Women's and Men's Players of the Month respectively for October. Wolvaardt was the highest run scorer of the Women's World Cup 2025, while Muthuswamy was the Player of the Series in the two-match Test rubber against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-confident-shukri-conrad-to-end-test-series-win-india-press-conference-2818125-2025-11-12",
      "headline": "South Africa confident of history of our own in India: Head coach Shukri ConradIND vs SA, 1st Test: In the press conference before the Kolkata Test, South Africa head coach Shukri Conrad said that the Proteas have a potent spin attack and are more than capable of beating India in their upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/security-beefed-up-for-sri-lankan-cricket-team-amid-terror-threats-mohsin-naqvi-2818092-2025-11-12",
      "headline": "Security beefed up for Sri Lanka team after suicide bombing in IslamabadPakistan has ramped up security for the visiting Sri Lankan cricket team following recent militant attacks, deploying the army and paramilitary forces for protection. PCB chairman and Interior Minister Mohsin Naqvi personally assured the visitors of fool-proof safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-drops-out-icc-odi-top-five-kohli-asalanka-rise-2818184-2025-11-12",
      "headline": "Babar Azam slumps to new low, drops out of ODI rankings top 5 for the first time in 6 yearsPAK vs SL: Babar Azam has fallen out of the top five of the ODI rankings for the first time in six years after he managed only 74 runs in his last four innings. On Tuesday, Babar scored only 29 runs before Wanindu Hasaranga accounted for his wicket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/laura-wolvaardt-senuran-muthuswamy-named-icc-players-of-the-month-for-october-2818171-2025-11-12",
      "headline": "Laura Wolvaardt named ICC Player of the Month for October after World Cup heroicsSouth Africa's Laura Wolvaardt and Senuran Muthuswamy have been named ICC Women's and Men's Players of the Month respectively for October. Wolvaardt was the highest run scorer of the Women's World Cup 2025, while Muthuswamy was the Player of the Series in the two-match Test rubber against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-confident-shukri-conrad-to-end-test-series-win-india-press-conference-2818125-2025-11-12",
      "headline": "South Africa confident of history of our own in India: Head coach Shukri ConradIND vs SA, 1st Test: In the press conference before the Kolkata Test, South Africa head coach Shukri Conrad said that the Proteas have a potent spin attack and are more than capable of beating India in their upcoming Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/security-beefed-up-for-sri-lankan-cricket-team-amid-terror-threats-mohsin-naqvi-2818092-2025-11-12",
      "headline": "Security beefed up for Sri Lanka team after suicide bombing in IslamabadPakistan has ramped up security for the visiting Sri Lankan cricket team following recent militant attacks, deploying the army and paramilitary forces for protection. PCB chairman and Interior Minister Mohsin Naqvi personally assured the visitors of fool-proof safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-test-dhruv-jurel-replace-nitish-reddy-eden-gardens-kolkata-2818091-2025-11-12",
      "headline": "IND vs SA: Dhruv Jurel to replace Nitish Reddy in Kolkata Test, Ten Doeschate confirmsIndia assistant coach Ryan ten Doeschate confirmed Dhruv Jurel will play the first Test against South Africa in Kolkata. The wicketkeeper-batter's twin centuries against South Africa A secured his spot, while Nitish Reddy may miss out this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-one-handed-catch-shaheen-afridi-pakistan-sri-lanka-odi-2818066-2025-11-12",
      "headline": "Superman: Shaheen Afridi in awe of Babar Azam's stunning catch vs Sri LankaPAK vs SL: Shaheen Shah Afridi hailed Babar Azam's stunning one-handed catch in the slips during the first ODI against Sri Lanka, calling it a \"Superman\" effort. However, Babar's struggles with the bat persisted, as he managed just 29 runs and extended his century drought to 83 innings.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/raheem-sterling-family-safe-after-attempted-break-in-berkshire-home-chelsea-2818053-2025-11-12",
      "headline": "Chelsea's Raheem Sterling and family safe after attempted home break-in: ReportChelsea forward Raheem Sterling and his family escaped unharmed after masked intruders attempted to break into their Berkshire home. The incident, Sterling's second in recent years, occurred on Saturday evening. Police have launched an investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-coaching-delhi-capitals-ipl-2027-2818037-2025-11-12",
      "headline": "Sourav Ganguly as DC head coach from IPL 2027? Ex-India captain gives a subtle hintSourav Ganguly, who has long served as mentor and Director of Cricket for Delhi Capitals, has hinted at taking up a coaching role with the IPL franchise from the 2027 season. Currently the head coach of Pretoria Capitals, Ganguly remains deeply involved with DC's men's and women's teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-south-africa-hungry-end-15-year-wait-test-win-india-keshav-maharaj-2818032-2025-11-12",
      "headline": "South Africa hungry to end 15-year wait for a Test win in India, says Keshav MaharajSouth Africa's Keshav Maharaj acknowledged that while the team has managed success across other parts of the subcontinent, winning a Test in India — something they haven't done in 15 years — remains the ultimate challenge and a goal they are determined to achieve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-josh-hazlewood-cleared-to-play-injury-scare-sean-abbott-ruled-out-2818031-2025-11-12",
      "headline": "Ashes 2025: Josh Hazlewood cleared to play after injury scare, Sean Abbott ruled outJosh Hazlewood has been cleared of injury and is set to play the Ashes opener in Perth, while Sean Abbott has been ruled out with a hamstring strain. With Pat Cummins also sidelined, Scott Boland and Mitchell Starc will lead Australia's pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-dhruv-jurel-rishabh-pant-wicketkeeper-no-competition-2818012-2025-11-12",
      "headline": "Jurel rubbishes Pant competition talk: If we both play, even betterDhruv Jurel has brushed aside rivalry talk with Rishabh Pant, saying that the main focus is on the Indian team winning. Jurel has worked as the understudy for Pant in the Indian Test squad, but is making a case for a regular spot with his recent performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-matheus-cunha-manchester-united-brazil-call-ups-world-cup-2817976-2025-11-12",
      "headline": "Matheus Cunha considers Manchester United resurgence as Brazil call-ups reasonMatheus Cunha credits the recent Manchester United resurgence to his Brazil call-ups as the forward hopes to be a regular for the national team ahead of the 2026 World Cup. Cunha has played a big role in United's recent improved performances. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}