{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-end-in-red-metal-sector-slide-fii-outflows-2814663-2025-11-06",
      "headline": "Sensex, Nifty erase early gains to close lower, FII selling dampens marketThe S&P BSE Sensex lost 148.14 points to close at 83,311.01, while the NSE Nifty50 was down by 87.95 points to end at 25,509.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/pine-labs-ipo-opens-tomorrow-review-check-price-band-minimum-amount-gmp-details-2814655-2025-11-06",
      "headline": "Pine Labs IPO opens tomorrow for bidding: Check price band, GMP, other detailsPine Labs IPO involves the sale of 9.41 crore new shares aggregating to Rs 2,080 crore, while the offer for sale includes 8.23 crore shares worth Rs 1,819.91 crore, being sold by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-philanthropy-list-2025-shiv-nadar-tops-with-rs-2708-crore-check-others-2814643-2025-11-06",
      "headline": "Shiv Nadar tops Hurun Philanthropy List 2025. Here's who else made the top 10Shiv Nadar and family have retained the top spot for the fourth time in five years. The HCL founder donated Rs 2,708 crore in 2025, averaging Rs 7.4 crore per day, up 26% from last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-bpnl-buy-now-pay-later-a-lifesaver-or-a-debt-trap-the-hidden-side-of-easy-credit-explains-expert-2814617-2025-11-06",
      "headline": "Is BPNL a lifesaver or a debt trap? The hidden side of easy credit, explains expertBuy Now, Pay Later (BNPL) has made shopping feel easier than ever — no paperwork, no waiting, just buy now and pay in instalments. But beneath the convenience lies a growing concern: is it really a smart money tool or a slippery debt trap? Let's have a look."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/reliance-moves-to-sell-middle-east-crude-as-sanctions-reshape-trade-report-2814568-2025-11-06",
      "headline": "Reliance moves to sell Middle East crude as sanctions reshape trade: ReportThe company has reportedly offered grades such as Murban and Upper Zakum to both domestic and overseas buyers in recent days. While it is not yet clear how much crude Reliance is seeking to offload, the approach itself has caught the oil market's attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-icici-hdfc-to-sbi-personal-loan-interest-rates-across-7-top-banks-2814542-2025-11-06",
      "headline": "From ICICI, HDFC to SBI: Personal loan interest rates across 7 top banksIf you're planning to take a personal loan, comparing interest rates can save you a lot of money. Here's a quick look at what seven major banks, including SBI, ICICI, HDFC and Canara, are currently charging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-summoned-by-ed-for-second-time-in-rs-17000-crore-loan-fraud-case-asked-to-appear-on-november-14-2814537-2025-11-06",
      "headline": "ED summons Anil Ambani for second time on November 14 in loan fraud caseHe was earlier summoned and interrogated by the ED in August 2025 as part of the ongoing probe into alleged financial irregularities involving loans taken by his group companies from Indian banks, including the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-today-silver-market-outlook-wedding-season-safe-haven-demand-2814527-2025-11-06",
      "headline": "Gold, silver prices are rising again. Is there more upside left?On the Multi Commodity Exchange (MCX), December gold futures hovered around Rs 1.20 lakh per 10 grams through the morning session, rebounding slightly from levels seen earlier this week. Silver saw a bigger gain after recent weakness and was trading at around Rs 1.47 lakh per kg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/richest-candidates-bihar-elections-2025-highest-assets-politicians-affidavits-maximum-adr-report-2814511-2025-11-06",
      "headline": "Bihar Elections 2025: Who are the richest politicians contesting this time?Bihar, often seen as a political pulse point for national trends, is set for a two-phase election that will decide the leadership of a state rich in history and political influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pension-rules-clarified-how-does-your-last-working-day-impact-benefits-2814509-2025-11-06",
      "headline": "Pension rules clarified: How does your last working day impact benefits?Under the Central Civil Services (Pension) Rules, 2021, an employee's pension will now be calculated based on the rules that are active on their final day of service. This could be the day they retire, resign, are discharged from duty, or pass away — whichever happens first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambanis-reliance-group-faces-government-probe-what-we-know-so-far-2814478-2025-11-06",
      "headline": "Anil Ambani's Reliance Group faces government probe. What we know so farThe probe escalation follows aggressive enforcement actions by the ED. In the past week, the ED attached assets worth nearly Rs 7,500 crore in connection with alleged fund diversion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/mm-exits-rbl-bank-with-stake-sale-worth-rs-6780-crore-2814441-2025-11-06",
      "headline": "M&M exits RBL Bank with stake sale worth Rs 6,780 croreM&M had acquired the stake in 2023 when the private sector lender was going through a period of regulatory scrutiny and leadership changes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-share-price-q2-results-msci-inclusion-explained-2814433-2025-11-06",
      "headline": "Paytm shares jump 4% despite Q2 profit slip. Here's whyPaytm's profit fell, but stronger operations and MSCI inflows kept investors optimistic. The coming quarters will show if this momentum can last."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-280-points-higher-nifty-above-25600-asian-paints-up-3-percent-2814401-2025-11-06",
      "headline": "Sensex opens 280 points higher, Nifty above 25,600; Asian Paints up 3%The S&P BSE Sensex gained 202.50 points to 83,661.65, while the NSE Nifty50 added 27.55 points to 25,625.20 as of 9:31 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ipo-valuation-high-over-should-sebi-step-in-lenskart-primary-market-concern-inflated-value-public-listings-2814391-2025-11-06",
      "headline": "Should Sebi step in if IPO valuations are inflated?Experts say that while robust demand in IPOs reflects the growing maturity of India's equity market, the pattern of high valuations and subsequent weak listings suggests a need for more scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-allotment-status-out-today-latest-gmp-listing-gains-stock-market-debut-date-bse-mufg-2814371-2025-11-06",
      "headline": "Lenskart IPO allotment today: Here's how to check status and GMP before listingInvestors who applied for the Lenskart IPO can check their allotment status using either the BSE website or the registrar's porta,  MUFG Intime India Private Limited (formerly Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/more-trouble-for-anil-ambanis-reliance-group-corporate-affairs-ministry-launches-probe-into-fund-diversion-2813997-2025-11-05",
      "headline": "More trouble for Anil Ambani's Reliance Group as government launches probeMore trouble for Anil Ambani's Reliance Group, Corporate Affairs ministry launches probe into fund diversion"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-latest-gmp-falls-allotment-tomorrow-november-6-review-profit-or-loss-ahead-of-market-debut-2813996-2025-11-05",
      "headline": "Lenskart IPO GMP falls sharply before listing. Is it heading for a weak debut?Lenskart's IPO, which opened for subscription on October 31 and closed on November 4, received an overall subscription of 28.27 times, as per exchange data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-cpc-pay-commission-salary-pension-hike-what-to-know-2813989-2025-11-05",
      "headline": "8th Pay Commission: 5 things you need to knowThe 8th Pay Commission sets up a major revision in salaries and pensions. Here are key things you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/porter-layoff-job-cut-over-300-employees-startup-impact-it-logistics-sector-report-2813978-2025-11-05",
      "headline": "Porter layoffs: 300 employees impacted as startup trims workforce, says reportThe company confirmed the layoffs on Tuesday, saying the move was part of a broader effort to make the organisation more efficient and financially resilient."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-new-poster-out-after-thalapathy-vijay-cm-candidacy-announcement-2814662-2025-11-06",
      "headline": "Jana Nayagan's new poster out after Vijay's CM candidacy announcement The makers of Thalapathy Vijay's 'Jana Nayagan' unveiled a new poster, marking the start of promotions ahead of its January 9 Pongal release. The announcement came a day after TVC made Vijay's CM candidacy official. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-yami-gautam-film-haq-cleared-for-release-court-dismisses-plea-filed-by-shah-bano-daughter-2814642-2025-11-06",
      "headline": "Haq cleared for release, court dismisses plea filed by Shah Bano's daughter The court dismissed a plea filed by Shah Bano's daughter seeking to block the release of 'Haq', starring Emraan Hashmi-Yami Gautam. The court cited delay, lack of merit, and upheld censor certification, clearing its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ethan-hawke-and-the-feminine-art-of-love-in-reality-bites-and-before-sunrise-2814466-2025-11-06",
      "headline": "Ethan Hawke and the feminine art of love in Reality Bites and Before Sunrise On Ethan Hawke's 55th birthday, a glimpse into his on-screen quiet rebellion: the tender, delicate lover in a '90s sea of macho swagger and conventional romantic heroes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-shuts-down-reporter-salman-khan-question-at-his-film-event-2814633-2025-11-06",
      "headline": "Arbaaz Khan shuts down reporter's Salman Khan question at his film event At the recent trailer launch of his film, Arbaaz Khan asked reporters to focus on the film rather than his brother Salman Khan, highlighting the collaborative nature of the film industry and urging relevant questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kolkata-film-festival-215-films-from-39-nations-special-tribute-to-ritwik-ghatak-2814575-2025-11-06",
      "headline": "Kolkata Film Festival: 215 films from 39 nations, special tribute to Ritwik Ghatak The 31st Kolkata International Film Festival unites 39 countries under the theme 'Where Cinema Connects The World', featuring 215 films, a Poland Focus, and a special centenary tribute to cinema legend Ritwik Ghatak.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-shuts-down-rumours-around-ntr-neel-shares-transformation-pic-2814606-2025-11-06",
      "headline": "Jr NTR shuts down rumours around NTR Neel, shares new transformation pic Putting an end to the ongoing speculation surrounding his upcoming collaboration with Prashanth Neel, actor Jr NTR has shared a new picture with the director, confirming that the much-awaited project, tentatively titled 'NTR Neel', is very much on track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhumi-pednekar-aditya-thackeray-night-out-restaurant-mumbai-goes-viral-2814572-2025-11-06",
      "headline": "Bhumi Pednekar, Aditya Thackeray's night out in Mumbai goes viral. Watch Political and film circles buzzed after Aditya Thackeray and Bhumi Pednekar were recently seen leaving a Bandra restaurant together. Photos and videos from their outing have been widely shared on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-taj-story-questions-glorified-history-not-religion-director-tushar-goel-2814552-2025-11-06",
      "headline": "The Taj Story questions glorified history, not religion: Director Tushar Goel In an exclusive interview with IndiaToday.in, director Tushar Amrish Goel recently addressed the controversy surrounding his latest release 'The Taj Story'. He even spoke about how the film is a critique of the education system and not any particular religion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-actor-harish-rai-dies-stage-4-thyroid-cancer-2814565-2025-11-06",
      "headline": "KGF actor Harish Rai dies at 55 after year-long battle with cancer Veteran Kannada actor Harish Rai, who is popularly known for his role in Yash's 'KGF', died at the age of 55 at Kidwai Hospital in Bengaluru, according to reports. The actor was diagnosed with thyroid cancer and had been struggling with worsening health conditions for a while."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/artificial-intelligence-impact-kaun-banega-crorepati-host-amitabh-bachchan-concern-2814547-2025-11-06",
      "headline": "KBC 17: Amitabh Bachchan jokes AI might replace him as host In the latest episode of 'Kaun Banega Crorepati' 17, Amitabh Bachchan stated his concern that artificial intelligence is being used for many tasks and expressed fear of being replaced as host."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-59-easy-for-rebels-strong-players-potential-wasted-2814554-2025-11-06",
      "headline": "Bigg Boss Telugu 9 Day 59: Easy for rebels, strong players' potential wasted After a promising Day 58, 'Bigg Boss Telugu 9' returned with an episode that delivered more entertainment but less intensity. Though the fun quotient was slightly higher this time, the simple tasks and uneven challenges once again highlighted how the season continues to underuse its stronger contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-the-girlfriend-gets-ua-certificate-set-for-november-7-release-2814551-2025-11-06",
      "headline": "Rashmika Mandanna's The Girlfriend gets U/A certificate, set for November 7 release Rahul Ravindran's romantic drama 'The Girlfriend', starring Rashmika Mandanna and Dheekshith Shetty, has been granted a U/A certificate by the Central Board of Film Certification (CBFC). The film is set to release worldwide this Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-superman-drama-golden-globes-2814541-2025-11-06",
      "headline": "James Gunn's 'Superman' vies for serious drama categories at Golden Globes: Report Categories 'Superman' has been submitted for at the Globes include Best Motion Picture (Drama), Best Actor (Drama) for David Corenswet, Best Supporting Actress (Rachel Brosnahan) and Best Supporting Actor (Nicholas Hoult)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhuri-dixit-slammed-again-as-toronto-show-switches-from-dance-concert-to-meet-greet-2814529-2025-11-06",
      "headline": "Madhuri Dixit slammed again as show switches from dance concert to meet-greet Fans expressed disappointment over Madhuri Dixit's revised tour format after the Toronto event, as organisers and management share differing views on the event's delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-the-challenge-season-2-safe-thrills-nostalgia-prize-review-2814521-2025-11-06",
      "headline": "Squid Game The Challenge 2 review: All play no peril but still addictively funRelease Date:Tue Nov 04, 2025 'Squid Game: The Challenge season 2' returns with a massive prize and familiar games. The show blends nostalgia with safe competition, appealing strongly to Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/miss-piggy-movie-jennifer-lawrence-emma-stone-cole-escola-2814525-2025-11-06",
      "headline": "Jennifer Lawrence, Emma Stone team up for Miss Piggy film: All you need to know Actor Jennifer Lawrence has revealed that she and Emma Stone are producing a new 'Miss Piggy' movie, with Tony-winning Cole Escola writing the script for Disney."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-defends-gen-z-gets-trolled-by-twinkle-khanna-and-farah-khan-two-much-2814504-2025-11-06",
      "headline": "Ananya Panday defends Gen Z, gets trolled by Twinkle Khanna and Farah Khan A recent episode of 'Two Much' saw Ananya Panday defend Gen Z's emphasis on mental health, prompting Twinkle Khanna, Farah Khan, and Kajol to tease her while debating social media's growing influence on casting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dies-irae-horror-film-crosses-50-crore-worldwide-pranav-mohanlal-2814503-2025-11-06",
      "headline": "Pranav Mohanlal's horror film Dies Irae crosses Rs 50 crore worldwide in one week Director Rahul Sadasivan's latest horror film, featuring Pranav Mohanlal, achieves major commercial success and receives positive reviews from audiences and critics alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kaantha-trailer-dulquer-salmaan-returns-with-another-intense-period-drama-2814502-2025-11-06",
      "headline": "Kaantha trailer: Dulquer Salmaan returns with another intense period drama Actor Dulquer Salmaan, known for his affinity for period dramas, is back with another intense story, 'Kaantha'. Co-starring Samuthirakani and Bhagyashri Borse, the film's trailer has been released and has already impressed audiences with its scale and emotional depth."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bihar-deputy-chief-minister-vijay-sinhas-convoy-attacked-on-day-of-polling-stones-thrown-bjp-blames-rjd-2814583-2025-11-06",
      "headline": "Bihar Deputy Chief Minister's convoy attacked, stones thrown; poll body respondsOn polling day in Lakhisarai, unidentified men attacked Deputy Chief Minister Vijay Kumar Sinha's convoy with stones and slippers. The BJP leader accused RJD supporters of blocking his visit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-india-pakistan-conflict-number-of-fighter-jets-shot-down-2814414-2025-11-06",
      "headline": "Trump has a new number for aircraft shot down in India-Pakistan conflictTrump has once again revised his count of jets downed during the three-day India-Pakistan hostilities in May. This, of course, while once again reminding the world of how he played the peacemaker."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pok-pakistan-occupied-kashmir-genz-student-protests-violence-shehbaz-sharif-government-2814577-2025-11-06",
      "headline": "POK on boil again? Gen Z takes to streets against Pak governmentPOK protests: What began as a peaceful demonstration by students against rising fees and the evaluation process has snowballed into broader protests against the Shehbaz Sharif-led government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-live-score-4th-t20i-today-match-updates-gold-coast-2814522-2025-11-06",
      "headline": "4th T20I live: Axar lifts visitors to fighting total of 167 runsIndia (IND) vs Australia (AUS) live score 4th T20I updates from Gold Coast: After losing a string of wickets in the middle overs, India have just about managed to reach a fighting total. Axar Patel's cameo at the end helps the team to reach a total of 167 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twinkle-khanna-says-older-people-hide-it-better-after-her-viral-cheating-remark-on-two-much-with-kajol-and-twinkle-2814486-2025-11-06",
      "headline": "Older people hide it better, says Twinkle Khanna after her viral cheating remarkTwinkle Khanna and Kajol's talk show sparked lively debate as Ananya Panday and Farah Khan joined to discuss modern relationships, affairs, and infidelity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/dismembered-womans-body-found-noida-drain-police-investigate-murder-identity-2814564-2025-11-06",
      "headline": "Woman's body found in drain in posh Noida locality, head, hands chopped offAuthorities in Noida's Sector 108 discovered a woman's dismembered body in a drain, prompting a police investigation to identify the victim. The incident has led to heightened security and forensic efforts as officials search for clues and examine local CCTV footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brazilian-model-larissa-rahul-gandhi-vote-chori-presser-photo-taken-from-stock-image-2814372-2025-11-06",
      "headline": "Larissa, Brazilian model linked to Rahul Gandhi's vote chori charge, speaks outOn the eve of the high-stakes Bihar Assembly polls, Congress MP Rahul Gandhi made fresh allegations, claiming that the 2024 Haryana Assembly elections were \"stolen\" and rigged in favour of the BJP."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-attaches-assets-of-ex-cricketers-suresh-raina-shikhar-dhawan-in-betting-linked-money-laundering-case-2814665-2025-11-06",
      "headline": "ED attaches assets of Suresh Raina, Shikhar Dhawan in Rs 1,000 crore betting caseED attaches assets of ex-cricketers Suresh Raina, Shikhar Dhawan in betting-linked money-laundering case"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/as-a-gut-specialist-doctor-this-is-what-i-think-bloating-really-means-2814061-2025-11-06",
      "headline": "As a gut specialist, this is what I think bloating says about your healthGastrointestinal distress should not be ignored. When identified and managed early, they can make all the difference in preventing serious complications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-2025-phase-1-voter-turnout-tejashwi-yadav-tej-pratap-maithili-thakur-2814156-2025-11-06",
      "headline": "53.7% voting in Bihar until 3 pm; attack on deputy CM sparks RJD vs BJP slugfest Live UpdatesBihar election 2025: Polling is underway in 121 assembly constituencies spread across 18 districts in the first phase. In 2020, the Mahagathbandhan, led by the RJD, had the upper hand in these constituencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/travel-influencer-anunay-sood-dies-his-family-announces-on-social-media-2814438-2025-11-06",
      "headline": "Dubai-based travel influencer Anunay Sood, with 1.4 million followers, diesDubai-based travel influencer Anunay Sood has passed away, as confirmed by his family on Instagram. The family has asked fans to respect their privacy and avoid gathering near their home during this difficult time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/but-butt-breathing-is-science-backed-and-could-save-people-with-lung-failure-2812761-2025-11-04",
      "headline": "Yes, 'butt breathing' is real, and scientists think it could save livesThe idea sounds absurd, even gross to some, but researchers in Japan say 'butt breathing' could help patients with severe lung failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-election-2025-nda-bjp-160-seat-target-nitish-kumar-challenges-like-lok-sabha-400-paar-slogan-explained-2814558-2025-11-06",
      "headline": "Why NDA's 160 paar in Bihar is as tough as 400 paarThe NDA's 160-seat target in Bihar is as ambitious as the 400 Paar slogan in the 2024 Lok Sabha election. It might become a high-wire act for the NDA, over caste divides, anti-incumbency, and a rising third force of Prashant Kishor's Jan Suraaj. With the youth, women, and first-time voters holding the balance, even a small slip could turn a projected sweep into a setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhumi-pednekar-aditya-thackeray-night-out-restaurant-mumbai-goes-viral-2814572-2025-11-06",
      "headline": "Bhumi Pednekar, Aditya Thackeray's night out in Mumbai goes viral. WatchPolitical and film circles buzzed after Aditya Thackeray and Bhumi Pednekar were recently seen leaving a Bandra restaurant together. Photos and videos from their outing have been widely shared on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-minister-blames-former-spy-agency-chief-for-taliban-policy-backfire-2814035-2025-11-05",
      "headline": "Cup of tea cost us the most: Pak minister blames ex-ISI chief for Taliban crisisPakistani Foreign Minister Ishaq Dar has said then ISI chief Faiz Hameed's \"cup of tea\" with the Taliban in Kabul in 2021 cost Pakistan the most, reopening borders to thousands of militants from Afghanistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-secret-message-roi-roi-binale-film-show-victor-banerjee-moran-blind-school-assam-dibrugarh-2814470-2025-11-06",
      "headline": "Zubeen Garg's hidden message through Victor in last filmThere are several real-life overlaps in Zubeen Garg's last film Roi Roi Binale. Zubeen, known for loud protests and quiet promotions, roped in veteran actor Victor Banerjee to play Victor, the teacher who transforms the world of the blind singer played by him. In real life, Banerjee runs a beautiful school for the blind, which is tucked away in a corner of Assam. Was Zubeen, who is known for his charity, trying to send out a message?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-revokes-80000-non-immigrant-visas-student-work-trump-warns-against-support-palestine-israel-deportation-2814588-2025-11-06",
      "headline": "US revokes 80,000 student, work visas. This is what not to doSince taking office in January, the Donald Trump administration has revoked around 80,000 non-immigrant visas, including approximately 8,000 student visas. Offences such as DUI, assault, and theft accounted for nearly half of the cancellations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-story-of-nehru-tryst-with-destiny-speech-quotes-by-mamdani-2814651-2025-11-06",
      "headline": "The story of Nehru's 'Tryst with Destiny' speech quoted by Mamdani India's independence was not only marked by the stroke of midnight but also by the birth of one of history's most iconic speeches that was crafted in crisis, and refined by chance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jeff-bezoss-new-glenn-rocket-to-launch-escapade-to-mars-then-return-to-earth-2814648-2025-11-06",
      "headline": "Bezos's New Glenn rocket set for Mars launch then come back to EarthThe Escapade mission is a Nasa initiative to study Mars' magnetosphere and space weather environment, an essential step for future human exploration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/andaman-express-passenger-beaten-sticks-rs-130-meal-price-dispute-railways-reacts-jhansi-train-video-viral-2814458-2025-11-06",
      "headline": "Passenger beaten with sticks after meal price dispute on Jhansi train. Railways reactsThe passenger, identified as Nihaal, was allegedly assaulted in the Andaman Express after he objected to being charged Rs 130 for a vegetarian meal that he said was overpriced. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/study-and-work-abroad-just-got-tougher-in-these-countries-2814474-2025-11-06",
      "headline": "Study and work abroad just got tougher in these countries. Here's whyThe US, UK, Sweden, Canada and Australia have rolled out sweeping immigration restrictions, from steep visa fees to salary thresholds and student-visa cuts. These changes reshape study-abroad and work pathways for international talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-indian-womens-team-harleen-deol-2814437-2025-11-06",
      "headline": "Harleen Deol asks PM Modi about his skincare routine, leaves team in splitsIndia women's team met Prime Minister Narendra Modi on November 4. During the meeting, Harleen Deol asked the PM about his skincare routine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-coconuts-production-drop-price-hike-climate-change-oil-tamil-nadu-crisis-2814426-2025-11-06",
      "headline": "Why Kerala's coconuts are disappearingKerala, historically known for its coconut-rich landscape, is witnessing a steep fall in coconut production due to climate shifts, labour shortages and land conversion, pushing prices up and increasing dependence on neighbouring states. Can the state protect its coconut identity?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-trailer-launch-amitabh-bachchan-narrates-war-drama-2814656-2025-11-06",
      "headline": "120 Bahadur trailer: Farhan Akhtar leads powerful war drama on Battle of Rezang LaThe trailer of '120 Bahadur', a war drama featuring Farhan Akhtar, was unveiled in Mumbai today. The film honours India's soldiers and is set to release on November 21, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-new-poster-out-after-thalapathy-vijay-cm-candidacy-announcement-2814662-2025-11-06",
      "headline": "Jana Nayagan's new poster out after Vijay's CM candidacy announcementThe makers of Thalapathy Vijay's 'Jana Nayagan' unveiled a new poster, marking the start of promotions ahead of its January 9 Pongal release. The announcement came a day after TVK made Vijay's CM candidacy official. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-injury-update-ashes-2814661-2025-11-06",
      "headline": "Cummins set for Test return in 2nd Ashes Test as injury concerns loom Australia captain Pat Cummins is set to return to Test cricket in the 2nd Ashes Test. Cummins has however said that he might not play all matches after that."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ryan-williams-indian-football-team-oci-player-probable-squad-vs-bangladesh-reports-2814625-2025-11-06",
      "headline": "AIFF pulls big surprise, calls up two Indian-origin players to India camp: Reports The AIFF has taken its first real step toward widening India's player pool by inviting Ryan Williams and Abneet Bharti to the national camp. Their inclusion signals the federation's growing commitment to bringing Indian-origin talent into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-tata-motors-tata-sierra-suvs-gift-india-womens-cricket-team-2814613-2025-11-06",
      "headline": "Tata Motors to gift new Sierra SUV to Women's World Cup-winning Indian team Women's World Cup 2025: Tata Motors announced on Thursday that the soon-to-be-launched Tata Sierra SUV will be gifted to each member of the winning team. India defeated South Africa in the final to clinch the title on Sunday, November 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-glenn-maxwell-back-for-4th-t20i-sanju-samson-warms-bench-2814559-2025-11-06",
      "headline": "AUS vs IND: Maxwell back for 4th T20I, Sanju Samson continues to warm bench Glenn Maxwell has made a comeback to the Australia T20I side for the fourth match against India. On the other hand, Sanju Samson continued to warm the bench as India named an unchanged playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-injury-sidelines-australia-captain-from-sydney-sixers-wbbl-11-opener-2814535-2025-11-06",
      "headline": "Alyssa Healy out of WBBL opener with thumb injury Sydney Sixers will begin their WBBL season 11 without captain Alyssa Healy, who has been sidelined due to a right thumb injury suffered during the ODI World Cup semi-final against India. Healy's absence marks another frustrating setback for the Sixers, who will monitor her recovery in hopes of an early return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-new-coach-wpl-2026-2814526-2025-11-06",
      "headline": "RCB appoint new head coach: Malolan Rangarajan takes over from Luke Williams Royal Challengers Bengaluru have appointed Malolan Rangarajan as their head coach ahead of the 2026 season. Rangarajan was the deputy of WPL winning coach Luke Williams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-live-score-4th-t20i-today-match-updates-gold-coast-2814522-2025-11-06",
      "headline": "4th T20I live: Axar lifts visitors to fighting total of 167 runs India (IND) vs Australia (AUS) live score 4th T20I updates from Gold Coast: After losing a string of wickets in the middle overs, India have just about managed to reach a fighting total. Axar Patel's cameo at the end helps the team to reach a total of 167 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pm-modi-india-womens-world-cup-champions-meet-new-delhi-harmanpreet-smriti-mandhana-2814467-2025-11-06",
      "headline": "Watch: PM Modi praises India's World Cup queens for ushering a new era in sports Women's World Cup: Prime Minister Narendra Modi praised the Indian women's cricket team for their remarkable comeback. He said their World Cup win, after three straight defeats, showed true strength, resilience, and the spirit of new India in sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-message-indian-womens-team-go-to-schools-2814454-2025-11-06",
      "headline": "PM's message to women's team: Go to your schools, inspire the next generation Prime Minister Narendra Modi met the Indian women's cricket team in New Delhi. Modi shared a powerful message with the team, and asked them to play a key role in inspiring the next generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-injury-sidelines-australia-captain-from-sydney-sixers-wbbl-11-opener-2814535-2025-11-06",
      "headline": "Alyssa Healy out of WBBL opener with thumb injury Sydney Sixers will begin their WBBL season 11 without captain Alyssa Healy, who has been sidelined due to a right thumb injury suffered during the ODI World Cup semi-final against India. Healy's absence marks another frustrating setback for the Sixers, who will monitor her recovery in hopes of an early return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-new-coach-wpl-2026-2814526-2025-11-06",
      "headline": "RCB appoint new head coach: Malolan Rangarajan takes over from Luke Williams Royal Challengers Bengaluru have appointed Malolan Rangarajan as their head coach ahead of the 2026 season. Rangarajan was the deputy of WPL winning coach Luke Williams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-live-score-4th-t20i-today-match-updates-gold-coast-2814522-2025-11-06",
      "headline": "4th T20I live: Axar lifts visitors to fighting total of 167 runs India (IND) vs Australia (AUS) live score 4th T20I updates from Gold Coast: After losing a string of wickets in the middle overs, India have just about managed to reach a fighting total. Axar Patel's cameo at the end helps the team to reach a total of 167 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pm-modi-india-womens-world-cup-champions-meet-new-delhi-harmanpreet-smriti-mandhana-2814467-2025-11-06",
      "headline": "Watch: PM Modi praises India's World Cup queens for ushering a new era in sports Women's World Cup: Prime Minister Narendra Modi praised the Indian women's cricket team for their remarkable comeback. He said their World Cup win, after three straight defeats, showed true strength, resilience, and the spirit of new India in sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-message-indian-womens-team-go-to-schools-2814454-2025-11-06",
      "headline": "PM's message to women's team: Go to your schools, inspire the next generation Prime Minister Narendra Modi met the Indian women's cricket team in New Delhi. Modi shared a powerful message with the team, and asked them to play a key role in inspiring the next generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-pm-modi-womens-world-cup-final-match-ball-pocket-real-reason-2814455-2025-11-06",
      "headline": "Harmanpreet Kaur tells PM Modi why she pocketed the match ball after World Cup winWhen PM Modi asked Harmanpreet Kaur why she kept the match ball, her answer was simple — it was a piece of history she wanted to hold on to after India's first Women's World Cup win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/pm-modis-pep-talk-to-indias-world-cup-winning-women-cricketers-ytvd-2814440-2025-11-06",
      "headline": "PM Modi's Pep Talk To India's World Cup-Winning Women CricketersThis special report focuses on Prime Minister Narendra Modi's recent interaction with the Indian women's cricket team following their historic World Cup victory. The news bulletin highlighted what was described as 'a very, very interesting and a fun conversation with our champions of the women Indian cricket team that has won the World Cup.' On November 5, 2025, the Prime Minister hosted the triumphant team at his residence, lauding their resilience and remarkable comeback during the tournament. Captain Harmanpreet Kaur and Vice-captain Smriti Mandhana shared how the PM's words have been a source of motivation. The interaction also touched upon the team's journey, with the Prime Minister urging the players to promote the Fit India movement. The report also references the first phase of polling for the Bihar Assembly elections, which commenced on November 6, 2025, for 121 seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-indian-womens-team-harleen-deol-2814437-2025-11-06",
      "headline": "Harleen Deol asks PM Modi about his skincare routine, leaves team in splitsIndia women's team met Prime Minister Narendra Modi on November 4. During the meeting, Harleen Deol asked the PM about his skincare routine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-4th-t20i-preview-pitch-report-weather-update-2814406-2025-11-06",
      "headline": "4th T20I: Shubman Gill faces the heat as India eye series lead in Gold CoastIND vs AUS, 4th T20I preview: Gold Coast will host the Indian men's team for the first time as the 20,000-seater Carrara Oval gears up for the crucial fixture. All eyes on Shubman Gill as pressure mounts on the misfiring opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-barcelona-defence-problems-club-brugge-2814398-2025-11-06",
      "headline": "Ferran hits out after Club Brugge tears down Barcelona defence in 3-3 drawFC Barcelona had to make a comeback three times to secure a 3-3 draw against Club Brugge in the Champions League. Their defensive frailties were exposed once again this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-t20i-weather-prediction-queensland-half-million-lightning-hailstorm-2814400-2025-11-06",
      "headline": "Queensland hit by half a million lightning strikes: Will 4th T20I even be played?After Queensland was battered by nearly half a million lightning strikes and massive hailstorms, the skies have finally cleared. As calm returns, India and Australia gear up for a crucial 4th T20I under the Gold Coast lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-retentions-mumbai-indians-delhi-capitals-auction-2814363-2025-11-06",
      "headline": "WPL 2026 Retention Review: UP opt complete rejig, MI make tough sacrificesWomen's Premier Retention: The five franchises have announced their list of the retained and released players going into the auction scheduled to take place on November 27 in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-coach-slams-selectors-india-vs-south-africa-test-snub-2814290-2025-11-06",
      "headline": "Mohammed Shami will make an India comeback that will silence everyone: CoachMohammed Shami's childhood coach, Mohammed Badruddin, claimed that the pacer would silence everyone with a sensational comeback to the Indian team. Shami was once again snubbed from selection for the India vs South Africa Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-barcelona-defence-problems-club-brugge-2814398-2025-11-06",
      "headline": "Ferran hits out after Club Brugge tears down Barcelona defence in 3-3 drawFC Barcelona had to make a comeback three times to secure a 3-3 draw against Club Brugge in the Champions League. Their defensive frailties were exposed once again this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-t20i-weather-prediction-queensland-half-million-lightning-hailstorm-2814400-2025-11-06",
      "headline": "Queensland hit by half a million lightning strikes: Will 4th T20I even be played?After Queensland was battered by nearly half a million lightning strikes and massive hailstorms, the skies have finally cleared. As calm returns, India and Australia gear up for a crucial 4th T20I under the Gold Coast lights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-retentions-mumbai-indians-delhi-capitals-auction-2814363-2025-11-06",
      "headline": "WPL 2026 Retention Review: UP opt complete rejig, MI make tough sacrificesWomen's Premier Retention: The five franchises have announced their list of the retained and released players going into the auction scheduled to take place on November 27 in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-coach-slams-selectors-india-vs-south-africa-test-snub-2814290-2025-11-06",
      "headline": "Mohammed Shami will make an India comeback that will silence everyone: CoachMohammed Shami's childhood coach, Mohammed Badruddin, claimed that the pacer would silence everyone with a sensational comeback to the Indian team. Shami was once again snubbed from selection for the India vs South Africa Test series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-icc-womens-world-cup-drs-kapil-dev-harmanpreet-kaur-2814341-2025-11-06",
      "headline": "DRS: Is India's Women's World Cup win comparable to Kapil Dev's 1983 triumph?India's victory in the Women's World Cup — their maiden ICC title after three heartbreaks in previous finals — marks a historic milestone. But the question remains: can this triumph be compared to the iconic 1983 moment, when Kapil Dev's men stunned the mighty West Indies to win the Men's ODI World Cup at the legendary Lord's Cricket Ground?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dabang-delhi-kc-clinches-pro-kabaddi-league-season-12-title-home-win-2814299-2025-11-05",
      "headline": "Pro Kabaddi League: Season 12 becomes a record-breaking campaign for all teamsThe Pro Kabaddi League season 12 saw many new records being set by players and teams as it was the most-competitive campaign in the tournament's history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-royal-challengers-bengaluru-sale-diageo-ownership-review-2814309-2025-11-05",
      "headline": "RCB put on sale, new owners expected to be announced before March 31, 2026The Royal Challengers Bengaluru has been officially put for sale with Diageo hoping to find new owners for the franchise before March 31, 2026. The process for the sale has already started. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-retentions-deepti-sharma-meg-lanning-released-auction-2814271-2025-11-05",
      "headline": "WPL 2026 retentions: World Cup star Deepti Sharma among players reportedly releasedWorld Cup star Deepti Sharma and Meg Lanning are among the players that have been reportedly released by their franchises ahead of the WPL 2026 auction. UP Warriorz have gone for a full reset with Deepti's release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-meets-womens-team-amanjot-catch-harmanpreet-full-circle-2814260-2025-11-05",
      "headline": "PM Modi recalls Amanjot's World Cup final catch, clears Harmanpreet Kaur's doubtPrime Minister Narendra Modi hosted the World Cup-winning Indian women's cricket team in Delhi, praising their resilience and recalling key moments from the final, including Amanjot Kaur's juggling catch that shifted the game in India's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-womens-cricket-team-gifts-signed-namo-1-jersey-pm-modi-world-cup-2025-2814249-2025-11-05",
      "headline": "Namo 1: Harmanpreet Kaur, team India gift special signed jersey to PM ModiThe Women's World Cup-winning Indian team had a special gift for Prime Minister Narendra Modi as they met him at his official residence in New Delhi on Wednesday, November 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-modi-womens-world-cup-champions-residence-new-delhi-2814238-2025-11-05",
      "headline": "PM Modi felicitates Women's World Cup champions at his residence in New Delhi Prime Minister Narendra Modi hosted the Women's World Cup-winning Indian cricket team at his residence in New Delhi, congratulating Harmanpreet Kaur and her squad for their historic triumph over South Africa. The champions received a grand welcome in Delhi after ending India's long wait for a World Cup title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/richa-ghosh-honoured-cab-gold-bat-ball-womens-world-cup-2814229-2025-11-05",
      "headline": "Richa Ghosh to be honoured by CAB after Women's World Cup heroicsRicha Ghosh will be felicitated by the Cricket Association of Bengal with a gold-plated bat and ball at Eden Gardens for her stellar World Cup performance, where she played a key role in India's title win."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}