{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zoho-ceo-sridhar-vembu-calls-ai-impact-on-jobs-small-2716280-2025-04-28",
      "headline": "Zoho CEO Sridhar Vembu calls AI's impact on jobs 'small'Vembu pointed out that while AI vendors are promising big changes, real-world studies, including one titled 'Large Language Models, Small Labor Market Effects', show a different picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-1000-points-higher-nifty-above-24300-ril-up-5-percent-2716276-2025-04-28",
      "headline": "Sensex, Nifty surge over 1% as Reliance rally and FII buying lift marketsThe S&P BSE Sensex jumped over 1,000 points to close at 80,218.37, while the NSE Nifty50 gained 289.15 points to end at 24,328.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-trade-war-recession-fears-impact-threat-economists-2716271-2025-04-28",
      "headline": "Trump's tariffs are raising recession fears. How bad could it get?Just three months ago, economists covering nearly 50 economies had forecast a steady, healthy pace of global growth. But Trump's decision to slap sweeping tariffs, including a 10% blanket duty on all US imports and a 145% tariff on goods from China, has upset those expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-falling-why-reasons-us-dollar-strong-trade-relation-china-what-to-expect-2716269-2025-04-28",
      "headline": "Gold prices continue falling: What is driving the prices low?Gold is often seen as a safe place to store value during times of political and financial uncertainty. It touched an all-time high of $3,500.05 per ounce last week because of trade tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-regime-why-it-is-more-beneficial-for-salaried-employees-itr-filing-2025-standard-deduction-rs-75000-2716216-2025-04-28",
      "headline": "New Income tax regime: Why is it more beneficial for salaried employeesThe new tax regime also offers a higher standard deduction. Last year, it was raised from Rs 50,000 to Rs 75,000 for salaried employees. In the old regime, the standard deduction remains at Rs 50,000. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-rally-10-percent-indo-pak-tensions-rise-which-shares-should-you-buy-grse-hal-bel-paras-2716212-2025-04-28",
      "headline": "Defence stocks rally up to 10% as Indo-Pak tensions rise. Should you buy?The Nifty Defence index rose by 4.5%, marking its biggest intraday gain since April 15, 2025. Out of the eighteen companies that form the index, seventeen were trading higher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-simplifies-pf-transfer-process-updates-form-15-check-how-it-impacts-employees-2716166-2025-04-28",
      "headline": "EPFO simplifies PF transfer process. Check how it impacts employeesThe new revision is expected to benefit over 1.25 crore members and will speed up the transfer of Rs 90,000 crore of PF funds annually, ensuring that employees can access and manage their retirement savings without any trouble after changing jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-ticks-up-volatility-expectations-climb-to-two-year-peak-2716133-2025-04-28",
      "headline": "Rupee ticks up, volatility expectations climb to two-year peakThe rupee was at 85.26 against the US dollar as of 11:00 am, up from its close at 85.45 in the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-form-16-getting-a-makeover-heres-all-you-need-to-know-2716130-2025-04-28",
      "headline": "ITR Filing 2025: What's new in your Form 16? Here's all you need to knowForm 16 is a certificate that an employer gives to an employee, which shows how much salary he earned and how much tax they deducted from it on the employee's behalf. It's proof that your taxes have been properly paid to the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-airspace-close-india-flights-huge-loss-millions-overflight-fees-reroute-pahalgam-attack-2716107-2025-04-28",
      "headline": "Explained: How Pakistan could lose millions after closing airspace for IndiaPakistan's decision to close its airspace to Indian airlines, after India's diplomatic move against Pakistan over the Pahalgam terror attack, is likely to cause disruptions on several key international routes, particularly flights departing from North India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-subcribe-or-not-latest-gmp-brokerage-views-price-band-allotment-date-2716104-2025-04-28",
      "headline": "Ather Energy IPO: Should you subscribe or not?Ather Energy IPO: The IPO is a book-built offer worth Rs 2,980.76 crore, comprising a fresh issue of 8.18 crore equity shares valued at Rs 2,626.30 crore and an offer for sale (OFS) of 1.11 crore shares aggregating Rs 354.76 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-sensex-nifty-rising-today-check-top-factors-dalal-street-rally-2716082-2025-04-28",
      "headline": "Sensex jumps over 1,000 points. 3 reasons behind today's stock market rallyStock market today: At around 12:20 pm, the S&P BSE Sensex was trading 1008.25 points higher at 80,220.78, while the NSE Nifty50 rose 239.90 points to 24,279.05., while the NSE Nifty50 rose 237.10 points to 24,276.45. All broader market indices were also firmly in positive territory, signalling the potential for a strong session ahead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/seema-pahwa-hints-at-quitting-films-the-condition-is-very-bad-2716274-2025-04-28",
      "headline": "Actor Seema Pahwa hints at quitting films: The condition is very badActor Seema Pahwa hinted at quitting films. She mentioned how creative people have been murdered. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-release-date-amol-parashar-leads-tvf-series-on-rural-healthcare-2716235-2025-04-28",
      "headline": "Gram Chikitsalay release date out: Amol Parashar leads series on rural healthcarePrime Video's new series 'Gram Chikitsalay', starring Amol Parashar, is set to premiere on May 9, 2025. The series, created by Deepak Kumar Mishra, promises a blend of humour and social commentary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/who-is-neha-singh-rathore-bhojpuri-singer-facing-sedition-for-kashmir-attack-posts-2716250-2025-04-28",
      "headline": "Who is Neha Singh Rathore, Bhojpuri singer facing sedition for Kashmir attack postsPopular singer Neha Singh Rathore is facing a sedition case over her statements about the Pahalgam terror attack. The complainant claimed that she made provocative posts targeting a religious community. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/subham-trailer-samantha-first-production-is-a-horror-comedy-with-a-comic-twist-2716215-2025-04-28",
      "headline": "Subham trailer: Samantha's first production is a horror-comedy with a comic twistThe trailer of 'Subham', Samantha's debut production, is out. The horror-comedy features the actor in a hilarious cameo and will release on May 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/makarand-deshpande-aaditi-pohankar-leads-peaceful-protest-against-pahalgam-terror-attack-2716198-2025-04-28",
      "headline": "Actor Makarand Deshpande leads peaceful protest against Pahalgam attackVeteran actor Makarand Deshpande led peaceful protest in Mumbai against the Pahalgam terror attack in a bid to extend his support to the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hania-aamir-gives-shoutout-to-badshah-amid-growing-india-pakistan-tensions-2716179-2025-04-28",
      "headline": "Hania Aamir gives shoutout to Badshah amid growing India-Pakistan tensionsPakistani actor Hania Aamir cheered for her close friend and rapper Badshah for his upcoming track. It was also rumoured that the two were dating each other. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-accuses-national-award-of-corruption-lobbying-it-is-all-a-game-2716174-2025-04-28",
      "headline": "Paresh Rawal accuses National Award of 'corruption, lobbying': It's all a gameActor Paresh Rawal opened up about the National Awards and shared that it is driven by 'aggressive lobbying'. The veteran actor added that he was made aware of lobbying and corruption when his film 'Sir' (1993) won the National Award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-shoaib-ibrahim-responds-to-backlash-over-kashmir-vlog-post-after-attack-2716164-2025-04-28",
      "headline": "Actor Shoaib Ibrahim responds to backlash over 'Kashmir vlog' post after attackTelevision actor Shoaib Ibrahim responded to criticism for sharing a vlog amid the Pahalgam terror attack, clarifying that he never meant to hurt anyone's sentiments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-sreenath-bhasi-appear-before-excise-officials-hybrid-ganja-case-khalid-rahman-2716170-2025-04-28",
      "headline": "Malayalam actors Shine Tom Chacko, Sreenath Bhasi questioned in hybrid ganja caseMalayalam actors Shine Tom Chacko and Sreenath Bhasi were questioned by Kerala Excise officials. This follows a drug bust involving hybrid ganja worth Rs 2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rupert-grint-welcomes-second-child-with-wife-georgia-2716151-2025-04-28",
      "headline": "Harry Potter star Rupert Grint welcomes second child with wife Georgia'Harry Potter' actor Rupert Grint announced the birth of his second child, a girl, via Instagram. He and his longtime partner, Georgia Groome, named their newborn daughter Goldie G Grint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-delhi-groom-cancelling-wedding-after-dj-plays-channa-mereya-2716128-2025-04-28",
      "headline": "KJo reacts to Delhi groom cancelling wedding after DJ plays Channa MereyaFilmmaker Karan Johar recently reacted to a Delhi groom who called off wedding after the DJ played 'Channa Mereya'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-at-ex-wife-reena-duttas-house-with-girlfriend-gauri-son-junaid-2716127-2025-04-28",
      "headline": "Aamir Khan meets ex-wife Reena Dutta with partner Gauri, son JunaidActor Aamir Khan visited his former wife Reena Dutta's residence on Sunday. He was accompanied by his girlfriend Gauri Spratt and son Junaid.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-big-shot-uk-tour-postponed-after-pahalgam-attack-2716109-2025-04-28",
      "headline": "Salman Khan's Big Shot UK Tour postponed after Pahalgam attackThe Bollywood Big Shot UK Tour, featuring major stars like Salman Khan, Madhuri Dixit, and Tiger Shroff, has been postponed in light of the recent India-Pakistan tensions. Organisers have assured that new dates will be announced soon, and refunds will be provided in the meantime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-padma-bhushan-presentation-ceremony-in-new-delhi-family-arrival-2716092-2025-04-28",
      "headline": "Ajith Kumar and family arrive in Delhi for Padma Awards ceremony. WatchAjith Kumar, his wife Shalini, daughter Anoushka and son, Aadvik, were seen heading to New Delhi. The actor will receive his Padma Bhushan award on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-delhi-show-cancelled-new-schedule-to-be-finalised-soon-2716080-2025-04-28",
      "headline": "Kevin Hart's Delhi show cancelled due to Pahalgam attack, new date to be outComedian Kevin Hart's show in Delhi, scheduled for April 30, has been cancelled. The organisers are in talks with Hart's team for a new schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ground-zero-box-office-collection-day-3-detailed-report-emraan-hashmi-kashmir-based-film-fails-to-pick-pace-2716071-2025-04-28",
      "headline": "Ground Zero box office Day 3: Emraan Hashmi's Kashmir-based film fails to pick pace'Ground Zero' clashed with 'Kesari Chapter 2', 'Jaat' and 'Phule' at the box office, and that eventually suppressed its run. The Emraan Hashmi starrer didn't manage to attract the audience to theatres in its opening weekend. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-greets-staff-at-mumbai-airport-video-goes-viral-2716065-2025-04-28",
      "headline": "Shah Rukh Khan greets long-time staff at Mumbai airport, video goes viralShah Rukh Khan arrived in Mumbai with his manager, Pooja Dadlani. The 'Jawan' actor shook hands with a man who had been his staff for 22 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-to-slap-aurangzeb-shares-solution-to-kashmir-issue-2716059-2025-04-28",
      "headline": "Vijay Deverakonda wants to 'slap Aurangzeb', shares solution to Kashmir issueActor Vijay Deverakonda says he would like to go back in time and slap Aurangzeb. He also thinks that educating the people of Kashmir is a solution to the terrorism problem in the Valley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-chapter-2-box-office-collection-day-10-detailed-report-akshay-kumar-film-shows-terrific-growth-in-2nd-weekend-2716053-2025-04-28",
      "headline": "Kesari 2 box office Day 10: Akshay Kumar's film shows terrific growth in 2nd weekend'Kesari Chapter 2' beat all other new releases during the weekend at the box office. The film collected more than what 'Ground Zero' and 'Jaat' earned. It is now looking at unlocking a new potential at the ticket window. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-mallikarjun-kharge-upset-congress-leaders-controversial-remarks-pahalgam-attack-2716273-2025-04-28",
      "headline": "They speak for themselves: Congress distances itself from leaders' Pahalgam remarksSources told India Today TV that Leader of Opposition in Lok Sabha, Rahul Gandhi, and Congress president Mallikarjun Kharge are upset with leaders speaking against party lines on the Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-politics-no-talk-of-statehood-at-the-cost-of-26-lives-omar-abdullah-in-jk-assembly-on-pahalgam-attack-2716201-2025-04-28",
      "headline": "Won't talk statehood at this time, I've lost face: Omar Abdullah on J&K attackExpressing deep grief, Omar Abdullah said that, while the restoration of statehood remains an important goal, he would defer raising the demand for another time and not make human lives a political bargaining chip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-envoy-anand-prakash-taliban-afghanistan-foreign-minister-leadership-diplomatic-friction-pakistan-2716285-2025-04-28",
      "headline": "Indian envoy meets Taliban leadership amid diplomatic friction with PakistanTheir discussion focused on strengthening bilateral political relations, enhancing trade and transit cooperation, and exchanging views on recent regional developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aimim-chief-asaduddin-owaisi-foiling-pakistans-most-diabolical-gameplan-hindu-muslim-pahalgam-terrorist-attack-2716220-2025-04-28",
      "headline": "How Asaduddin Owaisi is foiling Pakistan's most diabolical gameplanHyderabad MP and AIMIM chief Asaduddin Owaisi has ripped apart Pakistan in the Pahalgam attack. Owaisi's attack at a rally against the waqf law foils Pakistan's diabolical gameplan. The phrases Owaisi uses and his line of attack are unique even as some Congress leaders take a softer line."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-1/",
      "headline": "A brief history of terrorism in KashmirTo trace the evolution of insurgency and terrorism, we revisit Kashmir's turbulent history from Independence through the violent 1990s, when terror dominated the narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-writes-to-bbc-india-head-strong-sentiments-pahalgam-terror-attack-reporting-ib-ministry-watchlist-2716097-2025-04-28",
      "headline": "Government's stern message to BBC over its coverage of J&K terror attackIn an article titled 'Pakistan suspends visas for Indians after deadly Kashmir attack,' the BBC referred to the terror attack as a 'militant attack,' prompting the Narendra Modi government to write to the BBC's India head, Jackie Martin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-live-updates-pakistan-opens-fire-along-loc-for-fourth-night-in-a-row-2716044-2025-04-28",
      "headline": "Live: Rahul Gandhi reaches Parliament to attend Defence panel meet on J&K attackJammu Kashmir Pahalgam Attack Live Updates: Pakistani troops opened unprovoked fire across the Line of Control (LoC) in Jammu and Kashmir overnight, the Indian Army said on Sunday, marking the fourth consecutive ceasefire violation in recent days. Pakistan initiated unprovoked small arms fire across the LoC in areas opposite Kupwara and Poonch districts. However, the Indian forces responded \"swiftly and effectively\" to the aggression. The renewed hostilities come amid heightened tensions following the brutal terror attack in Pahalgam on April 22, where 25 tourists and a local Kashmiri were gunned down in cold blood in the popular Baisaran valley. The massacre has been described as one of the most horrific attacks in the Kashmir Valley since the abrogation of Article 370."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/government-blocks-pakistani-youtube-channels-including-shoaib-akhtars-amid-crackdown-after-pahalgam-attack-2716088-2025-04-28",
      "headline": "Provocative: India blocks Pakistani YouTube channels amid Pahalgam crackdown Live Updates The banned platforms, which collectively have around 63 million subscribers, include major Pakistani news channels such as Dawn News, Samaa TV, ARY News, Bol News, Raftar, Geo News, and Suno News."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/black-hawk-army-pilot-risky-visual-separation-move-led-to-deadly-washington-potomac-river-crash-2716039-2025-04-28",
      "headline": "Ignoring instructor, Army pilot's risky move led to deadly Washington crash: ReportCaptain Rebecca Lobach failed to follow her co-pilot and instructor Andrew Eaves's order to turn left in a bid to avoid the descending aircraft, ignoring his instructions just 15 seconds before the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-not-in-my-name-protest-everyone-against-pakistan-terrorists-hindu-muslim-tourists-omar-abdullah-2716194-2025-04-28",
      "headline": "What do I say to Navy officer's widow? Omar Abdullah's moving speech on attackIn his speech, Omar Abdullah also mentioned slain Navy officer Lieutenant Vinay Narwal who got married on April 16, just six days before the attack in Pahalgam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnusu-elections-abvp-rss-students-wing-breaches-jnu-left-bastion-sfi-aisa-2716169-2025-04-28",
      "headline": "RSS student wing finally breaches Left citadel JNUIn a historic breakthrough, the RSS's student wing, the ABVP, has stormed into the JNU's power corridors with its biggest-ever haul of 23 councillor seats, including the School of Social Sciences seat. The outfit also won the key post of joint secretary at the traditionally Left-dominated university. The ABVP's influence over JNUSU's decision-making is set to rise multifold."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/pahalgam-terror-attack-nia-questions-bharat-bhushans-wife-bengaluru-mathikere-jammu-and-kashmir-2716202-2025-04-28",
      "headline": "NIA asks Bengaluru man's widow about Pahalgam sequence of events. 8 questionsBharat Bhushan's widow Sujata was questioned by the NIA in Bengaluru about the Pahalgam terror attack, including the reason for their visit to Kashmir. Revenue officials also visited the house to process the government's Rs 10 lakh compensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/thailand-woman-finds-asian-man-hiding-under-bed-in-japan-hotel-shares-scary-experience-video-2716259-2025-04-28",
      "headline": "Woman finds Asian man hiding under bed in Japan hotel, shares scary experienceIn a video posted on Instagram, Natali narrated her scary experience that has triggered a discussion regarding security protocols in hotels. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/case-bhojpuri-singer-neha-singh-rathore-criticising-government-pahalgam-terrorist-attack-2715976-2025-04-28",
      "headline": "Bhojpuri singer faces sedition, 10 other charges for anti-India posts on J&K attackThe FIR was filed against Neha after an X handle, run by a Pakistani journalists' group, reposted her video in which she claimed that PM Modi will now be seeking votes in Bihar in the name of the Pahalgam attack victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-france-sign-rafale-marine-jet-deal-maritime-security-2716121-2025-04-28",
      "headline": "India, France ink Rs 63,000-crore deal for advanced Rafale-M jetsIndia and France have signed a Rs 63,000 crore deal for 26 Rafale-M jets for the Indian Navy, boosting maritime strength and deepening defence ties. Deliveries are expected between 2029 and 2031.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/who-is-neha-singh-rathore-bhojpuri-singer-facing-sedition-for-kashmir-attack-posts-2716250-2025-04-28",
      "headline": "Who is Neha Singh Rathore, Bhojpuri singer facing sedition for Kashmir attack postsPopular singer Neha Singh Rathore is facing a sedition case over her statements about the Pahalgam terror attack. The complainant claimed that she made provocative posts targeting a religious community. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrahs-wife-sanjana-slams-trolls-of-son-angad-mi-vs-lsg-2716177-2025-04-28",
      "headline": "Bumrah's wife Sanjana slams trolls: Angad is not a topic for your entertainmentIndia fast bowler Jasprit Bumrah's wife Sanjana Ganesan has lashed out at trolls over insensitive remarks for their son Angad. Sanjana was in attendance with her son for Mumbai Indians' game against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-airspace-close-india-flights-huge-loss-millions-overflight-fees-reroute-pahalgam-attack-2716107-2025-04-28",
      "headline": "Explained: How Pakistan could lose millions after closing airspace for IndiaPakistan's decision to close its airspace to Indian airlines, after India's diplomatic move against Pakistan over the Pahalgam terror attack, is likely to cause disruptions on several key international routes, particularly flights departing from North India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-on-bilawal-bhuttos-blood-will-flow-threat-homegrown-terrorists-killed-your-mother-2716251-2025-04-28",
      "headline": "On Bilawal Bhutto's 'blood will flow' threat, Asaduddin Owaisi's one-word put-downWhile reacting to \"blood will flow\" remark following the Pahalgam terror attack, AIMIM chief Asaduddin Owaisi asked the former Pakistani minister not to say \"childish things\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-ias-officer-smita-sabharwal-transferred-among-administration-reshuffle-2716101-2025-04-28",
      "headline": "Telangana transfers IAS officer who reshared Kancha Gachibowli land row AI imageTelangana government transferred 20 IAS officers, including Smita Sabharwal, amid controversy over her social media post on the Kancha Gachibowli land dispute. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/deepinder-goyal-slams-viral-reddit-post-on-zomato-internal-chaos-calls-it-utter-nonsense-2716187-2025-04-28",
      "headline": "Deepinder Goyal slams Reddit post on 'Zomato's chaos', calls it utter nonsenseZomato CEO Deepinder Goyal firmly shut down claims about his company losing ground to competitors, calling the allegations \"utter nonsense\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-woman-marry-grandson-flee-from-home-ambedkarnagar-indravati-2716185-2025-04-28",
      "headline": "50-year-old UP woman marries grandson, plots to kill husband and childrenA 50-year-old woman left behind her husband and four children to marry her 30-year-old grandson.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-airstrike-on-yemen-migrants-prison-houthis-saadan-africans-killed-2716239-2025-04-28",
      "headline": "68 killed, 47 injured in US airstrike on migrants' prison in Yemen: HouthisHouthis claim a US airstrike on a prison in Yemen's Saada killed at least 68 African migrants and injured 47. The US military has yet to comment as \"Operation Rough Rider\" intensifies amid Red Sea tensions.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-man-accused-of-kidnaping-attempt-child-us-georgia-mahendra-patel-caroline-miller-2716144-2025-04-28",
      "headline": "Indian man languishing in US jail for kidnapping that never wasA 56-year-old, Indian-origin man remains behind bars without bond, accused of a crime he never committed. A woman accused Mahendra Patel of trying to kidnap her toddler. However, surveillance footage showed no evidence of any struggle, contradicting the woman's claims. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-are-on-a-roll-every-team-should-be-scared-says-piyush-chawla-2716282-2025-04-28",
      "headline": "Mumbai Indians are on a roll, every team should be scared of them: Piyush ChawlaFormer India cricketer turned commentator Piyush Chawla has fired a warning to all the teams of the Indian Premier League 2025 (IPL 2025) mentioning Mumbai Indians' sudden rise to form. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-touches-childhood-coachs-feet-rcb-vs-dc-2716260-2025-04-28",
      "headline": "Watch: Virat Kohli touches childhood coach's feet after match-winning 50 vs DCStar India batter Virat Kohli had a heartwarming meet-up with his childhood coach Rajkumar Sharma after his match-winning half-century against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-ipl-2025-points-table-sanjay-manjrekar-virat-kohli-2716243-2025-04-28",
      "headline": "Not Virat Kohli, Manjrekar praises bowlers as the real heroes for RCBRoyal Challengers Bengaluru continued their winning run away from home. In a complete performance, they beat Delhi Capitals at the Arun Jaitley Stadium in New Delhi. After the game, Sanjay Manjrekar praised the team's bowling unit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kevin-pietersen-flips-out-at-question-over-t-natarajan-dc-vs-rcb-2716229-2025-04-28",
      "headline": "Kevin Pietersen flips out at question over T Natarajan: Tell me where he fits?Delhi Capitals (DC) mentor Kevin Pietersen flipped out at a journalist for a question about T. Natarajan's absence from Delhi's playing XI in the ongoing Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jurgen-klopp-arne-slot-premier-league-liverpool-2716227-2025-04-28",
      "headline": "Slot honours Jurgen Klopp after Liverpool win Premier LeagueLiverpool beat Tottenham 5-1 to secure the Premier League title on Sunday, April 27. After the win, Liverpool manager Arne Slot paid tribute to Jurgen Klopp, who was the manager of the club before him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jasprit-bumrahs-wife-sanjana-slams-trolls-of-son-angad-mi-vs-lsg-2716177-2025-04-28",
      "headline": "Bumrah's wife Sanjana slams trolls: Angad is not a topic for your entertainmentIndia fast bowler Jasprit Bumrah's wife Sanjana Ganesan has lashed out at trolls over insensitive remarks for their son Angad. Sanjana was in attendance with her son for Mumbai Indians' game against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-youtube-channel-wassay-iffy-pahalgam-terror-attack-2716165-2025-04-28",
      "headline": "Shoaib Akhtar's YouTube channel gets blocked in IndiaFormer Pakistan cricketer Shoaib Akhtar's YouTube channel was blocked by the Indian government in the aftermath of the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-rr-vs-gt-team-news-jaipur-conditions-2716142-2025-04-28",
      "headline": "RR vs GT: Gujarat take on battered Rajasthan with eyes on top spotRajasthan Royals (RR) will take on Gujarat Titans (GT) with an aim to end their five-match losing streak in the ongoing Indian Premier League 2025 (IPL 2025). On the other hand, GT will be eyeing the top spot on the points table with another commanding victory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-vs-rajasthan-royals-press-conference-2716122-2025-04-28",
      "headline": "Death overs batting has not been easy in IPL 2025: Shahrukh KhanGujarat Titans batter Shahrukh Khan has said that batting in the death overs has not been easy in IPL 2025. The cricketer has explained that hitting the dry ball has been very difficult this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/prasidh-krishna-talks-about-the-art-of-death-bowling-in-ipl-2025-2716118-2025-04-28",
      "headline": "Prasidh Krishna talks about the art of death bowling in IPL 2025Fast bowler Prasidh Krishna has spoken about the art of death bowling in the Indian Premier League. Prasidh explained that the use of saliva has having a big impact in the final overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mayank-yadav-is-just-another-bowler-for-me-to-face-says-naman-dhir-2716115-2025-04-28",
      "headline": "Mayank Yadav is just another bowler for me to face: Naman DhirMumbai Indians (MI) all-rounder Naman Dhir downplayed the threat of Mayank Yadav during his quick-fire cameo against Lucknow Super Giants (LSG). The right-handed batter scored an unbeaten 25* (11) to help MI post a massive score of 215/7 in their 20 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-youtube-channel-wassay-iffy-pahalgam-terror-attack-2716165-2025-04-28",
      "headline": "Shoaib Akhtar's YouTube channel gets blocked in IndiaFormer Pakistan cricketer Shoaib Akhtar's YouTube channel was blocked by the Indian government in the aftermath of the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-rr-vs-gt-team-news-jaipur-conditions-2716142-2025-04-28",
      "headline": "RR vs GT: Gujarat take on battered Rajasthan with eyes on top spotRajasthan Royals (RR) will take on Gujarat Titans (GT) with an aim to end their five-match losing streak in the ongoing Indian Premier League 2025 (IPL 2025). On the other hand, GT will be eyeing the top spot on the points table with another commanding victory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-vs-rajasthan-royals-press-conference-2716122-2025-04-28",
      "headline": "Death overs batting has not been easy in IPL 2025: Shahrukh KhanGujarat Titans batter Shahrukh Khan has said that batting in the death overs has not been easy in IPL 2025. The cricketer has explained that hitting the dry ball has been very difficult this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/prasidh-krishna-talks-about-the-art-of-death-bowling-in-ipl-2025-2716118-2025-04-28",
      "headline": "Prasidh Krishna talks about the art of death bowling in IPL 2025Fast bowler Prasidh Krishna has spoken about the art of death bowling in the Indian Premier League. Prasidh explained that the use of saliva has having a big impact in the final overs of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mayank-yadav-is-just-another-bowler-for-me-to-face-says-naman-dhir-2716115-2025-04-28",
      "headline": "Mayank Yadav is just another bowler for me to face: Naman DhirMumbai Indians (MI) all-rounder Naman Dhir downplayed the threat of Mayank Yadav during his quick-fire cameo against Lucknow Super Giants (LSG). The right-handed batter scored an unbeaten 25* (11) to help MI post a massive score of 215/7 in their 20 overs. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}