{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q2-gdp-growth-slows-lowest-in-six-quarters-2642308-2024-11-29",
      "headline": "India's Q2 GDP slows to 5.4%, hits 18-month low on weak consumptionThe weaker-than-expected GDP growth raises concerns about the sustainability of economic recovery, particularly as key sectors like manufacturing and mining face challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-nifty-closing-bell-q2-gdp-data-in-focus-2642284-2024-11-29",
      "headline": "Sensex, Nifty end higher as heavyweight stocks gain; Q2 GDP data in focusThe S&P BSE Sensex was up 759.05 points to 79,802.79 at the closing bell, while the NSE Nifty50 rose 216.95 points to 24,131.10. Both the indices had declined roughly 1.5% yesterday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-project-faqs-who-can-apply-qr-code-security-other-key-details-2642232-2024-11-29",
      "headline": "PAN 2.0 FAQs: Who can apply, QR code feature, and other key detailsPAN 2.0 is a government initiative combining PAN and TAN systems with a QR code for secure and quick identity verification, simplifying taxpayer registration and promoting a tech-driven tax ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebound-today-sensex-700-points-nifty-gains-key-factors-bull-run-dalal-street-2642204-2024-11-29",
      "headline": "Sensex surges 800 points: Key factors behind bull run on Dalal StreetStock market today: Sensex and Nifty regained their footing, driven by improved investor sentiment and stock-specific action. Read on to find out the key reasons behind today's rebound on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-ipo-stock-market-listing-should-you-hold-for-long-term-or-book-profit-now-2642133-2024-11-29",
      "headline": "Enviro Infra makes solid market debut: Should you hold or book profit?Enviro Infra IPO listing: Shares of Enviro Infra Engineers have dipped slightly following their strong listing, prompting investors to weigh whether to hold onto their shares or book profits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-gain-sharply-stock-market-key-factors-why-2642119-2024-11-29",
      "headline": "Adani Green, Adani Energy Solutions: Why these Adani Group stocks are gainingAdani Green Energy led the surge, rising 14.64% to hit Rs 1,247.55. Adani Energy Solutions followed, reaching a day's high of Rs 825.85. Most other Adani Group stocks also registered gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-stock-market-listing-49-percent-premium-ipo-price-2642108-2024-11-29",
      "headline": "Enviro Infra shares make strong debut, list at 49% premium over IPO priceEnviro Infra Engineers listing: The shares opened at Rs 220 on the NSE, marking a 48.64% jump from the IPO price of Rs 148. On the BSE, the stock listed at Rs 218, reflecting a 47.29% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-700-points-nifty-rises-adani-stocks-gain-2642097-2024-11-29",
      "headline": "Sensex rallies 700 points, Nifty above 24,000; Adani stocks surgeThe S&P BSE Sensex surged 663 points to reach 79,702.09 by 10:33 am, while the NSE Nifty50 climbed 154.60 points to trade at 24,084.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged 1,200 points todayAt the closing bell, the S&P BSE Sensex was down 1190.34 points at 79,043.74, while the NSE Nifty50 fell 360.75 points to 23,914.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gautam-adani-us-indictment-adani-group-fraud-charges-andhra-pradesh-2642914-2024-11-30",
      "headline": "Gautam Adani responds to US fraud charges: Every attack makes us strongerThe Adani Group is facing allegations of corruption as US prosecutors accused Gautam Adani and others of orchestrating a USD 265 million bribery scheme to secure state energy contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-cm-confirmed-devendra-fadnavis-eknath-shinde-ajit-pawar-deputy-mahayuti-2642905-2024-11-30",
      "headline": "Maharashtra Chief Minister from BJP, other allies to get deputy posts: Ajit PawarAjit Pawar said that the other Mahayuti allies, Eknath Shinde's Shiv Sena and the Nationalist Congress Party (NCP) faction led by him, would get the Deputy Chief Minister posts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-landfall-chennai-rain-imd-tamil-nadu-puducherry-flights-trains-affected-cancelled-airport-schools-college-closed-2642617-2024-11-30",
      "headline": "Cyclone Fengal landfall begins, to cross Tamil Nadu in 3 to 4 hours  Live UpdatesThe landfall process of cyclonic storm Fengal has begun near Puducherry. Several airlines have briefly suspended flight operations in Chennai. Follow our live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-ready-for-win-win-call-icc-champions-trophy-hybrid-model-door-open-2642903-2024-11-30",
      "headline": "Pakistan keeps door open for hybrid Champions Trophy: Ready for a win-win callPCB chairman Mohsin Naqvi revealed Pakistan's readiness to adopt a hybrid model for the ICC Champions Trophy 2025, signaling a step toward resolving the hosting impasse while balancing future tournament considerations amidst India's refusal to play in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aam-aadmi-party-vs-bjp-liquid-thrown-former-chief-minister-arvind-kejriwal-padyatra-in-delhi-2642881-2024-11-30",
      "headline": "AAP vs BJP after liquid thrown at Arvind Kejriwal during padyatra in DelhiVisuals showed that a man approached the Aam Aadmi Party (AAP) national convenor when he was acknowledging the crowd and hurled a liquid at him, which was supposedly water, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-wife-melania-trump-claims-debanked-by-cancel-mob-after-2021-capitol-attack-2642942-2024-12-01",
      "headline": "Melania Trump claims she was debanked by 'cancel mob' after 2021 Capitol attackMelania Trump claimed that her son Barron Trump was denied the opportunity to open a new bank account, describing the move as an act of \"political discrimination\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-priest-arrested-iskcon-centre-vandalised-2642837-2024-11-30",
      "headline": "2 more Hindu priests arrested in Bangladesh amid protestsThe priests, identified as Rudraproti Kesab Das, and Ranga Nath Syama Sundor Das, were arrested when they went to deliver food, medicine, and money to Chinmoy Das in jail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-100-tariff-threat-to-9-bric-nations-if-they-acted-to-undercut-us-dollar-2642946-2024-12-01",
      "headline": "Trump's 100% tariff threat to BRIC nations if they acted to undercut US dollarDonald Trump asked for a commitment from the BRIC nations that they would neither create a new BRICS Currency, nor back any other Currency to replace the mighty US dollar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/raha-with-ranbir-kapoor-alia-bhatt-for-isl-football-match-cutest-internet-today-viral-2642932-2024-11-30",
      "headline": "Pics: Raha with Ranbir-Alia for football match is cutest thing on internet todayOn Saturday, Ranbir Kapoor and Alia Bhatt attended a football match with their daughter, Raha. A passionate football fan and team owner, Ranbir twinned with Raha in matching blue jerseys. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-model-luciana-curtis-family-kidnapped-gunpoint-hostage-brazil-shack-2642742-2024-11-30",
      "headline": "Victoria's Secret model kidnapped at gunpoint, held hostage in shack: ReportThe Brazilian model, Luciana Curtis, and her husband were eventually released, but not before a terrifying 12-hour ordeal, which included transferring all their money to the miscreants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-cm-oath-taking-date-december-5-bjp-mahayuti-eknath-shinde-fadnavis-2642874-2024-11-30",
      "headline": "BJP has a date for swearing in Chief Minister but doesn't have a name yetBJP leader Chandrashekhar Bawankule announced that the oath-taking ceremony of the new Maharashtra government will be held on December 5 in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/2-charity-workers-killed-in-gaza-strike-israel-claims-one-was-2023-october-7-attacker-2642953-2024-12-01",
      "headline": "2 charity workers killed in Gaza strike, Israel claims one was October 7 attackerWorld Central Kitchen confirmed the airstrike and said it had no knowledge about an employee involved in the October 7, 2023 attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jharkhands-loud-message-to-bjp-symbolic-overtures-wont-win-tribal-votes-2642831-2024-11-30",
      "headline": "Jharkhand's loud message to BJP: Symbolic overtures won't win tribal votesAn analysis of tribal voting in the assembly election that inflicted one of the most decisive rejections of the BJP-led NDA in recent history\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/story/caretaker-maharashtra-chief-minister-eknath-shinde-falls-ill-during-hometown-visit-satara-placed-under-medical-observation-2642943-2024-12-01",
      "headline": "Eknath Shinde falls ill during hometown visit, placed under medical observationAccording to his family doctor, Dr RM Patre, Shinde has been suffering from a fever, cold, and throat infection for the past two days. He has been administered antibiotics and saline and is expected to recover within a day or two."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-news-indian-student-from-telangana-shot-dead-at-chicago-gas-station-2642851-2024-11-30",
      "headline": "Telangana student shot dead in Chicago shopping mall, had gone to US 3 months agoThe victim, identified as 22-year-old Sai Teja Nukarapu, was shot at the shopping mall where he had been working part-time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-man-offers-envelope-with-rs-35000-as-bribe-to-judge-during-hearing-in-godhra-2642949-2024-12-01",
      "headline": "Man offers envelope with Rs 35,000 as bribe to judge during hearing in GujaratThe accused, Bapubhai Solanki, attempted to speed up the proceedings of his ongoing case by handing over the money in a sealed envelope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bengali-stereotyping-hindi-cinema-bhool-bhulaiyaa-rocky-aur-rani-gold-2642574-2024-11-30",
      "headline": "Doing Bongs wrong: Bollywood's portrayal problemBengali characters in Hindi films often face stereotyping, with their portrayal reduced to clichéd tropes that misrepresent their culture, with Bhool Bhulaiyaa 3 being a recent example. Director Srijit Mukherji discusses the need for authentic representation and shares his views on why such stereotypes still appear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-emmys-monologue-opening-speech-viral-2642640-2024-11-30",
      "headline": "Worked hard on that monologue, says Vir Das after Emmys speech goes viralVir Das, the first Indian to host the International Emmys, delivered a viral monologue that humorously addressed various global figures and incidents. He expressed gratitude for the positive reception."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-records-most-polluted-november-in-7-years-with-22-days-in-very-poor-air-quality-2642947-2024-12-01",
      "headline": "With 22 'very poor' days, Delhi sees most polluted November in 7 yearsSix days were categorised as 'severe', and the remaining 22 days lingered in the 'very poor' category, indicating persistent exposure to dangerously high levels of pollutants."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rashtriya-swayamsevak-sangh-urges-centre-to-mobilise-global-support-for-hindus-in-bangladesh-2642774-2024-11-30",
      "headline": "RSS urges Centre to mobilise global support for Hindus in BangladeshRSS General Secretary Dattatreya Hosabale condemned the persecution of Hindus in Bangladesh, accusing the Muhammad Yunus government of being a \"silent spectator\" to the rising violence against the minority community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/detox-bars-iv-drips-indian-wedding-hangovers-get-a-swanky-cure-2642212-2024-11-30",
      "headline": "Detox bars, IV drips: Indian wedding hangovers get a swanky cureWedding planners and modern couples have introduced the ultimate antidote to keep the wedding festivities alive the morning after the party: detox bars and IV drips."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-after-failing-exam-man-roams-around-wearing-fake-army-uniform-in-porbandar-2642952-2024-12-01",
      "headline": "After failing exam, man roams around wearing fake Army uniform in GujaratDuring the investigation, the man, identified as Sanjay Dodiya, a 10th-grade pass, confessed that although he had appeared for the army exam, he did not succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dating-dictionary-10-trending-terms-popular-online-dating-trends-2024-2642714-2024-11-30",
      "headline": "A dating dictionary with 10 trending terms to help you survive modern loveIf you've been away from the dating scene for a while, you might feel lost in a sea of quirky terms. Here's your dating dictionary to navigate the maze of modern love. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bhopal/story/madhya-pradesh-from-panipuri-seller-to-marijuana-smuggler-a-tale-that-shocked-bhopal-police-2642948-2024-12-01",
      "headline": "From panipuri seller to marijuana smuggler: A tale that shocked Bhopal PoliceSushil started selling marijuana after his panipuri cart was removed by the police during anti-encroachment drives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/raha-with-ranbir-kapoor-alia-bhatt-for-isl-football-match-cutest-internet-today-viral-2642932-2024-11-30",
      "headline": "Pics: Raha with Ranbir-Alia for football match is cutest thing on internet todayOn Saturday, Ranbir Kapoor and Alia Bhatt attended a football match with their daughter, Raha. A passionate football fan and team owner, Ranbir twinned with Raha in matching blue jerseys. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-told-dia-mirza-leading-ladies-play-his-mother-later-2642904-2024-11-30",
      "headline": "Salman Khan once told Dia Mirza 'one day you'll play my mother'. Here's whyDia Mirza reminisces about her experience working with Salman Khan in Tumko Na Bhool Paayenge, sharing a humorous incident involving a co-star who once played Salman's heroine but was cast as his mother in this film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/zayn-malik-pays-homage-to-liam-payne-emotional-speech-2642891-2024-11-30",
      "headline": "Watch: Zayn Malik's emotional tribute to 'brother' Liam PayneZayn Malik paid tribute to his late former One Direction bandmate, Liam Payne, during a concert in Payne's hometown, Wolverhampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-singer-anju-joseph-wedding-aditya-photo-2642858-2024-11-30",
      "headline": "Malayalam singer Anju Joseph is married, shares wedding photoMalayalam singer Anju Joseph married Aditya Pareswaram in a court ceremony. She shared the joyous news on Instagram. Videos from her reception are also going viral."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sporting-cp-cristiano-ronaldo-theme-third-kit-launch-featuring-junior-watch-video-2642929-2024-11-30",
      "headline": "Sporting CP launch Ronaldo-themed third kit ft Portugal star's son Sporting CP celebrated Cristiano Ronaldo's legacy with a special third kit, featuring a tribute video starring his son, Cristiano Jr., donning the number 7 jersey, honoring the football icon's journey from Lisbon to global superstardom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-shubman-gill-abhishek-nayar-fielding-drill-watch-banter-adelaide-test-injury-2642918-2024-11-30",
      "headline": "Shubman Gill vs Abhishek Nayar in fun fielding-drill before Adelaide TestShubman Gill's return to training ahead of the Adelaide Test fueled speculation about his comeback, as the Indian squad prepared to extend their lead in the Border-Gavaskar Trophy following a commanding win in the Perth opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-sumit-nagal-singles-titles-pspb-inter-unit-tennis-2642916-2024-11-30",
      "headline": "Nagal clinches singles titles at PSPB Inter-Unit Tennis tournament Sumit Nagal defeated Vishnu Vardhan 6-4, 6-3 in the men's singles final to win the title at the 43rd PSPB Inter-Unit Lawn Tennis Tournament in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/mohsin-naqvi-pakistan-board-ready-for-icc-champions-trophy-decision-with-respect-bcci-2642915-2024-11-30",
      "headline": "Pakistan up for any decision, but with respect: Naqvi on Champions TrophyPCB chairman Mohsin Naqvi hinted at a possible resolution to the ICC Champions Trophy 2025 hosting discussions, emphasizing that the decision should uphold Pakistan's respect and interests, ensuring fairness amidst ongoing debates about the tournament's arrangements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-harbhajan-singh-ravichandran-ashwin-washington-sundar-border-gavaskar-trophy-2024-25-2642900-2024-11-30",
      "headline": "Harbhajan Singh highlights Ashwin's age factor after Sundar's selection in PerthFormer India cricketer Harbhajan Singh has shared his thoughts on India selecting Washington Sundar over Ravichandran Ashwin in ongoing Border Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-ready-for-win-win-call-icc-champions-trophy-hybrid-model-door-open-2642903-2024-11-30",
      "headline": "Pakistan keeps door open for hybrid Champions Trophy: Ready for a win-win callPCB chairman Mohsin Naqvi revealed Pakistan's readiness to adopt a hybrid model for the ICC Champions Trophy 2025, signaling a step toward resolving the hosting impasse while balancing future tournament considerations amidst India's refusal to play in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-temba-bavuma-durban-test-wtc-final-2642894-2024-11-30",
      "headline": "Not too loud about it: Bavuma on South Africa's WTC final chancesSA vs SL: Temba Bavuma said that South Africa will focus on what's in their control to bag a place in the WTC final to be held next year. On Saturday, the Proteas defeated Sri Lanka by 233 runs in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-thanking-tennis-ball-selector-match-fees-local-tournament-viral-video-2642887-2024-11-30",
      "headline": "Hardik Pandya thanks tennis-ball selector for Rs 400 fee in viral videoHardik Pandya thanked a childhood cricket selector for giving him Rs 400 match fees, acknowledging the pivotal role it played in his journey from local tournaments to becoming the world's top-ranked T20I all-rounder and an IPL captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohsin-naqvi-emirates-board-head-champions-trophy-hybrid-model-2642875-2024-11-30",
      "headline": "Mohsin Naqvi meets Emirates Board head amid Champions Trophy hybrid model deliberations PCB chairman Mohsin Naqvi met Emirates Cricket Board head Mubashir Usmani in Dubai. Naqvi told Usmani that Pakistan was ready to host the Champions Trophy with preparations being on schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pcb-agrees-to-hybrid-model-for-cricket-tournaments-ytvd-2642817-2024-11-30",
      "headline": "PCB agrees to hybrid model for cricket events despite initial resistancePCB adopts a hybrid model for cricket tournaments, potentially holding games in Sri Lanka when India hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-pcb-ready-for-win-win-call-icc-champions-trophy-hybrid-model-door-open-2642903-2024-11-30",
      "headline": "Pakistan keeps door open for hybrid Champions Trophy: Ready for a win-win callPCB chairman Mohsin Naqvi revealed Pakistan's readiness to adopt a hybrid model for the ICC Champions Trophy 2025, signaling a step toward resolving the hosting impasse while balancing future tournament considerations amidst India's refusal to play in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-temba-bavuma-durban-test-wtc-final-2642894-2024-11-30",
      "headline": "Not too loud about it: Bavuma on South Africa's WTC final chancesSA vs SL: Temba Bavuma said that South Africa will focus on what's in their control to bag a place in the WTC final to be held next year. On Saturday, the Proteas defeated Sri Lanka by 233 runs in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-thanking-tennis-ball-selector-match-fees-local-tournament-viral-video-2642887-2024-11-30",
      "headline": "Hardik Pandya thanks tennis-ball selector for Rs 400 fee in viral videoHardik Pandya thanked a childhood cricket selector for giving him Rs 400 match fees, acknowledging the pivotal role it played in his journey from local tournaments to becoming the world's top-ranked T20I all-rounder and an IPL captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohsin-naqvi-emirates-board-head-champions-trophy-hybrid-model-2642875-2024-11-30",
      "headline": "Mohsin Naqvi meets Emirates Board head amid Champions Trophy hybrid model deliberations PCB chairman Mohsin Naqvi met Emirates Cricket Board head Mubashir Usmani in Dubai. Naqvi told Usmani that Pakistan was ready to host the Champions Trophy with preparations being on schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pcb-agrees-to-hybrid-model-for-cricket-tournaments-ytvd-2642817-2024-11-30",
      "headline": "PCB agrees to hybrid model for cricket events despite initial resistancePCB adopts a hybrid model for cricket tournaments, potentially holding games in Sri Lanka when India hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-syed-mushtaq-ali-trophy-2024-25-jay-shah-smat-2024-25-hardik-pandya-shreyas-iyer-2642873-2024-11-30",
      "headline": "Jay Shah praises India's senior players for participating in Syed Mushtaq Ali TrophyBCCI secretary Jay Shah has praised India's senior players for participating in India's premier domestic T20 tournament Syed Mushtaq Ali Trophy 2024-25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vs-ding-liren-hard-fought-draw-game-five-world-chess-championship-singapore-2642868-2024-11-30",
      "headline": "Gukesh holds Liren to a hard-fought draw in World Chess Championship Game 5D Gukesh and Ding Liren remained tied at 2.5-2.5 after an intense Game 5 draw in the World Chess Championship, with Gukesh's resilient defense countering Ding's calculated aggression to keep the series evenly poised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-under-19-asia-cup-india-u19-vs-pakistan-u19-shahzaib-khan-vaibhav-suryavanshi-2642863-2024-11-30",
      "headline": "Under 19 Asia Cup: Shahzaib Khan's century helps Pakistan beat India by 43 runs Pakistan beat India by 43 runs in the Under 19 Asia Cup as Shahzaib Khan starred with a century for Pakistan with his innings of 159 (147)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-hybrid-model-champions-trophy-icc-policy-2642855-2024-11-30",
      "headline": "Pakistan ready to accept hybrid Champions Trophy, seeks uniform ICC policy: SourcesThe Pakistan Cricket Board (PCB) is reportedly ready to accept the hybrid model for the Champions Trophy if the ICC implements the same model across all ICC events until 2031. With around three months left for the tournament, the schedule is yet to be announced. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-1st-test-marco-jansen-muttiah-muralidaran-durban-2642847-2024-11-30",
      "headline": "Jansen joins Muralidaran n in elite club with 11 wickets in Durban TestSA vs SL: Fast bowler Marco Jansen finished with figures of 28.3-6-86-11 as South Africa beat Sri Lanka by 233 runs in the opening Test at the Kingsmead in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-world-test-championship-wtc-2024-25-australia-south-africa-india-sri-lanka-2642846-2024-11-30",
      "headline": "After Perth debacle, Australia suffer another major blow to WTC final hopesAustralia have suffered a major blow to their World Test Championship (WTC) final hopes as they dropped one more spot in the WTC standings after South Africa's win over Sri Lanka."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-likely-to-accept-icc-champions-trophy-hybrid-mode-bcci-emergency-meeting-2642839-2024-11-30",
      "headline": "Pakistan likely to accept hybrid hosting model for Champions TrophyThe Pakistan Cricket Board (PCB) is reportedly set to adopt a hybrid hosting model for the ICC Champions Trophy 2025. Under Mohsin Naqvi's leadership, PCB may propose hosting the final in Lahore if India does not progress to the tournament's final stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-durban-test-win-sri-lanka-marco-jansen-eleven-wicket-haul-tristan-stubbs-bavumba-2642833-2024-11-30",
      "headline": "SA vs SL: Jansen too good for Sri Lanka as South Africa bag Durban Test winSouth Africa secured a massive 233-run victory over Sri Lanka in the Durban Test, powered by Marco Jansen's record-breaking 11-wicket haul, which dismantled the visitors' batting and ensured a commanding win for the Proteas at Kingsmead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-1st-test-marco-jansen-muttiah-muralidaran-durban-2642847-2024-11-30",
      "headline": "Jansen joins Muralidaran n in elite club with 11 wickets in Durban TestSA vs SL: Fast bowler Marco Jansen finished with figures of 28.3-6-86-11 as South Africa beat Sri Lanka by 233 runs in the opening Test at the Kingsmead in Durban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-world-test-championship-wtc-2024-25-australia-south-africa-india-sri-lanka-2642846-2024-11-30",
      "headline": "After Perth debacle, Australia suffer another major blow to WTC final hopesAustralia have suffered a major blow to their World Test Championship (WTC) final hopes as they dropped one more spot in the WTC standings after South Africa's win over Sri Lanka."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistan-likely-to-accept-icc-champions-trophy-hybrid-mode-bcci-emergency-meeting-2642839-2024-11-30",
      "headline": "Pakistan likely to accept hybrid hosting model for Champions TrophyThe Pakistan Cricket Board (PCB) is reportedly set to adopt a hybrid hosting model for the ICC Champions Trophy 2025. Under Mohsin Naqvi's leadership, PCB may propose hosting the final in Lahore if India does not progress to the tournament's final stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-durban-test-win-sri-lanka-marco-jansen-eleven-wicket-haul-tristan-stubbs-bavumba-2642833-2024-11-30",
      "headline": "SA vs SL: Jansen too good for Sri Lanka as South Africa bag Durban Test winSouth Africa secured a massive 233-run victory over Sri Lanka in the Durban Test, powered by Marco Jansen's record-breaking 11-wicket haul, which dismantled the visitors' batting and ensured a commanding win for the Proteas at Kingsmead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wbbl-2024-final-brisbane-heat-vs-melbourne-renegades-when-and-where-to-watch-2642818-2024-11-30",
      "headline": "WBBL 2024 final: Brisbane Heat vs Melbourne Renegades when and where to watchWBBL 2024: Brisbane Heat and Melbourne Renegades are all set to face-off in the summit clash of the Women's Big Bash League. Find out all the live-streaming details of the clash.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ajay-jadeja-perth-100-adelaide-border-gavaskar-trophy-2024-25-aus-vs-ind-2642813-2024-11-30",
      "headline": "Virat Kohli's doubters can rest in peace: Ajay JadejaFormer India cricketer Ajay Jadeja has gone after Virat Kohli's doubters after his magnificent hundred in Perth saying that they can rest in peace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nathan-mcsweeny-best-to-open-adelaide-day-night-test-perth-flop-2642812-2024-11-30",
      "headline": "Mcsweeny best person to open in Adelaide: Harris says after Perth Test flopNathan McSweeney's spot as Australia's opener drew debate despite Ryan Harris backing the youngster for the upcoming Day-Night Test against India in Adelaide after his challenging debut performance in the Perth Test during the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-scott-boland-adelaide-test-2642780-2024-11-30",
      "headline": "Boland dismisses panic in Australia change room after Perth lossAUS vs IND: Scott Boland said that Australia haven't pressed the panic button after their defeat in the Perth Test against India. Boland is set to replace an injured Josh Hazlewood in the playing XI for the Adelaide Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}