{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-losers-bse-nse-sensex-nifty-shares-2699443-2025-03-26",
      "headline": "Stock market closing: Top gainers and losers on Sensex, NiftyBenchmark indices snapped their seven-day winning streak, as investors turned cautious ahead of the monthly expiry. The S&P BSE Sensex dropped 728.69 points to close at 77,288.50, while the NSE Nifty50 fell 181.80 points, ending the session at 23,486.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-may-lower-duties-on-harley-davidson-bikes-bourbon-whiskey-sources-2699423-2025-03-26",
      "headline": "India may lower duties on Harley-Davidson bikes, bourbon whiskey: SourcesIndia may further reduce import duties on Harley-Davidson motorcycles, US wines, and bourbon whiskey as part of ongoing India-US trade talks, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-tumbles-over-700-points-nifty-settles-below-23500-indusind-bank-jumps-3-percent-2699400-2025-03-26",
      "headline": "Sensex tumbles over 700 points, Nifty settles below 23,500; IndusInd Bank up 3%Stock market closing bell: The S&P BSE Sensex ended 728.69 points lower to 77,288.50,  while the NSE Nifty50 declined 181.80 points to settle at 23,486.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-trade-talks-tariff-harley-davidson-bikes-bourbon-whiskey-californian-wine-reciprocal-donald-trump-2699388-2025-03-26",
      "headline": "India may cut duties on Harley bikes, bourbon whiskey amid US talks: SourcesThe government had earlier reduced import duties on Harley-Davidson motorcycles from 50% to 40%. Similarly, import duty on Bourbon whisky was reduced from 150% to 100% in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-claim-settlement-practices-irdai-scanner-report-insurance-sector-news-personal-finance-2699329-2025-03-26",
      "headline": "Insurance regulator flags concerns over Star Health's claim settlements: ReportAccording to IRDAI's handbook of insurance statistics, Star Health's incurred claim ratio stood at 66.47% for the financial year 2023-24. This ratio indicates the percentage of premium income that an insurance company pays out in claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-raises-2-billion-dollar-via-market-deposits-in-march-amid-accounting-lapses-2699313-2025-03-26",
      "headline": "IndusInd Bank raised $2 billion via market deposits in March: ReportThe country's fifth-largest private sector bank flagged earlier in the month a $175 million hole in its balance sheet, citing accounting discrepancies in its derivatives portfolio."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-never-star-together-in-a-film-2699730-2025-03-27",
      "headline": "Salman Khan reveals why he, SRK and Aamir Khan can never star in a film togetherSalman Khan, in an interaction ahead of Sikandar's release, said that Shah Rukh Khan, Aamir Khan and himself can never star in a film together. He then explained the reason why it is not possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-film-with-atlee-delayed-due-to-budget-constraints-2699666-2025-03-26",
      "headline": "Salman Khan's film with Atlee delayed due to budget constraintsSalman Khan's collaboration with Atlee has been postponed as the film's budget undergoes reassessment. The actor confirmed the delay during a recent press meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gagas-mayhem-ball-tour-2025-dates-cities-ticket-sales-information-glbs-2699636-2025-03-26",
      "headline": "Lady Gaga's Mayhem Ball tour 2025: Dates, cities & ticket sales informationLady Gaga announces her Mayhem Ball tour, hitting North America, Europe, and the UK in 2025. The highly anticipated arena tour promises an intimate, theatrical experience, with tickets selling fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fka-twigs-cancels-tour-dates-in-us-and-canada-due-to-visa-complications-glbs-2699632-2025-03-26",
      "headline": "FKA Twigs cancels tour dates in US and Canada due to visa complicationsFKA Twigs cancels her US and Canada tour due to visa issues but plans to reschedule. Fans express support as her tour continues with scheduled performances in Mexico and major festivals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-confirms-reunion-with-sanjay-dutt-for-upcoming-film-2699629-2025-03-26",
      "headline": "Salman Khan confirms reunion with Sanjay Dutt for upcoming filmBollywood superstars Salman Khan and Sanjay Dutt are set to reunite on screen, as confirmed by Salman Khan during a recent group chat. The announcement has thrilled fans, though project details remain a mystery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bazooka-trailer-out-mammootty-gautham-vasudev-menon-deeno-dennis-directorial-debut-2699611-2025-03-26",
      "headline": "Bazooka trailer: Mammootty is a classy businessman as he tracks down serial killerThe trailer for Bazooka, featuring Malayalam icon Mammootty and Gautham Vasudev Menon, was released today, March 26. The film will release on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/adolescence-star-owen-cooper-to-star-with-margot-robbie-in-his-next-2699581-2025-03-26",
      "headline": "Adolescence star Owen Cooper to star with Margot Robbie in his nextAdolescence star Owen Cooper will reportedly be sharing screen space with Oscar-nominated Margot Robbie in his next project.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-shankar-vara-prasad-anil-ravipudi-film-script-locked-2699537-2025-03-26",
      "headline": "Chiranjeevi to play Shankar Vara Prasad in Anil Ravipudi's film, script lockedDirector Anil Ravipudi has confirmed that the script for his much-anticipated film with Megastar Chiranjeevi is finalised. The project is set for a grand launch soon, with a Sankranthi 2026 release planned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nick-frost-in-talks-to-play-hagrid-in-hbos-harry-potter-series-report-2699493-2025-03-26",
      "headline": "Nick Frost in talks to play Hagrid in HBO's Harry Potter series: ReportNick Frost is reportedly in talks to join HBO's upcoming Harry Potter series as Rubeus Hagrid. The actor would join a cast featuring John Lithgow, Janet McTeer, and Paapa Essiedu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kill-dill-ott-release-when-and-where-to-watch-anushka-sens-romantic-thriller-2699531-2025-03-26",
      "headline": "Kill Dill OTT Release: When and where to watch Anushka Sen's romantic thrillerAnushka Sen is back with a mystery thriller, Kill Dill. The series is set to premiere on 28 March and will be available for free on Amazon MX Player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pedro-pascal-and-bella-ramsey-reveal-tough-moments-filming-the-last-of-us-season-2-glbs-2699568-2025-03-26",
      "headline": "Pedro Pascal and Bella Ramsey reveal tough moments filming 'The Last of Us Season 2'Pedro Pascal and Bella Ramsey struggled emotionally while filming The Last of Us Season 2. Newcomers Kaitlyn Dever, Isabela Merced, and Young Mazino join the cast as dark themes intensify the highly anticipated season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kaiju-no-8-mission-recon-trailer-april-11-release-date-india-2699567-2025-03-26",
      "headline": "Kaiju No 8 Mission Recon: English subbed trailer out, film to release in AprilThe English-subbed trailer for Kaiju No 8: Mission Recon was released. with the film set to premiere in India on April 11, 2025. The movie offers a recap of Season One and introduces a new episode along with a fresh ending theme song by OneRepublic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-lucifer-story-explained-and-what-to-expect-from-its-sequel-empuraan-2699463-2025-03-26",
      "headline": "Mohanlal's Lucifer story explained and what to expect from its sequel EmpuraanMalayalam superstar Mohanlal's L2: Empuraan is hardly a day away from release. Ahead of the release, here is everything you need to know about the prequel, Lucifer, which will prepare you for Empuraan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-car-hit-by-a-bus-in-mumbai-here-the-truth-2699560-2025-03-26",
      "headline": "Aishwarya Rai Bachchan safe, was not in the car: Sources deny accident reportsVarious reports suggested that actor Aishwarya Rai Bachchan's car was hit by a bus in Mumbai. India Today confirmed that the actor was not present in the car when the incident took place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/are-shailene-woodley-and-lucas-bravo-dating-fans-speculate-after-paris-stroll-glbs-2699557-2025-03-26",
      "headline": "Are Shailene Woodley and Lucas Bravo dating? Fans speculate after Paris strollShailene Woodley and Lucas Bravo sparked dating rumors after a cozy stroll in Paris. They held hands and hugged, but their reps remain silent, leaving fans speculating about a possible romance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajendra-prasad-apologises-david-warner-backlash-pushpa-remarks-2699502-2025-03-26",
      "headline": "Actor Rajendra Prasad apologises to David Warner after backlash: He's like my sonTelugu actor Rajendra Prasad apologised to David Warner after his comments sparked backlash online. This came after the actor playfully mocked the cricketer for recreating Pushpa steps. \r\n \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-actor-owen-cooper-star-making-audition-2699487-2025-03-26",
      "headline": "Watch Adolescence actor Owen Cooper's star-making auditionAdolescence star Owen Cooper has become a household name after his hit-making turn in the Netflix series. The British actor's audition for the series was shared by director Philip Barantini on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/chainsaw-man-the-movie-reze-arc-release-date-teaser-plot-details-2699481-2025-03-26",
      "headline": "Chainsaw Man The Movie Reze Arc: Check out release date, story and other detailsThe Chainsaw Man movie focusing on the Reze Arc is set to release in Japan on September 19, but release dates for the US and India remain unconfirmed. Read more details about the film here."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-announces-25-tariffs-on-foreign-made-cars-going-to-be-permanent-2699720-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump announces 25% tariffs on foreign made cars: Going to be permanentThe auto tariffs are set to take effect on April 2, with collection beginning on April 3, Donald Trump said on Wednesday while speaking to reporters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pentagon-chief-pete-hegseth-the-atlantic-shares-yemen-strike-leaked-chats-us-signal-2699727-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S****y war plans: Pentagon's defence after leaked Signal chat blunderAmerican magazine The Atlantic has released a series of purported messages that allegedly showed Pete Hegseth sharing classified information regarding the timing of US warplane launches and bomb deployments in Yemen."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/concern-for-indian-students-trump-demands-name-nationality-of-campus-protestors-columbia-deport-immigration-colleges-2699432-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Concern for Indian students? Trump demands name, nationality of campus protestorsThe Trump administration's demand for student names and nationalities has sparked fears of a crackdown on international students, including those from India. Legal experts warn that the Trump administration's demand for student names could result in monitoring of these students, arrest or even deportation. Some Indians have already faced the fury of the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-a-slow-morning-is-the-best-way-to-start-your-day-2699468-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a slow morning is the best way to start your dayA slow morning is about starting the day at a relaxed pace, without the stress of rushing. It involves taking time to wake up, enjoying a mindful routine, and easing into the day with calmness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-moeen-ali-varun-chakravarthy-guwahati-2699676-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "De Kock and spinners get KKR off the mark as RR stumble at Riyan's homeIPL 2025, RR vs KKR: Quinton de Kock's unbeaten 97 and a spin-bowling masterclass from Varun Chakravarthy and Moeen Ali helped Kolkata Knight Riders outclass Rajasthan Royals by eight wickets. Rajasthan, playing in Riyan Parag's hometown, suffered their second successive defeat of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-t-series-says-satire-video-visibility-blocked-eknath-shinde-controversy-habitat-mumbai-2699490-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stop being a stooge: Kunal Kamra claims his video got T-Series copyrightComedian Kunal Kamra has hit back at music company T-Series after it allegedly blocked the visibility of his stand-up special on YouTube, citing copyright issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-marriage-wife-lover-sant-kabir-nagar-children-court-temple-wedding-vows-2699618-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man gets wife married to her lover: I'll take care of our childrenA man in Uttar Pradesh's Sant Kabir Nagar district decided to marry off his wife to her lover after getting to know about their affair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-never-star-together-in-a-film-2699730-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan reveals why he, SRK and Aamir Khan can never star in a film togetherSalman Khan, in an interaction ahead of Sikandar's release, said that Shah Rukh Khan, Aamir Khan and himself can never star in a film together. He then explained the reason why it is not possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/the-atlantic-publishes-us-attack-plan-shared-on-signal-group-chat-glbs-2699565-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Atlantic publishes US' Yemen attack plans leaked on 19-member Signal groupThe chats, detailed in Jeffrey Goldberg's article on The Atlantic, reveal internal discussions, including Vice President Vance debating the merits of an airstrike on Houthi targets in Yemen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-questions-raised-over-safety-of-cheetahs-in-kuno-administration-issues-advisory-2699725-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Questions raised over safety of Cheetahs in Kuno, administration issues advisoryConcerns over cheetah safety in Kuno National Park have risen after villagers in Teliapura, Veerpur Tehsil, attacked a female cheetah, Jwala, and her four cubs for hunting a cow. Residents threw stones and chased them with sticks, sparking fears over their protection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-police-arrest-thief-who-used-to-poop-his-pants-to-escape-capture-2699684-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Poop and run: How Delhi Police thwarted serial burglars' stinky escape streakWhenever Deepak sensed trouble or feared getting caught, he would defecate on himself, creating an unbearable stench that forced people, including the police, to back off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-prediction-first-300-total-hyderabad-2699717-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRH vs LSG: Will SunRisers Hyderabad smash IPL's first 300 today?IPL 2025, SRH vs LSG: SunRisers Hyderabad are on the brink of making IPL history by becoming the first team to score 300 runs in an innings, following their explosive start to the 2025 season. With a power-packed batting line-up and a struggling Lucknow Super Giants bowling attack, all eyes are on Thursday's showdown in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-film-with-atlee-delayed-due-to-budget-constraints-2699666-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's film with Atlee delayed due to budget constraintsSalman Khan's collaboration with Atlee has been postponed as the film's budget undergoes reassessment. The actor confirmed the delay during a recent press meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/maharashtra-government-tells-court-that-it-cant-file-firs-against-individuals-over-illegal-hoardings-2699721-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can't file FIRs over illegal hoardings, Maharashtra government tells courtThe Maharashtra government told the Bombay High Court on Wednesday that it is unable to register FIRs against individuals for putting up illegal hoardings across the state, citing challenges in identifying those responsible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/miami-open-2025-iga-swiatek-alexandra-eala-rafael-nadal-quarterfinal-2699736-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Iga Swiatek stunned by Rafael Nadal Academy 19-year-old graduateMiami Open 2025: After beating Jelana Ostapenko and Madison Keys, 19-year-old wildcard from Philippines Alexandra Eala has beaten Iga Swiatek to book a berth in the semi-final of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/mumbai-to-get-water-metro-like-kochi-how-soon-is-the-launch-2699260-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai to get water metro like Kochi: How soon is the launch?A water transport system for Mumbai and suburbs remained on the drawing board for decades; now the Maharashtra government has fast-tracked the project\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-second-ball-rule-used-first-time-2699700-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL 2025: Second ball rule applied for the  first time in RR vs KKRRajasthan Royals became the first IPL team to use the second ball rule in 2025, but it was not enough to prevent an eight-wicket defeat to Kolkata Knight Riders, led by Quinton de Kock's unbeaten 97 on a slow Guwahati pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/5-health-benefits-of-dates-for-controlling-sugar-cravings-naturally-2699710-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 Health benefits of dates for controlling sugar cravings naturallyCraving something sweet? Satisfy your sweet tooth in a healthy way with dates. Packed with natural sugars, fibre, and essential nutrients, dates are the perfect alternative to processed sweets. Discover the benefits of dates for curbing sugar cravings today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/doubling-ac-efficiency-can-prevent-power-crisis-save-india-26-billion-study-2699716-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Doubling AC efficiency can prevent power crisis, save India $26 billion: StudyAs India faces another scorching summer, a study by the India Energy and Climate Centre (IECC) at UC Berkeley finds that doubling AC efficiency could prevent severe power shortages and save consumers up to Rs 2.2 lakh crore (USD 26 billion) over the next decade. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-5-central-armed-officers-loot-businessmans-house-posing-as-income-tax-officials-arrested-2699724-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "5 central armed officers loot businessman's house posing as Income Tax officialsKolkata police have arrested eight people, including five CISF personnel, for posing as Income Tax officers and looting cash and jewellery from a businessman's home in a fake raid on March 18 in Chinar Park."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ex-brazilian-president-jair-bolsonaro-to-stand-trial-over-coup-attempt-2699709-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ex-Brazilian President Jair Bolsonaro to stand trial over 2022 coup attemptA five-judge panel of the Brazilian Supreme Court decided unanimously to put former President Jair Bolsonaro on trial over a coup attempt following his 2022 election loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/javed-akhtar-mohanlal-mammootty-sabarimala-puja-row-2699742-2025-03-27",
      "headline": "Javed Akhtar defends Mohanlal-Mammootty, slams petty people in Sabarimala puja rowJaved Akhtar appreciated Mohanlal and Mammootty's friendship in an X post. Recently, Mohanlal performing a puja for his friend Mammootty at the Sabarimala temple sparked controversy over faith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-never-star-together-in-a-film-2699730-2025-03-27",
      "headline": "Salman Khan reveals why he, SRK and Aamir Khan can never star in a film togetherSalman Khan, in an interaction ahead of Sikandar's release, said that Shah Rukh Khan, Aamir Khan and himself can never star in a film together. He then explained the reason why it is not possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-film-with-atlee-delayed-due-to-budget-constraints-2699666-2025-03-26",
      "headline": "Salman Khan's film with Atlee delayed due to budget constraintsSalman Khan's collaboration with Atlee has been postponed as the film's budget undergoes reassessment. The actor confirmed the delay during a recent press meet."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/miami-open-2025-iga-swiatek-alexandra-eala-rafael-nadal-quarterfinal-2699736-2025-03-27",
      "headline": "Iga Swiatek stunned by Rafael Nadal Academy 19-year-old graduateMiami Open 2025: After beating Jelana Ostapenko and Madison Keys, 19-year-old wildcard from Philippines Alexandra Eala has beaten Iga Swiatek to book a berth in the semi-final of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-quinton-de-kock-phil-salt-rr-vs-kkr-2699726-2025-03-27",
      "headline": "Quinton de Kock 2.0? South African star shows KKR can be spicy without SaltQuinton de Kock seems to have found a new lease of life in KKR, while doing one of the toughest jobs for the defending IPL champions. While replacing Phil Salt may not be possible, the experienced South African adds a different spicy flavour to the KKR side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-virat-kohli-chepauk-fans-spin-training-2699719-2025-03-27",
      "headline": "Virat Kohli mania in Chennai: RCB star signs autographs, trains for spin challengeIPL 2025, CSK vs RCB: Virat Kohli thrilled fans in Chennai by signing autographs after an intense training session ahead of RCB's clash against CSK. The star batter focused on countering CSK's spin threat, preparing for challenges from Noor Ahmad, R Ashwin, and Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-prediction-first-300-total-hyderabad-2699717-2025-03-27",
      "headline": "SRH vs LSG: Will SunRisers Hyderabad smash IPL's first 300 today?IPL 2025, SRH vs LSG: SunRisers Hyderabad are on the brink of making IPL history by becoming the first team to score 300 runs in an innings, following their explosive start to the 2025 season. With a power-packed batting line-up and a struggling Lucknow Super Giants bowling attack, all eyes are on Thursday's showdown in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-rr-vs-kkr-guwahati-orange-purple-cap-2699712-2025-03-27",
      "headline": "Points Table, March 26: Kolkata Knight Riders climb standings after Guwahati winIPL Points Table Update, March 26: Kolkata Knight Riders jumped to the sixth spot after a good boost to their Net Run Rate following their 8-wicket win over Rajasthan Royals on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-a-smith-is-on-a-taylor-swift-tour-run-right-now-says-lebron-james-over-bronny-controversy-glbs-2699704-2025-03-27",
      "headline": "NBA: Stephen A. Smith is on a Taylor Swift tour run right now, says LeBron James over Bronny controversyLos Angeles Lakers superstar LeBron James reignited the fight with ESPN's Stephen A. Smith, taking a sharp jab at the sports commentator during an appearance on The Pat McAfee Show on Wednesday, March 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-second-ball-rule-used-first-time-2699700-2025-03-26",
      "headline": "IPL 2025: Second ball rule applied for the  first time in RR vs KKRRajasthan Royals became the first IPL team to use the second ball rule in 2025, but it was not enough to prevent an eight-wicket defeat to Kolkata Knight Riders, led by Quinton de Kock's unbeaten 97 on a slow Guwahati pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-player-of-match-reaction-2699695-2025-03-26",
      "headline": "Quinton de Kock downplays retirement impact after record 97 for KKR vs RRIPL 2025, RR vs KKR: Quinton de Kock showed glimpses of vintage form with a record-breaking 97 off just 61 balls. On a sluggish pitch, the South African veteran stood out, helping KKR comfortably chase down 152 in Guwahati on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-moeen-ali-steps-up-sunil-narine-absence-2699694-2025-03-26",
      "headline": "No Sunil Narine, no problem for KKR: Moeen Ali steps up vs RRMoeen Ali stepped up in Sunil Narine's absence, producing a brilliant 2/23 spell as KKR defeated Rajasthan Royals by eight wickets to claim their first IPL 2025 victory, with Quinton de Kock's unbeaten 97 sealing the win in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-moeen-ali-varun-chakravarthy-guwahati-2699676-2025-03-26",
      "headline": "De Kock and spinners get KKR off the mark as RR stumble at Riyan's homeIPL 2025, RR vs KKR: Quinton de Kock's unbeaten 97 and a spin-bowling masterclass from Varun Chakravarthy and Moeen Ali helped Kolkata Knight Riders outclass Rajasthan Royals by eight wickets. Rajasthan, playing in Riyan Parag's hometown, suffered their second successive defeat of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-riyan-parag-fan-pitch-invader-touches-feet-2699663-2025-03-26",
      "headline": "Watch: Riyan Parag fan invades pitch in Guwahati, touches RR star's feetIPL 2025, RR vs KKR: A fan breached security and invaded the pitch to catch a glimpse of Riyan Parag, who was leading Rajasthan Royals in his hometown, Guwahati. However, Rajasthan put on a disappointing display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-second-ball-rule-used-first-time-2699700-2025-03-26",
      "headline": "IPL 2025: Second ball rule applied for the  first time in RR vs KKRRajasthan Royals became the first IPL team to use the second ball rule in 2025, but it was not enough to prevent an eight-wicket defeat to Kolkata Knight Riders, led by Quinton de Kock's unbeaten 97 on a slow Guwahati pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-player-of-match-reaction-2699695-2025-03-26",
      "headline": "Quinton de Kock downplays retirement impact after record 97 for KKR vs RRIPL 2025, RR vs KKR: Quinton de Kock showed glimpses of vintage form with a record-breaking 97 off just 61 balls. On a sluggish pitch, the South African veteran stood out, helping KKR comfortably chase down 152 in Guwahati on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-moeen-ali-steps-up-sunil-narine-absence-2699694-2025-03-26",
      "headline": "No Sunil Narine, no problem for KKR: Moeen Ali steps up vs RRMoeen Ali stepped up in Sunil Narine's absence, producing a brilliant 2/23 spell as KKR defeated Rajasthan Royals by eight wickets to claim their first IPL 2025 victory, with Quinton de Kock's unbeaten 97 sealing the win in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-moeen-ali-varun-chakravarthy-guwahati-2699676-2025-03-26",
      "headline": "De Kock and spinners get KKR off the mark as RR stumble at Riyan's homeIPL 2025, RR vs KKR: Quinton de Kock's unbeaten 97 and a spin-bowling masterclass from Varun Chakravarthy and Moeen Ali helped Kolkata Knight Riders outclass Rajasthan Royals by eight wickets. Rajasthan, playing in Riyan Parag's hometown, suffered their second successive defeat of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-riyan-parag-fan-pitch-invader-touches-feet-2699663-2025-03-26",
      "headline": "Watch: Riyan Parag fan invades pitch in Guwahati, touches RR star's feetIPL 2025, RR vs KKR: A fan breached security and invaded the pitch to catch a glimpse of Riyan Parag, who was leading Rajasthan Royals in his hometown, Guwahati. However, Rajasthan put on a disappointing display."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}