{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/crude-oil-prices-seen-to-stabilise-as-all-out-war-fears-recede-middle-east-iran-israel-conflict-2613194-2024-10-08",
      "headline": "Crude oil prices seem to stabilise as all-out war fears recedeTensions between Israel and Iran led to a 13 per cent spurt in Brent crude prices in the past seven days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reacts-to-china-stimulus-further-dip-in-sensex-nifty-goldman-sachs-analyst-review-2613186-2024-10-08",
      "headline": "Stock market reacts to China stimulus: Is there further dip in Sensex, Nifty?Despite some analysts hoping that foreign portfolio investment (FPI) outflows from India might reverse, further declines in Indian stocks cannot be dismissed, as per experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-fall-6-percent-after-ccpa-show-cause-notice-drops-46-percent-from-all-time-high-2613167-2024-10-08",
      "headline": "Ola Electric shares fall 6% after show cause notice; drops 46% from peakOla Electric has been given 15 days to respond to the notice and will provide the required documents within that time frame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-global-uncertainty-fuels-cautious-sentiment-2613156-2024-10-08",
      "headline": "Sensex, Nifty open flat as global uncertainty fuels cautious sentimentThe S&P BSE Sensex gained 321.03 points to 81,371.03, while the Nifty50 added 73.45 points to 24,869.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ola-electric-central-consumer-protection-authority-ev-consumer-complaints-2612988-2024-10-07",
      "headline": "Central panel's notice to Ola after surge in complaints against EVs: SourcesThe Central Consumer Protection Authority (CCPA) has taken cognisance of thousands of complaints and issued a show-cause notice to Ola Electric, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-expectation-october-rate-cut-on-card-governor-shaktikanta-das-to-announce-soon-2612684-2024-10-07",
      "headline": "RBI MPC: Is rate cut on card? Shaktikanta Das to announce soonSpeculation has grown about the possibility of a rate cut or a shift in monetary policy, especially after the US Federal Reserve delivered an unexpected 50-basis-point cut in September 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zepto-new-hq-bengaluru-shifting-base-total-mall-sarjapur-by-february-cost-rs-3-4-crore-2612655-2024-10-07",
      "headline": "Zepto shifting its base to Total Mall in Sarjapur, Bengaluru: ReportZepto had earlier asked its 1,700-1,800 employees to move from its current base in Powai, Mumbai, to Bengaluru. However, the timeline was pushed back due to delays in finalising an appropriate location."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-in-red-despite-it-boost-global-factors-weigh-heavy-2612593-2024-10-07",
      "headline": "Sensex, Nifty close in red despite IT boost; global factors weigh heavyThe S&P BSE Sensex lost 638.45 points to end at 81,050, while the NSE Nifty50 was down 218.85 points to close at 24,795.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nbcc-india-shares-show-30-down-on-mobile-trading-apps-why-reason-explained-2612529-2024-10-07",
      "headline": "Explained: Why NBCC India shares are falling 30% on mobile trading appsThe company has performed well in recent times, with its shares increasing by 109% in 2024 and a massive 192% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-ceo-mark-zuckerberg-designs-minivan-for-wife-shows-off-his-his-and-hers-porsches-2612527-2024-10-07",
      "headline": "Mark Zuckerberg flaunts 'his and her' Porsches, designs minivan for wifeZuckerberg posted photos and videos of a Porsche 911 GT3 with a touring package for himself, and a customised Porsche Cayenne Turbo GT Minivan for Priscilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rvnl-irfc-irco-shares-railway-stocks-fall-up-to-8-percent-check-here-2612489-2024-10-07",
      "headline": "RVNL, IRFC, IRCON: Railway stocks fall up to 8%. Check hereRailway stocks such as RVNL, IRFC, IRCON saw a decline on the stock exchanges on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-7-2024-precious-metals-witness-dip-on-mcx-latest-rates-2612434-2024-10-07",
      "headline": "Gold, silver price today, October 7, 2024: Precious metals witness dip on MCXGold Price Today October 7, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-ola-electric-share-fall-8-percent-today-ceo-bhavish-aggarwal-spat-kunal-kamra-social-media-2612429-2024-10-07",
      "headline": "Ola Electric shares tank 8% in early trade day after CEO's ugly spat with comicOla Electric shares have dropped 43% from its all-time high, and has seen a decline in five of the last six trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-oversized-tshirt-new-business-meta-ceo-fashion-partnership-mike-amiri-2612399-2024-10-07",
      "headline": "Fashion venture on cards: Is Mark Zuckerberg shifting from tech to trendy? Known for his casual wardrobe, which usually includes plain grey t-shirts and hoodies, Zuckerberg is now adding a personal touch to his outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-fii-assets-surpass-usd-1-trillion-equity-holdings-at-6-month-peak-2612384-2024-10-07",
      "headline": "India's FII assets surpass $1 trillion, equity holdings at 6-month peakFor the first time, the total assets under custody of FIIs across various investment vehicles, including debt, equity, alternative investment funds (AIF), mutual funds, and hybrid funds, surpassed $1 trillion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rebound-after-last-week-slump-led-by-rally-in-it-stocks-2612358-2024-10-07",
      "headline": "Sensex, Nifty rebound after last week's slump led by rally in IT stocksThe S&P BSE Sensex was up 239.85 points to 81,928.30, while the NSE Nifty50 added 60.40 points to 25,075.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adidas-puma-rivalry-dassler-brothers-history-sibling-feud-adolf-rudolf-succession-war-2611900-2024-10-06",
      "headline": "Succession Wars: Sibling rivalry that led to the birth of Adidas and PumaAdolf 'Adi' Dassler and Rudolf Dassler, transformed the world of sports footwear through innovation, ambition, and intense sibling rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/iltija-mufti-srigufwara-bijbehara-people-democratic-party-candidate-concede-accepts-defeat-2613193-2024-10-08",
      "headline": "PDP's Iltija Mufti concedes defeat: I accept people's verdictIltija Mufti, PDP candidate and daughter of former J&K Chief Minister Mehbooba Mufti, conceded defeat in the Srigufwara-Bijbehara constituency, accepting the people's verdict and expressing gratitude to her party workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-jammu-and-kashmir-national-conference-congress-alliance-election-results-2613243-2024-10-08",
      "headline": "Told you: Omar Abdullah mocks exit polls as NC-Congress set for J&K winOmar Abdullah made the remarks days after expressing scepticism about the reliability of exit polls while pointing to their failures during the recent Lok Sabha elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-pakistan-visit-bilateral-talks-shanghai-cooperation-organisation-2613119-2024-10-08",
      "headline": "S Jaishankar's remarks self-explanatory: Pak on bilateral talks with IndiaS Jaishankar, who will lead a delegation to Islamabad next week, had also toed a similar line and maintained that his visit was meant for a multilateral event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/suhail-hussein-husseini-commander-of-hezbollah-headquarters-killed-in-beirut-strikes-israeli-military-2613171-2024-10-08",
      "headline": "Commander of Hezbollah headquarters killed in Beirut strikes: Israeli militaryIn a social media post, the IDF claimed that Hezbollah's logistics unit head Suhail Hussein Husseini was killed following a strike on a compound in Beirut. There was no immediate comment from Hezbollah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-chasing-the-yummy-mummy-ideal-image-is-just-toxic-2612555-2024-10-08",
      "headline": "Why chasing the Yummy Mummy ideal image is just toxicAlong with caring for their babies, new moms should focus on their own health. But this doesn't mean they have to obsess over fitness to fit the 'yummy mummy' image seen on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zakir-naik-pakistan-international-airlines-extra-baggage-complaint-trolled-social-media-2613085-2024-10-08",
      "headline": "Pakistanis troll state guest Zakir Naik who wanted extra baggage fee waivedZakir Naik has been living in Malaysia since 2016 after the National Investigation Agency registered a case against him in the wake of the Dhaka terror attack, where one of the attackers admitted that he was influenced by the controversial preacher's speeches. India has requested his extradition, but Malaysia has not complied so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/engineer-rashid-omar-abdullah-jammu-and-kashmir-assembly-elections-results-nc-congress-pdp-bjp-2613115-2024-10-08",
      "headline": "If government formation is delayed for 10 days...: Engineer Rashid jabs Omar AbdullahEngineer Rashid, accused National Conference (NC) leader Omar Abdullah of changing his stance while citing his earlier statement that he would not contest elections in Jammu and Kashmir unless statehood was restored."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyber-fraud-fake-phone-call-unknown-number-digitally-trapped-for-hours-victim-account-2612768-2024-10-07",
      "headline": "I thought it was a scam call until I didn't: Journalist's digital arrest ordealA journalist received a call from a courier company claiming her Aadhaar number was linked to a parcel containing drugs. What followed was an hours-long ordeal that made the journalist feel as though she was being held digitally hostage by scammers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/tourist-slaps-performer-dressed-as-winnie-the-pooh-in-a-video-from-shanghai-disneyland-2613206-2024-10-08",
      "headline": "Video: Tourist slaps Winnie the Pooh mascot at Shanghai Disneyland, internet furiousA video of a tourist assaulting a Winnie the Pooh mascot during a parade at Shanghai Disneyland has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-results-2024-live-updates-vote-counting-congress-bjp-jjp-aap-bhupinder-hooda-nayab-saini-dushyant-chautala-2612972-2024-10-07",
      "headline": "BJP consolidates lead in Haryana in huge turnaround, trends showHaryana Election result: The BJP took a significant lead and eroded Congress's initial gains in a huge turnaround in Haryana as counting for the Assembly polls was on. The counting began with the BJP taking a very early lead before the Congress overshot the party. But an hour later, the BJP made a huge turnaround, entering into a neck-to-neck contest with the Congress before taking a slender lead, with the party touching the majority mark. The counting of votes for all 90 Assembly constituencies began at 8 am today. The BJP has been ruling Haryana since 2014 and is eyeing a hat-trick. However, it faces a formidable challenge from the Congress, which is seeking to make a comeback to the northern state after a decade. Most exit polls, including India Today CVoter exit poll, predicted a huge win for the Congress, suggesting that the party is likely to get 50-58 seats while the BJP may get 20-28 seats. Follow indiatoday.in for live updates of 2024 Haryana Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-kashmir-assembly-election-results-2024-live-updates-vote-counting-congress-nc-bjp-pdp-india-bloc-2612774-2024-10-07",
      "headline": "NC-Congress alliance ahead in Jammu and Kashmir as counting progressesJ&K Election Results 2024 Live: The counting of votes for the high-stakes election to choose 90 members of the Jammu and Kashmir Assembly began at 8 am. The crucial polls were held after a decade and the first since the abrogation of Article 370. The union territory witnessed a fierce contest between regional heavyweights like Farooq Abdullah's National Conference and Mehbooba Mufti's PDP, along with national parties such as the Congress and BJP, and other players. According to the CVoter exit poll shown on India Today, the Congress-National Conference alliance is projected to have an edge, while the BJP struggles to make inroads in the Kashmir Valley, though they are expected to perform better in the Jammu region. Will Jammu and Kashmir witness a hung assembly, or will the BJP, PDP, or independents emerge as kingmakers?  The picture will become clearer as the counting progresses. Stay tuned to IndiaToday.in as we bring the latest election results from Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-polls-chitra-sarwara-independent-candidate-from-ambala-cantt-leading-against-bjp-anil-vij-2613218-2024-10-08",
      "headline": "Chitra Sarwara gives tough fight to BJP's Anil Vij in Ambala, leads by 617 votesIndependent candidate Chitra Sarwara is contesting against senior BJP leader Anil Vij and Congress's Parvinder Pal Pari in the 2024 Haryana Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/after-mira-murati-another-openai-executive-leaves-company-2613235-2024-10-08",
      "headline": "After Mira Murati, another OpenAI executive leaves company  Tim Brooks, a pivotal figure at OpenAI, is departing to join Google DeepMind, marking another high-profile exit from the company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-election-results-2024-aam-aadmi-party-seats-arvind-kejriwal-2613190-2024-10-08",
      "headline": "AAP seen drawing blank in Haryana despite Arvind Kejriwal's 'son of soil' pushAAP, which was hoping to get a foothold in the state after coming to power in neighbouring Delhi and Punjab, contested 89 seats after failing to stitch up an alliance with Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindus-minorities-rights-protect-united-states-urge-muhammad-yunus-durga-puja-celebrations-2613163-2024-10-08",
      "headline": "US urges Bangladesh to protect rights of Hindus as Durga Puja celebrations beginThe statement from the US comes in the wake of increasing attacks on the minority Hindu community in Bangladesh following the resignation of Sheikh Hasina as the Prime Minister and her escape to India in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-fall-6-percent-after-ccpa-show-cause-notice-drops-46-percent-from-all-time-high-2613167-2024-10-08",
      "headline": "Ola Electric shares fall 6% after show cause notice; drops 46% from peakOla Electric has been given 15 days to respond to the notice and will provide the required documents within that time frame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-sunil-gavaskar-gohit-gautam-gambhir-footlicking-icc-2612698-2024-10-07",
      "headline": "Crediting Gambhir for Kanpur Test win is foot-licking of highest quality: GavaskarIndia vs Bangladesh: In a strongly-worded column, legendary Sunil Gavaskar said it was disappointing to see Gautam Gambhir getting credit for India's Kanpur Test victory. Gavaskar said India have been playing fearless and aggressive cricket under Rohit Sharma's captaincy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-girl-boyfriend-marry-upset-kills-13-family-members-poison-rotis-2613152-2024-10-08",
      "headline": "Upset at not being allowed to marry boyfriend, Pak girl poisons 13 family membersThe incident happened on August 19, and the girl confessed to the police to mixing poison in the wheat with the help of her boyfriend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uchana-kalan-assembly-election-results-2024-live-updates-vote-counting-congress-bjp-dushyant-chautala-brijendra-singh-2613028-2024-10-07",
      "headline": "Live: JJP's Dushyant Chautala trails behind Congress's Brijendra Singh by 23,000 votes in Uchana KalanUchana Kalan Assembly Election Result 2024 Live: The Uchana Kalan Assembly constituency has emerged as one of the most closely watched seats in the Haryana election, with former Deputy Chief Minister and Jannayak Janta Party (JJP) leader Dushyant Chautala seeking a second consecutive term. Dushyant, the great-grandson of former Deputy Prime Minister Devi Lal, is contesting after the JJP ended its alliance with the BJP months before the polls. In a fierce contest, the Congress has fielded former bureaucrat Brijendra Singh, while the Aam Aadmi Party (AAP) has nominated Pawan Fauji. The BJP, on the other hand, has put forward Devender Attri as its candidate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-thanjavur-sub-inspector-caught-on-cctv-slapping-shopkeeper-viral-video-sparks-investigation-outrage-2613180-2024-10-08",
      "headline": "Cop slaps elderly shop owner during raid, video sparks outrageThe sub-inspector was dispatched to the shop to investigate the alleged sale of illegal tobacco products after the police received a tip-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/watch-viral-video-the-tribe-star-alanna-panday-gets-scolded-by-father-for-wearing-bralette-2613199-2024-10-08",
      "headline": "Watch: The Tribe star Alanna Panday gets scolded by father for wearing braletteAlanna Panday, who is one of the five content creators on the Prime Video series The Tribe, was taken aback when her father, Chikki Pandey, jokingly asked her to cover her bralette with a shirt during a family conversation at their Mumbai home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-palestine-conflict-hamas-leader-khaled-meshaal-gaza-war-middle-east-crisis-2613210-2024-10-08",
      "headline": "Hamas leader in-exile says they will rise like a phoenix from the ashesHamas leader-in-exile Khaled Meshaal said the Palestinian group would rise from the ashes despite heavy losses during a year of war with Israel. He said Palestinian history is made of cycles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/hisar-assembly-election-results-2024-live-updates-vote-counting-congress-bjp-kamal-gupta-ram-niwas-rara-savitri-jindal-candidates-2613043-2024-10-08",
      "headline": "Live: Savitri Jindal leads in Hisar by 7,897 votes after 2nd roundHisar Assembly Election Result 2024 Live: Counting of votes in Hisar Assembly in Haryana began at 8 am today. It is one of the 90 seats in the Haryana Legislative Assembly which went to polls on October 5. Stay tuned for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-leela-bhansali-cry-watching-ranbir-kapoor-perform-saawariya-climax-great-actor-2613244-2024-10-08",
      "headline": "Sanjay Bhansali would cry watching Ranbir Kapoor perform: He is a great actorRanbir Kapoor debuted in Saawariya in 2007, impressing Sanjay Leela Bhansali with his climax performance. Bhansali is set to direct him again in Love and War, co-starring Alia Bhatt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-leela-bhansali-love-and-war-remake-of-sangam-alia-bhatt-ranbir-kapoor-vicky-kaushal-2613239-2024-10-08",
      "headline": "Sanjay Leela Bhansali's Love and War, a remake of Sangam? Filmmaker clarifies Director Sanjay Leela Bhansali recently dismissed rumours of his next Love and War being a remake of Sangam. He shared that one should not remake films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/karan-johar-attend-national-film-awards-ceremony-in-delhi-2613228-2024-10-08",
      "headline": "Video: Karan Johar jets off to attend National Film Awards ceremony in DelhiKaran Johar was clicked at the Mumbai airport. He is headed to Delhi to attend the National Film Awards ceremony. He is there to collect the award for Ranbir Kapoor and Alia Bhatt-starrer Brahmastra Part One: Shiva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/vivian-dsena-bigg-boss-18-salman-khan-exclusive-2613236-2024-10-08",
      "headline": "Vivian Dsena on dealing with fights in Bigg Boss 18: Can't predict how I'll reactVivian Dsena shared that he stepped into the Bigg Boss 18 house because of his wife and friends. They encouraged him to embrace the challenge and grow beyond his comfort zone."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-sam-curran-ben-stokes-injury-replacement-gutted-test-squad-2613226-2024-10-08",
      "headline": "A little bit gutted: Curran on being snubbed as Stokes's Test replacementSam Curran expressed disappointment over missing the chance to replace injured Ben Stokes in England's Test squad, believing it was an ideal opportunity to make his long-awaited return to Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/exclusive-paralympic-champion-nitesh-kumar-demands-transparency-2613217-2024-10-08",
      "headline": "Paralympic champion Nitesh Kumar demands transparency from BAIIndian badminton won a total of 5 medals at the Paris Paralympics. While the Badminton Association of India announced cash prices for the medallists, gold medallist Nitesh Kumar says there is much to be desired from the BAI in terms of welfare of the athletes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pitches-not-suiting-shafali-verma-smriti-mandhana-manjrekar-2613211-2024-10-08",
      "headline": "T20 World Cup pitches not suiting Shafali Verma, Smriti Mandhana: ManjrekarWomen's T20 World Cup: Top India batters Shafali Verma and Smriti Mandhana are struggling in the tournament because the UAE pitches are not suiting them, feels Sanjay Manjrekar. Both batters struggled to play their natural attacking styles in the first 2 games.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-to-miss-mumbais-ranji-trophy-opener-set-for-ind-vs-nz-series-2613201-2024-10-08",
      "headline": "Sarfaraz Khan to miss Mumbai's Ranji Trophy opener, set for IND vs NZ seriesSarfaraz Khan is all set to be retained in the India squad for the New Zealand series and miss Mumbai opening match of the Ranji Trophy against Baroda, according to the latest reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-andres-iniesta-special-retirement-message-a-phenomenon-fc-barcelona-2613187-2024-10-08",
      "headline": "Lionel Messi pens special message to Andres Iniesta on retirementLionel Messi shared a touching tribute to his former Barcelona teammate Andrés Iniesta, as the Spanish legend announced his retirement, celebrating their iconic partnership and Iniesta's incredible footballing legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-cricket-team-sanath-jayasuriya-full-time-coach-reaction-2613181-2024-10-08",
      "headline": "Confidence, trust, bit of luck: Sanath Jayasuriya's recipe for Sri Lanka revivalSanath Jayasuriya has said that confidence, trust and a bit of luck has been the reasons behind his success as the coach of the Sri Lankan team. Jayasuriya was given the permanent job on October 7, Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-indian-cricket-team-punjabi-welcome-suryakumar-yadav-delhi-2613157-2024-10-08",
      "headline": "India ki shaan Suryakumar: Hosts get traditional punjabi welcome in DelhiThe Indian team got a traditional punjabi welcome as they arrived in Delhi ahead of the second T20I against Bangladesh on Monday, October 7. India will aim to clinch the series with a win at the Arun Jaitley stadium on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-travis-head-opener-bumrah-ashwin-siraj-chappell-2613147-2024-10-08",
      "headline": "Don't use Travis Head as opener in Tests against India: Ian ChappellFormer Australia cricketer Ian Chappell has warned the team against using Travis Head as an opener against India. Australia are facing a crisis at the openers' spot since the retirement of David Warner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/serie-a-como-offer-napoli-fans-free-beer-to-reward-warm-reception-at-maradona-2613146-2024-10-08",
      "headline": "Como offer Napoli fans free beer to reward warm reception at MaradonaComo has announced that they will be offering Napoli fans free beer in February when they welcome Antonio Conte's side for the return match. The Como team and fans got a warm reception at the Maradona recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-all-rounder-axar-patel-set-to-welcome-first-child-with-wife-meha-2613132-2024-10-08",
      "headline": "India all-rounder Axar Patel set to welcome first child with wife MehaIndia all-rounder Axar Patel has announced that he and his wife Meha are expecting the arrival of their first child on Monday, September 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-indian-cricket-team-punjabi-welcome-suryakumar-yadav-delhi-2613157-2024-10-08",
      "headline": "India ki shaan Suryakumar: Hosts get traditional punjabi welcome in DelhiThe Indian team got a traditional punjabi welcome as they arrived in Delhi ahead of the second T20I against Bangladesh on Monday, October 7. India will aim to clinch the series with a win at the Arun Jaitley stadium on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-travis-head-opener-bumrah-ashwin-siraj-chappell-2613147-2024-10-08",
      "headline": "Don't use Travis Head as opener in Tests against India: Ian ChappellFormer Australia cricketer Ian Chappell has warned the team against using Travis Head as an opener against India. Australia are facing a crisis at the openers' spot since the retirement of David Warner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/serie-a-como-offer-napoli-fans-free-beer-to-reward-warm-reception-at-maradona-2613146-2024-10-08",
      "headline": "Como offer Napoli fans free beer to reward warm reception at MaradonaComo has announced that they will be offering Napoli fans free beer in February when they welcome Antonio Conte's side for the return match. The Como team and fans got a warm reception at the Maradona recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-all-rounder-axar-patel-set-to-welcome-first-child-with-wife-meha-2613132-2024-10-08",
      "headline": "India all-rounder Axar Patel set to welcome first child with wife MehaIndia all-rounder Axar Patel has announced that he and his wife Meha are expecting the arrival of their first child on Monday, September 7. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ire-vs-sa-paul-stirling-guides-ireland-to-consolation-win-in-final-odi-2613125-2024-10-08",
      "headline": "IRE vs SA: Paul Stirling guides Ireland to consolation win in final ODIIRE vs SA: Ireland bagged a consolation win in the final ODI of the series with a 69-run victory. Ireland captain Paul Stirling starred on the day, hitting 88 off 92 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-aus-vs-nz-live-streaming-when-and-where-to-watch-live-2612985-2024-10-08",
      "headline": "Women's T20 World Cup, AUS vs NZ Live streaming: When and where to watch liveNew Zealand and Australia will face each other in a trans-Tasman rivalry at the Women's T20 World Cup 2024. Find out all the live streaming details of the exciting contest here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-brother-musheer-accident-2613108-2024-10-08",
      "headline": "Sarfaraz Khan celebrates Irani Trophy win with father, injured brotherInda and Mumbai batter Sarfaraz Khan celebrated the Irani Trophy win with his father and injured brother. Sarfaraz's brother Musheer was ruled out of the Irani Trophy due to a road accident.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-new-schedule-conflict-rodri-dani-cravajal-kevin-de-bruyne-injury-2612720-2024-10-08",
      "headline": "Rodri, Carvajal, De Bruyne: Injury haunts players against new scheduleDani Carvajal's ACL tear highlights mounting player concerns over the congested football calendar, as elite athletes like Kevin De Bruyne and Rodri suffer significant injuries in the wake of gruelling schedules imposed by expanded club competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-new-zealand-india-semi-final-qualification-2612762-2024-10-08",
      "headline": "India will be cheering New Zealand to beat Australia. Here's why Women's T20 World Cup 2024: Harmanpreet Kaur's India will hope for New Zealand to beat Australia in their upcoming clash on Tuesday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shan-masood-gifted-special-jersey-on-completing-2000-runs-during-pak-vs-eng-2613058-2024-10-07",
      "headline": "Watch: Shan Masood gifted special jersey on completing 2000 runs during PAK vs ENGPakistan captain Shan Masood was presented with a special jersey by the PCB on completing 2000 Test runs. Masood scored a scintillating hundred on Day 1 of 1st Test vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/suzie-bates-new-zealand-india-hammering-australia-press-conference-2613057-2024-10-07",
      "headline": "Suzie Bates backs New Zealand to replicate India hammering vs Australia Women's T20 World Cup 2024: Suzie Bates said that if New Zealand can perform the way they did against India, they have every chance of beating Alyssa Healy's Australia on Tuesday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-coach-jp-duminy-rewinds-clock-while-fielding-as-substitute-for-south-africa-2613048-2024-10-07",
      "headline": "Watch: Coach JP Duminy rewinds clock while fielding as substitute for South AfricaJP Duminy turned back the clock by stepping onto the field for South Africa in Abu Dhabi as a substitute fielder. Battling injuries and fatigue, the Proteas struggled against Ireland, who are now eyeing their first-ever ODI win over them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-new-zealand-india-semi-final-qualification-2612762-2024-10-08",
      "headline": "India will be cheering New Zealand to beat Australia. Here's why Women's T20 World Cup 2024: Harmanpreet Kaur's India will hope for New Zealand to beat Australia in their upcoming clash on Tuesday at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shan-masood-gifted-special-jersey-on-completing-2000-runs-during-pak-vs-eng-2613058-2024-10-07",
      "headline": "Watch: Shan Masood gifted special jersey on completing 2000 runs during PAK vs ENGPakistan captain Shan Masood was presented with a special jersey by the PCB on completing 2000 Test runs. Masood scored a scintillating hundred on Day 1 of 1st Test vs England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/suzie-bates-new-zealand-india-hammering-australia-press-conference-2613057-2024-10-07",
      "headline": "Suzie Bates backs New Zealand to replicate India hammering vs Australia Women's T20 World Cup 2024: Suzie Bates said that if New Zealand can perform the way they did against India, they have every chance of beating Alyssa Healy's Australia on Tuesday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-coach-jp-duminy-rewinds-clock-while-fielding-as-substitute-for-south-africa-2613048-2024-10-07",
      "headline": "Watch: Coach JP Duminy rewinds clock while fielding as substitute for South AfricaJP Duminy turned back the clock by stepping onto the field for South Africa in Abu Dhabi as a substitute fielder. Battling injuries and fatigue, the Proteas struggled against Ireland, who are now eyeing their first-ever ODI win over them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-south-africa-sharjah-report-nat-sciver-brunt-laura-wolvaardt-2613037-2024-10-07",
      "headline": "Clinical England go top of table with 7-wicket win vs South AfricaWomen's T20 World Cup 2024: Heather Knight's England continued their unbeaten run after beating Laura Wolvaardt's South Africa by seven wickets on Monday at the Sharjah Cricket Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nat-sciver-brunt-sune-luus-south-africa-vs-england-run-out-sharjah-2613007-2024-10-07",
      "headline": "Watch: England's Nat Sciver-Brunt shows footy skills in bizarre run out Women's T20 World Cup 2024: Nat Sciver-Brunt affected a bizarre run out to dismiss Sune Luus when England and South Africa faced each other in Sharjah on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/netherlands-football-great-johan-neeskens-dies-aged-73-2613002-2024-10-07",
      "headline": "Netherlands football great Johan Neeskens dies aged 73Dutch football legend Johan Neeskens, renowned for his role in the Netherlands' famed \"Clockwork Orange\" teams of the 1970s, has passed away at the age of 73. The Dutch soccer association (KNVB) announced his death, which occurred in Algeria during a coaching project. No cause of death has been disclosed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-molineux-australia-vs-new-zealand-sharjah-press-conference-2612984-2024-10-07",
      "headline": "Sophie Molineux wants Australia to fight fire with fire vs New Zealand  Women's T20 World Cup 2024: Sophie Molineux said that Australia will be going out with intensity against an in-form New Zealand, who beat India by 58 runs in Dubai earlier. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}