{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-kekius-maximus-memecoin-elon-musk-new-identity-on-x-price-of-kekius-2657805-2024-12-31",
      "headline": "What is Kekius Maximus? Elon Musk's new identity on XBy adopting the name 'Kekius Maximus' on X, Musk sent the KEKIUS memecoin soaring 500%, sparking renewed interest in the crypto market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-marginally-lower-in-last-trading-session-of-2024-2657803-2024-12-31",
      "headline": "Sensex, Nifty end marginally lower in last trading session of 2024The S&P BSE Sensex fell by 109.12 points to settle at 78,139.01, while the Nifty50 edged down by 0.10 points, closing at 23,644.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-in-2025-sensex-and-nifty-dalal-street-turbulence-continue-experts-2657741-2024-12-31",
      "headline": "Sensex and Nifty in 2025: Will Dalal Street's turbulent run continue?Following a volatile 2024 that saw significant gains in the first half before moderating, market experts anticipate single-digit returns in the coming year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-extended-for-belated-revised-return-cbdt-new-date-income-tax-check-all-details-stmp-2657711-2024-12-31",
      "headline": "ITR filing deadline extended for belated/revised return. Check all detailsUnion Minister of State for Finance Pankaj Chaudhary recently revealed in Parliament that only 6.68% of India's population filed ITRs in the fiscal year 2023-24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-2025-investment-tips-top-9-stocks-portfolio-new-year-shriram-finance-fortis-doms-airtel-2657699-2024-12-31",
      "headline": "Looking to invest in stocks in 2025? 9 picks for your portfolio this New YearThe year 2024 has been decent for Indian stock markets. Both key market indices - the NSE Nifty 50 and the S&P BSE Sensex - went up by 9% during the year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-rites-share-price-surged-10-percent-today-explained-stmp-2657681-2024-12-31",
      "headline": "Explained: Why RITES share price surged 10% todayRITES stock price: The stock opened at Rs 267.15 and soared to an intraday high of Rs 302.80, supported by increased investor interest and heightened trading activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-extends-vivad-se-vishwas-scheme-2024-deadline-to-january-31-key-penalty-interest-details-2657664-2024-12-31",
      "headline": "Income Tax extends Vivad Se Vishwas deadline to January 31. Key penalty detailsThe Income Tax Department has extended the Vivad Se Vishwas Scheme deadline to January 31, 2025, offering taxpayers a chance to settle disputes at reduced rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-share-price-rebounds-after-falling-in-previous-session-explained-stmp-2657653-2024-12-31",
      "headline": "Dam Capital share price rebounds after Monday's slump. Here's whyDam Capital stock price:  By 11 am, the shares were trading 3.60% higher at Rs 385.70, recovering some ground lost during Monday's profit booking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iti-share-price-continues-positive-rally-reaches-all-time-high-stmp-2657642-2024-12-31",
      "headline": "ITI share price hits record high as positive rally continuesITI share price: The recent rally has propelled ITI Ltd. above its 5-day, 20-day, 50-day, 100-day, and 200-day moving averages, underlining its robust performance across short- and long-term benchmarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-share-price-stock-falls-10-percent-on-promoter-nishant-pitti-stake-sale-stmp-2657636-2024-12-31",
      "headline": " Explained: Why Easy Trip Planners shares tanked 10% today The shares hit a low of Rs 15.42 on the NSE, a decline of 9.51%. The stock saw a turnover of Rs 127.43 crore on the NSE during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-share-price-90-percent-premium-rs-1491-bse-bumper-debut-multibagger-2657628-2024-12-31",
      "headline": "Unimech Aerospace IPO listing: Shares make bumper debut. Lists at 90% premiumUnimech Aerospace IPO stock: Unimech Aerospace shares listed at Rs 1,491 per share, reflecting an 89.94% premium over their issue price on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-in-red-it-stocks-decline-last-session-of-2024-adani-enterprises-down-over-1-percent-2657617-2024-12-31",
      "headline": "Sensex, Nifty drop as IT stocks weigh on markets in last session of 2024The S&P BSE Sensex lost 392.61 points to 77,855.52, while the NSE Nifty50 was down by 107.80 points to 23,537.10 as of 9:28 AM. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-open-for-bidding-check-latest-gmp-price-band-issue-size-all-details-2657609-2024-12-31",
      "headline": "Indo Farm Equipment IPO opens for bidding: Check GMP, price band, issue sizeIndo Farm Equipment IPO: The IPO is a book-built issue valued at Rs 260.15 crore. It includes a fresh issue of 86 lakh shares, amounting to Rs 184.90 crore, and an offer for sale (OFS) of 35 lakh shares, valued at Rs 75.25 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-gmp-declines-will-it-make-strong-market-debut-today-2657598-2024-12-31",
      "headline": " Unimech Aerospace IPO GMP declines: Will it make strong market debut today? The initial public offering (IPO) of Unimech Aerospace and Manufacturing Limited garnered an overwhelming response, with a subscription rate of 174.93 times by the final day of bidding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-enterprises-adani-wilmar-easemytrip-itc-zomato-unimech-aerospace-2657590-2024-12-31",
      "headline": "Stocks to watch today: Adani Enterprises, Adani Wilmar, EaseMyTrip, ITC, ZomatoShares of Adani Enterprises, Adani Wilmar, Zoamto, EaseMyTrip, etc will be in the spotlight today due to various developments when markets open for trading. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-itr-filing-will-the-old-tax-regime-face-the-axe-2657339-2024-12-30",
      "headline": "Budget 2025: Will the old tax regime face the axe?With Budget 2025 approaching, debates intensify over the potential scrapping of the Old Tax Regime amidst tax reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-sell-entire-adani-wilmar-stake-in-usd-2-billion-deal-lence-pte-ltd-divestment-2657295-2024-12-30",
      "headline": "Adani Enterprises to sell entire Adani Wilmar stake in $2 billion dealAdani Enterprises and its wholly-owned subsidiary, Adani Commodities LLP (ACL), have entered into an agreement with Lence Pte Ltd, a fully-owned subsidiary of Wilmar International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-450-points-nifty-declines-adani-enterprises-jumps-7-percent-2657286-2024-12-30",
      "headline": "Sensex falls over 450 points, Nifty declines; Adani Enterprises jumps 7%The S&P BSE Sensex ended 450.94 points lower at 78,248.13, while the NSE Nifty50 settled 168.50 points lower at 23,644.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/greaves-cotton-share-price-jumps-13-percent-52-week-high-today-why-vijay-kedia-greaves-electric-mobility-ipo-stmp-2657274-2024-12-30",
      "headline": "Greaves Cotton share price surges 13% to hit 52-week high today. Here's why Greaves Cotton share price hit 52-week high. The share which had closed at Rs 281.83 on Friday, opened at Rs 288.70 on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-fixed-deposits-still-the-best-bet-for-indian-investors-is-fd-safe-2657273-2024-12-30",
      "headline": "Are fixed deposits still the best bet for Indian investors?Fixed deposits are safe but face risks like limited protection, reinvestment challenges, and low post-tax real returns."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-year-2025-india-countdown-event-new-zealand-fireworks-australia-new-york-lighting-global-celebrations-2657946-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2025 arrives: India, Australia, Japan, China among countries to welcome New YearAs 2024 concluded, New Zealand led the way into 2025 with dazzling celebrations, setting the stage for global festivities, from Sydney's grand display to India's city-wise countdown events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-reunification-taiwan-xi-jinping-speech-military-presence-pro-independent-forces-2657991-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No one can stop our reunification: Xi Jinping warns Taiwan in New Year's speechIn the past year, Beijing has stepped up military pressure near Taiwan, sending warships and planes almost daily into the waters and air space around the island in what Taiwanese officials view as a creeping effort to \"normalise\" China's military presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-lieutenant-governor-vk-saxena-chief-minister-atishis-temple-demolition-allegations-cheap-politics-2658016-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Lt Governor refutes Atishi's temple demolition allegations: Cheap politicsRefuting the Chief Minister's allegations, the Lieutenant Governor's office issued a statement saying that no religious structures or any temples, mosques, churches were being demolished. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-new-year-test-sydney-big-call-drop-2657957-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Rohit Sharma do what's best for Team India in the New Year's Test?Australia vs India, 5th Test: Captain Rohit Sharma faces mounting scrutiny after a string of failures in the Border-Gavaskar Trophy, with questions arising about his form and leadership. As India fight to salvage the series in Sydney, Rohit's choices could define both the team's fate and his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/gen-beta-has-arrived-what-can-we-expect-from-them-2657962-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Gen Beta era is here. What will define their journey?Children of younger millennials and older Gen Z, Gen Beta will be born into a world dominated by technology and AI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-commander-nukhba-abd-al-hadi-sabah-drone-attack-killed-gazas-khan-younis-2658019-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel says top Hamas commander behind October 7 attack killed in drone strikeAbd al-Hadi Sabah, a commander in Hamas's elite Nukhba force, who was among those who led the October 7, 2023 terror onslaught, has been killed in a recent Israeli drone strike. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-new-year-2025-wishes-greetings-new-opportunities-success-endless-joy-tweet-2658041-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "May this year bring new opportunities, endless joy: PM wishes nation on new yearPrime Minister Narendra Modi welcomed 2025, sharing a message of hope, positivity, and blessings for health, success, and joy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-average-air-quality-index-last-moderate-or-better-air-best-since-2018-2658008-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi saw 209 days of moderate or better air quality in 2024, best since 2018Delhi saw 209 days in 2024 with an AQI below 200, indicating 'Good to Moderate' air quality, which is the highest count recorded, excluding the Covid-19 lockdown year of 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-wins-8th-fide-world-chess-blitz-championship-ian-nepomniachtchi-2658025-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Historic tie: Magnus Carlsen, Ian Nepomniachtchi share World Blitz ChampionshipReigning FIDE World Blitz Champion Magnus Carlsen won his 8th title on Wednesday, 1 January. In a historic feat, Carlsen decided to share the title with his opponent Ian Nepomniachtchi, making them the first twin winners of the competition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-man-jailed-for-throwing-tip-box-cashier-singapore-cafe-the-project-acai-holland-village-racial-slurs-2657932-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin man jailed in Singapore for making racist remarksA 27-year-old Indian-origin man, Rishi David Ramesh Nandwani, has been sentenced to four weeks in jail and fined SGD 4,000 for hurling racial slurs and throwing a tip box at a cashier in a cafe in Singapore's Holland Village. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-peak-power-demand-crosses-five-thousand-megawatts-on-new-year-eve-for-first-time-2658013-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In a first, Delhi's peak power demand crosses 5,000 megawatts on New Year's EveThis is a substantial increase from the December peaks of 4,884 MW in 2023 and 4,964 MW in 2022, according to the State Load Dispatch Centre (SLDC). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/man-pushed-onto-new-york-subway-tracks-accused-charged-with-attempted-murder-2658029-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man pushes commuter onto New York subway tracks, charged with attempted murderThe accused, identified as 23-year-old Kamel Hawkins, was charged with attempted murder and second-degree assault for pushing the commuter onto the tracks in New York City's 18th Street station on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/indian-films-releasing-in-2025-emergency-chhaava-coolie-thug-life-2657782-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Emergency to Thug Life: Films to watch out for in 2025The year 2025 is packed with exciting releases from Bollywood and South Indian cinema, featuring historical dramas, action-packed thrillers, and anticipated sequels. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-suvendu-adhikari-mamata-banerjee-sandeshkhali-women-protest-violence-trinamool-congress-2657939-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If BJP wins...: Suvendu Adhikari's warning to Mamata Banerjee in SandeshkhaliBJP leader Suvendu Adhikari accused the West Bengal government of framing false charges against women in Sandeshkhali over their protest against alleged land-grabbing and sexual harassment of women by local Trinamool Congress leaders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/gujarat/story/gujarat-19-year-old-kills-man-gandhinagar-sending-messages-fiancee-instagram-2658021-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "19-year-old kills man in Gujarat for sending messages to fiancee on InstagramThe victim's body was found on December 28 near Dholakunwa village in Gandhinagar district. The accused and his friend have been arrested for committing th crime."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/puerto-rico-power-grid-collapses-island-in-dark-new-year-eve-2657986-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Puerto Rico's power grid collapses, leaving island in the dark on New Year's eveAround 90% of clients were without power at 9.30 (1330 GMT) on Tuesday, according to energy distribution company LUMA Energy's real-time portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ram-kapoor-55-kg-transformation-how-to-lose-weight-without-pills-surgery-2657817-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Ram Kapoor shed 55 kg in 1.5 years: How to do it without pills, surgeryActor Ram Kapoor's weight-loss journey defies quick-fix methods like taking pills and surgery. Know what public health experts consider what healthy weight loss looks like."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-bids-goodbye-2024-instagram-post-2657949-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma bids emotional goodbye to rollercoaster 2024Rohit Sharma bid adieu to 2024 with an emotional post on his social media account, recalling all the memories in his personal and professional life. Rohit is currently in Australia for the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-presidential-elections-2024-russia-iran-intelligence-agency-units-face-sanction-for-election-interference-2658022-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US imposes sanctions on groups in Russia, Iran for election interferenceThe US government said that intelligence agency units of Russia and Iran aimed to \"stoke socio-political tensions and influence the US electorate during the 2024 US election\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/videos-last-sunset-of-2024-from-shimla-puri-madurai-others-parts-of-india-2657958-2024-12-31?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Videos: Last sunset of 2024 from Shimla, Puri, Madurai, others parts of IndiaAs India prepares to bid adieu to 2024 and enter the next year, here are glimpses of the last sunset of the year from across the country, including Himachal Pradesh's Shimla, Odisha's Puri and Tamil Nadu's Madurai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/can-living-apart-together-marriages-be-a-hit-in-india-2657775-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can 'Living Apart Together' marriages be a hit in India?Living Apart Together (LAT), a growing trend among committed and married couples in the West, refers to couples intentionally avoiding cohabitation in order to keep the spark alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-joe-biden-slammed-jab-donald-trump-jimmy-carter-death-decency-conservatives-2657777-2024-12-31?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Joe Biden faces backlash for needling Donald Trump over Jimmy Carter's deathJoe Biden's comments sparked backlash, with critics accusing him of using the opportunity to attack Donald Trump instead of paying tribute to former US president Jimmy Carter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zimbabwe-death-penalty-scrapped-existing-sentences-to-be-commuted-jail-term-emmerson-mnangagwa-2658015-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zimbabwe scraps death penalty, existing sentences to be commuted as jail termThe Death Penalty Abolition Act, published in Government Gazette on Tuesday, says courts can no longer deliver a sentence of capital punishment for any offence and any existing death sentences would need to be commuted to jail time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-capitol-riot-accused-antony-vo-asylum-canada-pardon-on-donald-trump-white-house-2658017-2025-01-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US Capitol riot accused seeks asylum in Canada, hopes for pardon on Trump returnMore than 1,500 people have been charged in connection with the January 6, 2021 US Capitol riots, which sought to disrupt the certification of President Joe Biden's election victory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/international-shows/story/squid-game-2-from-lagori-to-lattu-the-indian-twist-to-korean-childhood-games-2657813-2025-01-01",
      "headline": "Squid Game 2: From Lagori to Lattu, the Indian twist to Korean childhood gamesSquid Game Season 2 elevated the thrill with new games. We can't help but draw intriguing parallels between Korean and Indian traditional games that are disturbingly familiar yet horrifyingly modified.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-vidaamuyarchi-postponed-january-10-release-2658028-2025-01-01",
      "headline": "Ajith Kumar's Vidaamuyarchi, due for January 10 release, postponedAjith Kumar's upcoming film, Vidaamuyarchi, has now been postponed. The film, directed by Magizh Thirumeni, was scheduled for a grand release on January 10 ahead of Pongal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-hugs-alia-bhatt-raha-new-year-celebrations-with-neetu-riddhima-2658024-2025-01-01",
      "headline": "Watch: Ranbir Kapoor runs to hug Alia Bhatt during New Year celebrationsRanbir Kapoor ran to Alia Bhatt and gave her a tight hug as the clock struck 12 on January 1. The video from the Kapoor's New Year celebrations was shared by Neetu Kapoor on her Instagram Stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-productions-congratulates-allu-arjun-pushpa-2-team-success-2657978-2024-12-31",
      "headline": "Aamir Khan Productions congratulates Pushpa 2 team, Allu Arjun respondsAamir Khan Productions congratulated the team of Pushpa 2: The Rule for their blockbuster success. Allu Arjun and Mythri Movie Makers expressed gratitude for the warm wishes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadavs-happy-new-year-instagram-post-2658044-2025-01-01",
      "headline": "Suryakumar Yadav's post 2024 recap, ft. highs, lows, and that incredible catchIndia T20I captain Suryakumar Yadav looked back at the year 2024. Suryakumar Yadav put up an emotional post on his Instagram account, celebrating the year that was.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-new-year-test-sydney-big-call-drop-2657957-2025-01-01",
      "headline": "Will Rohit Sharma do what's best for Team India in the New Year's Test?Australia vs India, 5th Test: Captain Rohit Sharma faces mounting scrutiny after a string of failures in the Border-Gavaskar Trophy, with questions arising about his form and leadership. As India fight to salvage the series in Sydney, Rohit's choices could define both the team's fate and his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-mens-cricket-2025-schedule-champions-trophy-asia-cup-full-match-fixtures-list-2658027-2025-01-01",
      "headline": "India cricket 2025 schedule: Full fixtures, dates, time for men's team matchesIndia Men's Cricket Schedule 2025: From Champions Trophy to England Tour, here's a detailed overview of the Indian men's cricket team's fixtures for the 2025 calendar year, featuring marquee tournaments and exciting series across all formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/magnus-carlsen-wins-8th-fide-world-chess-blitz-championship-ian-nepomniachtchi-2658025-2025-01-01",
      "headline": "Historic tie: Magnus Carlsen, Ian Nepomniachtchi share World Blitz ChampionshipReigning FIDE World Blitz Champion Magnus Carlsen won his 8th title on Wednesday, 1 January. In a historic feat, Carlsen decided to share the title with his opponent Ian Nepomniachtchi, making them the first twin winners of the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-team-indias-transition-period-indian-cricket-in-2025-2657955-2025-01-01",
      "headline": "Indian cricket in 2025: Transition time again as Kohli, Rohit futures in focusWith the Champions Trophy and a few crucial Test series lined up in 2025, the Indian men's cricket team will be in the spotlight in the New Year. For the first time in over a decade, the team faces a transition phase, with questions looming over the futures of senior players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/test-cricket-historic-australia-india-england-2657979-2024-12-31",
      "headline": "Historic 2024: Test cricket achieves special 50 first time in 148 years As 2024 comes to an end, it ushers in a historic achievement in Test cricket. With 50 outright results in 53 Test matches, this year has become the first in the sport's history to reach such an extraordinary milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rohit-sharma-virat-kohli-pressure-mounts-melbourne-test-horror-sledging-room-podcast-2657961-2024-12-31",
      "headline": "Pressure mounts on Rohit, Kohli after Melbourne Test | Sledging Room, S2 Ep 70Another decade-long streak has been broken under Rohit Sharma's captaincy. India lost a Boxing Day Test in Melbourne for the first time in 13 years after their big guns flopped once again. Pressure is mounting on Virat Kohli and Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-ansu-fati-january-window-loan-agent-jorge-mendes-reveals-stance-2657960-2024-12-31",
      "headline": "FC Barcelona to loan out Ansu Fati in January window? Agent reveals stanceAnsu Fati's agent Jorge Mendes revealed Barcelona might loan the 22-year-old in January, balancing crucial game time and his commitment to fight for a spot under Hansi Flick amidst struggles with form and recurring injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-bids-goodbye-2024-instagram-post-2657949-2024-12-31",
      "headline": "Rohit Sharma bids emotional goodbye to rollercoaster 2024Rohit Sharma bid adieu to 2024 with an emotional post on his social media account, recalling all the memories in his personal and professional life. Rohit is currently in Australia for the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-aryna-sabalenka-iga-swiatek-tiktok-cheeky-remark-2657935-2024-12-31",
      "headline": "TikTok with Iga Swiatek? Aryna Sabalenka responds with cheeky remarkWorld No.1 Aryna Sabalenka spoke about her camaraderie with Poland's Iga Swiatek and gave a cheeky response about featuring in TikTok videos with her. Sabalenka is currently plying her trade in the Brisbane International where she defeated Renata Zarazua in the first round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/big-bash-league-jamie-overton-finn-allen-run-out-warning-r-ashwin-reacts-2657897-2024-12-31",
      "headline": "R Ashwin reacts to Jamie Overton's non-striker run-out warning in BBL gameBig Bash League: R Ashwin was thrilled at Jamie Overton's attempt to run out a batter at the non-striker's end during a Big Bash League match. Ashwin and Overton will play for Chennai Super Kings in IPl 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rohit-sharma-virat-kohli-pressure-mounts-melbourne-test-horror-sledging-room-podcast-2657961-2024-12-31",
      "headline": "Pressure mounts on Rohit, Kohli after Melbourne Test | Sledging Room, S2 Ep 70Another decade-long streak has been broken under Rohit Sharma's captaincy. India lost a Boxing Day Test in Melbourne for the first time in 13 years after their big guns flopped once again. Pressure is mounting on Virat Kohli and Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-ansu-fati-january-window-loan-agent-jorge-mendes-reveals-stance-2657960-2024-12-31",
      "headline": "FC Barcelona to loan out Ansu Fati in January window? Agent reveals stanceAnsu Fati's agent Jorge Mendes revealed Barcelona might loan the 22-year-old in January, balancing crucial game time and his commitment to fight for a spot under Hansi Flick amidst struggles with form and recurring injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-bids-goodbye-2024-instagram-post-2657949-2024-12-31",
      "headline": "Rohit Sharma bids emotional goodbye to rollercoaster 2024Rohit Sharma bid adieu to 2024 with an emotional post on his social media account, recalling all the memories in his personal and professional life. Rohit is currently in Australia for the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-aryna-sabalenka-iga-swiatek-tiktok-cheeky-remark-2657935-2024-12-31",
      "headline": "TikTok with Iga Swiatek? Aryna Sabalenka responds with cheeky remarkWorld No.1 Aryna Sabalenka spoke about her camaraderie with Poland's Iga Swiatek and gave a cheeky response about featuring in TikTok videos with her. Sabalenka is currently plying her trade in the Brisbane International where she defeated Renata Zarazua in the first round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/big-bash-league-jamie-overton-finn-allen-run-out-warning-r-ashwin-reacts-2657897-2024-12-31",
      "headline": "R Ashwin reacts to Jamie Overton's non-striker run-out warning in BBL gameBig Bash League: R Ashwin was thrilled at Jamie Overton's attempt to run out a batter at the non-striker's end during a Big Bash League match. Ashwin and Overton will play for Chennai Super Kings in IPl 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-pat-cummins-yashasvi-jaiswal-test-team-of-the-year-joe-root-harry-brook-2657885-2024-12-31",
      "headline": "Jasprit Bumrah named captain, Cummins ignored in Australian media's Test Team of 2024India fast bowler Jasprit Bumrah was named the captain of the Test team of the year by the Australian media but captain Pat Cummins failed to find any spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-high-court-robin-uthappa-epf-fraud-case-arrest-warrant-2657888-2024-12-31",
      "headline": "Karnataka High Court stays arrest warrant against Robin Uthappa in fraud case Karnataka High Court has stayed the arrest warrant issued against former Indian cricketer Robin Uthappa in the alleged EPF fraud case. On December 21, Shadakshari Gopal Reddy, the PF Regional Commissioner, issued the arrest warrant against him.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-message-coach-andy-murray-new-year-vacation-skiing-trip-2657870-2024-12-31",
      "headline": "Djokovic sends humorous New Year vacation message to coach Andy MurrayNovak Djokovic joked about Andy Murray's skiing holiday, wishing his new coach stayed injury-free, as he started his season with an impressive win at the Brisbane International, preparing for a historic 11th Australian Open title bid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-novak-djokovic-new-year-plans-family-fireworks-2657869-2024-12-31",
      "headline": "Going to watch fireworks in Brisbane: Djokovic's plans on New YearBrisbane International: Former World No.1 Novak Djokovic talked about his plans for New Year and celebrating the day with his wife Jelena and children, Tara and Stefan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatre-breaks-yashasvi-jaisals-record-in-vijay-hazare-trophy-2657838-2024-12-31",
      "headline": "Ayush Mhatre breaks Yashasvi Jaiwsal's record in Vijay Hazare Trophy Young Mumbai batter Ayush Mhatre broke Yashasvi Jaiswal's five-year-old record in the Vijay Hazare Trophy 2024-25 as he became the youngest batter to play a knock over 150 in List A cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-plymouth-argyle-coach-mutual-termination-seven-months-efl-championship-2657822-2024-12-31",
      "headline": "Wayne Rooney's time as Plymouth Argyle coach ends after just 7 monthsWayne Rooney's struggles as a manager continued, with his seven-month stint at Plymouth Argyle ending after a poor run of results left the club languishing at the bottom of the Championship table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-pr-good-cricket-social-media-era-2657814-2024-12-31",
      "headline": "If you play good cricket, you don't need PR: MS Dhoni on 'social media' era  MS Dhoni opened up about his views on social media, saying that if players perform well on the ground, they should not need a PR. At the age of 43, Dhoni is set to play in his 18th season of the Indian Premier League (IPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-odi-series-jasprit-bumrah-rest-virat-kohli-rohit-sharma-selection-2657800-2024-12-31",
      "headline": "Jasprit Bumrah to be rested for England ODIs ahead of Champions Trophy: SourcesIndia vs England, 2025: Star pacer Jasprit Bumrah is likely to be rested for the white-ball series against England. India will play five ODIs and three T20Is against a visiting England side from January 22 to February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ayush-mhatre-breaks-yashasvi-jaisals-record-in-vijay-hazare-trophy-2657838-2024-12-31",
      "headline": "Ayush Mhatre breaks Yashasvi Jaiwsal's record in Vijay Hazare Trophy Young Mumbai batter Ayush Mhatre broke Yashasvi Jaiswal's five-year-old record in the Vijay Hazare Trophy 2024-25 as he became the youngest batter to play a knock over 150 in List A cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-plymouth-argyle-coach-mutual-termination-seven-months-efl-championship-2657822-2024-12-31",
      "headline": "Wayne Rooney's time as Plymouth Argyle coach ends after just 7 monthsWayne Rooney's struggles as a manager continued, with his seven-month stint at Plymouth Argyle ending after a poor run of results left the club languishing at the bottom of the Championship table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ms-dhoni-pr-good-cricket-social-media-era-2657814-2024-12-31",
      "headline": "If you play good cricket, you don't need PR: MS Dhoni on 'social media' era  MS Dhoni opened up about his views on social media, saying that if players perform well on the ground, they should not need a PR. At the age of 43, Dhoni is set to play in his 18th season of the Indian Premier League (IPL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-odi-series-jasprit-bumrah-rest-virat-kohli-rohit-sharma-selection-2657800-2024-12-31",
      "headline": "Jasprit Bumrah to be rested for England ODIs ahead of Champions Trophy: SourcesIndia vs England, 2025: Star pacer Jasprit Bumrah is likely to be rested for the white-ball series against England. India will play five ODIs and three T20Is against a visiting England side from January 22 to February 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-best-bowler-ever-seen-darren-lehmann-glenn-mcgrath-wasim-akram-2657799-2024-12-31",
      "headline": "Bumrah best bowler I have ever seen: Lehmann compares pacer legendsDarren Lehmann compared Jasprit Bumrah to cricket legends Glenn McGrath and Wasim Akram, praising his extraordinary impact in the Border-Gavaskar Trophy and backing him as a future India captain.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-newcastle-united-ruben-amorim-joshua-zirkzee-substitution-explains-2657786-2024-12-31",
      "headline": "Amorim explains decision to sub off Zirkzee after 33 minutes vs NewcastleRuben Amorim justified substituting Joshua Zirkzee after 33 minutes in Manchester United's 2-0 defeat to Newcastle, emphasising it was a tactical decision amidst growing concerns over United's relegation battle after their third consecutive Premier League loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2657779-2024-12-31",
      "headline": "Rishabh Pant should be criticised for his failures, not how he fails: ManjrekarFormer India cricketer turned commentator Sanjay Manjkrekar feels India wicketkeeper batter Rishabh Pant shouldn't be criticised for his mode of dismissals but only his failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/darren-lehmann-rohit-sharma-virat-kohli-replacements-aus-vs-ind-border-gavaskar-trophy-2024-25-2657756-2024-12-31",
      "headline": "Finding Rohit and Virat's replacements will not be a big worry for India: LehmannFormer Australia cricketer and head coach Darren Lehmann feels Indian cricket has enough depth to replace star batters Virat Kohli and Rohit Sharma, should they decide to retire after the end of the ongoing series against Australia."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}