{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-expectation-october-rate-cut-on-card-governor-shaktikanta-das-to-announce-soon-2612684-2024-10-07",
      "headline": "RBI MPC: Is rate cut on card? Shaktikanta Das to announce soonSpeculation has grown about the possibility of a rate cut or a shift in monetary policy, especially after the US Federal Reserve delivered an unexpected 50-basis-point cut in September 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zepto-new-hq-bengaluru-shifting-base-total-mall-sarjapur-by-february-cost-rs-3-4-crore-2612655-2024-10-07",
      "headline": "Zepto shifting its base to Total Mall in Sarjapur, Bengaluru: ReportZepto had earlier asked its 1,700-1,800 employees to move from its current base in Powai, Mumbai, to Bengaluru. However, the timeline was pushed back due to delays in finalising an appropriate location."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-in-red-despite-it-boost-global-factors-weigh-heavy-2612593-2024-10-07",
      "headline": "Sensex, Nifty close in red despite IT boost; global factors weigh heavyThe S&P BSE Sensex lost 638.45 points to end at 81,050, while the NSE Nifty50 was down 218.85 points to close at 24,795.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nbcc-india-shares-show-30-down-on-mobile-trading-apps-why-reason-explained-2612529-2024-10-07",
      "headline": "Explained: Why NBCC India shares are falling 30% on mobile trading appsThe company has performed well in recent times, with its shares increasing by 109% in 2024 and a massive 192% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-ceo-mark-zuckerberg-designs-minivan-for-wife-shows-off-his-his-and-hers-porsches-2612527-2024-10-07",
      "headline": "Mark Zuckerberg flaunts 'his and her' Porsches, designs minivan for wifeZuckerberg posted photos and videos of a Porsche 911 GT3 with a touring package for himself, and a customised Porsche Cayenne Turbo GT Minivan for Priscilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rvnl-irfc-irco-shares-railway-stocks-fall-up-to-8-percent-check-here-2612489-2024-10-07",
      "headline": "RVNL, IRFC, IRCON: Railway stocks fall up to 8%. Check hereRailway stocks such as RVNL, IRFC, IRCON saw a decline on the stock exchanges on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-7-2024-precious-metals-witness-dip-on-mcx-latest-rates-2612434-2024-10-07",
      "headline": "Gold, silver price today, October 7, 2024: Precious metals witness dip on MCXGold Price Today October 7, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-ola-electric-share-fall-8-percent-today-ceo-bhavish-aggarwal-spat-kunal-kamra-social-media-2612429-2024-10-07",
      "headline": "Ola Electric shares tank 8% in early trade day after CEO's ugly spat with comicOla Electric shares have dropped 43% from its all-time high, and has seen a decline in five of the last six trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-oversized-tshirt-new-business-meta-ceo-fashion-partnership-mike-amiri-2612399-2024-10-07",
      "headline": "Fashion venture on cards: Is Mark Zuckerberg shifting from tech to trendy? Known for his casual wardrobe, which usually includes plain grey t-shirts and hoodies, Zuckerberg is now adding a personal touch to his outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-fii-assets-surpass-usd-1-trillion-equity-holdings-at-6-month-peak-2612384-2024-10-07",
      "headline": "India's FII assets surpass $1 trillion, equity holdings at 6-month peakFor the first time, the total assets under custody of FIIs across various investment vehicles, including debt, equity, alternative investment funds (AIF), mutual funds, and hybrid funds, surpassed $1 trillion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-rebound-after-last-week-slump-led-by-rally-in-it-stocks-2612358-2024-10-07",
      "headline": "Sensex, Nifty rebound after last week's slump led by rally in IT stocksThe S&P BSE Sensex was up 239.85 points to 81,928.30, while the NSE Nifty50 added 60.40 points to 25,075.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adidas-puma-rivalry-dassler-brothers-history-sibling-feud-adolf-rudolf-succession-war-2611900-2024-10-06",
      "headline": "Succession Wars: Sibling rivalry that led to the birth of Adidas and PumaAdolf 'Adi' Dassler and Rudolf Dassler, transformed the world of sports footwear through innovation, ambition, and intense sibling rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pearl-kapur-self-proclaimed-india-youngest-billionaire-zyber-365-unicorn-fact-fiction-2611734-2024-10-05",
      "headline": "Curious case of Pearl Kapur: The self-proclaimed billionaire behind Zyber 365On his Instagram profile, Pearl Kapur brands himself as \"India's youngest billionaire,\" a title he embraces while carefully sidestepping questions about the legitimacy of his company's meteoric rise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/national-conference-president-farooq-abdullah-open-to-pdp-support-for-jammu-kashmir-government-formation-2612623-2024-10-07",
      "headline": "'Why not?' Farooq Abdullah open to support from Mehbooba Mufti's partyJammu and Kashmir voted on October 1 in the third and final phase of elections to form its first government since the Narendra Modi government revoked the region's special status in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-air-show-deaths-dehydration-over-crowding-public-transport-hospitalised-bjp-dmk-aiadmk-indian-air-force-2612658-2024-10-07",
      "headline": "Overcrowding, no water: What went wrong at Marina Beach during air showEyewitnesses reported extreme overcrowding, lack of basic amenities, and inadequate crowd management, raising serious questions about the planning and execution of the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dipa-karmakar-gymnastics-retirement-emotional-statement-rio-olympics-injuries-2612641-2024-10-07",
      "headline": "Gymnast Dipa Karmakar retires: 'Wasn't an easy decision, grateful for every moment'One of India's most decorated gymnasts, Dipa Karmakar, announced retirement from the sport on Monday, October 7. Dipa made heads turn when she finished fourth at the Rio Olympics after becoming the first female gymnast from India to compete at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-india-maldives-president-mohammed-muizzu-neighbourhood-first-policy-2612504-2024-10-07",
      "headline": "Muizzu's damage control, thanks 'key partner' India for generous aid for MaldivesIndian PM Modi and Maldives President Mohamed Muizzu held extensive discussions on Monday and both leaders expressed a commitment to bolstering bilateral ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/kunal-kamra-vs-bhavish-agarwal-ola-electric-vehicle-shares-dip-2612723-2024-10-07",
      "headline": "Comic Kunal Kamra's 'worked on Sunday' dig at Bhavish Aggarwal over Ola EV sharesKunal Kamra's remarks came after the shares of Ola Electric Mobility, the two-wheeler electric vehicle (EV) manufacturer, dropped by 8% earlier today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zakir-naik-islam-quran-paedophilia-pashtun-girl-viral-video-2612488-2024-10-07",
      "headline": "Zakir Naik's heated exchange with girl on Islam and paedophilia, video is viralControversial Islamic preacher Zakir Naik sparked outrage on social media after a heated exchange with a Pashtun girl who expressed concern about the prevalence of child sexual abuse where she lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2024-in-medicine-goes-to-victor-ambros-and-gary-ruvkun-2612499-2024-10-07",
      "headline": "Nobel Prize 2024 in Medicine goes to Victor Ambros and Gary RuvkunThe prestigious award is given annually by the Nobel Assembly consisting of 50 professors at Karolinska Institutet, recognising scientists who have made significant contributions to the field of medicine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chief-minister-mk-stalin-reaction-chennai-air-show-tragedy-tamil-nadu-government-indian-air-force-2612539-2024-10-07",
      "headline": "Tamil Nadu gave facilities beyond what IAF requested: Stalin on air show tragedySpeaking on the death of five people after an air show on Marina beach, MK Stalin said that state authorities provided necessary cooperation and facilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-mall-creates-food-delivery-pick-up-point-after-zomato-ceo-deepinder-goyal-flags-concerns-2612630-2024-10-07",
      "headline": "Gurugram mall creates food delivery pick-up point after Zomato CEO flags concernsZomato CEO Deepinder Goyal shared that Gurugram's Ambience Mall has set up a dedicated pick-up point for delivery agents after he flagged concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-amdullah-engineer-rashid-jammu-kashmir-election-article-370-full-statehood-2612606-2024-10-07",
      "headline": "Playing straight into BJP's hands: Omar Abdullah slams Engineer RashidOmar Abdullah called out Baramulla MP Engineer Rashid's call to boycott government formation in Jammu and Kashmir, accusing him of playing into the hands of the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/should-you-stay-in-a-marriage-where-your-husbands-mom-comes-first-2611244-2024-10-07",
      "headline": "Should you stay in a marriage where your husband's mom comes first?Respecting and loving your mother is important, but should it come at the cost of your relationship? Not really—and that's what husbands need to understand."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/news/story/girl-murdered-in-2006-was-revived-as-ai-character-family-raises-objection-2612556-2024-10-07",
      "headline": "Girl murdered in 2006 was revived as AI character, family raises objection The misuse of AI technology raises ethical concerns, as seen in the case where a chatbot mimicked a young woman who was murdered 18 years ago, causing distress to her family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-ceo-mark-zuckerberg-designs-minivan-for-wife-shows-off-his-his-and-hers-porsches-2612527-2024-10-07",
      "headline": "Mark Zuckerberg flaunts 'his and her' Porsches, designs minivan for wifeZuckerberg posted photos and videos of a Porsche 911 GT3 with a touring package for himself, and a customised Porsche Cayenne Turbo GT Minivan for Priscilla."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-doctor-rape-murder-case-cbi-rules-out-gang-rape-accused-sanjay-roy-committed-crime-alone-2612547-2024-10-07",
      "headline": "CBI rules out gang-rape in Kolkata murder case: Accused committed crime aloneThe Central Bureau of Investigation (CBI) filed a charge sheet against Sanjay Roy, the prime accused in the rape and murder case of a trainee doctor at RG Kar Medical College and Hospital in Kolkata, ruling out the possibility of gang rape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/elon-musk-petition-favour-free-speech-right-to-bear-arm-first-second-amendment-donald-trump-swing-states-2612485-2024-10-07",
      "headline": "Musk offers $47 to each US voter signing petition on gun rights, free speechElon Musk, through his America PAC, launched a petition supporting the First and Second Amendments and offered $47 for each referral of a registered swing-state voter who signs it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-dalit-couple-meal-maharashtra-kolhapur-video-cuisine-cooking-session-2612567-2024-10-07",
      "headline": "Watch: Rahul Gandhi enjoys meal with Dalit couple, understands their cuisineCongress MP Rahul Gandhi was invited by a Dalit couple in Maharashtra's Kolhapur, where he understood the significance of Dalit cuisine and enjoyed a meal with a couple from the community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/singham-again-trailer-review-never-seen-before-actioner-or-a-starry-khichdi-by-rohit-shetty-ajay-devgn-akshay-kumar-2612624-2024-10-07",
      "headline": "Singham Again trailer review: Never-seen-before actioner or a starry khichdi?Rohit Shetty's team, including Ajay Devgn, Kareena Kapoor Khan, Ranveer Singh and Tiger Shroff, shared the trailer of Singham Again recently. The film is studded with many big faces, and at some point, it looks a bit too much. Do you agree? Read on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-presidential-election-2024-what-is-october-surprise-explained-history-republican-donald-trump-democrat-kamala-harris-hillary-clinton-2612475-2024-10-07",
      "headline": "Why October Surprise has terrified US presidential candidates for decadesOn the first anniversary of the October 7 Hamas attack on Israel, the Middle East is on the brink of an all-out war. The crisis in the oil-rich region could swing the US polls. From the attack on the US embassy in Iran in 1980 to the Wikileaks shock in 2016, and the Covid wave in 2020, here's how events in October have impacted American elections.     "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/former-tata-sons-chairman-ratan-tata-admitted-mumbai-breach-candy-hospital-critical-icu-2612459-2024-10-07",
      "headline": "Ratan Tata says reports of health concerns unfounded: I remain in good spiritsRatan Tata, the former chairman of Tata Sons, dismissed reports of him being admitted to Mumbai's Breach Candy Hospital in the early hours of Monday following a significant drop in blood pressure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-ola-electric-share-fall-8-percent-today-ceo-bhavish-aggarwal-spat-kunal-kamra-social-media-2612429-2024-10-07",
      "headline": "Ola Electric shares tank 8% in early trade day after CEO's ugly spat with comicOla Electric shares have dropped 43% from its all-time high, and has seen a decline in five of the last six trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-dharma-productions-stops-pre-release-film-screenings-2612629-2024-10-07",
      "headline": "Karan Johar's Dharma Productions stops pre-release screenings. Here's whyDharma Productions, led by Karan Johar, has decided to halt pre-release screenings of their films, citing the need to adapt and maintain the excitement of the cinematic experience. However, they will still host press screenings on the release day to ensure timely reviews."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-palestinians-october-7-anniversary-idf-middle-east-crisis-proxy-iran-deaths-loss-2612537-2024-10-07",
      "headline": "How badly has Israel bled since last October 7Israel-Hamas war anniversary: War has always been costly, in terms of human lives and lost economic opportunities. On October 7, Hamas terrorists massacred around 1,200 people and threw the Middle East into a crisis. Here's how Israel has fared in the war against its rivals in the last one year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-defence-forces-idf-exclusive-footage-october-7-attack-2612333-2024-10-07",
      "headline": "Israel releases unseen footage of troops in action during Oct 7 Hamas attacksThe Israel Defense Forces (IDF) released two unseen footage of its troops in action during the Hamas attacks on October 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-two-withdrawn-refusal-to-travel-to-iran-2612541-2024-10-07",
      "headline": "Mohun Bagan kicked out of AFC Champions League Two for refusing to travel to IranThe Asian Football Confederation booted out Mohun Bagan from the AFC Champions League Two competition for failing to report for an away game in Iran. Mohun Bagan did not travel to Tabriz for a game against Tractor SC on October 2, citing the security situation in the West Asian country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/k-pop-group-stray-kids-perform-at-amas-pay-tribute-to-nsync-2612682-2024-10-07",
      "headline": "Watch: K-pop group Stray Kids perform at AMAs, pay tribute to NSYNCStray Kids became the second K-pop group after BTS to perform at the American Music Awards. During their smashing performance, the group paid tribute to American pop band NSYNC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/karan-veer-mehra-bigg-boss-18-winning-khatron-ke-khiladi-14-exclusive-2612671-2024-10-07",
      "headline": "Karan Veer Mehra on doing BB 18 after winning KKK 14: It's an advantageTV actor Karan Veer Mehra, after winning Khatron Ke Khiladi 14, is set to participate in Bigg Boss 18, considering it a career advantage. The actor told India Today Digital that his previous show's popularity might give him an edge in Bigg Boss."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajya-sabha-mp-ramdas-bandu-athawale-meets-actor-govinda-shooting-incident-2612664-2024-10-07",
      "headline": "Pics: Rajya Sabha MP Ramdas Bandu Athawale meets actor Govinda at his residenceRajya Sabha MP Ramdas Bandu Athawale met Govinda at his Juhu home. The actor was hospitalised after accidentally shooting himself in the leg and was discharged from the hospital on October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/photo/ranveer-singh-arjun-kapoor-gunday-vibe-at-singham-again-trailer-launch-viral-pics-2612654-2024-10-07",
      "headline": "Ranveer-Arjun exude 'Gunday' vibe at Singham Again trailer launchActors Ranveer Singh and Arjun Kapoor reunited at the grand trailer launch of Singham Again in Mumbai on Monday, October 7. Check out their viral pictures from the event here. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/real-tuk-tuk-in-multan-fans-slam-babar-azam-as-he-fails-on-belter-track-vs-england-2612707-2024-10-07",
      "headline": "Real tuk-tuk in Multan: Fans slam Babar Azam as he fails on belter pitch vs EnglandA certain section of fans slammed Babar Azam as he failed to score yet another fifty on a belter pitch against England. Babar managed just 31 runs on Day 1 of 1st Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-babar-azam-multan-test-2612705-2024-10-07",
      "headline": "On 'flat' Multan pitch, struggling Babar Azam fails to join the party PAK vs ENG, 1st Test: Babar Azam fell cheaply as he scored only 31 runs in the first innings of the opening Test between England and Pakistan in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-sunil-gavaskar-gohit-gautam-gambhir-footlicking-icc-2612698-2024-10-07",
      "headline": "Crediting Gambhir for Kanpur Test win is foot-licking of highest quality: GavaskarIndia vs Bangladesh: In a strongly-worded column, legendary Sunil Gavaskar said it was disappointing to see Gautam Gambhir getting credit for India's Kanpur Test victory. Gavaskar said India have been playing fearless and aggressive cricket under Rohit Sharma's captaincy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-manchester-united-job-jonny-evans-affecting-players-aston-villa-premier-league-2612677-2024-10-07",
      "headline": "Erik ten Hag speculation affecting Manchester United players: Jonny EvansManchester United defender Jonny Evans acknowledged the rising pressure on manager Erik ten Hag's future is affecting the players. United's winless streak and growing rumors have sparked concern within the squad, as speculation surrounding ten Hag's job intensifies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-pakistan-1st-test-michael-atherton-defends-bowling-attack-chris-woakes-2612635-2024-10-07",
      "headline": "Can't judge England too harshly, says Atherton after Pakistan make merry in MultanEngland vs Pakistan, 1st Test: Former captain Michael Atherton defended England's bowling attack after it looked flat and listless on a batting-friendly pitch against Pakistan on Day 1 of the series opener in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-dj-alan-walker-surprises-fans-with-rcb-anthem-during-bengaluru-concert-2612659-2024-10-07",
      "headline": "Watch: DJ Alan Walker surprises fans with RCB anthem during Bengaluru concert DJ Alan Walker thrilled Bengaluru fans by playing the Royal Challengers Bengaluru- RCB anthem at his recent concert. The gesture celebrated the city's undying support for their favorite IPL team, highlighting RCB's deep connection with its loyal and passionate fanbase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dipa-karmakar-gymnastics-retirement-emotional-statement-rio-olympics-injuries-2612641-2024-10-07",
      "headline": "Gymnast Dipa Karmakar retires: 'Wasn't an easy decision, grateful for every moment'One of India's most decorated gymnasts, Dipa Karmakar, announced retirement from the sport on Monday, October 7. Dipa made heads turn when she finished fourth at the Rio Olympics after becoming the first female gymnast from India to compete at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-abdullah-shafique-shan-masood-2612638-2024-10-07",
      "headline": "Shafique reaches hundred with six, Pakistan set record vs Bazball EnglandPAK vs ENG, 1st Test: Abdullah Shafique and Shan Masood made hay on a beautiful batting pitch in Multan after Pakistan opted to bat first in the opening Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-shafali-verma-reveals-how-chamari-athapaththu-inspires-her-2612640-2024-10-07",
      "headline": "Women's T20 World Cup: Shafali Verma reveals how Chamari Athapaththu inspires her Shafali Verma revealed how Chamari Athapaththu inspired her with her ability to handle pressure of being Sri Lanka's key player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-india-to-travel-to-pakistan-mohsin-naqvi-reaction-2612621-2024-10-07",
      "headline": "Mohsin Naqvi confident India will travel to Pakistan: Don't see them cancelPakistan cricket board chairman Mohsin Naqvi is confident that India will travel to the country to take part in the ICC Champions Trophy. India's participation in the tournament is in doubt because of the political tensions between both countries. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dipa-karmakar-gymnastics-retirement-emotional-statement-rio-olympics-injuries-2612641-2024-10-07",
      "headline": "Gymnast Dipa Karmakar retires: 'Wasn't an easy decision, grateful for every moment'One of India's most decorated gymnasts, Dipa Karmakar, announced retirement from the sport on Monday, October 7. Dipa made heads turn when she finished fourth at the Rio Olympics after becoming the first female gymnast from India to compete at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-abdullah-shafique-shan-masood-2612638-2024-10-07",
      "headline": "Shafique reaches hundred with six, Pakistan set record vs Bazball EnglandPAK vs ENG, 1st Test: Abdullah Shafique and Shan Masood made hay on a beautiful batting pitch in Multan after Pakistan opted to bat first in the opening Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-shafali-verma-reveals-how-chamari-athapaththu-inspires-her-2612640-2024-10-07",
      "headline": "Women's T20 World Cup: Shafali Verma reveals how Chamari Athapaththu inspires her Shafali Verma revealed how Chamari Athapaththu inspired her with her ability to handle pressure of being Sri Lanka's key player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-india-to-travel-to-pakistan-mohsin-naqvi-reaction-2612621-2024-10-07",
      "headline": "Mohsin Naqvi confident India will travel to Pakistan: Don't see them cancelPakistan cricket board chairman Mohsin Naqvi is confident that India will travel to the country to take part in the ICC Champions Trophy. India's participation in the tournament is in doubt because of the political tensions between both countries. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-pitch-kevin-pietersen-criticism-bowlers-graveyard-2612580-2024-10-07",
      "headline": "PAK vs ENG: Pietersen labels Multan Test pitch as 'bowlers graveryard'Kevin Pietersen criticised the Multan pitch during England's first Test against Pakistan, calling it too batting-friendly after Pakistan's Shan Masood and Abdullah Shafique built a dominating 200-run stand, leaving England's bowlers frustrated.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/preity-zinta-saint-lucia-kings-cpl-2024-final-salman-khan-2612597-2024-10-07",
      "headline": "Salman Khan's old tweet on Preity Zinta trends as Kings win CPL 2024CPL 2024: Salman Khan's old tweet on Preity Zinta trended after Saint Lucia Kings beat Guyana Amazon Warriors by six wickets to win the Caribbean Premier League title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-announce-three-mens-player-of-the-month-nominees-for-september-2612592-2024-10-07",
      "headline": "ICC announce three men's Player of the Month nominees for SeptemberThe ICC has announced the Men's Player of the Month nominees for September 2024, featuring Australia's Travis Head and Sri Lanka's Prabath Jayasuriya and Kamindu Mendis. Each player delivered outstanding performances, making it a tough race for the award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-shan-masood-century-multan-records-silences-critics-2612559-2024-10-07",
      "headline": "Shan Masood silences critics with 1st century as Test captain, emulates InzamamPakistan vs England, 1st Test: Shan Masood hit his first Test hundred as captain, proving his naysayers wrong on Day 1 of the series opener in Multan. Masood became only the third Test captain after Inzamam-ul-Haq and Babar Azam to hit a hundred against England at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-first-test-ben-stokes-drinks-duty-injury-update-multan-2612546-2024-10-07",
      "headline": "PAK vs ENG: Injured Ben Stokes on drinks duty for England in Multan TestDespite being sidelined due to injury, England skipper Ben Stokes stayed involved by carrying drinks and offering advice to teammates during their first Test against Pakistan in Multan, showcasing his unwavering leadership and commitment to the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-two-withdrawn-refusal-to-travel-to-iran-2612541-2024-10-07",
      "headline": "Mohun Bagan kicked out of AFC Champions League Two for refusing to travel to IranThe Asian Football Confederation booted out Mohun Bagan from the AFC Champions League Two competition for failing to report for an away game in Iran. Mohun Bagan did not travel to Tabriz for a game against Tractor SC on October 2, citing the security situation in the West Asian country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-india-return-feels-like-rebirth-says-varun-chakaravarthy-2612536-2024-10-07",
      "headline": "IND vs BAN: India return feels like 'rebirth', says Varun ChakaravarthyAfter his heroics in the first T20I against Bangladesh, Varun Chakaravarthy has claimed that his return to the Indian team feels like a rebirth. Chakaravarthy picked up 3 wickets upon his return to the national side and paid tribute to his family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mayank-yadav-debut-t20-maiden-suryakumar-yadav-morne-morkel-2612524-2024-10-07",
      "headline": "Maiden over, Morkel and captain Surya: Mayank Yadav reflects on his T20I debutIndia vs Bangladesh, 1st T20I: Mayank Yadav reflected on his successful debut in Gwalior on Sunday. The 22-year-old tearaway pacer credited captain Suryakumar Yadav for making him feel at home on the big stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-first-test-ben-stokes-drinks-duty-injury-update-multan-2612546-2024-10-07",
      "headline": "PAK vs ENG: Injured Ben Stokes on drinks duty for England in Multan TestDespite being sidelined due to injury, England skipper Ben Stokes stayed involved by carrying drinks and offering advice to teammates during their first Test against Pakistan in Multan, showcasing his unwavering leadership and commitment to the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohun-bagan-afc-champions-league-two-withdrawn-refusal-to-travel-to-iran-2612541-2024-10-07",
      "headline": "Mohun Bagan kicked out of AFC Champions League Two for refusing to travel to IranThe Asian Football Confederation booted out Mohun Bagan from the AFC Champions League Two competition for failing to report for an away game in Iran. Mohun Bagan did not travel to Tabriz for a game against Tractor SC on October 2, citing the security situation in the West Asian country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-india-return-feels-like-rebirth-says-varun-chakaravarthy-2612536-2024-10-07",
      "headline": "IND vs BAN: India return feels like 'rebirth', says Varun ChakaravarthyAfter his heroics in the first T20I against Bangladesh, Varun Chakaravarthy has claimed that his return to the Indian team feels like a rebirth. Chakaravarthy picked up 3 wickets upon his return to the national side and paid tribute to his family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-mayank-yadav-debut-t20-maiden-suryakumar-yadav-morne-morkel-2612524-2024-10-07",
      "headline": "Maiden over, Morkel and captain Surya: Mayank Yadav reflects on his T20I debutIndia vs Bangladesh, 1st T20I: Mayank Yadav reflected on his successful debut in Gwalior on Sunday. The 22-year-old tearaway pacer credited captain Suryakumar Yadav for making him feel at home on the big stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fiorentina-vs-ac-milan-david-de-gea-performance-penalty-save-tammy-abraham-2612509-2024-10-07",
      "headline": "David de Gea shines bright in Fiorentina's 2-1 win over AC MilanDavid de Gea's masterful goalkeeping performance, including two penalty saves, helped AS Fiorentina secure a stunning 2-1 victory over AC Milan, silencing critics and reaffirming his status as one of football's elite keepers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mayank-yadav-india-vs-bangladesh-debut-murali-kartik-guatam-gambhir-gesture-2612494-2024-10-07",
      "headline": "Murali Kartik recalls Gambhir's gesture after handing maiden cap to Mayank YadavIndia vs Bangladesh: Former India spinner and broadcaster, Murali Kartik, said he was touched when Gautam Gambhir invited him to the team huddle and gave him the opportunity to hand debutant Mayank Yadav his maiden India cap on Sunday, October 6. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-brighton-vs-tottenham-ange-postecoglou-reaction-2612486-2024-10-07",
      "headline": "Ange Postecoglou slams Tottenham's 2nd half collapse vs Brighton: Worst defeatAnge Postecoglou slammed Tottenham Hotspur's second half capitulation against Brighton and Hove Albion in the Premier League on Sunday, October 6. Spurs let a 2-0 lead slip to lose the game in the second half. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-james-anderson-golf-tournament-absence-brendon-mccullum-2612453-2024-10-07",
      "headline": "Bowling consultant James Anderson picks golf over England's Pakistan TestJames Anderson opted to participate in a golf tournament in Scotland instead of travelling with the England squad for their first Test in Pakistan, sparking criticism despite the full backing of head coach Brendon McCullum."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}