{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indigo-share-price-falls-mass-flight-cancellations-operational-disruptions-2831086-2025-12-05",
      "headline": "IndiGo shares tumble 2% as mass flight cancellations continue to disrupt travel IndiGo's stock fell over 2%, trading at Rs 5,326.35 by 10 am, amid mounting concerns over ongoing mass cancellations and delays across India's busiest airports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-key-lending-rate-by-25-points-to-525-2831083-2025-12-05",
      "headline": "RBI reduces key lending rate by 25 points to 5.25%, maintains neutral stanceThe rate cut takes the repo rate down from 5.5% to 5.25%. Alongside this, the Standing Deposit Facility (SDF) rate has been adjusted to 5%, while the Marginal Standing Facility (MSF) rate and the bank rate now stand at 5.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-avadhut-sathe-pune-finfluencer-sebi-ban-stock-market-trading-academy-2831077-2025-12-05",
      "headline": "Who is Avadhut Sathe, Pune finfluencer whose trading academy got banned by SebiSebi said that Avadhut Sathe Trading Academy was running an unregistered investment advisory business disguised as education, misleading investors through selective performance claims, paid WhatsApp groups, and live market recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-as-investors-eye-rbis-mpc-decision-2831076-2025-12-05",
      "headline": "Sensex, Nifty open flat as investors eye RBI's MPC decisionAround 9:36 am, the Sensex was down 60 points at 85,325, while the Nifty hovered just above the 26,000 mark with a modest 11 point gain. Broader market indices were largely in the red, reflecting the nervousness ahead of the policy outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-rate-cut-announcement-today-governor-sanjay-malhotra-rupee-all-time-low-inflation-gdp-growth-2831067-2025-12-05",
      "headline": "RBI MPC announcement today: Will the all-time low rupee force a rate cut?Earlier this year, the RBI cut the repo rate by 100 basis points across three rounds, supported by falling inflation. But the backdrop has now shifted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-finfluencer-avadhut-sathe-stock-market-biggest-crackdown-impounds-rs-546-crore-2831051-2025-12-05",
      "headline": "Sebi bans finfluencer Avadhut Sathe, impounds Rs 546 crore in major crackdownThe order, issued on December 4, marks a turning point in Sebi's push to clean up the finfluencer ecosystem, where many online trainers claim to offer education but end up giving specific stock tips, guidance and live trading calls without any regulatory licence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/certain-actors-dislike-indias-growing-role-in-markets-owing-to-russia-ties-putins-dig-at-trump-tariffs-2830908-2025-12-04",
      "headline": "Putin says Trump's tariff stance reflects fear of India's economic riseRussian President Putin said that the tariff actions by US President Donald Trump and concerns raised by Western nations over India's Russian oil imports reflect worry about India's rising economic influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/russia-president-vladimir-putin-exclusive-dedollarisation-rupee-rouble-trade-brics-currency-2830962-2025-12-04",
      "headline": "No need for haste: Vladimir Putin on BRICS currency, de-dollarisationVladimir Putin's comments come at a time when conversations around de-dollarisation, alternative payment networks, and local currency trade have gained momentum within the BRICS bloc, especially after Western sanctions reshaped the global financial landscape."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/russia-india-oil-energy-ties-unaffected-vladimir-putin-exclusive-interview-india-today-2830933-2025-12-04",
      "headline": "Our energy cooperation with India remains unaffected, says Vladimir PutinAs Western pressure intensifies on countries buying Russian crude, Vladimir Putin said that India–Russia energy ties will continue unhindered and remain anchored in long-standing commercial trust."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/move-out-of-comfort-zone-uday-kotak-warns-businesses-as-rupee-hits-record-low-2830705-2025-12-04",
      "headline": "Move out of comfort zone: Uday Kotak warns businesses as rupee hits record lowRecent comments by Uday Kotak highlight the effects of foreign investor actions on the Indian stock market, with Indian investors responding as buyers amid international exits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-nse-bse-it-stocks-tcs-infosys-tech-mahindra-2830678-2025-12-04",
      "headline": "Sensex, Nifty recover to end higher as IT stocks lift marketsThe S&P BSE Sensex added 158.51 points to close at 85,265.32, while the NSE Nifty50 gained 47.75 points to end at 26,033.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-rent-rules-for-2025-will-tenants-finally-get-a-fair-deal-2830640-2025-12-04",
      "headline": "New rent rules for 2025: Will tenants finally get a fair deal?High rental deposits often force families to block large sums of money for years. The new 2025 rules hope to fix that. An expert breaks down how these changes could reshape renting and strengthen household finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-gdp-growing-why-is-rupee-falling-currency-crisis-explained-2830631-2025-12-04",
      "headline": "India's economy is booming, but why is the rupee tumbling?India's economic growth is surging, yet the rupee keeps weakening as global risks rise and dollar demand expands. Why is a growing economy unable to prevent its currency from sliding further?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ibm-ceo-arvind-krishna-tech-layoffs-over-hiring-not-ai-2830619-2025-12-04",
      "headline": "IBM CEO Arvind Krishna explains why tech layoffs have increasedIBM itself announced plans this year to cut thousands of jobs as it shifts focus to areas like artificial intelligence consulting and software."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tier-2-cities-and-women-investors-drive-indias-crypto-boom-report-2830583-2025-12-04",
      "headline": "Tier-2 cities and women investors drive India's crypto boom: ReportIndia's crypto landscape is changing fast, with Tier-2 cities and women investors emerging as the strongest new drivers of growth, according to a new report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investing-rs-5000-in-mutual-funds-why-you-should-not-go-for-multiple-sips-2830552-2025-12-04",
      "headline": "Investing Rs 5,000 in mutual funds? Why you should not go for multiple SIPsAre you planning to start investing with a Rs 5,000 SIP and thinking multiple funds will give you better diversification? Expert says this common approach may actually weaken your long-term returns. Here's how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/real-estate-india-outperforms-stocks-15-percent-returns-metro-infrastructure-growth-2830525-2025-12-04",
      "headline": "Are real estate investments outpacing stocks? Study points to 15% returnsA new study suggests that Indian residential property delivered 15% returns over the past year, surpassing many equity portfolios and challenging popular narratives about real estate's investment value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-in-december-rs-30000-crore-meesho-icici-aequs-investors-should-know-listing-gains-valuations-2830532-2025-12-04",
      "headline": "Rs 30,000 crore IPO wave is coming in December. What should investors knowDecember includes large names such as Meesho, ICICI Prudential Asset Management Company (ICICI Pru AMC), Clean Max Enviro Energy Solutions, Fractal Analytics, Juniper Green Energy, and several mid-size and SME firms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-gold-hold-above-rs-130-lakh-here-what-experts-say-2830501-2025-12-04",
      "headline": "Will gold hold above Rs 1.30 lakh? Here's what experts sayGold prices in India remained stable as traders waited for the outcome of the US Federal Reserve meeting, with attention on both international and local drivers amid market volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-check-latest-subscription-details-gmp-and-more-2830491-2025-12-04",
      "headline": "Aequs IPO: Check latest subscription details, GMP and moreThe grey market premium for the Aequs IPO is currently around Rs 45.5. Based on this, the estimated listing price works out to approximately Rs 169.5, implying potential listing gains of about 36.69% over the upper end of the price band."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-celebrates-dhurandhar-day-praises-aditya-dhar-and-teams-hard-work-2831084-2025-12-05",
      "headline": "It's Dhurandhar Day today: Read Yami Gautam's post on husband Aditya Dhar's film Actor Yami Gautam shared a post on X and celebrated husband Aditya Dhar's latest film Dhurandhar. She gave a shout-out to the entire team while praising their efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bonds-dakota-johnson-jessica-alba-at-red-sea-festival-2831065-2025-12-05",
      "headline": "Aishwarya Rai bonds with Dakota Johnson, Jessica Alba at Red Sea Festival. Pics Aishwarya Rai Bachchan made a notable appearance at the Red Sea Film Festival 2025, where her interactions with international stars Dakota Johnson and Jessica Alba sparked online interest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/avm-saravanan-legacy-honoured-kamal-haasan-tamil-film-industry-2831055-2025-12-05",
      "headline": "Kamal Haasan mourns AVM Saravanan, reflects on six-decade bond Veteran Tamil producer AVM Saravanan died at 86, prompting tributes from across the film industry. Kamal Haasan reflected on his personal and professional connection with Saravanan and AVM Productions, underlining the impact the producer had on Tamil cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kim-cattrall-marries-russell-thomas-intimate-london-wedding-chelsea-old-town-hall-2831039-2025-12-05",
      "headline": "Actor Kim Cattrall marries longtime partner Russell Thomas in London ceremony Sex and the City actor Kim Cattrall got married to her partner of nine years, Russell Thomas, in a private gathering at Chelsea Old Town Hall in London. The intimate wedding was attended by a small group of family and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-release-postponed-indefinitely-legal-financial-issues-telugu-film-2831038-2025-12-05",
      "headline": "Akhanda 2 release postponed: Why Balakrishna's film was delayed amid legal row Nandamuri Balakrishna's much-anticipated Telugu sequel, Akhanda 2, has been postponed indefinitely amid mounting legal and financial troubles. The film, previously set for a December 5 release, faces uncertainty amid confusion in the Telugu states and a court dispute involving Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/euphoria-season-3-debut-hbo-max-europe-expansion-new-series-updates-2831032-2025-12-05",
      "headline": "HBO sets Euphoria 3 for April 2026, unveils major Game of Thrones expansion HBO announced the return of Zendaya's Euphoria season 3 in April. Other than this, the network also teased the expansion of popular series Game of Thrones at the London event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-bedi-if-i-wasnt-typecast-i-wouldnt-have-survived-for-so-many-years-2830685-2025-12-05",
      "headline": "Rakesh Bedi: If I wasn't typecast, I wouldn't have survived for so many years Veteran actor Rakesh Bedi talks about being repeatedly cast as a comedian over the decades, and opens up about his latest role as a Pakistani politician in the film Dhurandhar in an exclusive interview"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-summer-i-turned-pretty-movie-delayed-filming-yet-to-begin-no-christmas-2025-release-2831029-2025-12-05",
      "headline": "The Summer I Turned Pretty movie to release this Christmas? Creator shares update Popular Prime Video series The Summer I Turned Pretty movie is one of the highly anticipated dramas. While fans wait excitedly to catch a glimpse of their favourite actor, creator Jenny Han spilled the beans about the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/men-in-black-new-film-script-chris-bremner-sony-reboot-2831026-2025-12-05",
      "headline": "New Men in Black film in works, Sony brings Chris Bremner on board as writer Sony Pictures moves forward with a new Men in Black installment, bringing on Chris Bremner as writer. The studio has not attached any talent yet, but plans involve approaching actor Will Smith to potentially reprise his role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-mid-week-eviction-malti-chahar-eliminated-before-grand-finale-2830997-2025-12-05",
      "headline": "Bigg Boss 19 Ep 103: Malti Chahar eliminated; Top 5 finalists revealed Bigg Boss 19's 103rd episode featured a surprise eviction, emotional revelations, and the announcement of finalists as the reality show nears its conclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-family-wedding-celebration-mumbai-sister-kritika-traditional-ceremony-2830966-2025-12-04",
      "headline": "Kartik Aaryan grooves to Lollipop Lagelu at sister's sangeet. Watch Actor Kartik Aaryan's sister Kritika Tiwari tied the knot in Mumbai, with the family marking the occasion through music and dance, accompanied by close friends and relatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brothers-honoured-hollywood-tcl-theatre-emotional-anniversary-tribute-priyanka-chopra-2830877-2025-12-04",
      "headline": "Nick Jonas gives shoutout to Priyanka Chopra at Jonas Brothers' TCL ceremony Singer Nick Jonas publicly thanked Priyanka Chopra for her support at a Hollywood event honouring the Jonas Brothers, coinciding with the couple's wedding anniversary and reflecting on their journey together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dulhania-le-jayenge-statue-unveiled-london-30-years-bollywood-classic-2830888-2025-12-04",
      "headline": "SRK, Kajol mark 30 years of DDLJ with bronze statue unveiling in London Bollywood stars Shah Rukh Khan and Kajol commemorate three decades of the iconic film Dilwale Dulhania Le Jayenge by unveiling a bronze statue at London's Leicester Square, marking the first time an Indian movie is honoured in this way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hrithik-roshan-cant-wait-for-ikkis-says-agastya-nanda-got-him-cheering-2830846-2025-12-04",
      "headline": "Hrithik Roshan can't wait for Ikkis, says Agastya Nanda got him cheering Sriram Raghavan's film Ikkis, starring Agastya Nanda and Simar Bhatia with Dharmendra in his final on-screen role, receives praise from Hrithik Roshan. It is set for a December 25 cinema release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/karan-johar-wins-best-host-asian-academy-awards-the-traitors-season-2-details-2830868-2025-12-04",
      "headline": "KJo wins Best Host at Asian Academy Awards for Traitors. Check Season 2 details Karan Johar won best host at the Asian Academy Creative Awards for 'The Traitors' on Thursday. The reality show's second season is reportedly scheduled to stream from March 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/emily-in-paris-season-5-trailer-lily-collins-takes-love-and-chaos-to-rome-2830875-2025-12-04",
      "headline": "Emily in Paris Season 5 trailer: Lily Collins takes love and chaos to Rome The trailer for season 5 of Emily in Paris introduces Emily's new journey in Rome, highlighting her professional and personal struggles as she takes on a leadership role and navigates new relationships. The series will be released on December 18, with all episodes available at once."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hello-namaste-assalamu-alaikum-aishwarya-rai-greets-fans-at-red-sea-festival-2830855-2025-12-04",
      "headline": "Hello, namaste, assalamu alaikum: Aishwarya Rai greets fans at Red Sea Festival Aishwarya Rai's warm greeting -- \"hello, namaste, assalamu alaikum\" -- captivated fans at the Red Sea Film Festival. The actor looked graceful in her black gown as she spoke at a session. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-hilariously-asks-jaaved-jaaferi-for-dance-lessons-in-birthday-wish-2830840-2025-12-04",
      "headline": "Ajay Devgn hilariously asks Jaaved Jaaferi for dance lessons in birthday wish As actor Jaaved Jaaferi turned a year older on Thursday, his 'De De Pyaar De 2' co-star Ajay Devgn shared a quirky wish on social media. Jaaved's dancing skills were reflected in the song '3 Shaukk', in which he danced alongside his son Meezaan.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoor-recalls-anand-ahuja-new-york-proposal-on-8th-engagement-anniversary-2830783-2025-12-04",
      "headline": "Sonam Kapoor recalls Anand Ahuja's New York proposal on 8th engagement anniversary Sonam Kapoor looked back at her 2016 New York engagement to Anand Ahuja, as the couple prepare to welcome their second child. She shared a throwback picture from eight years ago, marking the occasion. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/400-indigo-flights-cancelled-across-multiple-airports-today-as-utter-chaos-continues-2831085-2025-12-05",
      "headline": "IndiGo mess enters Day 3, 400 flights cancelled across airportsOf the total today, at least 330 flights were cancelled in Mumbai, Pune, Bengaluru and Hyderabad, leading to widespread chaos at the airports. The massive disruptions have continued for a third day, throwing travel plans into disarray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vladimir-putin-india-visit-live-updates-india-today-world-exclusive-interview-russia-india-ties-pm-modi-meeting-in-delhi-trade-defence-talks-private-dinner-2830531-2025-12-04",
      "headline": "Live: Stage set for tri-service guard of honour for Russia's PutinRussian President Putin in India Live Updates: Russian President Vladimir Putin, who landed in Delhi on Thursday evening, will begin the day 2 of his visit with a ceremonial welcome at the Rashtrapati Bhavan at 11 am, followed by a wreath-laying at Rajghat. He will then meet Prime Minister Narendra Modi at Hyderabad House where the two leaders will hold their bilateral talks, which will be followed by signing of agreements and a joint press conference. At 7 pm, President Droupadi Murmu will host a dinner for the President. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-president-vladimir-putin-23rd-india-russia-summit-talks-defence-trade-focus-2831050-2025-12-05",
      "headline": "PM Modi, Putin to hold India-Russia Summit today, focus on defence and tradeIn a rare diplomatic gesture, Prime Minister Narendra Modi personally received Russian President Vladimir Putin at the airport on Thursday evening with a warm hug and handshake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-reduces-key-lending-rate-by-25-points-to-525-2831083-2025-12-05",
      "headline": "RBI reduces key lending rate by 25 points to 5.25%, maintains neutral stanceThe rate cut takes the repo rate down from 5.5% to 5.25%. Alongside this, the Standing Deposit Facility (SDF) rate has been adjusted to 5%, while the Marginal Standing Facility (MSF) rate and the bank rate now stand at 5.5%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/russia-president-vladimir-putin-delhi-first-india-trip-2000-nuclear-nudge-taj-mahal-vajpayee-mumbai-bhabha-atomic-2830649-2025-12-05",
      "headline": "Wah Taj, and a nuclear nudge: How Putin's first India visit gave a pat to PokhranAs Russian President Vladimir Putin landed in New Delhi on Thursday, the moment inevitably looped back to his very first India trip a quarter-century ago. In 2000, a 47-year-old new Russian president arrived in winter-soaked Delhi to reboot an old partnership. The 2000 visit saw him do a namaste in Parliament, stroll through the Taj Mahal, and deliver a quiet nuclear nudge to India by posing in front of the nuclear reactor for Pokhran tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-finfluencer-avadhut-sathe-stock-market-biggest-crackdown-impounds-rs-546-crore-2831051-2025-12-05",
      "headline": "Sebi bans finfluencer Avadhut Sathe, impounds Rs 546 crore in major crackdownThe order, issued on December 4, marks a turning point in Sebi's push to clean up the finfluencer ecosystem, where many online trainers claim to offer education but end up giving specific stock tips, guidance and live trading calls without any regulatory licence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/why-modi-and-putin-rode-a-fortuner-and-not-the-usual-armoured-suv-2830886-2025-12-04",
      "headline": "White Fortuner grabs focus as PM Modi welcomes Putin at Delhi airportPM Modi and President Putin took an unusual joint ride in a white Fortuner from Palam Airport, bypassing their standard VIP fleets and highlighting a rare display of personal rapport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-got-lucky-pm-modi-lives-and-breathes-india-vladimir-putin-to-india-today-2830963-2025-12-04",
      "headline": "India got lucky. Modi lives and breathes India: Putin's glowing praise for PMVladimir Putin called Prime Minister Narendra Modi a reliable leader deeply committed to India and to strengthening India-Russia ties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/karnataka-chief-minister-post-tussle-siddaramaiah-dk-shivakumar-high-command-missing-2831090-2025-12-05",
      "headline": "Karnataka's Game of Thrones: When high command goes missingKaun Banega Mukhya Mantri? DK Shivakumar (DKS) or Siddaramaiah (Sidda) is the latest Congress political soap opera being played out in full media glare. So who is responsible for the growing perception of drift and chaos in the Congress's one last remaining large state fortress?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/if-us-has-right-to-buy-fuel-from-us-why-shouldnt-india-have-the-same-privilege-putin-calls-out-hypocrisy-2830923-2025-12-04",
      "headline": "If US has right to buy fuel from us...: Putin calls out Trump's hypocrisyPutin interview: Russian President Putin, who arrived in New Delhi for a two-day visit, emphasised that India should enjoy the same privilege if the US had the right to purchase fuel from Moscow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indigo-share-price-falls-mass-flight-cancellations-operational-disruptions-2831086-2025-12-05",
      "headline": "IndiGo shares tumble 2% as mass flight cancellations continue to disrupt travel IndiGo's stock fell over 2%, trading at Rs 5,326.35 by 10 am, amid mounting concerns over ongoing mass cancellations and delays across India's busiest airports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-release-and-review-updates-ranveer-singh-film-set-for-a-grand-start-2831064-2025-12-05",
      "headline": "Dhurandhar Release and Review Live: How many tickets did Ranveer Singh's film sell in advance?Dhurandhar Movie Review and Release Live Updates: Ranveer Singh's Dhurandhar is all set for a grand release on December 5. Directed by Aditya Dhar, the film is set against the backdrop of real-life events involving geopolitical conflicts, covert operations by the Indian Army, and other outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-red-star-over-delhi-when-soviet-leader-leonid-brezhnev-visited-india-2831094-2025-12-05",
      "headline": "The Red Star over Delhi: When Soviet leader Brezhnev visited IndiaOn November 26, 1973, Soviet leader Leonid Brezhnev arrived in Delhi and was greeted by massive crowds as discussions began on economic aid and regional security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/with-just-one-phone-number-proxyearth-is-showing-location-personal-details-of-all-indians-2830677-2025-12-04",
      "headline": "With just one phone number ProxyEarth is showing location, details of all IndiansImagine this: with just one phone number you have the ability to look at everyone's location, sometimes even live location in real-time, complete with details like full name, address and father's name. This is no joke because a rogue website called ProxyEarth is allowing just that. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gifts-russian-gita-to-putin-calls-scripture-inspiration-for-millions-glbs-2831007-2025-12-05",
      "headline": "PM Modi gifts Russian Gita to Putin, calls scripture inspiration for millionsPrime Minister Narendra Modi gifted a Russian edition of the Bhagavad Gita to President Vladimir Putin during his Delhi visit, calling its teachings an inspiration for millions as both leaders highlighted their longstanding India–Russia friendship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-release-postponed-indefinitely-legal-financial-issues-telugu-film-2831038-2025-12-05",
      "headline": "Akhanda 2 release postponed: Why Balakrishna's film was delayed amid legal rowNandamuri Balakrishna's much-anticipated Telugu sequel, Akhanda 2, has been postponed indefinitely amid mounting legal and financial troubles. The film, previously set for a December 5 release, faces uncertainty amid confusion in the Telugu states and a court dispute involving Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-vladimir-putins-full-interview-with-india-today-a-world-exclusive-2830972-2025-12-04",
      "headline": "Watch Vladimir Putin's full interview with India Today, a world exclusiveIn an exclusive interview with India Today, Russian President Vladimir Putin spoke on India-Russia relations, his equations with Prime Minister Narendra Modi, US President Donald Trump's peace initiative, US trade war, Russia-Ukraine war and on a slew of issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/rahul-mamkootathil-kerala-case-rape-congress-leader-warned-shafi-parambil-women-2830459-2025-12-04",
      "headline": "Congress leader from Kerala says she alerted party of expelled MLA's misconductCongress leader MA Shahanas alleged she had warned then Youth Congress president Shafi Parambil about Rahul Mamkootathil's misconduct, but her concerns were mocked. Fresh rape complaints have emerged against the suspended MLA. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-100-hundreds-stats-odi-world-cup-sachin-tendulkar-record-2831045-2025-12-05",
      "headline": "Can Virat Kohli reach 100 hundreds? The dream vs the reality in numbersAt 84 centuries, Virat Kohli stands at the edge of cricket's last great mountain. His twin tons against South Africa have revived a dream once fading. But can belief, form and time align for one final miracle?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/pornstar-martini-idli-top-trending-recipes-india-2025-search-report-2830706-2025-12-05",
      "headline": "The recipe Indians can't stop Googling is 'Pornstar Martini'. What is it?FYI, there's nothing salacious or sexual about Pornstar Martini."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-administration-to-expand-travel-ban-from-19-to-over-30-countries-noem-says-glbs-2831034-2025-12-05",
      "headline": "Trump to expand travel ban to 30 countries in major immigration crackdownUS Homeland Security Secretary Kristi Noem says the Trump administration will expand its travel ban from 19 to over 30 countries, without naming additions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-elevates-asim-munir-as-first-chief-of-defence-forces-in-major-power-shift-glbs-2831008-2025-12-05",
      "headline": "Pakistan elevates Asim Munir as first Chief of Defence Forces in major power shiftPakistan appoints Asim Munir as first Chief of Defence Forces, retaining army chief role; critics warn that the consolidation of military power after political bargaining further strengthens army dominance over civilian authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-mossad-chief-israel-roman-gofman-no-intelligence-background-gaza-war-netanyahu-2831079-2025-12-05",
      "headline": "Netanyahu picks new chief for Israel's Mossad. He has no intel experienceMajor General Roman Gofman, a veteran of Israel's armoured corps and commander during the 2023 Gaza war, has been moved from military to head of Mossad, marking a rare leap from army to intelligence leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yami-gautam-celebrates-dhurandhar-day-praises-aditya-dhar-and-teams-hard-work-2831084-2025-12-05",
      "headline": "It's Dhurandhar Day today: Read Yami Gautam's post on husband Aditya Dhar's filmActor Yami Gautam shared a post on X and celebrated husband Aditya Dhar's latest film Dhurandhar. She gave a shout-out to the entire team while praising their efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-bonds-dakota-johnson-jessica-alba-at-red-sea-festival-2831065-2025-12-05",
      "headline": "Aishwarya Rai bonds with Dakota Johnson, Jessica Alba at Red Sea Festival. PicsAishwarya Rai Bachchan made a notable appearance at the Red Sea Film Festival 2025, where her interactions with international stars Dakota Johnson and Jessica Alba sparked online interest."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-vs-eng-joe-root-grace-hayden-instagram-2831089-2025-12-05",
      "headline": "Joe Root saved our eyes: Grace Hayden's hilarious reaction to batter's hundred Matthew Hayden's daughter Grace had a hilarious reaction to Joe Root hitting his maiden Test century in Australia. Grace took to Instagram to thank the gods, for a very specific reason."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-after-virat-kohlis-successive-centuries-3rd-odi-tickets-sell-out-in-minutes-2831073-2025-12-05",
      "headline": "After Virat Kohli's successive centuries, 3rd ODI tickets sell out in minutes Virat Kohli's consecutive centuries have caused a rapid sell-out of tickets for the third ODI in Visakhapatnam. The star batter scored back-to-back hundreds in first two matches in Ranchi and Raipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fc-goa-vs-mumbai-city-super-cup-rare-red-card-iker-2831074-2025-12-05",
      "headline": "FC Goa captain shown red card before kick-off in Super Cup semi-final Super Cup: An incredibly rare incident happened in FC Goa's Super Cup semi-final against Mumbai City FC. Goa's captain Iker Guarrotxena was shown a straight red card before the match even started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-can-fix-indias-odi-finisher-problem-rishabh-pant-rinku-singh-shivam-dube-2831066-2025-12-05",
      "headline": "Pant, Rinku or Dube: Who is best suited to fix India's ODI finisher problem? Aside from the dew, one issue has followed India throughout this ODI series against South Africa: the lack of runs from the lower order. KL Rahul has produced back-to-back half-centuries in the role. Still, the continued struggles of Washington Sundar and Ravindra Jadeja have left India without a dependable finisher in the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-100-hundreds-stats-odi-world-cup-sachin-tendulkar-record-2831045-2025-12-05",
      "headline": "Can Virat Kohli reach 100 hundreds? The dream vs the reality in numbers At 84 centuries, Virat Kohli stands at the edge of cricket's last great mountain. His twin tons against South Africa have revived a dream once fading. But can belief, form and time align for one final miracle?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-breaks-silence-on-shock-ipl-retirement-ahead-of-2026-auction-2831040-2025-12-05",
      "headline": "Andre Russell breaks silence on shock IPL retirement: Here's what really happened West Indies all-rounder Andre Russell has finally opened up on his shocking retirement from the Indian Premier League (IPL) ahead of the 2026 edition of the tournament. Russell was released by Kolkata Knight Riders (KKR) ahead of the auction for upcoming edition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/average-joe-to-not-a-bad-root-england-star-aussie-media-gabba-ashes-hundred-2830990-2025-12-04",
      "headline": "Average Joe to Not a Bad Root: England star makes Aussie media eat their words Ashes: Before the Gabba hundred, Joe Root had been labelled \"Average Joe\" by the West Australian newspaper, but by Friday morning the same publication had performed a swift U-turn, splashing \"He's not a bad Root after all\" across its front page."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-mohammed-siraj-converted-one-format-player-aakash-chopra-baffled-india-selection-call-2830992-2025-12-04",
      "headline": "Siraj converted to a one-format player? Chopra baffled by India's selection call IND vs SA: Aakash Chopra questions why Mohammed Siraj has been pushed out of India's white-ball squads, noting his strong economy rates against Australia and insisting the pacer deserves more than a one-format role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-how-australia-plan-drop-nathan-lyon-help-england-gabba-pink-ball-test-2830975-2025-12-04",
      "headline": "How Australia's pace-only strategy helped England in Gabba day-night Test Australia's bold call to leave out Nathan Lyon for the Gabba day-night Test is already drawing scrutiny, with England's top order openly acknowledging how the absence of the veteran off spinner helped them settle into rhythm on a fluctuating opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-innings-of-his-life-ashes-century-australia-vs-england-michael-atherton-2830961-2025-12-04",
      "headline": "Joe Root played the innings of his life in Gabba Test: Atherton hails England batterAshes 2025: Michael Atherton hailed Joe Root's long-awaited Gabba century as the finest innings of his career. Root's composure under immense early pressure from Starc and Boland turned gave England an anchor amidst a batting collapse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-shock-update-2026-fifa-world-cup-participation-2830945-2025-12-04",
      "headline": "Messi shocks fans with sceptical World Cup claim: At worst, I will be watchingLionel Messi has shocked football fans by admitting he may not play at the 2026 World Cup, even as he stressed his desire to join Argentina's title defence. The world champions will travel to North America without any confirmation from their captain, whose future remains uncertain as he nears his 39th birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/east-bengal-beat-punjab-fc-aiff-super-cup-semi-final-match-report-2830939-2025-12-04",
      "headline": "East Bengal into AIFF Super Cup final after humbling Punjab FC 3-1East Bengal powered into the AIFF Super Cup final with a commanding 3–1 win over Punjab FC. A blend of sharp finishing and set-piece dominance guided Oscar Bruzon's side to their second cup final of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-2nd-test-nathan-lyon-dropped-second-ashes-test-australia-gabba-brisbane-2830907-2025-12-04",
      "headline": "Nathan Lyon furious after Gabba Test snub, refused to sit with coach and selectorsAustralian spinner Nathan Lyon has voiced his disappointment after being dropped for the second Ashes test in Brisbane, his first home omission since 2012. Despite his strong record, selectors opted for an all-pace attack, with Michael Neser included in the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-2025-title-battle-lando-norris-no-favours-oscar-piastri-max-verstappen-2830899-2025-12-04",
      "headline": "Lando Norris not asking McLaren for favours as F1 title fight goes down to Abu DhabiNorris refuses to ask teammate Oscar Piastri for a title-deciding favour, even if it hands Max Verstappen the crown. As McLaren eyes a rare double, the Brit insists the championship should be earned on track — not gifted through team orders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-mitchel-starc-wickets-record-wasim-akram-true-pinnacle-australia-vs-england-2830889-2025-12-04",
      "headline": "Wasim Akram still the GOAT: Mitchell Starc reacts after breaking all-time recordMitchell Starc rewrote history at the Gabba by becoming the most successful left-arm fast bowler in Test cricket. Yet even after breaking Wasim Akram's record, he insisted the Pakistani legend remains the true pinnacle of left-arm pace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-zak-crawley-praises-humble-joe-root-after-much-awaited-australia-hundred-2830887-2025-12-04",
      "headline": "Zak Crawley praises humble Joe Root after much-awaited Australia hundredAshes: Zak Crawley praised a \"flawless\" Joe Root after the 34-year-old finally ended his long wait for an Ashes century in Australia on the opening day of the pink-ball Test in Brisbane on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-racketlon-open-vikramaditya-chaufla-wins-title-2830867-2025-12-04",
      "headline": "Vikramaditya Chaufla beats Russian veteran on way to Indian Racketlon Open titleRacketlon is a fast growing sport where the competitors are required to play four racket sports: table tennis, badminton, tennis and squash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-shines-in-smat-to-knock-on-selection-doors-again-2830827-2025-12-04",
      "headline": "Snubbed for SA T20Is, Mohammed Shami shines in SMAT to knock on selection doorsMohammed Shami, left out of India's T20I squad for the South Africa tour, knocked on the selection doors once again with the match-winning bowling performance in SMAT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-joe-root-conquer-final-frontier-maiden-hundred-down-under-australian-media-red-faced-2830835-2025-12-04",
      "headline": "Root not just an average Joe: Conquering the final frontier leaves Aussies red-facedAshes 2025-26, 2nd Test: Joe Root answered years of Australian criticism with his first Ashes century Down Under, turning the \"average Joe\" jibe on its head and giving England a powerful foothold in the day-night Test after posting more than 300 in the first innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-vs-england-gabba-test-joe-root-century-ben-stokes-reaction-watch-video-2830833-2025-12-04",
      "headline": "Go ball, yes Joe: Ben Stokes full of emotions as Root snaps century-curse at GabbaAshes 2025: Joe Root's long-awaited maiden century in Australia lit up an otherwise tense opening day at the Gabba. Ben Stokes' emotional celebration captured the magnitude of the moment as England battled to stay afloat in the Ashes opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-raipur-special-pretoria-capitals-coach-sourav-ganguly-2830790-2025-12-04",
      "headline": "Dewald Brevis's Raipur special amazes Pretoria Capitals coach Sourav GangulyFormer India captain Sourav Ganguly said Pretoria Capitals are particularly excited about securing Dewald Brevis's services for the long term. Ganguly praised the young South African after he lit up Raipur with a blistering knock that played a key role in one of the most remarkable run chases ever seen on Indian soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-six-wickets-joe-root-century-england-pink-ball-test-gabba-2830771-2025-12-04",
      "headline": "Root vs Starc's magical tussle sets tone for gripping Pink Ball Test in GabbaAshes: A gripping battle between Joe Root and Mitchell Starc set the tone for what could turn out to be a defining Test match at the Gabba. The duo headlined Day 1 of the 2nd Test where the teams traded blows in a see-sawing game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-fast-bowler-mark-wood-uncertain-third-ashes-test-injury-struggles-2830725-2025-12-04",
      "headline": "Mark Wood casts doubt over return in Adelaide Test after painkilling injectionsMark Wood has cast doubt on his availability for the third Ashes Test in Adelaide, citing ongoing knee trouble. The England fast bowler, who only recently returned from surgery, said he is more likely to be fit for the Melbourne or Sydney Tests after undergoing painkilling injections and spending time in a knee brace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-maiden-ashes-hundred-in-australia-matthew-hayden-nude-run-mcg-2830727-2025-12-04",
      "headline": "Matthew Hayden doesn't have to run nude, thanks to Joe Root's maiden ton Down UnderAshes 2025-26, 2nd Test: Matthew Hayden's bold take finally came to fruition as Joe Root went on to score his maiden Ashes hundred in Australian soil, leaving the legendary Australian batter relieved that he did not have to run buck naked. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-fide-ranking-youngest-3-year-old-sarwagya-singh-kushwaha-2830715-2025-12-04",
      "headline": "Meet Sarwagya Singh Kushwaha: A 3-year-old chess prodigy with a FIDE rankingThree-year-old Sarwagya Singh Kushwaha has become the youngest player ever to earn an official FIDE rating, rewriting chess history with his extraordinary achievement. His rapid rise and victories over international opponents have stunned the chess community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-joe-root-century-australia-vs-england-maiden-brisbane-pink-ball-test-2830660-2025-12-04",
      "headline": "Ashes: Joe Root breaks curse, hits maiden Test hundred in AustraliaAshes 2025: Joe Root finally broke his century drought in Australia with a superb maiden hundred at the Gabba, rescuing England from an early collapse. His innings delivered the stability and intent England needed amidst a batting collapse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-smat-venue-change-fan-frenzy-baroda-vs-gujarat-domestic-cricket-2830634-2025-12-04",
      "headline": "Hardik Pandya fan craze triggers SMAT venue change as crowds overwhelm organisersHardik Pandya's return to domestic cricket sparked unprecedented fan chaos in Hyderabad, forcing officials to shift Baroda's SMAT match to a larger venue. His comeback has reignited excitement and raised expectations ahead of India's T20 assignments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-2026-draw-pots-groups-format-rules-schedule-explained-2830605-2025-12-04",
      "headline": "How does the World Cup 2026 draw work? A look at how 48 teams will be groupedThe FIFA World Cup 2026 draw is all set to take place at the Kennedy Center in Washington, D.C, on Friday, December 5. Here's a look at how the draw will take place and how the teams will be grouped. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-future-harbhajan-singh-slams-people-not-achieved-much-gautam-gambhir-ind-vs-sa-2830590-2025-12-04",
      "headline": "RoKo's future being decided by people who have not achieved much: Harbhajan SinghIND vs SA: Harbhajan Singh's pointed remarks questioning those deciding Virat Kohli and Rohit Sharma's futures have reignited debate within Indian cricket. His comments land amid rising rumours of tension involving head coach Gautam Gambhir and the senior duo."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}