{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-hit-record-high-as-power-financial-stock-drive-market-rally-2606268-2024-09-25",
      "headline": "Sensex, Nifty hit record high as power and financial stock drive market rallyThe S&P BSE Sensex added 255.83 points to end at 85,169.87, while the NSE Nifty50 gained 63.75 points to close at 26,004.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-sbi-uco-canara-jm-financial-brokerage-11-psu-bank-stocks-buying-opportunities-selloff-2606209-2024-09-25",
      "headline": "PNB, SBI, UCO: JM Financial lists 11 PSU bank stocks worth buying after selloffSince reaching its 52-week high, the PSU Bank index has dropped by 15%, with banks like UCO Bank, Bank of India (BOI), Indian Overseas Bank (IOB), and Union Bank of India seeing sharper declines of 25-30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-shares-plunge-20-to-record-low-block-deal-nishant-pitti-2606182-2024-09-25",
      "headline": "Easy Trip Planners shares plunge 20% to record low. Here's what happenedThe steep decline in share price was triggered by news that promoter Nishant Pitti plans to sell 15 crore shares, representing 8.5% of the company's total share capital, in a block deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-gujarat-see-lowest-youth-unemployment-kerala-struggles-2606173-2024-09-25",
      "headline": " Madhya Pradesh, Gujarat see lowest youth unemployment, Kerala strugglesMadhya Pradesh and Gujarat have emerged as the best performers, boasting the lowest youth unemployment rates, while Kerala struggles with one of the highest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coldplay-concert-ticket-mumbai-hotel-prices-surge-taj-jw-marriott-westin-2606167-2024-09-25",
      "headline": "Coldplay mania: Mumbai hotel rates up by 300% for concert weekendWith Coldplay set to perform at DY Patil Stadium on January 18-19 and 21, 2025, hotel prices in Mumbai have skyrocketed, which might leave fans scrambling for accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-upper-circuit-5-percent-52-week-high-explained-2606115-2024-09-25",
      "headline": "Explained: Why Reliance Power shares hit 5% upper circuit today Reliance Power stock: What's behind the fresh rally? Investors are buzzing as the company makes big moves—find out what's driving the surge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salaried-employees-work-longer-hours-than-casual-workers-finds-survey-2606102-2024-09-25",
      "headline": "Salaried employees work longer hours than casual workers, finds surveyFor many corporate workers, these 48-hour weeks translate to roughly 9 hours of work each day if they're working five days a week, or 8 hours if it's a six-day work week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-rs-25000-crore-ipo-to-hit-markets-soon-gets-sebi-nod-likely-october-2606092-2024-09-25",
      "headline": "Hyundai IPO gets Sebi clearence. Check expected listing date The company submitted its draft papers in June 2024 and the IPO may be launched as soon as October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-opens-for-bidding-details-subscribe-skip-good-bad-expert-review-listing-gains-gmp-2606061-2024-09-25",
      "headline": "KRN Heat Exchanger IPO opens for bidding: Subscribe or skip? The IPO of KRN Heat Exchanger is entirely a fresh issue of 1.55 crore shares and will be open for subscription till September 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-25-2024-yellow-metal-trades-higher-silver-records-dip-mcx-latest-rates-2606054-2024-09-25",
      "headline": "Gold, silver price today, September 25, 2024: Yellow metal trades higher, silver records dip on MCXGold Price Today 25 September 2024: Gold is trading on the higher side while silver rates have recorded a dip on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-display-module-plant-tamil-nadu-oragadam-usd-1-billion-apple-iphone-production-report-2606044-2024-09-25",
      "headline": "Foxconn eyes $1 billion display module plant in Tamil Nadu: ReportThis will be the first display module facility Foxconn has built in India, and it is expected to mainly support the production of Apple's iPhones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-as-investors-take-breather-after-record-run-2606042-2024-09-25",
      "headline": "Sensex, Nifty open flat as investors take breather after record runThe S&P BSE Sensex was down 20.70 points to 84,893.34 at 10:23 am, while the NSE Nifty50 fell 18.20 points to trade at 25,922.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shankh-air-gets-approval-union-civil-aviation-ministry-all-you-need-to-know-about-india-new-airline-2605789-2024-09-24",
      "headline": "Shankh Air ready for takeoff: All you need to know about India's new airlineShankh Air, owned by Shankh Aviation Private Limited, has been granted a No Objection Certificate (NOC) by the ministry, valid for three years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-record-high-sensex-nifty-milestones-investor-trading-strategy-2605705-2024-09-24",
      "headline": "Sensex crosses 85,000, Nifty hits 26,000: Will bull run continue on D-Street? While Sensex and Nifty closed below record highs amid volatility, analysts remain cautiously optimistic, noting that Indian equities have defied global uncertainty to post strong gains this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-record-high-levels-tata-steel-2605624-2024-09-24",
      "headline": "Sensex, Nifty dip after hitting record highs; Tata Steel jumps 4%The Sensex settled 14.57 points lower at 84,929.25 after crossing 85,000 for the first time, while the NSE Nifty50 ended 1.35 points higher at 25,940.40 after crossing 26,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-expert-review-is-it-right-choice-for-parents-investment-tip-for-children-parents-2605608-2024-09-24",
      "headline": "NPS Vatsalya: Is it the right choice for parents?Unlike other financial products aimed at short-term goals like education or marriage, NPS Vatsalya focusses solely on long-term retirement savings for the child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-shares-list-at-1-percent-discount-rs-170-hold-or-sell-expert-views-2605565-2024-09-24",
      "headline": "Western Carriers shares list at 1% discount. Should you hold or sell? Western Carriers market listing: The company's stock opened at Rs 170 on the BSE, which is 1.16% below its issue price of Rs 172. On the NSE, the shares listed at Rs 171, down by Rs 1, or 0.6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exxaro-tiles-share-price-jumps-18-percent-today-stock-split-2605552-2024-09-24",
      "headline": "Explained: Why Exxaro Tiles shares jumped over 18% todayThe company stock price rose as much as 18.4% to Rs 94.96 in early trade. At 2 pm, shares of Exxaro Tiles were trading 17.24% higher at Rs 94.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-stock-market-listing-share-price-hold-sell-book-profit-expert-view-2605538-2024-09-24",
      "headline": "Northern Arc Capital shares list at 33% premium over IPO price. Hold or sell?Northern Arc Capital IPO listing: The stock opened at Rs 351 on the Bombay Stock Exchange, up 33.5% from its issue price of Rs 263. Similarly, it listed at Rs 350 on the National Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-share-price-stock-market-listing-book-profit-or-hold-expert-view-2605526-2024-09-24",
      "headline": "Arkade Developers shares gain 37% on listing: Should you book profit or hold?Arkade Developers stock opened at Rs 175 on the Bombay Stock Exchange, a 36.72% jump from its issue price of Rs 128. On the National Stock Exchange, the shares listed at Rs 175.90, reflecting a similar premium of 37.42%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ajit-pawar-maharashtra-election-sharad-pawar-mahayuti-alliance-india-today-conclave-2606323-2024-09-25",
      "headline": "Want to become Chief Minister, but get stuck as deputy, says Ajit PawarNo one has seen the future: Ajit Pawar on aligning with uncle Sharad Pawar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/self-defence-what-if-he-had-run-away-eknath-shinde-defends-cops-in-badlapur-encounter-at-mumbai-conclave-2606240-2024-09-25",
      "headline": "What if Badlapur sex assault accused had run away: Eknath Shinde defends copsMaharashtra Chief Minister Eknath Shinde defended the action of police who killed Akshay Shinde, the Badlapur sexual assault accused, saying they did so in self-defence else he would have escaped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-muda-scam-mysuru-siddaramaiah-charges-probe-court-registration-fir-case-lokayukta-submit-report-2606216-2024-09-25",
      "headline": "Karnataka court orders Lokayukta probe against Siddaramaiah in Mysuru land caseA Karnataka court ordered the Lokayukta to conduct an investigation against Chief Minister Siddaramaiah in the MUDA land scam case and submit a report in three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/paracetamol-antacid-pan-d-high-shelcal-high-blood-pressure-paracetamol-drugs-fail-quality-test-2606302-2024-09-25",
      "headline": "Paracetamol among 52 other drugs fail quality tests, raising safety concernsIn its latest monthly drug alert list, the Central Drugs Standards Control Organisation (CDSCO) declared 53 drugs, including paracetamol, as \"Not of Standard Quality (NSQ) Alert.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/lab-grown-diamonds-ethical-cheaper-blood-less-so-why-arent-they-as-popular-2606175-2024-09-25",
      "headline": "Lab-grown diamonds are ethical, cheaper, blood-less. So why aren't they as popular?Celebrities like Meghan Markle, Zoe Kravitz, Lady Gaga, and even Prime Minister Narendra Modi approve of lab-grown diamonds. They are cheaper and conflict-free, but why aren't they mainstream yet?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-conclave-aaditya-thackeray-badlapur-encounter-eknath-shinde-apte-2606224-2024-09-25",
      "headline": "Aaditya Thackeray on Badlapur encounter: A Shinde killed to protect an Apte?Aaditya Thackeray emphasised that multiple questions surround the encounter, where Shinde was reportedly killed in retaliatory fire after allegedly opening fire on the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iron-dome-israel-lebanon-hezbollah-cost-success-rate-what-is-it-export-us-war-gaza-hamas-pager-bombs-2605860-2024-09-25",
      "headline": "What's Iron Dome's success rate, cost of shooting down missile? 7 FAQs answeredVideos of Israel's Iron Dome shooting down rockets fired by Hezbollah and lighting up the night sky went viral. Though the Iron Dome is well known, there are some frequently asked questions (FAQs) like what is its success rate, how much does it cost to shoot down a missile, and how it feels on the ground? Here are answers to some of the FAQs.    "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/badlapur-encounter-bombay-high-court-rebukes-maharashtra-police-accused-killing-hard-to-believe-foul-play-2606163-2024-09-25",
      "headline": "This isn't an encounter: Court's tough questions over Badlapur accused's deathThe Bombay High Court said the Badlapur accused was not a 'strong man' and could have been overpowered by the four police officers after he pulled the first trigger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-india-today-conclave-mumbai-2024-animal-paparazzi-audience-love-2606259-2024-09-25",
      "headline": "Triptii Dimri at India Today Conclave Mumbai 2024: I don't want to be limitedBollywood actor Triptii Dimri attended Day 1 of the India Today Conclave Mumbai 2024 on September 25, where she spoke about her journey in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/himachal-pradesh/story/himachal-pradesh-mandates-food-vendors-eateries-display-owners-names-2606242-2024-09-25",
      "headline": "Himachal mandates food vendors, eateries to display owners' namesHimachal Pradesh's order comes on the lines of a similar diktat issued by the Uttar Pradesh government under which operators, proprietors, and managers must clearly display their names and addresses at all food and drink establishments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-farm-law-remarks-row-bjp-backlash-2605992-2024-09-25",
      "headline": "Kangana Ranaut regrets farm laws remark after BJP rebuke, second row in weeks As her comments drew sharp criticism from the BJP, Kangana Ranaut issued a public apology, stating, \"I take my words back.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-conclave-mumbai-eknath-shinde-maharashtra-assembly-election-mahayuti-alliance-2606231-2024-09-25",
      "headline": "No tussle in seat-sharing, working as a team: Eknath Shinde denies Mahayuti riftEknath Shinde exuded confidence of the Mahayuti alliance returning to power in Maharashtra, saying Lok Sabha and Assembly polls were fought on different strategies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-youtuber-3-things-he-noticed-delhi-most-expensive-mall-dlf-emporio-2606249-2024-09-25",
      "headline": "Bengaluru man shares 3 observations after visiting Delhi's 'most expensive mall'A Bengaluru YouTuber shared three things he noticed after visiting Delhi's \"most expensive mall\" DLF-Emporio. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-mumbai-2024/story/india-today-mumbai-conclave-2024-former-maharastra-chief-minister-prithviraj-chavan-bjp-congress-2606178-2024-09-25",
      "headline": "Who should get Chief Minister post? Congress's Prithviraj Chavan on MVA quandaryIndia Today Conclave Mumbai 2024: The former Maharashtra Chief Minister also said that it was not up to the Opposition to take a call on the Chief Ministerial face, \"the leadership in Delhi will decide\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rss-sunil-ambekar-on-naddas-bjp-capable-on-its-own-remark-family-matters-2606204-2024-09-25",
      "headline": "Family matter: RSS leader on JP Nadda saying BJP capable on its own  Union Minister JP Nadda had made the remark before the Lok Sabha polls when he was serving as BJP's National President. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-trolls-paris-olympics-medals-2606222-2024-09-25",
      "headline": "Manu Bhaker hits back at social media trolls: 'Wear my Olympic medals with pride'Olympian Manu Bhaker hit back at social media trolls who criticised her for showing off her medals in promotional events. Bhaker, in a scathing post, said that she wore the medals with pride and loved sharing her journey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-abu-dhabi-tickets-more-affordable-than-mumbai-2606214-2024-09-25",
      "headline": "Is it cheaper to see Coldplay perform in Abu Dhabi than in Mumbai?Coldplay's concert in Abu Dhabi may be cheaper than the sold-out Mumbai shows. Ticket prices, flight costs, and hotel rates suggest a more affordable experience for fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-rebukes-karnataka-high-court-judge-pakistan-remark-bengaluru-locality-cannot-call-region-of-india-2606060-2024-09-25",
      "headline": "Supreme Court rebukes High Court judge: Can't call any part of India as PakistanThe Supreme Court said a person cannot describe any region of India as \"Pakistan\" while taking note of a controversial remark on a Bengaluru locality by High Court judge Justice V Srishananda during a recent hearing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-video-dance-at-doctors-annual-conference-in-chennai-triggers-row-2605977-2024-09-25",
      "headline": "Video: Dance at Chennai doctors' conference triggers row for being 'vulgar'A dance performance at a Chennai medical conference has triggered a row. Several social media users shared the video and questioned the event, criticising the event for its \"vulgarity\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lucknow-hdfc-bank-employee-dies-akhilesh-yadav-work-stress-2606058-2024-09-25",
      "headline": "Bank staffer dies in office, Akhilesh Yadav blames BJP policies for work stressThe incident comes amid a nationwide outrage over the death of an Ernst and Young employee in Pune allegedly due to 'excessive workload'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/raveena-tandon-sonakshi-sinha-celebs-attend-red-carpet-event-in-style-2606201-2024-09-25",
      "headline": "Pics: Raveena Tandon, Sonakshi Sinha, celebs attend red carpet event in styleSeveral celebrities attended the Saudi Welcome To Arabia event in Mumbai on September 24. Take a look at the pictures here: "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-addresses-karthi-apology-on-tirupathi-laddu-comment-suriya-responds-2606007-2024-09-25",
      "headline": "Pawan Kalyan accepts Karthi's apology on Tirupathi laddu comment, Suriya respondsTamil actor Suriya thanked Pawan Kalyan after he accepted Karthi's apology over the laddu controversy. Karthi's comments sparked mixed reactions in the industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-kashmir-assembly-election-second-phase-voting-26-seats-239-candidates-2605984-2024-09-25",
      "headline": "Jammu and Kashmir Assembly polls phase 2: Over 46% voter turnout by 3 pm Live UpdatesThe People's Democratic Party has fielded 26 candidates, the highest number, followed by the National Conference with 20, BJP with 17, and the Congress with six. There are 170 independent and other candidates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-conflict-idf-missiles-lebanon-tel-aviv-siren-2606023-2024-09-25",
      "headline": "Israel foils Hezbollah missile attack targeting Mossad headquartersIsrael's offensive since Monday morning has killed 569 people, including 50 children, and injured 1,835 in Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/bhuvan-bam-taaza-khabar-2-jaaved-jaaferi-takeshis-castle-2606270-2024-09-25",
      "headline": "Pitched Taaza Khabar 2 to Jaaved Jaaferi after Takeshi's Castle: Bhuvan BamTaaza Khabar 2, featuring Jaaved Jaaferi as the antagonist, is set to stream on Disney+ Hotstar from September 27. Bhuvan Bam shared insights about getting Jaaferi onboard during an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devi-sri-prasad-meets-pm-narendra-modi-modi-and-us-event-2606291-2024-09-25",
      "headline": "Pushpa composer Devi Sri Prasad meets PM Modi, hugs him at US eventMusic composer Devi Sri Prasad met Prime Minister Narendra Modi at the recent 'Modi and US' event in New York. In a viral video, PM Modi can be seen hugging DSP and greeting him on stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-india-today-conclave-mumbai-2024-animal-paparazzi-audience-love-2606259-2024-09-25",
      "headline": "Triptii Dimri at India Today Conclave Mumbai 2024: I don't want to be limitedBollywood actor Triptii Dimri attended Day 1 of the India Today Conclave Mumbai 2024 on September 25, where she spoke about her journey in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/reeta-sanyal-adah-sharma-turns-lawyer-for-disney-hotstar-show-2606287-2024-09-25",
      "headline": "Reeta Sanyal: Adah Sharma turns lawyer for Disney+ Hotstar showDisney+ Hotstar announced a new show titled Reeta Sanyal featuring Adah Sharma in the titular role. She will be seen as a lawyer and detective."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-kanpur-test-bangladesh-chandika-hathurusingha-fitness-2606298-2024-09-25",
      "headline": "Shakib is available for selection in Kanpur Test: HathurusinghaIND vs BAN: Shakib Al Hasan's position in the Bangladesh team was questioned after he failed to perform to expectations in the opening Test at the MA Chidambaram Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-is-rishabh-pant-indias-best-wicketkeeper-batter-in-tests-2606250-2024-09-25",
      "headline": "IND vs BAN: Is Rishabh Pant India's best wicketkeeper-batter in TestsRishabh Pant recently equalled MS Dhoni's record for the most number of centuries by an Indian wicketkeeper-batter in Test cricket. Has he already established himself as India's best wicketkeeper-batter in the red-ball format? Diya Kakkar and Akshay Ramesh discuss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-steve-smith-opener-slot-deep-dasgupta-2606284-2024-09-25",
      "headline": "Steve Smith 'thinking about' opening in Border Gavaskar Trophy: Deep DasguptaDeep Dasgupta has revealed that Steve Smith is thinking about opening the batting in the Border Gavaskar Trophy against India. Smith has taken up the new role of opening in Tests after David Warner's retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-what-happened-last-time-when-india-played-a-test-match-in-kanpur-2606277-2024-09-25",
      "headline": "IND vs BAN: What happened last time when India played a Test match in KanpurIndia is set to face Bangladesh in the 2nd Test match at the Green Park Stadium in Kanpur. Let us have a look at India's record at the stadium and what happened the last time India played here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-rodri-ligament-injury-confirms-ruled-out-2606271-2024-09-25",
      "headline": "Manchester City confirm Rodri ruled out with ligament injury Manchester City confirmed Rodri's right knee ligament injury, sidelining the star midfielder for an extended period. The absence of the key player leaves Pep Guardiola rethinking his squad amidst a congested fixture schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-new-update-rishabh-pant-virat-kohli-rohit-sharma-2606252-2024-09-25",
      "headline": "ICC Test Rankings: Rishabh Pant re-enters list in 6th, Virat Kohli out of top 10Rishabh Pant has re-entered the ICC Test rankings in the 6th spot, while Virat Kohli went out of the top 10 following the latest update in the ICC Test rankings on September 25, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-poonam-yadav-backs-australia-india-to-reach-semis-from-group-a-2606237-2024-09-25",
      "headline": "T20 World Cup: Poonam Yadav backs Australia, India to reach semis from Group AIndia spinner Poonam Yadav believes that India and Australia will qualify for the semi-finals from Group A in the women's T20 World Cup 2024. Yadav said that Sri Lanka might pose a difficult challenge for India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-greatest-batter-even-if-he-does-not-go-past-sachin-tendulkar-ian-bell-2606223-2024-09-25",
      "headline": "Root is England's greatest batter even if he does not go past Sachin: Ian BellFormer England batter Ian Bell believes Joe Root will be remembered as England's greatest batter in Test cricket, regardless of whether he surpasses Sachin Tendulkar's record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-trolls-paris-olympics-medals-2606222-2024-09-25",
      "headline": "Manu Bhaker hits back at social media trolls: 'Wear my Olympic medals with pride'Olympian Manu Bhaker hit back at social media trolls who criticised her for showing off her medals in promotional events. Bhaker, in a scathing post, said that she wore the medals with pride and loved sharing her journey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-india-set-to-play-malaysia-in-november-in-international-friendly-2606215-2024-09-25",
      "headline": "Manolo Marquez' India set to play Malaysia in November in international friendlyIndia are all set to play Malaysia in an international friendly on November 19, 2024, the AIFF announced on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-coaching-staff-finland-open-2606211-2024-09-25",
      "headline": "After Anup Sridhar, PV Sindhu adds Korean Lee Hyun-il to coaching staffIndia's star shuttler PV Sindhu bolstered her coaching staff with South Korean legend Lee Hyun-il. Sindhu appointed the former player as the interim coach till December 2024.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-poonam-yadav-backs-australia-india-to-reach-semis-from-group-a-2606237-2024-09-25",
      "headline": "T20 World Cup: Poonam Yadav backs Australia, India to reach semis from Group AIndia spinner Poonam Yadav believes that India and Australia will qualify for the semi-finals from Group A in the women's T20 World Cup 2024. Yadav said that Sri Lanka might pose a difficult challenge for India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-greatest-batter-even-if-he-does-not-go-past-sachin-tendulkar-ian-bell-2606223-2024-09-25",
      "headline": "Root is England's greatest batter even if he does not go past Sachin: Ian BellFormer England batter Ian Bell believes Joe Root will be remembered as England's greatest batter in Test cricket, regardless of whether he surpasses Sachin Tendulkar's record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-trolls-paris-olympics-medals-2606222-2024-09-25",
      "headline": "Manu Bhaker hits back at social media trolls: 'Wear my Olympic medals with pride'Olympian Manu Bhaker hit back at social media trolls who criticised her for showing off her medals in promotional events. Bhaker, in a scathing post, said that she wore the medals with pride and loved sharing her journey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-india-set-to-play-malaysia-in-november-in-international-friendly-2606215-2024-09-25",
      "headline": "Manolo Marquez' India set to play Malaysia in November in international friendlyIndia are all set to play Malaysia in an international friendly on November 19, 2024, the AIFF announced on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-coaching-staff-finland-open-2606211-2024-09-25",
      "headline": "After Anup Sridhar, PV Sindhu adds Korean Lee Hyun-il to coaching staffIndia's star shuttler PV Sindhu bolstered her coaching staff with South Korean legend Lee Hyun-il. Sindhu appointed the former player as the interim coach till December 2024.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-hopes-davis-cup-will-not-be-rafael-nadal-last-dance-2606208-2024-09-25",
      "headline": "Carlos Alcaraz hopes Davis Cup will not be Rafael Nadal's 'last dance'Carlos Alcaraz has expressed his excitement about Rafael Nadal's return to Spain's Davis Cup squad for the upcoming quarter-finals in November. However, he hopes that this prestigious tournament will not mark the end of Nadal's illustrious career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/former-real-madrid-manchester-united-defender-raphael-varane-retires-2606191-2024-09-25",
      "headline": "Former Real Madrid, Manchester United defender Raphael Varane retiresFormer Real Madrid and Manchester United defender Raphael Varane has announced his retirement from football on September 25, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-2024-25-pat-cummins-returns-to-nets-video-2606161-2024-09-25",
      "headline": "Watch: Pat Cummins returns to nets ahead of Border Gavaskar TrophyAhead of the Border Gavaskar Trophy, Pat Cummins has stepped up his preparations by returning to the nets. Cummins has been on a break from national team duties after the T20 World Cup.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/andre-russell-t20-world-cup-retirement-2606120-2024-09-25",
      "headline": "'Fit' Andre Russell wants to play T20 World Cup 2026: 'Why should I stop?'Star West Indies all-rounder Andre Russell wants to continue till the T20 World Cup 2026. Speaking ahead of the series against Sri Lanka, Russell said that he has set a timeline for himself in the T20I format.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-3rd-odi-harry-brook-critics-maiden-hundred-durham-2606106-2024-09-25",
      "headline": "Harry Brook responds to 1st AUS ODI remarks critics: People took it a bit wrongEngland captain Harry Brook claimed that people took his comments after the 1st ODI a little bit wrong. Brook scored his maiden hundred on September 24 against Australia as England clawed their way back into the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-introduce-equal-pay-across-professional-domestic-cricket-from-2025-2606098-2024-09-25",
      "headline": "England's women domestic players to be granted basic salary equality from 2025England will offer equal starting salaries to men and women across professional domestic cricket from next year, the country's cricket board said on Tuesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-team-arrival-video-r-ashwin-yashasvi-jaiswal-2606083-2024-09-25",
      "headline": "'Ash anna' bullied, Yashasvi feels like Tendulkar as Team India reaches KanpurThe Indian team arrived in Kanpur in high spirits as the players were seen having some banter during their trip from Chennai. India will face Bangladesh in the second Test, starting from September 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-turns-down-kanpur-hotel-staff-handshake-2606052-2024-09-25",
      "headline": "Watch: Virat Kohli awkwardly turns down Kanpur hotel staff's handshakeVirat Kohli was forced to turn down Kanpur hotel staff's handshake upon his arrival ahead of the second Test against Bangladesh. The star Indian batter compensated with a \"Thank You\".\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-3rd-odi-harry-brook-critics-maiden-hundred-durham-2606106-2024-09-25",
      "headline": "Harry Brook responds to 1st AUS ODI remarks critics: People took it a bit wrongEngland captain Harry Brook claimed that people took his comments after the 1st ODI a little bit wrong. Brook scored his maiden hundred on September 24 against Australia as England clawed their way back into the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-introduce-equal-pay-across-professional-domestic-cricket-from-2025-2606098-2024-09-25",
      "headline": "England's women domestic players to be granted basic salary equality from 2025England will offer equal starting salaries to men and women across professional domestic cricket from next year, the country's cricket board said on Tuesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-team-arrival-video-r-ashwin-yashasvi-jaiswal-2606083-2024-09-25",
      "headline": "'Ash anna' bullied, Yashasvi feels like Tendulkar as Team India reaches KanpurThe Indian team arrived in Kanpur in high spirits as the players were seen having some banter during their trip from Chennai. India will face Bangladesh in the second Test, starting from September 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-turns-down-kanpur-hotel-staff-handshake-2606052-2024-09-25",
      "headline": "Watch: Virat Kohli awkwardly turns down Kanpur hotel staff's handshakeVirat Kohli was forced to turn down Kanpur hotel staff's handshake upon his arrival ahead of the second Test against Bangladesh. The star Indian batter compensated with a \"Thank You\".\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-2024-25-mumbai-city-fc-vikrampratap-singh-sandhu-exclusive-2606047-2024-09-25",
      "headline": "Learning at every step: Vikrampratap Singh on a mission to best himselfIndia and Mumbai City FC forward Vikrampratap Singh Sandhu is on a mission to better his previous season's achievements in the Indian Super League. Despite a challenging start for Mumbai City, the 22-year-old is determined to score more goals and assists to drive his team to victory once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gujarat-teenager-drona-desai-plays-marathon-498-run-knock-in-school-cricket-2606040-2024-09-25",
      "headline": "Gujarat teenager plays marathon 498-run knock in school cricketGujarat's Drona Desai made history by scoring 498 runs in an under-19 cricket match, joining an elite list of young cricketers. Drona ensured a dominant victory for St. Xavier's (Loyola) by an innings and 712 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-arjun-erigaisi-exclusive-world-ranking-viswanathan-anand-olympiad-gold-2606038-2024-09-25",
      "headline": "Olympiad gold or World No.3 ranking? Arjun Erigaisi reveals his favouriteArjun Erigaisi has revealed that he values the Chess Olympiad gold more than his new World ranking of No.3. Erigaisi got his new ranking after his splendid performance at the Chess Olympiad, where India won a double gold. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pacer-mark-wood-told-not-to-lift-kids-up-after-elbow-fracture-2606032-2024-09-25",
      "headline": "England's Mark Wood told not to lift kids up after elbow fractureEngland's fast bowler Mark Wood had been instructed to avoid using his right arm due to a stress injury in his elbow. The injury will keep him out for the remainder of 2024, affecting key tours and matches."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}