{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-bankim-brahmbhatt-indian-origin-ceo-blackrock-loan-fraud-united-states-2811790-2025-11-01",
      "headline": "The 'missing' Indian-origin CEO behind Rs 4,200 crore BlackRock loan fraudBankim Brahmbhatt, the Indian-origin CEO of a US-based telecom company, is facing a lawsuit in the US filed by HPS, the private credit investment arm of BlackRock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-shine-again-after-slow-start-will-they-continue-to-rise-2811504-2025-11-01",
      "headline": "Gold and silver shine again after slow start. Will they continue to rise?After a dull opening, both gold and silver managed to regain some shine during the day. Will the upward trend continue?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-links-anil-ambani-rana-kapoor-in-rs-2796-crore-yes-bank-loss-case-2811693-2025-11-01",
      "headline": "CBI links Anil Ambani, Rana Kapoor in Rs 2,796-crore Yes Bank loss caseThe CBI has accused industrialist Anil Ambani of approving favours to Yes Bank founder Rana Kapoor's family, causing huge financial losses to the bank. This development highlights alleged corruption and risky investments linked to Ambani's companies.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackrock-backed-lender-accuses-indian-origin-entrepreneur-of-500-million-fraud-report-2811490-2025-10-31",
      "headline": "BlackRock-backed firm accuses Indian-origin entrepreneur of $500 million fraudA US-based telecom entrepreneur of Indian origin, Bankim Brahmbhatt, has been accused of orchestrating a USD 500 million loan fraud involving BlackRock-backed lender HPS Investment Partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-466-points-nifty-below-25750-bel-jumps-4-2811380-2025-10-31",
      "headline": "Sensex, Nifty continue losing streak amid profit booking; BEL jumps 4%The S&P BSE Sensex closed 465.75 points lower at 83,938.71, while the NSE Nifty50 fell 155.75 points to 25,722.10. Selling pressure was broad-based, with most sectoral indices ending in the red."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-crosses-full-subscription-on-day-1-qibs-drive-demand-2811374-2025-10-31",
      "headline": "Lenskart IPO crosses full subscription on Day 1; QIBs drive demandThe IPO opened today and closes on November 4. Lenskart has set a price band of Rs 382 to Rs 402 per share, with a lot size of 37 shares for retail bidders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-leads-indias-crypto-investments-in-q3-2025-report-2811359-2025-10-31",
      "headline": "Gen Z leads India's crypto investments in Q3 2025: ReportThe 18–25 age group has officially overtaken the 26–35 bracket as the most active investors in crypto. For them, digital assets are no longer a risky experiment — they're becoming part of a serious investment plan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/from-groww-to-icici-amc-key-ipos-to-watch-this-november-2025-2811333-2025-10-31",
      "headline": "From Groww to ICICI AMC: Key IPOs to watch this November 2025Bengaluru-based investing platform Groww is set to launch its IPO worth Rs 6,632.3 crore. The issue includes a fresh issue of Rs 1,060 crore and an offer for sale of Rs 5,572.3 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/5x-income-rule-first-home-loan-affordability-2811330-2025-10-31",
      "headline": "Buying your first house? Check the 5x annual income rule and avoid EMI trapA rising number of first-time buyers are running the affordability math more cautiously. From the 5X income rule to avoiding EMI strain, housing decisions are shifting toward sustainability rather than stretch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hni-india-rebrands-as-kokuyo-workplace-india-targets-leadership-in-asia-by-2030-2811280-2025-10-31",
      "headline": "HNI India rebrands as Kokuyo Workplace India, targets leadership in Asia by 2030The rebranding marks a key step in Kokuyo's plan to make India a central hub for its Asia-Pacific operations. The move comes after Kokuyo's acquisition of HNI India earlier this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-employees-letter-salaries-unpaid-beer-cafe-investors-2811262-2025-10-31",
      "headline": "Employees unpaid, control slipping: Bira 91's bad hangoverThe taps are dry, employees unpaid, and investors have taken charge. The question isn't how Bira 91 got here anymore. It's whether it can get out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-loan-vs-gold-overdraft-which-one-truly-saves-you-money-2811260-2025-10-31",
      "headline": "Gold loan vs gold overdraft: Which one truly saves you money?Gold loans and gold overdrafts both help unlock the value of your jewellery when you need cash fast. But they don't work the same way — and one could quietly cost you more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-aadhaar-to-bank-rules-7-key-financial-changes-starting-november-1-2811219-2025-10-31",
      "headline": "From Aadhaar to bank rules: 7 key financial changes starting November 1As November begins, a fresh set of financial rules will come into effect that could impact your daily money matters. From Aadhaar updates and bank nomination changes to new GST slabs and card fees — here's a quick look at what's changing from November 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/air-india-seeks-rs-10000-crore-support-from-tata-singapore-airlines-after-crash-report-2811203-2025-10-31",
      "headline": "Air India seeks Rs 10,000 crore lifeline from Tata, SIA after crash: ReportThe request comes at a sensitive moment for the airline, which has been trying to rebuild its reputation, modernise its ageing fleet and streamline operations since being taken over by the Tata Group in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/meta-plans-record-30-billion-bond-sale-to-fund-costly-ai-push-2811194-2025-10-31",
      "headline": "Meta plans record $30 billion bond sale to stay ahead in AI rcaseThe move comes as Meta signals that its capital expenditure in 2026 will be \"notably larger\" than next year, underscoring how aggressively it is investing to stay ahead in the AI race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-ipo-2025-gmp-latest-price-band-and-should-you-apply-2811181-2025-10-31",
      "headline": "Lenskart IPO opens: Check GMP, price band, and should you apply?The total issue size is about Rs 7,278 crore, of which roughly Rs 2,150 crore is a fresh issue, while the rest is an offer for sale by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-future-outlook-precious-metals-volatility-rates-in-india-world-2811180-2025-10-31",
      "headline": "Gold prices shaky, silver steady. What next for precious metals?Gold is wobbling as the dollar strengthens, while silver holds firm on industrial demand cues. With central banks still buying and the Fed unpredictable, where do precious metals go next?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-flat-in-volatile-trade-ntpc-falls-over-25-2811165-2025-10-31",
      "headline": "Sensex, Nifty open flat in volatile trade; NTPC, Cipla among top losersAt around 9:24 am, the S&P BSE Sensex was up just 21.15 points at 84,425.61, while the NSE Nifty50 edged higher by 7.35 points to 25,885.20. Broader market indices also hovered marginally higher, mirroring the lack of conviction at the headline level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-remain-stable-will-prices-gain-after-us-fed-rate-cut-2810903-2025-10-31",
      "headline": "Gold and silver prices remain stable: Will prices gain after US Fed rate cut?Gold and silver prices steadied on Thursday after a choppy start, as investors weighed the impact of the US Federal Reserve's latest rate cut and awaited further clarity on global economic cues."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-reluctant-traveller-season-3-review-eugene-levy-proves-adventure-has-no-age-limit-2811865-2025-11-01",
      "headline": "The Reluctant Traveller S3 review: Eugene Levy charms with wit and wanderlustRelease Date:Fri Oct 31, 2025 Actor Eugene Levy embraces adventure in the third season of 'The Reluctant Traveller'. The series blends humour and heartfelt moments as Levy explores diverse cultures worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-begins-shooting-549th-film-with-sooraj-barjatya-2811825-2025-11-01",
      "headline": "Anupam Kher teams up with Sooraj Barjatya for his 549th film, watch video Veteran actor Anupam Kher begins work on his 549th film, teaming up once again with acclaimed filmmaker Sooraj Barjatya. The announcement signifies a major milestone in Kher's extensive cinematic career and his longstanding association with Barjatya and Rajshri Films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/taecyeon-marry-longtime-girlfriend-private-seoul-wedding-next-spring-2811802-2025-11-01",
      "headline": "2PM's Taecyeon announces wedding plans with longtime girlfriend Taecyeon, a member of the South Korean group 2PM, will marry his longtime partner in a private ceremony in Seoul next spring, according to his agency 51K. The announcement comes after the couple was seen together in Paris earlier this year and has opted for a ceremony attended only by close friends and family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tremembe-series-review-a-quiet-unsettling-look-inside-brazil-most-notorious-prison-2811747-2025-11-01",
      "headline": "Tremembe review: A quiet, unsettling look inside Brazil's most notorious prisonRelease Date:Fri Oct 31, 2025 'Tremembe' is a powerful Brazilian drama about life inside a high-security prison, showing what happens after the crimes are forgotten. With strong performances and realistic storytelling, it's a gripping watch about guilt, power, and survival."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-karur-stampede-responsibility-upcoming-film-adhik-ravichandran-2811795-2025-11-01",
      "headline": "Ajith Kumar reacts to Karur stampede, says society shares the blame Actor Ajith Kumar comments on the September Karur stampede, emphasising societal responsibility and addressing the culture of gatherings. He also discusses upcoming projects with director Adhik Ravichandran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/diljit-dosanjh-supports-punjab-flood-victims-kaun-banega-crorepati-17-2811786-2025-11-01",
      "headline": "KBC 17: Can you answer the question that stumped Diljit Dosanjh? Singer Diljit Dosanjh impresses on 'Kaun Banega Crorepati 17', securing Rs 50 lakh for Punjab flood victims and responding thoughtfully to questions from host Amitabh Bachchan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-truth-bomb-on-bollywood-burnout-reignites-talk-on-fairer-shifts-2811607-2025-11-01",
      "headline": "Deepika Padukone's 8-hour stand: Can Bollywood agree on an ideal work culture? Deepika Padukone's call for an 8-hour workday has sparked a conversation. But can an industry obsessed with success arrive at a consensus over work ethics?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-bigha-zameen-balraj-sahni-journey-from-privilege-to-the-heart-of-india-struggle-2811761-2025-11-01",
      "headline": "Do Bigha Zameen: Balraj Sahni's journey from privilege to the heart of India's struggle Bimal Roy's 'Do Bigha Zameen' (1953) redefined Indian cinema, transforming Balraj Sahni into the voice of India's struggling poor — a timeless story of dignity, loss and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-revives-iconic-rk-studios-to-preserve-family-legacy-and-boost-mumbai-film-industry-2811739-2025-11-01",
      "headline": "Ranbir Kapoor to relaunch RK Studios with his directorial debut: Report Bollywood actor Ranbir Kapoor is preparing to relaunch the historic RK Studios, with plans for his directorial debut and collaborations involving top industry figures. The move marks a continuation of his family's cinematic legacy and aims to re-establish RK Studios as a creative force in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-directorial-debut-the-bads-of-bollywood-features-rajat-bedi-star-studded-cast-netflix-2811731-2025-11-01",
      "headline": "Farah Khan says Aryan Khan was obsessed with Rajat Bedi since childhood Farah Khan has spoken about Aryan Khan's decision to include Rajat Bedi in his first web series as a director, highlighting the personal connection and professional opportunity involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mass-jathara-review-old-formula-fresh-energy-and-ravi-teja-back-in-rhythm-2811684-2025-11-01",
      "headline": "Mass Jathara review: Old formula, fresh energy, and Ravi Teja back in rhythmRelease Date:Sat Nov 01, 2025 'Mass Jathara' isn't trying to fix the mass commercial template, it's embracing it. Ravi Teja headlines a celebration of entertainment and nostalgia where every whistle, punchline, and throwback moment feels intentional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-security-assessed-khalistani-threats-diljit-dosanjh-kaun-banega-crorepati-2811719-2025-11-01",
      "headline": "Central agencies assess threat to Amitabh Bachchan post Diljit meeting Agencies are evaluating security for Amitabh Bachchan following threats from Sikh separatist groups after his televised interaction with Diljit Dosanjh, as concerns rise over the safety of both public figures and upcoming events abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-stars-ambani-jamnagar-halloween-party-creative-costumes-2811713-2025-11-01",
      "headline": "Halloween 2025: Alia and Deepika unite as Nita Ambani channels Audrey Hepburn Bollywood stars marked Halloween 2025 with an elaborate celebration in Jamnagar, featuring high-profile guests and creative costumes. Notable appearances included Alia Bhatt as Lara Croft, Deepika Padukone as Lady Singham, and Nita Ambani as Audrey Hepburn, with fans and celebrities alike praising the standout looks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-epic-remastered-women-architects-kingdom-fate-ss-rajamouli-prabhas-anushka-shetty-ramya-krishnan-2811433-2025-11-01",
      "headline": "Baahubali The Epic is much more than tale of two brothers, it has women at its core SS Rajamouli's 'Baahubali: The Epic', though it is centred on Prabhas and Rana Daggubati, it is the women in their lives who call the shots. With the re-mastered film hitting the screens on October 31, the film yet again places focus on the women of Mahishmati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-celebrates-thamma-success-kids-are-my-best-critics-rashmika-mandanna-2811669-2025-10-31",
      "headline": "Ayushmann Khurrana celebrates Thamma's success: Kids are my best critics In an exclusive interaction with India Today, actor Ayushman Khurrana spoke about how his latest release 'Thamma' won the hearts of his children and became their favourite. The film also starring Rashmika Mandanna, released in theatres on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-malik-lashes-out-malti-chahar-after-she-calls-him-gutter-2811667-2025-10-31",
      "headline": "BB 19 Episode 69: Amaal Malik lashes out at Malti after she calls him gutter In the latest episode of 'Bigg Boss 19', Amaal Malik locks horns with Malti Chahar after she called him a gutter. On the other hand, Pranit More was declared the new captain of the house.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-nayanika-seal-their-love-in-a-dreamy-elegant-engagement-ceremony-allu-arjun-2811653-2025-10-31",
      "headline": "Allu Sirish and Nayanika's engagement is all about love, grace and family warmth Actor Allu Sirish shared pictures from his dreamy engagement with Nayanika. The event was attended by close friends and family members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-hand-that-rocks-the-cradle-maika-monroe-mary-elizabeth-winstead-on-chemistry-and-boundaries-2811624-2025-10-31",
      "headline": "The Hand That...: Maika Monroe, Mary Elizabeth Winstead on chemistry and boundaries In an exclusive interaction with India Today, 'The Hand That Rocks the Cradle' actors Maika Monroe and Mary Elizabeth Winstead spoke about their camaraderie and dynamics in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-indian-film-television-directors-association-condemns-mumbai-hostage-crisis-denies-rohit-arya-industry-link-2811599-2025-10-31",
      "headline": "Film and TV body condemns Mumbai hostage crisis, denies Rohit Arya's industry link The Indian Film & Television Directors' Association (IFTDA) issued a statement and denied Rohit Arya's links in the entertainment industry. The body stated that Arya is not affiliated with any recognised and registered body. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/venkateswara-swamy-temple-stampede-andhra-pradesh-reactions-opposition-chandrababu-naidu-2811815-2025-11-01",
      "headline": "Private temple, no police intimation: Andhra CM orders probe after stampede kills 10Andhra Pradesh Chief Minister expressed deep sorrow over the tragic incident that claimed ten lives at the Venkateswara Swamy Temple on Saturday morning. He said that the event organisers did not inform authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-hostage-crisis-rohit-arya-controversial-past-rent-dispute-erratic-behaviour-2811721-2025-11-01",
      "headline": "Skeletons tumble out: Mumbai hostage-taker's rental dispute, erratic behaviourRohit Arya, who held 17 children hostage at a Powai studio in Mumbai, has a controversial past. The 38-year-old was shot dead by police during the rescue operation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jd-vance-erika-kirk-viral-intimate-hug-usha-vance-divorce-speculation-theories-2811844-2025-11-01",
      "headline": "See similarities of husband in JD: Erika Kirk's mushy hug with Vance sparks buzzWhat turned heads at the Turning Point USA event was the intimate hug between JD Vance and Erika Kirk, the widow of Trump aide Charlie Kirk, and her glowing words for the vice president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/india-rohan-bopanna-retirement-professional-tennis-2811849-2025-11-01",
      "headline": "Goodbye, but not the end: Rohan Bopanna, 2-time Grand Slam champion, retiresIndian tennis icon Rohan Bopanna has officially announced his retirement from professional tennis, bringing to a close a remarkable career that spanned over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/when-delaying-divorce-becomes-a-strategy-for-the-childs-education-2811339-2025-11-01",
      "headline": "When delaying divorce becomes a 'strategy' for the child's educationParents often make an unspoken pact: hold on until the child finishes Class 10 or 12.  On paper, it sounds noble and selfless - but children still sense the emotional shutdown at home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/9-dead-in-stampede-at-kashibugga-venkateswara-swamy-temple-in-andhra-pradeshs-srikakulam-2811800-2025-11-01",
      "headline": "10 killed in stampede at Venkateswara Swamy Temple in Andhra PradeshTen people died in a stampede at Sri Venkateswara Swamy Temple in Andhra Pradesh during the Ekadashi rush. Disturbing footage from the temple showed extreme overcrowding, with hundreds of women holding puja baskets jostling on a staircase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/english-hindi-weakening-childrens-talent-siddaramaiah-amid-language-row-2811858-2025-11-01",
      "headline": "English, Hindi weakening children's talent: Siddaramaiah amid language rowKarnataka Chief Minister Siddaramaiah warned that the growing dominance of English and Hindi in education is eroding children's natural creativity and disconnecting them from their roots."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/what-triggered-deadly-stampede-at-andhras-venkateswara-swamy-temple-that-killed-9-2811803-2025-11-01",
      "headline": "What triggered stampede at Andhra's Venkateswara Swamy Temple? Glaring lapses exposedThe stampede occurred as a large crowd gathered at the temple on the occasion of Ekadashi, Andhra Chief Minister's Office said in a statement. Overcrowding because of the heavy rush led to the tragic incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-usha-vance-conversion-remark-row-hindu-american-foundation-2811843-2025-11-01",
      "headline": "Why not engage with Hinduism too? Hindu body jabs Vance over wife's faith remarkThe Hindu American Foundation criticised Vice President JD Vance's remarks on his wife Usha Vance's faith, urging him to respect the rights of Hindus to practice. JD Vance had hoped that his wife would convert to Christianity one day, sparking a huge backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/vreels-a-game-changing-platform-pushing-social-media-beyond-tiktok-and-instagram-2811738-2025-11-01",
      "headline": "Vreels: A Game-Changing Platform Pushing Social Media Beyond TikTok and InstagramVreels isn't just about sharing, it's about connecting meaningfully. Through built-in chat, voice, and video call features, users can communicate without leaving the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's ticketsWomen's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-candidates-assets-criminal-records-voter-choices-2811774-2025-11-01",
      "headline": "Bihar's bahubalis and crorepatis in spotlight for battle for powerThe affidavit disclosures by strongmans and crorepatis for the upcoming Bihar Assembly polls reveal the continued dominance of candidates with significant wealth, muscle power and criminal backgrounds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/do-bigha-zameen-balraj-sahni-journey-from-privilege-to-the-heart-of-india-struggle-2811761-2025-11-01",
      "headline": "Do Bigha Zameen: Balraj Sahni's journey from privilege to the heart of India's struggleBimal Roy's 'Do Bigha Zameen' (1953) redefined Indian cinema, transforming Balraj Sahni into the voice of India's struggling poor — a timeless story of dignity, loss and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-cleared-delhi-cloud-seeding-plan-after-experts-said-not-feasible-2811675-2025-11-01",
      "headline": "Who cleared a Rs 34-crore cloud seeding plan after experts said 'not feasible'?Three expert agencies advised against it. Delhi did it anyway, spending Rs 34 crore of public money on a winter cloud seeding experiment that produced no rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-praveen-khandelwal-urges-centre-to-rename-capital-as-indraprastha-2811827-2025-11-01",
      "headline": "Return Delhi to its roots: BJP MP urges Centre to rename capital as IndraprasthaBJP MP Praveen Khandelwal has proposed renaming Delhi to Indraprastha, connecting the capital to its ancient Mahabharata-era roots. This move aims to revive India's cultural heritage and boost tourism while honouring the city's historical significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-air-pollution-biggest-killer-deaths-data-air-quality-2811822-2025-11-01",
      "headline": "Toxic air Delhi's biggest killer: 1 in 7 deaths linked to pollution in 2023Deaths due to particulate matter pollution have remained persistently high in Delhi, more often than not exceeding those caused by hypertension or diabetes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-truth-bomb-on-bollywood-burnout-reignites-talk-on-fairer-shifts-2811607-2025-11-01",
      "headline": "Deepika Padukone's 8-hour stand: Can Bollywood agree on an ideal work culture?Deepika Padukone's call for an 8-hour workday has sparked a conversation. But can an industry obsessed with success arrive at a consensus over work ethics?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-538-01-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/how-to-get-a-google-internship-eligibility-process-tips-2811578-2025-11-01",
      "headline": "How to land a Google internship: What recruiters want you to knowHere's a practical guide to landing a Google internship, from resumes to interviews, timelines, eligibility, and myths, all based on guidance from Google's hiring team, FAQs, and official student resources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/south-delhi-luxury-property-rise-colonial-planning-elite-zones-2811394-2025-11-01",
      "headline": "I am from South Delhi – why is the south side of every city posh?South side neighbourhoods in major Indian metros have long been associated with wealth and prestige. This status stems from deliberate colonial planning and continues to influence property values and urban identity today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/why-were-always-chasing-one-instagram-trend-after-another-and-the-hidden-cost-behind-it-2810717-2025-11-01",
      "headline": "Why we're always chasing one trend after another (and the hidden cost behind it)Are you always looking for a new trend to follow? Does it leave you feeling exhausted? Constantly chasing the 'next big thing' can take a toll on your mental health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/why-lawrence-bishnoi-gang-upping-the-ante-canada-surrey-shooting-businessman-punjabi-singer-india-kapil-sharma-2810673-2025-11-01",
      "headline": "Why Bishnoi Gang is upping the ante in Canada?Even though Lawrence Bishnoi is in a jail in India, his gang has gone berserk in Canada. From shootings at Kapil Sharma's Kap's Cafe and a Punjabi singer's residence to killing an Indian-origin businessman, the Bishnoi Gang is asserting its deadly presence in Canada. But what's behind its latest spree of violence in Canada?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-bankim-brahmbhatt-indian-origin-ceo-blackrock-loan-fraud-united-states-2811790-2025-11-01",
      "headline": "The 'missing' Indian-origin CEO behind Rs 4,200 crore BlackRock loan fraudBankim Brahmbhatt, the Indian-origin CEO of a US-based telecom company, is facing a lawsuit in the US filed by HPS, the private credit investment arm of BlackRock."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pained-pm-condoles-andhra-stampede-announces-rs-2-lakh-aid-for-victims-families-as-deaths-rise-to-10-2811842-2025-11-01",
      "headline": "Pained by tragedy: PM condoles Andhra stampede deaths, announces financial aidPrime Minister Narendra Modi and other leaders expressed deep sorrow over the tragic stampede at Sri Venkateswara Swamy Temple in Srikakulam, which claimed ten lives and injured many. Immediate relief and financial assistance have been announced for the victims amid ongoing rescue efforts."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-whitewash-england-3-0-odi-series-top-order-struggles-ashes-2811875-2025-11-01",
      "headline": "England's ODI slide continues as New Zealand seal 3-0 series sweep New Zealand skittled England's top order on their way to a nervy two-wicket win in the third one-day international in Wellington, completing a 3-0 series sweep and sending the tourists to Australia with serious questions over their batting form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-team-historic-icc-womens-world-cup-2025-title-record-prize-money-2811851-2025-11-01",
      "headline": "Women's World Cup Prize Money: How much money will winners and runners-up earn? The ICC Women's Cricket World Cup 2025 final brings unprecedented prize money, awarding Rs 37.3 crore to the winners and Rs 18.6 crore to the runners-up as part of a landmark pay parity initiative. This record payout marks a major step towards gender equality in cricket and surpasses the prize pools of previous men's and women's tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/india-rohan-bopanna-retirement-professional-tennis-2811849-2025-11-01",
      "headline": "Goodbye, but not the end: Rohan Bopanna, 2-time Grand Slam champion, retires Indian tennis icon Rohan Bopanna has officially announced his retirement from professional tennis, bringing to a close a remarkable career that spanned over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-aaron-praises-benching-jemimah-rodrigues-for-fiery-world-cup-innings-2811834-2025-11-01",
      "headline": "Dropping Jemimah Rodrigues against England was a great move: Former India pacer Former India fast bowler Varun Aaron has praised the team management's decision to bench Jemimah Rodrigues during the World Cup group stage. This move ignited Jemimah's aggression and focus, leading to her match-winning century against Australia that helped India chase a historic total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-jasprit-bumrah-2nd-t20i-robin-uthappa-mcg-2811809-2025-11-01",
      "headline": "Jasprit Bumrah is wayward when desperate for wickets: Uthappa after MCG T20I Former India batter Robin Uthappa made an interesting observation about Jasprit Bumrah, suggesting that the pacer tends to lose his rhythm when he tries too hard to take wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-surpasses-rohit-sharma-top-t20i-run-scorer-2811789-2025-11-01",
      "headline": "Babar surpasses Rohit, scripts history on T20I comeback vs South Africa Pakistan batter Babar Azam etched his name in the history books by surpassing Rohit Sharma and becoming the highest run scorer in the history of T20Is. He achieved the feat during the 2nd T20I against South Africa in Lahore as Pakistan levelled the series with a nine-wicket victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-icc-womens-cricket-world-cup-2025-final-ind-vs-sa-india-weakness-2811773-2025-11-01",
      "headline": "Into the final, but flaws remain: India must peak in the World Cup showdown Women's World Cup 2025: Team India is just one step away from attaining the glory that has evaded them in their entire cricketing history. As they prepare to take on South Africa in the final, India need to ensure that they fix the chinks in the armour to turn the World Cup dream into a reality on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's tickets Women's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-discharged-from-hospital-2811748-2025-11-01",
      "headline": "Shreyas Iyer discharged from Sydney hospital. Here's when he can fly home India batter Shreyas Iyer has been discharged from Sydney hospital on Saturday, November 1, the BCCI has informed. Iyer had undergone a minor procedure after bruising his spleen during the 3rd ODI match against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-abhishek-sharma-harshit-rana-2811740-2025-11-01",
      "headline": "Pathan calls for better game awareness after Abhishek Sharma after big blunder Abhishek Sharma was the lone fighter in India's 2nd T20I match against Australia in Melbourne. Irfan Pathan, however, was not happy with the batter's game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/saishiva-sankaran-indian-f4-racing-f1-dreams-max-verstappen-2811595-2025-11-01",
      "headline": "Max Verstappen fan Saishiva Sankaran hoping to race alongside idol in F1 A young star in the making, Saishiva Sankaran shares his ultimate dream of making to Formula One and racing alongside his idol Max Verstappen. Saishiva has been making a splash in Indian Racing League with the Speed Demons Delhi team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-icc-womens-cricket-world-cup-2025-final-ind-vs-sa-india-weakness-2811773-2025-11-01",
      "headline": "Into the final, but flaws remain: India must peak in the World Cup showdown Women's World Cup 2025: Team India is just one step away from attaining the glory that has evaded them in their entire cricketing history. As they prepare to take on South Africa in the final, India need to ensure that they fix the chinks in the armour to turn the World Cup dream into a reality on home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-final-tickets-where-to-buy-2811765-2025-11-01",
      "headline": "Where are the tickets? Fans hit out at BCCI over final's tickets Women's World Cup: The India vs South Africa final is on Sunday, November 2. However, the tickets for the match were closed off. Frustrated fans have hit out at the BCCI over logistical issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-injury-update-discharged-from-hospital-2811748-2025-11-01",
      "headline": "Shreyas Iyer discharged from Sydney hospital. Here's when he can fly home India batter Shreyas Iyer has been discharged from Sydney hospital on Saturday, November 1, the BCCI has informed. Iyer had undergone a minor procedure after bruising his spleen during the 3rd ODI match against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-abhishek-sharma-harshit-rana-2811740-2025-11-01",
      "headline": "Pathan calls for better game awareness after Abhishek Sharma after big blunder Abhishek Sharma was the lone fighter in India's 2nd T20I match against Australia in Melbourne. Irfan Pathan, however, was not happy with the batter's game awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/saishiva-sankaran-indian-f4-racing-f1-dreams-max-verstappen-2811595-2025-11-01",
      "headline": "Max Verstappen fan Saishiva Sankaran hoping to race alongside idol in F1 A young star in the making, Saishiva Sankaran shares his ultimate dream of making to Formula One and racing alongside his idol Max Verstappen. Saishiva has been making a splash in Indian Racing League with the Speed Demons Delhi team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-fracture-comeback-india-vs-south-africa-2811717-2025-11-01",
      "headline": "I am fully recovered: Rishabh Pant gives green signal for Test returnIndia wicketkeeper batter Rishabh Pant has given a green signal for his return to Test cricket. Pant said that he has fully recovered from his frustrating foot injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-world-cup-final-2811695-2025-11-01",
      "headline": "Turning trolls into believers: Indian women's team makes people dream againBattling trolls and persistent questions about pay parity with the men's team, Harmanpreet Kaur and her players have transformed scepticism into belief. Anchored by composure and quiet resilience, they now stand on the brink of rewriting Indian cricket's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-t20i-lahore-saim-ayub-faheem-ashaf-salman-mirza-level-series-2811673-2025-10-31",
      "headline": "PAK vs SA: Saim Ayub, Faheem Ashraf star as Pakistan crush South Africa in 2nd T20IPakistan bounced back in style as Salman Mirza and Faheem Ashraf destroyed South Africa's batting before Saim Ayub's fluent fifty sealed a nine-wicket win, setting up a thrilling series decider in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and moreThe 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal differenceEast Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20IAfghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-womens-test-matches-multi-day-domestic-games-devajit-saikia-2811660-2025-10-31",
      "headline": "BCCI committed to increasing women's Test matches and multi-day domestic gamesBCCI secretary Devajit Saikia reaffirmed the board's commitment to expanding women's red-ball cricket, hinting at more Test matches and multi-day domestic tournaments as the next step in developing the game across all levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/saturday-nights-main-event-2025-match-card-cm-punk-vs-jey-uso-cody-rhodes-vs-drew-mcintyre-where-to-watch-2811705-2025-11-01-2811670-2025-10-31",
      "headline": "WWE Saturday Night's Main Event: Matchcard, livestreaming details and moreThe 41st edition of Saturday Night's Main Event is all set to emanate from the Delta Center in Salt Lake City, Utah, USA with four major titles being defended at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-super-cup-east-bengal-goalless-draw-mohun-bagan-semifinal-2811662-2025-10-31",
      "headline": "AIFF Super Cup: East Bengal hold Mohun Bagan to reach semifinals on goal differenceEast Bengal produced a disciplined defensive show to hold Mohun Bagan goalless and secure a semifinal spot in the AIFF Super Cup on goal difference, as Oscar Bruzon's men stood tall under late pressure in a tense Kolkata derby."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-dominate-zimbabwe-second-t20i-seal-series-2-0-2811659-2025-10-31",
      "headline": "ZIM vs AFG: Afghanistan seal series with seven-wicket in second T20IAfghanistan secured the T20I series against Zimbabwe with a comprehensive seven-wicket victory in Harare, chasing down 126 with two overs to spare. Rashid Khan was the star of the show with the ball as Afghanistan continued to impress in the format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-womens-test-matches-multi-day-domestic-games-devajit-saikia-2811660-2025-10-31",
      "headline": "BCCI committed to increasing women's Test matches and multi-day domestic gamesBCCI secretary Devajit Saikia reaffirmed the board's commitment to expanding women's red-ball cricket, hinting at more Test matches and multi-day domestic tournaments as the next step in developing the game across all levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-wi-3rd-t20i-romario-shepherd-hat-trick-roston-chase-west-indies-3-0-sweep-2811658-2025-10-31",
      "headline": "Romario Shepherd hat-trick, Roston Chase heroics guide West Indies to 3-0 sweepWest Indies wrapped up a 3-0 T20 series sweep over Bangladesh as Roston Chase and Ackeem Auguste hit rapid fifties, and Romario Shepherd claimed a stunning hat-trick to cap off a dominant display in the series finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/dabang-delhi-kc-clinches-pro-kabaddi-league-season-12-title-historic-home-victory-2811654-2025-10-31",
      "headline": "Dabang Delhi claim PKL season 12 title with thrilling win over Puneri PaltanDabang Delhi K.C. clinched their second PKL title with a 31–28 win against Puneri Paltan in the Season 12 Final at Thyagaraj Indoor Stadium, Delhi. Delhi became the first home team since 2015 to win the Pro Kabaddi League in their own city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-womens-world-cup-final-ticket-update-dy-patil-stadium-2811649-2025-10-31",
      "headline": "Historic Women's World Cup final looms, but tickets still not on sale in Navi MumbaiTwo days before India and South Africa meet in the Women's World Cup final, ticket sales have yet to be opened, leaving eager fans refreshing browsers and wondering when they'll finally get the chance to be part of history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-south-africa-a-rishabh-pant-bat-flop-prenelan-subrayen-2811619-2025-10-31",
      "headline": "Rishabh Pant fails with bat on comeback, Test stars flop in BengaluruRishabh Pant made his return to competitive cricket with a disappointing outing for India A against South Africa in the first practice match in Bengaluru. Devdutt Padikkal and Sai Sudharsan also failed to make an impact as India were bowled out for 234, conceding a 75-run first-innings lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-2025-india-viswanathan-anand-trophy-indian-grandmasters-2811610-2025-10-31",
      "headline": "Viswanathan Anand Trophy: FIDE World Chess Cup named after Indian greatThe FIDE World Chess Cup trophy, named the Viswanathan Anand Trophy, celebrates India's first Grandmaster, honouring his enduring legacy and the nation's rise as a global chess powerhouse. The World Cup will be held in Panjim from October 31 to November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-shubman-gill-t20i-consistency-yashasvi-jaiswal-bench-2811608-2025-10-31",
      "headline": "Gill needs to perform with Jaiswal being left on bench: Irfan PathanIrfan Pathan said that Shubman Gill will need to start to score consistently in T20Is as he is keeping Yashasvi Jaiswal waiting in the bench for his chance. Gill was dismissed for 5 runs in the Melbourne T20I against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2nd-t20i-ashwin-gambhir-arshdeep-team-selection-controversy-2811606-2025-10-31",
      "headline": "Can't understand how Arshdeep misses out: Ashwin rips into Gambhir for MCG blunderRavichandran Ashwin has criticised Gautam Gambhir and the Indian team management for repeatedly benching Arshdeep Singh despite his stellar record. Ashwin insists Arshdeep deserves a permanent spot, calling him India's best T20 bowler after Jasprit Bumrah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-south-africa-2nd-t20i-ball-by-ball-commentary-babar-azam-lahore-2811592-2025-10-31",
      "headline": "Pakistan vs South Africa, 2nd T20I Highlights from LahorePakistan put up a comprehensive display with the ball to down South Africa for a small target. Saim Ayub led their charge to ensure that they complete the chase without any hiccups. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}