{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/artificial-intelligence-ai-stocks-mutual-fund-investments-investor-portfolio-impact-2868166-2026-02-14",
      "headline": "Will AI change how you invest your money in stocks and mutual funds?The next market shift may not come from earnings or interest rates. It may come from AI. In this article, we explore how it could reshape your stock and mutual fund investments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/eroded-public-trust-dgca-fines-air-india-rs-1-crore-for-flying-airbus-8-times-without-airworthiness-permit-2867894-2026-02-13",
      "headline": "Air India fined Rs 1 crore for flying Airbus 8 times without airworthiness permitThe DGCA has imposed a fine of about Rs 1 crore on Air India for flying an Airbus aircraft eight times without a valid airworthiness permit. The aviation watchdog also said the lapse further eroded public trust in the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-personalised-loans-are-becoming-the-go-to-option-in-2026-2867857-2026-02-13",
      "headline": "Why personalised loans are becoming the go-to option in 2026The journey of hyper-personalisation in personal loans is going to get more exciting for customers with the increasing adoption of technology refining customer offerings, based on minute details of the customers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-update-kisan-credit-card-rules-5-key-changes-to-track-2867809-2026-02-13",
      "headline": "RBI plans to update Kisan Credit Card rules : 5 key changes to trackThe Reserve Bank of India is preparing to overhaul the Kisan Credit Card scheme, and the proposed changes could reshape how farmers borrow and repay loans. With the new draft rules on the table, what exactly is set to change for farm credit?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-1048-points-lower-nifty-below-2550-it-metal-stocks-sink-2867763-2026-02-13",
      "headline": "Sensex crashes over 1,000 points: What's behind today's market bloodbath?The market opened on a weak note and remained under pressure throughout the session, with losses deepening in the second half. The decline appeared to be driven by profit booking at elevated levels and a cautious mood among investors amid global uncertainties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-us-licence-venezuela-oil-trump-trade-deal-india-russia-2867738-2026-02-13",
      "headline": "Reliance wins US licence for Venezuelan oil as India wavers on Russia supplyReliance applied for the licence in early January as India looks to diversify its energy purchases. Direct purchase of Venezuelan oil will help Reliance replace Russian oil in a cost-effective way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cheque-bounced-how-one-mistake-can-spiral-into-legal-and-financial-trouble-2867714-2026-02-13",
      "headline": "Cheque bounced? How one mistake can spiral into legal and financial troubleA bounced cheque may seem like a minor slip, but it can quickly trigger penalties, credit damage and even legal complications. What starts as a simple payment error can snowball into a serious financial setback. Are you aware of the risks?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-government-seeks-public-feedback-who-can-participate-2867699-2026-02-13",
      "headline": "8th Pay Commission: Government seeks public feedback; who can participateThe recommendations of the 8th Pay Commission are expected to influence future salary structures, allowances and pension benefits for central government staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-prices-rise-slightly-rise-ahead-or-fall-on-the-cards-2867664-2026-02-13",
      "headline": "Gold, silver prices rise slightly: Rise ahead or fall on the cards?After days of volatility, gold and silver have posted modest gains, catching the attention of investors. The small rise has reopened a familiar debate, i.e., are precious metals preparing for another climb, or is a fresh dip still possible?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-plans-to-stop-insurance-mis-selling-draft-proposal-is-it-enough-2867655-2026-02-13",
      "headline": "RBI steps in to stop mis-selling by banks: Decoding what's good and what's not clearThe Reserve Bank of India has signalled its intent after years of rising mis-selling complaints. But will this draft protect ordinary customers before the next grievance is filed? In this article, we break down what changes, what remains unclear, and whether enforcement can finally make a difference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/65-10-10-15-rule-how-a-4-asset-boring-thali-portfolio-helps-in-uncertain-markets-edelweiss-radhika-gupta-2867642-2026-02-13",
      "headline": "65-10-10-15 rule: How a 4-asset 'boring thali' portfolio helps in uncertain marketsWhen markets feel uncertain and investors struggle to decide where to put their money, a simple multi-asset strategy is drawing attention. Instead of chasing trends, the 65-10-10-15 \"boring thali\" approach focusses on balance and steady investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-price-correction-explained-what-investors-should-do-buy-sell-2867601-2026-02-13",
      "headline": "Is it the end of the road for silver after a spectacular rally?After a stunning rally and an equally sharp fall, silver now sits at a crucial crossroads, leaving investors wondering whether this correction is nearing its end or still gathering momentum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-crash-sensex-down-over-800-points-nifty-tumbles-ai-panic-hits-it-stocks-on-dalal-street-2867567-2026-02-13",
      "headline": "Sensex crashes over 1,000 points: Why is the stock market falling today?At 3:16 pm, the Sensex was down 1055.91 points to 82,619.01, while the Nifty stood at 25,481.35, lower by 325.85 points. The fall was led by heavy selling in IT stocks, but the triggers lie largely in global developments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tcs-infosys-tech-mahindra-wipro-3-reasons-why-it-stocks-are-falling-2867565-2026-02-13",
      "headline": "TCS, Infosys sink nearly 6%: 3 reasons why IT stocks are falling againShares of TCS and Infosys fell nearly 6% in early trade, dragging the Nifty IT index lower. The weakness was not driven by any one company-specific announcement. Instead, it reflects a mix of global triggers and rising uncertainty around how artificial intelligence will reshape the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-sinks-over-700-points-nifty-below-25600-as-infosys-tcs-and-other-it-stocks-crash-2867559-2026-02-13",
      "headline": "Sensex drops 700 points as AI panic hits IT stocks; Infosys, TCS drop 5%The Sensex fell over 700 points in early trade, while the Nifty slipped below the 25,600 mark. The decline was led by frontline technology majors such as Infosys and TCS, along with other large-cap IT names."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-275-in-january-under-new-cpi-base-year-2024-2867214-2026-02-12",
      "headline": "Retail inflation at 2.75% in January as India shifts to new CPI base year 2024The data, released by the Ministry of Statistics and Programme Implementation, reflects a major statistical overhaul aimed at making India's inflation measure more representative of current consumption patterns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-mis-selling-india-90-year-old-man-sold-policy-maturing-in-20124-systemic-gaps-fraud-2867205-2026-02-12",
      "headline": "A 90-year-old man was sold a 100-year policy. Why blaming the bank is not enoughHandcrafted ByOur Editors A 90-year-old man was sold an insurance policy maturing in 2124. The case sounds bizarre. But instances of mis-selling like this are painfully common across the country. The bank resolved the matter after a viral social media post. The harder question is why blaming the bank alone is not enough."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-sinks-over-500-points-nifty-tumbles-as-ai-panic-sinks-it-stocks-2867194-2026-02-12",
      "headline": "Sensex sinks over 500 points, Nifty tumbles as AI panic sinks IT stocksThe benchmark BSE Sensex fell 559 points to close at 85,674.92, while the Nifty 50 slipped below the psychologically important 25,900 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-air-india-write-to-government-over-cabin-crew-fatigue-rules-fia-letter-dgca-2867151-2026-02-12",
      "headline": "Aviation body writes to government as it bids to tighten cabin crew fatigue ruleThe Federation of Indian Airlines (FIA) has asked the government to dilute parts of the draft rules. The industry body represents IndiGo and Air India, and has raised concerns that the changes may create operational and cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-infosys-wipro-it-stocks-crack-under-global-ai-pressure-nifty-it-falls-buying-chance-2867130-2026-02-12",
      "headline": "IT stocks crack under global AI pressure. Is this a buying chance?The Nifty IT index fell 4.67% by 12 PM, hitting a four-month low. The selloff wiped out nearly Rs 1.3 lakh crore in combined market value in a single session. The IT pack on the Sensex was also down nearly 5%. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/wuthering-heights-o-romeo-culpa-trilogy-is-yearning-gen-zs-new-love-language-2868179-2026-02-14",
      "headline": "Wuthering Heights, O Romeo, Culpa trilogy: Is yearning Gen Z's new love language? In a fast-moving world, romance is slowing down. Stories across films, series and books now lean into yearning, a shift that's resonating strongly with Millennials and Gen Z in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-in-legal-row-over-shelved-film-faces-rs-20-crore-claim-report-2868146-2026-02-14",
      "headline": "Dhanush in legal row over shelved film, faces Rs 20 crore claim: Report Legal disputes involving Dhanush and Ranveer Singh have emerged over unfinished film projects, with production houses seeking compensation for alleged delays and financial losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jason-momoa-says-gentleman-shah-rukh-khan-is-a-better-performer-than-him-2868117-2026-02-14",
      "headline": "Jason Momoa says gentleman Shah Rukh Khan is a better performer than him Jason Momoa shared high praise for Shah Rukh Khan during a recent interview, highlighting their mutual respect and friendship after meeting at events in Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/o-romeo-box-office-day-1-shahid-kapoors-best-opening-in-years-2868106-2026-02-14",
      "headline": "O' Romeo box office Day 1: Shahid Kapoor's best opening in recent years Directed by Vishal Bhardwaj, O' Romeo opened to a promising start at the Indian box office, drawing audience interest despite mixed reviews over its lengthy runtime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/at-a-crossroads-telugu-cinema-must-balance-old-school-magic-with-new-age-demands-2867094-2026-02-14",
      "headline": "At a crossroads: Telugu cinema must balance old-school magic with new-age demands Telugu cinema stands at the crossroads of tradition and change. Even as it reaches for pan-India scale, its heartbeat lies in the rituals and emotional bonds that have always connected it to its audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-yaa-main-box-office-day-1-shanaya-kapoor-adarsh-gourav-thriller-has-a-muted-opening-2868102-2026-02-14",
      "headline": "Tu Yaa Main box office Day 1: Shanaya-Adarsh's thriller has a muted opening Tu Yaa Main, a survival thriller featuring Shanaya Kapoor and Adarsh Gourav, made a cautious start at the Indian box office with an estimated Rs 55 lakh on its opening day. Despite mixed reviews and modest occupancy, the film's unique premise and stronger opening compared to the leads' previous films offer hope for better performance ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mona-singh-kohrra-season-2-sub-inspector-dhanwant-kaur-powerful-performance-2867803-2026-02-14",
      "headline": "Kohrra 2 finds its emotional core in Mona Singh Mona Singh delivers a restrained and powerful performance as Sub Inspector Dhanwant Kaur in Kohrra Season 2. Her portrayal highlights the silent grief and fierce dedication of a woman balancing personal loss with professional duty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/police-record-ranveer-singh-rohit-shetty-managers-statement-recreate-crime-scene-2868048-2026-02-13",
      "headline": "Police record Ranveer Singh, Rohit Shetty managers' statement, recreate crime scene Mumbai Police recorded statements from the managers of filmmaker Rohit Shetty and actor Ranveer Singh. The Crime Branch has also recreated the firing sequence at Shetty's residence by retracing the accused's scooter route from Pune to Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/barun-sobti-jaideep-ahlawat-abhishek-banerjee-team-up-for-sudip-sharma-netflix-series-report-2868031-2026-02-13",
      "headline": "Barun Sobti, Jaideep Ahlawat, Abhishek Banerjee in Kohrra creator's next: Report Actors Barun Sobti, Jaideep Ahlawat and Abhishek Banerjee will reportedly headline Sudip Sharma's upcoming Netflix series. Here's everything you need to know about the upcoming project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-art-of-sarah-review-shin-hye-sun-lee-jun-hyuk-kdrama-netflix-2868029-2026-02-13",
      "headline": "The Art of Sarah review: Shin Hye-sun holds together a glossy illusionRelease Date:Fri Feb 13, 2026 The Art of Sarah is a stylish and thought-provoking thriller that delves into themes of ambition and identity in contemporary society. This Netflix series captivates with its compelling lead and visually rich storytelling despite some narrative flaws. Read full review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lewis-hamilton-refuses-to-discuss-kim-kardashian-after-super-bowl-appearance-2868016-2026-02-13",
      "headline": "It's my private life, snubs Lewis Hamilton when asked about Kim Kardashian: Report Lewis Hamilton responded to questions about his public outing with Kim Kardashian at Super Bowl LX. The high-profile appearance fuelled widespread speculation about the nature of their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-producer-promises-global-spectacle-on-par-with-hollywood-for-ranbirs-film-2867930-2026-02-13",
      "headline": "Ramayana producer promises global spectacle on par with Hollywood for Ranbir's film Producer Namit Malhotra has promised that his upcoming film Ramayana will be a global spectacle on par with Hollywood's biggest achievements. The movie features Ranbir Kapoor and Sai Pallavi in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dont-be-shy-human-x-gumiho-to-maxton-hall-s3-prime-videos-2026-full-slate-out-2867992-2026-02-13",
      "headline": "Don't Be Shy, Human X Gumiho to Maxton Hall S3: Prime Video's 2026 full slate out From Maxton Hall Season 3 to Don't Be Shy, Prime Video's 2026 slate for international content is out. Korean shows include Siren's Kiss, Human X Gumiho among others, while Japanese anime also paves way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/son-of-legendary-ramanand-sagar-anand-sagar-chopra-dies-last-rites-in-mumbai-2867989-2026-02-13",
      "headline": "Son of legendary Ramanand Sagar, Anand Sagar Chopra dies; last rites in Mumbai Anand Ramanand Sagar Chopra, co-producer of the iconic 1987 television series, Ramayan, died in Mumbai on February 13, 2026. He was the son of legendary filmmaker Ramanand Sagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stop-defaming-palaash-muchhal-bombay-high-court-to-smriti-mandhana-friend-vidnyan-mane-2867987-2026-02-13",
      "headline": "Stop defaming Palaash Muchhal: Bombay High Court to Smriti Mandhana's friend The Bombay High Court has restrained filmmaker Vidnyan Mane from making defamatory statements against singer-composer Palaash Muchhal and his mother. The order follows a commercial dispute and controversial interviews after a called-off wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shatak-trailer-ajay-devgn-opens-up-on-being-the-narrator-calls-it-an-honour-2867964-2026-02-13",
      "headline": "Shatak trailer out: Ajay Devgn opens up on being the narrator, calls it an honour Ajay Devgn discussed his involvement as narrator for Shatak, a documentary highlighting the century-long journey of the Rashtriya Swayamsevak Sangh (RSS). He reflected on the organisation's legacy ahead of the film's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-retires-playback-singing-releases-devotional-shiva-bhajan-2867965-2026-02-13",
      "headline": "Good news Arijit Singh fans: Singer is already back with devotional track. Watch Arijit Singh, following his announcement to retire from playback singing, has released a new devotional song titled Shiva Bhajan as an independent musician. The singer did not promote the track on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rodolphe-manoukian-arijit-singh-kolkata-humility-cross-cultural-music-2867931-2026-02-13",
      "headline": "Lebanese artiste Rodolphe Manoukian shares how Arijit redefined success for him Lebanese percussionist Rodolphe Manoukian, known for his viral darbuka rendition of Mundian To Bach Ke, met Arijit Singh following his Kolkata show. Manoukian shared a heartfelt note and praised Singh's talent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhumi-pednekar-talks-about-the-lady-killer-box-office-failure-calls-it-a-mess-2867948-2026-02-13",
      "headline": "Bhumi Pednekar talks about The Lady Killer box office failure, calls it a mess Bhumi Pednekar revealed that The Lady Killer was released as an incomplete film, with nearly 35  never shot, making it one of the most difficult phases of her career."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-makes-historic-touchdown-on-assams-first-emergency-landing-highway-to-witness-aerial-display-2868141-2026-02-14",
      "headline": "PM Modi makes historic touchdown on Assam's first emergency landing highwayPrime Minister Narendra Modi landed at the Northeast's first Emergency Landing Facility in Assam's Moran to inaugurate the strip and launch projects worth over Rs 5,500 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-student-karnataka-saketh-sreenivasaiah-goes-missing-in-united-states-uc-california-berkeley-last-seen-lake-anza-consulate-general-search-operations-2868103-2026-02-14",
      "headline": "22-year-old Indian student from Karnataka missing in US, roommate seeks helpSaketh Sreenivasaiah, 22, from Karnataka is pursuing a master's in Chemical and Biomolecular Engineering at the University of California, Berkeley. His roommate posted on LinkedIn, asking for help to locate Sreenivasaiah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-national-nikhil-gupta-khalistani-terrorist-gurpatwant-pannun-murder-plot-guilty-2868162-2026-02-14",
      "headline": "Biden hosted PM Modi for dinner in 2023. Later came to know of Pannun plotUS prosecutors claimed the alleged plot to assassinate Khalistani terrorist Gurpatwant Singh Pannun in June 2023 coincided with PM Modi's state visit to the US at the invitation of President Joe Biden. However, the US has said there was no proof that PM Modi knew about the plot. India has also denied any role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/show-that-pm-cares-congress-books-pms-flight-ticket-from-assam-to-manipur-2868144-2026-02-14",
      "headline": "Show that PM CARES: Congress books PM's flight ticket from Assam to ManipurCongress leader Pawan Khera has urged Prime Minister Narendra Modi to visit violence-hit Manipur during his North-East trip, highlighting the ongoing unrest since 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/the-biography-of-a-toilet-paper-how-pakistan-became-america-disposable-ally-khawaja-asif-2867910-2026-02-14",
      "headline": "The Biography of a Toilet Paper: How Pakistan became America's Disposable AllyFor seven decades, Pakistan has repeatedly offered itself as America's strategic pawn, only to be discarded when no longer useful. It is a pattern of servitude enabled through its own desperation and greed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-kolkata-shillong-flight-bomb-threat-on-slip-plane-grounded-security-check-2868186-2026-02-14",
      "headline": "Crew on Kolkata-Shillong IndiGo flight finds bomb threat on slip, plane groundedAn IndiGo flight (6E 7304) from Kolkata to Shillong was moved to an isolation bay and evacuated after a bomb threat note was found onboard. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/accused-nikhil-gupta-pleads-guilty-of-orchestrating-failed-assassination-plot-against-sikh-terrorist-pannun-2868036-2026-02-13",
      "headline": "Indian national pleads guilty in foiled murder plot against Khalistani terroristNikhil Gupta allegedly contacted an individual he believed to be a criminal associate to arrange the killing of Gurpatwant Singh Pannun for USD 100,000. But, the individual was, in fact, a confidential source with the US authorities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-arshdeep-singh-rahman-dakait-dance-t20-world-cup-colombo-2868099-2026-02-14",
      "headline": "Arshdeep Singh's Rahman Dakait moment before India vs Pakistan clash in ColomboArshdeep Singh channelled his inner Rahman Dakait as India received a special welcome in Colombo on Friday, Febraury 13 ahead of their clash against Pakistan in the T20 World Cup 2026. India will face Pakistan on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-anna-arch-arrival-of-the-alliterative-architect-part-24-349-13-02-2026",
      "headline": "Time, Tide & Tamil Part 24 | Anna Arch: Arrival of The Alliterative ArchitectConjeevaram Natarajan Annadurai – Anna to the masses – was born into a modest weaver family from the Sengunthar Mudaliar community, an environment where the rhythmic, hypnotic clatter of the handloom provided the background score to a life of early intellectual curiosity. The loom itself was a profound metaphor for his later life: Perfecting the art of weaving disparate, often contradictory threads of thought into a singular, durable fabric of social justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-skinny-pen-tsunami-india-on-the-verge-of-a-weight-loss-free-for-all-2867757-2026-02-14",
      "headline": "The skinny-pen tsunami: India on the verge of a weight-loss free-for-allAn India Today investigation into lax enforcement of drug norms that make accessing prescription-only medicines easy, and rising misuse of weight-loss drugs in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/online-betting-fraud-busted-noida-six-arrested-phone-linked-delhi-school-threats-cyber-case-2868105-2026-02-14",
      "headline": "Betting gang busted in Noida, seized phone has links to Delhi school threat mailsAfter arresting six members of an interstate online betting fraud gang, Noida Police recovered a mobile phone containing threatening emails sent to Delhi schools. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-news-elections-bnp-jamaat-candidates-death-sentences-babar-pinto-atm-india-terror-plots-2867985-2026-02-13",
      "headline": "Hangman's noose to Parliament: 2 with anti-India terror links win Bangladesh pollsThree candidates who had been sentenced to death are among the winners of the Bangladesh national election held on February 12. Two of the three, both BNP members, faced the gallows for a plot to supply arms to anti-India insurgents and blasts in India. The third, a Jamaat-e-Islami candidate, faced war crime charges. They were all released by courts as an interim regime led by Muhammad Yunus governed Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/at-a-crossroads-telugu-cinema-must-balance-old-school-magic-with-new-age-demands-2867094-2026-02-14",
      "headline": "At a crossroads: Telugu cinema must balance old-school magic with new-age demandsTelugu cinema stands at the crossroads of tradition and change. Even as it reaches for pan-India scale, its heartbeat lies in the rituals and emotional bonds that have always connected it to its audience."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/haryana/story/anil-vij-haryana-minister-shouts-woman-ips-officer-kaithal-suspend-assistant-sub-inspector-refuses-orders-viral-video-bjp-leader-2868137-2026-02-14",
      "headline": "Haryana mein mera chalta hai: Anil Vij to woman IPS officer over cop's suspensionHaryana Minister engaged in a tense exchange with a woman IPS officer on Friday after she refused to follow his orders to suspend an assistant sub-inspector in a land-related case. A video of the exchange between them went viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-parliament-budget-session-naravane-book-epstein-files-2868107-2026-02-14",
      "headline": "Rahul Gandhi's combative style stole the show in Parliament. What next?In the first half of the Parliament Budget session, Rahul Gandhi appeared politically energised and intent on sustaining pressure on the Modi government, especially over national security. Will he be able to keep the momentum? What are his plans for the second half of the session?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/indore/story/indore-naked-body-mba-student-obscene-video-boyfriend-missing-police-prime-suspect-2868066-2026-02-13",
      "headline": "Obscene video, missing boyfriend, naked body: MBA student's murder rattles IndoreA 24-year-old MBA student was found dead in a rented room in Indore, with police investigating allegations of the victim suffering from depression and being blackmailed allegedly by her boyfriend, who is missing and the prime suspect in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/the-railway-menu-of-the-1990s-will-surprise-you-2867127-2026-02-12",
      "headline": "The Indian Railways menu of the 1990s will surprise youThe Railways offered a diverse menu in the 1990s, ranging from vegetarian dishes to biryani. It had it all. Chai was served in traditional glass tumblers, and cutlets were especially popular among passengers. So what did the menu actually look like? Take a look. For many, it remains a journey of nostalgia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/valentine-s-day/story/is-valentines-day-still-relevant-for-gen-z-2867875-2026-02-14",
      "headline": "Millennials loved it, Gen Z doesn't: Is the Valentine's Day hype over?I was puzzled about why older people made such a fuss over Valentine's Day. But after talking to friends across generations, I realised why it once mattered, and why many of us now barely feel the pull."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/very-bad-day-for-iran-trump-sends-second-us-carrier-to-middle-east-2868072-2026-02-14",
      "headline": "Trump says Iran regime change best thing as second carrier heads to Middle EastDonald Trump signaled tougher US posture toward Iran, highlighting decades of hostility and military losses as Washington strengthens its naval presence in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stop-defaming-palaash-muchhal-bombay-high-court-to-smriti-mandhana-friend-vidnyan-mane-2867987-2026-02-13",
      "headline": "Stop defaming Palaash Muchhal: Bombay High Court to Smriti Mandhana's friendThe Bombay High Court has restrained filmmaker Vidnyan Mane from making defamatory statements against singer-composer Palaash Muchhal and his mother. The order follows a commercial dispute and controversial interviews after a called-off wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/artemis-missions/story/nasa-artemis-2-moon-mission-launch-delay-sls-rocket-news-2868177-2026-02-14",
      "headline": "More trouble for Artemis-II rocket, Moon launch likely delayed againNasa has confirmed that the Artemis II Moon mission launch is now eyeing March 2026 following fuel system issues. Engineers are currently reviewing data from a recent confidence test at the Kennedy Space Center."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-mayor-ritu-tawde-vows-crackdown-on-illegal-hawkers-orders-birth-certificates-checks-2868011-2026-02-13",
      "headline": "Mumbai Mayor vows crackdown on illegal hawkers, orders birth certificates' checksMumbai Mayor Ritu Tawde has announced a comprehensive verification of birth certificates for all hawkers on the city's footpaths, targeting illegal Bangladeshi nationals and addressing security concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/valentines-day-science-behind-love-romance-chemistry-dopamine-brain-pulses-2867972-2026-02-14",
      "headline": "Love is magical, but it's also chemical. Read the science behind itWhen you start liking someone, your brain's reward system switches on. Suddenly, that person seems more interesting than anything else, sometimes even more interesting than food or sleep. This Valentine's Day, we breakdown  the simple science behind it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-india-pakistan-t20-world-cup-match-colombo-weather-2867997-2026-02-13",
      "headline": "Rain threat in IND vs PAK? Sri Lanka issue weather warning for February 15 clashT20 World Cup, IND vs PAK: Rain could disrupt the India-Pakistan T20 World Cup clash on February 15 in Colombo. Both teams have begun their campaigns with two wins each and will aim to bolster their Super 8 qualification hopes.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sturla-holm-laegreid-wins-bronze-mens-sprint-cheating-controversy-winter-olympics-2868175-2026-02-14",
      "headline": "After cheating admission, Norwegian biathlete Laegreid faces fresh Olympic storm Following his cheating admission, Sturla Holm Laegreid has got himself embroiled in a fresh controversy after winning a second individual bronze medal during the Winter Olympics 2026 on Friday, February 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/anil-kumble-rahul-dravid-karnataka-cricket-board-thank-you-chinnaswamy-stadium-stand-2868167-2026-02-14",
      "headline": "Anil Kumble, Rahul Dravid thank Karnataka board for special Chinnaswamy honour Former India duo Rahul Dravid and Anil Kumble expressed heartfelt gratitude to the Karnataka State Cricket Association after being honoured with stands named after them at the iconic M Chinnaswamy Stadium. The tribute marked a special moment for Bengaluru's cricketing legends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-m-chinnaswamy-stadium-stand-honour-emotional-speech-anil-kumble-ksca-2868155-2026-02-14",
      "headline": "Watch: Rahul Dravid emotional as The Wall gets a stand at Chinnaswamy Stadium Rahul Dravid turned emotional as the KSCA named a Chinnaswamy Stadium stand after him in Bengaluru. The former India great called the venue his second home during a heartfelt thank-you speech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-new-tattoo-girlfriend-mahieka-sharma-india-vs-pakistan-2868133-2026-02-14",
      "headline": "Hardik's Valentine's Day gift to girlfriend Mahieka Sharma: A special tattoo Ahead of Valentine's Day, Hardik Pandya unveiled a new tattoo for his girlfriend, Mahieka Sharma. Hardik and Mahieka have been dating since 2025 and the Indian all-rounder got the tattoo as a symbol of their love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-week-wrap-thomas-frank-sacked-tottenham-michael-carrick-manchester-united-2868123-2026-02-14",
      "headline": "Premier League: Frank sacked at Spurs as Carrick lifts United and chaos spreads Tottenham's decision to sack Thomas Frank has been linked to dressing-room unrest, with players reportedly frustrated by his constant praise of Arsenal. The Premier League week also saw Michael Carrick's United bounce back and injury woes deepen for Liverpool."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-india-vs-pakistan-pressure-formula-t20-world-cup-2026-colombo-2868111-2026-02-14",
      "headline": "Babar Azam's formula to tackle India vs Pakistan pressure: Look straight ahead T20 World Cup: Babar Azam revealed his formula to tackle the pressure associated with an India vs Pakistan match ahead of their clash in the T20 World Cup on Sunday, February 15. Babar will be one of the key players for Pakistan during the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-pakistan-abhishek-sharma-parents-reach-colombo-fitness-uncertain-2868110-2026-02-14",
      "headline": "Abhishek Sharma's parents reach Colombo while IND vs PAK availability still uncertain T20 World Cup: Abhishek Sharma's parents have arrived in Colombo as India await his fitness update ahead of the India vs Pakistan clash on February 15. The opener is recovering from a stomach infection, with his availability still uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-arshdeep-singh-rahman-dakait-dance-t20-world-cup-colombo-2868099-2026-02-14",
      "headline": "Arshdeep Singh's Rahman Dakait moment before India vs Pakistan clash in Colombo Arshdeep Singh channelled his inner Rahman Dakait as India received a special welcome in Colombo on Friday, Febraury 13 ahead of their clash against Pakistan in the T20 World Cup 2026. India will face Pakistan on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-class-10-board-exams-u19-world-cup-final-century-2868098-2026-02-14",
      "headline": "U19 World Cup done, Vaibhav Sooryavanshi's next test is Class 10 board exams T20 World Cup: India's 14-year-old U19 World Cup hero Vaibhav Sooryavanshi is set to return to student life as he prepares for his Class 10 board exams. His school confirmed no special treatment despite his record-breaking final knock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-pakistan-r-premadasa-stadium-colombo-performance-record-2868086-2026-02-14",
      "headline": "Dominating the Premadasa: India's T20I history in Colombo before India vs Pakistan T20 World Cup, IND vs PAK: Suryakumar Yadav's India will aim to extend their impressive record at the R Premadasa Stadium in Colombo when they take on Salman Agha's Pakistan on Sunday in a crucial Group A clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-will-beat-pakistan-play-safe-vs-usman-tariq-ind-vs-pak-harbhajan-singh-2868080-2026-02-14",
      "headline": "India will win vs Pakistan, just play safe against Usman Tariq: Harbhajan SinghT20 World Cup: Harbhajan Singh has backed India to beat Pakistan in their February 15 T20 World Cup clash, but warned them to play mystery spinner Usman Tariq with caution. Tariq's rise has made him Pakistan's key threat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ireland-oman-england-scotland-new-zealand-south-africa-preview-2867806-2026-02-14",
      "headline": "Matchday Preview: South Africa, New Zealand look to strengthen Super 8 chancesDay 8 of the T20 World Cup features three high-stakes clashes, with Ireland vs Oman a virtual knockout, England seeking redemption against Scotland, and New Zealand meeting South Africa in a crucial battle for Super 8 qualification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-india-vs-pakistan-sunil-gavaskar-exclusive-2868064-2026-02-13",
      "headline": "India must settle top-order doubts to beat Pakistan: Sunil GavaskarT20 World Cup: Legendary India batter Sunil Gavaskar said the Indian team was aware of the areas they need to improve, pointing out that the top order remains a slight concern ahead of the high-octane clash against Pakistan in the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ksca-honours-anil-kumble-rahul-dravid-shantha-rangaswamy-chinnaswamy-stands-2868056-2026-02-13",
      "headline": "Karnataka Cricket honours Anil Kumble and Rahul Dravid with stands at ChinnaswamyThe KSCA has honoured Anil Kumble, Rahul Dravid and Shantha Rangaswamy by naming stands after them at Bengaluru's M Chinnaswamy Stadium, recognising their immense contributions to Karnataka and Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-pak-sunil-gavaskar-reaction-usman-tariq-bowling-action-2868052-2026-02-13",
      "headline": "Legal? Sure. Lethal? Not really. Gavaskar reacts to Usman Tariq bowling action buzzFormer India captain Sunil Gavaskar played down the threat posed by Pakistan spinner Usman Tariq, saying Indian batters are unlikely to face major trouble against the mystery spinner in their ICC Men's T20 World Cup group clash in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sourav-ganguly-on-india-vs-pakistan-usman-tariq-t20-world-cup-2026-2868047-2026-02-13",
      "headline": "Happy to see IND, PAK playing, sports and politics should be separate: GangulyT20 World Cup 2026: Former India captain Sourav Ganguly has said that he's delighted to see India and Pakistan playing against each other in the T20 World Cup 2026. He also urged to keep sports and politics separate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/icc-t20-world-cup-colombo-greets-team-india-with-dance-and-drums-before-pakistan-clash-2868043-2026-02-13",
      "headline": "Colombo greets Team India with dance and drums before Pakistan blockbuster. VideoICC T20 World Cup: Colombo rolled out a vibrant welcome for Team India on Friday evening as the squad arrived in Sri Lanka's capital ahead of their high-voltage T20 World Cup clash against Pakistan national cricket team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaron-finch-on-india-manage-abhishek-sharma-fitness-t20-world-cup-india-vs-pakistan-2868037-2026-02-13",
      "headline": "India mustn't rush Abhishek Sharma vs Pakistan: Aaron FinchFormer Australia captain Aaron Finch has advised India to be cautious with Abhishek Sharma's fitness ahead of their T20 World Cup clash against Pakistan. The decision to rest Sharma could impact India's strategy in the crucial Super 8s phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usa-beats-netherlands-super-8-hopes-harmeet-singh-chennai-2868026-2026-02-13",
      "headline": "USA refuse to give up on Super 8 hopes with historic win over NetherlandsT20 World Cup, USA vs NED: The United States of America (USA) defeated the Netherlands by 93 runs in a Group A clash to keep their Super 8 qualification hopes alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-stanzin-lundup-104th-mens-10km-freestyle-cross-country-skiing-winter-olympics-2868022-2026-02-13",
      "headline": "India's Stanzin Lundup finishes 104th in men's 10km cross-country skiingIndia's Stanzin Lundup finished 104th in the men's 10km freestyle cross-country skiing event at the Milano Cortina Winter Olympics on Friday, ending near the bottom of the standings in a fiercely competitive field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-sanju-samson-abhishek-sharma-india-vs-pakistan-t20-world-cup-2026-2868017-2026-02-13",
      "headline": "Sanju Samson deserves long rope, no one can perform under such pressure: GangulyFormer India captain Sourav Ganguly has urged Team India to give Sanju Samson more chances despite his poor recent form. Samson is in line to play in the upcoming fixture against Pakistan, with doubts still lingering over Abhishek Sharma's match fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-versus-scotland-t20-world-cup-match-preview-2867988-2026-02-13",
      "headline": "England aim to spoil Scotland's upset dream as they seek redemption in Kolkata clashT20 World Cup, ENG vs SCO: Phil Salt said that England will be looking to bring out their best version in a game where Scotland will be looking to pull off an upset at the Eden Gardens in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-paksunil-gavaskar-on-arshdeep-singh-washington-sundar-2867995-2026-02-13",
      "headline": "India should drop Arshdeep and bring in Washington Sundar vs Pakistan: GavaskarICC T20 World Cup: Sunil Gavaskar has suggested that India consider bringing Washington Sundar into the XI for the crucial India-Pakistan clash in Colombo. Sundar is yet to feature in the tournament, with the team opting for Varun Chakravarthy and Axar Patel as their two frontline spinners so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-india-pakistan-t20-world-cup-match-colombo-weather-2867997-2026-02-13",
      "headline": "Rain threat in IND vs PAK? Sri Lanka issue weather warning for February 15 clashT20 World Cup, IND vs PAK: Rain could disrupt the India-Pakistan T20 World Cup clash on February 15 in Colombo. Both teams have begun their campaigns with two wins each and will aim to bolster their Super 8 qualification hopes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-australia-colombo-spin-india-vs-pakistan-2867979-2026-02-13",
      "headline": "Sikandar Raza sounds Colombo warning ahead of IND vs PAK: Do not aim for 200IND vs PAK, T20 World Cup: Zimbabwe caused a massive upset against Australia at the R Premadasa Stadium on February 13. Speaking after the game, Raza laid out the gameplan on how to succeed in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-uae-beat-canada-aryansh-sharma-sohaib-khan-junaid-siddique-2867949-2026-02-13",
      "headline": "Aryansh Sharma, Sohaib Khan guide UAE to 5-wicket win vs CanadaUAE secured their second-ever T20 World Cup win by defeating Canada by five wickets in Delhi. Junaid Siddique's five-wicket haul and Aryansh Sharma and Sohaib Khan's partnership guided their team to a comfortable win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/josh-hazlewood-matt-renshaw-australia-vs-zimbabwe-t20-world-cup-2867958-2026-02-13",
      "headline": "Are Australia missing Josh Hazlewood? Matt Renshaw opens up after Zimbabwe defeatT20 World Cup, AUS vs ZIM: Matt Renshaw opened up on whether Australia are missing Josh Hazlewood in their campaign. On Friday, the Aussies slumped to a 23-run defeat to Zimbabwe at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-usa-vs-netherlands-live-score-today-match-update-chennai-2867885-2026-02-13",
      "headline": "USA vs Netherlands Highlights: USA hammer Netherlands in ChennaiUnited States of America (USA) vs Netherlands (NED) Highlights, T20 World Cup: The USA produced a spirited all-round performance to hammer the Netherlands by 93 runs in Chennai, keeping their campaign alive in the ongoing ICC tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-marcus-stoinis-injury-loss-zimbabwe-2867866-2026-02-13",
      "headline": "After Zimbabwe shocker, Australia dented with fresh injury concernT20 World Cup, AUS vs ZIM: Marcus Stoinis sustained a hand injury against Zimbabwe while attempting to stop a ball off his own bowling. He was unable to complete his third over and later came out to bat at No. 7 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-beating-australia-guarantee-indias-t20-world-cup-2026-win-2867833-2026-02-13",
      "headline": "Zimbabwe beating AUS guarantee India's World Cup win? Here's what history saysZimbabwe secured a historic victory over Australia in the T20 World Cup 2026. This win raises hopes for India's success in the ongoing tournament, given their historic record."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}