{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-at-india-today-business-roundtable-ytvd-2677235-2025-02-09",
      "headline": "Union Minister Piyush Goyal addresses trade strategy at business eventCommerce Minister Piyush Goyal discusses India's trade strategy, highlighting key areas like immigration and trade laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-meets-rbi-board-discusses-economic-growth-ytvd-2677191-2025-02-09",
      "headline": "Finance minister discusses economic growth with RBI directorsUnion Finance Minister Sitharaman met with RBI to discuss measures boosting economic growth through fiscal policies and a policy rate cut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-asmita-patel-the-she-wolf-of-the-stock-market-under-sebis-scanner-2677157-2025-02-09",
      "headline": "Who is Asmita Patel, the 'she-wolf of stock market' under Sebi scanner?Sebi has directed Patel, her firm Asmita Patel Global School of Trading Pvt Ltd (APGSOT), and several affiliated entities to return over Rs 53 crore collected as course fees. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-finance-minister-nirmala-sitharaman-introduce-new-income-tax-bill-lok-sabha-union-budget-2676893-2025-02-08",
      "headline": "Hope to introduce new income tax bill in Lok Sabha next week: Nirmala SitharamanAfter introduction in the Upper House, the bill, which was approved by the Union Cabinet chaired by PM Modi, will be sent to a parliamentary standing committee for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-mark-zuckerberg-internal-memo-reveals-job-cuts-lowest-performers-starting-next-week-layoffs-2676644-2025-02-08",
      "headline": "Meta plans to lay off 'lowest performance' staff next week, internal memo revealsNotices will go out to employees losing their jobs starting at 5 am local time on Monday in most countries, including in the US, according to one of the posts, authored by Meta's Head of People Janelle Gale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-income-tax-bill-approved-cabinet-likely-tabled-lok-sabha-monday-sources-2676509-2025-02-07",
      "headline": "Cabinet clears new income tax bill, likely to be tabled in Lok Sabha Monday: SourcesThe new legislation, which is often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-things-about-mohini-mohan-dutta-the-man-named-in-ratan-tata-will-2676438-2025-02-07",
      "headline": "5 things about Mohini Mohan Dutta: The man named in Ratan Tata's willWhile most anticipated that Ratan Tata's wealth would go towards philanthropy, family members, and other charitable causes, Mohini Mohan Dutta's mention in his will has surprised many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-clarifies-forceful-layoffs-freshers-get-3-attempts-to-clear-assessment-2676443-2025-02-07",
      "headline": "Infosys clarifies 'forceful' layoffs: Freshers get 3 attempts to clear assessmentInfosys said freshers undergo foundational training at its Mysuru campus and must pass an internal assessment to continue working."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-forcefully-lays-off-700-trainees-in-mysuru-report-2676257-2025-02-07",
      "headline": "Infosys 'forcefully' lays off 700 trainees in Mysuru: ReportMost of the affected recruits were from the engineering batch of 2022, who were onboarded after a wait of about 2.25 years, said sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-after-volatile-session-fmcg-energy-drag-rbi-mpc-2676251-2025-02-07",
      "headline": "Sensex, Nifty end lower after volatile session; FMCG, energy drag marketThe S&P BSE Sensex fell by 197.97 points to end at 77,860.19, while the NSE Nifty50 declined by 43.40 points to close at 23,559.95. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-after-rbi-mpc-announcement-625-percent-why-is-stock-market-falling-today-2676229-2025-02-07",
      "headline": "Sensex tanks 500 points after RBI MPC: Why is stock market falling todayThe S&P BSE Sensex was down by 539.72 points to 77,516.79, while the NSE Nifty50 declined by 147.50 points to 23,455.60 as of 2:43 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/activate-uan-to-avail-epfo-eli-scheme-benefits-before-february-15-check-details-2676213-2025-02-07",
      "headline": "Activate UAN to avail EPFO's ELI scheme benefits before February 15. Check detailsEPFO ELI: UAN or Universal Account Number is a unique 12-digit number allotted by EPFO which is necessary for managing provident fund accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-mohini-mohan-dutta-rs-500-crore-surprise-in-ratan-tata-will-2676202-2025-02-07",
      "headline": "Who is Mohini Mohan Dutta? Rs 500 crore surprise in Ratan Tata's willRatan Tata also left behind a share for his siblings, his butler Subbiah and German Shepherd Tito have also been provided for in his will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-introduces-bankin-domain-for-indian-banks-to-tackle-financial-fraud-2676141-2025-02-07",
      "headline": "RBI introduces 'bank.in' domain for Indian banks to tackle financial fraudThe move aims to tackle growing financial fraud and cybercrime, prevent malicious activities, and strengthen the country's financial ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-6-key-takeaways-from-mpc-announcement-gdp-growth-inflation-outlook-cheaper-home-loans-women-empowerment-2676118-2025-02-07",
      "headline": "RBI cuts key lending rate after 5 years: 6 takeaways from the announcementThe central bank has announced a reduction in the repo rate by 25 basis points for the first time in nearly five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/after-5-years-rbi-cut-key-lending-rate-by-25-basis-points-to-625-2676083-2025-02-07",
      "headline": "After 5 years, RBI cut key lending rate by 25 basis points to 6.25%This marks the first rate cut since 2020 and the first policy decision under Governor Malhotra's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-home-loans-to-get-cheaper-as-rbi-cuts-rates-25-basis-points-625-percent-check-details-2676080-2025-02-07",
      "headline": "Home loans to get cheaper as RBI cuts rates. Check detailsThe RBI MPC reduced key lending rates by 25 basis points to 6.25%, the first rate cut in nearly five years under the leadership of newly appointed RBI Governor Sanjay Malhotra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-rate-interest-repo-cut-25-basis-points-625-per-cent-first-time-since-2020-2676071-2025-02-07",
      "headline": "RBI reduces key lending rate by 25 basis points to 6.25%The rate cut announced by the committee is the first since 2020. This was also the first policy meeting of Sanjay Malhotra as RBI Governor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-markets-opening-sensex-nifty-flat-as-investors-await-rbi-policy-decision-itc-down-2-percent-2676061-2025-02-07",
      "headline": "Stock markets open flat as investors await RBI policy decision; ITC down 2%The S&P BSE Sensex was down by 23.98 points to 78,034.18, while the NSE Nifty50 lost 7 points to 23,596.35 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-clarifies-he-had-permission-to-busk-in-bengaluru-2677246-2025-02-09",
      "headline": "Ed Sheeran clarifies he had permission 'to busk' in Bengaluru: It wasn't randomBritish singer Ed Sheeran has shared a short statement about his street performance in Bengaluru ahead of his concert tonight in the city. The artiste shared that he had permission to perform, contrary to the reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/harrdy-sandhu-detained-by-chandigarh-police-2677169-2025-02-09",
      "headline": "Punjabi actor-singer Harrdy Sandhu briefly detained over gig permit in ChandigarhSinger Harrdy Sandhu was detained in Chandigarh on Saturday for performing live without permission. He was later released after organisers provided documents. However, the incident left the Punjabi singer upset as he didn't perform after being released. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheerans-church-street-performance-in-bengaluru-halted-by-police-2677155-2025-02-09",
      "headline": "Ed Sheeran's street performance in Bengaluru halted by police. WatchBritish singer Ed Sheeran's Bengaluru performance on Church Street was halted by the police as it was being held without prior permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/shivangi-joshi-maha-kumbh-holy-dip-2677148-2025-02-09",
      "headline": "Shivangi Joshi Maha Kumbh diary: Holy dip, prayers and serene momentsShivangi Joshi visited Maha Kumbh in Prayagraj with her parents, took a holy dip at Triveni Sangam, and shared glimpses of her spiritual journey on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lucky-ali-dreams-of-getting-married-again-2676813-2025-02-08",
      "headline": "Singer Lucky Ali 'dreams of getting married again'Singer Lucky Ali recently graced the Kathakar event where he spoke of his desire to get married again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papn-kaun-mera-song-special-26-completes-12-years-2676762-2025-02-08",
      "headline": "Papon's Kaun Mera song completes 12 years: Humbled by the love it still receivesPapon's soulful track Kaun Mera from Special 26 celebrates 12 years. The song's lasting popularity highlights its emotional depth and enduring appeal in Bollywood music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-6-ott-releases-this-week-the-mehta-boys-mrs-daaku-mahaaraj-game-changer-2676487-2025-02-07",
      "headline": "The Mehta Boys to Mrs: Top 6 OTT releases this weekThis weekend, a variety of highly anticipated South films and original titles are set to release on OTT platforms, offering viewers a diverse selection for binge-watching. Check out the list of the OTT releases of the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-kendrick-lamar-promises-storytelling-in-super-bowl-act-sza-drake-2676354-2025-02-07",
      "headline": "Grammy winner Kendrick Lamar promises storytelling in Super Bowl act, SZA to joinRapper and Grammy winner Kendrick Lamar will be headlining the Super Bowl halftime show for the first time in his career. Lamar has recently been in the news for winning five Grammys for his diss track Not Like Us, directed at rapper Drake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maryade-prashne-when-and-where-watch-the-malayalam-revenge-drama-prime-video-stmp-2676264-2025-02-07",
      "headline": "Maryade Prashne OTT release: When and where to watch the revenge dramaThe revenge family drama Maryade Prashne, which released in November last year, is now available to stream on a major OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-netflix-prosenjit-chatterjee-jeet-saswata-chatterjee-parambrata-chattopadhyay-2676206-2025-02-07",
      "headline": "How Netflix pulled most unexpected casting coup with Khakee The Bengal ChapterNetflix has orchestrated a major casting coup by bringing together top stars of Bengali cinema for its upcoming crime thriller, Khakee: The Bengal Chapter. The show promises to showcase the industry's talent and diversity in a groundbreaking way."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/internet-shreds-elvish-yadav-for-trolling-bigg-boss-18-finalist-chum-darang-2676258-2025-02-07",
      "headline": "Internet shreds Elvish Yadav for trolling Bigg Boss 18 finalist Chum DarangSocial media users have slammed YouTuber contestant Elvish Yadav for making inappropriate remarks about Bigg Boss 18 finalist and actor Chum Darang's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bada-naam-karenge-review-sooraj-barjatya-ott-debut-palash-vaswani-sony-liv-2676217-2025-02-07",
      "headline": "Bada Naam Karenge review: Sweet, familiar and full of sanskaarsReleased-Fri Feb 07, 2025Bada Naam Karenge is a classic Rajshri Productions love story with sweet romance, catchy music, and family drama. While it evokes nostalgia, its simple plot and dated gender roles may not resonate with all. Strong performances and a heartfelt message make it a warm, fulfilling watch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/from-romance-to-revenge-k-drama-star-park-hyung-sik-buried-hearts-2676222-2025-02-07",
      "headline": "From romance to revenge, K-drama star Park Hyung-sik can do it allThere are not many South Korean stars who can boast of having a diverse filmography like Park Hyung-sik. In today's installment of our Weekly K-Fix, we take a quick look at the artiste's short but illustrious career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-greatest-rivalry-india-vs-pakistan-review-reliving-cricket-golden-era-and-its-heroes-2676210-2025-02-07",
      "headline": "The Greatest Rivalry India vs Pakistan: Reliving cricket's golden era and its heroes  Released-Fri Feb 07, 2025The Greatest Rivalry India vs Pakistan review: A new Netflix docu-series revives the legendary India vs Pakistan cricket rivalry, exploring its intense history and iconic players with insights from cricket legends and journalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-netflixs-the-trauma-code-a-breakout-hit-surpassing-squid-game-2-2676127-2025-02-07",
      "headline": "What makes Netflix's The Trauma Code a breakout hit surpassing Squid Game 2The Trauma Code: Heroes on Call has taken Netflix by storm, surpassing Squid Game Season 2 on the global chart. This medical drama captivates with its blend of intense medical scenarios, hospital politics, and humour, offering a fresh take on the genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-on-aap-delhi-loss-arvind-kejriwal-cm-resign-bjp-win-bihar-elections-2677280-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kejriwal should've resigned after arrest, not bail: Prashant Kishor on AAP lossSpeaking to India Today TV, Prashant Kishor called Arvind Kejriwal's decision to resign as Chief Minister after securing bail a major strategic blunder, arguing it weakened AAP's position in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-chief-minister-n-biren-singh-resigns-ethnic-violence-no-confidence-buzz-2677240-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manipur Chief Minister resigns nearly 2 years after ethnic violence beganManipur Chief Minister N Biren Singh handed over his resignation to Governor Ajay Kumar Bhalla amid buzz over a no-confidence motion and floor test by Congress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-hundred-india-vs-england-match-report-cuttack-2677279-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vintage Rohit Sharma, wily Jadeja hand India series-win in CuttackRohit Sharma's defiant hundred and Ravindra Jadeja's wily 3-wicket spell helped India secure a series win over England on Sunday, February 9. Sharma returned to form with a 76-ball century, his first in ODIs in 16 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tasks-elon-musk-with-finding-billions-of-dollars-in-us-government-fraud-2677326-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump tasks Elon Musk with finding 'billions of dollars' in US government fraudElon Musk, who the White House says is a special government employee, has been tasked by Trump to lead an effort to slash the size of the US federal workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-clarifies-he-had-permission-to-busk-in-bengaluru-2677246-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ed Sheeran clarifies he had permission 'to busk' in Bengaluru: It wasn't randomBritish singer Ed Sheeran has shared a short statement about his street performance in Bengaluru ahead of his concert tonight in the city. The artiste shared that he had permission to perform, contrary to the reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-elections-prashant-bhushan-slams-arvind-kejriwal-for-aap-defeat-says-beginning-of-party-end-2677202-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prashant Bhushan slams Arvind Kejriwal for AAP's defeat: Beginning of party's endOusted AAP leader Prashant Bhushan blamed Arvind Kejriwal for AAP's monumental defeat in Delhi and called it the \"beginning of the party's end\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/order-calling-for-manipur-assembly-session-from-tomorrow-declared-invalid-2677282-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Due from tomorrow, Manipur Assembly session called off after Biren Singh resignsManipur Governor Ajay Kumar Bhalla declared the order convening the state Assembly from February 10 as \"null and void.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aero-india-2025-amca-full-scale-advanced-combat-aircraft-model-bengaluru-2677219-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India unveils full-scale advanced aircraft model at Aero India in BengaluruIndia unveiled a full-scale engineering model of the Advanced Medium Combat Aircraft (AMCA) at Aero India 2025. The AMCA is a twin-engine, multi-role stealth fighter designed to meet the needs of the Indian Air Force (IAF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-expands-10-billion-suit-against-cbs-over-edited-kamala-harris-interview-2677232-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump doubles $10 billion suit against broadcaster over edited Kamala interviewThe updated lawsuit mentions former Vice President Kamala Harris's full interview with CBS News, with Donald Trump's legal team arguing that the media house deliberately distorted Harris's responses to make her appear more articulate and competent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-elections-anurag-thakur-says-atishi-danced-as-kejriwal-plot-to-engineer-her-defeat-failed-2677277-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arvind Kejriwal's plot to 'engineer' Atishi's defeat failed: Anurag ThakurBJP leader Anurag Thakur said that Atishi danced to celebrate Arvind Kejriwal's failure of plotting to \"engineer her defeat\" in the Delhi Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-rohit-sharma-scores-century-vs-england-in-cuttack-2677264-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit slams 76-ball hundred vs England, ends 16-month century drought in ODIsIndia captain Rohit Sharma scored a sensational 76-ball century during the second ODI against England to bounce back to form ahead of the ICC Champions Trophy. It was the second-fastest ODI ton for the India skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mcd-mayoral-elections-delhi-assembly-polls-bjp-councillors-aap-kejriwal-civic-body-2677200-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's triple-engine government in Delhi soon? All eyes on mayoral pollsAfter winning the Assembly elections, the BJP is now focusing on the Municipal Corporation of Delhi (MCD) mayoral race in April, aiming to consolidate power across municipal, state, and central levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/shops-without-shopkeepers-trust-main-currency-pfutsero-nagaland-phek-mizoram-kerala-schools-honour-system-nghah-loh-dawr-2677137-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shops without shopkeepers in India, where trust is the main currencyShops without shopkeepers in Nagaland's Pfutsero run simply on trust. Managed by women farmers, these shops, bang on the highway, place trust in absolute strangers to pay for whatever they buy. A similar experiment in 15 Kerala schools has provided encouraging results. Here's why trust begets honesty, and how it can spark a chain-reaction of goodness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rbi-repo-rate-cut-coupled-with-tax-sops-in-budget-could-boost-consumption-2676732-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI repo rate cut, coupled with tax sops in Budget, could boost consumptionExperts are optimistic that the 25 bps cut—the first in nearly five years—will make borrowing cheaper and spur the demand for consumer durables, automobiles and homes\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aligarh-muslim-university-beef-biryani-canteen-menu-up-administration-typing-error-2677255-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Beef biryani' on Aligarh Muslim University menu. Professor calls it 'typo'A viral notice at Aligarh Muslim University (AMU) claiming a switch from chicken to beef biryani sparked controversy. The AMU administration dismissed it as a \"typing error\" and issued show-cause notices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manipur-chief-minister-resignation-belated-demand-raised-in-2023-says-congress-mp-jairam-ramesh-2677256-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No-confidence motion forced a reckoning: Rahul Gandhi on Biren Singh's resignationN Biren Singh resigned as the Manipur Chief Minister on Sunday. Responding to the development, Congress MP Rahul Gandhi said that \"mounting public pressure\" and the threat of a no-confidence motion had \"forced a reckoning\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bjps-milkipur-win-booster-shot-for-yogi-adityanath-reality-check-for-sp-2676919-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP's Milkipur win a boost for Yogi Adityanath, reality check for Samajwadi PartyThe bypoll victory shows the BJP's recalibrated strategy of balancing Hindutva with caste outreach and development is working—and well in time for the UP elections in 2027\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-447-07-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-election-results-2025-full-list-of-winners-and-losers-constituency-wise-stmp-2676691-2025-02-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Election Results 2025: Full list of winners by constituencyDelhi Assembly election Result 2025: In a surprising turn of events, key Aam Aadmi Party leaders Arvind Kejriwal and Manish Sisodia have admitted to their defeat. Here's the full list of winners from the 70 constituencies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-2nd-odi-floodlight-failure-interrupts-rohit-sharmas-onslaught-in-cuttack-2677242-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IND vs ENG: Floodlight failure interrupts Rohit Sharma's onslaught in CuttackThe second ODI between India and England was interrupted due to a floodlight issue at Barabati Stadium, Cuttack. Rohit Sharma looked at his aggressive best when the play was halted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-hostage-released-hamas-wife-daughters-dead-massacre-gaza-ceasefire-deal-2677158-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Happy to return to wife, daughters': Freed hostage unaware Hamas killed themAn Israeli hostage who was freed by Hamas after 491 days said he was happy to return to his wife and their two daughters, unaware that all of them were killed in the October 7, 2023 massacre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-security-personnel-killed-2-injured-in-encounter-in-chhattisgarhs-bijapur-12-naxals-gunned-down-2677116-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 security personnel killed, 31 Naxals gunned down in Chhattisgarh encounterThe encounter took place in a forest in Indravati National Park area this morning when a joint team of personnel from different security forces was out on an anti-Naxalite operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-rajiv-shukla-india-bloc-is-united-opposition-to-fight-lok-sabha-polls-together-2677209-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "We're united, INDIA bloc to come together again for Lok Sabha polls: Congress MPAmid reports of a rift within the Opposition bloc, Congress MP Rajiv Shukla asserted that the INDIA bloc remains united, adding that the parties would come together again when general elections approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/10-most-affordable-countries-for-indian-students-to-study-abroad-2677182-2025-02-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 most budget-friendly countries for Indian students to study abroadMany countries offer Indian students high-quality education with affordable tuition and living costs. Here are the top 10 most budget-friendly study-abroad destinations to help you achieve your academic dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-and-mother-take-a-holy-dip-at-triveni-sangam-maha-kumbh-2677238-2025-02-09",
      "headline": "Pics: Vijay Deverakonda and mother take a holy dip at Triveni SangamTelugu star Vijay Deverakonda is at the Maha Kumbh with his mother. The actor took a holy dip at the Triveni Sangam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-clarifies-he-had-permission-to-busk-in-bengaluru-2677246-2025-02-09",
      "headline": "Ed Sheeran clarifies he had permission 'to busk' in Bengaluru: It wasn't randomBritish singer Ed Sheeran has shared a short statement about his street performance in Bengaluru ahead of his concert tonight in the city. The artiste shared that he had permission to perform, contrary to the reports. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richard-gere-slams-donald-trump-calls-him-a-bully-and-thug-2677211-2025-02-09",
      "headline": "Richard Gere slams Donald Trump, calls him a 'bully and thug'Actor Richard Gere, who was recently conferred with the Lifetime Achievement Award at Spain's Goya Awards ceremony, slammed US President Donald Trump and urged everyone to be more vigilant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-pain-ear-piercing-chhaava-watch-2677204-2025-02-09",
      "headline": "Vicky Kaushal winces in pain as he gets ear pierced for Chhaava. WatchVicky Kaushal shared a video of himself squirming in pain while getting his ear pierced for Chhaava. The actor underwent intense prep, including weight gain and battle training, for the role."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-sri-lanka-rohit-sharma-ravindra-jadeja-champions-trophy-2677320-2025-02-09",
      "headline": "Rohit Sharma's Ravindra Jadeja said that Rohit Sharma's stupendous century in the second ODI against England is a huge confidence booster for the skipper and the Indian team before the Champions Trophy. On Sunday, February 39, Rohit's 32nd ODI hundred powered India to a 2-0 series win with a four-wicket triumph at the Barabati Stadium in Cuttack.  Rohit smacked 119 with 12 fours and seven sixes as India tracked down a stiff target of 305 with more than five overs to spare. Jadeja said that it was only a matter of time before the Indian captain returned to his very best. Rohit also won the Player of the Match award as India followed up their stupendous performance in the T20Is with a clinical showing in the 50-over format.  \"Sometimes, it just takes one or two innings to turn things around. The good thing is that, before an important tournament like the Champions Trophy, scoring a hundred is a huge boost. It's great entury before Champions Trophy big confidence booster: Ravindra Jadeja IND vs ENG: Ravindra Jadeja said that Rohit Sharma scoring a century at the Barabati Stadium in Cuttack will give the Indian team a huge confidence boost before the Champions Trophy to be held from February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-2nd-odi-rohit-sharma-reveals-secret-mantra-after-century-in-cuttack-2677298-2025-02-09",
      "headline": "Rohit Sharma reveals 'secret mantra' to find his form back: Broke it into piecesIndia captain Rohit Sharma revealed his secret mantra which helped him bounce back to form in the second ODI against England in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-cuttack-odi-who-said-what-2677297-2025-02-09",
      "headline": "Who said what as Rohit Sharma bludgeons his way back to form IND vs ENG: Jos Buttler and Shubman Gill heaped praise on Rohit Sharma after the Indian skipper smacked 119 runs off 90 balls, helping India beat England by four wickets at the Barabati Stadium in Cuttack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-hundred-india-vs-england-match-report-cuttack-2677279-2025-02-09",
      "headline": "Vintage Rohit Sharma, wily Jadeja hand India series-win in CuttackRohit Sharma's defiant hundred and Ravindra Jadeja's wily 3-wicket spell helped India secure a series win over England on Sunday, February 9. Sharma returned to form with a 76-ball century, his first in ODIs in 16 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-rohit-sharma-scores-century-vs-england-in-cuttack-2677264-2025-02-09",
      "headline": "Rohit slams 76-ball hundred vs England, ends 16-month century drought in ODIsIndia captain Rohit Sharma scored a sensational 76-ball century during the second ODI against England to bounce back to form ahead of the ICC Champions Trophy. It was the second-fastest ODI ton for the India skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-virat-kohli-adil-rashid-cuttack-odi-2677265-2025-02-09",
      "headline": "Virat Kohli fails in Cuttack ODI, falls to Adil Rashid for 10th time IND vs ENG: Virat Kohli scored only four runs in the second ODI against England at the Barabati Stadium in Cuttack on Sunday, February 9 before Adil Rashid dismissed him caught behind. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-rohit-sharma-scores-30-ball-fifty-in-cuttack-vs-england-during-2nd-odi-2677253-2025-02-09",
      "headline": "IND vs ENG: Rohit Sharma roars back to form, bludgeons England for 30-ball 50Star India batter Rohit Sharma slammed a 30-ball half-century to bounce back to form against England during the second ODI in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-kevin-pietersen-2677254-2025-02-09",
      "headline": "Pietersen launches epic rant after England batters throw away starts vs IndiaFormer England cricketer Kevin Pietersen lambasted the English side for being happy with 60-70 runs in ODI cricket. Pietersen argued that the batters should be aiming for hundreds if they want England to win matches in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-england-rohit-sharma-fifty-form-champions-trophy-cuttack-2677252-2025-02-09",
      "headline": "Fans rejoice Rohit Sharma's return to form before Champions Trophy IND vs ENG: Fans were delighted after Rohit Sharma raced his way to scoring a half-century in the second ODI in Cuttack. Rohit went after the English bowling at the Barabati Stadium to bring up his fifty off 30 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-2nd-odi-floodlight-failure-interrupts-rohit-sharmas-onslaught-in-cuttack-2677242-2025-02-09",
      "headline": "IND vs ENG: Floodlight failure interrupts Rohit Sharma's onslaught in CuttackThe second ODI between India and England was interrupted due to a floodlight issue at Barabati Stadium, Cuttack. Rohit Sharma looked at his aggressive best when the play was halted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-fumes-at-harshit-rana-for-giving-overthrows-in-ind-vs-eng-2nd-odi-2677236-2025-02-09",
      "headline": "Dimaag kidhar hai tera? : Rohit Sharma fumes at Harshit Rana for giving overthrowsIndia captain Rohit Sharma was seen fuming at fast bowler Harshit Rana for giving four runs as overthrows during the second ODI against England in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-rohit-sharma-scores-30-ball-fifty-in-cuttack-vs-england-during-2nd-odi-2677253-2025-02-09",
      "headline": "IND vs ENG: Rohit Sharma roars back to form, bludgeons England for 30-ball 50Star India batter Rohit Sharma slammed a 30-ball half-century to bounce back to form against England during the second ODI in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-kevin-pietersen-2677254-2025-02-09",
      "headline": "Pietersen launches epic rant after England batters throw away starts vs IndiaFormer England cricketer Kevin Pietersen lambasted the English side for being happy with 60-70 runs in ODI cricket. Pietersen argued that the batters should be aiming for hundreds if they want England to win matches in the 50-over format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-india-vs-england-rohit-sharma-fifty-form-champions-trophy-cuttack-2677252-2025-02-09",
      "headline": "Fans rejoice Rohit Sharma's return to form before Champions Trophy IND vs ENG: Fans were delighted after Rohit Sharma raced his way to scoring a half-century in the second ODI in Cuttack. Rohit went after the English bowling at the Barabati Stadium to bring up his fifty off 30 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-2nd-odi-floodlight-failure-interrupts-rohit-sharmas-onslaught-in-cuttack-2677242-2025-02-09",
      "headline": "IND vs ENG: Floodlight failure interrupts Rohit Sharma's onslaught in CuttackThe second ODI between India and England was interrupted due to a floodlight issue at Barabati Stadium, Cuttack. Rohit Sharma looked at his aggressive best when the play was halted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-fumes-at-harshit-rana-for-giving-overthrows-in-ind-vs-eng-2nd-odi-2677236-2025-02-09",
      "headline": "Dimaag kidhar hai tera? : Rohit Sharma fumes at Harshit Rana for giving overthrowsIndia captain Rohit Sharma was seen fuming at fast bowler Harshit Rana for giving four runs as overthrows during the second ODI against England in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-virat-kohli-ball-boy-cuttack-odi-2677233-2025-02-09",
      "headline": "Watch: Ball boy awestruck as Virat Kohli shakes hand with him IND vs ENG, 2nd ODI: A boy ball was left awestruck after Virat Kohli shook hands with him in India's second ODI against Jos Buttler's England on Sunday at the Barabati Stadium in Cuttack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-cricket-varun-chakravarthy-odi-debut-2677224-2025-02-09",
      "headline": "Varun Chakravarthy impresses on ODI debut, bowls economical spell in CuttackIndia spinner Varun Chakravarthy had a good outing on his ODI debut against England. Varun bowled his full quota of 10 overs and gave away only 54 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-joe-root-continues-to-be-ravindra-jadejas-bunny-ind-vs-eng-2nd-odi-cuttack-2677222-2025-02-09",
      "headline": "Joe Root continues to be Ravindra Jadeja's bunny, gets dismissed 5th time in ODIsIndia all-rounder Ravindra Jadeja dismissed England batter Joe Root for the fifth time in his career during the second ODI between the two teams in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-mi-cape-town-anrich-nortje-corbin-bosch-2677223-2025-02-09",
      "headline": "MI Cape Town speedster replaces Anrich Nortje in South Africa squadCorbin Bosch has replaced Anrich Nortje in the South African squad for the upcoming Champions Trophy 2025. Bosch was a part of MI Cape Town's title-winning squad in the SA20 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-takes-breathtaking-catch-to-dismiss-harry-brook-in-2nd-odi-2677207-2025-02-09",
      "headline": "Jaiswal in 1st, Gill in 2nd: India continue taking breathtaking catches vs EnglandIndia vice-captain Shubman Gill took a breathtaking running catch to dismiss Harry Brook in the second ODI against England in Cuttack. Earlier, Yashasvi Jaiswal pulled off a stunner in the first ODI to dismiss Ben Duckett."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rachin-ravindra-injury-update-2677203-2025-02-09",
      "headline": "Rachin Ravindra injury update: Player doing well after horrific blow to headNew Zealand provided an update on Rachin Ravindra's horrific injury, which the all-rounder sustained while fielding against Pakistan. The team confirmed that Ravindra's forehead cut was treated and that the player was doing well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sprinkle-water-heat-cuttack-odi-2677198-2025-02-09",
      "headline": "Fans sprayed with water to beat severe heat in Cuttack ODI IND vs ENG: Fans in Cuttack were sprayed with water to beat the heat during the second ODI on Sunday, February 9, between India and England at the Barabati Stadium, to beat the severe heat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-ravindra-jadeja-gives-emotional-speech-for-odi-debutant-varun-chakravarthy-2677192-2025-02-09",
      "headline": "Jadeja's emotional speech for debutant Chakravarthy: From tennis ball to ODI capStar India all-rounder Ravindra Jadeja gave an emotional speech while handing over the ODI debut cap to Varun Chakravarthy during the second match against England in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-takes-breathtaking-catch-to-dismiss-harry-brook-in-2nd-odi-2677207-2025-02-09",
      "headline": "Jaiswal in 1st, Gill in 2nd: India continue taking breathtaking catches vs EnglandIndia vice-captain Shubman Gill took a breathtaking running catch to dismiss Harry Brook in the second ODI against England in Cuttack. Earlier, Yashasvi Jaiswal pulled off a stunner in the first ODI to dismiss Ben Duckett."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rachin-ravindra-injury-update-2677203-2025-02-09",
      "headline": "Rachin Ravindra injury update: Player doing well after horrific blow to headNew Zealand provided an update on Rachin Ravindra's horrific injury, which the all-rounder sustained while fielding against Pakistan. The team confirmed that Ravindra's forehead cut was treated and that the player was doing well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sprinkle-water-heat-cuttack-odi-2677198-2025-02-09",
      "headline": "Fans sprayed with water to beat severe heat in Cuttack ODI IND vs ENG: Fans in Cuttack were sprayed with water to beat the heat during the second ODI on Sunday, February 9, between India and England at the Barabati Stadium, to beat the severe heat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-ravindra-jadeja-gives-emotional-speech-for-odi-debutant-varun-chakravarthy-2677192-2025-02-09",
      "headline": "Jadeja's emotional speech for debutant Chakravarthy: From tennis ball to ODI capStar India all-rounder Ravindra Jadeja gave an emotional speech while handing over the ODI debut cap to Varun Chakravarthy during the second match against England in Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-sri-lanka-2nd-test-match-report-2677177-2025-02-09",
      "headline": "Australia send WTC Final warning with series sweep vs Sri Lanka in GalleAustralia hammered Sri Lanka in the second and final Test match to clean sweep the series 2-0. With the win, Australia completed a perfect WTC cycle, where they held every single bilateral trophy in the red-ball format.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-deepti-sharma-up-warriorz-captain-replaces-injured-alyssa-healy-wpl-2677154-2025-02-09",
      "headline": "Deepti Sharma replaces injured Alyssa Healy as UP Warriorz captainDeepti Sharma was announced as UP Warriorz captain for WPL 2025, replacing the injured Alyssa Healy. With her all-round brilliance in WPL 2024, she now faces the challenge of leading the franchise to glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jacob-bethell-injured-india-odi-series-tom-banton-2677152-2025-02-09",
      "headline": "Jacob Bethell ruled out of India ODIs due to hamstring injury, Banton called-upYoung England all-rounder Jacob Bethell has been ruled out from the ODI series against India after suffering a hamstring injury. England have called-up Tom Banton as their replacement who last played an ODI four and a half years ago."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}