{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariffs-us-consumers-face-price-hikes-across-major-brands-2767858-2025-08-07",
      "headline": "Trump tariffs: US consumers face price hikes across major brandsIn the household goods sector, Procter & Gamble said it plans to raise prices on 25% of its North American products due to the impact of tariffs and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/despite-war-and-warnings-us-traded-more-with-russia-than-ally-ukraine-2767831-2025-08-07",
      "headline": "Despite war and warnings, US traded more with Russia than ally UkraineUS President Donald Trump alleges that India has been financing the Russian invasion of Ukraine by importing oil. However, data by the US Census Bureau presents a different picture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-india-plans-to-tackle-trump-tariff-threat-2767785-2025-08-07",
      "headline": "How India plans to tackle Trump's tariff threatIndia has already held five rounds of trade talks with the US, but no deal has been reached. The talks failed mainly because of disagreements over opening India's farm and dairy sectors, and the issue of buying oil from Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-under-us-tariff-pressure-refiners-hits-pause-on-russian-oil-imports-report-2767781-2025-08-07",
      "headline": "Indian refiners hit pause on Russian oil imports after 50% tariff blow: ReportRefiners like Indian Oil Corporation, Bharat Petroleum Corporation and Hindustan Petroleum Corporation have decided not to buy Russian oil on the spot market in the upcoming buying cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-in-green-as-d-street-investors-ignore-trumps-50-tariffs-2767779-2025-08-07",
      "headline": "Sensex, Nifty end in green as D-Street investors ignore Trump's 50% tariffsThe S&P BSE Sensex added 79.27 points to end at 80,623.26, while the NSE Nifty50 gained 21.95 points to close at 24,596.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-stp-and-swp-matter-more-than-sip-systematic-investment-plan-explains-stock-market-expert-2767715-2025-08-07",
      "headline": "Why STP and SWP matter more than SIP, explains stock market expertSIPs help you enter the world of investing. But STPs and SWPs help you navigate it wisely, especially when you have a big lump sum to invest or need steady income without eating into your entire savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-us-trade-war-timeline-pm-modi-india-response-ally-dead-economy-2767728-2025-08-07",
      "headline": "From ally to 'dead economy': Timeline of Trump's tariff turn on IndiaTrump signed an executive order imposing an additional 25% tariff on Indian goods, bringing the total to 50% on August 6, putting India among the most heavily tariffed nations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/nayara-energy-seeks-ships-from-india-to-ferry-refined-fuels-report-2767717-2025-08-07",
      "headline": "Nayara Energy seeks ships from India to ferry refined fuels: ReportSanctions-hit Nayara is struggling to get vessels for the supply of refined fuels for its retail stations in India. The private refiner has already cut crude runs at its refinery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-to-build-indias-biggest-privately-funded-coal-power-plant-in-a-decade-2767714-2025-08-07",
      "headline": "Adani to build India's biggest privately funded coal power plant in a decadeThe first of three units at the plant will be commissioned within four years, with the last expected to come online in five years' time, Adani Power said.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-hikes-salaries-for-80-percent-staff-amid-layoffs-report-2767655-2025-08-07",
      "headline": "TCS hikes salaries for 80% staff amid layoffs: ReportIn a message sent to employees, the company confirmed that the salary increase will apply to around 80% of the workforce and will take effect from September 1, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-donald-trump-100-percent-chip-tariff-plan-has-shaken-the-global-semiconductor-industry-2767632-2025-08-07",
      "headline": "How Trump's 100% chip tariff plan has shaken the global semiconductor industrySpeaking from the Oval Office, Trump said the move is aimed at boosting local manufacturing and reducing reliance on foreign-made chips. He added that companies like Apple, which recently committed an extra $100 billion investment in the US, would not be charged the new tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariffs-50-percent-impact-on-india-key-sectors-what-nex-2767626-2025-08-07",
      "headline": "Trump hits India with 50% tariffs: What's at stake and what next?A sweeping 50% tariff could significantly impact India's export economy, threatening jobs and trade ties. As Donald Trump ramps up pressure, all eyes are now on New Delhi's next move.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-news-impact-india-economy-sectors-hardest-hit-gem-jewellery-auto-labour-textile-seafood-export-2767607-2025-08-07",
      "headline": "From seafood to auto: How will Trump's 50% tariff impact different sectorsThe tariff hike, set to take effect from August 27, follows a warning issued by Trump earlier over India's continued oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/skipped-your-itr-for-years-here-is-how-it-can-impact-you-legally-and-financially-itr-filing-2767583-2025-08-07",
      "headline": "Skipped your ITR for years? Here's how it can impact you legally and financiallyIt might feel harmless to skip filing your Income Tax Return once or twice, but if you've been ignoring it for years, you could be heading for serious trouble. From steep penalties to even jail time, here's what you need to know before it's too late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/jsw-cement-ipo-opens-for-subscription-should-you-apply-or-skip-2767578-2025-08-07",
      "headline": "JSW Cement IPO opens for subscription. Should you apply or skip?Brokerages are mostly positive about JSW Cement IPO, though some advise caution due to the stretched valuation and inconsistent profitability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-nifty-volatile-trade-what-should-investors-do-donald-trump-additional-us-tariffs-2767553-2025-08-07",
      "headline": "Sensex tanks 500 points on 50% Trump's tariff blow: Should Investors worry?The Sensex slipped over 250 points at the open before paring some losses. The Nifty50 was also trading lower, reflecting broad-based caution and expectations of a volatile trading session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-150-points-nifty-above-24500-bajaj-auto-down-nearly-2-2767538-2025-08-07",
      "headline": "Sensex, Nifty fall as Trump announces additional tariffs; experts advise cautionWhile Sensex opened 250 points lower, it was trading just 131.05 points lower at 80,412.94 at 9:22 am, indicating that the session could see wild swings and high volatility. Nifty50 was also down 67.25 points to 24,506.95.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-russia-oil-import-anand-mahindra-tweet-india-strategic-advantage-msme-tax-free-ease-of-business-2767463-2025-08-07",
      "headline": "How India can turn Trump's tariffs into a strategic advantageThe new tariff of an additional 25%, announced on Wednesday, will come into effect 21 days from August 7. This sharp increase in duties comes at a time when trade talks between the two countries have reached a dead end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pms-economic-advisory-council-members-on-trumps-tariff-war-indias-growth-strategy-2767416-2025-08-06",
      "headline": "PM's Economic Advisory Council members on Trump's tariff war, India's growth strategyPrime Minister Narendra Modi's Economic Advisory Council members, Dr Sajjid Chinoy and Neelkanth Mishra, share their perspectives on the additional 25 per cent tariffs imposed by Donald Trump on Indian imports to the US over buying Russian oil and India's growth strategy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-hdfc-union-bank-and-others-offer-attractive-3-year-fd-rates-should-you-invest-now-2767346-2025-08-06",
      "headline": "ICICI, HDFC, Union Bank and others offer attractive 3-year FD rates. Should you invest now?FDs remain one of the safest investment options for those looking for steady returns without risk. However, with repo rates possibly heading downward in the future, locking in higher FD rates now could be a smart financial move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/highway-infrastructure-ipo-opening-date-august-7-gmp-trend-50-percent-listing-gain-details-review-2767294-2025-08-06",
      "headline": "Should you subscribe to this IPO with over 50% listing gains? Check detailsThe public issue is worth Rs 130 crore, made up of a fresh issue of 1.39 crore shares amounting to Rs 97.52 crore, and an offer for sale of 46 lakh shares worth Rs 32.48 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-25-percent-import-duty-imports-phdcci-report-impact-india-economy-minimal-trump-2767228-2025-08-06",
      "headline": "US tariffs won't shake India's economy, says reportThe PHD Chamber of Commerce and Industry (PHDCCI) white paper finds only 1.87% impact on exports and 0.19% on GDP from the new US trade barrier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-usd-64-billion-us-trade-at-risk-as-tensions-with-washington-escalate-after-trump-tariff-threat-2767209-2025-08-06",
      "headline": "India's $64 billion US trade at risk as tensions with Washington escalateIndia faces its most serious diplomatic crisis with the US in years after Trump imposed the highest tariffs among Asian peers on goods imported from India, even before any penalty."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-rbi-rate-cut-it-stocks-us-tariff-concern-2767203-2025-08-06",
      "headline": "Sensex, Nifty end lower as US trade tension; RBI rate pause hit sentimentThe S&P BSE Sensex ended 166.26 points lower to end at 80,543.99, while the NSE Nifty50 lost 75.35 points to end at 24,574.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-radhika-gupta-on-why-large-cap-is-the-new-debt-2767168-2025-08-06",
      "headline": "Edelweiss' Radhika Gupta on why large cap is the new debtTraditionally, people invested in debt, like fixed deposits or bonds, when they wanted safety. They turned to equity, like stocks, when they were willing to take more risk for higher returns. But that line is getting blurry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-gen-z-is-trusting-instagram-influencers-over-financial-advisors-for-investment-advice-2767166-2025-08-06",
      "headline": "Is social media ruining investing for Gen Z?Social media is reshaping how young Indians invest. With financial influencer or 'finfluencer' on the rise, traditional financial literacy is being replaced by reels and short YouTube videos."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-russia-import-trade-trump-hypocrisy-india-oil-purchase-putin-china-tariff-news-2767164-2025-08-06",
      "headline": "Trump says don't know anything about US-Russia imports. But here's what we knowUS President Donald Trump recently said he was unaware that the United States still imports goods like uranium and fertilisers from Russia. His comments came after India defended its oil trade with Moscow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-ai-manage-your-investment-portfolio-ai-based-portfolio-management-tools-2767113-2025-08-06",
      "headline": "Can AI manage your investment portfolio?AI is rapidly changing how we invest. From portfolio tracking to fund recommendations, it's already doing the heavy lifting. But can it take full charge of your investments, and, should it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-easier-claim-rules-to-jan-dhan-scheme-rbi-3-key-reforms-for-common-man-2767056-2025-08-06",
      "headline": "From easier claim rules to Jan-dhan scheme: RBI's 3 key reforms for common manOne of the major announcements is aimed at easing the process for families to claim money or valuables from bank accounts, lockers, or safe custody after the account holder passes away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-sanjay-malhotra-us-tariff-statement-india-economy-impact-lending-rate-unchanged-2767010-2025-08-06",
      "headline": "Will US tariffs hit India's economy? What RBI Governor saidThe three-day meeting concluded with Governor Sanjay Malhotra outlining the central bank's views on inflation, growth, and importantly, the growing global trade tensions triggered by tariff announcements, especially by the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forgot-to-e-verify-your-itr-here-is-what-to-do-to-avoid-penalties-what-to-do-if-forgot-to-e-verify-itr-2767009-2025-08-06",
      "headline": "Forgot to e-verify your ITR? Here's what to do to avoid penaltiesEven though the new ITR deadline is now September 15, 2025 for several taxpayers, the 30-day e-verification window begins the moment you file your return and not from the due date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-stock-market-debut-hold-or-book-profit-2766980-2025-08-06",
      "headline": "Should you hold or sell NSDL shares after stock market listing? Details hereWhile NSDL may not offer sharp near-term upside post listing, many analysts see it as a core holding in India's market infrastructure play, particularly as digital finance expands and retail participation deepens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-shares-debut-with-10-percent-premium-over-ipo-issue-price-2766972-2025-08-06",
      "headline": "NSDL shares debut with 10% premium over IPO issue priceNSDL's Rs 4,012 crore initial public offering was entirely an offer for sale (OFS) involving 5.01 crore equity shares. The issue saw robust demand from all investor segments, with an overall subscription of 41.02 times. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-lending-rate-steady-at-55-amid-global-trade-uncertainty-2766969-2025-08-06",
      "headline": "RBI keeps key lending rate steady at 5.5% amid global trade uncertaintyThe RBI MPC sighted the global tensions and trade uncertainty in keeping key lending rates unchanged. The MPC also decided to continue with a neutral stance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-off-to-shaky-start-amid-trump-tariff-threat-rbi-rate-decision-2766965-2025-08-06",
      "headline": "Sensex, Nifty off to shaky start amid Trump tariff threat, RBI rate decisionThe S&P BSE Sensex was down 65.70 points to 80.644.34 at 9:40 am, while the NSE Nifty50 fell 28.40 points to trade at 24,620."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-today-august-6-home-loan-emi-cheaper-rate-cut-us-tariff-affordable-housing-real-estate-2766959-2025-08-06",
      "headline": "RBI MPC announcement today: Will your home loan get cheaper?With interest rates already lowered three times in 2025, homebuyers and borrowers across the country are waiting to see if there is any further relief coming their way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-monetary-policy-august-2025-what-to-expect-from-the-august-6-mpc-meet-2766749-2025-08-06",
      "headline": "RBI MPC rate decision on August 6: Time, expectations, and key updatesRBI Governor Sanjay Malhotra will present the monetary policy statement today. Check time, expectations, and key updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/anil-ambani-likely-to-be-summoned-again-by-ed-for-questioning-sources-2766726-2025-08-05",
      "headline": "Anil Ambani likely to be summoned again by ED for questioning: SourcesAnil Ambani faced questioning by the Enforcement Directorate in connection with an alleged Rs 17,000 crore loan fraud case. The questioning lasted for several hours, with sources indicating that he is likely to be summoned again within seven to ten days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-seeks-10-from-ed-days-to-provide-documents-in-fraud-cases-sources-2766708-2025-08-05",
      "headline": "Anil Ambani seeks 10 days from ED to provide documents in fraud cases: SourcesThe 66-year-old industrialist was summoned to the ED headquarters in New Delhi, where his statement was recorded under the Prevention of Money Laundering Act (PMLA)."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-pm-modi-seeks-support-for-recognition-of-keeladis-antiquity-2767970-2025-08-07",
      "headline": "Kamal Haasan meets PM Modi, seeks support for recognition of Keeladi's antiquityActor and Rajya Sabha MP, Kamal Haasan met Prime Minister Narendra Modi to seek expedited recognition of Keeladi's antiquity. He highlighted the need to promote Tamil civilisation and language on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ib-ministry-notice-khalid-ka-shivaji-marathi-film-controversy-maratha-king-2767952-2025-08-07",
      "headline": "Centre issues notice to Marathi film 'Khalid Ka Shivaji' makers amid ban callsThe I&B ministry has issued a notice to the makers of the Marathi film Khalid Ka Shivaji following protests over the secular portrayal of Chhatrapati Shivaji Maharaj in the movie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thursday-murder-club-trailer-netflix-eteran-sleuths-lead-probe-mysterious-death-2767921-2025-08-07",
      "headline": "The Thursday Murder Club trailer: Veteran sleuths lead the probe on mysterious deathNetflix released the trailer for The Thursday Murder Club, a mystery film based on Richard Osman's bestselling novel. The story follows four retirees who solve cold cases, leading to a thrilling murder investigation on their doorstep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-saurabh-shukla-teases-courtroom-chaos-jollys-akshay-kumar-arshad-warsi-2767947-2025-08-07",
      "headline": "Jolly LLB 3: Saurabh Shukla teases courtroom chaos with two JollysGet ready for chaos as 'Jolly LLB 3' returns with Akshay Kumar and Arshad Warsi, alongside Saurabh Shukla as Judge Tripathi. The teaser will release on August 12, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/farida-jalal-warned-shruti-seth-not-correct-aamir-khan-kajol-fanaa-set-2767939-2025-08-07",
      "headline": "When Farida Jalal warned Shruti Seth not to correct big stars on Fanaa setActor Shruti Seth recalls Farida Jalal's playful warning during 'Fanaa' shoot and shares her experience working with Aamir Khan and Kajol.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-productions-team-clarification-statement-on-rajinikanth-coolie-distribution-2767822-2025-08-07",
      "headline": "Aamir Khan not involved in Coolie Hindi release, confirms production teamActor Aamir Khan's appearance in superstar Rajinikanth's much-awaited film 'Coolie' is only a goodwill gesture. Contrary to recent reports, a statement by the actor's team on Thursday stated that he is not involved in the film's distribution and has not made any calls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunil-darshan-opens-up-on-choosing-newcomers-2767920-2025-08-07",
      "headline": "I'm done chasing stars: Sunil Darshan opens up on choosing newcomersDirector Sunil Darshan, in an exclusive interaction with India Today, spoke about casting newcomers in his upcoming film 'Andaaz 2'. He even reflected on his past collaborations with prominent stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/elnaaz-norouzi-declines-rs-6-crore-offer-to-participate-in-bigg-boss-19-2767917-2025-08-07",
      "headline": "Elnaaz Norouzi declines Rs 6 crore offer to participate in Bigg Boss 19 : ExclusiveActor Elnaaz Norouzi turned down a Rs 6 crore offer to participate in Salman Khan-hosted 'Bigg Boss 19.' A source close to the development cited the actor's professional commitments behind the decision. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-5-movies-and-shows-to-watch-on-prime-video-this-weekend-the-pickup-arabia-kadali-2767906-2025-08-07",
      "headline": "Top 5 movies and shows to watch on Prime Video this weekendTop picks to stream on Prime Video this weekend, from thrillers to heartfelt dramas, including Eddie Murphy's 'The Pickup' and Telugu hit 'Arabia Kadali'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/coolie-war-2-independence-day-box-office-clash-2024-2767851-2025-08-07",
      "headline": "Coolie vs War 2 advance booking: Rajinikanth's film leads with 60% buzz | Exclusive'Coolie' and 'War 2' are set to clash at the box office this Independence Day weekend. The battle pits strong pan-India star casts against regional dominance, promising a thrilling cinematic showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-at-50-the-making-of-gabbar-singh-bollywood-greatest-villain-amjad-khan-2767901-2025-08-07",
      "headline": "Sholay@50: The Making of Gabbar, Bollywood's Greatest VillainWhat made Gabbar Singh the greatest villain in Bollywood history? It wasn't just Amjad's performance, though his raw intensity was undeniable. It was the magic of Salim-Javed's writing, Sippy's vision, and Amjad's ability to transcend the archetype of the Bollywood villain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/films-shows-to-watch-on-netflix-this-weekend-2767736-2025-08-07",
      "headline": "Top 6 films and shows to watch on Netflix this weekendSeveral shows, including actor Jenna Ortega's 'Wednesday' Season 2, premiered on Netflix this week. The new episodes of 'The Great Indian Kapil Show Season 3' and 'Perfect Match Season 3' will also be released on the OTT platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandanna-opens-up-on-online-negativity-2767867-2025-08-07",
      "headline": "Rashmika Mandanna opens up on online negativity: Let people breatheRashmika Mandanna opened up about dealing with trolls, negative PR, and how her genuine kindness is often seen as fake. Despite the criticism, she continues to choose kindness and focuses on her work across multiple film industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/isha-koppikar-recalls-being-humiliated-by-south-choreographer-2767674-2025-08-07",
      "headline": "Isha Koppikar recalls being humiliated by south choreographer: Took it as challengeIsha Koppikar shared that she was publicly humiliated by a choreographer early in her career for not knowing how to dance, which left her in tears. Motivated by the incident, she trained hard and later rose to fame with hit songs like 'Khallas', becoming a celebrated dancer in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-says-coolie-with-rajinikanth-is-her-full-circle-moment-exclusive-2767842-2025-08-07",
      "headline": "Shruti Haasan says Coolie with Rajinikanth is her full-circle moment: ExclusiveActor Shruti Haasan calls working on Coolie a \"full-circle moment,\" highlighting the emotional weight of her character and the thrill of sharing screen space with Rajinikanth in one of the biggest movies of the year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/bombay-hc-directs-cbfc-to-clarify-objectionable-scenes-in-ajey-biopic-2767818-2025-08-07",
      "headline": "Censor board under fire for denying certificate to Ajey, decision due in a weekThe Bombay High Court has directed the Central Board of Film Certification (CBFC) to clearly specify the objectionable scenes in the film 'Ajey'. The court criticised the censor board for creating unnecessary hurdles and asked for a transparent certification process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/summer-i-turned-pretty-season-3-episode-5-belly-body-language-around-conrad-jeremiah-2767786-2025-08-07",
      "headline": "Summer I Turned Pretty: What Belly's body language says about Conrad vs JeremiahA deep dive into Belly's voice, body language, and subtle behaviour in 'The Summer I Turned Pretty' reveals more about her true feelings for Conrad and the emotional security he provides, without needing to say a word."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-sister-riddhima-kapoor-sahni-raksha-bandhan-2025-exclusive-interview-2763615-2025-08-07",
      "headline": "Ranbir is the pillar of our family now, always dependable: Riddhima KapoorIn an exclusive chat with India Today.in Riddhima Kapoor Sahni said, \"No matter where he is, my Rakhi always finds him.\" From shared secrets to long-distance rakhis, Ranbir Kapoor and Riddhima prove that some sibling bonds are always box-office hits!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/project-tiger-review-roaring-tale-power-loss-redemption-2767700-2025-08-07",
      "headline": "Project Tiger review: A roaring tale of power, loss and redemption'Project Tiger' highlights India's fight to save its fiercest predator and the challenges behind this landmark conservation effort."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nsa-ajit-doval-meets-vladimir-putin-in-moscow-amid-trumps-tariffs-on-india-over-russian-oil-2767963-2025-08-07",
      "headline": "Ajit Doval meets Putin in Moscow amid Trump's tariffs on India over Russian oilIndia and Russia stressed their commitment to a \"strategic partnership\" during bilateral security talks in Moscow, held a day after US President Donald Trump announced higher tariffs on Indian imports in response to India's continued purchases of Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/firing-at-kapil-sharmas-canada-cafe-2nd-incident-in-a-month-gangster-goldy-dhillon-claims-responsibility-2767942-2025-08-07",
      "headline": "Shots fired at Kapil Sharma's Canada cafe again, Lawrence Bishnoi claims attackKapil Sharma's cafe in Canada once again came under attack, marking second incident in a month. Gangster Goldy Dhillon has claimed responsibility this time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/100250-vote-chori-rahul-gandhi-presentation-at-india-bloc-dinner-meet-2767967-2025-08-07",
      "headline": "1,00,250 vote chori: Rahul Gandhi's presentation at INDIA bloc dinner meetAt the core of the discussions was a detailed presentation by Rahul Gandhi titled \"Democracy Destroyed,\" in which he briefed the INDIA bloc leadership on alleged booth-level electoral frauds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/high-court-pauses-punjabs-land-pooling-policy-in-big-jolt-to-aap-2767856-2025-08-07",
      "headline": "High Court pauses Punjab's land-pooling policy in big jolt to AAP governmentThe Punjab and Haryana High Court put an interim pause on the operation of the Punjab government's Land Pooling Policy 2025 in response to a petition that challenged the legality and constitutionality of the policy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-voter-fraud-allegations-karnataka-assembly-polls-supports-election-commission-sir-exercise-bihar-rjd-2767881-2025-08-07",
      "headline": "YesSIR! Rahul Gandhi just ended up backing EC's roll revisionRahul Gandhi, the Leader of Opposition in the Lok Sabha, presented what he claimed was \"evidence\" of \"vote theft\" in an Assembly constituency in Karnataka. The Election Commission rebutted his claims, but it should have also thanked him. That's because Rahul ended up backing the EC's Special Intensive Revision (SIR) exercise, opposed by the Congress and its allies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-25-extra-tariff-on-india-china-opposes-washingtons-move-says-stance-on-tariff-abuse-consistent-2767924-2025-08-07",
      "headline": "China's opposition clear: India finds an unlikely ally as Beijing slams US tariffsThe strong response came after US President Donald Trump signed an executive order placing an additional 25 per cent tariff on Indian goods, taking the total import duty to 50 per cent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commissions-sign-oath-dare-over-rahul-gandhis-absurd-poll-fraud-claim-2767900-2025-08-07",
      "headline": "Poll body dares Rahul Gandhi to sign oath over 'absurd' vote theft claimThe poll body, fact-checking Rahul Gandhi's vote theft charge in Karnataka, challenged the Leader of the Opposition in the Lok Sabha to \"sign an oath as per Rule 20(3)(b) of the Registration of Electors Rules\" and submit it to the Chief Electoral Officer in the state by today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kartavya-bhavan-common-central-secretariat-central-vistas-no-cabin-no-cry-cabin-office-bureaucrats-new-delhi-2767218-2025-08-07",
      "headline": "Open office, closed minds? Why babus feel exposed in Kartavya BhavanPrime Minister Narendra Modi inaugurated the Kartavya Bhavan-3, which will house several ministries of the Central government. However, top Central government officers have written to the PMO over the lack of private cabins in the building. They say the open-seating arrangement compromises confidentiality, affects efficiency and is demoralising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/dharali-cloudburst-why-uttarakhand-faces-natures-fury-so-frequently-2767727-2025-08-07",
      "headline": "Dharali cloudburst: Why Uttarakhand faces nature's fury so frequentlyThe devastation in Dharali village near Gangotri is yet another wake-up call for the Himalayan state serially afflicted by natural calamities since the 2013 Kedarnath floods"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/trumping-the-india-us-strategic-partnership-2767846-2025-08-07",
      "headline": "Trumping the India-US strategic partnershipPresident Trump's tariff regime threatens the edifice of the India-US strategic partnership, but the relationship with Pakistan is causing the most consternation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhis-3-state-fake-voter-charge-election-commission-of-india-the-curious-case-of-aditya-srivastava-2767979-2025-08-07",
      "headline": "Rahul Gandhi's 3-state fake voter charge: The curious case of Aditya SrivastavaRahul Gandhi had presented the EPIC number of a person named Aditya Srivastava from Lucknow claiming that in addition to Karnataka, he was also a voter in UP. He even displayed his face, photograph, and EPIC number during the presentation. Not only that, he also claimed that this person appeared on the voter list of Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-satellite-images-reveal-scale-of-uttarkashi-flash-flood-devastation-2767999-2025-08-07",
      "headline": "Isro satellite images reveal scale of Uttarkashi flash flood devastationThe most prominent finding from ISRO's rapid assessment is the clear indication of a sudden flash flood event, visible through the dramatic widening of stream channels and significant changes in river morphology. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/chatgpt-5-now-available-sam-altman-says-using-it-is-like-talking-to-expert-who-knows-everything-2768008-2025-08-07",
      "headline": "ChatGPT 5 is here, Sam Altman says it is like talking to expert who knows everythingOpenAI on Thursday night introduced ChatGPT 5, or rather GPT-5, which is its next-generation AI system. The company says that ChatGPT 5 brings PhD-level knowledge in every subject to everyone. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/freshwater-drop-indus-river-delta-pakistan-displaces-one-million-indus-water-treaty-pause-india-2767863-2025-08-07",
      "headline": "Pak's Indus delta sees 80% dip in freshwater; 1.2M people displacedThe Indus delta in Pakistan is drowning in seawater due to decades of mismanagement, climate change, and hydropower projects. Freshwater supply has dipped by 80% and 1.2 million people have been displaced as salinity hits farming and fisheries. India's suspension of the Indus Waters Treaty further complicates recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uttarkashi-flash-flood-where-ram-teri-ganga-maili-lived-silence-now-falls-over-a-shattered-valley-2767984-2025-08-07",
      "headline": "Where 'Ram Teri Ganga Maili' lived, silence now falls over a shattered valleyThe same landscapes that drew director Raj Kapoor to create a cinematic ode to purity, love, and nature now lie devastated in the aftermath of a deadly flash flood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/breast-milk-ice-cream-flavour-is-being-sold-in-the-us-here-is-what-it-contains-ingredient-list-2767943-2025-08-07",
      "headline": "Breast milk-flavoured ice cream is being sold in the US. Here's what it containsThough the ice cream mimics the flavour of human breast milk, it does not actually contain any."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-colleges-may-face-financial-blow-as-visa-delays-disrupt-indian-students-enrolment-foreign-students-in-america-social-media-vetting-donald-trump-2767848-2025-08-07",
      "headline": "Visa delays to Indian students may push US colleges into financial crisisA massive backlog in student visa processing threatens US university enrolments this fall, with Indian student numbers potentially dropping by up to 80%. Experts warn the disruption could cost campuses $2.6 billion in lost tuition fee. With Indian students contributing $9 billion annually to the US economy, the delays risk university finances, STEM research, and US–India academic collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/sunburn-festival-2025-in-mumbai-not-goa-venue-tickets-artists-2767843-2025-08-07",
      "headline": "Why Sunburn Festival 2025 will drop beats in MumbaiRecognised as Asia's biggest music festival, Sunburn is gearing up to drop the beat this December. But this time, it's stepping out of Goa and heading straight to the city that never sleeps, Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/tariff-war-did-modi-government-misread-trump-20-democratic-newsroom-debates-2767936-2025-08-07",
      "headline": "Tariff war: Did Modi government misread Trump 2.0? Democratic Newsroom debatesIn this edition of the Democratic Newsroom, the focus is on US President Donald Trump's tariff threats against India for purchasing Russian oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/trump-tariffs-country-list-rates-2767683-2025-08-07",
      "headline": "Over 90 countries affected by Trump's tariffs — See full list hereFrom allies to rivals, over 90 countries faced tariffs during Donald Trump's presidency. Here's a detailed look at which nations were impacted, how much duty was imposed, and what it meant for global trade dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/five-takeaways-from-rahul-gandhis-atom-bomb-proof-of-vote-chori-2767958-2025-08-07",
      "headline": "Five takeaways from Rahul Gandhi's \"atom bomb proof of vote chori\"The Congress leader detonates his promised \"atom bomb,\" alleging massive voter roll fraud. At minimum, the evidence demands urgent electoral roll cleanup; at worst, it signals systematic subversion of India's democratic process"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/is-pip-the-new-pink-slip-for-it-companies-experts-on-silent-exit-door-trend-2767673-2025-08-07",
      "headline": "Is PIP the new pink slip for IT companies? Experts on 'silent exit door' trendWhen performance improvement plans (PIP) in organisations become sudden ultimatums after months of silence, they risk being seen as punishment rather than support. But what happens when this perception is already rooted in an organisation's culture? A deeper look reveals why timing, clarity, and intent matter more than policy. Behind closed cabins and templated HR emails, the PIP has quietly changed shape.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-at-50-making-of-gabbar-singh-bollywood-greatest-villain-amjad-khan-290-07-08-2025",
      "headline": "Sholay@50: The Making of Gabbar, Bollywood's Greatest VillainWhat made Gabbar Singh the greatest villain in Bollywood history? It wasn't just Amjad's performance, though his raw intensity was undeniable. It was the magic of Salim-Javed's writing, Sippy's vision, and Amjad's ability to transcend the archetype of the Bollywood villain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-pm-modi-seeks-support-for-recognition-of-keeladis-antiquity-2767970-2025-08-07",
      "headline": "Kamal Haasan meets PM Modi, seeks support for recognition of Keeladi's antiquityActor and Rajya Sabha MP, Kamal Haasan met Prime Minister Narendra Modi to seek expedited recognition of Keeladi's antiquity. He highlighted the need to promote Tamil civilisation and language on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ib-ministry-notice-khalid-ka-shivaji-marathi-film-controversy-maratha-king-2767952-2025-08-07",
      "headline": "Centre issues notice to Marathi film 'Khalid Ka Shivaji' makers amid ban callsThe I&B ministry has issued a notice to the makers of the Marathi film Khalid Ka Shivaji following protests over the secular portrayal of Chhatrapati Shivaji Maharaj in the movie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/thursday-murder-club-trailer-netflix-eteran-sleuths-lead-probe-mysterious-death-2767921-2025-08-07",
      "headline": "The Thursday Murder Club trailer: Veteran sleuths lead the probe on mysterious deathNetflix released the trailer for The Thursday Murder Club, a mystery film based on Richard Osman's bestselling novel. The story follows four retirees who solve cold cases, leading to a thrilling murder investigation on their doorstep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-saurabh-shukla-teases-courtroom-chaos-jollys-akshay-kumar-arshad-warsi-2767947-2025-08-07",
      "headline": "Jolly LLB 3: Saurabh Shukla teases courtroom chaos with two JollysGet ready for chaos as 'Jolly LLB 3' returns with Akshay Kumar and Arshad Warsi, alongside Saurabh Shukla as Judge Tripathi. The teaser will release on August 12, "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-suspends-haider-ali-uk-police-investigation-2768021-2025-08-07",
      "headline": "Pakistan Cricket Board suspends Haider Ali amid UK criminal investigation: ReportThe Pakistan Cricket Board (PCB) has provisionally suspended cricketer Haider Ali after it emerged that the 24-year-old batter is under criminal investigation by Greater Manchester Police in the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grandmasters-2025-arjun-erigaisi-dominant-win-sahrin-loses-2768018-2025-08-07",
      "headline": "Chennai Grandmasters 2025: Erigaisi takes dominant win, Keymer downs SarinArjun Erigaisi kicked off his Chennai Grandmasters campaign with a dominant win over Awonder Liang, while Vincent Keymer stunned Nihal Sarin in the opening round of this high-stakes tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-predicts-australia-5-0-ashes-whitewash-england-2025-26-2768012-2025-08-07",
      "headline": "Ashes 2025: Glenn McGrath backs Australia to whitewash England 5-0Legendary pacer Glenn McGrath predicts a 5-0 Ashes whitewash for Australia in the 2025–26 series. McGrath's confidence stems from Australia's strong bowling lineup and favourable home conditions, posing a tough challenge for England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-emotional-post-son-custody-battle-cricket-protest-2767983-2025-08-07",
      "headline": "Shikhar Dhawan pens emotional post for son Zoraver during WCL stintIn a heartfelt post, Shikhar Dhawan opened up about his son Zoraver, offering a rare glimpse into a deeply personal side of his life. Sharing a series of previously unseen photographs, the cricketer reflected on fatherhood, separation, and the small moments that continue to linger long after they've passed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-zimbabwe-2nd-test-day-1-report-brendon-taylor-return-2767966-2025-08-07",
      "headline": "2nd Test: Henry eclipses Taylor's return as New Zealand take control on Day 1Matt Henry continued his outstanding form with another five-wicket haul as New Zealand took firm control of the second Test in Bulawayo, bowling Zimbabwe out for 125 and reaching 174 for 1 in reply by stumps on the opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-dhruv-jurel-captain-central-zone-karun-nair-left-out-2767968-2025-08-07",
      "headline": "Duleep Trophy: Jurel to lead Central Zone, Karun left out amid Test returnDhruv Jurel is set to lead Central Zone in the upcoming Duleep Trophy campaign. The spin-bowling unit will have Kuldeep Yadav leading the line alongside Harsh Dubey and Manav Suthar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wrestling-federation-of-india-suspend-11-athletes-fake-birth-certificates-age-fraud-2767962-2025-08-07",
      "headline": "WFI suspend 11 athletes for submitting fake birth certificatesThe Wrestling Federation of India have suspended 11 athletes for submitting fake certificates. The decision comes after the MCD cross-checked the certificates forwarded by WFI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-marc-andre-ter-stegen-captaincy-dispute-medical-report-financial-issues-2767956-2025-08-07",
      "headline": "Barcelona strips Ter Stegen of captaincy over medical report disputeBarcelona have temporarily stripped veteran goalkeeper Marc-André ter Stegen of the captaincy following a dispute over his refusal to sign a medical report related to his recent back surgery, further highlighting the club's ongoing financial and squad registration issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendan-taylor-return-drug-use-zimbabwe-vs-new-zealand-2767950-2025-08-07",
      "headline": "Back after drug rehabilitation, Taylor top-scores for Zimbabwe vs NZBrendan Taylor made a resilient return to international cricket after a long ban. His unbeaten innings showed signs of his previous resolve as Zimbabwe crashed against New Zealand bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2025-full-list-of-nominees-ousmane-dembele-lamine-yamal-raphinha-2767946-2025-08-07",
      "headline": "From Ousmane Dembele to Lamine Yamal: Ballon d'Or 2025 full list of nomineesThe top 30 nominees have been unveiled for the Ballon d'Or 2025. Some of the obvious names have been included but there are some interesting picks as well which will leave you wondering as to why they are there. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/viktor-axelsen-withdraws-bwf-world-championships-injury-rehab-2767937-2025-08-07",
      "headline": "Olympic champion Viktor Axelsen withdraws from World Championships due to injuryTwo-time Olympic champion Viktor Axelsen has withdrawn from the BWF World Championships due to injury. The Danish shuttler underwent back surgery in April. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/wrestling-federation-of-india-suspend-11-athletes-fake-birth-certificates-age-fraud-2767962-2025-08-07",
      "headline": "WFI suspend 11 athletes for submitting fake birth certificatesThe Wrestling Federation of India have suspended 11 athletes for submitting fake certificates. The decision comes after the MCD cross-checked the certificates forwarded by WFI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-marc-andre-ter-stegen-captaincy-dispute-medical-report-financial-issues-2767956-2025-08-07",
      "headline": "Barcelona strips Ter Stegen of captaincy over medical report disputeBarcelona have temporarily stripped veteran goalkeeper Marc-André ter Stegen of the captaincy following a dispute over his refusal to sign a medical report related to his recent back surgery, further highlighting the club's ongoing financial and squad registration issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendan-taylor-return-drug-use-zimbabwe-vs-new-zealand-2767950-2025-08-07",
      "headline": "Back after drug rehabilitation, Taylor top-scores for Zimbabwe vs NZBrendan Taylor made a resilient return to international cricket after a long ban. His unbeaten innings showed signs of his previous resolve as Zimbabwe crashed against New Zealand bowling attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2025-full-list-of-nominees-ousmane-dembele-lamine-yamal-raphinha-2767946-2025-08-07",
      "headline": "From Ousmane Dembele to Lamine Yamal: Ballon d'Or 2025 full list of nomineesThe top 30 nominees have been unveiled for the Ballon d'Or 2025. Some of the obvious names have been included but there are some interesting picks as well which will leave you wondering as to why they are there. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/viktor-axelsen-withdraws-bwf-world-championships-injury-rehab-2767937-2025-08-07",
      "headline": "Olympic champion Viktor Axelsen withdraws from World Championships due to injuryTwo-time Olympic champion Viktor Axelsen has withdrawn from the BWF World Championships due to injury. The Danish shuttler underwent back surgery in April. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}